Rare MUST
I'll reprint the discussion on Twitter.

[*** Chikara]
[Why are no businesses born from business contests? - Tokoroten - Medium https://medium.com/@tokoroten/%E3%81%AA%E3%81%9C%E3%83%93%E3%82%B8%E3%83%8D%E3%82%B9%E3%82%B3 %E3%83%B3%E3%83%86%E3%82%B9%E3%83%88%E3%81%8B%E3%82%89%E3%83%93%E3%82%B8%E3%83%8D%E3%82%B9%E3%81%8C%E7%94%9F%E3%81%BE%E3%82%8C%E3 81%AA%E3%81%84%E3%81%AE%E3%81%8B-54334d387de2] [Shinta Nakayama].

>Will is "what I want to do," which remains the same.
>Can is also a word for "what I can do".
>Only Must is a little more difficult, and this is like "what is required by the company or society".

>I often feel that there are many people in the world who cannot separate Will, Can, and Must, and I often feel that it is a waste.
>If they are of a certain age, we can have a discussion about this issue and hope that they will understand in the process. However, with younger children, I am afraid that it will inevitably become a mounting issue, and I will end up denting Will, Can, Must by imposing it, which bothers me every time I have such an opportunity.

[*** Reprinting his own remarks from Twitter].
https://twitter.com/nishio/status/859003877223419904

 I think it is better to ignore "will" and "must" for those who are not yet working, and just listen to their "will". It is difficult for working people because they have to think about "must" as well....

 I'm starting to wonder if "working people have to think MUST too" (which is also MUST) is really true, because if someone claims it's false, I can't think of any evidence to debunk it, so I'm starting to get worried.

 When we talk about will and can, we don't think about information that belongs to the individual by default and applies to most people, like "I want to live" or "I can carry a baggage", but only must is "what society wants anyone to do", not "what society wants from that person" imbalance Isn't that unbalanced?
  Just as "will" and "can" have both low and high scarcity, "must" has both low scarcity "social problems" and high scarcity "I have to be this person! As a mechanism of capitalist society, it is more profitable to have a high scarcity "will" than a low scarcity "can. A high scarcity will produces a high scarcity can, which in turn leads to a high scarcity must, which ultimately becomes a source of high profit.

 One possible counterargument is "Social problems are less scarce, but the market is big, so the profit must be big, too." However, no matter how big the market is, it will not lead to profit unless the market share is taken, and to take the market share, it must be "This person must be this person! It has to be this person/this product! is necessary to gain market share, so scarcity is important.

 The reason why adults do not talk about the scarcity of MUST is because most adults do not have scarce MUST and are afraid that one day society will say, "You are not needed," and they do not want to face that inconvenient fact. So they use social issues that are widely known to be necessary as a source of reassurance.
  Just like "developing software that may or may not sell" or "starting a business that may or may not have customers," unless you have a very strong sense of [self-affirmation], if you face the fact that you MUST, your anxiety will outweigh your affirmation and your spirit will be worn out.

 The cycle of WILL and CAN has improved my ability in the computer science area, but the ability to know MUST (society's needs) and match it with my CAN (technology) was another area of CAN. You can't acquire the "ability to match can and must" without WILL to learn it.
  I finally realized this many years after becoming a working adult, and this is the main body of the opening line, "It is difficult because working adults have to think about must as well," and the reason I draw Venn diagrams of will, can, and must and explain them to new working adults is probably because many people want them to realize this.

[*** Q&A].
>What do you mean by "must" scarcity? I read the article earlier and thought that "will" and "can" mean individual ability, while "must" means a demand from society.
https://twitter.com/shunichi_arai/status/859055552244047872
A: Just as there are two types of individual wills: "I want to live" for many people and "I want to build my own OS" for only a few people, and "I can carry 5 kg" for many people and "I can write an OS" for only a few people, there are two types of social musts: those for many people and those for only a few people. There are two types of social musts: those for many people and those for only a few.

>Bloodline, kinship, inheritance of shares, gateway, and physical (physical disability) came to mind. I wonder if this is what a highly rare Must looks like.
https://twitter.com/tokoroten/status/859054093796425729
A: The example that came to mind for me was "there are people who will pay 10,000 yen to shake hands with a very popular idol, but no one will pay 10,000 yen to shake my hand. Even if there CAN be a "handshake" and WILL (but won't) be a "handshake", I have no chance of making money from shaking hands with me.
In terms of kinship, it's like "default expectations from the locals due to being the son of a famous politician". Physical characteristics include disabilities, but also "if you are a woman, even if you like sumo and you are strong, you cannot become a sumo wrestler" (I don't know if this is true or not).

Supplemental:.
 The basic premise assumes that "the demands of society, and the opportunity to earn money by fulfilling them, are not given equally. I consider this an observational fact.

[** other feedback].
	https://www.facebook.com/harajune/posts/10155358060323217?pnref=story
 https://www.facebook.com/nishiohirokazu/posts/10212009014517222?comment_id=10212009885859005
 	Proposal to describe must as "being told 'thank you'".

#Rare

2017-09-20 After reading it again after some time, I felt it was more appropriate to say "[individual specificity]([genus]) is high" rather than "high scarcity".