Brest's Tools
This is a list I wrote when I was consulted about what tools would be good to have when holding a brainstorming session with 25 participants

	Large [Post-it] (e.g. 75mm x 75mm)
		To be written and pasted on a wall to be shared by several people
  Number of pieces to be distributed per person
  	Do not suppress opinions because others have them. Remove hurdles to expressing opinions whenever possible.
  If you have a choice of colors, you should use a single color (yellow).
  If you can't choose, you can mix colors, but if you have a mix of people who make sense of the color coding and those who don't, it puts a strain on your thinking. Discussion is necessary beforehand.
  If color coding is to have meaning, each person must be able to use all the colors without having to wait for all the colors to be available.
 Large post-it pens
 	Need a thicker pen, as ballpoint pens cannot be read away from the wall when it is stretched out.
  For example, here's one like this: https://www.amazon.co.jp/dp/B001MT8802/
  You could use a makie, but it's oil-based and you run the risk of it smearing on your desk.
  At least one black should go to each person. Red and blue are better if there is room.
 Small post-its (e.g. 38mm x 50mm)
 	Assumed size for individual use at hand
  	The 75x75 for the wall eats up too much space for use at hand.
   When lined up, 25 sheets can be put on A4 print paper.
   1人2個(200枚)
 	http://www.mmm.co.jp/office/post_it/list01/653rp.html
	Ballpoint pen for writing at hand
	 For example, here's one like this: https://www.amazon.co.jp/dp/B001C09BS4/
  Each person should bring a pen that he or she is comfortable with, but there may be cases where ink runs out or people want to share pens, so it is a good idea to have enough pens for everyone.
 1-3 100-sheet packs of A4 print paper
 	As a rich white paper.

Other things that may be nice to have but not necessary
 Anywhere Whiteboard Sheet https://www.amazon.co.jp/dp/B004BEJ9MG
 whiteboard marker
 	Don't trust them even if they say they are provided at the venue, they may be out of ink.
	粘土
 (corrugated) cardboard
 Lego bricks
 scissors
 packing tape
 masking tape
 vinyl strap
 splittable (wood) chopsticks
 竹串
	Tape measure (for measuring length)
 Cutter knife, cutter mat
 Colored pencils with many colors
 double-sided tape
 Aron Alpha
