Suggestions for using Scrapbox more for reviewing books
(Copied and pasted from a private project for review; 2017-05-18)
I'm struggling with this, so I followed Scrapbox's best practices and started with a bulleted list.

	Current Book Reviews
 	process
			Nishio will put the manuscript into "readable form".
 	 Reviewer reads it and returns a review by email or other means.
  	Nishio will brush up on the manuscript based on review comments
  Easy for reviewers to do because it becomes a "read the book and give your opinion" activity
  We can assume that the reviewer's opinion is independent for Nishio
  	You get information like "several people say something close" or "two people say the opposite."
  Imitating the methodology of Hiroshi Yuki, who has a reputation and track record of writing books that are easy to understand.

	Proposal to utilize Scrapbox
 	process
  	Put fragments into Scrapbox before they are in 'readable form' by Nishio.
   Nishio + reviewer directly tease (divergent process)
   Nishio will run the writing process (convergence process) at an appropriate time and make it into a "readable" form as a book.
   Then the above review process
		Divergent processes risk sucking up infinite time (the kind of thing that gets out of control).
		I suspect that reviewers are not so interested in "figuring out the structure of my book".
		The proposed table of contents is already structured at the stage of planning the book in the first place.
  	There are various parts of my proposal that I cut out for crying out loud.
   If the divergence phase runs again now, the majority of it will not fit in the frame.
				But you can publish a separate volume separately or make it available for online reading.
    Some suggested adding it as a column.
		Reviewers are required to structure information fragments in a multi-person, remote, time-asynchronous environment.
  	It's hard to do this alone.
   I teach people who are not familiar with KJ method not to do KJ method with a large number of people at once.
   	Fragments written by others are difficult to understand, and the suffering derives from that and makes you dislike the project itself and the KJ method itself.
    When I see examples of people using Scrapbox, it's like they comment on the spot that if they don't know, they don't know.
		Something interesting might happen.
			Serendipity cannot be predicted in advance.
		The work of putting the fragments in simply increases the burden on Nishio.
  	The pace of writing one chapter in three weeks was set without taking into account the cost of responding to reviews....
   The total burden is unreadable.
   Maybe it's important to "not try to do too much at the beginning."
   	For example, "What does the author think [intellectual production] is in the first place?" or something like that, which I didn't share with the reviewers because I didn't have it all together.
		There is a risk that readers will say "[a collection of various information rather than a well-structured knowledge https://www.amazon.co.jp/review/RD5PSHKGPFMSK/ref=cm_cr_rdp_perm?ie=UTF8&ASIN=B00TIK9PL8]". There is a risk that readers will say "[a collection of information rather than a well-organized body of knowledge].
  	Information needs to be "organized" for the book.
  [/nishio/Wikiモード]

If you were to co-edit, how would you do it?
	Have reviewers create icons: create a page for your ID like [nishio
	Use bullet points as a tree bulletin board
  Distinguish between the ground text and your opinion by using Ctrl-i to add icons to the text.
  	こんな風に[nishio.icon]
	Do not co-edit the "Chapter X-" page.
 	For those who want to read and review it as a "normal manuscript" written by one author.
 Other pages can be freely edited.
  Especially like a tree board, writing comments, questions, etc.
	Reviewers can create a new page if they want to.
 	You may write a question in the title and leave the body empty.
