ScrapboxDrinkup
2017-05-26 [Cybozu] at Nihonbashi office

[*** notes organized after completion].
	1/4 of the members are replaced at the university, so a system to encourage externalization of knowledge is needed
 To reduce the cost of output
		Keep it in outline form so others can easily add to it.
 		State like a tree board
　The message is not structured from the beginning.
  	Write it in outline for now, and others will ask questions.
 		Questions encourage verbalization.
		It is important to be able to write in a simple way
 		High learning costs prevent new people from outputting.
	 A system that does not break the link even if the title is modified later.
			The initial thought of "I have to give it a proper title" makes me sit up and take notice.
 If you create your own page and put a photo on it, you can use Ctrl-i to add an icon [nishio.icon].
		Recommended for collaborative editing by multiple people
 Better expressed in links between pages than relying on classification by hashtags
 	I wrote in [Scrapbox and Mind Maps].
	One private project.
	Make the title interesting; words alone are indistinguishable from a dictionary description.
		This and other areas are summarized in [Scrapbox Best Practices].
 In a multi-person editing environment, you can also set up notifications to go to Slack when you write.
 Title is date, tags are year, month, day of the week
 	By writing the day of the week, you'll notice that it's been a week and you haven't started.
 lecture notes
 	I'm trying to open two so that I can edit the story and the word description at the same time.
  Don't make a page of lecture names, different lectures may touch on the same concept, write in pieces.
   Tag the name of the lecture at the end for review before the exam
 Scrapbox is a purifier of ideas
  See related pages for simplicity.
  The best time to read back is when it comes naturally to your eyes.

 You may create a page with just the title.
 	Add a "later" tag
  	The "Later" page shows that "Later" is piling up.
  Whenever I think of something, someone writes it down.
  When sorted by "modified" or "visited", unnecessary items are sunk, so you can write as much as you like without worrying about them.
  Hashtags are good for reading back, in-sentence links are good at first.
 Smaller cards increase listability.

	Separate browsers for public and private projects.
	 I'm afraid to write in the public section because it's supposed to be private.
 I use Chrome on my iPhone.
 Safari is good for scaling when projecting.

 Blog
 	Title is "4770-170519 Title."
  	Sequential number - Date - Title Style
  I was going to draft it at first, but I'm having trouble changing it to markdown.
  I thought it would be nice to have public/private on every page, but it got tedious and everything was public.
  	Pinned the writing
   	[nishio.icon]Surprising operation, what is the first place a visitor to your blog should look?
    	If you look at the pinning, do you see any confusion in the drafts?
				But if search inflows are the main source of traffic, then pinning is the way to go.

	You need to accumulate a certain amount before you find it very useful.
 Need an organizational culture that allows everyone to share information in a flat manner
 Suspicion that a facilitator like Dr. Masui is needed.
		Scrapbox Master
		of a scrum master kind of position.
	 Lower the cost of writing anyway.
 I use it more as a knowledge repository than a communication tool.
 	I've seen others use it as a communication tool.
  	[nishio.icon]I was looking at it this time and thought there are a lot of cases where it's used like a tree bulletin board.
   [nishio.icon] [Wikiモード]の話を後で書く
 Many people really want a hierarchical structure but don't want to put it on, but we haven't been able to provide an alternative.
 	[nishio.icon]Isn't the problem that few machines learn how to structure information in a non-hierarchical way? Just do [the KJ method] in elementary school!

 IMS The more you write down ideas and forget them, the more new ones you get.
 子育てにScrapbox
 	[nishio.icon]It would be good to give kids a place to have an output.

	Write and sell books on Scrapbox
	 Can be freely edited by the purchasing user
	 I hope it's linked Scrapbox-like.
 		That's true, but I'm thinking that the phase of serializing the output in the form of a paper book is necessary to get on board with the current commercial publishing.
  	The book writing process is too waterfall development and not good enough, so I'm inclined to go agile.
 	Wiki-like books are good for [Incremental Reading], so if excerpt UserScript is introduced, it would be great to read while editing on Scrapbox!
		 Can we sell the JSON file to the purchasing user?

	The one that lets you move places.
 	[nishio.icon]You can do the KJ method.
 	[nishio.icon]But one page in Scrapbox is more granular than one sticky in the KJ method. I wonder if it will become smaller when I become more familiar with Scrapbox.
 I was cleaning up my room and Mann was reading it, and then it happened.
	[I don't know if this is something that should be done in Scrapbox, but it would be interesting to be able to arrange some of the pages of my choice, not all, on top of the uploaded images.

	Movies Tagged with the year and month you saw them and the movie theater so you can see what you saw at that time of year or in the same theater.
 	[nishio.icon]Various people do it to summarize on a monthly basis, I'll copy them too.

	Create a Template
	 賛否両論
 	Every copy and paste is a psychological barrier.
 	I'd like to put in the date, but it's too much trouble to type it in.
 		[nishio.icon]I would like to include the date too. It seems important to put it in the same format.



Raw data under ----- -----

[*** shokai-san]
	抜書きUserScript便利
 	I would love to have [Nishio.icon][SuperMemo]'s [Incremental Reading], same concept. If you have it, you can do Incremental Reading with Scrapbox. (SuperMemo is famous but the software quality is not so good...)
	1/4 of the members change every year at the university.
 	[nishio.icon]Knowledge is lost if it is stocked within individuals. We need a mechanism to encourage the externalization of knowledge.
	Create your own page and use Ctrl-i to enter the icon.
 	[nishio.icon]I see, so this is how you do it.
	Don't write a lot on one page.
	Outlining makes it easier for others to add to it.
	What you want to say is not structured from the beginning, just gurgling in an outline for now, and others will ask questions.
 	[nishio.icon]Questions encourage verbalization.
	Double brackets make it bigger.
	Simple Writing
 	[nishio.icon]If the cost of learning is high, new people will not output.
 A system that does not break the link even if the title is modified later.
 The automatic last editorship would change with typo corrections and such.
 It would be interesting to create a network of links between pages.
 Time passes differently for different people.
 	People who aren't sticking around.
  I know what's hot right now when I come back after 3 months, I want to know what I used to write on my page that got a response.
 Allow UNDO for everything.
 API: We know from experiments that an API that creates a page when POSTed is not good enough. Please wait for me to make a great one.
 I don't want to put a comment box at the end of the page.
 	why?
 Ability to make a portion of a private project a public page
 	[nishio.icon]楽しみ！
 There is a project called FORUM
 Better expressed in links between pages than relying on classification by hashtags
 	I don't know the latitude and longitude of this venue, I know how to get there from the station.
 Notation distortion problem: Case is the same, and if a page is created, it will appear in the completion candidates.
	Individual and group use
 	I write to the group for consultation, seeds of ideas, and things I want others to expand on.
  But everything seems so.
  Copying between groups

[*** Mr. daiiz].
	Is one private project enough?
 	Don't worry, you can write everything down together and still find it surprisingly well.
  It's interesting to see the connection later on.
  [nishio.icon]I'll combine them later.
 group note
 	友達の雑多な情報共有場所
  Notifications go to Slack when you write.
  	[nishio.icon]これ重要そう
  Write whatever comes to mind.
 	That's an increase of about 200 pages in two months.
 Public Projects
 	More than a memo, less than an article
  Unlike a blog, you don't think about placement, bullet points are all you have.
  	As [nishio.icon]shokai said, "in outline" seems important.
  I want to disclose everything except what needs to be kept secret.
  	But there's a copyright issue.
   [nishio.icon]全く共感
 活用例
 	When planning a trip together, everyone has a different idea of where they want to start.
  Support for environment construction
  	Unlike chat rooms, I don't worry about quantity.
   Take and share screenshots
  Idea Memo
  	Make the title interesting; words alone are indistinguishable from a dictionary description.
  		[nishio.icon]大事そう！
   ideabot as a tag, change to ideabotsu if you think it's not working.
  TODO
  	Write a bulleted list of what you have done and what you would like to do, and [link] keywords.
   Browser extension to open Scrapbox diary pages
   	[nishio.icon]便利そう
   Title is date, tags are year, month, day of the week
   	By writing the day of the week, you'll notice that it's been a week and you haven't started.
   	[nishio.icon]いいね
  lecture notes
  	I'm trying to open two so that I can edit the story and the word description at the same time.
   Don't make a page of lecture names, different lectures may touch on the same concept, write in pieces.
   Tag the name of the lecture at the end for review before the exam
  Scrapboxの記法が手に馴染む
  	Convert to Markdown with bookmarklet
   [nishio.icon]I want that! I can use Scrapbox to write the manuscript I'm working on!
 Organizing Ideas
 	I thought handwritten was best, but it's hard to coordinate across one book.
  	[nishio.icon]わかるー
  Copy paper operation failure
  	[nishio.icon]同じ体験をｗ
  See related pages for simplicity.
  The best time to read back is when it comes naturally to your eyes.
  Scrapbox is a purifier of ideas
 You may create a page with just the title.
 	Later tag
  Not when you think of it, but someone else will write it.
  Sorting by modified, visited will sink the ones you don't want.
  Hashtags are good for reading back and in-sentence links.
 Smaller cards increase listability.

[*** 塩沢先生]
	shio
	Separate browsers for public and private projects.
 I'm afraid to write in the public section because it's supposed to be private.
 I use Chrome on my iPhone.
 Safari is good for scaling when projecting.
 I've been using various services, but moved entirely to Scrapbox in April.
 Blog
 	4770-170519 Title.
  	What is [nishio.icon]4770? →It looks like a sequential ID.
  I was going to draft it at first, but I'm having trouble changing it to markdown.
  I thought it would be nice to have public/private on every page, but it got tedious and everything was public.
  	Pinned the writing
   	[nishio.icon]Surprising operation, what is the first place a visitor to your blog should look? If they see pinning, won't they be confused by the drafts?
		After pouring through 4300 pages for 12 years, I'm impressed.
  		[nishio.icon]Part of the reason it looks good is because it's a photo blog, my Twitter statements were not good enough to pour over.
 Educational use in seminars and classes
		All the answers and arguments are in Scrapbox, migrated from Workflowy.
			Highly flexible and connected by links.
   Workflowy is constrained by the tree structure, so it has to be connected somewhere.
   	From [nishio.icon]tree to [rhizome
   	[nishio.icon]For now I'll put all my public stuff in one place, I'm starting to feel like it's not a good idea to have separate projects.
 	One person's answer is commented on by another.
  	Outline mode is super utilized.
  When I say in class, "Let's write an example sentence using ~," everyone writes it in bullet points on one page.
  	[nishio.icon]Co-editing is being used unexpectedly, I thought I was supposed to write on individual pages.
 Class, not lecture, PE, coach. #Class is physical education
 	Why don't you just use a video for one-sided lectures?
  I wish to bestow my karma
  Physical education is not only for the teacher to exercise, but for everyone.
	What is Education?
 	Students are nurtured by students teaching, not by teachers teaching and nurturing.
	Team projects are better than individual projects
 Personal projects should be combined into one.
 I want a constant character count indicator, when writing answers.
	I'm working on a translation project in Scrapbox.
 	Maybe [nishio.icon]I'll translate my book with Scrapbox.
  [nishio.icon]I'm currently running a book manuscript review site on Scrapbox, but I was wondering if I could make it editable and operational?
	I'm sad to see so much of what I wrote disappear.
		I wish [nishio.icon] would export to JSON once a day.
 I want reverse order for sorting.
	性善説運用

[*** Pizza LT]

[rakusai]さん
	There is a healthy debate going on in Masuiken.
	You need to accumulate a certain amount before you find it very useful.
 	I'm worried about writing a lot without the [nishio.icon] backup feature.
 Need an organizational culture that allows everyone to share information in a flat manner
 	The culture of erasing information about the discussion process when it reaches a conclusion (><
 階層的整理思考の壁
 	You say [nishio.icon], but give up on classification and do it in chronological order, or the KJ method.
 Suspicion that a facilitator like Dr. Masui is needed.
 	[nishio.icon] [https://scrapbox.io/cybozu-make-club/] was fixed by Dr. Masui, but it doesn't ring a bell.
 I wonder if I should buy the [nishio.icon] on-prem version and do my own automatic backups.
	Beaver, mascot character, putting more and more things on his back that have not yet taken shape.

[htomine]さん
	Scrapbox on remote work [/remote].
 I don't want to think about hierarchy.
 Lower the cost of writing anyway, I can look for a good one later.
 I use it more as a knowledge repository than a communication tool.
 	I've seen others use it as a communication tool.
  	[nishio.icon]I was looking at it this time and thought there are a lot of cases where it's used like a tree bulletin board.
   [nishio.icon] [Wikiモード]の話を後で書く
 Many people really want a hierarchical structure but don't want to put it on, but we haven't been able to provide an alternative.
 	[nishio.icon]Isn't the problem that not enough machines learn how to structure information in a non-hierarchical way? Just do the KJ method in elementary school!

[Princess Dora].
	司法試験の準備をScrapboxに一元化
 I'm making a page to write down the information I commented on.
 	Use as chat and update notification, flow
 Handwritten and pasted on Gyazo
 	[nishio.icon]I wonder how easy it would be to take a picture and put it up.
  What do you mean by [tsuna.icon] what do you do?
  	[nishio.icon]How do you put up your photos? I don't really know how to do it, so I send the photos to myself by email, then drag and drop them on my PC and upload them.
	I would be happy if I could share my personal projects only with my teachers or make them public.

[jishihara]さん
	I want to use it at CoderDojo Chofu CoderDojo
 [/prog-exercise]
 IMS The more you write down ideas and forget them, the more new ones you get.
 I want to paste an image from my iPhone.
 子育てにScrapbox
 	[nishio.icon]It would be good to give kids a place to have an output.

[masui]さん
	Write and sell in Scrapbox
 Can be freely edited by the purchasing user
 	[nishio.icon]これは熱いｗｗ
 I hope it's linked Scrapbox-like.
 	[nishio.icon]That's true, but I was thinking that the phase of serializing the output in the form of a paper book is necessary to get on board with current commercial publishing.
  [nishio.icon]The process of writing books is too waterfall development and not good enough, so I have a desire to make it agile.
 [nishio.icon]Wiki-like books are suitable for Incrementnal Reading, so if excerpt UserScript is introduced, it will be very good to read while editing on Scrapbox.
 Can I sell JSON files to [nishio.icon] purchasing users?
  Yes [Toshiyuki Masui.icon].

[sushitecture]さん
	The one that lets you move places.
 	[nishio.icon]You can do the KJ method.
 	[nishio.icon]But one page in Scrapbox is more granular than one sticky in the KJ method. I wonder if it will become smaller when I become more familiar with Scrapbox.
 I was cleaning up my room and Mann was reading it, and then it happened.
	Arrange them on a map of Japan.
 	[nishio.icon]面白い
	[I don't know if this is something that should be done in Scrapbox, but it would be interesting to be able to arrange some of the pages of my choice, not all, on top of the uploaded images.

[pastak]
	Import various items into Scrapbox
 enex2sb
	Movies Tagged with the year and month you saw them and the movie theater so you can see what you saw at that time of year or in the same theater.
 	[nishio.icon]Various people do it to summarize on a monthly basis, I'll copy them too.

[kanata]
	Create a Template
 賛否両論
 Every copy and paste is a psychological barrier.
 I'd like to put in the date, but it's too much trouble to type it in.
 	[nishio.icon]I would like to include the date too. It seems important to put it in the same format.
 



	Other
 	I wonder if a separate project would be better for importing large amounts of data, or if that should be the same project.