Blind spot card with no picture yet
Of the [blind spot card] proposals, those that do not yet have a picture.
I'm not sure if I should write it all together or break it up into one page at a time, but I wrote it all together anyway.

1000: [Write then think].

Write it down and then think about it. If you didn't write it, you will forget it.
After the number 1000, it should be [a place for writing comfortably] even if no images are provided.

1001 -> [use yourself as part of yourself].

1002: [Shift the center of rotation].

TRIZ 1.
Cam.
Vibration. Vibration motor.

1003: [Innovation].

[Schumpeter's definition of innovation].

1004: [Pulse width modulation].

Pulse width modulation is a method of expressing real values using averages in the time direction of signal lines that can only express 0s and 1s.

1005: [fuzzy set].

1006: [円周率]

The ratio of the lengths of the perimeters of the circle and the square circumscribed by the circle is 0.79 : 1.
The ratio of the areas of the circle and the square circumscribed by the circle is 0.79 : 1.

Instead of this 0.79, we call pi 4 times this number, 3.14.

1007: [rank by zero].

The introduction of the [expressing the absence of] symbol allows for the efficient representation of large numbers.

1008: [確率共鳴]

If the sensor has a threshold for response, it cannot respond to minute signals. However, by adding noise to the signal line, it can probabilistically respond to signals below the threshold.
It can be viewed as a way to divert resolution in the time direction to resolution in the value direction.

1008: About that X [is there anything else?]

One of Clean Language's Five Basic Developing Questions. Tends to diverge.

1009: [What kind of X is that X?]

One of Clean Language's Five Basic Developing Questions. Tends to be detailed.

1010: [what does that X look like?]

One of Clean Language's Five Basic Developing Questions. It tends to make people metaphorize or identify the name of the metaphor.

1011: [Where is that X?]

One of Clean Language's Five Basic Developing Questions. "Where is it?" and "Where is it? By using this question in combination with "Where is it? By identifying the location, it is associated with [bodily sensation], and it encourages [metaphor] and [gesture] generation.

1012: [where does that X come from?]

One of the basic questions of clean language. This one is used because people don't want the "why" question to elicit self-justification.

1013: [Replace constant with function].

Can't we think of that constant as actually a "function that always takes a constant value"? Can't we solve the problem by extending it to a general function?
The application of Riemannian geometry, in which the curvature of space is not constant, to physics gave rise to Einstein's general theory of relativity.

1014: [Replace variables with random variables].

Does the variable really have to be deterministic?
The reason Newtonian mechanics, which is based on the naive idea that velocity and position can both be determined, does not seem to break down at first glance is that at familiar scales the variance of the random variables becomes negligibly small. The reason is that the probability of rice spilling from a bowl due to tunneling effect is negligibly small. If we had stuck to deterministic ideas on that familiar scale, quantum mechanics would never have been born.

For example, in protocols such as the CSMA protocol used in LANs, if a communication collides, it waits for a random time and retransmits the message.

See also [Random Choice Algorithm].

1015: [Euclidean distance to general distance].

Doesn't it have to be the Euclidean distance? However, if the distance from the origin is of little value and it is important that the vectors are similar in direction from the origin, it is inconvenient to use the Euclidean distance because the vectors with very different directions around the origin are judged to be close to each other. In such cases, the angle between them is used as the distance (see Cosine Similarity).

Cosine similarity corresponds to normalizing a vector onto a hypersphere of radius 1 and using the length of the arc between them. Such "projection onto another low-dimensional space and use the distance there" is often used. In principal component analysis, plotting and observing on the first and second axes is looking at the distance projected in two dimensions.

Conversely, the support vector machine uses a kernel trick to project to another higher-dimensional space and use the distance there.

The average assumes the existence of addition and scalar doubling, but generalized medians can be used in general distance spaces.

双曲空間の利用 https://papers.nips.cc/paper/2029-hyperbolic-self-organizing-maps-for-semantic-navigation.pdf

1016: [実数の離散化]

1017: [recalls dimensions being discarded].

If there is a wide variety of scales, they may actually be a projection of one higher-dimensional scale onto a lower dimension.
Indicators such as GC-contents and GC-skew in the base composition of a genome are the length of a four-dimensional measure of the rate of occurrence of the four base types in the genome, projected against an arbitrary straight line that is easy for humans to explain.

1018: [四元数]

You may have solved problems in high school that were difficult to solve in two-dimensional vector space by bringing the problem into the complex plane and using the fact that multiplication is a rotation. In the same way that a rotation in two-dimensional space can be expressed by multiplying complex numbers, a rotation in three-dimensional space can be expressed by multiplying quaternions.

1019: [Considering curved space].

In a plane of zero curvature or a higher dimensional space, if it is finite, it has an edge, and to eliminate the edge, it must extend to infinity. If you want a finite space, but do not want it to have an edge, you can use a sphere or a torus.

1020: [Does it have to be one?]

If there's no particular reason why it has to be one, maybe using more than one will solve the problem?

1021: [Try to pursue/abandon symmetry].

1022: [Explaining to others].

We have to pay attention again to what we take for granted in order to explain.

1023: [Reminds me of something I'm throwing away].

Analysis is basically about discarding what is uninteresting from a vast amount of information, leaving only what is interesting. If we pay attention to what is discarded by the analysis, rather than applying existing analysis methods uncritically, new ideas may emerge.
Take the simple analysis method of "taking an average" as an example. Data consisting of N samples is a point in N-dimensional space, and reducing it to a single value, the average, is an N-1 dimensional reduction. Rotating the data and reducing it to a root Nth of a point, we are only interested in the components along a particular axis. So what's the component that's being discarded in the direction perpendicular to that axis?

It is a higher moment in variance, in skewness, in kurtosis. Is this discarded information a pile of garbage or a treasure trove?

1024: [Consider the duality].

A geometric dual graph was defined for graphs on the plane. It is a graph in which a point is drawn in an area bounded by edges, and the points of adjacent areas are connected by edges. Abstract dual graphs are not limited to graphs on the plane, but are extended to general graphs. In this dual graph, closed paths and cut sets are dual.

In Euclidean space, there is one straight line passing through two points, but the intersection of two lines cannot be said to be one. Because there are cases where they are parallel. In projective space, a point and a line are duals. Focus on Exceptions Exceptions are not failures, they are opportunities.

1025: [create notation].

It defines a new notation so that the expression is easier to read or more beautiful to look at. Einstein's convention.

Conversely, forget the definition of notation and try to deviate by association from its appearance. Like trying to look at the derivative dx/dt as if it were a fraction and multiplying both sides by dt in the denominator. Logically incorrect, but useful if there is something to be gained. In fact, it was so useful that it became popularized under the name of Heaviside's operator method, and the mathematical support came later.

1026: [Treatment of nominal measures].

Embed a nominal measure into a vector space on {0,1}. Embed the nominal measure into the vector space on {0,1}. Reduce by 1 dimension after embedding. Think of it as a discrete distance space.

1027: [narrow search area].

Make it a width-first search. Trim branches early. Space division. Create a quotient space with some equivalence relation and search in it. Divide the space into zeros and non-zeros [identify non-zeros]. Binary representation of immovable point numbers, ignoring leading zeros.

1027: [note the average].

There are various types of averages, such as additive, geometric, and harmonic averages.
For example, suppose we want to find the average length of the shortest path between any two points in a graph (hereafter referred to as "average path length"). If the graph is not connected, then there is a pair of points where no path exists. If the length of the path between these two points is infinite, the average path length will also be infinite. If we take the "average of the reciprocal of the path length," we can obtain values in the range of 0 to 1 even for unconnected graphs, but the reciprocal of this value will not match the "average path length. Difference between additive and harmonic averaging.

For example, let's say you blur a photo taken with a digital camera using image retouching software. Blurring is a process of taking the average of surrounding pixel values, but blurred images do not resemble natural out-of-focus images. The reason is simple: the brightness between X and Y is much brighter than X+Y/2. (see Gamma Value) [Non-linear] transformations make additive averaging not appropriate.

The average can be taken anywhere between the minimum and maximum values by inserting the appropriate nonlinear function. The harmonic mean corresponds to a nonlinear function called the inverse, and the geometric mean corresponds to a nonlinear function called the logarithm.

For a given distribution A,B, "the mean of A is greater than the mean of B" does not mean that "the probability that a > b is greater than the probability that a < b for randomly selected samples a and b from A and B". In a simple example, A:{0,0,9},B:{1,1,1}. Efron's dice in an elegant example. As this example shows, the latter relationship is not an ordinal relationship. #Efron's dice.

1028: [value close to 0].

You think it is zero, but in fact it is just very small and may not be zero.
The time it took for light to get from here to there seemed to be zero, but it was not zero, just very small.

Position and momentum were conventionally considered scalars. This implicitly assumed that XY=YX. Transforming the equation, XY-YX=0. This is called "zero exchanger. In quantum mechanics, however, the exchanger between position and momentum is not zero. (about 1e-34 smaller)

Conversely, many problems are made easier by assuming that a value close to zero is zero. For example, "When x is sufficiently small, the term x^2 can be ignored. It is better to be able to calculate even if there is an error than to aim for exactness and not be able to calculate anything.

1029: [option value].

There is value in being able to choose.
For example, there is a bet that has a 1/3 chance of being +1 and a 2/3 chance of being -1. This bet by itself has a negative expected value, so it is better not to do it. However, if you "do it twice and you can choose whichever you like," you should do it because there is a 5/9 chance of +1 and a 4/9 chance of -1. This is the value of being able to choose.

See also: real options, [trade-off between exploration and exploitation].

1030: [絶対優位・比較優位]

Even if your productivity is absolutely inferior to that of the other party, you and the other party can improve each other's productivity by creating and offering to the other party what is relatively productive in yourselves and receiving in return what is relatively unproductive in yourselves.
As Ricard's [comparative advantage] argument, he showed that trade is beneficial even for countries that are absolutely inferior in productivity.

The figure on the right, although easier to understand at first glance, represents the benefits of trade when there is an absolute advantage because of the exchange in terms of superiority over the other party.

Note that in this discussion, the trade object is considered to be an accumulable consumer good and the trade cost is considered to be zero. For example, there is no value in making more than demand if it cannot be accumulated. Knowledge is not a consumer good, so "teaching what you already know" does not produce value. If the profit from trade is less than the cost of trade, then, of course, it is better not to trade.

The strategy of how an absolutely inferior country can obtain absolute superiority is not discussed here.

1031: [Trade-off between use and exploration].

1032: [Replace with data].

Long ago programs were physically wired. It was replaced by data.

Instead of physically arranging and routing logic elements, FPGAs arranged elements that do table-pull. The different types of physical elements have been replaced by data.

1033: [Apology rather than asking permission].

1034: [bipartite graph].
Two-Side Platform
network externality
No need to be on the same network

1035: [Note the shape of the distribution, not just the mean].

1036: →[Learn from someone with little knowledge].

1037: Prisoner's Dilemma
The concept seems obvious when expressed in the way that each individual is trying to maximize a different objective function, "self-interest," and under the condition that the behavior of others cannot be controlled, there are times when the overall optimal solution does not fall into place, but for some reason, the concept was greeted with surprise.

I'm more interested in how to tell if someone is behaving in a [reciprocal] way, or how to ban [selfish] people more efficiently from a utilitarian point of view.

Communities with high barriers to entry, [gated communities].

1038: [Not all orders are present].

1039: 排中律
Exclusionary rule ("A or not A" is true)
Here are some examples of logic where the law of exclusion does not hold.
[直観論理 - Wikipedia https://ja.wikipedia.org/wiki/%E7%9B%B4%E8%A6%B3%E8%AB%96%E7%90%86]

1040: [Tolerate mistakes].
[Bloom filter - Wikipedia https://en.wikipedia.org/wiki/Bloom_filter]
近似
Monte Carlo method
[ミラー–ラビン素数判定法 - Wikipedia https://ja.wikipedia.org/wiki/%E3%83%9F%E3%83%A9%E3%83%BC%E2%80%93%E3%83%A9%E3%83%93%E3%83%B3%E7%B4%A0%E6%95%B0%E5%88%A4%E5%AE%9A%E6%B3%95]
random-choice algorithm

1041: 周波数領域
Multiply by FFT

1042: When only a subset can be observed, it makes sense that it could not be observed.
[Returned plane hit and areas to be reinforced].

1043: [deviation from the mean and sample size].

1044: There is more than one kind of distance
In general, when there are 0, 1, and 100, it is not obvious whether 0 and 1 are close and 100 are far, or 1 and 100 are close and 0 are far, depending on what kind of distance is entered. So we tend to judge things by considering the simple distance as the only distance.

There is no one type of average, nor is there a difference in the distance that is included.

1045: The Most Efficient Factories Go Broke
 Dependent phenomena with statistical variability
 [ザ・ゴール#5ae4aae4aff09e00009a6337]

1046: [A hundred victories in a hundred battles is not the good of the good].

1048 [Forms break, but at different speeds].
