Einstein's empirical axiom verification model
[https://gyazo.com/fbcfd5fd393121bc75c2584d1badefd2]

Written by [Einstein] in a letter to a friend, May 7, 1952.

Axiom is generated from experience, but there is no logical path; it is intuition. It is constantly being modified.
 >there is no logical route leading from the E’s to the A’s, but only an intuitive connection

	(1) The E’s (immediate experiences) are our data.
 (2) The axioms from which we draw our conclusions are indicated by A. 
		Psychologically the A’s depend on the E’s. But there is no logical route leading from the E’s to the A’s, but only an intuitive connection (psychological), which is always “re-turning.”
	(3) Logically, specific statements S, S′, S″ are deduced from A; these statements can lay claim to exactness.
	(4) The A’s are connected to the E’s (verification through experience). 
		Closer examination shows that this procedure also belongs to the extralogical (intuitive) sphere, for the relation between the notions show up in S and the immediate experiences are not logical in nature. 
  But the relation between S’s and E’s is (pragmatically) much less certain than the relation between the A’s and the E’s. (Take the notion “dog” and the corresponding immediate experiences.) 
  If such a relationship could not be set up with a high degree of certainty (though it may be beyond the reach of logic), logical machinery would have no value in the “comprehension of reality” (example: theology).
	What this all boils down to is the eternally problematical connection between the world of ideas and that which can be experienced (immediate experiences of the senses).
	The work for the de Broglie anniversary volume will be translated into French by scholars there. But its contents will be a heresy of the worst order for the people. I can not send it to you until it is printed.

	Is the de Broglie anniversary volume referring to Savants et découvertes (Scientists and discoveries), Paris, Albin Michel, 1951.

original
[https://gyazo.com/88b905d77e30aee9d6fa7858ff010108]