Scrapbox Best Practices
In the process of becoming proficient with Scrapbox, Nishio said, "Tell me about that earlier! I wish I could tell my past self!" I wish I could tell my past self!
Written in mid-2017. see Written at the beginning of 2019: [Scrapbox goodness (part 2)].

	Table of Contents
 	First, write in [outline].
  Don't divide the project into smaller pieces.
		Headings on pages with a lot of content should be interesting.

	First, write in outline
 	This type of [bullet].
  Because I was used to the format of a blog, I started writing normal sentences from the beginning.
  It is important to [lower the hurdle for information output
   Sometimes someone asks me something and I say, "I'll write it down later!
   Why "later"? Because you're setting the bar high for yourself.
   So I'll just do it, saying, "I might write more about it later, but for now I'll just write it down in bullet points.
   And since there's no need to hide it, they send it off saying, "I wrote it in a messy way.
   The reaction to it can lead to further development.
  Don't try to structure it from the beginning.
   Structured after the fact
   I mean, if it's not essential to structure it, then don't structure it.
  Learn Scrapbox outline editing shortcuts!
  	But it's just an intuitive combination of Ctrl and Alt with arrows.
   In Windows, Ctrl+Left/Right is deprived by default by the OS, so turn it on from personal settings.
		Just make a bulleted list of what you're going to write about later when you think, "I'll write about that later."


 Don't divide the project into smaller pieces.
 	In the meantime, if you're new to this, you could just create a "PRIVATE anything you want to write project".
  When you get used to Scrapbox and feel ready to send out information, you can create a "public project where you can write anything you want.
  Nishio's case (example of failure)
  	Create a project [/organize-ideas] to put together "how to put ideas together."
   Create a private version of that project out of concern for what you are not allowed to publish copyrighted material.
   It's a hassle to move pages, so I write only in private.
    Around this time, "Don't we need a feature that would make it easier to move pages between projects?" I said.
    　You feel it is necessary because you are in a situation where you frequently have to move pages across projects, right? That situation is a mistake to begin with.
   I'm tempted to write about Numpy and other technical stuff, but it's not "how to put ideas together," so I'm in trouble.
   Create a [/nishio] for general public use, and also a private project for private notes.
   I've written a lot in my private life, but I've had trouble making it public, and from the outside it looks like I'm not very active.
   Join [ScrapboxDrinkup
   I've heard several people say, "I'll put it all in one place," and I think I'll put it all in one place anyway.
   When I put it all together, it was a whole different kind of fun.
   It should not be divided unnecessarily. If there is no clear reason to separate them, they should not be separated.
   [Jiro Kawakita] also said that [classification] should not be [top-down]. Isn't it a top-down classification to separate the project from the beginning? [Top-down and bottom-up.]

 Headings on pages with a lot of content should be interesting.
 	If it's one word or something, I think it's a word description page.
   become more like a dictionary
   unexciting
  Similar to [making a nameplate] in [KJ method].
  	Don't let it be tasteless.
		Similar to the relationship between text and headings when writing a book
   The editor tells me to just look at the headline to get some idea of the content.

	Not a warehouse to put dead sentences in.
 	[Wiki as a living text]
  [event article is dying].
  The idea of Scrapbox is [not a warehouse for dead text], but that said, I think there are a lot of times when you start using it anyway, you say, "I want to keep this," and you put dead text in there.
  At those times, I would say, "This is not a warehouse for dead text! Don't put them in!" What a thing to say, and it will spoil the motivation of those who try to use it.
  We can put the dead ones in there and gradually something will grow out of them.

	No attempt to tag it.
  [Structuring information with links].

	Other
 	Anchor in [/forum-jp/page].
  	The green or gray area at ← is called a telomere. If you click here, you can link to a specific line.
				You can use this to refer to a specific line
				[cut to a separate page if you want to line link to a longer text].
  How to do external linking
  	How I do it.
   If you don't want to go through the trouble of pasting a URL, just paste it in and it will become a link.
   	For example, if I saw something on Twitter that I thought was interesting and decided to summarize it later, I just put it up.
  		I may make it look better when I feel like it.
  	The general page shows the title.
  	The link to Facebook is simply labeled "Facebook. There is no appropriate title.
   The link to Twitter is simply "Twitter" or "@username".
   Even in general pages, when the purpose is to indicate the URL of the source and not the title or other information, "src" is used.
    Compact what is not important.
   When linking to Amazon from a book description page, use the title "Amazon
    It's self-explanatory which book is being referred to by the title of that page.
		time series
  	Only on rare occasions, when he feels like it, he mentions `[2015]-01-02`, etc.
   We don't do it on every page.
   I don't do it from the beginning, but I do it because I think, when I look back on it after a few years, this is a text that still makes sense after a few years.
   [The list of activities by year is summarized in the following table.

Year 2021
　Read projects updated by others in [Stream in Scrapbox
