iw-557
[Incremental Writing] 557th note
I forget why this is posted here.
Seems to have come from Twitter...
If it's Twitter, I think it's easier to understand if you add more context by attaching it to the tweets before and after or something.

I used to think that the reason why copying the "way" explained by others rarely works, the person who created the way did so by trial and error to fit his situation, whereas the imitator lacks a good fit with his own situation, but more than that, the person who created the way recognizes it as something he created. And on and on it goes.
	No. Even if the purpose is clearly stated, others can consider it a means to achieve something else on their own, so the bulk of the blame lies not with the questioner's failure to clarify the purpose, but with the respondent who guessed the purpose on his own?
 I don't think we should assume as a tacit premise that "the scope of knowledge is explicitly stated as a curriculum, and the goal is to get that scope of knowledge into the brain." There are two points that are open to rebuttal: "Is it explicitly stated?" and "Is the objective to gain knowledge or to produce results?"
 People often tell me to put myself in the other person's shoes, but the value system that places importance on verbal communication says that you don't know what the other person is thinking unless you have psychic powers.
 	Explicitly assert your own ideas. The stance is that those who do not insist are at fault.
 The statement "X is important" by someone who is familiar with X has a double bias: a bias that unconsciously justifies the investment in X, and a bias that the importance of X makes you feel important. Instead of taking the statement as it is, you have to ask "why you think so" and judge for yourself.
 What is your evidence that 'that part is quite misleading'? Can you provide another "non-misleading explanation" that could be done at a lower cost than that?
 If the vertical axis is "necessity" and education to enhance it appeals to the rational mind by "clarifying the advantages of making a choice and disadvantages of not making a choice," then education to enhance the horizontal axis "desire" appeals to more muddled emotions.
 	Well, if I wrote that, customers wouldn't like to feel like they were being denied their own reason.
 [predictably irrational], is reading. Interesting.
 	He said that differentiation is important for sellers to remove the anchor so that they are not seen as the same object.
  What about the buyer's side?
 Should I train myself to question my repetitive habits, or?
 	Socrates said that an unexamined life is not worth living. So systematic disposal is important.
 The line, "he needs to be a better communicator," is often uttered by those who have failed to communicate with him. It is interesting to note that the failure to communicate itself is symmetrical to the relationship, so why don't people think "maybe he doesn't have the ability to communicate with me"?
 So mathematics cannot be understood efficiently without first resolving references and compensating for omissions, and dictionaries cannot be read efficiently unless you clarify what you want to know before reading them.
 There was "Knowledge workers cannot be supervised. Rather, he is useless in every sense of the word if there is anyone who knows more about his specialty than he does.
 The key to success is for everyone to ask themselves who needs their information, what kind of information it is, and conversely, whose information they need.
 In other words, even if the same opportunity is given, each person has a different expectation of the benefits to be gained from it. The amount of fear of failure, the margin for challenge, risk tolerance, and so on may be expressed in various ways, but what limits the benefits to be gained is in the mind of the person receiving the opportunity.
 Assuming hypothetically that there is a person "at the bottom" who is inferior to all the members of the group, that person is inevitably a free-rider because he or she has nothing to give to the other members of the group. They are detrimental to the community. RT Only an environment in which you are at the bottom promotes growth.
 I am not saying that consulting with others on resource allocation strategies is completely futile, but it is difficult to have a useful discussion without clarifying the resources you have and the objectives you want to achieve. If we just say, "Japan doesn't like differentiation..." and be done with it, nothing will improve.
 When I think about how this can be changed, I wonder if I should change things to the extent I can so that those who differentiate themselves will be happier than those who homogenize. That is why I devote resources to people who are "interesting because they are different from the norm.
 I see. I think the bicycle parking discussion is a situation in which the cost of the discussion is higher than the price paid as a result of the discussion, but I guess you could say that cutting out inefficiencies is, in other words, stopping to think. The resources that can be invested are not unlimited, so stopping to think may be inevitable sooner or later.
 Conversely, money is the solution, so if the idea is truly one that creates economic value, then it can be an ongoing system. That's exactly where the problem lies, and the experts are narrowing the scope not because they are stupid, but because it has a better chance of becoming a feasible idea...
 The world is subject to many unexpected changes. There are people who are trying their best to continue doing what they think is good, but depending on the magnitude of the change, things may not always go the same way as they did last year.
 For those who want attention, engaging in eccentric behavior may be an easy way to get it. However, the attention gained through such behavior is lost when the behavior ceases. And they starve for more. It is like a drug. Attention by creating value lasts as long as the results have value.
 Some people may get defensive when they hear the term "primary knowing," but it is an obvious statement that "beliefs without evidence (enough to convince others)" are necessary when doing something new. Something that has enough objective evidence to convince others is not "new.
 When explaining things to others, you have to express yourself in their language system, not your own, to get the message across. Seiyo:Opinions about life cannot be judged as correct or incorrect. But "how" is another thing. If "how to improve your life" is described along with his opinion, you can test it yourself to see if it is correct or not. If not, you can only accept his opinion without evidence or ignore it without evidence.
 Even if you think that [clarification of objectives] is important, you stumble when you actually try to clarify it. We mistakenly set a goal such as "to understand this book. That is a bad goal, because it is difficult to judge whether you have achieved it or not. Instead, it is easier to make a [condensed memo] because you still have something tangible to judge whether you have achieved it or not.
 Feeling "understood" is not the same as "understanding. Therefore, "I thought I understood, but in fact I did not understand.
 Knowledge workers are mostly specialists. They achieve great results when they do one thing well, i.e., when they specialize. However, expertise by itself is only a fragment and sterile. The output of an expert becomes an achievement when it is integrated with the output of other experts.
 I wonder if people don't have that much difference in ability, just a big difference in the performance they can produce due to lack of interest or prior knowledge.
 Mr. X, who was heavily criticized by my last two employers, did too good a job. I haven't had him write a single line of code. I guess his interests and abilities are oriented towards information gathering.
 If judged according to the GTD flowchart, this piece of writing idea should be asked if it should be acted upon. If it does not need to be acted upon, it should be saved as a document in a form that can be retrieved when it is needed. This is also an action.
 I've been thinking about the relationship between organizing or not organizing LEGO bricks and creativity. What I can say with certainty is that when repeating the same task, the cost of organizing at the beginning will be paid off by the increase in productivity later, but those who do nothing but organize and prepare under the pretext that it will be easier later and never start building will never create anything.

	I've done this much and I'm bored.

 Yes, if you define "descriptive power" as "the breadth of what can be described," then I agree with the argument that fine granularity is greater, but I wonder how many people say, "I'm having trouble describing what I want to describe in my language. I don't trust people who say that (operation) is tight when I make judgments because I can't evaluate whether it is really tight or not. The assertion that "quantifiable measures are only an extension of the past and cannot create anything new" is something I can sympathize with emotionally, but it is very lame if the person who says it is not creating anything new. Also, the method of creating something new that I personally find most useful is still quantification. Looking at it the other way around, am I using the word "objectification" in a narrow sense? The reason why discussions about whether input or output is more important are sterile is because the subject is not clear. For example, if a person does only the work he is told and does not learn spontaneously, he needs more input, and if he only studies at his desk and does not take action, he needs more output. I want to know "how to defragment myself.  I want "how to cloud yourself," "how to AR yourself," "how to virtualize yourself," "how to time-share yourself," and so on. I think there is a particular need for "how to reboot yourself." This model seems to describe part of reality well, but as I was writing it, I was thinking that I don't have the ability to create barriers to entry for those ahead of me, and I can't prevent my profit margins from being lowered by those who enter later because the information about my success is available to all. I wish I could find enclaves and create barriers to entry before others are aware of them. I don't know if diversity also requires diversity in the evaluation scale, or if it's necessary to estimate high probabilities of low probability, which seems irrational for an individual, but when what you get is something that can be replicated by others, such as knowledge, the group benefit is orders of magnitude greater than the individual benefit, so the rational risk is greater, too. As an organism that has acquired language and society, it may have been rational to evolve to behave irrationally as an individual. It's like balancing a game. I didn't think it was necessary to write in a way that he could see, "I'm firing him because there were better people than him," or "I can't say he didn't meet the specifications, but I didn't get what I was looking for," so I just said "Thanks! I thought that I didn't need to write "I can't say that the demand specifications were met, but I didn't really get what I was looking for" or "I didn't really get what I was looking for", so I just wrote "Thanks! It is not always possible for customers to verbalize their needs. I think we need to observe and understand people. When everyone around you is growing exponentially, someone who is growing linearly is as good as not growing at all. But it is growth, too. I think it's futile for outsiders who don't know the details of the requirements to be met and the limitations of the available resources to say four or five things about the design decisions made by others. Everyone is doing the best they can under the given circumstances. Because the lack of people who can make appropriate design decisions is also a limitation of the given resources. We need to create a system to reduce hoaxes. But majority rule cannot determine if it is a hoax or not. Maybe the system should stop trying to determine what is right. How about designing the system in such a way that it encourages people to collect and organize materials for judgment? Continuation, that is, I am the master and the way I do things is the slave, and if I want to change or break something, I have no hesitation in changing or breaking it. The imitator, on the other hand, perceives the method as something better than himself, created by someone better than himself, and the master-slave relationship is reversed, and he tries to adapt himself to the method. This is the difference, isn't it? Just recognizing that knowledge is something that changes something. It occurred to me that management books and desapata books seem to have something in common. The common disadvantage is the generation of believers who blindly believe what is written. The common advantage is the creation of a common vocabulary for thinking and talking. In this light, I think what needs to be solved is the generation of blind faith. Not only how to input a lot of information and how to lead to a deeper understanding, but how to review is important, but how can we learn how to do a good review? The needs of the client are paramount! In order to create a situation where the solution with the highest expected value is chosen in the overall optimum and not the overall optimum in a prisoner's dilemma-like situation where optimizing only from one's own perspective would result in hawks being chosen and not the overall optimum, the existence of external pressure that favors high expected value is necessary. Should the term "overall optimization" be called maximization of expected value because there is an interpretation sway in the criteria? There are two kinds of people who think this is a good term: those who think they are responsible for decision-making and those who think they are entitled to it. In contrast, knowledge workers should make their own decisions in their area of expertise.　Probably difficult. Learning only theory from textbooks does not lead to application. It is not knowledge that can be applied unless it is connected to the "root" of experience. We understand through concrete examples. But how do we know if this understanding is correct? Besides "religious controversy" and "bicycle yard" as bad patterns, I feel the need to name the behavior pattern of "bringing up a concept that you can't explain what its practical benefits are and making yourself look great for knowing the concept". Those who don't take on a challenge because it seems too difficult are also running away from the experience of success in overcoming a difficult challenge by running away from failure. And because they don't experience success, they lose confidence even more. But if you think about productivity per time spent, it would be more efficient to have those who are not suited to expressing opinions go back to working in the field and have fistfights with a group of Mohicans who would not die even if they threw hand axes at each other. I never understood what it meant until now. I guess it's not time that's lacking, but motivation. If you are motivated, you don't stop thinking and say, "I'll do it when I have time. Hmmm, that seems to be assuming that information learned after the fact could have been known beforehand as well. "I guess what I'm saying is that if you want Mr. Ozaki's class, you have to be able to tolerate skipping work. Like, if you can't allow them to skip work, then you can't get great talent." Both are the same in the sense that you are entrusting decisions to a larger system over which you have no control, but the difference is whether you believe in the infallibility of that system or not, or whether that system has a personality like a human being. When I'm talking to a Christian who doesn't assume a personality for God, I'm not sure I can believe in that faith, and if someone else's subjective beliefs differ from mine, that's not a reason to make them change. If there is no specific problem, it doesn't matter what you believe, and if there is a problem, you should think of a solution to that problem. Getting others to change their beliefs is one solution, but not necessarily the optimal one. After all, the person who wants to obtain knowledge wants it to be readily available, but what is the benefit to the person providing it? A person who is older than the speaker and who has a cognitive impairment in the ability to "listen to others' opinions, compare them with one's own, and adopt the better one.  In 120 words, describe what an old person is. There are two approaches to doing the right thing: "doing what one believes is right" and "doing what one thinks is right. In the former case, if you cannot find a suitable subject you can believe in, you will feel uneasy. In the latter case, you become anxious about whether your judgment is correct or not. There is not much difference. The only way to confirm one's understanding is to output and observe whether the system outside oneself reacts as one understands. If it does not respond as you understand, you can confirm the error of your understanding. Reacting as you understand does not guarantee that your understanding is correct. It may be a fluke. No matter how hard you try, you will never achieve 100% understanding. That may be a surprisingly good point of view. Although it is a niche market, there is demand. The problem may be that the knowledge of how to do it has not yet been discovered. If we can do that, we will not only be able to judge "this word is important" from given data, but also "this word seems important, but I am not confident because I don't have enough data, give me more data. The person who has worked hard to master the term "X" and has learned it, expects a return on his/her effort, but is not given it, and so he/she starves. As a result of this hunger, they seek further explanations or write down their own understanding and hope that someone else will tell them. I used to leave out comments of mere affirmation or agreement because they are not informative, but then I would have to mention them in case of denial or disagreement. Do I need to comment in agreement to go through disagreement? Wouldn't it be zero information if I rephrased what I understood in my own words instead of just agreeing with it? It is overwhelmingly more efficient to talk to someone who knows something and have them tell me rather than to research and write it myself. I hate studying by myself. But then I realized that if I didn't have the attitude to study on my own and the knowledge to choose the right questions, I probably wouldn't even be taught in the first place. I'm not communicating through tickets, so I'm only looking to improve my own task management. The optimal action differs depending on whether you think of the efficiency of "doing something efficiently" as "the effect obtained divided by the time it took to achieve the effect" or "the effect obtained divided by the time it took to achieve the effect. In the former case, the time spent thinking about how to do something is not included in the denominator, so it is justified to spend time worrying about it. I was thinking about this when I read "Non-Quantifiable Goals Are Meaningless." Druckerbot's "The knowledge society is not a society of bosses and subordinates" is full of RTs, but I wonder if they realize that it's a situation where there is no one left in the organization to surpass them as a result of constant learning and advanced expertise (and those who can't do that have been restructured). I am reading Drucker's Management. What is the company and what is the customer? I am an ordinary employee, so the company I manage is myself, and the customer is the company I work for because it is the entity that pays for the knowledge and services I produce. I think one of the reasons why hierarchical organizations were born is that when the means and systems for information distribution were not as advanced as they are today, people were involved in the distribution of information, and the number of people that one person could handle was not very large due to the limitations of human capacity, so it was necessary to divide and govern. I am looking at the repetitive tasks and thinking about how to improve the tools to avoid the time-consuming and error-prone parts of the process. I've just changed my Twitter client to Night Owl.
 Regarding the education of autistic children, I reported that "first we need to help them succeed and make them understand the goal," so we help them succeed with full prompts, then backward chaining (gradually increasing the amount of work they do on their own from the back of the task flow). I hope I got the message. In that sense, when I'm trying to learn a new programming language, it's reasonable to set a goal of "copying aside from understanding" instead of "understanding".
 If you buy an expensive one, you will have to change to justify your actions. lol I don't disagree with the assertion that measurement is important for tuning, and that quantitative indicators are necessary for hypothesis testing. But before we can do that, we need to find out what needs to be tuned, what hypothesis needs to be tested. How do we find that out? Next, it is difficult to outsource tasks for which the goal is not clearly verbalized. Especially if the task seems to be to clarify. This is because the conditions for accomplishing the task are not clear. In a sense, this is a bit similar to the previous point, since it can be said that the task depends on the knowledge of "what the company needs" that is not verbalized in the company. The ironclad rule that "tasks should be written down on something that is easy to use and non-volatile" is an important element that appears in many task management methods. Breakdown of tasks also comes up frequently. But its specific methodology is not often discussed. I don't think it's okay to completely ignore the public's evaluation, but if the public's evaluation and my beliefs are at odds, should I interpret that statement to mean that the cost of correcting a belief is more expensive than the cost of making people learn from explanatory texts where wrong beliefs cannot occur? If so, that's the reason I pointed out earlier that there is no basis for the claim. If so, that is just a repetition of what I pointed out earlier as having no basis, but with different wording, isn't it? So unless it is combined with the ability to find "problems for which answers are not circulating in the market," the ability to think logically is difficult to create value, which is a natural consequence of the advanced information society, isn't it? I'm thinking that the task of reading and understanding a paper containing mathematical formulas may also have a methodology for improving productivity, etc. I have about 38 pages to read tomorrow, so I can experiment. rt Self-development is not only about mastering skills, but also about growing as a human being. When one focuses on responsibility, one develops a greater view of oneself. Pride and self-confidence, not vanity and pride. Something that, once acquired, cannot be lost. The goal should be .... RT So, to do the same thing in a language with low abstraction and few libraries, programmers are required to have high thinking ability to compensate for abstraction and the stamina and memory to create a large number of libraries. In most cases, the programmer knows in his/her head that it is better to ask someone else to do it than to do it himself/herself, but he/she thinks that he/she is an inferior person for asking, and is caught between the pain that hurts his/her self-esteem and the idea that he/she should not do it. But sometimes there is a novel idea. However, the amateur is of course not capable of judging whether the idea is innovative or not, and the expert does not have time to review the amateur's idea. The binding happens unexpectedly. Understanding cannot be a TODO. Understanding cannot be measured subjectively. It can only be measured by the quality of output. Understanding cannot be a goal. The productivity of intellectual work depends on the design of the method. If you are aware that you have a priority task, but you end up doing another task, it means that there is something in your mind that is preventing you from performing that priority task, so you have to think about what it is by confronting your mind. RT In your analogy, I think you are asking if you want to bear the cost of improving the person's coding skills as the one who teaches them. If you don't have that kind of skill, then you can cut the temp contract and assign someone else to the job. . RT The deeper trouble is when you are not aware of "bad impression to your partner" and you recognize the seriousness of your situation as a set of "technical problem" and "I can't implement it because the authority given to me is inappropriate". your conscience hides your resentment, and as a result, you raise misplaced righteous indignation