Don't skimp on stationery.
A bad habit that was corrected in the early years of living with my wife was, "Why do I get so stingy with the supplies that come in so many packages?"
Notepaper, notebook pages, wet wipes for non-stationery items, etc.
	Case Study 2013 [Facebook https://www.facebook.com/nishiohirokazu/posts/10200573401994056] The story of how I bought a Moleskine.

Examples of stinginess
 I have half a notepad left, so I'll write in the gap there.
 Cutting out the notepaper itself, he said, "Let's cut up the printed matter we no longer need and use it as notepaper."

No. 11 of [Rhodia], a typical expensive memo paper, costs 200 to 300 yen for 80 pages. 1 page costs about 3 yen.
If you buy a $3,000 book without having to worry about it, it is not reasonable to skimp on a notepad that costs 1/1000th of that price.
If there is no downside to skimping on notepaper, then it is OK to be stingy, but in practice this is not the case.
If you think of it as [1 yen per second], if you lose 3 seconds due to stingy behavior, you lose money.

The time spent looking for things is surprisingly long, so it pays to spend money on making things instantly accessible.
A common bad pattern is to buy a box that is just an outlook box in the name of storage equipment, stuff a lot of stuff in it and think you have "stored" it. The purpose of storage is not to stuff things in, but to be able to get them out when you need them. If you can't [find something] when you need it, it's as good as nothing.
Rather, it is better to be able to say, "It must be here. If you don't see it here, it's not in the house," it is better to be able to judge.

[Storage]
[Don't be stingy with your stationery.]

2023/1/17
　Because this article contained the names of overpriced stationery such as Moleskine and Rhodia, some people interpreted it to mean "buy expensive stationery and don't be stingy with the money you spend on stationery".
　Reverse.
　　If you buy expensive notepaper and think, "There's half a sheet of notepaper left, so I'll write in the space there," you'll end up in the wrong place.
　　Even if a notepad is only half-used, you need to be able to throw it away without hesitation when you no longer need what is written on it.
　　If you can achieve that by making notepaper cheaper, then make it cheaper.
　Note that this article was written 6 years ago and is an example of a story about buying a Moleskine 10 years ago, but I have been using an iPad Pro for the last few years, very good!
