Columns to read when you think, "Adults are stupid."
I used to go to a park. It was full of wild monkeys. Seeing me as a tourist, the monkeys came up to me and sat right next to me, as if they thought they could get food. I didn't have any food, so I lightly imitated throwing food to the monkeys. The monkey followed the direction of the bait with his eyes.

Then I felt a sharp pain in my shoulder. For a moment I didn't know what had happened. The monkey thought he was being teased, got angry, and bit me. The monkey bared its teeth and became furious. Fortunately, another tourist nearby chased him away, but I don't know what would have happened if I had been alone.

Monkeys are dumber than humans. But even stupidity can hurt others who tease them. Even if you think "adults are stupid," do not tease them. Even if adults are stupid as you interpret them, they can still hurt you.

The reason you want to make fun of "stupid adults" is because you are a child with a complex about adults. It is the same for adults. Only adults who lack self-confidence want to make fun of "stupid strangers. Confident adults don't get involved with "stupid strangers. They know that it is a sterile use of their lives that they are mutually depriving each other of. Confident adults look for other, non-stupid, confident adults. And they try to use their lives beneficially by building relationships of mutual giving.

If all the adults around you seem stupid to you, that's because your scope of observation is narrow. Stop wasting your life making fun of stupid adults and go find adults who are not stupid.

I wrote this article after reading that a junior high school student who created a computer virus was arrested. I do not know what exactly happened in that case. But I guess it means that a junior high school student, who has more programming knowledge than the average adult in the world, made a mistake in using his knowledge and life, and his life was damaged as a result. It is a sad thing. 2017-06-06