Pomodoro Technique
	25 minutes is called "one pomodoro."
 By measurement
 	How many pomodoros can I do in a day?
  How many pomodoros can a certain task be done?
  Improve estimating capabilities
 Switching perspectives
 	Lion's hat, King's hat, Clown's hat
  I was digging through the source code of some complex open source software.
  It was going to take some time, but it was going to achieve its goal.
  Pomodoro finished, I got up, went to the bathroom, got a glass of water and returned to my seat.
  At that moment, an idea suddenly struck me. A certain functionality that the software provides is essentially something that should be implemented after what we are trying to do now is realized. So, if we delve into the implementation of that functionality, isn't there already something similar to what we are now trying to create?
  The next pomodoro was given to that survey and found, as expected, that it was so.
  I implemented the use of it in that next pomodoro and the problem was successfully solved.


Mon, 17 Jan 2011 10:50:24 I bought a copy of "Agile Time Management: An Introduction to the Pomodoro Technique".

Increased complexity decreases motivation. p.29
Takes a long time to switch from one to the other.
Tend to underestimate the effort required for a single task
	[perfectionism gets in the way of action] # bad perfectionism
	[Fear of failure causes mental anguish].

Flow state, not suited to seeing the whole picture.
Set a timer, come back and put on your [strategic thinking hat].

Stages of the Pomodoro Technique
	planning
 	Retrieve the activity from the backlog and write it in today's TODO
 tracking (e.g. in computer graphic)
 	Execute and measure
  1 Pomodoro for 25 minutes (example)
 recording
 processing
 visualize

Deming Shughart Cycle
PDCA cycle

Long TODO list
Questioning the ability to make choices

	Clown hat: Rest
 Lion's hat: Focus
 Strategy hat: Determine what needs to be done for the next iteration

internal interrupt

If 25 minutes doesn't work, let's shorten the pomodoro time first. p. 118

Methods for external interrupts
	I'll let them know I'm in the middle of something else.
 Negotiate another date.
 make an excuse for doing something
 I'll call you back.

[Drum buffer rope] ([Theory of constraints])
Determine the appropriate length of the list.
How many can you do in a day x how many days you want to have

Length of breaks
	Mixing short and long breaks lacks motivation to start the timer

p.154 Preference Match
A method of repeating a tournament as many times as you want to take it.
