Agile estimating and planning
[https://gyazo.com/f18eab2a8b6828bf11dcdcc2c89fb7e4]
	[Agile Estimation and Planning: Concepts and Techniques for Developing Valuable Software
 [Amazon http://amzn.to/2vLs6V6]

 [Prioritization Factors
 	monetary value
  cost
  New Knowledge
  	Goal [uncertainty] Knowledge about the product What to make
   Uncertainty of means Knowledge about the project How to make it
   [goal uncertainty and means uncertainty].

  [Risk]
 		Closely related to new [knowledge acquisition
   Three typical
   	Schedule risk
    Cost Risk
    Risk of function
   Technical and Business Risks
   [risk, value and priorities].
   	Do high-risk, high-value tasks first.

	You're talking about cost-effectiveness, net present value, internal rate of return, etc., but you can't estimate enough to make that argument in many cases.

 [Kano Model of Customer Satisfaction]

	star shell
		Do not divide the story into tasks
  The source of this term seems to be "master programmer."
  Don't separate "implement the UI" from "implement the middle tier."
  Implement across all, even partially, rather than completing only one specific logic layer
  why?
			If you divide the iterations in such a way that nothing can be learned until both iterations are completed, such as "one iteration on the server and one iteration on the client," you are ruining the "fast run/learn cycle" by dividing the iterations. Instead, create a minimum implementation that allows both the server and client to be used and tested. Tracer (Towhead).
				[Agile Estimating and Planning: Leverage Memo - Yasukazu Nishio's Hatena Diary http://d.hatena.ne.jp/nishiohirokazu/20121031/1351691338]

 [uncertainty cone].

 Parkinson's Law The amount of work expands until all the time given for completion is met
 Schedule delays are transmitted ahead of time.
 Clark and Wheelwright's experiment with multitasking More than three tasks at the same time reduces productivity.

[labor and accuracy of estimates].

The title of the page was incorrect and has been corrected ([Estimate]/[Estimate] shaking)
 [Agile Estimating and Planning]
