Getting Thing Done
 Limitations of Working Memory
 The burden of trying to remember more than you can keep in mind
 Free yourself from the stress of "I have to remember" by writing it down.

 In GTD, the first step is to write down everything that is "on your mind. It is important to write down all the things that are on your mind.
 Instead of TODOs and tasks, you write down everything you care about and then think about whether it is a viable TODO or task after you write it down.


	Decide what results you want and what actions you need to take next.
		Manage that "action to be taken" with a reliable system and review it regularly.

 Top-down or bottom-up?
 The "clarify your long-term goals, your values, your purpose in life, etc." approach.
 Examples of Top-Down Failures
  Difficult to focus on higher level things due to daily work
  Thinking about higher levels gets in the way of day-to-day work.
  Thinking at a higher level will get the job done.

And if you bring a box in a high position, it won't sit well if it's not well connected to the daily low position box,
It will need another box to support it (= more work).

unfinished business
 I'm not clear on the results I'm looking for.
 Not clear what action to take next.
 No reminders are set to remind you at the appropriate time.
and can't get it out of my head #Zygalnick effect.

 Many people try to achieve organization by sorting through vague and incomplete lists
 Behavior is what should be managed.
	The biggest problem is not "lack of time" as many assume.
  The real problem is that they don't know what to do next.

 Act on pre-considered options.
 I don't think "what options are available" on the spot.
 The choices you come up with on the fly don't mean you're acting on the right priorities.

#TODO Venture decision making, talk about not making the right decision without multiple options.

[The [perfectionist] idea of considering all options in advance puts the brakes on the mind.

 Collect: Collect everything you care about in one place
 	1H～6H
 Processing: Clarify what each means and what needs to be done (processing)
 Organize: Organize the results of the process
 Review: Review action options
 Execution: Perform the chosen action.

P.87
	Set aside time
		Ideally, we should set aside two full days.
  It can take over 6 hours to collect, another 8 hours to process.
  Better to do it for a short time than to procrastinate.
processing
	From the top
 One case at a time
 Do not return to inbox P.129

 What is this?
 Do you need to take action on this?
 　no
  　Garbage: worthless at this time and no longer needed
  　Documentation: information that is worthless at this time but may be needed later
  　Pending: No action is needed at this time, but action may be needed later.
 Things that need to be acted upon
 　What results are you looking for?
  	[What would you like to see happen?"]
 　What specific actions should be taken next?
 　　Do it now.
 　　Leave it to someone else.
 　　I'll do it later.


#TODO Mismatch between design created by others and personal task management

	Processing does not consider [urgency].
 No need to incorporate [priority] in the list
 	Every time the situation changes, it needs to be reordered and rewritten.
  Many people find it stressful to organize a reduced workforce.
