About Communication
from [Efficient Protocols for Technical Communication].
About [Communication
Twitterから転載

	RT @hyoshiok: I often tell people to put themselves in the other person's shoes, but the value of verbal communication is that you don't know what the other person is thinking unless you have ESP. Explicitly assert your thoughts. The stance is that those who don't insist are at fault. Twitter 2012-04-29
	People often say, "Put yourself in the other person's shoes," but you don't know what they're thinking unless you have ESP.
 	Therefore, communication through language is important, a value
  If this value system goes too far, it becomes a matter of explicitly asserting one's own ideas, and those who do not assert them are at fault.
			Isn't this undesirable?

	RT @ynabe39: "[Communication skills]" are only for those who are "not good enough" and nowhere near "good enough". It's like "a tool to label someone incompetent and make them do what you say.
		The lack of communication is a phenomenon caused by the lack of ability of those two people to compromise, but when one of them lacks the ability to look at himself objectively, he claims that the other person lacks the ability to communicate.
	 Conversely, a person who frequently claims to lack the communication skills of others lacks at least the ability to be self-objective. The fact that he/she also frequently experiences communication failures suggests that his/her own communication skills may be lacking.
  Twitter 2011-04-25

	@Alembert That's already losing symmetry w "he can't talk to us majority" and "we majority can't talk to him" should be the same. Would it be fair if it were "he and we, the majority, cannot communicate through conversation?"
 @Alembert I guess that means "he needs to be a better communicator" and "he has different thought patterns than we the majority" mean almost the same thing.
 The line, "he needs to be a better communicator" is often uttered by those who have failed to communicate with him. It is interesting to note that the failure to communicate itself is symmetrical to the relationship, so why don't people think "maybe he doesn't have the ability to communicate"? Twitter 2009-08-03


	You're here to hear this > "Kaien" is a social entrepreneurship that aims to employ autistic people as software engineers http://www.academyhills.com/school/detail/tqe2it000009r11f.html
	Learn more about autism: http://bit.ly/20k2ER
		From a scientist's standpoint, I think it is a good and compact commentary, although I think it is a bit skewed in the direction of writing well.
	"Autism is an inborn difference in brain structure," "The term autism is a terrible translation and has nothing to do with seclusion," "[Communication] is poor (in the method used by the majority)," "Weak social adaptability: difficulty understanding unspoken rules," "1% incidence, 80% male, high unemployment rate."
	Difference between social entrepreneurship and philanthropy: Self-supporting, not dependent on subsidies Difference from general business: Prioritizes mission accomplishment rather than profit maximization Difference from welfare policy: Does not need to be fair to all residents
	At last year's Davos meeting, Bill Gates said, "Capitalism based on selfishness has made life better for many people, but not for everyone. We can also create market principles for those who have been spilt."
	Adam Smith also said, "We have not only selfishness, but also the joy of seeing others improve their lives.
	自閉症者のソフトウェアテストへの適性に関する言及: The Surprising Right Fit for Software Testing 
http://hbswk.hbs.edu/item/5869.html
	Kaien is not a company that I created to hire my own children, because it would drive me crazy with my decisions." There is nothing wrong with having a specific user in mind when designing things, right? Well, the kids won't be of working age for more than 10 years, so if the business continues that long, there will be more companies like that.
	Changing the image of autism 1: Individual level: industry-level wages, restoration of self-esteem 2: Family level: increased productivity (????) placed in the workplace　3: Social level: Spread to other establishments and industries
	Q&A Q: How do you recruit? A: There are many people in need. More than 10 people have already applied. Collaboration with schools, Hello Work, and pre-employment training targeting high-functioning autism is also being done.
	If you provide them with a comfortable environment, they won't have so many problems. The biggest point is that working hours are short.
	Q & A Q: How do we raise them? A: The most important thing is to educate managers. There is no doubt that autistic people can achieve high performance if managed well. The problem is training managers who understand the characteristics of autism.

2009-09-24