People who memorize the whole thing can't dig in.
2017-06-09
[https://gyazo.com/304f9424bf277f02cc5704f09b3792c1]
[https://www.facebook.com/photo.php?fbid=10212365980241142&set=a.1175498944176.2027303.1129148772&type=3 Facebook] [memorize] people [dig in]. They can't [dig deeper].

	Examples of Digging In
 	Suppose we had a concept of "if A, then B."
  Why A then B?" Suppose you wonder.
  If A, then C, if C, then B. So it evolves into "If A, then B."
 		Image of "A then C" and "C then B" on top of two blocks of "A then B."
  And "Why A then C?" "Why C then B?" and "Why B if C?
   Image on top of the four blocks, "A then D," "D then C," "C then E," and "E then B."
	Some people memorize "A then B" without question.
 When someone else says, "I don't know if A then B,"
 	Those who memorize by rote can only say, "If A, then B. That's what this textbook says!" can only say, "If A, then B, that's what this textbook says!
  Those who dig deeper and understand the question, "If it's an A, how do you know it's a C?" and can ask the question.
   You can trace your own digging path to the point where you lose track of the other side.

	There's a debate about whether the proposition that "smart people can explain things clearly" is true or false.
 	This is a messy way to ask a question.
  Whether you have the ability to figure out what you don't know.
			Why?" Those who have "built up things" within themselves by repeatedly asking "Why?" can ask questions (i.e., dig deeper) while descending from their "built-up things" when others say "I don't understand.
 	 People who memorize things by rote cannot do that.
		That and "whether you can teach in a limited amount of time" are independent of each other.
  	In this diagram, six blocks are needed as support to understand "A to B", and those who do not have any of these blocks must of course pay the time cost of six blocks.
   The only answer is no to the request, "Teach me in one block of time in an easy-to-understand way."
 		Confusingly, in that situation, "someone who has memorized a parable that many people would agree is A to B" can "make you feel like you understand" in one block of time.
   	Those who "think they have it figured out" naturally become "those who can't dig deeper.
    All I can do is repeat like a parrot the stories I have been taught.
    	Related [Parable of the Fish and the Fisherman].

	The comparison here is "A to B! Because that's what the textbook said!" and those who can delve into "A -> B! For example, there are examples of ~ and ~" and those who can delve into
 	There is no distinction between using "if A then C, if C then B, so if A then B" or "there is an example ~ or ~ that is A to B" in the digression.
  If we label the two ways of digging as "digging by deduction" and "digging by induction" (for the convenience of discussion), there are those who think that deduction is the better method because digging by induction is not logically correct, but digging by deduction will eventually lead us to the "axiom" However, when you dig down deductively, you eventually arrive at a working hypothesis called "axioms," so it goes both ways.
  	see [Munchausen's trilemma].

	Q: When explaining "A→B", is it a bad idea to explain "P→Q", which is different from it and easier to understand, and to convince "A→B" with "likewise" to make it "an easy-to-understand explanation"?
		A: If the person being taught does not understand "why 'similarly' is acceptable here" (e.g., because there is a common structure, etc.), then I don't know when to use that "similarly". If you understand it, I don't see a problem.

	When I first wrote this, I was feeling negative about "making people feel like they know what they're doing in one block of time."
		However, it may not be appropriate to criticize "making people feel like they understand in one block of time" if it does not guarantee logical correctness no matter how far they delve.
	 	Time to learn is a limited resource.
  It is a negative feeling to think that we find value in "feeling like we get it," but it is correct because if making the subject feel like they "get it" helps them remember the concept, apply it, and produce results, then it is useful. see [pragmatism].

Notation shake: [round drowning] [round memorization] [round memorization]

relevance
	[when you don't understand, all you can do is quote]
