Model, glasses and portrait
>[https://twitter.com/ibaibabaibai/status/474381796826562561 @ibaibabaibai]: "[Model] = [approximation] of how a phenomenon works" http://heartruptcy.blog.fc2. com/blog-entry-150.html ...
> is an idea similar to a sense of physics. I think it is a theory that "[model = portrait]". Akaike's view of models is more like "[model = glasses]". Statistical models can be placed somewhere between these two extremes.
	The intention of the "portrait" and "glasses" in Dr. Iba's statement, "I am a portrait of a portrait" and "glasses," was discussed within the company, so Nishio explained the text.

I thought it was about [epistemology] in philosophy.
	The "model = portrait" theory
 	Assumption that "human reason can recognize phenomena."
 	The idea that a "model" is "an approximate representation of the phenomenon.
  The basic premise of a portrait is that the true face is recognizable and an approximation of it is created.
  Philosophy: man is able to recognize truth through the use of reason ([clear evidence theory]).
 The "model = glasses" theory
 	Assumption that "human reason is incapable of recognizing phenomena."
		The idea that a model is "a tool to better recognize a phenomenon.
  Glasses exist as a tool to help us see faces better without them, as we cannot recognize faces without them
  	I didn't say, "Put on your glasses and you'll see their true faces."
  Philosophy: man cannot recognize truth, but can only make imperfect imitations ([copy theory])

> Dr. Akaike: "There is no one and only true structure. We approach the ultimate truth or true structure, which is always in an unknown state, through the search for a better model. The truth we pursue is only relative in the sense that it depends on current knowledge, such that it can be represented by a model that gives one approximation of the subject."
	https://twitter.com/tkdmah/status/29237875870535682

> In the latter half of the 20th century, as real-world problems became increasingly complex and diverse, the traditional framework of statistical inference, which assumes the existence of a "true model," gradually became inappropriate for reality.
> In 1973, Akaike proposed the Akaike Information Criterion (AIC), a criterion for obtaining a model that gives the best predictive value for a given situation of predicting future data, leaving a great mark in the history of statistics.
	http://cpis.soken.ac.jp/project/publication/journal/no.12/doc/02-05.pdf

Dr. Akaike may be positioned in the history of philosophy as advancing the statistics of the copycat theory position that humans cannot know the "[true model].

Related: [all models are wrong].

2017-06-09
2022-05-20 Slightly improved text.
