Better off investing in new curves.
Paintings and their description in June 2014.

[https://gyazo.com/e2857c7b42cbdba8fe7b8cc1baa07164]

whole
[https://gyazo.com/a322e66095217076ba7d10048f99c69b]
　In the figure, "but even more profitable in the long run to invest in the new curve" should be "but even more profitable to invest in the new curve."

 Explanation: for certain [investments] such as [learning],
  Investing time and other resources does not immediately increase returns.
  After a certain amount of input, the amount of return per unit of time begins to increase (increase in productivity)
  If you keep investing in the same areas, the amount of improvement per unit of investment gradually decreases.
 This is a property of the #S curve. #S-curve
 I know you disagree with the third, but let's start with a working hypothesis.
	What phenomena can be expected from this model?
		Before the threshold, the situation is that "productivity does not increase even if you learn," so it becomes rational not to invest in the short term. On the other hand, if a certain amount of investment is made (e.g., by going to school to study) and the threshold is exceeded, the situation is that "productivity will increase more than the time spent learning," and investment becomes rational in the short term.
		As the investment continues to grow from this successful experience, the growth becomes slower and slower. When the slope of the curve "return obtained per unit of time converted into time/time invested" falls below 1, the investment will not pay off immediately. However, it can be justified by saying, "Well, the productivity increase is only a little, so it won't pay off right away, but in the long run it will pay off in time saved in small increments.
	 The action that has been repeated so far has become "lossy in the short term," so the viewpoint is shifted to the long term, saying "it is not lossy in the long term," but the optimal solution has not been found because the search range is narrowed down to "the action that has been repeated so far. In that long-term range, there is a possibility that investing in a different curve and going through the area of zero return is actually the optimal solution.

	Anticipated rebuttal: "It's not a gradual gradual, it's a gradual steepening!"
 	I understand that feeling very well myself, but I can't think of any justification for it.

	Q: When investing in a new curve, can resources be diverted from an existing curve?
 If we assume that "when investing in a new curve, you can divert resources from the existing curve" is true, and that the new curve offers the same return with less investment, then we can explain that repeated attempts at a new curve will lead to exponential growth. However, this model begs the question, "Is there an acceleration effect in any case? When is there and when is there not? →I feel that the discussion will eventually turn to "the stronger the relationship with existing fields, the higher the acceleration effect," and the "we should try new fields" will be omitted.

 (tokoroten) If you base the curve on [innovation], it gets progressively steeper, but if you just collect existing knowledge that has been documented, it gets progressively more gradual.
 	(nishi)In the case of gathering existing knowledge, it is easy to understand the argument that the slope must inevitably be gradual somewhere because of the "total amount of existing knowledge". But I can't think of any justification for the "innovation is gradually getting steeper and steeper" one (although I personally think it's correct).

	(tokoroten) [Mathematical model] of [innovation dilemma]/[disruptive innovation], right? If that's the case, I think you're saying that it's right to continue continuous innovation by investing in close areas and improving products.　I'm talking about a company that failed through diversified management because it couldn't create synergies and couldn't add up between the curves.
 	(nishio) I was thinking of a "mathematical model of the economic rationality of the activity of individuals learning things. Well, as for the origin of the idea, the curve itself is the one that says "if the performance of the product is too low, the utility is zero, and if it exceeds a certain threshold, the utility starts to grow but it diminishes" in the context of disruptive innovation, and the temporary negative value in connecting the S-curve is the so-called innovation theory that connects the S-curve of technology The S-curve is temporarily negative when it is connected to the S-curve of technology.
   [https://gyazo.com/c19c59b7fff1d8acba7e59deddb23e38]
		A few years ago I was vaguely thinking that the more you learn, the more efficiency you learn and the more you accelerate, but on the other hand, the "saturated with S-curves" argument was also compelling, and I wondered how to understand it.
  At any rate, having written and explained it on Facebook, I realized that "but it is more profitable to invest in the new curve in the long run" should be "but it is even more profitable to invest in the new curve" in the diagram.

 You make the point that "returns from different curves added together do not necessarily equal the overall return."
 	Maybe if I throw all my energy into music theory now, I won't get paid more.
  What you learn may increase the output you can produce per unit of time, but it is hard to say whether that output can be converted into money or time that can be reinvested in the next learning experience.
  Is it a case of "diversification without synergy" where it is a simple addition, or is it a case of synergy where a function is multiplied such that 1+1 is greater than 2?
  But you can't know in advance how much synergy there will be.

 (tokoroten) If the vertical axis is the knowledge axis, it is projected again from here to the profit axis. Since profit is produced by small differences in information, the shape of the graph will be similar to exp.
 	(nishio)Yes, the problem lies in the fact that the vertical axis of the S-curve of knowledge was implicitly assumed to be "amount of knowledge = return per unit time = money = time".
  Maybe "knowledge -> profit" isn't a function, maybe it's a probability distribution like this.
  [https://gyazo.com/a28b67d4c4bdfe0dc2be5809bd2baf25]
  [Poisson distribution]: A distribution of the probability that a phenomenon that occurs on average λ times in a unit of time will occur k times in a unit of time.
		(tokoroten) So you get an improved success rate and a bigger return on a blended hit? Very convincing. So, this is incorporated into a game called "A's Magic Circle"? The puzzle pieces fit together in my head.


First published at https://www.facebook.com/photo.php?fbid=10203499442943251 2014-06-17 #Knowledge Acquisition Strategies

 #Learning Curve
 #Knowledge Growth Curve
