Real-life examples of task execution order confusion
	事例1
 	Steps to Occurrence
  	I had something that needed to be done during Monday, but I couldn't focus on it because I had an event on Sunday, so I wrote in my schedule book that I would do it on Monday.
   Results of Sunday's event
   	I was too tired to do the tasks I was supposed to do on Sunday.
    Two new tasks have been added.
   Task execution order confusion occurred.
  List tasks first as a coping mechanism
  	Homework" Homework for a public lecture scheduled on Monday and due on Monday.
   Contact" Sent email to book manuscript reviewers with a previously announced deadline of Monday.
   	We were supposed to do it on Sunday.
   Feedback" to the team you are mentoring regarding Sunday's event.
   	No deadline, but the sooner the better.
   Software implementation with policy set at the "Implementation" Sunday event.
   	Better if it can be shown at Tuesday's meeting, but not a MUST.
    Better if it is completed by the meeting in 11 days,
    If it is not completed, it needs to be made separately with an idea of what will be discussed at that meeting.
  Wife's Criteria
			Anything involving other people needs to be done early because there is a waiting list.
   If there is no difference, put away the things that will be done quickly and reduce the psychological burden.
  Wife's decision
  	Objects involving other people
	  	The "contact" (if you don't care about the content) is just sending an email, so it should be quick, and I'll do it promptly.
 	  Feedback is next.
				Homework" is not "something you have to do" because you only get yourself in trouble if you don't do it.
  懸念点
  	Implementation," in the broadest sense, is also something that involves other people.
   When I verbally explained this to my wife, I didn't go into detail about the "implementation."
   But the reason it is not explained verbally in the first place could be "because the 'next action' is not clear enough to be explained.
  next action
  	Let's do the "contact" and "feedback" and reduce the number and then think again.
			Limit "feedback" to 1 pomodoro since it is an infinite time sucking task.
  進捗
  	I thought I could do it in 3 minutes, but it took me 3 minutes just to prepare the text, almost the same as last time. In all, 8 minutes.
   Feedback was written approximately in one pomodoro, but over time with a few additions.
   	I should have measured how many minutes "a few additions" took.
