rhetorical afterimage
Reading too slowly will hinder comprehension because the memory (afterimage) of the previous sentence will facilitate comprehension of the sentence.

[The Lesson of Idea] (Chikuma Bunko) [Shihiko Toyama] 204p_448042685X.txt
150:
There must be something that ties them together. This is the hypothesis. The action that supports the continuity of discontinuity in language has been hypothesized. However, this is not enough to move us forward. One day, as I was walking after getting off the bus in the suburbs, I heard the sound of a zither on the wind from across a wheat field. I immediately thought, "This is it. The sound of the zither was broken up one by one. But when I listened to it from a distance like this, it sounded like a series of notes. I realized that the cracks of the previous note covered the next note, filling the space between the two notes. This gave me a glimpse of the principle of the continuity of the discontinuity. But it was not yet an immediate hypothesis. I don't remember how long I kept it there, but it must have been lying dormant. One day, the film suddenly became interesting again. I was able to recognize an analogy between this and the previous sequence. This led to the hypothesis that words have the property of generating rhetorical afterimages. If the next word is followed before the afterimage of the previous word has disappeared, the words are separated from each other,
185: I believe that the fact that when a sentence is put together, the breaks in the sentence disappear and movement occurs is due to the action of afterimage. Since film is based on physiological afterimages, but writing is based on the psychological afterimages of language, we have made this a hypothesis called rhetorical afterimages. In other words, the χ in C ¨ χ is a linguistic afterimage. The [method of analogy] is an extremely rich hotbed of ideas
If you master it, it is not difficult to create ideas. Once this is mastered, it is not difficult to generate ideas.183 III How to Create Ideas

[Serendipity of Random Reading] Shihiko Toyama 205p_4594069967.txt
5:6The Significance of Random ReadingAnti-Conventional ReadingP/[Alpha Reading and Bater Reading]7./No Genre Bound74/Introductory Text to Random Reading77/No Fear of Failure79 7SerendipityThe Ability to Discover the Unexpected82/The Chemical Reaction of Reading85/1 Travelogue88 81Ga^0 to "Rhetorical Afterimage" My Random Reading94/[Method of Analogy]97/ Sequence of Discontinuity of Words99/ Utility of Random Reading@vivacity thought
95:勒顆(R〉 "[rhetorical afterimage]" up to
102:In the English example,.... In previous English grammars, .... ...has attempted to rationalize by indexing....
My idea was that the break was not indexed, but that the afterimage was responsible for this break. The afterimage of the plurals was extended to the verb and brought out the third clause. I gave this afterimage the name "rhetorical afterimage. When we recognize rhetorical afterimages, we find that we can recognize their effects in various places, not only in the examples shown in the previous paragraphs. For example, there are times when the meaning of a sentence in a foreign language, which is difficult even for a dictionary expert, is not clear no matter how much you check the meaning of the word. In such cases, if a native speaker of the language reads the text aloud at a natural speed, the meaning can be understood without any other explanation (cid:8270). Afterimages disappear in an instant, so it is difficult for them to work in close reading and decoding. If a foreign language is read too carefully or too slowly, it can be said that the afterimages that naturally work are killed, making it more difficult to understand than it actually is. The afterimage effect is also a strong point of the Japanese language. Consider the haiku by Basho, "The sound of water in an old pond and frogs jumping in... Haiku is a form of poetry that makes full use of rhetorical afterimages without being conscious of them.

The hypothesis of rhetorical afterimages was created using the analogy found in Torahiko Terada's "The Scientist and the Brain," but I learned the analogy through reading randomly just for the fun of it. I have never been taught the method of analogy, so I can say that it was a serendipitous experience for me. It seems that the lingering effects of images, echoes, and reverberations of words are obtained through casual reading. If we read only books in narrowly specialized fields, our minds become inactive and uncreative. It seems to lean toward mimicry. On the other hand, unexpected ideas and hints are often hidden in books that we skim lightly, which is the benefit of binge reading. The reason for the appearance of specialized idiots is that they have been in the same kind of place, and if they get out of the place and swim in the ocean, they will be able to find abundant blessings. The good thing about binge reading is that it is fast. Reading for expertise or knowledge tends to lead to unintentionally slow reading. Words, as I mentioned earlier, have afterimages. Since it is a temporal phenomenon, careful reading makes it difficult to read with the help of afterimages. In this respect, careful readers are not as good as discourse. The spoken word has a certain speed. It is interesting to note that intelligent speakers are said to have a faster tempo, and while the emotional effect of slow speech is valuable, it is difficult to think of new ideas or to be original. Written words are generally slower paced than spoken words. It is worth noting that the tempo of the written word is generally slower than the tempo of the spoken word, and that reading the written word is faster than the tempo of the spoken word. The reader has the advantage over the author in terms of the tempo of the words. It is unwise to read in a namelike manner just because it is difficult. In fact, there are many who recommend reading the text in a namelike manner, but this should be considered carefully.

[Organizing Thoughts] (Chikuma Bunko) Shihiko Toyama 223p_4480020470.txt
65: It is a theory. There is one more point that must be noted. Neither inertia nor afterimage lasts forever. They disappear after a while. just like the afterimage of an object
In the case of a moving object, "shinkaku" is not clear. When a movie film is projected very slowly, the first image on the screen flickers, and the intervening blank space appears on the screen as if it were itself, destroying any sense of continuity. In the case of words, too, the sense of flow and movement can be felt only when the words are read at a certain speed. In a difficult text, or in a foreign language that is written in a dictionary, the parts of the text are often "harajuku" (meaning "to be sparrowed").
It is difficult to grasp the meaning. The afterimages disappear and the gaps are not filled in. If you read the difficult parts of the text as fast as you can, you may find it difficult to understand the meaning of the room (outside, often
It is sometimes understood. This is probably because the afterimage is alive and the parts are more easily integrated into the whole. When I realized that it is the function of the afterimage that allows the words and phrases in a sentence to be connected, even though they are separated from each other in this way, I thought I had solved my long-standing problem with the Japanese language. I felt as if I had resolved the long period of my field (ma) in a tsuwa (dispute).
The word [rhetorical audience] is named afterimage. I mean an afterimage that occurs in a text. The above is a detailed description of the process of the birth of the idea of rhetorical afterimage.
It is not because I thought it would be a narology concrete example. What we see here is an analogy. The enigma of the discontinuous sequence in the text is the film's fi

