hippocampal theta rhythm
Phase difference in the hippocampus results in a 10-fold temporal compression effect.

[Special issue: Theta rhythm-coordinated neural activity and memory formation in the hippocampus - RIKEN BSI News No. 22 (November 2003) - RIKEN Brain Science Institute (RIKEN BSI) http://www.brain.riken.jp/bsi-news/bsinews 22/no22/special.html]
	Stable rhythm of 4-12 Hz in rats during spontaneous action
 	It doesn't show up when you're not acting on it.
 Hypothesis about the function of the hippocampus: the spatial cognitive geographic map theory (O'Keefe and Nadel, 1978)
 	Cells selectively active in the rat's location and represent a map of the outside world as a cell population.
  They are called place cells.
 The relationship between place cells and theta rhythm was reported by O'Keefe and Recce (1993).
  This first report on the firing of individual place cells
 Skaggs et al.(1996)
 	Theta phase age difference
  The nature of the rhythms ticked by place cell populations
   The firing cycle of place cells is slightly shorter than the firing cycle of theta rhythm
   As a result, the earliest cells that start firing come earlier in a theta rhythm cycle.
   As a result, the time axis is compressed by a factor of about 10.
  LFP (local field potential) acts like a clock
  Why the cycle is so short is a mystery.
	Theta phase age difference and learning
  Can be explained by the phenomenon of retraction.
  	Retraction Phenomena = Fundamental Properties of Rhythm Interacting Systems
  The interaction of neuronal rhythms with the LFP theta rhythm forms a temporal pattern for the cell population as a whole,
  It is transmitted to neural circuits in the hippocampus, selectively generating synaptic plasticity within the hippocampus
  We proposed a model of hippocampal dynamics such as (Figure 2).
  Synaptic plasticity in hippocampal pyramidal cells is selective synaptic potentiation when pre- and postsynaptic cells are active with a time lag of tens of milliseconds."
  	Does this mean that this is not an observed fact, but that you tried to model it that way?
  Unidirectional synapses are formed in the active intrahippocampal cells with just the right time lag.
  	So basically, the whole whole whole union?
  Key assumption for phase age generation
	  Cells at the site of input to the hippocampus are activated at a frequency of about theta rhythm
   Its spontaneous frequency gradually increases with sustained activity
  In and around the entorhinal cortex, the entry point to the hippocampus, neurons have been reported to be active at frequencies near the theta rhythm and to vary in frequency (e.g., Egolov et al. 2002), so this should not be an unreasonable assumption.

 Computer experiments show clear differences in the ability to store time series correctly.
 Advantages of this model as a storage device
 	The fixed time difference (tens of milliseconds) that synapses identify and
  Connecting the gap between the event(s) being experienced (~seconds)
  →Time difference between synapses is fixed

 Experimental data: focusing on the components of the uniform phase shift,
  Activity in the dentate gyrus near the entrance to the hippocampus consists only of monotonic phase shifts
  Preceded by 0.2 cycles compared to the phase of CA1
 Consistent with model behavior

 In humans, the hippocampus is believed to be involved in episodic memory.
 Theta rhythm activity occurs simultaneously in several parts of the limbic system as well as in the hippocampus in rats
	Findings from human EEG measurements indicate that theta rhythms in the frontal center (Fm theta) occur during cognitive thinking tasks

[Hippocampal time compression]