Use of Images in Scrapbox
Keep your thoughts organized.

	When linking directly to an image published on an external server
 	Some people consider it "ethically undesirable," especially those who have experienced a time when server resources were scarce.
  Copyright law says that you are only referring to the copyright holder's publicly available material with a link, so you are not reproducing it.
  People may complain about developing with IMG tags, but the law that is the basis for prohibiting it is ambiguous.
 When using Gyazo to paste images that are publicly available on an external server
 	At the stage of Gyazo, it is legal for private copying because only the person himself can see it.
  If you put it on Scrapbox, which is visible to the public.
  	Automatic public transmission, which may be an infringement of the right to make transmittable
   With respect to the earlier act of reproduction, it may also be an infringement of the right of reproduction, since the requirements for private reproduction would no longer be met.
  If a portion of an image is cropped, it may be an infringement of the right of identity preservation
  The subject of these infringements is the individual user.
  Project Owner Responsibilities
   Linking to Scrapbox itself is not duplication, since it only refers by link to "what individual users have made public".
   If accessing certain pages on Scrapbox allows you to view infringing content, it may be an infringement of the right to make transmittable
   Did the project owner know that the rights of others were being violated?
    I have no idea whose Gyazo the link is for.
    We don't even know who made the edits.
    So there is no way to determine or inquire whether the editing was done by the author or with the author's permission or not.
   My liability is limited by the [Provider Liability Limitation Act http://law.e-gov.go.jp/htmldata/H13/H13HO137.html] because I cannot know "that someone else's rights have been infringed."
    I'll try to be a gentleman and respond to the removal if a complaint comes in, but I'm not legally obligated to respond to even that.
    What the complainant should do would be to ask Gyazo's management entity to remove or disclose the sender, and then file a claim for damages against the individual user who was disclosed.

	Infringement of Portrait Rights
 	There is no law governing the right of publicity in the first place.
  If you have suffered some kind of damage as a result of the publication, you can claim for damages.
  If the complaint is first responded to in a gentlemanly manner, and if that settles the matter, then fine, but if it does not, then "identify the sender and file a claim for damages.

 summary
  We can operate it as it is now without any particular concern, and if there are any complaints, we can respond to the removal at that time.