Setting assignments to listen well
 I often hear people say, "It's important to listen to others," or "Listen twice as much as you talk, because your ears are twice as big as your mouth."
 If it does not lead to a change in behavior, it is probably because the objectives are wrong.
 I can't hear what people are saying.
 	= I interrupt you and tell my story.
 	This may come from the feeling that "my idea is more correct".
		When someone is explaining something and you feel uncomfortable with the content, you interrupt.
		I start explaining my "right idea".
  That way you can only hear what fits your knowledge system.
 It is painful to try to "listen" only to act without resolving the thought pattern of "my way of thinking is more correct."
 	Because it would mean "having to put up with listening to someone who is not right.
  So the behavior of listening does not stick.
 All you have to do to be heard is to disarm the idea that your idea is more correct.
 	And to do that, we just need to clarify the purpose of listening.
  The purpose of listening is to gather information about how the other person feels and thinks.
  Only the other party knows how the other party feels and thinks.
  	It can't happen that "I'm right."
  	Your act of speaking your mind interferes with the collection of information on "how they feel and think".

	[questions cause flow state].

 It's less obvious than people who don't listen to others, but the other side of the coin is "I can't talk" and "I can't say what I think".
	 Considering that it is the flip side, this has to do with a lack of confidence that the other person's idea is more correct.
	 The fact that "I think and feel that way" is a fact that others cannot deny.
	 And I'm the one who knows more about it than anyone else in the world.

 People who don't listen to others and people who don't talk to others about their opinions.
 	It's two sides of the same coin, but dealing with those who don't listen is a higher priority.
	 People who don't listen are harmful in the short term because they discourage many people from speaking alone.
	 People who don't talk will slow down the distribution of information in the long run, but in the short run, that person will only be disadvantaged and not harmed by others.
		I talked about this in [BPStudy Learning Technologies for Engineers] as a problem with "[people who just say]"

#Listening #Confidence #Correctness #Questions

2015-07-04
	https://www.facebook.com/nishiohirokazu/posts/10206342852546714