差別化の罠
By striving to [differentiate] from the competition, you will instead lose the difference. #trap

 Youngme Moonの「差別化の罠」
  努力
  	Examine competitive products in detail
   	Add features that are not in your product
    Enhance features that are inferior to the competition
    Trying to make a difference by retrofitting features that have no difference.
 	This effort will cause change in the direction of eliminating differences in everything except "trying to make a difference".
  The "difference" is often a "superficial difference that can be added after the fact," not an essential difference.
  The result is a "product with no intrinsic difference" despite the effort

	In the context of personal productivity.
 	I think the biggest differentiator is "he/she is passionate about it".
		Working out of a sense of obligation reduces productivity.

	What's the differentiation?" The question "What's the differentiation?
 	Many people do it because it's an easy question to answer.
  	Related: [discussion of bicycle parking - bk blog http://0xcc.net/blog/archives/000135.html]
		When you don't understand the technical content, it is easy to pull out the closest thing you can think of and ask, "What's the difference between these things?" It is easy to pull out the closest thing you can think of and ask, "What's the difference?
  It's common to be exposed to these kinds of questions, so you need to think about countermeasures, but striving to differentiate yourself from such things in the early stages of a project may fall into the "differentiation trap" mentioned above.

 Mr. Takezako clearly states in his PM profile that he "welcomes reinventing the wheel" https://www.ipa.go.jp/files/000054588.pdf

 The addition approach leads to averaging.
 	[How to come up with good ideas https://www.slideshare.net/nishio/ss-74084313]

 Youngme Moonの考える差別化の罠の対策
 	Idea Brand
  	Reverse Brand
   	Ignore performance axes that are considered "good" in existing products
     Google's strategy of creating a page with only a search window as opposed to the amount of information that competitors are cramming into their portals.
     Cell phones for children/elderly people that dare to include limited functionality while smartphones are becoming more sophisticated.
   breakaway brand
   	Existing product classifications to be classified differently.
   Hostile Brand
   	Reverses and emphasizes the performance axis that the majority of consumers consider "good".
 				I'm not sure how it differs from reverse[nishio.icon].
					Is the difference between the "creator" or the "buyer" as the entity that thinks it is good?
				多数派に喧嘩を売りに行く(hostile)
				Aim for consumers to be polarized between "likes" and "dislikes".
	ref. http://amzn.to/2tCdKFB

 [Academia and the Trap of Differentiation].