Estonia
If you search in Japanese, you will find personal blogs, etc., but read the official government explanation in English, as the explanation may be outdated or the business may be "it's difficult, so I'll do it for you, you pay me". Estonia's government domain is gov.ee.

	Government Explanation
		https://e-resident.gov.ee/become-an-e-resident/
	FAQs linked from the government site.
  https://e-residency.zendesk.com/hc/en-us
 Starting a Business
	 https://e-resident.gov.ee/start-a-company/

	Estonian corporate income tax is 20% when distributed as dividends, etc., and 0% if profits are simply retained.
  In Japan, if you have a corporate status, you are subject to taxation if you carry over profits to the next year, so there is a last-minute management bias to invest the profits during the year without retaining them, but in Estonia, you can carry over profits and reinvest them when necessary.
 	When you distribute profits, you will pay 20% Estonian corporate income tax and then pay your own income tax on the profits you receive, so it is not a good deal. This is for those who have sufficient liquidity on hand and can hold non-cash assets.
   (Well, some people borrow money to own real estate even if they can't afford it, so it's up to each individual.)
  Tax payments are deferred, so reinvestment during that time could be beneficial.
  A simple parable:.
   A person with the ability to increase at a yield of 10% per year, in Japan, would make a profit of 10% and the profit would be fixed at about 20% in a single year, so the actual yield would be 8%.
   10% if the same person does business in Estonia, as they can reinvest without being taxed on their retained earnings.
   In other words, it would be the same as the 12.5% in Japan.
  By the way, with this "20% on profit" increment, it would take about 300/m in profit or 3600/y to pay off the 59euro/month maintenance cost of LeapIn, which is a ton.
   I think I'll try it for 5 years and if it's not croten, I'll start folding. 5 years of LeapIn cost is only 3,600euro.

	bank account
 	I'm not sure how to set up an Estonian account.
  But it seems to be quite difficult to set up a corporate account in Japan.
  Why not PayPal?
  There are Japanese blogs that claim that it is difficult to create an Estonian corporate account, but the Estonian government says it can be done 100% online.
  	>Start a company
  	 >Did you know, that e-Residency makes it possible to establish, register, and manage an EU based company 100% online from anywhere in the world? Now you can run your business from where you choose, without the need to hire a local director or pay expensive courier fees to sign a document.
 	Apparently, due to changes in EU law, it's not possible to open an account without a local interview.
  Rumors that Transferwize can do it.
  Can you do it with LeapIn?

 No withholding tax is required when royalties are received by an Estonian corporation.
 	So, if you do the writing for the Estonian corporation, you get 25% more in royalties with no withholding tax.
 If we outsource from an Estonian corporation to UpWork, etc., is that understood to be an expense?
 	If possible, it is better to hire an Estonian to create a physical corporate entity.
  But if you hire an Estonian, you need to understand Estonia's tax laws regarding social security.
 Value Added Tax (VAT) is not relevant unless sales are large.
  16 000 euros/year

	[Tax treaty with Estonia signed : Ministry of Finance http://www.mof.go.jp/tax_policy/summary/international/press_release/20170830ee.htm]
  [Key Points of the Tax Treaty with Estonia : Ministry of Finance http://www.mof.go.jp/tax_policy/summary/international/press_release/20170830ee_pt.htm]
  The conditions are not very clear, so it's a bit of a blur from a programmatic point of view, but in short, what I want to say is "don't use it for tax avoidance purposes".
  Business income in Estonia and the EU is taxed under Estonian tax law, while business income in Japan is taxed under Japanese tax law.
  It seems that royalties from Japanese books written in Japan should not be used as income for Estonian corporations.
  Business income in Japan can be declared and paid tax and then credited to the Estonian corporation as a business credit, from which expenses can be used.
  When business income is generated outside the country, it is retained by the Estonian corporation at 0% and can be withdrawn in the form of repayment of business owner loans.
  Since the repayment of the business loan is not a distribution of profits, no corporate tax is naturally imposed.

Explanation displayed after application
 >Here’s what’s going to happen next:
	 1
		 >Wait for your application to be approved and processed
		 >Application processing period is 30 days
		 >Once you have submitted your application, the Estonian Police and Border Guard Board will conduct your background check to ensure the safety and trust of the e-Residency programme
		 >The Estonian Police and Border Guard Board may request further information during the background check
	 2 (16 days from application)
		 >Receive confirmation that your application was approved
		 >After the background check has been completed, you will be notified by email whether your application is approved
		 >If you are granted e-Residency, you will be invited to pick up your digital ID card from your chosen location
	 3
		 >Pick up your Digital ID card in person from your chosen pick up location
		 >Bring the same identification document you entered in the online application form
		 >Submit your fingerprints to the consular or police official
		 >Pick up your e-Residency kit, including digital ID card and card reader


Nishio Timeline
	7/14 Application
 	Your e-Residency application has been received
  >Thank you for applying for e-Residency. Your application has been submitted and the Estonian Police and Border Guard Board will keep you informed about the application process by sending progress reports to the e-mail address you provided in the application. If your application is approved, you will be notified, and the e-resident digital ID will be sent to your chosen pickup location.
	7/20 application received
 	>Estonian Police and Border Guard Board has received an application for e-Resident Digi-ID submitted by HIROKAZU NISHIO born on 23.07.1981. The application number 1039195415 was submitted on 19.07.2017 and is currently being reviewed. 
 7/30 granted
 	>Estonian Police and Border Guard Board has granted e-Residency to HIROKAZU NISHIO born on 23.07.1981. 
  >You will be notified upon the document’s arrival to the place of issue marked on the application form. 
 8/24 Received at the Embassy of Japan
  >I am pleased to inform you that your e-Residency digital ID card has arrived at  the Estonian Embassy in Tokyo.
 9/20 I completely forgot to pick it up, so I went to pick it up.
  At 1:00 a.m., I send an email asking "Is 1:00 p.m. today OK?" but receive a reply at 10:00 a.m. stating that I am not available at that time.
  At 12:30pm, I said, "Well, how about 3pm?" I sent an email to the embassy without hearing back, and at 2:30 p.m. I got a reply back saying "okay".
  [hard to find the way https://www.facebook.com/photo.php?fbid=10213346851402308&set=a.1175498944176.2027303.1129148772&type=3]
  When you ring the chime, a receptionist will answer in Japanese, and when you say your name, they will open the door.
  The only thing in Japanese is the reception desk, and soon someone comes out from the back and speaks English.
  Show me your passport, sign the receipt, come here so I can take your fingerprints, next is your left hand, it will be valid after 11:00, use the card reader like this, tear open this bag, put the PIN inside and register your password, it's called two factor authentication, if you put the PIN wrong it will lock you out, be careful. If you make a mistake with the PIN, you'll be locked out, so be careful. Okay, here's my question. What's the plan? Where did you get the information? Internet? A simple conversation like, "Good luck, and I wish you all the best.
  They say it will be effective at 11:00 p.m., so we'll be back for the rest of the story.
  I received an email late at night.
  >Certificates for e-Resident Digi-ID ***** have been activated and the document is ready for digital use. 
  >Welcome to e-Estonia! 
	9/29 Install the software. It is clearly linked from the government page above so you won't get lost.
 	Chrome extension installed.
  https://www.eesti.ee/en/index.html
  You can log in using the private key in the IC card.
  [https://gyazo.com/b902ecf6553dfbec9adf91b559bf3424]

  Set up email forwarding. hirokazu.nishio@eesti.eeが自分のGMailに届くようになった.
  	It seems that notifications from the government are also sent to this e-mail address.
  Change your PIN not from here, but from a locally installed application.
  Need to get an address to start a business.
  	1Office, can log in with ID card.
   >1Office provides a business address service ... The service fee is 200 euro (excluding VAT) for one calendar year. 
   Which is better than LeapIn?
    https://www.leapin.eu/pricing
  Government says Holvi business accounts can be obtained online
 11/27 I created a Transferwize account. Is this OK?
  >For only four of these currencies however, that is when you activate USD, AUD, GBP and EUR currencies on your Borderless you are given virtual bank details. 
 	>The only limitation is that the USD Borderless account can only accept payments sent via: ACH electronic payments, Wire transfers from within the USA, the AUD account receive money from local Australian bank accounts, the UK account can only take: FPS transfers, CHAPS and BACS transfers from within UK and the EUR transfers can take: SEPA transfers, SWIFT transfers in Euros. Note that the accounts can only accept transfers that are made in the same currency as the one they are denominated in.
		In other words, if you create an account and turn on a currency such as USD, you will have virtual bank details, which you can use to proceed with the Estonian entrepreneurship process.
  The problem is the means of remittance in the second paragraph, and for me, who lives in Japan, I have only one choice: ACH in USD.
  	[What is ACH (FSA data) http://www.fsa.go.jp/common/about/research/20150706-1/01.pdf]
		I opened an account at CITIBANK some years ago to deposit business income in USD, so that might work.
  	>SMBC Trust & Banking integrated Citibank Japan's retail banking business on November 1, 2015 and continues to operate under a new brand "Prestia
   	[ref http://www.smbctb.co.jp/faq/transfer.html]
  >We are unable to provide services to trusts and charities from Japan. Please be aware of this.
   Conversely, everything else is OK.
		They ask for a corporate website. I wish I could provide one.
  PS: At this time, they only accept money transfers from within the U.S., even ACH by Transferwise support.
