Experiment with formulas and presentations in Scrapbox
An experiment in writing mathematical expressions: [de Moivre-Laplace's limit theorem].
An experiment in doing a presentation: [twin-shema model presentation].
Example of a PowerPoint presentation dealing with mathematical formulas: https://www.slideshare.net/nishio/3-71708970#43
	I wrote the same thing in Scrapbox [Derivation of Fisher matrix from KL distance].

impressions
	Good: 100% TeX
 	When I was a student, I used to discuss mathematical expressions in TeX in the chat room before writing a report.
  PowerPoint's formula tools can also use TeX, but not 100%.
 bad
  Not being WYSIWIG is troublesome.
  	With PowerPoint, I can click on a subscript and edit it, whereas with Scrapbox, I have to go back to TeX after clicking on it, so I have to look again to find the subscript I want. It's a hassle.
  	I've heard that you can open them in two browsers and put them side by side, but I wish they had standard support.
   It would be useful to be able to display multiple pages side by side, not just for presentations
 	If you start with a mathematical expression, the nonbleed is automatically erased, which is inconvenient when you don't want to erase the nonbleed.
  	Like the case where the subject of a sentence is a variable.
  	In PowerPoint, I'd use Ctrl+Enter to do a non-nombre line break and write the formulas all over the place.
   The problem is that Scrapbox can't control "non-nomblable/non-nomblable".
 	In PowerPoint, you can normally use ( ) to adjust the content, but here you have to explicitly `\left(`)
  	TeX is bad.
  PowerPoint `1/2` TeX `1 \over 2` or `\frac{1}{2}` for frequently used expressions such as fractions
  	TeX is bad.
 good
 	PowerPoint has clear pages, so it's hard to make page breaks when formula development doesn't fit on one page.
  	With Scrapbox, you can scroll, so you don't have to cut into pages.
	good
 	In mathematical expansion, "by the theorem of ~" can be lumped together on a separate page.
  There is a permalink on the line
  	After a discussion in PowerPoint with formulas, I want to say something like, "Isn't the formula expansion here ~?" It is difficult to make a reference when you want to discuss something like that.
  	I'd have to type the formula number or say "what page, what line."
 bad
 	No detailed display control is available.
  	You have to give up and divide, it's not a tool to create a pretty presentation.
   I couldn't make the cover slide right.
   If you want to include information in your slides that you do not want to put in large print because it is not important, but you want to include it because you will need it for later reference (for example, a pointer to a paper)
   Image Size
	good or bad
 	Easy export to PDF from PowerPoint
  Scrapbox can be easily shared via URL
 proper use
 	It's good for casual presentations within a lab or company.
  	Conditions where you don't have to worry about how you look.
  Especially if materials are done in Scrapbox for rotating lectures and ongoing workshops, content will gradually accumulate and links will begin to occur between presentations, and after a year or so, something interesting will happen.
