CREATOR'S RIGHTS
Organize as briefly as possible on intellectual property rights, especially patents, copyrights, and trademarks.

First, roughly:
	Right to an idea → Right to a patent/patent right
 Rights related to written programs → copyright
 Rights related to the product's trade mark → Trademark rights (+ Unfair Competition Prevention Law)


[Patent Law http://law.e-gov.go.jp/htmldata/S34/S34HO121.html]
The "right to a patent" is a right to an invention.
	An invention is defined as "a highly developed creation of a technical idea utilizing the laws of nature" (Patent Law, Article 2).
		It is an old story that a program cannot be patented. 2002 amendment to the law clearly states that "a program is a thing".
 The right to a patent belongs to the individual who made the invention.
  Can be relocated by contract or otherwise.
  When a company transfers the rights to an employee's invention to the company, the company must pay reasonable compensation (Patent Law, Article 15).
   If a contract to transfer the invention to the company has been concluded in advance, the invention belongs to the company from the time of invention (amended in 2015).
 When a person who does not have the right to obtain a patent files an application without permission, it is called an "opening application.
  In addition, the right to obtain a patent for a joint invention is also shared, and a joint application must be filed. (Patent Law, Article 38)
 	In cases where a patent application has been filed without authorization (such as an open application or a joint application violation), it is possible to request that the patent be transferred to the original owner of the patent.
  	2011 Amendment to the Patent Law, Article 74(1) [http://www.harakenzo.com/jpn/column/article/20121210.html References]


Patent rights are rights to inventions
	The right to prohibit others from continuing to use your invention as a business
	 The patentee shall have the exclusive right to work the patented invention in the course of business" (Patent Law, Article 68).
 The effect of a patent right shall not extend to the working of a patented invention for the purpose of experimentation or research" (Patent Law, Article 69).


[copyright law http://law.e-gov.go.jp/htmldata/S45/S45HO048.html] Copyright is a diverse set of rights, but it is mainly concerned with programs.
	Unlike patents and trademarks, rights arise upon creation without application and registration
 	In the past, the (C) label was required (Universal Copyright Convention), but now rights accrue even if nothing is done (Berne Convention, no-formality principle).
 It protects the expression of a copyrighted work, so it does not protect ideas. If someone takes an idea and writes a different program based on the program you created, the program itself is different, so you do not infringe the copyright.
 A program written by an employee as part of his/her work makes the corporation the author, unless otherwise specified. The same applies to programs that have not been made public (Article 15(2) of the Copyright Act).
 	Therefore, if you use a program that you wrote while you were an employee, without negotiating with the user, saying, "It's OK because I wrote it," you are using someone else's work without permission, and you are the copyright infringer.
 It's hard to argue "don't transplant without permission."
	 Because Article 20(2)(iii) of the Copyright Act explicitly OKs "modifications necessary to make a work of a program which cannot be used on a particular computer available for use on said computer, or to make a work of a program available for more effective use on a computer


[Trademark Law http://law.e-gov.go.jp/htmldata/S34/S34HO127.html]
Trademark rights protect business indications that identify products.
 The purpose of trademark law is to "maintain goodwill in business" (Trademark Law, Article 1).
 A trademark is used by a person who produces and sells goods or provides services in the course of business (Trademark Law, Article 2, Paragraph 1).
 The applicant may prevent others from using a similar trademark in the product category designated at the time of registration. (Trademark Law Article 25)
	When a product label that is not registered as a trademark is taken down [Unfair Competition Prevention Law http://law.e-gov.go.jp/htmldata/H05/H05HO047.html], consider whether it constitutes unfair competition under Article 2(1) of the Unfair Competition Prevention Law.
 	The requirements are "widely recognized by consumers" (well-known) and "causing confusion with the product or business.
  Since the court will make a comprehensive judgment on whether the information is well-known, it is necessary to consult an attorney rather than making a judgment on your own.
