VALU
Impressions as of 2017-07-25
	What does VALU resemble?
		People who think it's a stock
  	Unlike equity, the business is not owned separately.
   Unlike listed stocks, there is no review or audit, it is lawless.
  	Maybe I should open an account with a brokerage firm and get some experience buying physical stocks before buying VALUs.
  People who think FX.
  	It is much closer, but note that liquidity is very low compared to FX.
  	Choose a celebrity VALU with high liquidity.
  In-game currency or a character drawn from a gacha.
  	It's rather similar in the sense that if a game is out of service, it has zero value.
   If you feel that holding a character is worthwhile, you can hold it for a fixed amount of money compared to drawing a gacha, which can be considered kind

Note from Publisher's Perspective
	If preferential treatment is tied to labor, VALU should have an expiration date.
 	You'll be forced to work endlessly.
	Special benefits should be given for long-term holdings.
 	Without any restrictions, you could "hold it for a day, receive the benefits, and sell it immediately".
  I hope it's still the type of preferential treatment that doesn't matter.
	Be careful what you promise.
  Buyers are paying money, so if you make promises you can't make casually and then go against them, they may say it's a scam.
  As long as the seller has clearly stated, "If you buy VALU, I'll do it," the seller is at a disadvantage in the event of a dispute.



 Aug. 1 Review was completed and the VA was released.
	8/2 12 people had added W to their watch list before he realized it.
 I changed the category from Software Engineer to Ph.
 https://twitter.com/nishio/status/892740662151397376
 Benefit Registration Screen
 	Deadlines can be registered as both start and end.
  Maximum and minimum number of holdings
  Image required
  Once registered, you cannot change or delete your benefit information later.

https://valu.is/nishiohirokazu

	8/7
 [https://gyazo.com/9483c40dd60e3fa68154575f0586b6c0]
 [https://gyazo.com/3c47a657a334f300508074693d356d2d]

	[https://gyazo.com/8dbf09d470a93eff9ea63373c3382cab]

 	"No sale can be made for more than the amount applied for until the first trans action is taken."
  Sold 1 VA at 0.000391
  I agree to the Terms of Use.
  "I agree that the transaction is not for speculative purposes."
  Sold 1VA at 0.000586
  Changed to Japanese Yen
  Opening price 145JPY
  High 217JPY