Automation of decisions
It would be interesting to explain artificial intelligence in terms of "automation of decision making".

 Humans think and make decisions on the spot.
 Human beings verbalize "how to make decisions" in advance, and human beings make decisions accordingly.
	 New part-timers who do not understand the nature of the work
 Humans verbalize "how to make decisions" in advance, and the machine works accordingly.
 	Most programs, expert systems

The human being verbalizes in advance, "What is noteworthy in expressing the situation?
　Prepare a lot of "situation data" and "the right decision in that situation",
　The machine calculates in advance "how to combine the situation data to make a decision that is close to the correct answer,
　Decisions are made based on the results of these calculations. Supervised learning

The human being verbalizes in advance, "What is noteworthy in expressing the situation?
　The goal is to verbalize "what kind of condition is good."
　Prepare a lot of "situation data",
　The machine calculates in advance "how the combination of data of interest is likely to be in good condition",
　Decisions are made based on the results of these calculations. Reinforcement Learning

The human being prepares a tremendous amount of "situation data" and "correct judgment in that situation" in advance,
　The machine calculates in advance "what is important out of the situation data" and "how to combine them to make a decision that is close to the correct one,
　Decisions are made based on the results of these calculations. : Deep learning, image discrimination by DCN, etc.

The "what kind of state should it be" is verbalized in advance by humans,
　Prepare a tremendous amount of "situational data,
　The machine calculates in advance "what is important out of the situation data" and "how to combine them to achieve a good situation".
　Decisions are made based on the results. ： Deep learning + reinforcement learning, Atari games could be played better than humans.


Deep Learning has eliminated the need for "humans to verbalize 'where to look'",
although
It's conditional on "if you have a huge amount of data."
And without data, of course, a human being would have to verbalize it,
The need to "collect data" in the first place has not gone away.