Scrapbox smartphone app I want.
Now that it's 2018-08-09, I thought I could just "open a private project in Scrapbox with [Porter], give it an appropriate title, and write more and more at the bottom. You can also take pictures and post them. You can also do voice input.

Related [Export Method Apps] [Scrapbox Export Tool].

2017-08-09
	I used 91958 and it reinforced my feeling that "this is not what I wanted."
 So what kind of thing did you want?
 I'll write this down.
 Background Information
  I've been posting a series of thought processes on Twitter for a long time.
   In other words, one post is short enough that even if it's less than 140 characters, there's no real harm done.
   I want to keep this up and writing.
  I use Facebook a lot these days.
  for some reason
   Twitter is hard to see after the fact.
   Facebook will be organized into threads.
   Facebook's iPhone app can comfortably post a series of
  It's a pain to write on Facebook and then reprint to Scrapbox.
  I'm starting to feel like I should just write on Facebook instead of using Scrapbox after writing all this.

 iPhone App
 	[https://gyazo.com/575670db5b19cab035b090850604c55c]

  I like that I can see my last post and that I can quickly post a photo.
  It would be useful to do something similar with Scrapbox on the backend

 use case
  Jot down ideas, etc. that occur to you while walking.
  I don't write long sentences. I write a little and then I post more and more.
  I'll do something like 7 posts while on the escalator.
  Damaging Use Cases
  They don't go back and correct misprints.
  The goal is to quickly externalize the thoughts in the brain. If you can write down what you just thought of before the escalator reaches the top, you can use your mind fully on new thoughts, instead of putting effort into remembering them on the walk from there.
  I want to be able to record what comes to mind as soon as it occurs to me. Even when I'm walking to change trains, I want to stop at the end of the street to write it down as soon as it occurs to me.
  As I'm writing this, I suddenly remember and want to write down something like "I'll pay Mr. K 2,500 yen.
  It is important to write down everything you can think of and eliminate the cost of remembering.
  How are you currently doing it? It's like you're writing on Facebook or you're taking a paper notepad out of your breast pocket and writing.
  If you are writing publicly on Facebook, and you want to remember something that cannot be made public, you will have to write it down in another notepad, which is not good. It would be better to have an app that puts everything you write in a private group in Scrapbox.
  If you want to see the dump results in a somewhat organized and readable form, then there is no need for the initial writing to be in a public place, and you can write it in your private Scrapbox, organize it, and then copy and paste it into your public Scrapbox. If you want to see the results in a form that can be read by others, it is not necessary to make the initial writing public.
 Now that the use cases have been explained, let's talk about the design.
  There are two reasons why 91958 does not serve the purpose.
  The first is where explicit action is required for saving.
   And where there is a waiting time of a few seconds for saving.
   I want it to save automatically in the background.
  The second is where you have to explicitly title it.
   I don't want to be asked for a title when I want to quickly save a thought.
  what would you do then?
   Automatically create a notebook with a title like "2017-08-09" and add what you have written to it.
   I don't know if it's better to buy something like Facebook or Twitter and not be able to easily edit the past, or if being able to edit opens up a whole new world, but I'm happy with the former for now!
   Maybe if you press BS right after a line break, you could go back to edit mode.
   (I assume that what you write down will be reviewed and rearranged later when you come to an environment with a PC, so you can add the revised version if you revise the worst-case scenario.
  	I'd like to see a better integration with Gyazo, but maybe Gyazo's side doesn't provide a proper API.
   I can live with the current system (Gyazo starts up, I take a photo there, and then go back and paste the URL in the clipboard) because it's just one extra step to paste the photo.
   I'm more inclined to wonder if it's possible to use the Gyazo app to take a landscape shot or crop it, but that would be out of scope this time.

	I wrote this content on Facebook and then organized it in Scrapbox.
 	[corresponding thread https://www.facebook.com/nishiohirokazu/posts/10213000288458451]
  