Let's assume the goal is to eliminate dissatisfaction.
2017-08-09
I was talking with [Jun Kuikei], a strategic consultant and unexplored creator, and he said, "[Purpose] is [the elimination of dissatisfaction]," which I found interesting. He said that when objectives are not clearly verbalized, many objectives are to eliminate dissatisfaction, so why not assume that the objectives that are not currently verbalized are also to eliminate dissatisfaction?

Purpose has a bias that tends to be lofty [tatemae]. On the other hand, [dissatisfaction] tends to be considered emotional and vulgar, and there is a bias to avoid mentioning it or to look away. In the field of consulting, if you only look at the objectives that the customer tells you about, it will not work if they are tatemae. Therefore, by saying, "Tell me what you don't like or what is troubling you," or "I am here to solve that," we take the feelings of dissatisfaction and convert them into logic so that they can be handled with reason rather than emotion. This is what motivates [problem solving], he said.

It is often said that "[clarification of purpose]" is important. Let's dig deeper and think about what that "purpose" is.
When you achieve your goal, there must be some change compared to when you did not achieve it. If there is a change, there must be a before and an after.
By separating them in this way, it becomes easier to clarify and verbalize "objectives" that have not been clearly verbalized.

On the other hand, when "the purpose is clear, but [the motivation] is not," it may be a good idea to question whether the "purpose" has become a form of "formalization.
We tend to think that achieving that "objective" is a good thing or a MUST.
So, let's say that some innocent person asks, "Why don't we just leave things the way they were before?" or "Don't we really need an 'after'?" or "Isn't it silly to put in the effort to make a 'change'?" If you are convinced that "You're right," then you might say, "I see. If you can agree with them, then the "purpose" was not necessary in the first place. On the other hand, if you can come up with a reason, "No, no, of course not, because...," then those words should help to further clarify the purpose.

[https://gyazo.com/7175d1e47adbff848b576f3cf91ffd3c]

#Amenojaku #Devil's Advocate
#言語化
#違和感

(Footnote: This is a technique that focuses on the change before it occurs, but conversely, a technique is also used that asks, "Once that change has occurred, what happens next?" and moving on.)
(Footnote: Strictly speaking, there are types of objectives that are not only about change, but also about "maintaining the status quo." The dissatisfaction with the objective of wanting to maintain the status quo is that there is a risk of change.)
