Drucker.
　[Peter F. Drucker]
	Self-described "social ecologist"
 "[Profit is] a condition, not an objective, of the enterprise."
  What society should be like for people to be happy
  What should the company be?
  Profit is a necessary condition for the survival of a company, and once it survives, it should invest in the happiness of its employees and society.
 The "future that has already happened" = "signs" of future change.
	Results."
 	@[Management Conditions].
  	The results that the organization should produce:
   	Direct Results" = "Profit.
    [Value Initiatives]."
    	Approach to creating [customer value
    [Human Resource Development]."
		To get results, you have to think about contribution."
   To be able to say, "I made these contributions," rather than, "I did my best.
   [Professional Conditions].
    It's not enough to be highly skilled.
    Contribute by understanding and meeting the [needs] of others.
 [Knowledge workers]: a misunderstood concept
	[Innovation]
 	The market is the judge of innovation.
  [7 Opportunities for Innovation].
  	unforeseen event
   Existence of a gap
   Existence of needs
   Changes in industrial structure
   Demographic Change
   Changing perceptions
   Emergence of new knowledge
  see [Schumpeter's Innovation].

	The purpose of a company is to create customers
 	Discovering hidden needs.
  To supply goods there.

 Know thy time.
  Chapter 2 of "The Requirements of Management," "Know Thy Time."
  The first step in helping knowledge workers achieve results is to document how they actually spend their time."
  'My observation is that those who achieve don't start with the work. They start with time. They don't even start with planning. They start by identifying what is taking up their time. Next, he dismisses unproductive demands on his time in order to manage it. And finally, we organize the time that is freed up in this way. Thus, the three-step process of recording, organizing, and summarizing time is the basis of successful time management."
  Those who achieve results know that time is the limiting factor. In every process, the most scarce resource is the one that defines the limits of results. That is time."
  "Those who work in organizations spend their time on the kind of work that contributes nothing to results but cannot be ignored. A great deal of time is spent on work that seems obvious but is actually of little or no use at all."

	1909 Born in Austria
	1933 Moves from Germany to England
	1939 "The End of the Economic Man: How Totalitarianism Came to Be."
 	Nazi Analysis
  Anticipate massacres of Jews and joining forces with the Soviet Union.
  At the time, the prevailing wisdom was that fascism and communism were considered opposites.
  Winston Churchill praised in Times book review
 1942 "The Future of the Industrial Man: Conservatism as a Principle of Reform."
 1946 GM research upon request → "What is a corporation, its social mission?"
  We must find disagreement, not consensus."
 1954 "Modern Management."
  His representative work according to him
  The purpose of a company is to create customers
 1966, "Conditions of Management."
 1969 "The Age of Disconnection: The Nature of What's Happening Now."
  Concept of "privatization"
  Thatcher adopted as basic policy
 1973 "Management: Issues, Responsibilities, and Practices"
  Later to become Management Essential Edition
 1981 "Japan: The Cost of Success."
 1985 "Innovation and Entrepreneurship."
 1990 "[Management of nonprofit organizations]"
 1993 "Post-Capitalist Society," "The Future That Has Already Happened," "Eyes to Read Change."
 	low birthrate and longevity society
 1999 "He Who Rules Tomorrow"
 	Parallel careers are mentioned in the second life (p224~)
		There is only one condition for having a second life. You have to be in the running long before you take the plunge.