Do not classify.
Those who say "classify post-its" in the explanation of the KJ method must not have read the explanation by Jiro Kawakita himself.
> One smart person suggested that since these materials are all related to management, they should be classified into this and that category. Several other people agreed with him, and a classification [waq] was decided beforehand. And accordingly, they were in the process of distributing the scraps of paper. As I have already mentioned, this is a problem of dogmatism that men, especially intellectuals, are prone to. So, I also broke up the papers in this room.
> As in this case, there are many people who think they know what they are doing in theory, but when it comes time to do it, they go down the wrong path. We have developed the bad habit of clinging to the "wakugumi" of "dogmatic categorization" and refusing to listen to the facts and the narratives of the information.
[Ideas] p. 79 #Framework

Even though we know in our heads that we should not classify, we tend to classify dogmatically, but this is an evil way and must be avoided. This way of thinking is difficult to convey no matter how much we emphasize it, so it is necessary to teach it repeatedly. In such a situation, when someone explains that "the KJ method is to classify Post-its," it makes me wonder, "Did this person read it properly?" I would be like, "Did this person read it correctly? It is said that some people are taught the KJ method by such a careless instructor and end up thinking it is trivial.

[Group formation goes from small teams to large teams].
[https://gyazo.com/973ea9617662cabdccfcf594eff6bb7c]
>It is totally wrong to go from a large division to a small division. You must always go from small to large. This is one of the critical problems with this method (see Figure 7).
>...
>In his mind, he has an arbitrary principle of grouping, such as, "In my opinion, it is correct to divide the contents of this many paper materials into three major categories: market research, quality control, and labor management. The company simply applies this dogmatic classification scheme and fits paper scraps of data into the ready-made framework. In this way, the conceptual significance of the KJ method is completely lost.
[Idea method] p.77

Do not [classify] [top-down]. [Organize [groups] [from the bottom up] #Group organization

#KJ method
[Jiro Kawakita]
