Toyota Kata
[https://gyazo.com/cedaabea6ced7019099b61b3b2dab5d8]
	Toyota's Kata: The Routines of Thought and Action that Underpin Amazing Performance
	[Amazon http://amzn.to/2wSe6Jm]
 The originator of the so-called "[kanban]"
 Remove [redundancies] to prevent failures and identify points for improvement by letting them fail frequently

	In "Kanban Work Techniques," the concept of "visualization of tasks" is easy to grasp, but in "Toyota no Kata," it is much more nuanced.
  Kanban ([pull system])."
  The goal of kanban is to eliminate kanban."
  "It is undesirable to establish buffers or flexibilities for the purpose of achieving a target production number, which does not solve the problem or improve the process."

 A means to be able to discover problems that need to be improved #Problem Discovery
  cycle time
  一個流し
  平準化
  Kanban (pull system)
	In a nutshell, we're cutting down more and more on margins, inventory [buffers], freedom of equipment selection, etc.
 Set up a masochistic setting that is so close to the edge that if something goes wrong, the line stops immediately.
 Improvements observed daily in that state.
  As programmers say [fail first].
  Be able to notice strange things right away.

	p.150
 	>If the objective is "to achieve the target production volume," a system that can avoid problems may seem preferable, but if the objective is "[to] continue to improve and survive," a system with a high degree of freedom is not acceptable because it makes it difficult to know the cause of the problem. A system with a high degree of freedom does not inherently improve the problem.

 I doubt that it can be applied to software development backlogs, since no two backlogs are the same, although cars can be made in any number of the same shape.
 The "kanban work method" commonly practiced today is not a pull system or leveling, but "work visualization.
 	Better to be visible than invisible.
  It's a common "phenomenon where only the easy part of a difficult concept gets popularized."
   It's like saying [the Pomodoro Technique] is like "work 25 minutes and rest 5 minutes."
