絶対矛盾的自己同一
 [西田 幾多郎]の晩年の著作
  [Read in Blue Sky Library http://www.aozora.gr.jp/cards/000182/files/1755.html]
 Reference from [Jiro Kawakita]'s [What is Creativity], p.79
 　[The conflict and cyclical relationship between conservatism and creativity] is that
	[Commentary by Seigo Matsuoka http://1000ya.isis.ne.jp/1086.html]
  From Working to Seeing," 1927.
  The "subject = objective = particular" becomes wrapped up in the "predicate = subjective = general."
  In the main, Gottlob Frege's "the predicate encompasses the subject."
	[Facebook https://www.facebook.com/nishiohirokazu/posts/10213127030386920]
-----
I was reading Kitaro Nishida's Absolute Contradictory Self-Identity (or more precisely, I was making sticky notes for the KJ method), and it became clear to me that the oft-repeated "[A is non-A and thereby A]" is not strange at all; it is exactly what it says, only that it is a very compressed expression. I realized that it's just a very compressed expression.
On the other hand, I thought that it is one thing to have the content correct, and quite another to be able to convey the meaning of "non" and "is" in the explanation, and that if the meaning of "non" and "is" are not conveyed properly, they will not be understood.

Dare I speak metaphorically, if "self-transformation" is to be self-transformed in the present moment, the past self and the future self must be different. As the limit of the difference between past and future, the present self is A and non-A. (This is not a contradiction if we imagine that the lower limit of a discontinuous function is inconsistent with the upper limit. It's just that "is" is not in common usage.)

 Let's put it in mathematical terms. Suppose the past is t < 0 and the future is t > 0. The present t = 0 is neither past nor future. Now consider the value of a function f(t) at t = 0. Let f be a function that is -1 in the past and 1 in the future. Since the domain of this function does not include t = 0, we can answer that it is undefined. However, there is an operation called "limit" in mathematics, so we will use it. In this case, if we take the limit from the past t < 0, we get -1, and if we take the limit from the future, we get 1. They are the same limit at t=0, but they do not coincide. This is not mathematically strange, it is just natural since it is a discontinuous function. An example of a right-sided limit and a left-sided limit that do not coincide. [One-sided limit - Wikipedia https://ja.m.wikipedia.org/wiki/%E7%89%87%E5%81%B4%E6%A5%B5%E9%99%90]

And if we take it one step further and consider the case "A is the self that continues to transform itself," then it is "A and non-A" at every moment and it is A. Since we define A as the self that transforms itself, we have "A and non-A" -> "is transforming itself" -> "is A". This can be expressed without mathematics as "A is non-A and thereby is exactly A".

Kitaro Nishida's concepts are said to be difficult to understand, but this is only because he speaks about the idea of mathematical limits in the language of philosophy without using any mathematical language. Because he is forcing himself to speak without using mathematics, it becomes something like "A is non-A". The "there exists [a place of nothingness]" in his previous work is the same thing as saying that infinity as the limit of repeated +1 "exists as a concept" but "doesn't exist in the number system".

The phrase "from what is made to what is made" appears many times in the text, and this is the world's self-transformation. Kitaro Nishida believed that the world is a world that continues to transform itself, and this is the result of the above discussion.

In the first place, Kitaro Nishida is stating his worldview that "the world is a self-transforming thing," and that when he considered in detail the conditions for the realization of this worldview, he came to the conclusion that it is an "absolute contradictory self-identity. I am not trying to prove that the world is self-transforming. Therefore, if you read the book thinking that it contains that argument, you will be confused.

He is also trying to say that "it is neither X nor not X, but an amalgamation of the two," but this is confusing because the naive worldview for most people is X. Incidentally, this naive worldview X is "a world in which the present is determined by the past" and "a world in which [individuals] like invariant atoms interact.

I think this worldview X is something that fits well physically, but I say, "But it doesn't fit well with human beings acting with intention or purpose or whatever."

The worldview of not X as the antithesis of this is a worldview in which the present is determined by the future, and the present is determined by working backward from the goal of being this way in the future. This may seem a bit shocking to those who have a physical worldview, but if you imagine, for example, that the world is designed by an omniscient and omnipotent God, and that everything that is happening today is the will of God, which is immeasurable to us, you will understand that this is not an impossible worldview.

Such contradictory things are identical, and yet they are identical to the self, hence the "absolute contradictory self-identity.

There are a few things that don't connect well (like the fact that the world of causality does not transform itself into the world of objectivism), but I've made a lot of progress, so I'm going to bed now.

Individuals are not the subject of their own actions, extreme. Is this called a predicate?

Since we say that an individual object "is," can it be a subject independently of whether it is willing or not? And when we say that an individual "is," it is accompanied by the concept of "place" as in "where is there. And when we say that there is a place, it is likewise in the place of a place. The extreme of this is the place of nothingness.

The first was to think about pure experience before the subject differentiates, and the second was to think about the differentiation of oneself as the subject of an action and oneself as the object of an action. There is an "inverse correspondence" between such early writings and later writings, so if you read them mixed up without distinguishing between them, you will get confused.


-----
実験1
Below, we attempted to structure it on Scrapbox, but decided it was not appropriate and aborted.
It would be interesting to make sticky notes with the statements "~ is" and "~ is not" and do the KJ method.

P1 below refers to "paragraph 1."
 P1
 	The real world must be a world where things work with things.
   [nishio.icon]相働くとは何か
  The form of reality can be thought of as an interrelationship between things, the result of things working together.
   [nishio.icon]Working together = interrelated, eh?
  But for a thing to work, it must deny itself, it must cease to be a thing.
   [nishio.icon]なぜか？
  The fact that things work together to form one world must mean that things can be thought of as parts of a single world.
   [nishio.icon]そうか？
  For example, for an object to work together in space, it must mean that the object is spatial.
   [nishio.icon]空間的とは何か？
    Perhaps not "spatial" as a general term, but the context of field theory. The contrast between an object in space and the space in which it is located.
  At the extreme, if we consider something like physical space, physical force can be thought of as a change in something spatial.
   [nishio.icon]物力とは？
  But to think of things as a part of a whole, no matter where they are, means that there are no more working things, that the world is static, and that reality ceases to exist.
   [nishio.icon]そうか？
  The world of reality must be one of many, a world of mutual limitation between individuals and individuals. Therefore, I say that the real world is absolutely contradictory and self-identical.
　P2
  Such a world must be a world that moves from the made to the made.
  It is not, as in conventional physics, a world that is established by the interaction of invariant atoms, i.e., it is not a world that can be considered as one of many.
   [nishio.icon]Conventional physics = world established by universal atomic interactions = one of many
   [nishio.icon]客体
  If you think about it, the world is just the repetition of the same world.
   [nishio.icon]なぜか？
  Nor can it be thought of as the development of the total one as a purposive world.
  	[nishio.icon]なぜか？
  If this is the case, then individuals do not work together.
  It must be a world that cannot be thought of as one of many or one of many.
  The world must be a world in which what is given is made, that is, given dialectically, and moves from the self-denyingly made to the self-making.
   [nishio.icon]Things made -> Things made
   [nishio.icon]客体→主体
  It is not possible to think of the total one as a base, nor is it possible to think of the many as individual objects.
   [nishio.icon]全体←→個物
  [The "creative world" that truly moves by itself as a "phenomenon-immediate reality" must be a world like the one described above.
  While what exists in reality is something that has been determined to any extent, it is also something that has been created to any extent, something that is changing, something that is dying.
  Therefore, it is called the world of absolute nothingness, or the world of limitless motion without limit.
   [nishio.icon][絶対無]
　The world of contradictory self-identity as described above must be a world in which the present is always considered to limit itself to the present.
 It is not a world causally determined from the past, i.e., not one of many, nor is it an objectively determined world from the future, i.e., not one of many.
  [nishio.icon]因果論的←→目的論的

We have attempted to structure it on Scrapbox up to this point, but have determined that it is not appropriate.