灘校土曜講座2014
	Title "[Designing a way to learn] A process of [learning] that starts with noticing [blind spots]" #Learning
	[2014] year [Nada School Saturday Lecture], spoken to junior high and high school students.
  Original slides http://www.slideshare.net/nishio/ss-40713032
  Addendum Slides https://www.slideshare.net/nishio/ss-40813458
  Questions gathered and answered later on the blog [Nada School Saturday Lecture 2014 Questions].

The following is the added version of the slides
[https://gyazo.com/5d92458cd51bb5f1eea2c0532c264989]
The process of learning that begins with noticing the design of learning [blind spots] This slide shows the lecture material used in the Nada School Saturday Lecture in 2014, with verbal exchanges and questions.
Added by Yasukazu Nishio, Cybozu Labs (52nd year)

[https://gyazo.com/7b6f451e5dee2660d7c8cf7a87fe01b2]
2 When an alumnus speaks at a Saturday class, he/she may often say, "I will tell everyone the right answer that I know.
I'm not here to tell you the right answer this time, but to share a problem I'm struggling with and get some ideas.


[https://gyazo.com/11afd4fde2e1e06aa0ff367fc75742c1]
I thought the way we have been doing things was fine, too. We're good at learning, right? At least we passed the Nada School, and most of us will go on to Tokyo University and Kyoto University. So we don't need to design it specifically.

[https://gyazo.com/7ec40cd35990f83f6fa33b491918cdd0]
4I'll bite into the process of studying to get into Nada, Kyoto University, or Tokyo University...
	Given a problem
	自分の力で解き
	Results are graded.

[https://gyazo.com/8355ba2c36400546e2bf15aeb8dc2f82]
5 problems are given

[https://gyazo.com/1bb523e742f4dcf506ebcf798a9b5f77]
6The problem is outside of yourself, and although it may seem obvious, is it really? But is it really?

[https://gyazo.com/c5f95d5c6a413512078ce079d7cfbecf]
I joined the company, there were no problems prepared for me to solve, I wondered what to do.
Ultimately, the problem is the gap between the reality outside of you and the ideal inside of you.
Working with reality to change it to an ideal state is called "problem solving. The problem itself does not exist; if the ideal is abandoned, the problem disappears.7 Another way to think of the problem is the gap between the ideal and the reality.

[https://gyazo.com/6b45595b83d46744efd5a994987732c4]
8自分の力で解く

[https://gyazo.com/f69f77e0b9aa46962c0cc9eae853ec52]
9When studying for a test, we tend to think that if we don't solve the problem by ourselves, we won't be able to do the math. But no one in the workforce does written arithmetic...right?

[https://gyazo.com/534d7dff6a71ba26c5f6c2f5c931096a]
They do not calculate in writing, but use calculators or spreadsheets. They also use Mathematica and Wolfram Alpha for transforming formulas. Working people live a life in which it is better to use what is available than to use only one's own power because it is more powerful. They use calculators, software, and the help of colleagues and friends outside the company to solve problems. The idea that 10

[https://gyazo.com/8ee7a08015f76d171e0358cbea716bc2]
11The results of the study for the exam, where the results are graded, are of course graded.

[https://gyazo.com/8deea13019b43e971bfb22aad883cfe3]
The students are graded on how well they got it right in comparison to the 12 correct answers! So, what does it mean that the correct answer is already in the society? What do you think it means?

[https://gyazo.com/ca6a030def900dc3c08c49253ea438c7]
13It makes no sense from a business point of view, because the correct answer is already there, which means that someone else has already solved the problem, and my solving it will not bring any value to society.

[What is correctness?]

[https://gyazo.com/1da9b0731218b965c7143fa7783505b3]
I'm good at this.36 I've looked at each of the three situations individually, and I've found that we're given a problem, we solve it on our own, and the results are graded.

[https://gyazo.com/9a1068f5e971036352ea6423b0f0c003]
However, there are situations where we don't know what the problem is, teamwork is required, and no one knows the right answer. What should we do in these situations? What should I do in a situation like this? 37

[https://gyazo.com/5c79627756a27863acd56997696e11e4]
38 College ChoiceThere are probably still a lot of the former situation right now. I think the balance will be reversed about between college and society.

[https://gyazo.com/79b5cbc588a07297ef0d77547c9e165e]
39The timing of change varies from person to person.
I chose Kyoto University without thinking too much about it. I chose Kyoto University without thinking too much about it.
Many people are troubled by their inability to find the "right answer" in job hunting... College choices that seem to go smoothly and smoothly but leave a debt in the future.

[https://gyazo.com/2333677075e6955a5c9bd02ac3d993d6]
40Past successes can hinder a change of mindset.

[https://gyazo.com/7a34a9b087e055856c9e34a881a7acfe]
41 (休憩)

[https://gyazo.com/6150be6b9c8933fc54a16346ea9d969c]
How can we learn in a situation different from studying for an exam, where we don't know what the problem is, teamwork is required, and no one knows the correct answer? I would like to think about this. What do you think we should do? How can I learn in a situation where I don't know the right answer? 42

[https://gyazo.com/927cbdeaa7a5a2625877ca64a066d2e9]
43At least I can say with certainty that in order to learn something new, you need to be aware of your [blind spot], your blind spot: what you don't know, and what you didn't realize you didn't know.

[https://gyazo.com/d9ef0269c814dd7e442dac95ced070fb]
! What to do about areas for which there are no textbooks? Of course there are no textbooks on the cutting edge of research, how to choose a relationship or a company... well, there are books sold pretending to be textbooks, but they may or may not be correct. Only in a few fields where we are blessed that textbooks can be trusted to be correct.44 Now, in your current situation that textbooks give you, reading textbooks will give you more and more blind spots that you didn't know about, saying, "Oh, I didn't know this, I have to learn it.

[https://gyazo.com/1095801c551901c65b0a03f96fce62ab]
Understanding "This is the way it should be" and finding discrepancies with one's own understanding45 Observing reality without preconceptions "The problem is also related to the gap between reality and ideals. First, carefully observe the reality, including experimental data. If you find a discrepancy between your understanding of what should happen and what you think should happen, there is a blind spot that you have not yet noticed.

 [It's hard to look at it without preconceptions.]
 [Is the learning ladder model correct?"]
	[exchange knowledge and learn from each other].

[https://gyazo.com/b2206955a5cb647bc2a21754e6441d01]
58In other words, Nada's school motto is "self and others co-prosperity," so we aim for a form of "Seiryoku Zenyo Jitaku Jitaku Kyo Prosperity" in which we and others can prosper together by teaching each other, not by teaching the other and being taught by the other.

[https://gyazo.com/fb46873acaf0385a825037256e2c4904]
This is my explanation of how to learn in a situation where "no problems are given". If you have any points that you think are different, please feel free to point them out to me on the survey form that is in your hands. If you do, we can make it even better next year. Please let us know what you think, too.59

 [灘校土曜講義での資本主義の話]
 	The emergence of [capitalists] through the industrial revolution and [post-capitalist society].

[https://gyazo.com/24f0543a02857c02b068b246987a62b2]
Knowledge Efficiently
Knowledge to gain = how to learnI really want to know about this. If I could pay to buy it, I would. I can't buy it, so I'm reading books, taking time to think about it, giving talks and getting feedback, and one strategy I'm thinking about right now, a direction... I want to invest in this. I'm trying to figure out how to invest in this73

[https://gyazo.com/a4a56dee4976f9d160f2ded716c0f845]
74 principle that the more abstract the knowledge, the greater the range of applications. Consider, for example, mathematics.

[https://gyazo.com/8e2a688faebf7e0550770ea8373280b8]
You're not memorizing the answers to specific problems, you're learning the ability to solve "unseen problems" You're not memorizing the solutions at the end of a math problem book. You're learning "how to get the answer" in abstraction, not the specific answer, and you want to learn this abstract methodology efficiently.75

[https://gyazo.com/5149edaefed816c492e298e4c86fcfc4]
Can we learn only how to solve problems without solving 76 specific problems? Is it possible to learn only abstract knowledge efficiently? I once had such a thought.

 [abstracting experience to foster understanding].
 [Knowledge that is not connected to experience cannot be applied.]
 [Knowing is worthless].

[https://gyazo.com/87132f9a9f2114362d5d7c9eefbc242f]
Therefore, you must not only have specific detailed knowledge, but you must also develop a body of knowledge within yourself that can create value by applying it to newly emerging real-world problems. Not just knowledge of who did what in what year, but you have to develop it to the point where you can apply it to lecture opportunities and create value by giving this kind of lecture. If you stop at a halfway high level, you will not produce value. How do you develop within yourself a body of knowledge that can be applied and produce value? I believe this is necessary. So, how can we do this? How can we do this?

 [Okay" is a hypothesis.]
 [Let's test our hypotheses by experimentation.]

How do we make the first hypothesis?

[https://gyazo.com/567c21f6f8d8497ef3b0a402a2e4bbb3]
94 For math quizzes, the teacher will prepare the questions to be solved and how to check them. What you need to learn will be taught in class. In situations where this is not the case, how on earth do you... first plan, hypothesize, and understand...
How to make it.

[https://gyazo.com/16ef0476abe1027ec1434ce7649dff4a]
divergence writing out organizing interference growth sticky note making group organization convergence selection presentation diagramming
Type A: Creating Presentation Materials Type B: Exercises In a recent three-day workshop at Kyoto University's Summer Design School, the goal was to identify blind spots in one's own learning style and to develop a plan for improvement (P). Let me introduce some of the specific methods we used there.

[https://gyazo.com/70f61f8e39ee7afe335bc8676b392745]
96Think after you writeThis has been an abstract discussion so far, but now I'd like to talk about something more concrete. I've done this a few times and found a few useful principles.

[https://gyazo.com/5e41934e3fc8308dd4285880d87e8111]
97Write and then thinkWhy write and then think? Which is easier? Which is easier? Mental and written arithmetic

[https://gyazo.com/48e4e400c6e110010c0a4b24cf64b133]
Write and then thinkWhy write and then think? 98Which is easier? ! Blindfolded Shogi and Normal ShogiNormal Shogi = Shogi played while looking at the pieces and the board.

[https://gyazo.com/63eea8b4e4c312f3853c4f5285e41db2]
Which is easier? When you are thinking, do you think it is easier to think only in your head or to write down all your thoughts and look at them? ! Some may say that it is better to think only in one's head because it takes time to write things down, and that the right way depends on whether it is useful for each individual. 99

[https://gyazo.com/6520004400f9475f97da614d480ee83e]
Write and then thinkWhy write and then think? 100For me, writing down my thoughts is
I have a chess piece and a chess piece.
It's the same thing.

[https://gyazo.com/444b02ac68128835ab19f83d10528d08]
Write it down and then think about it Why write it down and then think about it? 101 First, write it all down.
 Eliminate the "burden of remembering
Let's concentrate on thinking, which in my opinion is more efficient and results in a better quality of output.

[https://gyazo.com/98e1c062487a9a263448beff65107024]
Kyoto University Summer Design School 2014 Exercise Assignment 102 This is an example of an actual exercise that we actually did in the workshop. Write on the prepared sticky notes as many as you can in time. The important thing is "quantity is valued more than quality" Let's write a lot. We repeated this kind of exercise several times and made about 100 sticky notes. To improve the way we learn
Try to write down as many "things that might be relevant" as you can in the time available, in writing that others can read. This exercise is graded on quantity, not quality. You have two minutes.

[https://gyazo.com/920ba4a2c0a826586e56da845c3886a9]
103It is difficult for people who are new to this kind of exercise to write smoothly, and training them will improve their efficiency in coming up with new ideas. I observe why people can't write smoothly and give them various advices, but I don't have time to explain all the slides, so I'll just explain a few of them:.

[https://gyazo.com/7232d264f35b0b9f301f5df55cf5332a]
Write and then think104 "Many people think that ideas appear in a complete form at once, but they are not. "Thomas Edison p256 A. Osborn (2008), Making the Most of Creativity: 38 Ways to Get Ideas, translated by Akira Toyoda, Sogensha

[https://gyazo.com/ffe8611b1160ed937ec6a306b9292b82]
105 I'll write it down, then think about it, then stop trying to make it perfect from the start.
I'll do the completion later, I'll write down everything that's bothering me, everything that pops into my head, first of all, what might be relevant, what might not be relevant, and then we can look at it later and make it better.

[https://gyazo.com/b1b763cb7194b8f2b65991f850e3eccd]
106Write first and think laterWhat you write can be improved later, and what you don't write can disappear in an instant. There is an opinion that thinking only in your head is faster, but if you consider the trade-off against the risk of disappearing, you can reach a higher level if you keep going out and accumulating your thoughts.

[https://gyazo.com/4e8be23291774233d4b38132c959c6a3]
107 If you want to summarize the contents of a book, write down everything you think, not just the contents of the book, write it down, and then summarize it. That way, it is easier to make a summary that is connected to your own experience, rather than "knowledge only from books" or "theories on the table.

 [Listen to others' opinions and reserve judgment and write them down].

[https://gyazo.com/4b4d39a6bee30a251f1b9c934a145e23]
109 The flow of the actual KJ method. There are about 100 sheets. I spread out what I wrote on my desk, for some reason.

[https://gyazo.com/7d9f50013adfe291ec910f2307329c60]
Let's write 110 and then we'll figure it out... about 7 temporary memories.
If you spread your writing out on your desk.
 A temporary memory that can hold 100 pieces of information at a glance can only hold about 7 pieces of information. If you spread them out on a desk so that you can look at them at a glance, you can see 100 pieces of information just by moving your gaze. Temporary memory can be extended in a physical way. Which is better, to think in an expanded state or to think only in your mind with only seven temporary memories?

[https://gyazo.com/29388689ee60b50540a9a9717db89567]
111 written and then I'll think about it, about 7 temporary memories.
If you spread your writing out on your desk.
 It is easier to spread out, at least for me, where I can see 100 at a glance. It is beneficial and the right way for me. It may or may not be beneficial to you. You will never know until you try it. In fact, I use this method for all of my lecture materials and my recently published books.
A personal way to keep it in my hands. (PS: It's paper now, but I'd like to improve it even more by going electronic)

[https://gyazo.com/dd030111e17bd38361d699e8ba3656ed]
112 Structuring Fragmentary Information - KJ Method in Practice 2: What to do after expanding the bottom-up group formation? Creating groups from the bottom up

[https://gyazo.com/a479ae8d168435cf4d78277818b13c27]
113 Structuring Fragmentary Information - KJ Method in Practice 2: Bottom-up Group Formation What for? There are 100 sticky notes! When you have that much information, your brain gets confused and punctured and refuses to think. It's like, "Wow, that's a lot of clutter! So I group them into a few pieces and then think about them. When there is so much information, the brain refuses to think. If you make a group of several pieces, it will be easier to come up with ideas.

[https://gyazo.com/d605abdb0b93ae79ea3f0c79ca364ad9]
Structuring fragmented information with groups of several pieces each - Practical exercise of the KJ method (actual scene)

[https://gyazo.com/0ea36bb3212e69a2824d5c614c14058d]
115 Structuring Fragmentary Information - KJ Method Practice 2: Group Formation in a Bottom-Up ProcessFrom the bottom up, we first go in as fragments. What is in a fragmented state is structured later. When you first write out the information, it doesn't come out in a neatly structured form, but when it does, it comes out as fragmented pieces.

[https://gyazo.com/479999f4ba4ece100674b958cafac489]
116 Bottom-up is important Top-down categorization only pushes information into the confines of existing thinking.
Top-down" is a method in which, for example, after writing down stickies, you say, "These stickies are related to the current situation, this is the solution, this is the cause, so let's divide them into three categories.
This is no good. Why? If you do it top-down, you will fit your side of the information to the framework of information you already have in your brain, and you will not discover unexpected structures.
#Existing framework

[https://gyazo.com/11a286b69e5fe83ad663b4e56cfbfa89]
117 The purpose is to discover unexpected structures. Writing it down on paper, spreading it out on a desk, or assembling it from the bottom up is only a means to an end. The purpose is to notice blind spots, to notice what you need to learn, to notice who you are that you hadn't noticed before. If you categorize it with the existing way of thinking, you'll end up with a structure that is exactly what you think it is, and you'll say, "Yeah, that was definitely what I thought it was," even though you did the Do in the PDCA cycle.
It will be a state of no failure. Then there will be no learning. No new things will be created.

[https://gyazo.com/88b570e9d9ac2a29d57bdf12ad02d89b]


[https://gyazo.com/a11ff9ed7a2d2f15f780a6312fd4e948]
図解化119

[https://gyazo.com/545e99e48fa26a3bb469772cfeeb6f08]
120Draw relationships between the collected sticky notes, add lines to enclose the group and make a diagram, then make a written diagram. Why?

[https://gyazo.com/47f7aceb2f2fb607ad6683726541110b]
Structuring Fragmentary Information - Practicing the KJ MethodKJ methodB-type illustrations are good for seeing the big pictureChecking for leaps in textA is B, so it's C. D and E are opposing structuresDiagrams are good for saying that it's hard to notice gaps in a story.
If you explain in writing in turn, you will find that there are logical leaps and you will say, "What? This part doesn't connect well. or "It's not right to go from this story to this story, we need one more cushion. However, it is difficult to understand the whole picture. By changing to a different format, it becomes easier to notice what is missing.


[https://gyazo.com/c14bfd049c63417d6151121abf905718]
122 What is the benefit of writing? It's hard to get the message across by showing a diagram that is easy to output, so output in writing and get feedback from others.

[https://gyazo.com/be5b739156c35ecf050e04b20a2e21e8]
Based on 123 understanding
Behavioral Understanding DCA Cycle P Based on the assembled understanding P, output D is created, and the results are fed back from others...
Consideration of the results of modification of understanding that starts the cycle turning "I thought it would work, I acted on it, but I failed" is an opportunity for modification of understanding.

[https://gyazo.com/cd3af5580361e1beb643efa9a2b2ebea]
124 Summary Let's review the key concepts that have emerged so far

 [The problem is the gap between the ideal and the reality.]

[https://gyazo.com/866af38d3da57311db6e0c1f4247b2cb]
What is correctness in those areas? 126 Problems for which the correct answer does not yet exist are worth solving.

[https://gyazo.com/98145b3d8c1be2df1edd022f51f11e7d]
! In many areas of decision-making correctness, scientific correctness and logical correctness are not required.

[https://gyazo.com/e3af54b729921f308f84574fa8adb121]
Based on 128 understanding
Behavior i.e. Understanding DCA Cycle P Understanding Corrective Results Consideration of the results of actions where correctness can be learned from the results of actions.

[https://gyazo.com/7a394860d39da5aa416404d405eec063]
129In order to learn, we need to notice blind spots, and the eyes of others are useful in noticing blind spots.

[https://gyazo.com/939aafa6c653d52a87668647b7f7f2c2]
130Learn from people with little knowledge, no matter what kind of person you are dealing with, think, "I could learn something from this person."

[https://gyazo.com/08b34b645843fc7d7924a051006364aa]
131 This results in a shift to exchanging knowledge and learning from each other.

[https://gyazo.com/2159f58d78e5ee7b36e29cff8fd1f3ef]
132In doing so, we tend to reject what others say, judging it to be "different" or "irrelevant" based on our own framework.

[https://gyazo.com/b23af4901ad675966549a548e28e8b54]
133Don't discard things that don't fit in with the bottom-up approach to nurture understanding, saying that they are "noise. Plato likened philosophy to the art of birthing a baby. Ikujiro Nonaka and Noboru Konno (2003), Methodology of Knowledge Creation: The Way of the Knowledge Worker, Toyo Keizai Inc.

[https://gyazo.com/52086041b0c7a16e8f7e39a0fb387a9f]
134 application [application can only be done from the bottom up][rootless knowledge] knowledge with roots knowledge that can't be applied has no value

[https://gyazo.com/9de7183f3123f7f77476a20fb71641c6]
135As for the specific methodology, let's first write and then think about what we've written.

[https://gyazo.com/23ff56a2fcd4e564883ff3ad4d96b7c9]
136 by spreading it across the desk.
Extend temporary memory and build from the bottom up

[https://gyazo.com/93334b70fc5aa1a2ce7adc6b6577ca45]
137 spatially arranged state to text, with format conversion.
By noticing what is missing and outputting it to others, the PDCA cycle begins to turn.

[https://gyazo.com/217bee1aa8b21f7295fdfcddb0f542b6]
138異論反論大募集	 
What kind of comments will you get?
I am looking forward to it.

[https://gyazo.com/4c286ef5cc3db196898e4bed7bd663e0]
139異論反論大募集	 
What kind of comments will you get?
I look forward to it. I may not get an objection or a rebuttal right away, so I am looking forward to your comments that throw sharp knives at me, for example, "You are being too rough here," or "You are missing this point of view," or something like that!

[https://gyazo.com/5f8b8c8cf622be209919810af736eef1]
140質疑応答

[https://gyazo.com/0f9af7f28493e69a491bdff67b5134b9]
141 Q: You mentioned that knowledge has two types of knowledge: knowledge to gain knowledge efficiently and knowledge to gain money efficiently, which knowledge of knowledge to gain knowledge efficiently?

[https://gyazo.com/12ebbb908226b998b9dc12d025bf69bc]
142 A: Both. Recursive definition.
Both are the same in that they both make human behavior more efficient.

[https://gyazo.com/8480b4e855138e953f0ce179900ba577]
143 Q: (because it is far from the microphone
Not audible)

[https://gyazo.com/d840851ea9bf1fe2f88e56bc3ea24e07]
144 A: You mean that there is only value left in knowledge that cannot be found in a search.

[https://gyazo.com/19c15672476af10cf249c7e294bed4e8]
145 A: Suppose I did not know how to get on a train with a student discount. I didn't have the knowledge of how to buy the student discount, but thanks to the "meta-knowledge that increases the efficiency of knowledge acquisition," which is "just search on Google," I was able to take the train cheaply and save money. Specific knowledge is losing its value more and more, and the weight of value is shifting toward meta-knowledge.

[https://gyazo.com/109e4e9ce5da3d620c27724e4fe78782]
146 A: The knowledge that "you can search for it on Google" is not knowledge you got from searching on Google, so you must have gotten it some other way.

[https://gyazo.com/3f15928c819d86e3c4edf14e0f52c435]
147 Q: What do you think of mind maps? They are very similar, but what are the differences?

[https://gyazo.com/36d938001db0c1094f0a81027ab9aaa5]
148 A: The same in that you write down your thoughts first. Difference between writing on a small piece of paper and laying it out or writing directly on the paper.

[https://gyazo.com/92f1ba460cd164fdaf5dffc84bc66156]
149 A: Mind maps have a core image in the center and trees radiate from there, so there tends to be a bias to write top-down structured things. This is a bad point. Colorful is a good point.

[https://gyazo.com/8e66e33520b06d622d4554b2c933a6cd]
150 A: Do you think you can suddenly draw a beautiful mind map like the ones you often see as examples? If you try to draw something with a high degree of perfection from the beginning, you will stumble.

[https://gyazo.com/54470983e06d746aa53ac588f588f5c5]
151 A: It is better to draw a new mind map by looking at it and thinking, "This branch should go this way," or "That one is missing here," rather than drawing it once and then finishing.

[https://gyazo.com/2fd6dd3c401796e693c4313c2112f5f8]
152 A: You can make a final mind map of what you have lined up with sticky notes. That would be a map that would be easier for others to fit into.

[https://gyazo.com/d877d97101384eb036b031944313b2de]
153 A: I also used mind maps, but the first steps were easier with sticky notes for me. I think you should use whichever is easier for you. What is useful to you is right for you.

[https://gyazo.com/21af1292c5959af8c32defe7bf050078]
154 Q: Who is the value of "a problem with a correct answer has already been solved by someone else, so solving it does not add value"? Even if there is a correct answer, if solving it is beneficial to the individual, isn't it worth something?

[https://gyazo.com/3718d25a168a4a1a424338ba94793849]
155 Q: You talked about how to learn about problems that don't have answers, such as decision making, but on the other hand, how do you deal with problems that do have answers, such as daily exams?

[https://gyazo.com/ff05f235384d21f86836f88170950825]
156 A: I think it comes down to how small and fast you can make the PDCA cycle.

[https://gyazo.com/48ead6b72bfce9a187c0fa86d23674d5]
157 A: Excellent. You are right. For example, solving an entrance exam question has an answer, so solving it does not increase its value to society, but at least you yourself have the value of getting accepted to a college because of it.

[https://gyazo.com/7f4b4c28c5d6757c5f610ceb758014a8]
158
A: We tend to think about the big picture, "Is it valuable to society?" but ultimately "to me" is the important point. So you are right in your point.

succession
[灘校土曜講座2014質疑]
