Let's test our hypothesis by experimentation.
from [灘校土曜講座2014]
Let's [hypothesis] [experiment] [verify]!
[https://gyazo.com/cca4bbd3aeb032f6804e28376501bcfb]
88
 Let's [hypothesis] [experiment] [verify]!
 You may think you "get it" when you are studying, but when you try to solve a problem, you may not be able to solve it.
 We don't know if we really know unless we experiment and verify it.
		[Okay" is a hypothesis.]

[https://gyazo.com/97f22919bb81f592a5a61f5b64569735]
89
 Plan ahead and take action,
 Consider the consequences of your actions,
 Go correct the results,
 We will continue to work through this cycle to advance our business.
 [PDCA Cycle] [Plan] → [Action] → [Discussion of results] → [Revision of plan].

[https://gyazo.com/20480050f8a40efe614570570ac5ce6a]
90
	Scientific research is similar.
  Hypothesis.
  Experiment.
  Consider whether the experimental results are as expected.
  Opportunities when expectations are different, revising hypotheses
 [Hypothesis] → [Experiment] → [Discussion of results] → [Revision of hypothesis].

[https://gyazo.com/3e2cff398be6cbbf146725815e1bb2f3]
91
 Same with studies.
  理解は仮説
  Act on your understanding.
  I thought it would work and it didn't = I got a different result than I understood.
  This is your chance to correct your understanding.

[https://gyazo.com/d5de43692420d2b49cbe95e67c927e48]
92
 Learn quickly by turning this cycle in small steps.
 For example, if you are programming
  If you suddenly write a program with thousands of lines of code, try to run it, and then say, "It didn't work! Then, it is too late to learn.
  It is more efficient to learn by repeating the execution of a small, one or a few lines.
 If it were a business, we would create, release, and verify a minimum number of products to verify "there are customers who want this.
 What was the first product that Dropbox released?
  They did not create a product. They made an instructional video and placed a pre-registration form.

[https://gyazo.com/cf875330c50e78787f56c370c68061af]
93
 河内先生:
 	If it were a one-shot entrance exam without a final review, we'd be in trouble.
  That's why we test frequently.
  Make the first step smaller. Make the cycle smaller.
 Exactly, however, "I thought it would work, but it failed" is important.
  Failure is an opportunity to learn.
  That's why we often give quizzes.