developmentally oriented organization
	Military-style indoctrination was [top-down] with "[what] to learn" and "[the] right answer" and members were expected to learn it

 Ideas such as "[Lean Startup]" were that the "right answer" was unknown and the organization had to find it.
  There is "something to learn" about whether "customers exist," and the organization and its members don't know the outcome.
  So we have to ask the market and "learn" fast.

 This is [single-loop] learning. [Argiris] argued that single-loop learning alone is not good enough.
  >Single-loop learning is to solve problems according to a framework of ideas and actions that is already in place. Double-loop learning means abandoning the existing framework and incorporating a new framework of ideas and actions. The concept was proposed by American organizational psychologists Chris Argillis and Donald Schoen in 1978 in "Organizational Learning. Organizations have difficulty surviving and adapting to their environment through single-loop learning alone. It must unlearn its own stereotypes of past successes, double-loop learn new knowledge and frameworks from the outside, and then repeat and reinforce them again through single-loop learning. It is said that only organizations that can continue this cycle repeatedly can maintain their competitive advantage.
  [Source: https://kotobank.jp/word/%E3%82%B7%E3%83%B3%E3%82%B0%E3%83%AB%E3%83%AB%E3%83%BC%E3%83%97%E5%AD%A6%E7%BF%92%E3%83%BB%E3%83%80%E3 %83%96%E3%83%AB%E3%83%AB%E3%83%BC%E3%83%97%E5%AD%A6%E7%BF%92-178794]

 The "Learning Organization" and "U Theory" are about how to do this double-loop learning. The first step in double-loop learning is to go beyond the wall of [stereotypes] ([VOJ], Voice of Justice in U Theory), or in other words, [self-transformation].

 [Developmentally oriented organizations] aim to enable members to transform themselves

	Cybozu is a good example of a developmentally oriented organization in Japan" (Ryo Nakadoi, translator of "U Theory" and "Why Organizations that Show Weakness to Each Other Are Strong").
  Dialogue: [Organizations that can provide a state of "development" rather than forcing growth are resilient to change ── Cybozu's Yoshihisa Aono and Ryo Nakadoi | Cybozu Style https://cybozushiki.cybozu.co.jp/articles/m001340.html]