Lecture on how to generate ideas
	First published [2015-01-07 http://d.hatena.ne.jp/nishiohirokazu/20150107/1420557134]
 What I wrote on [Cybozu's] internal groupware in 2014, which I made public because there was no particular need to keep it confidential.
	#ideas #how to come up with ideas

[* Idea must be novel?"].
 You asked if an idea does not have to be new, and I say yes. There are two reasons.
 The first is "[usefulness rather than novelty]. We are a for-profit company, not a research institute, so it is more important that the idea be useful to Cybozu and our customers than that it be a new idea.
 The second point is "setting the bar too high. Ideas are not born in a useful and complete form from the start, but rather are gradually developed and refined as they are combined and refined through the process of gathering and working with pieces of ideas.
#Novelty #Usefulness

[* Lecture #1 on how to come up with ideas].
 Even if you are told that "the goal of an ideathon is to present ideas," you may be put off by the fact that "ideas" is a word that you don't really understand.
 An idea is "a thought that might be beneficial if you share it with others.

[* Ideas do not have to be "solutions."]
 For example, let's say you talk about how you think this is ideal, but the reality is this way, and someone else hears you say, "Well, maybe we can solve that by doing this." and someone else who hears this comes up with a solution. Some people might think that only the latter is an idea, but if the problem had not been raised in the first place, the solution would not have been born. There is value in talking even about "ideas that are not solutions."

[* Ideas do not need to be "sure"; they need to be "certain."]
 Some may shrug and say, "I'm not sure if anything beneficial will come of this idea..." But it is normal not to be certain. If you are sure, you can report it to your boss without waiting for the idea-thon. If it is a "definitely useful idea," then it will be immediately put into action by the general manager's meeting or something. The idea-thon is a place where ideas that are not certain are circulated across departments. Therefore, there is no hesitation because an idea is not certain.

[* Ideas do not have to be "perfect."]
 Some may think, "I have an idea, but there's a problem called ____...we'll talk about it when this is resolved." But let's talk about it. Even ideas that "don't have problems" can turn out to have unexpected problems when you talk about them with others. Even "problematic" ideas can turn out to be easy workarounds when you talk about them with others. In other words, it is meaningless for you to be alone in thinking "there is/isn't a problem".
 Ideas will not come out if you raise the hurdles in your mind. First of all, it is important to lower the hurdle and put the idea out of your mind. Once you let them out, you can refine them.
#perfectionism #perfectionism

[* Lecture #2 on how to come up with ideas].
 When the mental hurdles are lowered sufficiently, "ideas" will start popping up.
 It's an idea that was put out with a lowered hurdle, so when people who are still hurdling look at this "idea"
  So, how do you figure it out?"
  Is that really beneficial?"
  That's the problem with ________."
 The response would be.
 It is a matter of course, nothing to be surprised or afraid of.

[* Lecture #3 on how to come up with ideas].
 Let's write it down and then think about it.
 Which is easier, mental arithmetic or written arithmetic?
 Memory is a burden on the brain.
 It is easier to write down ideas as they come to mind on paper and look at them than to think about them while committing them to memory.

[* Lecture #4 on how to come up with ideas].
 When we adopted the [framework], "The problem is the gap between ideals and reality," which is also used in Cybozu's in-house training, at this year's Kyoto University Summer School, the speed at which ideas were generated increased by about 1.5 times.
 Specifically, this is how it was used:
  Exercise "Write down anything that might help improve the problem" 2 minutes
   Explains why the gap between ideal and reality is a problem.
  Exercise "Write down anything that might be related to your ideal" 2 minutes
  Exercise "Write down anything that might be related to reality" 2 minutes
  Exercise "Write down anything that might be relevant to closing the gap" 2 minutes
  In the exercises, I told them in advance that quantity over quality would be evaluated, and had them compete in a timed time trial to see how many sheets they could write for each exercise. It was interesting to see what questions each person was good at and what questions they were not so good at.
#Ideal and reality

[* Lecture #5 on how to come up with ideas].
 A major reason why problems are not solved is a lack of proper understanding of the problem.
 People tend to think they understand the problem, and they tend to think of problems as "just the way they appear to them. And because they come up with solutions without properly checking them, they don't work.
 For example, let's say you are trying to set up something on a new machine, and the manual created by the IT staff is difficult to understand, and it takes you a whole day with the help of the person sitting next to you to get it set up. It is natural to think that the problem is that the manual is difficult to understand.
 If we were to express this perception of the problem in the framework of "ideal and reality" and "fact and interpretation", it would be "the manual is hard to understand (interpretation/reality) it took a whole day to set up (fact/reality) the manual should be easier to understand (interpretation/ideal) specifically ...... It would be something like "the manual is not easy to understand (interpretation/reality).
 This does not solve the problem. Because the problem perception contains only information from one's own point of view.
 Suppose I suggested, "Make the manual easier to understand," based on this, "How much more?" I would say, "We don't have enough man-hours...".
 The problem is the gap between ideals and reality, but the "ideals" and "reality" one person comes up with are biased. Unless we gather the ideals and realities of each of the stakeholders and look at the gap, we cannot properly understand the problem.
 When we interviewed the information system side, we heard opinions such as, "We don't have enough man-hours, we have a big event like the office relocation coming up. We don't know how detailed we need to be, even if they say 'more detailed,' so don't just ask the people around you to solve the problem and be done with it. After gathering information from multiple perspectives like that, we think about what the problem is that needs to be solved.
 In this example, for example, it would be ideal to have a manual that is difficult for people who are not good at computers to stumble upon, but it is not possible to devote more man-hours to creating such a manual than it takes to create the current manual, or "To improve the manual, feedback should be provided to the information system on areas that were difficult to understand (ideal), but the reality is that feedback is not provided because the problems are solved by asking others. The reality is that the manuals are not being fed back to the staff because they are asking the people around them to solve the problems.
 Let's imagine giving a presentation on an issue that is difficult to understand manuals. Wouldn't an improved version with multiple perspectives be more inspiring to those who hear it?
 (I suspect that cases where "reality" and "ideals" are mere inversions are a sign that you're not gathering enough information to understand the issues.)
 Also, when there is an "easy-to-understand problem and obvious solution" such as "Ideally, the manual should be easy to understand, but in reality, it is not. Let's revise it to make it easier to understand (solution)." When there is an "easy-to-understand problem and obvious solution," the recognition of the problem is usually wrong.
 Unless it's a problem that only a few people are aware of, the problem is already known, the obvious solution has been considered, and it's not being implemented because there's some reason why it can't be done.
 So when the "obvious solution" is not being implemented, instead of insisting, "You should ________!" Instead of insisting, "What's the reason why it's not being done?" It is better to ask, "What is the reason why ____ is not being done?

[* Avoiding questions]
>"So how do we fix this?"
>"Is that really beneficial?"
>"That's a ____ problem, isn't it?"
 You say, "It's a common question, so don't be afraid," but then you say, "But what if they say so?" But what should I do if they say so? So here's an example.
 >"So how do we fix this?"
  'I don't know, but I think it's very important that we fix this problem!'
 >"You know, that solution has a problem called ________."
  I see, and thank you for pointing that out. Is there a better way to solve this problem?"
 >"Is that really beneficial?"
  I don't know, but I do believe it would be beneficial!"
 By the way, I believe that idea sessions are beneficial to Cybozu!

[* Lecture #6 on how to come up with ideas].
 I write on 38mm*50mm sticky notes. This is much smaller than those used in design workshops around the world. The reason is very clear. If I share them with several people, they need to be large to be visible, but I use them alone to organize my thoughts, so they are small enough for me, and small enough that I can put many on my desk.
 The reason for arranging them is so that they can be viewed at a glance. Human working memory can only hold about seven items of information, but if they are laid out on a desk and viewed together, they can be read through in a short period of time.
 The maximum number of sheets is sometimes as high as 150, but it's too much for me. 100 sheets is a reasonable amount for me, as I'm used to it. If you are not used to it, you can start from a smaller number, but I think 20 sheets is too small. 40 sheets is the minimum.
 If you say, "I can't think of anything to write 40 pages about," that means you don't have enough information in your brain, so what you should do is gather information. You can go talk to people who seem to have something to do with the problem, or skim through books that seem to have something to do with the problem to see if you can find any clues.
 Some people say, "Ideas are a new way of combining information." One of the techniques of idea creation is to put the information in one's brain and the information gathered from outside the brain on a table and find new combinations from them.
 In the flow of the KJ method taught at the Kyoto University Summer Design School, the preparatory stage is up to this point, followed by group formation, nameplate making, diagramming, and writing, but even if newcomers do not go that far, their thinking and approach to generating ideas should change considerably.
 If we get to about 100 stickies and someone says, "I can't collect...," we'll continue at that time.

[* Lecture #7 on how to come up with ideas].
 Since the topic of going to talk to others came up, let me elaborate a bit. I'm not a good at it, but I do know some typical NG patterns.
 First, do not start a discussion with the interviewee; remember the purpose. The purpose is to get information that is not in your brain. If the interviewee starts talking about something that conflicts with your ideas, say, "Yay, a chance to harvest! It would be a waste to start a discussion and destroy it.
 Next, if the other person starts talking about something totally unrelated to what you want to ask. You are tempted to interrupt or look uninterested, but you hold back and say, "Now I think it's irrelevant, but this person is talking about something that I think is relevant or important. Why do they think so?" and continue listening. If you succeed in discovering the relationship, you will get a lot of "important information that you thought was irrelevant. Sometimes I fail, but then the sticky note just goes into storage.
 Finally, if the other person is telling you something you already know. I don't really know what to do about this either. Should I just make a precise phase and crack on with the conversation and move on to the next topic?