Exchange knowledge and learn from each other
from [灘校土曜講座2014]
 Previously, [Is the learning ladder model correct?]
 Commentary beginning with [Learn from someone with little knowledge
 	This chart was later developed into the [Knowledge Distribution Chart] series
 次は[自他共栄] [灘校土曜講座2014#599e71a7aff09e0000456096]

[https://gyazo.com/1260f62bde56b67040d57fc780a6959c]
53
 Learn from those with little knowledge.
 In this figure, the person on the right has only half the total amount of knowledge of the person on the left.
 But because of the different fields of experience, the more knowledgeable person on the left can learn from the less knowledgeable person on the right.

[https://gyazo.com/7ef6166a8f820b3638986ef7c2fcc7c6]
54
 Learn from those with little knowledge.
 PS: Nowadays, the people around us are running on the narrow rail of "enter a progressive school, study for entrance exams, and get accepted to college," so there is less diversity, greater overlap in distribution, and fewer opportunities to teach those who have less knowledge.
 Diversity will increase more and more as we move on to college and into the workforce. #Diversity of knowledge

[https://gyazo.com/db998d1074a152fe6ca31a56e314af83]
55
 Learn one way from someone other than yourself.
 Tend to believe that "I have little knowledge and can only learn one way from those who have more knowledge."
 Tend to build walls based on assumptions

[https://gyazo.com/40b0cc6ffaf181d9d31066ec746b57b0]
56
 Rather, we learn by exchanging knowledge with each other.
 Let's break down the walls of our minds and output.
 We gain from each other by exchanging knowledge. #KnowledgeExchange

[https://gyazo.com/86d243dda472bbfafa461ba260fd2e54]
57
 [exchange knowledge and learn from each other].
 In school, we pay tuition and are taught knowledge in exchange for that money.
 Social behavior cannot be sustained unless it is fundamentally beneficial to both parties.
 To maintain a sustainable learning situation, you must either pay tuition or provide knowledge that they do not have to bring them into a situation where they say, "It's profitable to talk to this person.
 If you walk into a company and say, "Senior, please teach me!" the seniors will probably teach you because it's their job, but if there is no benefit to the seniors, the seniors will become less and less motivated.

#知識の交換 #知識交換
