work shift
[https://gyazo.com/f2791aff36cfc5cdf6cba6309d86e609]
	[Linda Gratton]
	A discussion of how changes in the social environment expected in the future will require changes (shifts) in the way we work.
 interview (i.e. television, newspaper, etc.)
 　http://cybozushiki.cybozu.co.jp/?p=7487

 Two interesting points of the book are
  The value of the generalist is declining, but if you concentrate on the specialist, your vision will be narrowed, what to do? [narrow vision].
  	Idea Cloud (see below) OR Challenge yourself in a new field and become an expert in multiple fields.
  Is a large community good? But that would be a broad and shallow collaboration.
  	A large community is good for gaining a broader perspective.
   Small communities are good for in-depth knowledge, especially regarding expertise
   So it is important to have both.
   Don't forget the community for recreation.

 The first of the three shifts is the acquisition of continuous expertise and its self-branding
  I thought this is what I have been doing.
  It is important to note that this is not simply "acquisition of expertise" but a continuum of expertise.
  The emphasis is not on gaining expertise in one field and continuing to invest time in maintaining it, but on entering a different field and gaining new expertise there.
  The word is [serial specialist], but I don't think it's the right translation.
   In the original book it was 'serial mastery'.
   I think it is a concept related to serial entrepreneurs.
   	In short, a specialist with only one peak will suffer when it does not fit the needs of the market, so the strategy is to leverage the expertise of the first peak to create a second and third peak.
   If you think about it, someone who says, "I got a master's degree, but instead of continuing my master's thesis research, I joined a company and am an engineer," is already employing this strategy and is in the process of creating a second peak.
   I have been working as an engineer in a company instead of continuing my research after graduating from the doctoral course, but recently I have been running into non-engineering specialties, and it occurred to me.

 The second shift concerns so-called "social capital. It is pointed out that we do not accomplish things alone, but in cooperation with those around us, and that "those around us" may no longer be "co-workers" as in the past. That is true.
  We need small, close-knit groups, and we also need broad, open groups. The breadth of communication depends on the purpose.
  The second shift in Chapter 9, the last one of the three communities, was not clear to me again. I immediately recognized the narrow community "[Posse]" with common interests and the broad community "[Idea Cloud]" with different specialties, but the third one, "self-recreation," was not clear to me. This is what we call "recreation" in Japanese. It has to be offline, does not require common expertise, and is basically a small group of people.

 The third shift was related to the inner life, which was a bit unclear from a quick read through.
  The third shift is, in essence, "what makes you happy in your life," and I'm talking about thinking about whether money and consumption really make you happy.


first appearance
	[2014-04-11 https://www.facebook.com/nishiohirokazu/posts/10203044530930735]
 [2014-08-04 https://www.facebook.com/nishiohirokazu/posts/10203830500939494]

5 Trends
 Technology Development
 globalization
 Demographic Change and Longevity
 Individual, family, and social change
 Energy and Environmental Issues

Three shifts
	Generalist to [Continuous Specialist].
	Solitary competition → Innovation for all
	Making and consuming money -> valuable experience

	Services that provide shallow skills (e.g., Wikipedia)
 information and communication technology