VALUの今後予想_20170828
2021-08-27
	[https://www.nikkei.com/article/DGXMZO54595510Q0A120C2XY0000/ VALU, a personal value trading service, to end at the end of March: Nihon Keizai Shimbun]
		>The company will remain in existence and will make a major business transition after April 2008.
　　I wonder what happened after that.

---2017-08-28
	VALU goes bankrupt.
 	As a forerunner, VALU visualized a lot of possibilities and got a lot of attention.
  With the mention by Taro Aso, Minister of Finance and Financial Services, that "we need to think about both protecting consumers and fostering new ones" ([2017/08/15 https://www.nikkei.com/article/DGXLASFL15HAT_V10C17A8000000/]), As an experiment, it was a great success
  On the other hand, there are no barriers to entry for the emergence of similar services. Entry into the market will increase after seeing the success of the experiment.
  VALU has the cost of maintaining compatibility with "what we've already done," but new entrants can enter without that cost, limiting themselves to the methods that look most promising.
  The competitive advantage to VALU is name value, but it is also damaged by scandals, so the advantage may or may not be subtle.
  For VALU users who can't quit because they did it without knowing better and will be beaten if they quit, the operating company goes bankrupt and quitting "through no fault of their own" is preferable, so they have an incentive to behave in such a way.
  By having VALU fail, speculative users who were looking to make more money will lose out. This may be socially useful because it has the effect of keeping speculative users away from this type of market.

Where there may be a need
	Auction for Services."
 	The system in which the price of a "preferential" service rises as those who want it set the price, has given rise to the use of the service as an "auction of services.
  There will be entrants who will go for this demand.
  	Crowdsourcing providers
   	At this point, the company has a matching system and payment method whereby "service needs" are presented and those who can meet those needs apply to the company.
    The business model is to take a commission when a match is made.
    Expanding the system to allow service providers to register that they offer this type of service will increase matching opportunities
   Lecturer Mediation Service Provider
   	At this point in time, the business has a list of "people offering the service of speaking" and matches them with people who have a need to apply for the service.
    A strategy in which a business that is good at software tries to gain recognition by partnering with this type of business to take advantage of the boom.

	We want to help young people."
 	There are many.
 	The source of funding may be taxes, corporations, or foundations.
  The new point is the use of "private herds" as a source of funding for this.
		Personally, I think the world would be better off if such a service were created, but if it is "support individuals" rather than "support projects," I think there will be a chicken-and-egg problem of how to get the attention of unknown individuals. In the case of "support projects," it will be interesting to see how they differentiate themselves from existing crowdfunding services.
  One option is a service that focuses on the desire to say, "I've been supporting that guy since I was young. This is a system that allows users who have supported him for a long time to be visualized as a big patron and show off their support.
  If we use a metaphor like comparing VALU to stocks, is it "a system that allows anyone to become an angel investor"?


-----
My tweet on 8/21
>I thought VALU was a good step in the right direction, showing a policy of moving away from the "equity" metaphor that was the source of the misunderstanding. I wonder if the way forward will be the commercialization of the "I supported that guy when he was just starting out" smugness rights, or an auction where the rights can be put up for sale.
>The former is also a right, so there is an overlap with the latter auction. But if we push for the former, it would work better to incentivize "long-time supporters" and "monthly ongoing supporters" rather than short-term amounts. The latter is a variant of crowdsourcing and would require a rating function.
>Or perhaps the latter would be more straightforward if it were done by a crowdsourcing business rather than VALU? It would also facilitate the matching process if sellers as well as buyers could register first.
https://twitter.com/nishio/status/899596667292311552