Pomodoro Game Plan
	Can't we [gamify] the [measurement of work time]?

-----
2019-03-11
	The phone screen goes dark or timer counts down for a certain period of time.
		Can't switch to other apps, etc.
	Not so much a pomodoro as a game where you leave the phone controls for a certain amount of time.
	If you can get 1 point in 5 minutes, 3 points in 10 minutes, and 8 points in 25 minutes.
		No more detailed time settings are needed.
	A kind of [Zen].
		Training to detach [habits].
		In this case, the habit is to "keep using the phone".

-----
If you could have the best neglected game for [Pomodoro], what would be the best specifications?

https://www.facebook.com/nishiohirokazu/posts/10213160995676031

We don't have to stick to Pomodoro, we can have a system where you declare how you want to spend your time and you get points for keeping your declaration.

https://www.facebook.com/nishiohirokazu/posts/10213267407616263

Pomodoro game, I'm starting to feel that we don't need to stick to Pomodoro in the first place. It would be better to have a system where people declare how they want to spend their time and get points for keeping their declarations.

For example, if you declare "I will work for 25 minutes from now," the alarm will go off after 25 minutes, just like a normal timer, and if you stop the timer within 25 minutes plus or minus 30 seconds, you will get points. If not (you stopped the timer because of an interruption, or you were going somewhere without stopping the timer and could not stop it within 30 seconds), you will not get any points.

Another idea is to improve the situation where "if you declare that you will work for 25 minutes, there is a high probability that you will be followed, but how many minutes you will take a break after the work is done is not often declared, nor is it known how many minutes you are taking. In other words, at the end of the work timer, workers can declare that they will resume work within 10 minutes, and if they actually resume work within 10 minutes, they will receive points.

The values of 25 minutes and 10 minutes are included as default values, but can be changed arbitrarily; if you want to go out for a one-hour lunch break, just declare so.

To adjust the wording a bit, the question we want to achieve is "Can we make it a game to create an incentive to work while measuring time?" and Pomodoro is just one concrete example of working while measuring time.

[https://gyazo.com/46e8b008ee90f75e705c4088c10c2d55]

