knowledge worker
A concept proposed by [Drucker]. (I may be mislabeling [intellectual worker].

 Misleading terminology
  The synonym "[manual laborer]" is even worse.
  It is necessary to understand this term in the context of the fact that it was created in 1966.
 Definitions under "[Management Conditions]."
  >Knowledge workers do not produce anything that is an independent [outcome] in itself.
  >Knowledge workers produce [knowledge], [ideas], [information
 	The boundary between knowledge workers and manual laborers is whether what they produce is a direct result or not.
 What was produced is not [measurable].
  Does not directly generate sales
 A job where effort does not lead to results, one could say.

 Research jobs are easy to understand, "not directly resulting" cost centers.
  A case study of the failure of measuring achievements by the number of papers or patents, which leads to a spate of papers and patents.
  We must not create measurement standards because if we create measurable metrics, they will be abused."
   [Do not set numerical criteria for the evaluation of researchers].

	It's not a direct outcome, and what it produces isn't measurable."
 	This means that even if you are a programmer, if your job is designated as "your job is to implement this function" and you do it, you are classified as a physical worker, not a knowledge worker.
  Discussing "what is a good product" and activities to improve the product are knowledge work since "goodness" is not measurable.
  After it is decided that "this function is necessary to make a good product," the work to implement that function is physical labor because it can be measured as "implemented (1) or not implemented (0).
  The process of thinking "this is a better design", "easier to read", "better for future maintainability", etc. during the implementation process is not measurable and is therefore knowledge work.

	In [The Engineer's Art of Intellectual Production], p. 186, I wrote
 	>[Buds cannot be managed].
  >The cultivating and nurturing phases can be task managed. However, the sprouting phase cannot be managed. You cannot make it sprout through effort, nor can you guarantee that it will sprout if you wait. Whether or not an idea will sprout is a matter of luck.
  This "sprouting of ideas" is knowledge work
  >Knowledge workers produce [knowledge], [ideas], [information
		That's exactly what it said.