美的直観
I searched thinking [Poincaré] should have mentioned it, but [Nietzsche] and [Sartre] came up with hits.

/media/winhome/Dropbox/intellitech/iw/books/the complete works of Nietzsche <13>The Will to Power, Part 2 (Chikuma Gakugei Bunko) Friedrich Nietzsche 612p_448008083X.txt
203:677(8 "18) The problem of how far the interpretation of the world is a symptom of the dominant impulse, an artistic consideration of the world. In other words, it places oneself before the face of life. But here there is a lack of analysis of aesthetic intuition.
and this intuition has not been reduced to cruelty, a sense of safety, a feeling of being both judge and outsider, and so on. We must take up the artist himself and his psychology (
The artist's absolute selfishness, the criticism of the playful impulse as a release of power, as a pleasure to be drowned in change, to be drowned in the imprint of one's own soul in another, etc.). The artist washes
The question of what impulse it is to knead. Scientific world consideration. A critique of the psychological desire for science. The question of the extent to which the desire to make something comprehensible, practical, useful, and profitable is anti-aesthetic. Value is only that which can be calculated. It is a question of the extent to which the average person desires to be dominant in the process. History
If even history is affected in this way, it is a frightening thing - for history is the kingdom of the preeminent, of the judges. What an impulse the scientist refines! Religious Worldview
Observations. That is, a critique of the religious man. It is not necessarily the moral man, but the man who is in a state of intense excitement or deep depression, and who is not grateful or suspicious of this state of excitement2 01 ‖.
The Will to Compatibility in Nature

/media/winhome/Dropbox/intellitech/iw/books/the complete works of Nietzsche〈8〉 Echigo-Tsushiki Kogaku Bunko Friedrich Nietzsche 526p_4480080783.txt
Is it the sharpness of his intellectual conscience in 181: or is it his fastidiousness in matters of the Church and the Christian God? I think it is because of this point.
The "Gentleman's Pity and Punishment" is a commentary on the "Gentleman's Pity and Punishment" and on the instrumental character of the intellect and the crippling of the will, etc.

The dismay and fugue in the passages where he is seduced and corrupted by the vain impulse of the will, such as the unprovable doctrines of the one will ("All causes are but the occasion of the phenomena of the will at this time and place", "The will to live is not divided into a whole among all beings, however trivial they may be, but is present in every being, in every thing that is. The will to live exists in every being, even in the most trivial of beings, as a whole, undivided.
The thing exists in the past with a perfection like that of a crepe de chine, and the denial of the individual ("Every lion is only one lion at its root," "The multiplicity of individuals is an impersonation," and the like) is a sign of the existence of the individual.
He calls de Lamarck's thought "an absurd fallacy of genius"), fantasies about genius ("In aesthetic intuition the individual is no longer an individual, but a pure, will-less, pain-less, time-less subjectivity of perception", "The subjectivity, by immersing itself in the object of its contemplation, becomes the object itself. "By immersing itself in the contemplated object, the subject becomes the object itself, and the subject becomes the object of sympathy.
The principle of individuation as the basis of all morality and compassion. I wish you all the best in the future.

/media/winhome/Dropbox/intellitech/iw/books/Existence and Nothingness <1> An Attempt at Phenomenological Ontology (Chikuma Gakugei Bunko) Jean-Paul Sartre 632p_4480091068.txt
515: It can be written as follows. External negation has the dual character of being immediate and purely ideal. External negation is never something that belongs to the self.
The self is immediate in that there is no self, but it is through the absolute interiority of the self's own negation that the self discovers the indiscrimination of existence as exteriority (because the aesthetic
For in intuition I take one imaginary object.) However, such things as the negation of existence as it ought to be are not a problem at all. No.
In other words, the external negation does not belong to any of the "this things" in question. The external negation simply exists. External negation is what it is. but it is not
At the same time, however, external negation is not one of the qualities of "this thing. External negation is not one of the qualities of "this thing. External negation is,
It can be said to be a negation completely independent of the "things". This is precisely because the external negation does not belong to any of the "things. I think that the indiscrimination of existence means only this: that nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing. In other words, "Ai. We can neither think it nor perceive it. The extinction or change of "the external negation merely" cannot bind "this thing" in any way. In that sense, external negation is simply one of the things that separate "this thing.
It is an immediate nothingness. And this nothingness is the only way in which consciousness can realize the identical adherence that characterizes existence. This nothingness, immediate and ideal, is also the 513 Chapter 2: Transcendence
525: That which is, is that which is. Beauty, therefore, presents an ideal state of the world, the correlate of the ideal realization of self. In this state, the essence of things and actual existence would be disclosed as identity, but to a being which, in this disclosure, would merge with itself in its own absolute unity of immediate self. This is because beauty is not only a transcendental synthesis to be accomplished, but beauty can only be realized in and through our own totalization. It is precisely for this reason that we desire beauty, and we regard the universe as the "missing piece" of beauty insofar as we regard ourselves as the missing piece. But beauty is not the potentiality of things, just as "immediate-self-versus-self" is not the inherent potentiality of self. Beauty haunts the world as an unrealizable thing. And insofar as man realizes beauty in the world, he realizes beauty in an imaginary way. In other words, in aesthetic intuition, I perceive an imaginary object by imaginatively realizing myself as an immediate and counter-intuitive whole. Beauty as value is not usually elucidated thematically as "value outside the scope of the world. Beauty is implicitly taken as an absence on top of things. Beauty is an imperfection of the world.
523 Chapter 2: Transcendence

target2/books/Existence and Nothingness <1> An Attempt at Phenomenological Ontology (Chikuma Gakugei Bunko) Jean-Paul Sartre 632p_4480091068.txt
515: It can be written as follows. External negation has the dual character of being immediate existence and pure ideality. External negation is immediate in that it never belongs to the self, but it is through the absolute interiority of the self's own negation that the self discovers the indiscriminate exteriority of existence (because the aesthetic
For in intuition I take one imaginary object.) However, such things as the negation of existence as it ought to be are not a problem at all. No.
In other words, the external negation does not belong to any of the "this things" in question. The external negation simply exists. External negation is what it is. But at the same time, external negation is never a character of "this thing. External negation is not one of the qualities of "this thing. External negation is a negation completely independent of "this thing. This is because the external negation does not belong to any of the "things. I think that the indiscrimination of existence means only this: that nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing, nothing. In other words, "Ai. We cannot think of it, nor perceive it; we cannot perceive it, nor think of it, nor perceive it; we cannot perceive it, nor think of it, nor perceive it. The extinction or change of "external negation merely" cannot bind "this thing" in any way. In that sense, the external negation is simply the immediate nothingness that separates "this thing. And this nothingness is the only way in which consciousness can realize the identical adherence that characterizes existence. This immediate and ideal nothingness is the 513 Chapter 2: Transcendence
