The Stanford Method of Best Sleep
[https://gyazo.com/09a1b0af590181d83f21dec6a997a4ae]
	The Stanford Method, the best [sleep].
 Seiji Nishino
 [Amazon http://amzn.to/2vM9XWF]
 The obi and text are dubious, but I bought it because of the links to the papers.
  http://www.sunmark.co.jp/book_files/pdf/stanford.pdf
 claim
  I'm chronically short on sleep, but I know I can't tell you to go to bed at 23:00, not the best, but a better way to improve the quality of your sleep.
  The first 90 minutes of sleep are important.
   Difficult to shift sleep forward, if you have to leave an hour early tomorrow, go to bed as usual and lose an hour of sleep.
   If you have work left to do, staying up late to work on it and then going to bed will disrupt the "first 90 minutes". You should go to bed first and get up 90-110 minutes later to work.
  It is important to reduce the difference between skin temperature and deep body temperature
  	Bathing 90 minutes before bedtime OR Footbath

	Practice Notes
 	If I felt sleepy after dinner, I used to perceive it as a "nap" and set the timer for 25 minutes, but I usually couldn't get up and had to extend it several times. When I set a timer for 90 minutes, I set it as "go to bed early and get up 90-110 minutes later to work," and I am not sleepy after waking up.

memo
	"The principle is unknown, but it is most difficult to fall asleep just before and up to two hours before the usual time of falling asleep.
	Set two alarms, leaving 20 minutes between them, with the sound of the former being lower. If you are in REM sleep during the former, you can be awakened by the low sound, and if you are in non-REM sleep, you will not notice the sound and will be awakened by the alarm 20 minutes later. This will increase the probability of waking up during REM sleep.
	When you wake up early, forcing yourself to continue sleeping will not help you sleep deeply, so sleep is less effective, you should get up.
	[melatonin] is effective mainly in the elderly. Because the secretion of the individual is reduced.
	[Caffeine] blood concentration half-life is 4 hours
	I heard that an experiment showed that the sleepiness that occurs around 2 p.m. has nothing to do with whether or not one has eaten lunch.
		However, the secretion of [orexin] increases during hunger and arousal, and the way you write this is very scientist-like. I am sure there are readers who think, "Which is it?
