Why having a personal wiki is useful
>I have a feeling that what is essentially important is "to have your own wiki," and whether the specific wiki implementation is howm, Pukiwiki, or Scrapbox is not that important, just that the most user-friendly wiki as of 2017 is Scrapbox. I'm starting to think that Scrapbox is just the easiest to use wiki as of 2017. So I would like to think about "Why is it useful to have a personal wiki?
	https://www.facebook.com/nishiohirokazu/posts/10213263374995450
	Another article organized from the same source [value of being able to write comprehensive information].

	>"Note-taking itself is useful in its own way, in that it keeps track."
 >"Structuring it helps it stick in your memory so you can use it right away."
	So there are three levels.
 	Level 0: Do not take notes. Does not write down thoughts. Thinks only in his head and disappears over time.
  Level 1: Write down your thoughts. [Write and think].
  Level 2: [Structure] what you have written out.
  	Q: [What is structuring?]


 Q: Is a one person slack included in the wiki?
 A: Not included.
 	One person SLACK is just running "write and think".
 	Not considering the subsequent long-term structuring of the information.
  	If we were to talk about the three levels above, it would stop at level 1.
  When one needs a one-person wiki, weight is placed on [structuring information].
  	We're talking about Level 2.

 The difference between slack and wiki is look back and search

	Inconvenient due to duplication of information without a keyword link function like a wiki
 Better to be able to use it offline.
	I wasn't aware of structuring information when I was using howm.
 	howm grep anything
  It's the same for me. It's just that I wasn't as conscious of structuring information then as I am now, and it's possible that if I used it now, I would structure it all over again. It had many interesting features, such as come-from links. [howm's come-from link].
　I think people start with Level 1, "write and think" and "write down thoughts as they come to you" and then move on to "you can uncover past thoughts through search".
　　This is "explicit search."
　　Scrapbox's feature of "Suggesting connections while writing new sentences" finally becomes useful after a certain number of sentences with links have been accumulated.
 Maybe I don't feel the need for a wiki until the "amount of [information] I'm involved in" expands to a certain level.
		As I start to make "[unexpected connection] discoveries" between what I write, I start to dislike storing information in a form like a blog where it's hard to make connections #unexpecteddiscoveries

The important theory is that there is no explicit conservation
	>Nakayama: The save button and excessive notation were the bottlenecks of the koten wiki.
 > There was terrible pressure to write beautifully because I could write beautifully.
 > google docs and etherpad were good for saving and no notation.
 > Nishio Hirokazu
 > I like that there's no explicit saving or page transitions associated with it.
 > Nakayama, kite
 > I can't [output in a steady stream] because preservation requires a cohesive output.
 > Can be used to organize information, but not to organize thoughts and preserve the context of the process.
 > 大久保 康平
 > I think this is pretty essential, but is there any wiki other than scrapbox that accomplishes this?
