The advantages of Scrapbox
I was asked to speak briefly about the advantages of [Scrapbox] in my company, so I wrote notes of what I would say (2017-09-15)

	[Wiki].
	[Auto Save.
	When multiple people edit at the same time, the cursor appears like Google Docs and you can see everyone's edits #CollaborativeEdit
	Data can be exported as JSON
	JSON can also be imported
	Mechanically generating pages and tags may not be very interesting
	As a wiki, it's probably a lot better than Confluence, but if you like to categorize your pages in a hierarchy, Scrapbox may not be for you.
 	Don't try to force hierarchical classification, give up, sort of #hierarchical classification
	It's better suited for writing little bits in [bullet points] rather than long sentences.

If you want to try it out
 If you want to experience the gradual [structuring] of information, you should create a [one-person Scrapbox] and write down everything and anything.
 If you want to experience collaborative editing, you can do something like a live thread of an internal study group.
 If it's too hard to do it with information used for work, how about doing something like this for the purpose of "employees getting to know each other better" https://scrapbox.io/mitou-meikan/

What does "gradually becoming more structured" mean?
	First, I'll write it all down as I see fit.
	Useful texts will eventually be read again (found in a search, remembered while writing something else, etc.)
	Add keywords/tags as appropriate to make it "more useful" at that time
 　For example, if you write `[foo]` in the useful results of a search for foo, a list of those pages will be displayed on the foo page.
 　If you're writing another sentence and you think, "Oh, I remember writing about baz," and you unearth that sentence, you can write `[baz]` on both, or you can write
	It gets more and more interesting.

relevance
 [What's so great about Scrapbox | bitjourney Kibela https://bitjourney.kibe.la/shared/entries/259e827b-934b-4a24-b034-7ee6033c2fee]