irresponsibility
The concept of "responsibility" seems to be implicitly assumed to be a positive one, given the way the terms "responsible" and "not responsible" are used.

However, there are cases where a sense of responsibility makes things worse. If this is the case, then the premise is not correct, and we should consider that the value of "irresponsibility," a state in which there is no sense of responsibility, can also be positive.

[https://gyazo.com/4eb1332c24a037aac18fdd37fa947a25]
 https://twitter.com/kaityo256/status/908291865492971520

In this case.
	[MP] is low.
	The best solution is to defend yourself if you are playing in a party, or run away and heal at an inn if you are playing solo."
 You're in trouble and you're trying to escape, but they're coming around you.
And even though they know this in their heads, they act in a way that is not rational.
The reason for this is a sense of responsibility, or "a desire to do something about it.

Responsibility is an emotion, i.e., this is one of the bad states of "emotions preventing rational action.
Why is it that only the emotion of responsibility is seen as more noble than "getting carried away" or "blinded by money"?
 If we include the goal of "emotional satisfaction" in rationality, rather than "emotions prevent rational action," I believe that "showing that you are working hard to defeat the enemy rather than aiming to defeat him" is rational enough, and that rationality is, for better or worse, a tool to that extent. I also believe that rationality is a tool to that extent, for better or worse. ([src https://twitter.com/tasukuchan/status/909265247243984897])
 Responsibility is the act of acknowledging in advance the causal relationship between one's actions and the results of one's choices. In the case of a bad conclusion, we need to accept the failure, improve, and compensate for it. ([src https://twitter.com/matsudotsuyoshi/status/909242918027763713])
	Cases where a sense of responsibility makes things worse are when you take on more work than you are naturally capable of doing (this is your role and you have to do it), or when you are unable to get help or assign work to others. ([src https://twitter.com/matsudotsuyoshi/status/909243575795204096])
 The ability to think abstractly is related to quality of life, says Michael White. He is known for his Narrative Therapy, but he uses Foucault to shatter the tendency to make the individual the destination of blame, and Derrida to rewrite the client's self-narrative, which spirals downward by picking up only negative events. ([src https://twitter.com/kurubushi_rm/status/855768498588442624])
 The "do it voluntarily" and "do it spontaneously" instructions are the stuff of Bateson and others, but they are paradoxical instructions that cannot be obeyed in any way, and if they are followed, they are not voluntary or spontaneous. I wonder if "intrinsic motivation" also has this flavor, hence the need to change it to "content-engaged motivation." ([src https://twitter.com/kurubushi_rm/status/861095473771192320])
	I was thinking something like the relationship between an ethic of responsibility and a sense of responsibility. The former is the ethic that underlies our trial-and-error process as problem solvers, and the latter, in terms of terminology, is used to blame others. However, it often only imposes that responsibility and does not lead to advice that actually leads to improvement. ([src https://twitter.com/matsudotsuyoshi/status/909257195602055168])
 	Maybe we are talking about something like since the law cannot motivate individuals to improve their conduct (make them work diligently or make them try), the only way to intervene is by evaluating the consistency and integrity of their behavior and deeming them as responsible (or not).

	I am trying to figure out where the emotion of responsibility comes from.
  Pointing out that when others say "he/she is not responsible," there may not actually be a clear responsibility. If there were clear responsibility, he said, it would be expressed as "defaulting on a contract" or "not keeping a promise.
   I theorize that the statement, "That guy has no sense of responsibility," means, "I can't tell him to do it based on the contract because he doesn't actually have clear responsibilities, but I want him to guess what I want him to do and do it voluntarily."
 I tried to focus on the feeling of responsibility, but when I explained the situation in which I was hitting the mela when I should have run away and taken a rest, some people pointed out that I was being defensive, saying that I was not taking a rest because I worked hard and did not want to be blamed for it.
 It is pointed out that "irresponsible" is not equal to "irresponsible" and "irresponsible. While irresponsibility is mainly used when a person has a real responsibility but does not fulfill it, "no sense of responsibility" is used in a broader sense that includes such responsibility. It is also used when there is no clear responsibility.

 The words "lack of responsibility" and "lack of initiative" are similar. Some people criticize those who don't work overtime and go home quickly to do something other than work as "not being proactive in their work," but this is like saying, "I want you to take initiative and do what you are not obligated to do without my order.

[Is the mental model of MP expiration correct?"]

Context of this story
[I do a detailed task].
