Is the mental model of MP out of date correct?
from [irresponsibility].

 There is a mental model that "[MP] runs out", especially among the generation that has experienced RPGs, is this correct?
  I remember writing about this the other day when my own MP ran out https://t.co/ijLmPVmtm1
		The brain's resources can't be paid out any more."
   I think that is a common interpretation, but I think that people who are "out of MP" are often tweeting, playing games, and taking other actions that are not conducive to resting the brain. If that is the case, I think it is strange to assume that this is "a state in which brain resources cannot be paid out any longer...".
   I'm not sure what is being restored by Twitter or games.
   There are two types of conditions in which "brain resources cannot pay out any more."
   	2 types
    	No resources to pay out in the first place (→ have to sleep)
     Not ready to pay out.
    Giving the brain a break with entertainment, etc. has an effect on the latter.

   Feedback from Twitter or playing games temporarily removes the brain from a situation of complex processing.
   That has the same effect as rest and is a total plus ([src https://twitter.com/athlonz/status/909267174245654528]).

   I see, so you are saying that "by doing uncomplicated processing, we can rest our brains, which are tired of doing complicated processing. That makes sense. Just by the sound of it, though, it seems to me that recovery efficiency is better served by sleeping, and trying to recover by tweeting or playing games doesn't seem reasonable.
   Or they may feel disadvantaged against the sunk cost burden of muscle training and sleeping. I'm just wondering if it's conceivable that they'll drift into Twitter or gaming, which are easier than sleeping.
   Perhaps it seems to me that when we are tired and have less MP of a certain type, we are less able to make the decision that "it is better to sleep".
   Fatigue inhibits thinking in the long-term perspective and runs to short-term recovery behaviors.

src https://twitter.com/athlonz/status/909261990538862592