Factorio
Companies using Factorio for recruiting have talked about [Recruitment Policy #3, [Gameplay Recruiting] has started! https://www.yumemi.co.jp/ja/news/2018/181107_recruit03game]
What I wrote on Facebook:.
	Suppose you need a lot of part C. Equipment AB makes B from part A, and equipment BC makes C from B. You put these machines side by side and put in a lot of A. After a while, you see that AB's throughput is higher than BC's. After a while, you see that AB's throughput is higher than BC's throughput, resulting in a large intermediate inventory of B. Then, when A is needed for another application, you see that AB's throughput is higher than BC's throughput, resulting in a large inventory of B. And when A is needed for another purpose, A is used up and turned into a pile of useless B, and you have to wait to get A.
 	It's a very textbook failure - it's a TOC.
 You need a lot of A, so you build more and more equipment that produces A. The equipment runs on electricity, but you don't check the supply and demand of electricity. Although the equipment is powered by electricity, the supply and demand of electricity is not checked, and because of the large number of equipment, there is a shortage of electricity, so production is not increasing. It happens.
 When we talk about increasing productivity, we should not confuse whether we are getting the same results with less material or the same results in a shorter time with the same material. When raw materials are in short supply, innovations that reduce materials are beneficial, but innovations that increase production speed will only hasten depletion.
 There are many options that look good, and indeed improvements will be made in some measure, but only a few of them are appropriate for the current business situation.
 If you listen to senior managers and take the same actions, you will generally fail. This is because the business situation is different.
 It is a game of understanding and improving the system
 	Identify and destroy constraints that prevent the realization of your ideals
  Somewhat optimizing without identifying bottlenecks makes no sense.
 However, it should be noted that tangible goods are the main focus.
 	In real management, intangible goods such as information, knowledge, reputation, and trust need to be included in management.

-----
from [proposed innovation game].

#Management Games
	You can learn [TOC].
  Focusing on local optimization does not contribute to overall improvement
  Identify bottlenecks and tune there, other areas can be rather worse
  	So-called drum buffer rope
	The difference from reality is that there is no cost to inventory.
 	You could make it cost more with mods.
  The information industry is not burdened with inventory.
 When money is available for lab research consumption, it looks like management.
 	Or biters mutate like a flu virus, and research efforts are needed to create corresponding antibodies.
	The change in flasks needed when the Factorio study is completed and the next study is started and the resulting change in factory utilization and inventory is similar to a factory being forced to respond to changing market needs.
