theanine
Amino acids in tea leaves

 Alpha waves occur 30-40 minutes after theanine ingestion
  Kanari Kobayashi, Yukiko Nagato, L.R. Geneja, Takejo Kim, Takehiko Yamamoto, and Sukeo Sugimoto, "Effects of L-theanine on the electroencephalogram of pigeons," Journal of the Japanese Society for Agricultural Chemistry, Vol. 72, No. 2, 1998, pp. 19-23.
	http://www.ncbi.nlm.nih.gov/pubmed/18296328
		A dose of 50 mg increases alpha waves.
	http://www.ncbi.nlm.nih.gov/pubmed/25761837
	 Theanine administered at the same time as caffeine counteracts the vasoconstrictive effects of caffeine, but it was not clear whether this was a positive effect or not.
	http://www.ncbi.nlm.nih.gov/pubmed/17182482
	 Animal studies have shown that theanine administration increases serotonin, dopamine, GABA levels, and much more.
	http://www.ncbi.nlm.nih.gov/pubmed/21040626
	 Administration of 97 mg of theanine and 40 mg of caffeine predominantly increases accuracy during task switching. This combination appears to help focus attention on cognitive tasks.
	http://www.ncbi.nlm.nih.gov/pubmed/22214254
	 Theanine at 400 mg significantly improved sleep quality with respect to boys aged 8-12 years diagnosed with ADHD.
	http://www.ncbi.nlm.nih.gov/pubmed/18681988
		A 50 mg dose of caffeine paired with or without a 100 mg dose of theanine increased speed and accuracy in an attention-shifting task and was less sensitive to distracting information in a memory task.

	Heart rate, immunoglobulin A in saliva, and subjective sense of stress were suppressed by theanine intake after stress was applied in a Kraepelin-type mental arithmetic task.
  Kimura K, Ozeki M, Juneja LR, Ohira H (2007). “L-Theanine reduces psychological and physiological stress responses”. Biol. Psychol. 74 (1): 39-45. doi:10.1016/j.biopsycho.2006.06.006. PMID 16930802.
  http://www.ncbi.nlm.nih.gov/pubmed/16930802
  Theanine is known to bind to and block glutamine receptors. Oral administration of theanine significantly lowers heart rate and salivary immunoglobulin A (which increases when stressed) levels during stress tasks.

	Continuous consumption of green tea match, which contains high levels of theanine, a component in green tea, may prevent dementia in the elderly.
		Volunteers (average age 82) whose scores on the revised Hasegawa Simplified Geriatric Intelligence Scale exceeded 20, the standard value for dementia diagnosis, were given approximately 2,040 mg of green tea powder per day, 47.5 mg of theanine per day, and 168 mg of catechin per day for one year
		Significant difference from placebo group after 7 months
		http://www.itoen.co.jp/company/research/result/detail.php?id=23965

 Decrease in mid-onset awakenings, feeling refreshed upon awakening, feeling of sound sleep, and improved sense of recovery from fatigue
  Makoto Koseki, L.R. Geneja, and Shuichiro Shirakawa, "Investigation of the sleep-improving effect of L-theanine using actigraphy," Journal of the Japanese Society of Physiological Anthropology, Vol. 9, No. 4, 2004, pp. 143-150, NAID 110002510948
 Theanine can cross the blood-brain barrier
 	Yokogoshi H, Kobayashi M, Mochizuki M, Terashima T (1998). “Effect of theanine, r-glutamylethylamide, on brain monoamines and striatal dopamine release in conscious rats”. Neurochem. Res. 23 (5): 667–73. doi:10.1023/A:1022490806093. PMID 9566605.
 Synergistic effect with caffeine to improve cognitive activity
		Haskell CF, Kennedy DO, Milne AL, Wesnes KA, Scholey AB (2008). “The effects of L-theanine, caffeine and their combination on cognition and mood”. Biol. Psychol. 77 (2): 113–22. doi:10.1016/j.biopsycho.2007.09.008. PMID 18006208.
 Increased GABA, an inhibitory neurotransmitter
 	Kakuda T, Nozawa A, Sugimoto A, Niino H (2002). “Inhibition by theanine of binding of [3H]AMPA, [3H]kainate, and [3H]MDL 105,519 to glutamate receptors”. Biosci. Biotechnol. Biochem. 66 (12): 2683-2686. doi:10.1271/bbb.66.2683. PMID 12596867.
 Increases dopamine levels in the brain
 	Nathan P, Lu K, Gray M, Oliver C (2006). “The neuropharmacology of L-theanine(N-ethyl-L-glutamine): a possible neuroprotective and cognitive enhancing agent”. J. Herb. Pharmacother. 6 (2): 21–30. doi:10.1300/J157v06n02_02. PMID 17182482.
	https://www.jstage.jst.go.jp/article/nogeikagaku1924/72/2/72_2_153/_pdf
 	Alpha waves increase from 40 minutes after dose and persist for 2 hours
  The more anxious a person is by nature, the stronger the anxiolytic effect.
  Feel relaxed, not drowsy

 https://academic.oup.com/jn/article/138/8/1572S/4750819
 	L-Theanine and Caffeine in Combination Affect Human Cognition as Evidenced by Oscillatory alpha-Band Activity and Attention Task Performance

 Suntheanine produced by Taiyo Kagaku in Japan is often used. In the manufacturing process, it is synthesized by fermentation using glutaminase enzymes produced by microorganisms (Pseudomonas nitroreducens), without using raw materials derived from the chia tree.


https://academic.oup.com/jn/article/138/8/1572S/4750819
