How to Innovate
 [Innovation cannot be targeted.
 By [making] the place [flattened], [unexpected new combinations] occur.
 [New Combination] is [Grow].
 Most will die.
 Some new unions grow large.
 When people around them see something that has grown large, they feel that innovation has been created.

 We can only recognize innovation [after the fact].
 After the fact, they say, "How can innovation happen?" and investigate the process by which it happened.
 Because of the small sample size, many "out of the ordinary things" are observed. see [deviation from the mean and sample size].
 They falsely believe that is the way to innovate.
 Buzz.
 Try the buzz way.
 Innovation is not happening.
 Many people observe that there is no innovation in the way the buzz is generated, and the boom ends.
 Find the next "how to innovate".

	There is no generic "way to innovate".
 We need to properly face and nurture [specific] and [individual] "unexpected new combinations".

Future work
	What does it mean to "hold the place up"?
 What is an "unexpected new combination?"
 What does "nurture" mean?

feedback
 >Even though it is difficult to jump from one step to the next, it is possible in the sense that what you aim for (whether or not you were aware of the innovation) will result in innovation (and will be externally evaluated). If we focus on the part where the result is regarded as an innovation (evaluated externally), it is virtually impossible to consciously aim for an innovation.
		>For my writing, the scope that includes external evaluation is "innovation," and the scope that Oshima-san is talking about corresponds to "nurture," and I believe that nurture can be done consciously.
  追記
   >The sequence of "come up with an idea, nurture it, and have it evaluated externally" cannot be triggered by aiming. The reason for this is that "coming up with an idea" and "being evaluated externally" are uncontrollable.
   >If we focus only on the "nurture" part, it is controllable and can be targeted.
   >Personally, I feel that the nurture part is just a sequential improvement and does not match what is called innovation or innovation, but, well, different definitions of innovation will of course lead to different conclusions.

	It might be easier to understand if we assume that there is a difference between "how to increase the probability" and "how to make sure it happens" and that the latter does not exist.
	It is similar to investment strategies for stocks, for example, in that it is a method of managing a phenomenon that is not stochastic and deterministic.
  Reduce diversification by having a portfolio of highly independent stocks
  Sell the expensive ones and buy the easy ones, thinking that those that deviate from the moving average due to randomness will eventually return.
		Would it be possible to experience this in a "game with a lot of dice" in Tokoroten?

	I wrote in [The Engineer's Art of Intellectual Production], p.186 [Sprouting cannot be managed] that we cannot control "the birth of ideas = unexpected new combinations" and that we can only cultivate them so that they are likely to occur and nurture them after they are born.

初出
	https://www.facebook.com/nishiohirokazu/posts/10213362589515751