Super simple explanation for young creatives who are unfamiliar with tax returns.
(Beta version. I would like to have a final tax accountant check it before handing it over to the 2018 creator)

As an easier place to understand from a student's perspective, consider "I worked part-time and received 800,000 yen.
In this case, as you can see on the Gensen Choshuhyo, the true salary is 1,000,000 yen and the tax is 200,000 yen, which is paid in advance to the government through "Gensen Choshu", a system whereby the employer deducts from the salary. (Tax accountant confirmation required)

This is a hypothetical situation where you are paying in advance, so if the amount of taxes owed is different as a result of summarizing your income and expenses for the year, you will have to make a year-end adjustment or file a final tax return.

If your employer does the year-end adjustment, you may be able to just fill out the paper as you are told and get the story done even if you don't understand anything, but the tax return is something each individual has to do, so you have to understand and act on your own. The company will not tell you to do it this way.

In this specific example, the 650,000 payroll deduction and the 270,000 working student deduction will be deducted from the 1,000,000 payroll income to calculate taxes, and I believe the tax rate is 5%, so most of the 200,000 taxes will come back when the tax return is filed. (I'll consult my tax accountant later to see if this explanation is correct.)

It might take days if you're not used to it, but once you get used to it, you can get 200,000 for a job that can be done in a few hours. That's a pretty good rate for an hourly job.

The next example is a case where the company receives 2 million in unexploited funds. This is an outsourcing contract, so no withholding is made.
If the income is not declared as miscellaneous income or business income, it is tax evasion.
The IPA should have asked him to file a proper tax return because it would be tax evasion.

Don't you think that filing a tax return is just a complicated document?
If you don't prepare properly this year, it will be too late if you panic at the very last minute before the deadline for filing your tax return next year.

The special thing compared to so-called part-time jobs is that the money does not go entirely into a bank account, but many people use the money to carry out their "projects".
This expense can be deducted from income if properly prepared and filed.

First, file a "notification of opening of business" for Peraich with the tax office. This allows the money received to be considered business income instead of miscellaneous income. From this income, the necessary expenses for the project can be deducted.
You often hear the term "expenses," and this is what they are.

By the way, it is possible to claim even things unrelated to the project as expenses, but it is tax evasion. It is understandable that you may be tempted to accumulate expenses because the more you accumulate, the more money you will get, but be sure to report them properly.

If you fail to report the opening of your business, you will have to file a tax return for the entire amount as miscellaneous income.
Again, if they do not file, it is tax evasion.
If you declare the entire 2 million as miscellaneous income, you will have to pay about 400,000 in income tax and the following year's inhabitant tax.
(I would like to have the tax accountant here write down "this is how much it would cost in this specific case.")

Specific Examples
I will receive the full amount next year because I don't want to be disqualified for dependent care this year. Next year I will get a job, so I am certain that I will be disqualified from the dependent care deduction."
In a case where you receive 2 million in miscellaneous income and then get a job that year and have 6 million in employment income, maybe the tax rate is 20%, so you should have to pay an additional 400,000 or so, in addition to what the company withholds and pays.
Consider the case where 2 million is received as business income and 1 million of it is used to purchase items necessary to carry out the project, etc.
The tax rate is 5% on 380,000. Receive the remaining 620,000 next year and pay a tax rate of 20%. In this case, the total payment would be ~JPY.
In addition, "I don't want to be excluded from the deduction for dependents" also needs to be properly considered. The deduction for specified dependents is 630,000 yen, and even if the parent's income exceeds 40 million and the maximum tax rate is 45%, the amount of tax reduction would be about 280,000 yen. Is it really necessary to protect that deduction?


The unexplored way money flows may be confusing to students because it is unfamiliar to them, but don't think of it as a regular part-time job or a TA at school. In the world you are more like a sole proprietor or freelancer. There are a lot of tax books for freelancers in bookstores, so you can read them at random.

[http://amzn.to/2yhG2q5 Amazon "On behalf of freelancers, I've been taught about filing and saving taxes."]

I explained the necessity of filing a tax return. Frankly speaking, people around you, except you, are not bothered if you don't file your tax return. Therefore, unlike other documents, no one will urge you or remind you. You have to understand the necessity and act actively. You should ask your peers and PMs about it.

Q: What happens if my tax return is incorrect?
A: I've never experienced it, although I think there is a low probability that when it is wrong, the tax office will call me, the staff will come and discuss it, and finally I will feel like I have to submit an amended return.

