parallel carrier
 A concept proposed by Peter [Drucker] in his book "[What Will Rule Tomorrow]".
  Chapter 6 Managing Ourselves Section 5: Second Life

 Humans have outlived their organizations.
  One cannot rely on a single [organization].
  get tired of one's work
 A second life is needed there.
 There are three ways.
 	Changing organizations, changing jobs
  parallel carrier
  	Keep the work that is going well and have another world.
  social entrepreneur
  	Reduce the amount of time you devote to your job and start a new one

	[nishio.icon]The boundary between parallel careers and social entrepreneurs is not clear. Drucker describes the former as "often working for a non-profit organization" and the latter as "starting a new job, especially a non-profit one," and it is assumed that the difference between joining an existing job and creating a new one is what separates them. The choice of the name "entrepreneur" also suggests this.
  It is not a ratio of hours. There is a reference to the fact that there is an option of part-time or consultant-like contract work as well as continuing to work 40 hours a week in one's main job with respect to a parallel career.
  Being a non-profit organization does not seem to be a requirement. At the time he wrote this book, there may not have been many examples of working practices with multiple payroll entities.

	terms
 	It has to be aided and abetted even before we take the plunge in earnest.

	Opportunities for Success
  For each person, "to [contribute] to something" is important.
  One main business alone can lose it due to uncertainty.
  By having multiple lives, you have an opportunity to contribute even if one doesn't work out.
  [nishio.icon]Drucker describes this as an "opportunity for success," but I think this term is misleading, like "let's give it a shot. He does not mean "big financial success," but the feeling of having made a contribution is what he means by "success.

	About Japan
  Assumptions implicitly assumed by previous societies:.
  	Organizations are longer-lived than those who work for them.
   What works is fixed in the organization.
 	Japan has succeeded by ensuring that "workers do not move to other organizations" through its lifetime employment system.
  The challenge for the future is whether it is possible to realize freedom of movement for [knowledge workers] while maintaining social stability through lifetime employment.
  Kizuna is essential for a society to function, and Japan's challenge will serve as a model for other countries.

	[nishio.icon]Cybozu's childcare leave system, for example, can be said to be a system that balances "maintaining ties through lifetime employment" and "working but taking on the challenge of a second life" by guaranteeing reemployment after leaving the company to try something else.
  The subsequent use of the word "compound" with multiple "double" characters is also in line with Drucker's idea that "one must be aiding and abetting before taking the plunge in earnest.
  How can we achieve this? Draft [to ensure that the bond is not broken when we move on].
  Linda Gratton's [Work Shift] is a similar concept in terms of emphasizing ties = [social relational capital].
