tmutalks2017qa
Feedback on [Tokyo Metropolitan University Special Lecture on Information and Communication 2017] and our response to it.

I wrote an addendum because I didn't seem to get the point across due to my lack of words: [Machine intelligence and human intelligence].

Other: Other

	>I used to take notes a lot, but I learned how to use sticky notes in class. If we write on sticky notes and divide them into groups, we can combine them within those groups to generate ideas that we never would have thought of.
  One additional point is that notebooks also have a good point. It can be stored for a long time.
  One of the advantages of sticky notes compared to notebooks is the listability. In a notebook, for example, you cannot compare fragments of ideas written 10 pages apart side by side.
  It is best to take advantage of the best aspects of each method.

	>Science is not only about controlled experiments, but also about the laws and facts of the world in general, and rather than science being unable to cope, philosophy can be seen as a different perspective from science, a proof that facts alone cannot be true.
  Well, it looks like I have created a misunderstanding because I spoke verbatim during the Q&A about something that was not on the slides. My apologies.
  The tone of the message is as if it is refuting me, but I don't see any particular discrepancy between the content of the argument and my argument.
  As for "only facts can't be the truth," I'm like, "Yeah, right."
   To put a finer point on it, "In what sense do you use the word 'fact' and 'truth' interchangeably?" I would like to ask the question back....
  Click here for slides [what is correctness].
   A brief summary is that there are multiple ways of thinking about correctness and that there is no absolute truth.

 >I thought that by differentiating experience (3 dimensions) into charts (2 dimensions) and words (1 dimension), I could communicate to others, and what was communicated to me could be executed by integrating in the opposite direction.
  Interesting metaphor.
  I think it would be more convincing if you think about what exactly those "derivatives" and "integrals" are.
   You could involve your own specific experiences.

 >There is no room for opinions. Maybe you should put in some content that the instructor hasn't been able to fill in and put it out in the form of a question.
  Maybe!
  But others have many opinions.
  　So the observational facts tell us that "the interpretation of 'no room for opinion' is wrong.
  I think there is a lot of room for opinion without deliberately planting it.

	>Until now, I've just run with what comes to mind. Writing down what comes to mind, putting it together, and contrasting the groups is going to generate new ideas.
  Yes, I think so. And there are studies that show that the more choices you have, the better the quality of decision making. see [Quantity of Choices and Decision Making Quality].

 >I want to find something that I can continue throughout my college life.
  Hmmm, do I have to keep going on and on?
  I think that college students have a much narrower perspective than working adults because they have no experience in the business world. In such a situation, what you decide "this is it! is just a matter of what seems to be the best in a narrow viewpoint.
  If you find something that looks better, you can switch right away.

 >If you ask a question online, a lot of people will answer it.
  I doubt it. I think you are overlooking what the people who answer are acting in exchange for.
  　For example, by answering a question, "I am providing value to society by answering the question," or "I feel that I am needed by society.
  If my lecture this time was uploaded as a 90-minute video on YouTube, would people watch it and give feedback like they did this time? Wouldn't they have come to listen because they thought their attendance would lead to credit, and wouldn't they have submitted an answer sheet because submission was a requirement for credit?
  Also, when seeking an answer to a question, the questioner needs to be clear about what he or she wants to ask.
   Reference "[Questions are not shameful or useful http://qiita.com/seki_uk/items/4001423b3cd3db0dada7]"
  It is quite difficult to get useful results by asking questions on the Internet, but sometimes you may be lucky and get good results, so it may be a good idea to ask questions without expecting too much.
   [I'd like to become a security engineer" -- A current high school student's Yahoo! Chiebukuro turns into a heart-pounding turn of events as the avengers of the security world gather one after another - Net-A-Rabo http://nlab.itmedia.co.jp/nl/ articles/1604/20/news166.html]

 >I think the risks of practicing what you're interested in are high.
  Then, on the other hand, what's less risky?
  Is it less risky if your life is one of diligently doing "things I'm not interested in but those around me tell me to do?"
  　That may have been true in the days when once you joined a company, you were secure until retirement.
  　But we live in a time when you risk being restructured in middle age.
  I'll do what everyone around me tells me to do! If you were in charge of human resources, would you hire a middle-aged person like that?
  If his current knowledge is very useful for the company's business, that's one thing, but if not, I'd rather have someone younger and stronger for the same salary.
  That means those middle-aged people will only be paid less than the young people.

 >University has a diverse faculty.
  Yes, that's why it's an opportunity.

	>I want to be smart enough to be willing to listen.
  It's funny that you relate [willingness and smartness]. There are people who are [motivated] but not smart, and there are people who are smart but not motivated.
  Whatever [smarts] are at this point, I believe that if they are willing, they will grow.
  Conversely, it is difficult to motivate the unmotivated.

 >I think humans using computers will ruin humans.
  For example, the use of kana-kanji conversion on computers has probably made writing kanji more difficult than before for humans.
  The phenomenon is true.
  But to think that it is "ruined" is an interpretation.
  The reason why many people use computers instead of writing by hand to maintain their "ability to write Kanji characters" is that many people value "convenience" more than "ability to write Kanji characters".

 >Is there any danger that people will stop doing something on their own?
  There may be.
  In fact, if you go to a pachinko parlor, you will see a lot of people holding the lever and watching the LED flicker on and off.

	>What do you wish you had done more of when you were a college student?
  I should have browsed the co-op store for more textbooks and stuff from other departments.
  I went to a different university when I went to graduate school, but the selection of concessions was not great!
  I went on to graduate school in the sciences, so it was only during my undergraduate years that I was able to experience an environment where "textbooks from a wide variety of fields, including the humanities, were lined up side by side.

	>If you only have a vague, abstract idea of what you want to do, what should you be aware of in your college life?
  It is a situation where I have not yet found "an interesting subject that I would like to do.
  So anyway, you should see and hear a lot of things.

	>Machines enhance humans, did the person who first developed the machine have the ability to do more than enhance it, or can he or she create something beyond his or her own capabilities?
  For example, if we think specifically of automobiles, humans can develop cars, even though they cannot run faster than cars.
  You don't need "ability X" to make a machine that "enhances a certain ability X."

 >What software, such as search engines or e-mail, has most enhanced human capabilities?
  What's best is a hard question.
  With the birth of "programming languages," it became possible to "describe programs in human-understandable expressions," what had previously been a list of 01s.
  Most programs would not have been created without the birth of this programming language. Some were too complex for humans to handle, others were too costly to develop.

	>To contain the flood of information on Twitter and other sites, each individual should be able to set keywords and interests and only see information related to those keywords and interests.
  Actually, it's partially achieved through keyword searches, hashtags, etc.
  I think the only thing that Twitter's search functionality achieves at this point is to display Tweets that contain certain keywords.
  On the other hand, how to express "interest" and how to determine "related to it" are a little less powerful than keywords alone.
  　For example, I am interested in "unexplored", but if I use this as a keyword, I get hits for "unexplored peak", "unexplored summons", "unexplored confirmation", and other unrelated things.
  What should we do? This is a field of natural language processing that Dr. Komachi is researching.

 >I was sure that when I was teaching English at a cram school, people understood me better when I related my actual experience of making mistakes.
		～I also really like the experience of ~!

	>Philosophy of receiving from others and philosophy of really doing it oneself
  I found the distinction between "received philosophy" and "philosophy that does its own thing" very helpful.
   When I said "philosophy is important," I implicitly envisioned a "philosophy that does its own thing.
   I know it's a received wisdom, but Plato wrote that "essential knowledge must produce itself," and I agree with him!
  Conversely, the "received philosophy" of talking about what is written in a book with an attitude like "it's right because it was written in a book" is "[rootless knowledge]" and "[cherry-picked cherry branch]" that does not lead to useful application and is not "useful" and is a trivial act. It connected with the slides here and there!
  Similar to the cutoffs of "received philosophy" and "philosophy that does its own thing": "history of philosophy" and "practice of philosophy".
   There is philosophy as a discipline that collects and categorizes historical facts about who and what, and there is philosophy as a practice that we constantly ask ourselves.
 >Is it possible that the idiots are happier?
  That is a possibility. This is a problem for which we do not know the correct answer.
  I am free to choose between "learning" and "being stupid" in my life, and I choose "learning".
  Only when I die will I know if this choice is the right one, and it is up to all of you to decide which one you will choose.
  see [Unsatisfied Socrates over Satisfied Pig].

 >I can't do it unless the deadline is imminent.
  I think that's basically a situation where what you are trying to do is "too big", "too vague and you don't know what to aim for", "you don't know what to do as a first step", etc. #Vague and big task

 >I think it is only by trying to communicate your thoughts to others that you will be able to put them together or understand them.
  I think you are right. This presentation of mine has also been made by trying to communicate.

	>The idea that failure is an opportunity to learn is interesting. However, repeated failures are mentally taxing. How can we overcome this?
  It's hard when you think, "This should not fail," and you fail, but if you try it with the mindset, "I don't know if it will work, but I'll give it a try," then even if it fails, you'll be like, "Oh, I guess it didn't work.

2022/9/29
　I hit the random button and found this, which made the train ride more enjoyable than looking at Twitter.
　This page is a "big chunk" so it might be better to break it up.
　Immediately after an event, it is more beneficial to have a coherent set of items related to the event; however, over time, cohesiveness becomes less meaningful and more fluid when broken down.
　A large tree called lecture material is grown for the event, and after the event, the tree stops renewing itself and becomes a dead, fallen tree. The tree then decomposes and becomes rich decaying soil.
