Machine Intelligence and Human Intelligence
I was looking at the feedback on the [Tokyo Metropolitan University Special Lecture on Information and Communication 2017] and it seemed to me that I didn't communicate it well because I didn't word it well enough, so I'll add a supplement.

The lecture was entitled "Will Computers Surpass Humans? When will they surpass us?" I pointed out that this was "strange" in response to the idea that "computers will never surpass humans. This led to a misunderstanding, but I did not claim here that "computers will never surpass humans.
[https://gyazo.com/2e42c0014c9ed29d91bc492812b89770]

We talked about how as computer capabilities increase, so do "human + computer" capabilities.
People who use computers are already more productive than flesh-and-blood humans at this point in time, having acquired the computing power of computers, the ability to communicate information via the Internet, and the ability to search for information using search engines.
In that situation, it is not useful to compare a computer to "[a] flesh-and-blood human being" and wonder if and when a computer will surpass a flesh-and-blood human being. This is what I wanted to say.
[https://gyazo.com/011735af602e860ae789434de88457ae]

Here is the supplemental information.

Q: Will computers surpass humans?
 For example, if the vertical axis is "the ability to remember information accurately," humans are outnumbered even by a 1GB USB memory stick, because with 1GB you can remember pi with a billion digits to spare, but humans cannot remember pi with a billion digits.
 For example, if the vertical axis is "the ability to calculate at high speed," humans are outmatched even by microcomputers that can be bought for 250 yen; even a 250 yen microcomputer runs at 20 MHz and can add 20 million times per second. Humans cannot do this.
 Combining the memory and computing power of a computer, it does not take much time to retrieve a page containing a particular keyword from a book of 10,000 pages. Humans cannot do it that fast.
 If the vertical axis is vaguely defined as "cleverness" or "intelligence," and the content is vague, it is easy to make the assumption that humans are still ahead. However, if you write down the specifics of "tasks that require the use of the mind," computers have already surpassed humans in quite a few areas.
	So it is not useful to vaguely ask, "Will computers ever surpass humans?" is not a useful question to ask.

Q: Will computers surpass humans in all intellectual capacities?
	This question is much more instructive than the vague "Will computers surpass humans?" is much more informative than the vague "will computers surpass humans?
 And I do not know the correct answer to this question. I thought about it in a way that I don't know because it is interesting.
 First, regarding the story of the computer buying a human at Go. If there was now another game X with the same level of difficulty as Go, when would the computer beat the human in that game?
  If we had as many talented researchers as the AlphaGo project, as many people, and as many computers as the AlphaGo project, we could probably beat humans in about the same amount of time.
  The problem is the profit that the company gets from the project: AlphaGo was the first one, so it attracted a lot of attention and advertising, but subsequent games will be the second ones, so they will not be as effective.
  If firms acted according to economic rationality, it would take much longer to beat a human in game X than it would to beat them in Go.
 What is done by computers at present is considered "easier to do by computers" than what is not done.
  If this is the case, then "what has not yet been done by computer" should be more difficult and time-consuming than the previous problems.
  If there will come a time when machines surpass humans in all abilities, just before that time, "only certain abilities are lost to humans," and these are probably the abilities that are least suited to be done by machines.
  It is not obvious which is faster: the pace at which machine performance improves or the pace at which problems become more difficult. If the pace at which problems become more difficult is faster, then the pace of problem solving should be slower and slower.
  Many people seem to vaguely believe that computers are exponentially smarter, but if you bring the coverage rate to the vertical axis, it may take longer to approach 100% because difficult problems are left behind.
  [https://gyazo.com/4006a058b0fa1bd840d7079fa9f6f25f]
 Is it really accelerating in the first place?
  [https://gyazo.com/6896fb775add1b6eee35d2a07c6d025a]
		Even if the most recent look at the situation seems to show an acceleration, isn't this what happens when you look at the long term perspective?
  [https://gyazo.com/bb742e3dc546739caa95b71e378e21f7]
  There is no doubt that the advent of Deep Learning has dramatically increased the image processing power of computers. That said, it is doubtful that the speed of scientific progress has increased. Science still progresses in a cycle of humans reading and understanding texts written in English, humans writing programs and conducting experiments, and humans writing and publishing papers in English. Has any part of this process improved with advances in image processing?
  I think the "sharing of papers on the Internet" by arXiv and others has had a greater impact on the progress of science, and as for Deep Learning, I think the impact is not so much in itself, but more in the mechanisms that have been put in place for sharing source code and trained models.
