innovation
There is a persistent misconception that "innovation = [technological innovation]," and it is tedious to explain it every time, so I have summarized it.

[Schumpeter]: first defined the term innovation in 1911.
 Innovation ([new combination]) means to [combine] the means of production, resources, labor, etc. in an economic activity in a different way from the way they were before.
 There are five types of innovation.
  Production of new goods, i.e. goods not yet known to consumers, or goods of new quality
  Introduction of new production methods
  Developing new sales channels
  Acquiring new sources of raw or semi-finished products
  Realization of a new organization

If innovation does not occur, [the market economy] will reach [equilibrium].
 In equilibrium, firms' profits disappear.
  So we must continue to innovate.
 The economy is disturbed by innovation, and growing imbalances are [booming].
 The economy then becomes [recessionary] as it becomes more balanced.


[Drucker].
 >Innovation is not about invention. Nor is it a concept solely about technology. It is about the economy.
  By P. F. Drucker [Essential Edition of Management] p.18
 >The Meaning of Innovation Innovation is not science or technology per se, but value. It is the change it brings to the outside world, not within the organization. The measure of innovation is its impact on the outside world. Therefore, innovation must always be market-focused. Innovation focused on the product, not the market, may produce novel technologies, but the results will be disappointing.
  Ibid. p. 267.

Innovation is not [technological innovation]. The measure of innovation is its impact on the outside world, so a major innovation is an event that has a significant impact on the world.

What axis do you use to measure the "great" in "great impact"? What do you mean by "great" in "great impact"? It's a huge impact! But the term "innovation" was coined by economists in the context of an imbalance in the market economy, so it should be interpreted as a "major economic impact" rather than a "major scientific impact. Even if it is a scientifically great invention, if it did not have a significant impact on the market economy, it is not an innovation.

[New combination and parable of the surface of the water].

[Management of Innovation]
>The term innovation is often confused with invention, which is one of the problems in innovation management. It is the process of transforming an opportunity into a new idea, and then nurturing it so that it can be put to widespread practical use.