design thinking
[concept].
 'You can't use a method that assumes a problem is clearly defined when it isn't.'

 1987 Peter Rowe(professor at the Harvard Graduate School of Design) "Design Thinking"
 1991 [IDEO]創業
  David Kelley と Bill Moggridge と Mike Nuttall のそれぞれの会社の合併の形
  Steelcase had a majority stake but MBO in 2007
 2000 IDEOのCEOが[David Kelley]→[Tim Brown]
 2002 [David Kelley: Human-centered design | TED Talk | TED.com https://www.ted.com/talks/david_kelley_on_human_centered_design]
  Design used to focus on "products, things".
  At the demonstration, they would bring the product with a cloth over it, remove the cloth and the cloth, and the audience would say, "Oh!
  As products were enhanced, they moved up Maslow's stages of need and more human-centered design was required.
  It became important to show people using the product, not the product itself.
  That's why we created an in-house video team at IDEO.
  (動画の紹介)
  Designed to increase the number of entrepreneurs in Kenya.
  Designers have become involved in business strategy, which is a positive thing

 2004 David Kelley "Hasso Plattner Institute of Design at Stanford University"(aka "d.school")を作る
 2006 [Tom Kelley](David Kelleyの弟) "The Ten Faces of Innovation: IDEO's Strategies for Beating the Devil's Advocate and Driving Creativity Throughout Your Organization" #トム・ケリー
 2007 Tom Kelley+ "The Art of Innovation: Lessons in Creativity from IDEO, America's Leading Design Firm"
 2008 [Tim Brown: Tales of creativity and play | TED Talk | TED.com https://www.ted.com/talks/tim_brown_on_creativity_and_play]
 2009 Tim Brown "Change by Design: How Design Thinking Transforms Organizations and Inspires Innovation"
 2009 [Tim Brown: Designers -- think big! | TED Talk | TED.com https://www.ted.com/talks/tim_brown_urges_designers_to_think_big]
 2012 [David Kelley: How to build your creative confidence | TED Talk | TED.com https://www.ted.com/talks/david_kelley_how_to_build_your_creative_confidence]
 2013 Tom Kelley, David Kelley "Creative Confidence: Unleashing the Creative Potential Within Us All"