How to get compensation
How to create something of value and get paid for it #Monetization

 It is especially useful to look at a catalog of the various ways of earning compensation, especially for those who have only experienced the position of a company employee and cannot think of any other way of earning compensation other than employment, or for students who have no experience earning money and only have ideas like, "Can I just put up an ad for the time being?" It is beneficial to catalog and look at the wide variety of ways to receive compensation.

 Sell Products
 	Transfer ownership and get paid for it.
  Make a physical object, give it to them, and get paid for it.
   Doing handicrafts as a hobby and selling them on Mercari
  Transfer software copyrights and get paid for it.
  Sell research reports
   A case where the reproduction right of the report itself is transferred to the buyer, and while the buyer is free to resell the report, the seller is not allowed to resell it.
		Buy physical objects and sell them at a higher price.
   Buy large bags of candy, divide them into smaller portions and sell them in the lab.
   Stock umbrellas at a discount and sell them in front of the station when it rains.

 Lending products for use
  Receive compensation for the right to use
  Lending a physical object for use and getting paid for it
  Sell "the right to connect to the server on which the software is running and use the software's functions for a certain period of time.
   So-called subscription model
  Licensing the use of a patent and obtaining a patent royalty fee as compensation
  Sell research reports
   When the seller has the right to reproduce the report and the buyer uses it within the scope of the license agreement
  This is what most so-called "license agreements" are.
		Real estate leasing
  	Get paid for renting space in coworking spaces, etc.

	Compensation for labor
  Contract of employment (salary): the worker promises to perform the employer's labor, and the employer pays the worker remuneration.
   Hourly, monthly, and annual salaries are available.
   Usually, the employer has the right to give orders and the laborer is obligated to follow the orders.
    see [Rights and obligations of workers and employers｜Isaki Labor Management Office http://izaki-office.jp/affairs/jinji/%E5%8A%B4%E5%8B%99%E7%AE%A1%E7%90%86%E3%81%AE%E5%9F%BA%E7%A4%8E%E7 %9F%A5%E8%AD%98/%E5%8A%B4%E5%83%8D%E8%80%85%E3%83%BB%E4%BD%BF%E7%94%A8%E8%80%85%E3%81%AE%E6%A8%A9%E5%88%A9%E3%83%BB%E7%BE%A9%E5%8B %99]

 contracting
  The contractor promises to complete the product and the client pays for the results
  Promises to complete software
  Commitment to do a Proof of Concept and submit a report
  I'm promising to complete it:
  	The recipient cannot break the contract.
   The receiving party is liable for defects. Even if the receiving party is not clearly at fault for a defect, the ordering party may demand correction or compensation for damages.
   The definition of "completion" (requirements definition) must be clear in advance.
  The ordering party does not have the right to give orders, so they are free to decide how to proceed with the work.
		A person who is good with a camera gets paid for taking and giving a picture of a request "take a picture of this".

 Quasi-delegation ("delegation" is used only for legal actions by attorneys and others)
  A quasi-commission contract in which the mandator entrusts a designee to perform an act and the designee accepts the mandator's consent.
  At the same time, you enter into a contract to receive compensation for that quasi-consignment.
  Unlike contracting, there is no goal of "completion," so it is common to bill for a period of time
   Charging by the hour (Visa Sukuk)
   You get paid for one meeting.
   Sometimes a continuous contract at how much per month.
    Contract says I will attend two one-hour meetings per month.
    Contracts for up to 10 hours of consultation per month.
   	Participate in the chat and comment on the consultation on a best-effort basis.
  Example of implementation and compensation for live coding during 3 meetings
   [System 39 | Joizo Corporation https://www.joyzo.co.jp/service/system39]
   Software development is probably quasi-commissioned since it is done through meetings without the need to create specifications in advance.
  I imagine this is often the case when the product is not tangible (like consulting)
  How do they prove that they "did the deed?"
   What is the difference between contracting and contracting if you are contracting for deliverables that can eventually be verified?
   It appears that quasi-contracts should not require deliverables.
   A case in which a report is promised to be delivered is a contractual agreement.
  The ordering party has a duty of care to take good care of the order.
  The client does not have the right to command and control.

  Examples of quasi-consignment for results
   Quasi-contracting with designers and other specialized technicians at a "fee per hour of work".
   Can you trace this for me?" I want you to update this page," etc., asking for specific results.
   Each month, you receive an invoice summarizing the month's operation and pay it.
   They want results, but those results are not what is written in the contract.
   Can you do this for me?" "No, I can't" can happen.
    Since the recipient is not responsible for completion, it is still a quasi-contract under the law.
   A state in which the designer accepts the act of "answering miscellaneous consultations from non-designers".

	revenue sharing
  Contracts that say, "I get a percentage of sales."
  Common in book publishing contracts
   Receive 10% of sales as so-called "royalties
  Affiliate Income
  	Receive a referral fee of 3% of sales when a product is sold by introducing it on your blog, etc.
  Can be used in software development.
  In some cases, joint ventures are created when research is a collaboration between companies.
  There needs to be an audit clause to make sure sales are being reported correctly.

	Receive in kind, not in money.
  The famous stock option to receive compensation for labor in the form of the "right to buy stock".
  Cases where the payer does not have sufficient funds to pay salaries in cash
  Cases where people who find it inconvenient to receive in cash receive in kind.
   Goods, rights to use the facilities, car fees, etc.

 Make a donation
  coinage
  There are real music and games that have a type of billing that allows users to donate any amount they want.
   I wonder if there's a way to do that if you have a dedicated fan base.
  We get donations from companies that want to say they are involved in some kind of public interest activity and donate to such activities.

	membership fee income
 	Run some kind of community and have people pay dues for the value of staying in that community.
  Idol fan clubs
  academic conference
  General incorporated associations are exempt from taxes on membership fee income, which is why academic societies are often incorporated as general incorporated associations.

 Allow people to use it for free and monetize it with what they derive from the action.
  Get paid by advertisers by having many people visit your website for free and placing advertisements on it.
   AdSense
   Event Sponsors
		Let people use it for free, but collect some data and sell that data for money.

 Reference: Typical contracts in the Civil Code (13 types)
  Gift: A contract to give property to the other party without compensation.
  Contract: A contract in which the contractor promises to complete the work and the client pays compensation for the results of that work.
  Exchange: a contract in which the parties transfer property rights "other than money ownership" to each other.
		Sale: A contract whereby one party, the seller, transfers property rights and the other party, the buyer, pays for them.
  Loan for consumption: A contract formed when one party, the borrower, receives money or other things from the other party, the lender, promising to return the same thing in kind, quality and quantity. (A contract is a contract with consideration when the borrower pays interest, and a contract without consideration when the borrower pays no interest.)
  Lease: A contract formed when one party promises to allow the other party to use and profit from a certain thing and the other party promises to pay wages for this use and profit.
  Loan for use: A contract formed when the borrower, one of the parties, promises to return a certain thing after using and profiting from it without compensation and receives it from the lender, the other party. The difference from a loan for consumption is that the borrowed object is returned, and the difference from a lease is that it is free of charge.
  Employment: a contract in which the laborer promises to perform the employer's labor, for which the employer pays the laborer remuneration.
  Deposit: A contract whereby the donee holds an object for the depositor.
  Partnership: An agreement between two or more parties to invest in and jointly operate a business.
  Settlement: An agreement in which the parties make mutual concessions and agree to cease their disputes.
  Life term deposit: A contract that promises to pay money or other things to the other party or a third party on a regular basis until the death of a specific person.
  Mandate: A contract formed when one party, the mandator, entrusts the other party, the designee, to perform a legal act and the designee agrees to do so. However, if the mandator pays a fee to the designee, the contract becomes a bilateral contract with a fee.

	incomplete
  When you don't get paid, you create a company, pay bills from it, and accumulate them in that company (you don't pay yourself a salary from that company).
  