Metaphysics as a practical science
When asked what he learned at [MOT], he said the most important thing was "[metaphysics] as [practical] learning.
[first published at https://www.facebook.com/photo.php?fbid=10204336308344363&set=a.1175498944176.2027303.1129148772&type=3&theater] [2014]-10-08

What did you gain from your studies at MOT?
 I was going to write "What did I gain from what I learned?" but it's too much to explain in just a blog post.
 It was a new experience for me to have a mix of students from undergraduates and working people, and more group work (more working people).

Metaphysics as a practical science
 One example of what I learned was "understanding that correctness in the natural sciences is just one way of thinking about correctness."
 This is really the most important thing... metaphysics as a practical science...
 People like me with a background in the natural sciences tend to think that the concept of correctness in the natural sciences is universally valid, but this attitude is at odds with the social sciences.
 To simplify, disprovability and reproducibility of experiments are of no use at all when it comes to the correctness of business decisions. What then defines correctness?
 This kind of talk is the [theory of truth] of philosophy, but when you simplify it, several definitions of non-contradictory correctness are feasible, and the best fit for business administration is pragmatism, [pragmatism].
 When others are talking about correctness, I now have a bird's eye view of which correctness they are choosing.
 This is exactly what I mean: [The wrong attitude may be more science-oriented than humanities-oriented. |Kawakami Ryosei's Heart｜Kawakami Ryosei｜cakes https://cakes.mu/posts/7040] [Kawakami Ryosei]
  This entry separates the humanities and sciences, but I believe there are at least three positions. Mathematical sciences believe that what is logically correct is correct. Natural science systems cannot adopt that "correctness" because logically nothing can be proven no matter how many experiments are repeated. Therefore, they define correctness in terms of disprovability and reproducibility. In the social sciences, if disprovability and reproducibility are required, the discipline itself will cease to exist, so we cannot adopt such "correctness. Therefore, the definition of correctness is based on usefulness.

Variety of definitions of [strategy] ([strategy safari])
 Same with strategy, the word strategy is used in several different definitions.
 While some people only have in mind the strategic theory of Porterian bosinesses, our company has a very high affinity with the strategic theory of learning.
 The direction in which groupware is changing is toward supporting organizational learning.
 Therefore, research on "how to learn" is very important, and there is considerable future in incorporating the findings into groupware.


What motivated you to enroll in MOT?
 It was four years ago, so my memory is a little fuzzy, but "Moshi Dora" was a hot topic at the time. At a bookstore, I flipped through the novel version and the one written by Drucker himself, and found his version more interesting, so I bought that one.
 The next thing was to realize that a blog post that I happened to think "I never thought of that idea, it's interesting," was actually just Drucker, a steak shredded and sprinkled with exciting spices. I thought the author of that blog was a smart guy, but then I realized that I was actually just a poor student of business administration, and that I needed to study more.
 Also, in the case of programming, the situation is like "I'm impressed by reading a Japanese blog that just happens to be on the topic," but in that field, the action is "Let's read the official documentation of the language. I thought that even if the field is different, the principle of "consult the original source" would be the same.
