Heaven is not made above mankind, nor man beneath mankind
This is a catchphrase from [http://www.aozora.gr.jp/cards/000296/files/47061_29420.html] by [Yukichi Fukuzawa]. It is sometimes used to assert that "people are equal," but that is not Fukuzawa Yukichi's intention.

Summary of the first two paragraphs of the study
 Heaven is not made above mankind, nor man beneath mankind
 But if you look at the human world at large, there is as much disparity as clouds and mud.
 The difference between the wise and the foolish comes from learning or not learning.
 A person who does difficult work is a person of heavy status. A person who does easy work is a person of light status.
 If one's status is heavy, one's house is rich. Although this may seem out of reach to those of lower status, the difference was originally made by the ability to learn. It was not decreed by the heavens.
 People are not born noble or lowly, rich or poor. Those who learn and know things well become noble and wealthy, while those who are uneducated become poor and lowly.

In other words, he is not saying "the world today is equal" or "it should be equal." He is saying, "The world today is unequal, but it is a difference made by the ability to learn." It is, as the title says, a "study guide.

You can read it in the Aozora Bunko: http://www.aozora.gr.jp/cards/000296/files/47061_29420.html

Summary Continued
	I'm not talking about the impractical literature of knowing difficult letters or composing poetry.
 We should put those fruitless studies next and learn [practical studies] first.

	Two are equal
 3
 	Countries are equal
  an independent nation with its own interests at heart
 4 学者の職分
 5,6 Talk for intellectuals
 7 The office of the citizen
 8 Rejection of Confucian hierarchical relationships
 9 Two types of purposes of study
 10 Continued from 9
 11 8 continued
 12
  advance a speech
  向上心
 13
  Grudges are not good
  Freedom of speech is important.
 14
  Long-term planning and inventory
  Supervision and protection go hand in hand.
 15
  scepticism
 16
  Protecting Independence
  [Self-assessment and competence match].
 17
  How to gain recognition from others

#TODO I'll write a little more about it later.