Programmer's nightmare
	[Tom Jolly https://en.wikipedia.org/wiki/Tom_Jolly_(game_designer)] によるボードゲーム(2000) [rule http://www.silcom.com/~tomjolly/pnrules.htm]
 and a clone by Nishio who wanted to play with it (2009)
  After playing and discussing with Nakayama Tokoroten, randomness and other factors in the RUN phase were eliminated.
  Tom Jollyには2009年の時点で連絡していて、このゲームをsimplified version of Programmer's Nightmareと表現してよい旨の許可ももらっている
  Then I wondered if I could turn it into a flavor for non-programmers, "Battle of the Spaghetti Monsters."
   2009-2010 I looked for it and found all the documents in the BoSM folder in Dropbox.
  Left in 2010, not knowing how to find designers, how to produce things, etc.
 2017年
 	Excavated to bring to Cybozu board game camp
  There are recent examples of card games made with money raised through crowdfunding.
  Easy to outsource work in the form of crowdsourcing
 	Could a situation be in place that would make it easier to shape?
  flavor problem
   Direction to Programming
    Possibility of subtle differences that may cause concern (e.g., reversal of program counters).
   Pulling up to the Spaghetti Monster (as it stands now)
    [Flying Spaghetti Monsterism - Wikipedia https://ja.wikipedia.org/wiki/%E7%A9%BA%E9%A3%9B%E3%81%B6%E3%82%B9%E3%83%91%E3%82%B2%E3%83%83%E3%83%86% E3%82%A3%E3%83%BB%E3%83%A2%E3%83%B3%E3%82%B9%E3%82%BF%E3%83%BC%E6%95%99] stuff doesn't get through that well.
   Wizard Programming
    Mandatory programming education in elementary school is coming, so the main game part can be done by 10 year olds.
    Difficult stories for adults should be in the form of an appendix or online commentary.

 	[Rules for "Battle of the Spaghetti Monsters"]
   2017-10-25更新
    Rename fast magic cards to face-down magic cards, and stop adding cards that counter the opponent's actions.
    I made sure that a draw would not occur during a stalemate.

  [Create card game]
  [Creating board game frames]
  TODO
  	Card Design
   Box design

	2019年
		I thought I'd make a version that was closer to programming.
 		[Spaghetti Code" rule]
 		Bug, ForkBomb was one arbitrary enemy, but I made that a parameter too.
 		This text from the immediate command card has been moved to the instructions: MoveCommand can be executed instead of executing a flagged command in the activation phase of one's flag.
   	The cards themselves will be the same as regular command cards, so you might be able to mix and match.
  	Specified that "any card" includes Instant cards.
  		If a player is good enough to install Instant, they can handle it.
  		In other words, there is an Increment to enhance the Instant card, and there is a MoveCommand to plug the Instant into the program.
  		The timing of the reinforcement will reveal the information, and since it is not flagged when moved by MoveCommand, it can only be activated immediately in the limited pattern of MoveCommand -> AddFlag. So you're throwing away part of the original "unspecified card is suddenly activated" capability.
			stalemate resolution rules
				>If there is a tie, the side with the closest flag from the beginning wins -> the player with the first flag on the card with the current cursor wins: because the "beginning" is unclear
			I put the rulebook into Google Docs and it was 7 pages long, and when I tried to compress it, I concluded that it was 4 pages with all the extended rules removed.
				https://docs.google.com/document/d/1fzJHFD_aUUwC4biHQLKbZ5Wb5Fks4IDbG24dABXh-dQ/edit?usp=sharing


