The Value of Dedication
Related to Softbank's ban on side jobs.
 >"I'll pay you so much money that you won't have to do any side work, just concentrate on your work for my company!" It makes sense to bow down and say, "I'll pay you enough so that you don't have to do a second job!
 I was thinking about the statement that

 I was uncomfortable with the implicit assumption in the expression "devote yourself to the work of the company," that devotion has value.
 Companies that promote side hustles may be estimating the value of "what the company gets from the side hustle" higher than the value of dedication.
 I remember Softbank doing something like an in-house entrepreneurship school.
 As the start-up company grows and stabilizes, the founder thinks, "I need a mechanism to create the next business.
  However, since the adult members of the organization are "people who work for a growing company," there is a significant bias in perspective.
  They would like you to look outside to resolve this.
 So he thinks about creating opportunities for more people to see outside the company through side jobs ([parallel work]).
  In-house startups that are told to "start a new business" cannot be increased too much because of the high cost of the organization and its members.
 So even if you promote side jobs, it would be a shame if you do side jobs that are "just an exchange of time and money" that do not bring value to the company.
  It would be good to be able to explain exactly what the company will have as a result of the second job.
		If they cannot do so, they will not be evaluated positively even if the ban on side hustles allows them to work on the side.

[nishio https://twitter.com/nishio/status/918645443130564608] 2017-10-13


 The other day, when I was talking about "maybe you don't feel that devotion is worth it," there was that exact case where the CEO asked me to try a side job at age 51, and I did it, and wrote on the company blog that "I'm no longer company-centric" as a benefit. w
 [The story of how a corporate executive officer who has devoted himself to the company started a side job. The story of how an executive officer who has devoted himself to the company started a side business | Cybozu Style https://cybozushiki.cybozu.co.jp/articles/m001198.html]
[nishio https://twitter.com/nishio/status/920850375812333569] 2017-10-19