交渉
	[** Happy axis story]
  The world is not your mama.
  People in the world don't "put your happiness first".
   If all the people around you, such as your parents and teachers, were at least fifth to your happiness, then you have been blessed. If you continue with that way of thinking, you will be unhappy in the future, so you should quickly change your way of thinking.
  The shift in thinking is that "all people are working for their happiness, never for yours.
  Since we all have different happiness axes, just because they disagree with you does not mean that they are evil and you are righteous. It is simply a relative difference.
  There is a rule called the law to prevent things from getting too bad, but conversely, to the extent that it is not against the law, it is your responsibility if the other party's actions damage your happiness.
  In negotiating with others, we must first try to understand their happiness axis

 [** 提供者の量と交渉力の関係]
  In negotiating the exchange of resources, the fewer the donors, the greater the bargaining power of the donors.
  If several manufacturers want a part that is only made at one factory, that factory can exert strong bargaining power in deciding which manufacturer to sell it to and at what price.
  Conversely, factories that make parts that can be made at any factory are unable to resist price reduction demands from manufacturers.
  Therefore, in negotiating an exchange, it is necessary to consider what is the resource being exchanged and what is its scarcity.
  In negotiations where labor time is exchanged for money, one might mistakenly think that "money is a strong resource" when one sees a strong case of the party offering money. It is not; it is just that "labor time, especially for unskilled people," is very weak. Money is also a relatively weak resource.
  [Five Forces Analysis https://ja.wikipedia.org/wiki/%E3%83%95%E3%82%A1%E3%82%A4%E3%83%96%E3%83%95%E3%82%A9%E3%83%BC%E3%82%B9%E5%88%86%E6%9E% 90]

	[** Assessment of one's worth].
  Nakayama Tokoroten:.
 	>In the case of young creators, their surroundings (schools, universities) are the world, so sometimes a little bit of skill has a tremendous value, and they tend to assume that they have value in society as it is.
  (Note: I'm misreading it backwards.) As you point out, you might underestimate your own value because of all the amazing people around you.
  If you are approached to negotiate with a well-known or well-known company, you may think that you are negotiating with a stronger entity than yourself.
  However, the reality is the opposite. You have a scarce resource, and that big company wants that resource. That is why they are approaching you to negotiate.

	[** 知識は交渉力の要]
  Knowledge is the key to negotiating power. If you are the only one providing information in the initial meeting and you fail to elicit it from the other party, you will find yourself in a more unenviable position in the next meeting. Remember, information itself is a resource.
   Do not be ashamed to ask questions. Don't pretend to understand what you don't know to make yourself look like a superior person.
   For example, if you pretend to have a good understanding of licensing agreements for intellectual property when you have no knowledge of the subject matter, no one will think you are amazing. They will just judge you as "this guy is a tall guy" based on the "he doesn't get it" feeling that comes from the rest of your responses. They may be kind enough to send you an explanatory note, or they may take advantage of it and offer you a deal that is not in your favor.
    Even if you are offered an unfavorable contract, if you agree to the contract, it is your responsibility unless the contract is against the law. Even if you cry to your lawyer after you realize that the other party was not acting for your happiness, you will say, "Why did I sign such a contract?
   Nakayama, Japan
    In conversations between professionals, it is common that neither of us knows the other's field, so "I don't know what the word ~~~ means, what does it mean?" are rather frequently used in succession.
    If you know that your expertise is multi-axial, you will not be afraid to ask questions of the other person. The other person doesn't know about you either.
    see [can learn from someone with little knowledge].
   It is not always the case that you ask a question and what they explain is correct. Of course, they may have [malicious intent], but even without malicious intent, they may simply convey incorrect information due to [incompetence].
    For example, they may say, "When we work together on a project, the copyright of the programs created in the project naturally belongs to our company, right? This is correct for employees, and if they have little experience with joint projects, it is understandable that they would try to treat the project the same as an in-house project without malice. However, it is a mistake.
    So, while it is important to ask about what you do not understand, if you leave the role of teaching only to your negotiating partner, you may come to an incorrect understanding. You should have an expert whom you can consult as well.
    Neither we nor our negotiating partners are basically experts, especially with regard to the law, which is the rule of society. Our negotiating partners may have their own in-house legal departments or hire their own legal counsel. We need experts on our side to consult.
  You should seek information on who has the decision-making and decision-making authority. Because when negotiating something, that is the person who should be persuaded.

 [** let's act peacefully]
  I talked about awkwardness first, but there is no need to show awkwardness in actual negotiations. People want to avoid awkward relationships.
  Confrontation should be avoided if at all possible, it's better to bring out a sense of unity, but if you can't help but give in in the end, then confrontation is the way to go.
  The longer it takes to negotiate, the weaker and weaker the company's employees become. This is because many people feel hesitant to report to their bosses, "We discussed this for a long time, but it broke up. If you want to act rationally, you should take the best course of action at the moment, ignoring the time and resources you have invested up to that point, but many people are unable to do so.
  There is no need to be unnecessarily hostile, and it is preferable to make each other happy if possible. But that does not mean sacrificing one's own happiness for the other's happiness.
  Do not give away something that does not need to be given away. When you give away something of low value to you, you should consider whether it could be exchanged for something of greater value to you. That is the card of negotiation.

 [** You'll pay a high price for wanting it.]
  At the negotiating table, the other party will offer some resource, specifically a merchandising opportunity. If you think, "I can't pass this up," you are in a very vulnerable position.
  If there is a certain product and you really want to get it, you are willing to pay what they are asking.

	[** altruism is not good].
  Okubo, Kohei: Many people who are poor negotiators are altruistic, so it is necessary to recognize that "your taking a job at a low price is a negative for society as a whole.
   Don't think it's "good" to accept a free or low price, it's dumping, it's market sabotage, and your negotiators, the buyers, may be happy, but your peers will hate you, or something like that.
   On the other hand, "the happiness of your peers" is also not "your happiness".
   For sellers, especially in a situation of excess sellers, peers are competitors competing for the limited resource of buyers.
   Under such circumstances, the effective strategy is to take resources through dumping, establish a track record, and then convert that track record into trust, etc., to occupy an advantageous position over the competition.

 Jun Harada: The trick to negotiation is a rule of thumb though.
  ①商習慣を知る
   Each industry has its own unique business practices, and I think that just knowing these standards first will help us to avoid asking for unreasonable orders and to be able to be more aggressive.
  (2) Be clear about the results you want to see objectively.
   Even for a single meeting, I feel that there are fewer mistakes if the desired outcome is clearly defined, such as "Let's hold the schedule today," "Let's hold down the budget for the next term," or "Let's drag out the great person. On the other hand, areas that can be conceded can be used as bargaining cards.
  ③power, time, informationの三要素を抑える
   It's a trifecta from the book You can negotiate anything, but I'm pretty sure it will change if you are aware of it. I'm not going to go into what's in the book, because there is a book. In a nutshell, if you can control the person who has the authority to make the decision, take up the other party's time (don't let them consider anything else), and fill the outer moat, you can usually win.
  4) Never fight a losing battle in the first place.
   Even if there are unavoidable circumstances, it is a good idea not to get involved in things that make bad sense in the first place.
  (5) Make room for yourself.
   Negotiating for money when you don't have it is not a good idea because you will lose because you want too much money. It is important to have enough money even if it is a lie.
  (6) Be careful about appearance
   There is a law that says that a businessman without a watch and without leather shoes is not to be trusted, just as a programmer in a suit is not to be trusted, so it is a good thing to be dressed like one, no matter what.

[初出 https://www.facebook.com/nishiohirokazu/posts/10213563687183067]

[rules] [justice].
[Malice is less frequent than misunderstanding.]
