Make people aware of the usefulness of the tool
What we talked about at the CybozuMeetup on 2017-10-18

 Both [kintone] and [Scrapbox], from the standpoint of familiarity with them, cannot be replaced by other services, so people changing jobs will want to introduce them at their new companies.
 But other people don't understand how good it is.
  Difficult to verbalize goodness.
 Scrapbox needs some writing and more articles to see the value.
  But when you introduce a new one and you're the only one writing, it's like, "This is where he writes.
  How can we create a situation where all team members write?
 Top-down implementation
  For use in university laboratories such as Masui Lab, the teacher decides which tools to use.
  In many cases, Qiita Teams are also being introduced by department leaders.
  University labs replace about 25% of their people every year.
   The turnover rate of college graduates within 3 years is 31% according to 2010 statistics, which is a very high turnover rate considering that university laboratories are 75% of the workforce.
 To get them to try it out.
  Not sure what to do first.
  Twitter allows you to write without having to think "where to write".
  As for Scrapbox, on the other hand
   I wonder if I could create a new page."
   What kind of content should I write about?"
   'I wonder if I could rewrite an existing page?'
   There are psychological hurdles such as
  Maybe in the Masui Lab.
   Instruction is being given to new students to create their own page and place images for icons.
   There is already a page that is used like a one-line tree bulletin board with bullet points and face icons.
    From the looks of it, you're afforded "I can add my own writing here too.
   The compulsion to use it is generated when the teacher assigns you an assignment to write something on a page somewhere.
   Maybe there is a Slack for communication in the lab, and there is a channel there for update notifications.
  In the Shiozawa Lab.
   The compulsion to use Scrapbox's collaborative editing to have students do short compositions in class.
    You will witness collaborative editing, which is one of Scrapbox's strengths
		In the unexplored name list
  	First machine-generated personal pages for all unexplored parties involved.
   	[/mitou-meikan]
			Give more and more editing privileges to requests to update the description of your page.
