Originality first before co-creation
2022-03-03 This article was written in 2017 after seeing a Tweet about contest entries. It was/is mentioned often over the next 5 years, but mostly in a different context than the contest application. Perhaps a more generalized statement is needed.

2022-12-31
	[If you want to go fast, go alone; if you want to go far, go together.]
	[Good team application].

---
2017-10-23
I have seen Twitter posts about entering contests, etc. that say, "I want to enter ~ and I'm looking for friends! I'm looking for friends! Why not apply alone?

Is there a misconception that "more people increase the probability of success?" Is there a misconception that "two people can achieve twice as much as one?" These misconceptions overlook the cost of communication and the cost of setting a single direction for the team.

Often there is no compulsion to participate in this type of contest, unlike activities at school or a job at a company.
　In other words, if a team member is demotivated, he or she will naturally become inactive.
　The team leader is required to manage the team in a way that is quite difficult to maintain and inspire the members' motivation without the coercive force of graduation or salary.
　Think more members mean less responsibility? You are wrong.
　　It is the team leader's responsibility to keep team members motivated.

Do those who recruit their friends realize that they are trying to get their hands on such a difficult issue?
 If the direction is not consistent, it will be counterproductive, and the members who work together must be chosen carefully.
 I don't understand the point of vaguely "recruiting" friends on social networking sites.
  Do you mean, "I'm looking for a slave to do for me what I don't want to do and am not good at?"
  Is this a convenient "we are vocalist, band members wanted" type of situation?
 It would be easier if it was explicitly stated that "I am good at X but not so good at Y, or I am looking for someone who is good at Y."
  But I'm not a big fan of these types of openings because I think it's better to have a broad perspective when you're young than to specialize in a narrow field of expertise.

Good knowledge to know before trying to add more members.
 >Decrease in the amount of tasks performed per person when working together in a group as the number of people increases.
  [Social corner-cutting - Wikipedia https://ja.wikipedia.org/wiki/%E7%A4%BE%E4%BC%9A%E7%9A%84%E6%89%8B%E6%8A%9C%E3%81%8D] #Social corner-cutting
 >[Brooks's Law]: Putting people on a software project that is running behind will only delay it further.
  >Adding personnel to a software project increases the overall effort required in three ways. The overall effort required when adding personnel to a software project increases in three ways: the effort expended on the reassignment itself and the resulting work stoppage, the training of new personnel, and the additional interactions.
   [Mythology of the human moon - Wikipedia https://ja.wikipedia.org/wiki/%E4%BA%BA%E6%9C%88%E3%81%AE%E7%A5%9E%E8%A9%B1] #Mythology of the human moon

2017-11-18 [originality] first before [co-creation].