Rules for "Battle of the Spaghetti Monsters"
 Number of persons 2 to 5
  (Basically designed for two people, but any number of people can be used by preparing frames of different colors.)
 Play time 10 min.
  (I hope there is a way to put a time limit on it, because if you start thinking too long, it will take an infinite amount of time.)
  (There is also the idea of an hourglass, but there is no way to reset the time when the turn is passed to the opponent.)

What's in it
	10 island cards (+ 8 blank cards)
 10 islanders x 5 colors (poker chips)
 Magician Coma 1 piece
 Blessing Chip 5 pcs.
 Curse Chip 5 pcs.
 Life counter 5 pcs x 5 colors

 (When the original programming language-style flavor was changed to a magical flavor, it was changed from command to island, bit to islander, program counter to sorcerer, increment to blessing, decrement to curse.)

Game Objectives
	Defeat all players except yourself.
 way of defeating
  Reduce life to 0
  Set the bit to 0

Card Description
 [https://gyazo.com/6d451d26ae8cdb893ac6c6d1b6ab5e2e]
 [https://gyazo.com/08c478019e2264ba74082352856ab8ee]
 Square brackets are represented by curly brackets {} for the convenience of Scrapbox.
 Level 1 island cards: 5
  Death: remove any {1} islanders from the game
  Drifting: moving any {1} islanders to the end of another island
  ■Birth: raw: add an islander to the end of any island other than this island
  Prayer: Prayer: -{1} life of enemy spamon
  Sacrifice: Sacrifice: Reduce enemy Spamon's life to -{2} and remove the islander who cast this spell from the game.
 Level 2 island cards: 3
  Move Island: Move {1} island to an arbitrary location.
   If a sorcerer is on board, the sorcerer moves with the island.
  Reverse Current: The mage reverses the direction of the current around the island.
  Sink: remove any island from the game, along with all of its inhabitants.
   If a sorcerer is on board, the sorcerer moves to the next island.
 Level 3 island cards: 2
  Bless: Bless: +{1} to the number in square brackets on any card
  Curse: Curse The number written in square brackets on any card is -{1}.
   However, the number in square brackets cannot be negative.
 Extra: Expansion cards: 3
  Revolution: Reverse the order of islanders on all islands except this one.
  Memory: The magician performs the magic of the island where he stayed just before and before.
   Either activate both or don't activate both.
  Blank: blank: here you write your new magic
 Uncover Magic Cards: 3
  Move Island: You can activate Move Island magic instead of activating island magic in the activation phase of your islanders.
  Drifting: moving any {1} islanders to the end of another island
  Prayer: Prayer: -{1} life of enemy spamon

rule explanation
 The rules of "Battle of Spamon" are difficult to understand in their entirety at once, so it is recommended that you start with level 1, and only after you are familiar with the game should you attempt level 2 and level 3 rules.
 ■Outline
  The "Battle of Spamon" game begins with a "Preparation Phase," followed by an "Islander Placement Phase," and finally a "Magician Patrol Phase. In the "Preparation Phase" an island is prepared, in the "Placement Phase" the islanders are placed on the island, and in the "Patrol Phase" the sorcerer moves around and uses magic at the islanders' request.

 Level 1
 ■What to use
　　Choose 5 of the island cards labeled Level 1: Life, Death, Drifting, Prayer, and Sacrifice. Also, use the sorcerer chip, islander chip, and life counter. On level 1 islands, you can use magic that affects the lives of the islanders and spammers.

 ■Game Preparation Phase
  Shuffle the island cards and lay them face down on the table, placing a sorcerer chip on the first card placed. Deal out 5 life counters and 4 islander chips to each player.
  Decide on the first and second moves.
   Since the first player has the advantage at level 1, the unfamiliar player is placed first.
   If equal, decide by rock-paper-scissors-scissors, or the last person to lose moves first.
   For a more rigorous method of determination, see "Fair First Move Determination" in the Appendix.

 ■Phase of islander placement
  The first player chooses an island and places his or her islanders on it. Next, the player chooses an island and places his or her islanders on it. This is repeated until all four islanders are placed on the island.
  During the islander placement phase, no more than two of your islanders may be placed on the same island. Also, the islanders are arranged in rows in the order in which they are placed on the island. This means that "the first islander to arrive is the highest".
  The location of the islanders will greatly affect the subsequent sorcerer patrol phase, but if you are playing for the first time, you may not know where to place the islanders to gain an advantage. In such a case, place the islanders in order from the first island and proceed to the sorcerer patrol phase.

 ■Magician patrol phase
  The sorcerer, in turn, visits the island and, when asked by the islanders, activates the magic (the effect written on the card) that is handed down on the island.
  If there is no islander chip on the island visited by the magician, this is an uninhabited island and nothing will be done.
  If there is an islander chip, the first (highest) islander in the line has the right to ask for the magic to be activated. You can also choose not to ask.
  If there are still other islanders in the queue after the magic has been activated, the next islander is given the right to activate the magic.
  This is repeated until the end of the row, and when everyone has been processed, the magician moves on to the next island.
  When the magician finishes his work on the last island, he returns to the first island. This is repeated until the game is over.

 The only time you are limited to one islander per island is when you first place an islander. You can have more than one islander on an island by using the "live" (add islanders) or "drift" (move islanders) spells.
 Islanders removed by "Death" (remove islanders) magic will be removed from the game. If there are no unused islanders, activating the "Live" (add islanders) spell will not add any islanders.

 ■Exit Game
  Victory is achieved by removing all enemy islander chips or reducing the enemy spamon's life to 0 or less.

 Level 2
  ■What to use
   The level 1 tools are used in addition to the level 2 island cards "Sinking", "Reversing Currents", and "Moving Islands". The level 2 island allows the magician to use magic that works on the direction of the magician's movement or on the island itself.
  ■Phase of islander placement
   Place 5 islanders, one more than level 1.
  ■Magician patrol phase
   The "Sinking" card, added at level 2, is a very powerful card that removes an island with its inhabitants. The seemingly meager "Reversal of Currents" (reverses the direction of the sorcerer's patrol) and "Island Movement" also create powerful combos when combined with other cards.
  ■Exit Game
   At level 2, there are more ways to win where the sinking of an island removes the last islander of the enemy. If the sinking of an island removes all the enemy islanders, the player with the highest islander (first in line) wins.

 Level 3
  ■What to use
   Use the level 2 tools with the level 3 island cards "Blessing" and "Curse" and the Blessing/Curse chip. On the level 3 island, you can use magic that affects against magic power.
  ■Phase of islander placement
   Place 6 islanders, one more than on level 2.
  ■Magician patrol phase
   Curse and Bless cards allow you to select any island and change the number enclosed in square brackets of the spell. For example, blessing a "Prayer" spell "reduces enemy Spamon's life to -1" will increase the number by 1, replacing it with "reduces enemy Spamon's life to -2". On the other hand, if you curse the card, it will become "-`0` to enemy Spamon's life", which means that the card will have no effect even if it is activated.
   The effect of the curse cannot make the number negative.
   A curse/blessing on an island is represented by placing a blessing/curse chip on the island.
   If a blessed island is cursed, instead of placing both chips, the first blessed chip placed is removed. The reverse is also true.
   Rarely, if you have used up 5 chips each, you cannot bless/curse any more.

Stalemate Resolution
 In rare cases, a situation occurs in which the situation does not change at all when both players choose the action they want to take, as in the Sennichite move in Shogi. The exact same board situation repeats itself, and the game ends as soon as one of the players declares "this is a stalemate". At this time,
  - The one with more Spamon lives wins.
  - If there is a tie for life, the player with the most islander chips on the island card wins.
  - In case of a tie, the one with more "islanders at the front of the line" wins.
  - If there is a tie, the side of the islanders closest to the beginning of the island wins.
The first two are the following.


Strategy Tip.
 ■There are islands where it is advantageous to place the island first and islands where it is not advantageous to place the island first. For example, island migration and current reversal favor the later side because the opposite operation can be performed later to counteract the operation of the first-placed islanders. On the other hand, in death and drifting, the first islanders can kill or wash away the second islanders, so the first is favored.
 ■It is advantageous not to place islanders until the last minute on islands where the enemy has placed islanders first.
  This is the case for the rule that only one person of each color can be placed on each island at the time of initial placement.
 ■ Cards that have been nullified by curses (NOPs) are very convenient as a destination to move islanders by drifting, for example. However, it is dangerous to forget the possibility of the card being blessed.
 ■ You will want to place many of your own islanders on the blessed card, but they may be removed en masse by the sinking card.
 ■The sacrifice card first reduces the opponent's life, then the islanders are removed. Sometimes the last islander sacrifices himself to reduce the opponent's life and wins just in time.
 ■■ At level 1, "Death" reduces one of the opponent's four islanders and also reduces the number of moves the opponent can take, so "Prayer", which reduces one of the opponent's five lives, is weaker than it, and "Sacrifice", which reduces one of your islanders and two of your opponent's lives, is even weaker. However, this strength-weakness relationship is affected when the number of islanders increases with level, or when islanders are created by "raw" cards.
 ■ Due to the rule that islanders removed by "death" (removing islanders) magic are removed from the game, a loop in which one side increases the number of islanders by "life" and the other side decreases the number of islanders by "death" does not become an infinite loop. This is because the islanders are removed from the game and there are no unused islanders to add.
 ■"Reversing the Currents" (reversing the direction of the sorcerer's patrol) only changes the order in which the sorcerer visits the island, but does not change the fact that the first person on the island is the greatest and acts first. That order is introduced by the extra card "Revolution". However, there is no major problem if the rule reverses the order of execution of the islanders due to the reversal of the currents, so it can be played as a variant rule if agreed upon by the players in advance.
 ■If the sinking of an island removes all friendly and enemy islanders, the player with the greatest (first in line) islanders on that island wins. This rule can be changed and played as a variant rule, as it is a hunch that it would be better to do so.

Tips for teaching people the rules
 Let's do it gradually from level 1.
 The first move has the advantage, so let's give the opponent the first move.
 If your opponent is having trouble figuring out what to do in the islander placement phase, place them alternately, starting with the first island.
 Having started at a disadvantage, you may feel compelled to think long and hard to turn the tables. However, if you do this, your opponent will be forced to wait for a long time and lose, which is no fun at all. Prioritize raising your opponent in the game over winning now.

extension rule
 For those who are used to the Level 3 rules and find them insufficient, there are extended rules.

Introducing the Island of Revolution
 Use the extra card "Revolution". On this island you can use magic to reverse the order of the islanders on other islands.
 Under the no-revolution rule, if there were multiple islanders on the same island, they were all given the decision to activate magic in turn. This rule is changed when a revolution card is inserted. Each time the sorcerer visits, only the first islander in line is given the decision to invoke magic. The first islander in the line moves to the end of the line if the magic is activated. If no magic is performed, the first islander remains at the end of the line.
 This rule increases the value of the "do not activate magic" option. This is because it will have the effect of not giving the islanders behind the row a chance to activate it.
 It also makes it easier to create combos as the sorcerer moves faster.

Introduction to Memory Island
 Use the extra card "Memory". On this island, the magician can recall and activate the magic of the immediately preceding and preceding islands visited.
 It behaves as if the memory card contains a description of the island visited immediately before and immediately after. It does not matter if the island is incremented during play, or if there is an opponent's bit on the island. Also, you can only choose to activate both magic or not activate both.
  Might as well give them a choice.
  Might as well let the editing affect it.
   But if you decide to remember the content at the time of the visit, it's hard for a human being to remember it when it's rewritten after the visit.

Introduction of face-down cards
 The rules of "Battle of Spamon" are like Shogi or Go, without any hidden information or luck elements. For those who don't like it, the Fuse Card Expansion introduces hidden information and an element of luck. This expansion increases the unpredictability of your opponent's actions.
 Use level 3 tools with additional face-down cards.
 The face-down magic cards are shuffled face-down by the first player after the island cards are lined up and before the islanders are placed, the second player chooses one card and the first player chooses one card. The one card not chosen remains face down until the end of the game. The player who has his or her
 The face-down card is activated by the sorcerer by his own islanders, not by the magic of his own island. A face-down card is removed from the game once it has been used.
  (It is possible as a variant rule because the game can be played without being removed from the game, but it is probably too strong to ruin the opponent's program (plan) with a series of drifts and becomes a game of luck in drawing face-down cards.)

Fair first-past-the-post decision
 For those who wish to remove the element of luck to the extreme, this section explains how to make a fair first move.
 First, one player A deals cards. The cards may be arranged in any order, or shuffled and arranged in any order.
 If shuffled, player A can look at the cards dealt and then redeal them if he thinks "this lineup favors the first or second player.
 Player B, the player not dealt the cards, can then choose whether to play first or second. Player B can choose whichever side he thinks has the advantage, and Player A can choose whichever side he thinks has the disadvantage, so there should be no complaints.

multiplayer (i.e. game)
 Theoretically, the game can be played by any number of players as long as they have different colored islanders' frames. However, since this is originally a two-player game, there is strong interference between players, and one person may be eliminated early due to concentrated attacks.
 The eliminated players are bored with nothing to do until the end of the game. Therefore, we came up with an extension rule called "Interrupt".
 The dropout gets one bit each time the wizard returns to the first island. At any given time, shouting "Interrupt" will generate an interrupt and add an islander to the end of any island.
  However, the game may not converge and may take a long time to play.
   We have not done much test play yet.

Sequential opening
 Lay out the island cards face down.
 First, the first card is opened and the first player decides whether to place or pass the islanders. Then the second player decides whether to place an islander or to pass. If both players pass, the next island is opened.
  First move, second move, first move pass, second move pass" ●○ Next island, ● is the first move
  First move, second move pass, first move pass" ● Next island, ○ is the first move
  First pass, second place, first pass, second place" ○ Next island, ● is first
  First pass, second place, first place, second place, first pass, first place" ○● Next island, ○ is the first move
  First move passes, second move passes, and the next island is the first.
 The rest will be played normally.
