How Engineers Work
We are looking for information about good places for engineers to work.

 After all, it's "better to have this or that," so it might be better to make it an explicit trade-off question.
  20% increase from current salary, but 20 minutes longer commute.
   http://gigazine.net/news/20171031-daily-commute-damage/
  The chair will be a pipe chair from my current salary, or my annual salary will decrease by 500,000 a year, but the chair will be an Aeron chair.

impetus
 Recommended by employees at drinking parties, etc.
 The other party approached me.
 Environments in which respected people have shown interest.
 I made it.

When you were choosing your current workplace, what did you consider in deciding whether or not to put it on the list of candidates for consideration?
 High degree of time flexibility
 They'll hire you immediately.
  Because I lost my job and was in trouble.
 Keep writing code and deploying it, that's what you do.
 Workplace Atmosphere
  Feel that you can work well with the people you work with.
  Do you enjoy your work?
  Company Atmosphere
   Be sincere
   We value transparency.
 The president, board members, and immediate supervisors were highly impressed with the technology and wanted to hire me.
	colleague
  The thinking of the engineers who work
  Skill level of engineers working
  We looked to see if the company has engineers who are both industry leaders and great personalities and are on the front lines of the organization.
 An environment that values engineers
 work schedule
 Growth & Challenge
  Whether the environment is conducive to growth.
  Whether the area is technically difficult or not.
 I am a user
  The company must have a B2C service that I can use.
  Can I be the final user of what I develop?

 Business model (must not be an obnoxious type)
 PC performance of the development environment
 Must be able to work remotely
 Proximity to technology stack
 Salary and wages++
  treatment
 support
 Business condition of the company
 The right technology for you
 The technology you want to do

What was the deciding factor in your choice of your current workplace?
 Rules with a high degree of discretion over the use of work time
 Being able to get a job right away.
 Feeling that I could work with good business people and see results.
 Research could be done.
 It looks like we can do big things.
 An environment where you can grow.
 The fact that they allowed me to work almost completely remotely as a "trivial" matter.
 Management Policy
 Drinking with management and the executive team was a good fit.
 An environment that values engineers
 Atmosphere
 Goodness of the chair
 work schedule
 Business model (do not want a business that encourages gambling), development environment (PC performance, remote work possible), internal atmosphere (do they value honesty and transparency?)
 Duties
 Respectable employees who are enrolled in the company.
 Where technical and web terms were 100% understood by the interviewer.
 The above reasons were met.
 Dog fooding (using their own products made by themselves)
 The environment must be responsive and capable of developing services.
 To be able to concentrate on the work that needs to be done.
 Ability to work reasonable working hours.
 Hospitality
 Salary and wages++

What's the best part about your current place of employment that you didn't expect?
 Free++.
  Free dress.
 No need to take the train.
 My colleagues are decent as people.
  There are no real incompetent people with technical skills who are annoying as people or who can't do anything.
 Employees get along well with each other.
 Easy to express your opinion to your supervisor.
 Non-engineers have a good understanding of technology.
 salary
 atmosphere (e.g. musical)
 Excellence of the people around you
 Salary increases
 work schedule
 There are a lot of smart people, but no one who is great.
 An environment where people enjoy working with people they respect.
  Positive emotions are intensified.
 Historically, engineers have been in a stronger position than salespeople.
 The ability to be exposed to a wider variety of technologies than expected.
 well ventilated
 Where I can take time off or telecommute without feeling guilty when I have to take time off or telecommute for family reasons, such as when my child gets sick.
 Benefits were far better than I could have imagined.
 Short working hours
 be able to speak English

The bad part
 I was too laissez-faire and didn't know what to think about and what to work with.
 Technological skills are low.
 The exercise of "flextime" is not viewed favorably by company executives.
 I have to be there on time in the morning.
 Slow to move in any way.
 Management is full of uncles.
 Sometimes there are decisions that are not rational from a cost standpoint, and I often think that you should use that budget to buy that thing that has been submitted for approval before.
 The company does not receive a fair evaluation by the employer.
 Depending on where you work, you may be less connected to the company.
 Thin middle manager layer
 facility
  desk
  air conditioning
 Morning commute is hard.
 The place does not look like an IT company.
 Company Atmosphere
 I had no emotional support when things were negative for me.
 Business is in the red
 Treatment including salary.
 The level of engineers around me varies widely and there are many differences.
 Task Management
 Compared to the rest of the world, the pay was not as good as expected.
 Internal procedures
 Work is boring.

What did you want to know before you joined your current employer?
 corporate culture
 I want to talk to the people I will be working with to see if our values are compatible.
 Workplace Atmosphere
 Delicious food and crafts from the region where the headquarters is located.
 What career plans exist
 There wasn't one in particular because I had been allowed to participate in an internal study group for more than a year before I joined the company.
 Specific Tasks
 Is it too hard a way to work?
 Development Decision Flow
 Where one's heart is.
 organizational structure
 Technology Stacks
 Number of active users of the service
 Sales/Profit
 Actual treatment of employees
 organizational structure
 Wanted the opportunity to ask in depth what kind of work might be done by the people in the department that might be in charge of the project.
 welfare programme
 What technology are you really using?
 Code quality

What made you start considering leaving your previous employer?
 Low technical skills
 Poor working environment
 Deterioration of business conditions++
  The company is no longer running well.
 The treatment of discussions about internal injustices as fights and the response of not disturbing harmony.
 We don't agree on how to proceed when starting something new.
 Distrust and anxiety due to the feeling that the company does not care about its engineers
 Limitations of Contract Development
 Incompetent middle management coming down from business partners
 An overwhelmingly annoying and pompous engineer came in to impose his way of doing things.
 Problematic behavior by supervisor
 Directors and superiors are not competent
 When you receive an invitation to change jobs from someone you respect
 Can't talk about the latest trendy web applications at a drinking party
 "My supervisor's lack of understanding and a little bit of harassment."
 I'm not sure what makes me happy anymore because I'm not a user."
 I'm tired of working.
 I was beginning to get bored with the lack of movement in the technical area, breaking new ground or starting new businesses.
 salary
 Length of working hours
 salary
 My market value
 The emptiness of repeated contracted development like mercenaries

(If you have changed jobs) What made you decide to leave your previous job?
 Be the first to think of reasons for refusing a proposal or job in order to escape responsibility due to lack of technical skills.
 Entered graduate school
 Intensity of favoritism among company executives and middle managers
 The boss's flattering attitude toward the trading company
 The salary was not commensurate with my skills. At the beginning, I felt as if the president highly valued my skills, and I worked with the intention of repaying the favor even with a low monthly salary, but I realized that it was a complete "I can do Haskell -> write PHP" type of thing to begin with. I realized that the president was just a superficial jerk, and the technology was just a person who was always working hard for the president and a person like Migiude who worked with the president.
 I got a passionate offer from my current employer.
 Receiving a job offer from a new company.
 salary
 An overwhelmingly annoying and pompous engineer came in to impose his way of doing things.
 Problematic behavior by supervisor
 Directors and superiors are not competent
 The environment was one in which only technically dependable members of the team were available.
 Knowing the average salary of engineers in the engineering community who appear to be comparable to yourself.
 Having received a formal offer of employment from the incumbent.
 I wouldn't go so far as to make up my mind, but when I was having coffee with a colleague at my current position, he happened to give me an opportunity to meet with upper management, and then that was it, an interview, and before I knew it, I was hired.
 Offer from an acquaintance in the company
 boss
 Bosses who are good at protecting themselves from the company but incompetent at their jobs.

free-text entry (e.g. in online forms)
 It is disastrous when "critics" who don't (or can't) move their hands at all have authority!
 I would like to be allowed to work in partitioned or private rooms if only to facilitate daily work.
 I want commuting to be eliminated (work anywhere).
 In terms of compensation, the company's assumed career plan is vague, so it depends on how each employee works. Since it depends on the work assigned, it is impossible for some people to get a pay raise or promotion.
 Good luck with the tally.
 In the past, my job changes were based on my determination to change jobs! But recently, I feel that I have been loosely moving from one company to another, loosely taking advantage of the opportunities presented by the various contacts I have made.
 I learned that it really is up to the president to change everything in the company.