Announcement Parallel Chat
A format in which the chat exists in parallel in time when the presenter is giving a presentation.
Audience members of the presentation can chat with each other

	The author first experienced it at a programming symposium in 2003.
  It was on IRC.
 They're doing it at WISS too.
 Disadvantages of IRC
  Majority of people no longer use IRC clients on a regular basis
 At the time of Lingr's appearance (circa 2006), Prosin tries to migrate from IRC to Lingr
  but the chat became unavailable due to a problem with the coupling from the venue to the outside network.
  Comet, the communication technology used by Lingr, keeps a grip on HTTP requests without the server returning a response
  Was this incompatible with the venue hotel's poor internet connection?
  Prosin to set up an IRC chat server in the venue with RasPi.
 At Prosin in the summer of 2017, we set up a chat on Slack before the event started.
 On the other hand, the unexplored systems were migrated to Facebook
  Advantages
   Presenters should be able to immediately see the log of their presentation in progress
   Ability to add information, etc., even after the event is over.
   人脈形成の支援
  treatment
   Post the presenter and title of the presentation in advance and hang topics related to that presentation in the form of replies to it.
 At the 2017 Unexplored Junior, a channel was created for each project on Slack for discussion during the presentation and communication during the project
  The final results briefing was held on Facebook.

 2012 [Advantages and disadvantages of using Facebook for presentations - Yasukazu Nishio's Hatena Diary http://d.hatena.ne.jp/nishiohirokazu/20120805/1344098195]

	There was a page with similar content "[conference chat]"
		I think the essence is not "being at the conference" but "having a chat parallel to the presentation," so let's focus on this one.
		I copied and pasted it below.
		Conference Chat
   A style of conference presentation in which a chat screen is placed separately from the presenter's screen
   [nishio.icon] experienced at the Programming Symposium. It was already there, at least in 2002.
    I find it very beneficial.
   Apparently WISS started even earlier.
    Continuous Practice of Communication Promotion at Conference Events https://ipsj.ixsq.nii.ac.jp/ej/?action=repository_action_common_download&item_id=141633&item_no=1& attribute_id=1&file_no=1]"
  As of 2019 [Cybozu] has a "generic actual space" in its internal groupware.
  	A thread is created for each event, where the actual situation is discussed.
  	The expression [live thread
  		[live thread].
  Some say it looks like a Twitter hashtag.
  	[tsudaる]
  		It's very detailed: [What is Tsudaaru? Word article - Niconico Encyclopedia https://dic.nicovideo.jp/a/tsuda%E3%82%8B]

	There is a difference in the "style of placing a chat screen separately from the presenter's screen at conference presentations," which I had somehow taken to be common.
		The stage where there is a chat (or Facebook group) parallel to the presentation, and the stage where it is projected next to the presenter on a projector.
		The former step also has the advantage that "the presenter gets far more feedback than in a situation where the presenter is limited to verbal feedback.
			Projector projection on a single channel, such as IRC, limits the "chat of interest" to a single point for participants
			On the other hand, one of the disadvantages of a type with a thread for each announcement, such as Facebook, is that there is no single point of focus
				At unexplored events, the operation of creating a thread in advance for each presenter & this is communicated to alumni/alumnae in advance, so as for individual presentations, it is smooth, but for irregular guest lectures, people write in the "chat" thread without realizing there is a "guest lecture" thread & while they are writing, they are not aware of the Not being aware of that division, it happens.
				Some people continue discussing the last presentation when the next one has started.
					This is a disadvantage for the next presenter, but may be an advantage in that it allows for deeper discussion of the previous presenter's presentation without being tied to time

[https://www.microsoft.com/en-us/research/blog/the-rise-of-parallel-chat-in-online-meetings-how-can-we-make-the-most-of-it/ The rise of parallel chat in online meetings: how can we make the most of it? - Microsoft Research]

