Example of Compound Industry
Information on case studies outside of Cybozu is highly solicited.

 [Who decided on "one person, one occupation"?　After 27 years in IT, what is the next "2+1 duplication of work not tied to a company" that I chose | Cybozu Style https://cybozushiki.cybozu.co.jp/articles/m000379.html]
  Examples of working for more than one company

 [The story of how a corporate executive officer who has devoted himself to the company started a side job. The story of how an executive officer who has devoted himself to the company started a side business | Cybozu Style https://cybozushiki.cybozu.co.jp/articles/m001198.html]
  A case in which an executive officer who has dedicated himself to the company is encouraged by the president to engage in multiple businesses.

 [Working at Cybozu made me realize that there are four types of double jobs, and I thought that we can't talk about double jobs all at once.]
  Classified into four categories: "individual + individual," "individual + company," "company + individual," and "company + company.
  Pointing out that there is nothing wrong with multiple jobs running for freelancers.

 ["Even if the remuneration was zero, I was doing double work" - Why Yasukazu Nishio did not quit Cybozu Labs and started working as a technical advisor for machine learning | Cybozu Style https://cybozushiki.cybozu.co.jp/articles/m001358.html]
  Examples of working for more than one company
  engineer

 [Resolving the blur of a third year in the workforce with a double job! A sales employee walks the path of a tennis YouTuber | Fledge https://fledge.jp/article/tennis-gon]
 [Cybozu's first-year employee, Mr. Atsuta, chooses the option of dual employment | Fledge https://fledge.jp/article/cybozu-atsuta]

 [Will Gate, which has just announced the lifting of the ban on multiple jobs. What's behind the decision - HARES.JP http://hares.jp/2016/08/01/willgate-interview01/]
 [Large companies are the ones that should be encouraged to work on the side! The results of enfactory's "no full-time job" policy. | CAREER HACK http://careerhack.en-japan.com/report/detail/461]
 [Recruitment employees' side hustles from bag design to interior design firms - Log Me http://logmi.jp/72284]
 [What is the secret of startups that do not work unnecessary overtime? Three tips to learn from Goodpatch's way of working and thinking. | CAREER HACK http://careerhack.en-japan.com/report/detail/558]
 [Go Bold's idea behind Mercari's introduction of the merci box - Log Me http://logmi.jp/129759?pg=3]
  Side jobs are encouraged.
   The company is not open 24 hours a day.
   It's great to contribute to society by using your excellent talents in your private time.
   The "no side hustle rule" is stifling the best and brightest talents.
   It also means support for a better personal life.
 [Interdisciplinary engineers are needed, without the barriers of literature and science─Daisuke Katsura, CTO of Livesense, "The Way of Work"｜CodeIQ MAGAZINE https://codeiq.jp/magazine/2015/02/21495/]
  >In an age when you can earn a great income if the smartphone app you write is a hit, the principle of no side jobs is impossible.

 Yahoo
  [Companies that can turn "entrepreneurship" into a side business: Nikkei Business Online http://business.nikkeibp.co.jp/article/topics/20130708/250808/]

 A story about a woman in management at a large company who was easily approved for coaching as a side business with a proposal to "act as an experimental role model for parallel careers for women.
  [twitter https://twitter.com/sr_takuchan/status/923423413338644480]

 [Half of the employees work more than one job! Enfactory, a company that "bans full-time jobs and encourages parallel work," has begun hiring new graduates - Rplay [Replay] http://rplay.me/1962]

 [Ramen musician Takuto Ide: "When my hobby became a side job, it broadened the scope of my main job" | Parakari｜Media for new ways of working Powered by freee https://parallelcareer.freee.co.jp/interview/20171024_ ramenmusician/?utm_content=buffer6a2af&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer]

 [How a Former Major Airline CA Achieved a Parallel Career [Licko Nekogawa] | DRESS [dress] https://p-dress.jp/articles/5195]

 [Why shouldn't you spend the rest of your life in a large organization? Career Theory in the Age of Multiple Careers | BUSINESS INSIDER JAPAN https://www.businessinsider.jp/post-106071]
  Some people see "promotion" as "increasing influence within one organization" and others as "increasing influence outside of an organization."
  There is a widespread belief, especially among the younger generation, that they do not know if the organization to which they now belong will survive forever.