Creation of board game frames
2017-10-28
 [https://gyazo.com/75aff0b063584e590bc70cff7690538b]
 Tokyu Hands shopping
  [https://gyazo.com/adf3ff752a71ac657c5e0ca10839df84]
  	Porcelain tiles: 345 yen for 50 tiles, 490 yen for 144 tiles of a single color
  Cherry board, length 150 x width 100 x thickness 5mm, 162 yen
  acrylic plate
   Light-collecting acrylic 648 yen x 2
   Other acrylics: 194 yen x 3
	Tech store daily fee: 4,860 yen
  Acrylic laser cutter 2 hours
   [https://gyazo.com/10fb3f023ba6aadda3c06ed0d6091c90]
   The negative frame was first made as the opposite of the negative-positive one, but it killed the acrylic's transparency, so it was reworked.
   I started with creating the data and it took me an hour and a half.
   The rest of the time is spent making meeples as requested by my wife.
  Wood laser cutter 1 hour
   [https://gyazo.com/6aa839bbbf9ccd6e5d039baf02afa53a]
   I was worried about cutting it because it is 5mm thick, but I heard it can cut 18mm or so.
   The laser engraving on the wood surface was too thin at first, so we slowed it down and burned it in.
   As for the arrow frames that are often pinched and moved during the game,
    Acrylic is cooler looking.
    Wood with a thickness of 5 mm is better for ease of pinching
   The situation is troubling. I made a version of each and a version of acrylic over wood.

 before and after
  Made from plastic plates
   [https://gyazo.com/96fcd38d97b4b2a41ea696c7eb302ff3]
  Made of acrylic and wood
   [https://gyazo.com/29d3a4e6341f8da6b86f1b3b44be070d]
  much improved

 unit price
  From one light-collecting acrylic plate, you can get 80 pieces even if you cut them out roughly, or 128 pieces if you pack them in properly. The unit price is 6 yen.
  You can get 16 arrow frames from one piece. The unit price is 13 yen.
  You can get maybe 28 wood arrow frames from one piece. The unit price is 6 yen.
  Gluing the arrowheads together costs 19 yen per unit plus the machining labor, so I don't want to do it if at all possible.
  The $4,860 tech store usage fee is not included in the above calculation. This is the bulk of the cost.
  	It would be difficult to make 10 sets a day of regular chips (10 flags 5 life x 4 colors + 10 flags) from light collecting acrylic.
  	→About 500 yen usage fee per set
  	→ Not priced to be included in the regular edition, make one acrylic chip set for yourself, mass-produce in the remaining time, and sell separately.

#Card Game Creation