Basic Groupware Functions
	[Flow and Stock]
 	Deliver information to others quickly (flow)
   Can be delivered to multiple people.
   One line message like chat v.s. One lump message like email
    Chat system sent on a new line affords "send a short message of one line".
  Store information and find it when needed (stock)
   search (e.g. for someone using a search engine)
   file sharing
			Can discover associations between stocked information (those that can do this are rare, e.g. Scrapbox)
  相手の状況把握
   Online/Offline
   在席/外出
   出勤/休暇
   I'm typing a reply right now (some chat apps, Facebook).
   Messages sent are read (LINE)

	Existence of [permalink
 	For example, when you say, "Where is the contract with Mr. X?
  If the file has been uploaded to the groupware and has a permalink, I can put a link saying "here it is".
  If not, we'll put up the actual file.
 	The phenomenon of missing permalinks tends to occur when exchanged only as email attachments
   I couldn't find it, so I asked them to send it to me again.
  Version control availability
  	If the permalink is not a link to a specific file, but to the version control history of that file, there is no "which is the latest" problem.
   It is easy to check "how it used to be."
   Cybozu Office's "File Management" and features in Dropbox

 再利用
  For example, if you have a workflow in which you "apply for something and approve it" with paper documents, only the form part is reused, and the input content has to be entered from scratch each time.
   For example, you could write the applicant's address and affiliation many times.
  In a workflow that is electronic, the
   Able to list applications submitted by you in the past (stock)
   We can reuse that.
  This is a feature of the system. Reusing an existing application eliminates the need to re-enter unchanged portions of the application.

	traceability
  In a workflow with paper documents, if someone in the middle of the workflow loses the paper, for example, or forgets to work on it and stops for a long period of time, the people around him or her will not notice it
  Electronic workflow allows you to see at any time how far along your application is

 Preliminary review of external actions
  You can have other employees review a draft of an email that you send from your company account to an external party, just before you press the send button (i.e., with the CC, recipient, etc. filled out, not just the body of the email).
   Of course there are permalinks.
  You can search and refer to emails sent out by other employees.
  Mailwise Image

	Checking the condition of things
  The problem described in "Traceability" that paper documents can be misplaced is caused by the tight coupling between the physical existence of a "paper document" and the state of its "location.
  This resolution has fundamentally occurred not by "replacing paper documents with electronic ones" but by "unbundling the tight coupling of states"
 	For example, suppose a paper document comes from an outside source and needs to be stamped by a company employee. This cannot be done by digitizing the documents.
  In this situation, the electronic workflow for a "seal application" would look like this, for example
   The person himself/herself applies for a seal
   Manager checks and approves
   社長が承認
   Person in charge of stamping (legal, etc.)
   It comes back to the person in question.
  The "status," such as "checked by manager and awaiting president's approval," is separated from the paper and can be checked at any time on the groupware by anyone concerned.

	Communication Support
 	[Communication regarding scheduling]
