Differences in axiomatic systems
 When two sufficiently [logical] people disagree
 Logical tracing back to what causes [disagreement] may lead to a disagreement on [axiom] ([working hypothesis]).
 People with a background in mathematics or [philosophy] (in the case of philosophy, especially those with a background in [truth theory] and [relativization of correctness]) can tolerate axioms that differ from their own axiomatic system as a separate system.
 The choice of base axioms is different, but they both utilize the same logical thinking skills, so [emulation] is easy. #Emulation


	axiom
  The real world is fundamentally complex, but humans are incapable of thinking in its complexity, so approximations are made, and the method of approximation
  [abstraction] for the economics of [thought] #thought-economy theory
 Consideration for the emotions of others
  is necessary
   Some people might be offended if I do X."
   Being offended is a cost, and if it can be foreseen, it should be avoided."
  Unnecessary
   You shouldn't care if others are offended by your doing X, because it's agnostic and out of your control."
    I use the simple [approximation] of "[agnostic]" for human emotion.
   It is not rational to speculate about the agnostic and the cost of avoiding it.
 Whether or not human beings are of equal value.
  Equal-opportunity group
  Non-equal group
  	Even if someone says "equality" in a pretty way, it is just talk if it is not accompanied by actual actions to equalize the value of "oneself and underprivileged children in distant countries". If you insist on equality, you should distribute all of your income, except for the minimum amount necessary for your own survival, to ensure the survival rights of underprivileged children in developing countries.
 Whether or not to assume equal human intelligence.
  Equal-opportunity group
  	Although there are innate differences, they are negligible compared to the effects of subsequent learning.
   Even those who are stupid now can improve as much as others by properly motivating and learning.
  Non-equal group
   It is possible that people who are stupid now will improve in the future, but it is within the margin of error and can be ignored.
   Rather than devote our efforts to raising the level of the stupid, we should spend our efforts on raising the level of the smart even higher!
 Whether or not we consider humans to be [homogeneous].
  Homogeneous: All people are about the same
  Non-homogeneous group
   People who live in neighborhood X tend to be Y."
   Often criticized as stereotypically discriminatory thinking
   However, the approximation by stereotyping allows for a brain simulation that assumes a set of people with different properties.
    This has practical benefits and is useful from a [pragmatist] point of view, so it is the truth!
