Summary of Reaction to Nishio's Duplication of Work Article
Please feel free to ask questions and give me feedback as I would like to help other engineers who want to start duplicating their work.

 [https://twitter.com/nishio/status/923853772798832640 10/27]
  Comment "Get paid exactly what you are paid for your work because other people are in trouble." Response "I got this sentence as a result of emphasizing that money is not my primary goal, but I get paid a surprising amount. I just didn't tell the interviewer the amount."
  Q "Do you give up your company because you have a side business and its profits, or are you a salaried worker who has to give back to the company?" A "I happen to choose to give back, but it's a case-by-case basis, so you can do what you want."
   This has the perspective of whether the benefit/compensation is "cash" or not, and the major difference from independence is that with parallel work, there is no hindrance to life even if the compensation is received in a non-cash form.
   >When you work hard on the side, you become less financially and emotionally dependent on your company, and your company's work begins to turn out well.
    by [joy_nus https://twitter.com/joy_nus/status/922444478954090496]
  Is that the only comment you have observed so far that is question-like? I have received positive feedback from a variety of people and I am grateful for it. Please feel free to ask questions and give me feedback as I would like to help other engineers who are starting a duplicate business.
  They are just honestly implementing Drucker's "post-capitalist society" teachings, running a "non-profit organization," and then practicing the parallel careers suggested by "What Rules Tomorrow". We are just riding on the shoulders of giants.
 10/31
  [The logic of not working for free - 103 http://note103.hatenablog.com/entry/2017/10/31/095002]
  It's an interesting discussion, but it's hard to convey my thoughts in one tweet. I'm talking about the fact that even if "[monetary reward] is zero", the "compensation for work" is still sufficient, which introduces an axis other than money, but that seems to be easily ignored.
   If someone misunderstands something and asks you to do a job without compensation, you can just kick them out with a "What?" If someone misunderstands something and asks you to do a job without compensation, you will just be kicked out. In fact, if you offer cash as a form of compensation, you may be kicked out and asked, "Don't you have anything better than cash? Cash is a very weak capital.
   If you're interested in what's going on around here, you should read Drucker's "Post-Capitalist Society," but I did a quick search and found a not bad summary, so you should just read that for now.
    [3: Wisdom to Survive the Knowledge Society http://www.iot.ac.jp/manu/ueda/interview/j03.html]
  Your point that "even if it's for free, I'll do it" and "it's annoying, so take the money" and "I'm taking it" are mis-buttoned, surely. My first sentence was intended to be "even if I get zero cash reward, I will do it if I get enough non-monetary compensation. I apologize for the misleading wording.
  dumping
   Those who call it "unfair" to work for a low price should first read the JFTC's explanation and understand what the three requirements are. A low price alone does not satisfy the requirements. [Antimonopoly Law Approach to Inappropriate Ingredient Sales: Japan Fair Trade Commission http://www.jftc.go.jp/dk/guideline/unyoukijun/futorenbai.html]
   "If free labor and dumping of IT engineers were a crime, the first to be arrested would be free software authors and OSS contributors." Interesting point of view.
  That's a very good expression, "free work pays off."