Design Thinking Changes the World
[https://gyazo.com/87c26a6da53b4c5bd8c6dc22bb253841]

 [Design Thinking] Will Change the World
 [Tim Brown]
 Change by Design: How Design Thinking Transforms Organizations and Inspires Innovation
  Transformation by Design: How Design Thinking Transforms Organizations and Triggers Innovation
  The Japanese title is missing the nuance of [organizational change], isn't it?
  #Not so much that the Japanese title is odd, but...
 [Amazon http://amzn.to/2lCRDhO]

 A highly predictable process is easily imitated by competitors.
 Design thinking is a process of exploration, a process that proceeds with the expectation of unexpected discoveries.
 [process of searching for unexpected discoveries].

	Three [constraints].
  Technical feasibility constraints
  Constraints to being part of a sustainable business model
  Constraints on what is reasonable and useful to people
 Many companies tend to start with constraints that fit with existing business systems, and new ideas become mundane.
	[It would be mediocre given its compatibility with existing businesses].

 A culture in which it is better to ask permission later rather than ask for it up front, a culture that rewards success and forgives failure, removes a major obstacle to new ideas. p. 47
  [nishio.icon] [don't ask permission if it's a good idea].
 Relaxing the rules doesn't mean allowing people to do stupid things; it means allowing people to play everyone's part."
  [nishio.icon]I see, so it is important that anyone can do it if they feel it is necessary, rather than thinking "this is the work of that department, so it is not something our department should do".
   [It's a way to alleviate [big business disease] and sectionalism.
 The essence of design thinking is the embodiment of thought."
  [nishio.icon]So you don't just discuss in abstract terms and think you know what you're talking about, but you go ahead and make it concrete by building prototypes and gathering facts.
 Today, design is too important to be left to designers, the next generation of designers must be able to hold their own in executive meetings, and the habit of seeing every problem as a design problem."
  [nishio.icon]So in this book, what used to be called management issues are now called design?
 Our real goal is not a faster printer omission. That is the designer's job. The design thinker's job is to help people uncover inner needs that they don't even realize they have."
  [nishio.icon]Does the book distinguish between designers and design thinkers?
 We can't discover surprising facts just by focusing on the center of the bell curve. We need to focus on the people at the end of the bell curve." In designing kitchenware, they first surveyed children and professional chefs, not their main customers.
 Often we can get out of our narrow perspective by observing something similar, rather than the subject itself."
 Empathy is the big difference that separates academic thinking from design thinking.""Our goal is not to test theories. The role of design thinking is to create insights from observations and useful products from insights."
 [nishio.icon]I wrote in my book about how drawing makes abstract concepts more concrete, and IDEO thought the same thing and conducted an experiment in which they asked subjects to draw pictures of money. I will mention it in a footnote.
  p.72
  People who draw 401k pension plans and rental real estate (looking at long-term security).
  People who only write about money and goods (people who only think about short-term "buying things with money").
  I forgot to write [nishio.icon]I forgot to write [Engineer's Intellectual Production: Addendum].
 "analysis and [synthesis]," "organizing and understanding vast amounts of information to create a coherent narrative," and "extracting valuable patterns from raw information." Sounds like a good endorsement for my book, although the language is different.
 The design team will endlessly divergent thinking as long as there is an opportunity. In the meantime, the budget may run out." "Put ideas to the butterfly test with post-its." "Deadlines turn choices into decisions."
 The usefulness of truth theory is also based on this idea: "Design thinking is the ability to do integrated thinking," and "People who can contrast opposing ideas to come up with new solutions have an advantage over those who can only follow one idea when tackling a difficult problem. The person who can relativize rightness has an advantage over the person who can only tolerate one set of rightnesses. [Integrative Thinking].
 We serve people, not chase numbers."
  [nishio.icon]I see, the other day I saw a phase where "chasing numbers" is treated positively, but in this book it is treated negatively. Interesting.
 	[nishio.icon]Profit is only a necessary condition for a company, so it is not a rational thought to chase after more profit once the company is sufficiently profitable, but it requires a drastic change in mental model from when the company was aiming for a profit from a loss, so there are many cases where the company fails to change its mind there. However, it requires a drastic change in mental models from when the company was aiming for a profit from a loss.

 p.95 Tolerance for Risk # Risk Tolerance
  Organizations that encourage experimentation will have projects that do not lead to results
  This kind of approach can be characterized as "[waste]" in a culture that values "productivity" over innovation, or in a company at risk of falling into a "negative spiral of incrementalism.

	p.96
 	The best ideas come when the entire organizational ecosystem, not just designers and engineers, not just management, can afford to experiment!
  It is those who are exposed to ever-changing external factors who are best suited and willing to respond to them
  Ideas should not be judged on the basis of who originated them
  We should support ideas that generate word of mouth.
   There should be live voice support before the organization endorses it.
  Upper management uses their "gardening" skills to nurture, cut down, and incorporate ideas; MBAs call this [risk tolerance], but I call it the "topdown bit."
  Define overarching goals to bring a sense of direction to the organization so innovators do not have to wait for direction

	Culture of [optimism] p. 100
 	Leaders avoid participating in projects with iffy results for fear of losing promotion opportunities
  I have a hunch what management really wants.
  Even when management tries to promote disruptive innovation and freewheeling experimentation, no one is willing to move forward without permission.
  Apple at the time of [Steve Jobs'] return in 1997, with employees divided into more than 15 product lines competing for survival.
  [Steve Jobs] narrowed it down to four products. Optimism was generated from the reassurance that the project would not be destroyed.

	[Brainstorming] p.104
 	Divide 8-10 year olds into boys and girls, 1 hour work, girl team came up with over 200 ideas, boy team had 50.
  Ability to listen to others and develop
  Brainstorming is not the ultimate method of generating ideas. The goal is to develop a wide range of ideas
  The difference between "making choices" and "creating choices."

	[Post-it] p.108
 	Helpful in [convergent] processes
  butterfly test
  	So-called Dot Voting
 Deadlines turn choices into decisions. p. 110