Introduction Peter Drucker - Eight Faces
 Weekly Toyo Keizai 2001.6.9-7.28
 Serialized interview, "Introduction Peter Drucker: Eight Faces"
 [Ueda Atsuo]
 http://www.iot.ac.jp/manu/ueda/interviewJ.html

This is a good summary of Drucker's thinking as a whole, but it is a large book, so I would like to make more condensed reading notes. First of all, I extracted the following.


 The Age of Disconnection (1969), which heralded today's turning point.
 The Invisible Revolution (1976), which signaled the arrival of an aging society.
 Management in Turbulent Times" (1980), which warned of the dangers of bubbles.
 Entrepreneurship and Innovation (1985), a pioneering book on entrepreneurship.
 The New Reality (1989), which predicted the collapse of the Soviet Union.
 Post-Capitalist Society (1993), a lively look at where we are in the transition today.
 What Will Rule Tomorrow" (1999), which informed us that business assumptions and realities have changed.

 The beginning of the management classic, Modern Management (1954)
  >Business managers are dynamic individuals who breathe life into a business. Without their leadership, production resources remain resources and production is not made

 >He seeks both continuity and change. Without continuity, society ceases to be a society, and without change, society cannot develop.

 >Social ecology is about perception and observation, not analysis and theory.
 >It is Drucker's job to see and communicate what the world is like and what situation is imminent.


 >Drucker says there are only two things we can say with certainty about [the future]. First, the future is unknowable, and second, the future is different from the present.
　>Hence, there are also only two ways to know the future. One way is to see the consequences of what has already happened. As for his own predictions, he says that he is only informing us of the consequences of what has already happened, i.e., the future that has already happened.

 Keynes--Economics as a Magic System," published in 1946 (in The Future That Already Happened)
 The Changing World Economy," in Management Frontiers (1986) and The Innovator's Condition (2000).
  Separation of the primary commodity economy from the industrial economy; separation of production and employment in manufacturing; separation of the real economy from the symbolic economy

 The Post-Capitalist Society (1993)
  The tipping point lasts until about 2020.
 The knowledge we need today is knowledge for action, objective, transferable, systematized expertise.
　[The more advanced knowledge becomes, the more specialized it becomes and the less useful it becomes on its own.]
	[Organizations are places where expertise is combined.]
 [in-and-out organization].
 Knowledge has proven to be useful. It became clear that it is knowledge that changes the world and will increasingly do so in the future.
 This means that some knowledge is useful and some is not.
 A suspicion arose that there may be good knowledge and bad knowledge.
 Drucker pointed this out in The Age of Discontinuity (1969)
 He said that management is the knowledge that will be especially needed in the future.
 Management is a way to make highly specialized knowledge effective in collaboration with others.

 How we manage ourselves is now of critical importance. The paradigm shift theory developed by Drucker in "What Will Rule Tomorrow" (1999) confirmed the essence of management as a system and its current status.
 Liberal arts in a knowledge-driven society means having knowledge of computers, foreign languages, and management in addition to reading and writing, advanced knowledge of one's own area of expertise, knowledge of the semantics of other areas of expertise, and knowledge of how to manage oneself.
 How to manage oneself
  In particular, the ability to manage oneself is essential, including how to manage time, how to present one's ideas, how to communicate with others, how to be at the forefront of change, and, in short, how to make one's own contribution.
 The capacity for decision-making and innovation is, for knowledge workers, the very ability to achieve results. Thus, everyone must become a change leader.
 In a society where knowledge is central, a high degree of expertise gained by developing strengths and an understanding of the significance of peripheral knowledge are critical.
  Decision-making must consider the root of the problem, not the individual issues. Identifying whether the problem is general or particular is the first step.
  Entrepreneurship must start small and simple, analyzing opportunities, looking at the outside world, and then aiming for the top.
 　Focus on strengths in human resources.
 Management knowledge is the imperial science for all people today.
  What he wrote as an imperialism for all was his thirty-five year old book, "The Condition of Management" (1966).
 Three management roles
  The first is to fulfill the social functions specific to each organization
   All organizations are allowed to exist, occupy space, and employ and direct people because they contribute to society.
  The second is to enable the people involved in their respective organizations to work actively and productively. As social beings, human beings seek to fully demonstrate their abilities, achieve self-fulfillment, and contribute to society. Especially in the future, people will leave organizations that do not allow them to work actively and productively.
 　Third, solve society's problems using the organization's strengths, without having a negative impact on the world.

 The existence of a profit motive is questionable.
 [* The good thing about a corporation is that there is a necessary condition of profit. In other words, the ability to go bankrupt is inherent. The ability to go bankrupt is the best thing about the system of free enterprise."] #The ability to go bankrupt
  Collapsing is evidence of faulty management.


	non-customer
  Attention to non-customers, those who should be customers but are not, will determine the future of a business. Many industries and companies are declining because they did not pay attention to non-customers. This is because change starts with non-customers.
  Business is the creation of customers

 From now on, he said, almost everything will be considered for outsourcing.
  What are the remaining areas that cannot be outsourced by any means?
  Drucker's answer to this question is marketing.
  Marketing is an essential function of any business.
  Creating customers is called marketing. Marketing is not a generic term for sales activities.
  The value of an organization's existence lies in the world outside the organization.

 We do not know what tomorrow will bring. Because we don't know, we must create our own tomorrow. You must make yourself obsolete. That is ultimately less risky.
  He described his entrepreneurship methodology in Innovation and Entrepreneurship (1985).

 School must become a place to develop what one is good at, not a place to compensate for what one is not good at.

 Truly know your strengths
 　Knowledge workers have a longer life expectancy than the organizations that employ them.
   The extension or prohibition of the retirement age is a social demand.
 　The knowledge worker of the future will outlive the organization to which he or she belongs. They must design their lives on this basis.
 　It is only through strengths that we can accomplish anything. Weaknesses produce nothing. Fortunately, this is where the strangeness of the organization lies. The key to human resources is to utilize the strengths of each individual person in the organization and to make weaknesses meaningless.
 　The same can be said about the way we work. Each person has his or her own way of working. That is individuality.
   Drucker says that, although he does not know why, personality about how to do a job is formed long before one gets the job. Thus, the way we work is as much a given as our strengths. It is given and fixed. It cannot be changed. At least not easily.
 　It is not difficult to discover your strengths and how to do your best work. It may take a few years, but you will know in what areas and in what ways of working that will bring results.
   Drucker recommends feedback analysis, which was adopted by the Catholic Jesuits and Protestant Calvinists in the mid-16th century, as a quick way to do so.
  　When doing something big and coherent, he writes down the expected results in advance and compares them with the actual results months later. This way, he says, he can better understand his strengths and weaknesses, areas and methods in terms of results.
 The problem is when what you consider your strengths and what you consider valuable are different.
  The one that is more valuable must be given priority.
  If it is [nishio.icon], then first of all, what do you think is valuable to you?
  Organizations and companies have their own values. Each individual has his or her own values. In order to achieve results, one's values must fit in with the values of one's work. They do not have to be the same, but they must coexist. Otherwise, we will not be able to enjoy our minds and achieve results.
   They do not feel that they are contributing to the world and do not deserve to devote their life itself, or a part of it.
  As long as you can answer three questions: what are your strengths, what is your work style, and what is valuable to you, the so-called gain will become clear.
 The best work is not something you can plan in your head. It can only be obtained by those who are prepared by knowing their own strengths, work style, and values. Because by knowing where you stand, an ordinary person, hardworking, competent, but not particularly talented, can do top-notch work.
  Drucker says in minute detail in "What Will Rule Tomorrow" (1999)
  You only live once. It would be a waste to pursue something that has no value to you.
  The important thing to know about yourself is whether you work better with tension and anxiety or in a stable environment. Not many people are comfortable with either.
  It is a question of which of the decision makers and their assistants is better able to deliver results. There are people who can confidently make decisions on their own responsibility as long as they have an assistant. On the other hand, there are those who are the number two, but once they are placed in the top position, they can no longer tolerate it. The top position requires people who can make decisions.

 For humans as social beings to be happy, there must be a society that functions as a society at all costs. What are the conditions for this?
  The conditions for a society to be a society are discussed in detail in The Future of the Industrial Man (1942). For a group of people to function as a society, rather than just a crowd, each person in the group must have a position. A group of people without a position is nothing more than a crowd. At the same time, there must be roles. A group of people without roles is nothing more than a crowd.
  In addition to these two conditions, the power that exists must be acceptable. If it is acceptable, it does not matter if it is hereditary or a gift from God. These are the three conditions for a society, and by extension, an organization, to be established as a society. This is Drucker's "General Theory of Society.
 Bourgeois capitalism held that the "invisible hand of God" would bring society to a desirable state if the economy was centered on the pursuit of profit. Conversely, Marxist socialism held that if the means of production were taken out of the hands of the capitalists and the pursuit of profit eliminated, the proletariat would be liberated.
  Both are economy-centered isms, economic supremacy.
  The mass casualties from World War I and the mass unemployment from the Great Depression that followed made such economic supremacy unnecessary.
 　They did not want to live for the economy, die for the economy, fight for the economy, or have a truce for the economy. However, the British and French, who were attached to the democracy they had won with their own hands, were committed to freedom and equality and were hesitant to move toward totalitarianism.
 　On the other hand, countries that had only a given democracy as a byproduct of national unification, namely Germany, Italy, and Japan, could not stand it and turned to fascist totalitarianism. The essence of fascist totalitarianism is not militarism, oppression, or violence. They are incidental. The essence is much deeper. It is "de-" economic supremacy.
  The End of "The Economist" (1939), Theme.

 What makes people happy?
  Drucker found one form of Japanese corporatism.
  Japan, with its salarymen who talk about work even after their working hours are over, is different from the West, where employees are treated as parts.
  The place of work had become a community, providing bonding and stability.
  However, corporatism has gone too far into the cul-de-sac.
  If Japan can achieve an open, in-and-out organization that values people-to-people ties, it can serve as a model for the world. In fact, some Japanese companies are beginning to support those who leave their companies.

  In the United States, NPOs are places of self-realization and bonding. NPOs are places where people can fully demonstrate their abilities, contribute to society, and confirm their bonds with others.
   American NPOs have grown rapidly as a result of learning much from corporate management.
   Today, he said, companies are at a stage where they can learn more from NPOs.
    Motivation of knowledge workers, sense of mission
    Relationship between the Board of Directors (NPO's Board of Directors) and Management (Executive Committee)
  Management of Nonprofit Organizations, 1991.
  Everyone now knows that government cannot save society by itself. According to Drucker, there is one thing governments are not good at. It has to be a doer. It can and must create foundations and rules. But it cannot be a player itself. It is terribly clumsy.
   The NPOs that are [nishio.icon]players must work and let the boards and rules be made.

 Drucker taught that all businesses should start small. In addition, if an unexpected customer arrives, that is a real customer. It is difficult to evaluate anything in advance.

 Our current transition period began around 1965 and will probably continue until around 2020. Moreover, the stable period after 2020 is only a kind of stable period in which "change is the norm" in a knowledge-centered society.
 The only thing he is sure of is that the post-transition period will not be a society of economic supremacy.
　As for the economy, it is changing from a capital-centered era to a knowledge-centered era.

 Productivity is no longer important for simple physical labor. The problem of the productivity of physical labor has been solved by the Productivity Revolution after Taylor. The problem from now on is the productivity of physical labor, which is backed by knowledge. The source of a country's economy and the source of each individual's motivation to work and live is now knowledge labor. The productivity of knowledge labor is the greatest challenge.
  The first principle of improving productivity in knowledge work is not to do work that does not contribute to outcomes.
   [nishio.icon] [YAGNI] [incompetent worker].
  Knowledge work is significantly more productive when it is linked to self-actualization.

 One serious problem remains here. These are the people who will be left behind in the trend toward a knowledge society. Not everyone can become a knowledge worker. The question of their dignity, purpose in life, and social positioning remains.
  The solution to this problem is based on nothing other than dramatically increasing the productivity of simple physical labor and simple service labor, and sharpening their contribution and job satisfaction.
  Economists do not address the issue of job satisfaction for manual laborers. But for Drucker, the manual laborers who are left behind are also a serious concern. He addresses them head-on as a counter-culture issue. Because they are irreplaceable human beings, and a society with those who are left behind cannot be said to be functioning as a society.
   [nishio.icon]This "knowledge worker" and "manual laborer" are representative of Drucker's misleading terminology: [knowledge worker].

 Drucker's management science has been born and nurtured through the work of consultants as internalized outsiders.

 There is no single right answer.
 Everything must be subject to constant review.