Bodoge Camp Report
Excerpts from the Cybozu Board Game Camp participation report that may be published

 Coyote." This is a game in which you try to figure out the sum of everyone's numbers in a situation in which you cannot see the numbers of the cards you are holding, but can see the numbers of the others. The game is played in such a way that players try to figure out what their numbers are based on the behavior of others, since others can see what they cannot. When you deny what the person immediately preceding you said, you say, "Coyote!" but judging from the information I can see, I assume "of course this is about the value" and confidently say "Coyote! but the person in front of me was not wrong because I had a rare card! But the person in front of me was not wrong because I had a rare card! Of course, everyone knew that I had a rare card except me. It was a game that taught me that there are things that I cannot see, so I can make mistakes if I judge only by the information I can see.
 The "Fake Artist Goes to New York" game is a game in which everyone works together to complete a painting. The theme of the painting is told to everyone in advance. However, there is one person who has not been told, and he is called a "fake artist. It is terrible to call someone a fake artist when the information is not shared. However, according to the rules of this game, you lose if you are revealed to be a fake artist, so you cannot say, "I didn't share the information! You can't say, "I didn't share information with anyone! Therefore, you have to pretend that you are sharing the information and cooperate with everyone else to paint the picture. The fake artist wins if he or she is not revealed to be a fake artist, or if he or she can answer the theme even if he or she is revealed to be a fake artist. The other players must not let the Écée discover the theme, so they dare to harass the Écée into drawing an ambiguous picture. The aim is to reveal who is the fake by making the fake misunderstand the theme. However, if the artist continues to draw ambiguous pictures while harassing others, others will suspect that the artist is actually a fake and that he/she is drawing pictures that can be taken any way he/she wants because he/she does not know the theme. In this game, you are supposed to appeal to your colleagues that you know the theme and are not a fake, while at the same time acting so that the fake does not find out your theme.
  When an organization is in this state, it is in trouble. Conversely, board games are effective as a safe way to experience "what kind of a bad situation an organization is in. If a situation arises where you have to experience a bad situation in an actual organization, there is no way to recover from it. By experiencing it as a game, you will learn that information sharing is important, and that when information is not shared, it is important not to pretend to understand, but to show that "information is not being shared! And in order to maintain such a state, it is important not to make it a game like this, where you lose if it is discovered that information has not been shared.
 [Avalon]" is a game in which players try their best to somehow make a project succeed while several bad guys are mixed up among the players who are trying to make the project fail. The bad guys know each other and their friends. The rotating leader chooses the members of the project execution team from among the players, but he must be careful to choose good people, because if he chooses bad people, the project could fail. So everyone consults with each other about who would be a bad person, but of course there are several bad people mixed in with that "everyone," so they behave in a way that makes the good people look bad. This is another bad organization.
  Suppose a good person expresses his or her opinion, to which another good person questions and refutes it. Inadvertently, those two good people start a mud fight with each other, thinking that the other must be a bad person. The really bad person watches the good people squash each other with a smirk on his/her face, and sometimes adds fuel to the fire.
 BobJiten" is a game in which you explain a katakana word without using any katakana words, and the people listening around you try to guess it. The person who plays the role of explaining tries his/her best to express what he/she wants to say in the limited number of words. The people around them listen patiently to the explanation that does not get the point across and try their best to understand what is being expressed. Mr. Uchida says that it would be interesting to come up with a subject from Bowspedia, but first, everyone should try to explain "groupware" without using katakana words. In this game, respondents can only answer once, and the first one to answer wins. So, if the order of explanation is not appropriate, for example, if you try to explain "vanilla" and you say, "It is a white, sweet and cold confectionery...", the respondent may say, "Ice cream! Ice cream! This game makes you think about the order of explanation and what you should say first to avoid misunderstandings. It was a game that both the communicator and the listener could practice their communication skills.
 Geister" is a two-player board game, played with four "good ghosts" and four "bad ghosts" each. You win by defeating all of your opponent's good ghosts. Since you don't know which of your opponent's ghosts is the good ghost, the game is about trying to guess their intentions by carefully observing their behavior and trying to perceive information that you cannot see. Since this is a two-player game, it was not very popular at this camp.
