Misunderstanding Slack's threading feature and notification coverage
	Some people are not sure about the threading feature in [Slack] and others find it very useful.
 When I talked to him, I thought it had to do with "[mental models] about notification."

	Thread Function
  When a thread is started, only the original poster of the post is notified.
  Communicate with a large number of people in a channel without sending notifications to all of them
  Threads that include you will be notified in a proper thread-by-thread format.
  In other words, "start a thread" means
   for that particular topic.
   with the same access rights as that channel.
   Without sending out notifications to everyone.
   Ability to create [disposable] channels for [unnamed].

	Start Thread" is a very different concept, similar in appearance to "[reply]" on a tree-type bulletin board.
 If everyone understands this, it can be beneficially utilized.
  Threads that have not been notified to me can be interpreted as the thread creator deciding that "you [may] read, but you don't have to".
 What happens when someone does not understand
  You don't understand that notifications don't fly and you write in the thread that everyone needs to see it.
   Not being seen causes some problems.
   Other-blame that people didn't see it/self-blame that I didn't see it happens.
   	The bad guy is "the person who used the system without understanding that it is a mechanism to avoid skipping notifications.
  I try to read the threads that haven't been notified to me carefully.
   It's a hassle because it takes a lot of effort to read, so the "thread function is not user friendly".
   This tends to happen when the above "people who write things in threads that need to be seen" claim that it's the fault of those who don't see them, or when those who miss them blame themselves.
   If the thread creator properly understands how it works, he'll take the trouble to read the "information the creator thinks he doesn't need to read".

	The "mental model of notifications" issue is that [Facebook] does not always notify you when you receive a message, and Facebook's "news feed" is "highlighted" by default, unlike Twitter's timeline, so you are not notified of all of your friends' activities. This is not always the case.

	In terms of misunderstanding the scope of notification, "everyone mentions" in [kintone] is not "everyone who is a member of the group" but "everyone who has the authority to see the statement", This is one of the examples.