Technologist Requirements
[https://gyazo.com/dbc088100c023ca8b70d2a8f82caa297]
 [Drucker].
 [Amazon https://amzn.to/2pE9J1N]
	[2010-02] Purchase

 Programming in Logic
  What is needed today are those who continue to acquire skills backed by knowledge. There is a myriad need for those who can use theory as the basis for their skills. They are not so much technicians as technologists. It is the brightest of our youth who should have the ability to be technologists, using skills backed by knowledge.
  Technologists do not like to manage. Rather, they prefer to work in their own world of technology and science. They also do not like to manage other people's work. Nor are they good at it. As a result, non-technologists often manage technologists.
  The special characteristic of modernity is the deliberate and systematic implementation of technological revolutions. The social institution that does this is the modern corporation.
  How to systematize the unknown. The modern worldview is that of Descartes. The whole is defined by its parts.
  [Systematization of the unknown], the methodology to leap into the unknown, is exemplified by Mendeleev's discovery of the periodic table. He did not systematize the known. He considered what unknowns must be assumed in order to bring order to the known elements.
  The development of childhood vaccines was another innovation based on the systematization of the unknown.
   Which one?

  Change used to mean catastrophe.
  Change in innovation is purposeful and oriented activity. It differs from both pre-modernity, which fears change, and modernity, which sees change as inevitable progress. These two views made change something that was beyond the control of human beings.
  Order is dynamic change itself.
  Karl Marx was the first economist to see the role of industrialists as innovators, but admitting this would destroy the concept of inevitable progress.
   You mean "Based on Marx's view of history, he predicted that in a mature capitalist society, the lower structure contains various contradictions and alienations, and that these contradictions and alienations will inevitably lead to a social revolution that will push forward drastic changes in the upper structure."

  Innovation is not a substitute for the flutter of genius. Nor does it render unnecessary the systematic work of application and refinement of what is known. It multiplies these forces.
  Fleming's floundering led to the discovery of penicillin's bactericidal power. Waxman's systematization of the unknown led to innovations in our understanding of biological phenomena and antibiotic therapy. It took ten years. But after that innovation, the systematic discovery of antibiotics and the theoretical elucidation of their efficacy and side effects became possible.
  Selman Waksman - Wikipedia "Waksman's team discovered several antibiotics, including actinomycin, clavacin, streptothricin, streptomycin, grisein, neomycin, fradicin, candicidin, candidin, and others. neomycin, fradicin, candicidin, candidin, and others."

   According to Isaac Asimov's chronology of science and discovery, Fleming discovered penicillin by the famous method in 1928, the active ingredient was isolated by Flory and Chane in 1939 after 11 years of neglect (the three were awarded the Nobel Prize in Physiology or Medicine in 1945), and tyrothricin was discovered by Dupos in the same year. In the same year, Dupos discovered tyrothricin through his research that bacteria might be making something similar, and in 1940, Waxman discovered actinomycin and streptomycin using this method on a large scale, This seems to be the trend.

　Technologists tend to assume that mechanical artifacts are tools. That is too narrow a definition. Language and other abstract concepts are also tools. p.21
 [abstract concepts as well as mechanical artifacts are tools].
 (In the past) science was a branch of philosophy and its purpose was the perfection of knowledge. To use it was, as Plato famously claimed, an abuse of science and the downfall of science. Technology, on the other hand, was focused on utilization. The goal was to improve human capabilities. P.46
 (1720) In the era of the South Seabubble case, patents were attacked as monopolies. In 1769, when Watt obtained his patent, it was recognized as a means of promoting technological progress. p. 47
  [Nankai bubble incident - Wikipedia https://ja.wikipedia.org/wiki/%E5%8D%97%E6%B5%B7%E6%B3%A1%E6%B2%AB%E4%BA%8B%E4%BB%B6]
 Around 1780: Establishment of the first agricultural college
 1751: Encyclopedia
 1841: Invention of chemical fertilizer by Justus von Liebig
 First mining college established in 1776. One reason was the growing need for technical training of field foremen due to the increased use of steam engines. p. 49
  The lesson should not be forgotten. What was then called medicine had already become a respected entity, only medicine did not undergo such a transformation in the 18th century. P.50
 In 1840, Ignaz Semmelweis was exiled after discovering that traditional medical methods were the cause of obstetric fever p. 51
 Everyone thinks that nothing has progressed as fast and had as great an impact as the IT Revolution. But the former industrial revolution was equally fast and had a great impact p. 56
 (According to Paul Johnson) what brought about the resurgence of slavery was the textile industry with the steam engine in hand. The explosion in demand for low-cost labor made slave breeding the most profitable industry p.57
 Invention of the railroad in 1829
 Competition can no longer be local; all companies must go global; there can be no local presence in the age of e-commerce. Where to sell and how to sell may be important now, but in 20 years, they will be meaningless. p.61
 No one in 1520 predicted the eventual emergence of the secular book; no one in 1820 predicted the advent of the telegraph, photography, or sanitation.