Summary of translating virtual as virtual
IBM Japan was the first to translate "virtual" as virtual" is False, and "IBM applied virtual memory as a translation of "virtual memory" is True.

 In [Japan, where software is made by others, the U.S., where software is made by oneself http://amzn.to/2zAONjl], a person who was a systems engineer at IBM Japan said, "We are responsible for mistranslating 'virtual' as 'virtual.
  When IBM USA announced virtual memory, IBM Japan applied the translation "virtual memory" in 1970.
 However, "IBM Japan was the first to translate virtual as virtual" is False.
  The 1958 edition of the Dictionary of Mechanical Engineering uses "virtual work" as a translation of "virtual work" and "virtual displacement" as a translation of "virtual displacement.
  The description of "hypothetical change" is found in the "Mechanics of Mass and Rigid Bodies" published in 1918.
  The word "kaso" itself is already around in 1880.
   [https://gyazo.com/9daf44f55f6130a58485db56dde5a9e0]
  summary
   The word "virtual" is not newly coined, it was there originally.
   Used for over 50 years as a translation of virtual

	I'm sure there are cases where virtual memory was translated as virtual memory before IBM.
 	There is a May 1966 MIT Multics article that calls it "virtual memory" and doesn't translate "virtual" [Information processing http://id.nii.ac.jp/1001/00008791/] (thanks yukoba)

 Regarding the interpretation of "a mistranslation of the word "virtual" which means "substantial" as "virtual.
  In 1938, there is an explanation that virtual is a translation of annameme. This is a German word meaning hypothesis.
   [https://gyazo.com/bef0e0a3585680b28af234f3de7e5313]
  In virtual displacement, "a hypothetical slight displacement" is called virtual displacement in the sense of "if something that is suspended were to move a little~", so it does not seem bad to translate this as "virtual".
  When translating "virtual memory," I researched what "virtual" meant in Japanese, and came across the term "virtual displacement" which had already been in use for about 50 years, and chose that as the translation.
  I have not been able to find any documentation on whether the people who coined the term "virtual memory" in the English-speaking world at the time considered it "virtual memory" or "real memory".
  Fleming (1849-1945) said "A thing has a virtual existence when it has all the conditions necessary for its actual existence.
   How should I translate this?
   Virtual" if you take the view that "it doesn't actually exist, but it exists virtually."
   "substantial" if you take the view that "it doesn't actually exist, but it does in effect."
  The usage "virtual displacement" is used as early as 1826; the term virtual velocity was also used in 1813.
   1826
    [https://gyazo.com/45f37aee613b9de6657047cdd776a4d0]
    The word "instantaneous" is used in both of these occurrences, but it was introduced provisionally in the calculations because instantaneous movement is not possible in reality.
    I'm curious as to why the person who coined the term "virtual displacement" chose the word "virtual.

summary
 Not bad for someone who guessed "virtual displacement" as a translation of "virtual displacement."
 It's bad enough that I thought "virtual = virtual" from the example of virtual displacement, but it's hard to blame them given that it's a translation that has been used for nearly 50 years.