game mechanics
[https://gyazo.com/9cdc21dda73ae8706cc4d068dc9e12ac]
 Game Mechanics Game Design for Interest
 [Amazon http://amzn.to/2zEjwfg]
 Explanatory slides https://www.slideshare.net/minahito/machination

	A book that considers games from the perspective of internal [economic] design.
  It's helpful to think about [management games].
 Using [makination] as a simulation tool
 In-game economy [design patterns].
 	Good design pattern library in Appendix B.
   You can download it from the support page.
  engine
  	Static engine that generates constant resources
    A hunter-gatherer lifestyle, so to speak.
   Dynamic engines that can increase production through investment
    Industries that increase production through investment.
   converter engine
				Main structure of the game "[Electric Power Company]".
    There is a mutual converter between fuel and funds.
   Engine Building
   　Games aimed at building engines
  friction
  	Static friction: Absorbs resources
   Dynamic friction: depends on the amount of other elements in the game to siphon off resources
			Stopping: utility is reduced each time a resource is used, aka [diminishing harvest].
   Consumption: Allowing other players to actively steal or destroy other players' resources.
  escalation
   Escalation of challenge: the closer you get to the goal, the more difficult the progression.
    Increase the frequency of events, reduce the success rate, etc.
			Complexity escalation: complexity spikes when users lose control
   	Example: Tetris
    	Remains clean as long as it is well controlled.
    	The more they pile up, the less "thinking time" and the more difficult it becomes.
					The increase in fall speed with each level is also an "escalation of challenge"
   armaments race
   	AoE, etc.
    Resources can be invested in military power.
    Use of military force can cause "attrition".
    They can invest in defense facilities.
    Can introduce strategic choices into the game
		Other
  	Multiple feedback
   	Multiple feedback loops provide short-term predictability and long-term unpredictability
    Example: City simulation systems such as SimCity
     My personal experience is that when I was happy to do more and more things to increase land prices by putting parks, etc., because it leads to the satisfaction of the residents in the immediate area, the increased land prices made some people unable to live in their houses, and although there is enough housing for the population, a large number of homeless people live in vacant lots, and air pollution (bad odor?) is spreading around the area. ?) air pollution (bad smell?) in the surrounding area, and the satisfaction level of the surrounding residents decreased.
   trade
   	Exchange of resources between players
   Worker assignment
   	Sometimes called worker placement, a common pattern in board games
    Do this by deploying a limited number of resources (workers) for which of multiple mechanisms to choose to operate.
    AoE-like games tend to be tedious micromanagement, because it takes real time to move workers around.
    [Agricola], for example, does not eat up real time because it is repositioned on your turn.
    When selectable mechanisms are shared by multiple players, the early bird gets the worm, so there is a strategic element of what to place multiple workers on first
   slow-cycle
   	Things that change in long cycles that affect the state of the in-game economy
    The ability to foresee shifts in the state of the in-game economy and prepare for them is tested.


Additional materials available for download from [support page http://www.sbcr.jp/support/11087.html