Expanded reproduction in social capital
	[expanded reproduction] with ordinary capital (money).
  Doing business and making money = getting money.
  Invest that money in expanding your business.
  More money available.
 Image of investing in factory machinery

 Expansion and reproduction in [knowledge capital].
  Doing business and making money = getting money.
  Invest that money in knowledge acquisition.
  Based on that knowledge, you get a lot more knowledge.
  You get more money for your knowledge.

	Expansion and reproduction in [social capital
  Doing business and making money = getting money.
  Invest that money in social capital (internal and external contacts, good corporate culture, etc.)
  Based on that social capital, more social capital and knowledge is available.
  More money is available through social capital and knowledge.

What is [human networking], a type of social capital?
	It's not "I know."
  I know about Mr. XXX - so what is it?"
 Rather, it is "known."
 	And of course, "known in a good way."
   It could be read as "I have confidence in you."
  You can influence their behavior."
   Specifically, for example, they can accept "Would you like to have a lunch meeting?
    Holding a busy manager for an hour is a pretty high hurdle.
   It's not the same as moving them under orders based on their employment.
    It's influencing their behavior in exchange for a "paycheck".
    Management of relationships with people who are generally not in a hierarchical or employment relationship.

Communities where appeal to know is valuable.
	I observed a case in which a person was sitting at another table in a café and asked the waitress, "What are these beans?" and received an answer that he did not understand. and when the answer came back that she didn't understand, she appealed that she knew someone from that place.
  On behalf of your sister, I said in my mind, "What would you say then?" I said to her in my mind, "Then what are you saying?
 Coffee and other knowledge changes, so you have to pay the "cost of continuing to learn" to maintain value.
 On the other hand, "I know someone" does not disappear once a relationship is established, and the apparent value of the relationship improves through promotion, etc. due to the efforts of the other party, even without one's own efforts.
 In a community that values the appeal of "I know who you are", it would be reasonable to invest in that area.

 Appeal to acquaintance is inherently valuable because there are more than a few people who appreciate it.
  It's not the "people who are making an acquaintance appeal" who are making a mistake, but the "people who appreciate acquaintance appeals."
  If you make an appeal to someone you know, but you don't go at them, it's a sign that you realize you don't really have that much of a relationship with them.
   It's not a mistake, it's intentional.
  What people think is valuable has value #Social Proof Principle

Interesting perspective on the growth of social capital.
	Financial capital does not grow on its own.
 Financial capital grows in ways such as owning equity in a growing business
 Knowledge capital does not grow on its own.
 Knowledge capital grows by exchanging it with people who have a lot of different knowledge capital from you.
	Social capital grows on its own.
 Because we are essentially growing "human beings".

[facebook https://www.facebook.com/nishiohirokazu/posts/10213753568369978?pnref=story]