Intellectual Property Technician Level 1 28th Q8
Intellectual Property Management Technician Level 1 Patent Professional Services 28th Q8

Prerequisite Knowledge
 Mortgages: Patents cannot be mortgaged because they are movable property (unlike real estate).
 	>Only real estate and certain movable property and foundations may be its object, and not general property.
  Article 369(1) of the Civil Code
	Pledge: When a pledge is created, the right of possession must be transferred to the pledgee. If a pledge is created on a patent, the pledgee cannot continue to use the patent.
  >Like a mortgage, it is a contractual security interest and shares the same purpose as a hypothec, but differs from a mortgage in that it requires the transfer of possession.
  Civil Code 342
  The patent right is a movable property that can be possessed, so it is the subject of a pledge.
   Registration in the patent register is a requirement for entry into force (Patent Law 98)
	mortgage
  >Transfer of security can be used to create a mortgage-like security over movable property by transferring title to the security interest holder while the security interest holder leases the subject matter of the security to the security settlor.
		Example
   Borrow money by pledging equipment used in the factory as collateral.
		There is a difficult debate as to which article a transfer security is based on. (i.e., transferring ownership, loaning, etc.).
  Widely used for various objects
   >The creation of a security interest is based on a contract for creation of a security interest (which transfers ownership of the subject matter to the creditor, and the debtor leases the subject matter). The subject matter of a security over transfer can be movable property such as tools and machinery, real estate such as land and buildings, securities such as bills and checks, patent rights, golf club memberships, telephone subscription rights, and so on.

Check the problem statement
	A: A patent application cannot be the subject of a transferable security → A patent application is negotiable and may be used as a transferable security → X
	b: Patent application can be the object of a mortgage → x
 c: If a patent right is acquired, it can be the object of a pledge → Patent rights are movable property that can be possessed, so they are subject to a pledge.
 D: A provisional non-exclusive license cannot be granted unless the application is published → Correct answer is X
  Even if the application is not published, it is possible to obtain a provisional non-exclusive license by showing the application to the other party and negotiating with them.
  It is the right to compensation that requires publication of the application
   The right to claim compensation is a right that allows the applicant to demand an amount equivalent to the license fee from the time of warning to the registration of the establishment of the patent right from the time of warning to the time of registration of the establishment of the patent right, on condition that the applicant warns any person who has worked the invention related to the application as a business after the application is published and before the registration of the establishment of the patent right (Patent Law, Article 65).

So the correct answer is c.