AI will not take jobs.
2017-11-20
[AI] is not taking jobs. [It's about people with high affinity for technology taking the jobs of people with low affinity for technology.

Many people have an image of AI as an entity that actively takes away human jobs. [Before AI can operate with free will, it will first be used by humans, and those who cannot use AI will be destroyed by those who can use AI.

Technological advances have indeed made some jobs obsolete. Automatic knitting machines, for example, have taken the jobs of hand knitters. This is precisely what happened: the capitalists who could afford to buy automatic knitting machines took the jobs of hand knitters. The destruction of machines in the [Luddite movement https://ja.wikipedia.org/wiki/%E3%83%A9%E3%83%83%E3%83%80%E3%82%A4%E3%83%88%E9%81%8B%E5%8B%95] did not stop social change. This is because the agents of change were not the technology and machines, but the people who used them.

There are three broad changes that are taking place commercially right now.
	The development of optimization methods such as AdaGrad has made it possible to train neural nets with many layers. Combined with such innovations as saving parameters by convolution, the accuracy of [image recognition] has increased dramatically through the learning of neural nets. This has made it possible to mechanize fields that until now have not been mechanized for the reason that "human beings have to make judgments by seeing with their eyes.
  The entities that want to push for this are employers who are currently hiring people on a large scale for the purpose of "eyes" and whose productivity will increase once they have "eyes" that do not get tired and do not make mistakes. The ones who will be eliminated are those who were only contributing as "eyes".
 The accuracy of natural language processing through statistics has increased on the back of large corpora. Combined with the above-mentioned advances in deep learning, the accuracy of [machine translation] is increasing. This means that machine translation is becoming more and more common to meet the need for a rough translation that does not need to be perfect.
  The entities that will push for this are companies with offices in multiple regions with different languages that will benefit from the elimination of language barriers. What will be eliminated will be translators who can only translate general texts without a high level of expertise or quality.
 Advances in technologies for bidirectional video and voice communication via the Internet, including WebRTC, as well as information sharing and task management technologies via the Internet, have lowered the cost of [remote work] and [parallel work]. This has led to a flourishing of collaboration among people and organizations that were previously unable to collaborate due to the physical distance between their locations.
  The entities that want to promote this are organizations that want to collaborate with a variety of specialists. What will be eliminated by this is the "person who is not so highly skilled that he/she has little value in the market, but is highly valued within the company because he/she is the most knowledgeable" who has been protected by the barrier of physical distance.
