Intellectual Property Technician Level 1 28 Q18
Prerequisite Knowledge
	decision of rejection
  >Article 49 Where a patent application falls under any of the following items, the examiner shall render a decision to the effect that the patent application is to be refused
   (i) where an amendment made to the description, claims or drawings attached to the application for the patent does not comply with the requirements provided in Article 17-2(3) or (4)
   (ii) where the invention to which the patent application pertains is not patentable under Article 25, 29, 29-2, 32, 38 or 39(1) to (4).
   (iii) where the invention to which the patent application relates is not patentable under the provisions of the Treaty.
   (iv) where the patent application does not comply with the requirements under Article 36(4)(i) or (vi) or Article 37.
   (v) where the notice under the preceding Article has been given and the patent application still fails to comply with the requirements provided in Article 36(4)(ii) even after amendment of the description or submission of a written opinion.
   (vi) where the patent application is a written application in a foreign language and the matters stated in the description, claims or drawings attached to the application for the said patent application are not within the scope of the matters stated in the foreign language document
   (vii) where the applicant for the patent is not entitled to obtain a patent for the invention.

	Shift Compensation
 	Article 17-2, paragraph 4.
  >(2) Where an amendment is made to the claims in any of the cases listed in the items of paragraph (1) of this Article, the invention for which a determination as to whether or not the invention is unpatentable is indicated in the notice of reasons for refusal received prior to the amendment and the invention specified by the matters recited in the amended claims shall be deemed to be a group of inventions that satisfy the unity of invention requirement of Article 37 (excluding the invention specified in the amended claims). (2) The invention specified in the amended claims shall be made to fall within a group of inventions that satisfy the unity of invention requirement of Article 37 (hereinafter referred to as the "unity of invention requirement").

based on this
	In the notice of reasons for refusal, it was determined that the patent was not granted for claims 1 and 3, and that there was no problem with claims 2 and 4.
 	A: Since unity of invention is not a reason for rejection, the requirement of unity of invention can be satisfied even if 1 and 3 are deleted.
   →？
   The requirements for unity must be satisfied by the claims 1 and 3, which are determined to be unpatentable, and the amended claims. It is irrelevant whether "1, 2, 3, 4" before the amendment satisfied unity or not; since claims 1 and 3 were deleted, they probably do not satisfy unity. I would think so, but judging from the answers, it seems to be a circle.
		c: If amendments are made for each of 1 and 3, the decision of refusal will not be made without a new notice of reasons for refusal.
   →×
    If it is True, the review period can be extended as long as you want.
    >(v) where the notice under the preceding Article has been given and the patent application still fails to comply with the requirements provided in Article 36(4)(ii) even after amendment of the description or submission of a written opinion.
    You corrected it, but it didn't work, and they rejected it.
