Intellectual Property Technician Level 1 28 Q20
Prerequisite Knowledge
 Antitrust Law] Guidelines on the Use of Intellectual Property
  http://www.jftc.go.jp/dk/guideline/unyoukijun/chitekizaisan.html
  >4th Perspective on Unfair Trade Practices
  Quantity Limit
  	>A restriction by a licensor to a licensee on the minimum quantity of products to be manufactured using the technology or the minimum number of times the technology is to be used does not, in principle, constitute an unfair trade practice as long as it does not exclude the use of other technologies.
   >On the other hand, setting an upper limit on the quantity manufactured or the number of times a product can be used is not considered an exercise of a right if it has the effect of restricting the supply in the market as a whole, and falls under unfair trade practices if it has the effect of impeding fair competition (paragraph 12 of the general designation).
		exclusive license
  	>The act of a licensor imposing on a licensee the obligation to attribute the rights of an improved technology developed by the licensee to the licensor or a business entity designated by the licensor, or the obligation to grant an exclusive license (Note 19) to the licensor, strengthens the licensor's position in the technology or product market and undermines the licensee's motivation for research and development by denying the licensee access to the improved technology. In addition, it undermines the licensee's motivation for research and development by denying the licensee access to the improved technology, and there is usually no rational reason for imposing such restrictions.
  duty not to contest
  　>The act of a licensor imposing on a licensee the obligation not to dispute the validity of the rights pertaining to the licensed technology (Note 14) is recognized as contributing to the promotion of competition through smooth technology transactions, and is not directly likely to reduce competition.
  　>However, since the right to be invalidated continues to exist and the use of the technology pertaining to such right is restricted, it may fall under the category of unfair trade practices as having the potential to impede fair competition (paragraph 12 of the general designation).
  　>In addition, a provision to the effect that the license agreement on the technology covered by the rights will be terminated if the licensee disputes the validity of the rights does not, in principle, constitute an unfair trade practice.
		duty not to enter into a dispute
 	　>The act of a licensor imposing on a licensee an obligation (Note 17) not to exercise against the licensor or a business entity designated by the licensor all or some of the rights that the licensee may own or acquire, shall strengthen the licensor's dominant position in the technology market or product market. (Note 17), or by restricting the licensee's exercise of rights, thereby undermining the licensee's motivation for research and development and inhibiting the development of new technologies, constitutes an unfair method of trade (General Designation, Paragraph 12).
  　>However, if, from a substantive standpoint, the licensee is merely obligated to grant a non-exclusive license to the licensor for the improved technology developed by the licensee, as with the non-exclusive licensing obligation for the improved technology described in (9) below, in principle, this does not constitute an unfair trade practice.

Read the problem statement with this in mind
 a: Although the minimum and maximum quantities are specified, they do not preclude the use of other technologies, and therefore, in principle, are not an unfair method of trading.
 	→× True for the minimum quantity rule, but the maximum quantity rule is NG as follows
  	>If it has the effect of restricting the supply of the entire market, it is not considered to be an exercise of a right, and if it has the effect of impeding fair competition, it constitutes an unfair trade practice.
 C: × Imposing a duty not to compete is unlikely to directly reduce competition.
	D: x Imposing a duty of non-contention constitutes an unfair trade practice if it is an impediment to fair competition.
	B: →× Exclusive license, so in principle it is NG... or so I thought.
		The "However, the implementation of said invention by the Second Party shall not be restricted in any way" in the contract is a crook.
  The reason why exclusive licenses are in principle NG:.
  	>As a general rule, it is an unfair trade practice because it strengthens the licensor's position in the technology market or product market and undermines the licensee's motivation for research and development by denying the licensee access to improved technology, and there is usually no reasonable reason to impose such a restriction. Therefore, in principle, it falls under the category of unfair trade practices.
  This "undermines the licensee's incentive for research and development by not allowing the licensee to use the improved technology" is avoided.
  Nevertheless, the problem statement only mentions Y's business activities and R&D motivation and does not discuss the effect of "strengthening the licensor's position in the market.
  I wonder if it is even possible to say that "in principle, it does not constitute an unfair trade practice" as stated in the options.
  Well, since the rest of the options are so inappropriate, in terms of choosing the most appropriate one, I guess I'll choose this one...
