Let's Play Innovation
 Management game] on the theme of new business development.
 2-3 players, 10-20 minutes play time
  relatively light (esp. in chemistry)

	32 activity cards of 4 colors x 8 cards
  It has two different victory points written on it, one for failure and one for success.
 10 Try & Error cards
  Cards that simply increase victory points
 12 event cards
  Cards that perturb the field

	You have an initial hand of 4 cards, draw 1 card per turn, and get 1 card out. If you can't get them out, you lose immediately (which almost never happens).
 The game ends when the deck runs out and the next draw is made. The highest winner is the winner after calculating the victory point.
 Each time a card of any of the four colors is played, that color is replaced by a success and a failure. The first time you play a card, it starts with a failure. So, if you don't have an even number of cards at the end of the game, you won't win (to be exact, there is an event card that reverses all of them, so if you get that, it's an odd number).
 Some cards are removed from the game at the beginning of the game, so even if you count them, you can't know exactly how many cards are left.
 Scores are doubled when all four colors are in a successful state.
 For each color, only the player with the highest score gets a point, the rest get 0 points
 Sometimes I don't want to put it out there because it alternates between success and failure, but it must be done.
 There are cards that increase the number of cards in your hand. More cards in hand means more options.

finding
	As for the game design, I get the sense that it could be interesting once the rules are mastered.
 The explanation of the rules is terrible.
  The rules for increasing scores on try-and-error cards are not clearly stated. From the pictures, it seems natural to interpret "+1 point for the first card, +2 points for the second card, +3 points for the third card, and +3 points thereafter," but some pictures have only one +2 point, which makes no sense.
   Unclear whether "the score keeps going up after flipping" means "+1 stays +1 after flipping, no negative points" or "+1 becomes +2 after flipping". I would assume the former...
  'To do ~, you have to play ~ or ~ and then you can turn them over top and bottom.' Cards are always turned over when stacked."
   Either "can be turned over" or "must be turned over."
   Do you distinguish between "put out" and "layering" or not?
   Perhaps "put out = stack" and "must be turned over"...
 The quality of the product is terrible.
  The paper on which the rules were printed is fringed with color copying mistakes, but you keep noticing the mistakes and adding them by hand with a pen. All you have to do is reduce the size and re-copy it.... Or perhaps a better printing method should be used....
  Lettering in white on light blue or yellow. Unreadable.
   It is flavor text that does not need to be read in the first place.
  To begin with, everything is flavor except the color of the card, the number in the corner, and the description of some cards with special effects.
  Varying font sizes for card edge values
  It was sold at the venue with a special game market price of 5,000 yen for what is normally 10,000 yen, but the rulebook inside says 2,800 yen (smiles).
