Thomas Davenport.

I've reviewed Thomas Davenport's "[Companies that use analytic power as a weapon]" and "[Companies that use analytic power] The Five Stages of Development" and I've written my reading notes. #analytic power #data analysis

Utilize your analytical skills
Can we base our analytical skills on strategic advantage?

The ultimate goal of analysis is good decision-making
Enables fact-based decision making

 It is not a matter of installing software to solve the problem. Data analysis is for good decision making, and at present, decision making is done by humans.
 Automation of decision-making" is likely to generate opposition because it deprives the people who are currently making decisions of the opportunity to make decisions.
 A form of support to facilitate human decision making, with humans referring to the results of the software's analysis,
 From providing information, semi-automation, handling exceptional cases separately, alerts for hazardous values, etc. The organization needs to be programmed so that humans voluntarily rely on the software.

It is better to focus on one target of analysis. Do not distribute the power.

 Do not use tools or techniques that you cannot explain.
 For most people, algorithms are gibberish.
 If I can't explain how it works, it seems fishy.

analyst
What specific personnel are needed?
People who can create new mathematical models.
People with knowledge of the business
A person who can communicate with the field of execution.
Ability to share information and educate other analysts.

The distant ideal is not to be closed to a specific department.
If it does not become a company-wide initiative, it will not lead to competitiveness.
On the other hand, feasible and concrete actions to realize distant ideals,
First, we will obtain interest and resources by producing results in something that is easy to achieve.

Whether a culture that emphasizes data in decision-making will take root.

Look not only at the average, but also at the range of fluctuation. To be able to notice the hazardous value.