kintone x e-book
The point where the lucky one was struck is expressed in [* bold

	Assume a situation where you have a lot of cut, scanned, and OCR'd PDFs (hereafter referred to as e-books)
  [* Tutsumi] First of all, this scanning is an act of reproduction, so I'm not sure if it is a legal reproduction or not.
   I forgot to explain, but I assume that you have legally reproduced it in the following way.
   > (Reproduction for private use)
   >Article 30 A work that is the subject of a copyright (hereinafter in this Subsection referred to simply as "work") may be used for personal or family use or other similarly limited use (hereinafter referred to as "private use"). Article 30 A work (hereinafter in this Subsection simply referred to as "work") that is the subject matter of a copyright (hereinafter in this Subsection simply referred to as "work") may be reproduced by the person who uses it for personal use or use within the family or other similarly limited scope (hereinafter referred to as "personal use"), except in the following cases (2) A work (hereinafter in this subsection referred to simply as "work") may be reproduced by the person who uses it for the purpose of personal or family use or other similar limited use (hereinafter referred to as "private use"), except in the following cases
   Naturally, the following systems must not be used for business purposes within the company organization

 How about uploading this cut and scanned PDF to a web service, e.g. kintone
  If there's only one person watching, it should be legal.
  	It's no different than having it in Dropbox or Evernote.
   No infringement of the right to make transmittable since it is not transmitted "to the public."
  What if it was more than one person?
  	I think this is also legal if you set the field access rights.

 [* tsk tsk]: did you check the definition of "public" properly?
  Definition of Public:.
  	>The term "public" as used in this Act shall include specific and numerous persons.
				One person is fine, but it's not clear how many to many when there's more than one.
    Specific but applicable to the public.

User benefits obtained even when used by one person
 A permalink on the Internet for the e-books I own.
 You can write comments about the book.
  Not only for cut and scanned e-books, but also for papers, etc.
  [https://gyazo.com/39bbf7e2d964d6c1eea0caaa932f22d8]
 Cross-searchable from the entire e-book you own.
  [https://gyazo.com/c7be0642e47a0a72519ab0493bf99cc0]


What happens if more than one person uses this?
	If it is shared only among a limited number of friends, can it be argued that it is not a public transmission because it is "personal or within the home or other similarly limited area"?
  Supporting discussion of the extent to which private copying is possible
  	[* Tut-tut] "Public" is a clearly defined concept, so it's not a good idea to use other arguments to support your argument.
    If it is specific but numerous, it constitutes a public transmission and is therefore "use of a copyrighted work," and permission must be obtained.
   [There is no such thing as private copying to begin with.
    > (Reproduction for private use)
    >Article 30 A work that is the subject of a copyright (hereinafter in this Subsection referred to simply as "work") may be used for personal or family use or other similarly limited use (hereinafter referred to as "private use"). Article 30 A work (hereinafter in this Subsection simply referred to as "work") that is the subject matter of a copyright (hereinafter in this Subsection simply referred to as "work") may be reproduced by the person who uses it for personal use or use within the family or other similarly limited scope (hereinafter referred to as "personal use"), except in the following cases (2) A work (hereinafter in this subsection referred to simply as "work") may be reproduced by the person who uses it for the purpose of personal or family use or other similar limited use (hereinafter referred to as "private use"), except in the following cases
    The author occupies the right to reproduce." This reproduction is the "use" of the work.
    Use and exploit are two different words.
     The use of the word "use" means any use other than use.
     Hear" is not included in use, so it is a use.
    The clause states that reproduction for private use is permitted only if the user himself is the one who is making the reproduction.

 One advantage is that it supports intellectual communication mediated by books, such as finding a friend who has the same book and getting excited about it, or searching for a book you are planning to buy and asking someone who has it what they think of it.
  If it's legal, I want to do it without hesitation.

Solutions that take advantage of kintone's functionality
 KINTONE can specify access rights for each field with the default functionality.
 In other words, "Attachment fields can only be viewed by the record creator" can be set.
 This way, no matter how many people use it, it's not a public transmission, right?
 [https://gyazo.com/25131a1fd1baa7a0040f7eca1a559194]

More aggressive use
 For example, if we add a field "friends with special access" and grant them viewing privileges, they will be able to view and search, but is this private in scope?

 It is legal for the administrator to download and analyze this "PDF that only the uploader can see" for the purpose of, for example, keyword extraction to suggest related books, or to allow everyone to search inside, according to the following provisions.
  > (Reproduction for information analysis, etc.)
  >Article 47-7 A work shall be subject to information analysis (meaning the extraction, comparison, classification and other statistical analysis of information pertaining to language, sound, images and other elements constituting said information from a large number of works and other large amounts of information. The same shall apply hereinafter in this Article). (2) In the case where the purpose of a work is to record or adapt (including the recording of a derivative work created thereby; the same shall apply hereinafter in this Article) a work on recording media to the extent that it is deemed necessary (2) The following is the same as in this Article. However, this shall not apply to database works created for the use of persons who perform information analysis.
 It is also legal to display a snippet of the area around a search hit according to the following provisions
  >(Reproduction, etc. for the purpose of retrieving the source identification code of the information made available for transmission, etc.)
  >Article 47-6 In response to a request from the public, a transmission source identification code (meaning a character, number, symbol, or other code to identify the transmission source of an automatic public transmission; the same shall apply hereinafter in this Article) pertaining to information made available for transmission may be used to identify the source of the transmission. The same shall apply hereinafter in this Article.) Article 4 Any person who engages in the search for and provision of the results of the search (including those who engage in a part of said business, and limited to those who collect, organize and provide transmittable information in accordance with the standards specified by Cabinet Order) of information made available for transmission shall not be liable for any loss or damage arising from said search and provision of the results of said search and provision. (2) A person engaged in the business of collecting, arranging and providing information made available for transmission (including a person engaged in a part of such business, limited to a person who collects, arranges and provides information made available for transmission in accordance with the standards specified by Cabinet Order) shall, to the extent deemed necessary for conducting such search and providing the results thereof, search for works made available for transmission (in cases where automatic public transmission pertaining to such works requires input of information to identify recipients or other means are provided to restrict reception of such automatic public transmission, the consent of the person who has taken such means to receive such automatic public transmission). (limited to those that have obtained the consent of the person who has taken such means with respect to the reception of such automatic public transmission) (2) The recording on a recording medium or the making of an adaptation (including the recording of a derivative work created thereby) of a work (including the recording of a derivative work created thereby) and the making of a request for the same from the public (2) The same shall apply hereinafter in this Article), and upon request from the public, to provide a copy of the work (including a copy of a derivative work pertaining to the work) recorded on the recording medium, together with the transmission source identification code pertaining to the information made available for transmission in connection with such request. Hereinafter in this Article referred to as "record for providing search results") recorded on said recording medium, together with the provision of the transmission source identification code pertaining to the information enabling the transmission.  (2) A person may make a record of the search results (including a duplicate of a work) However, when the copyright holder becomes aware that the making transmittable of a work pertaining to said record for providing search results infringes the copyright (in the case of making transmittable made outside of Japan, if it had been made in Japan, it would have infringed the copyright), he/she may thereafter refrain from automatic public transmission (including making transmittable) of said record for providing search results using said record for providing search results. (including making transmittable) using said record for providing search results (2) The following provisions shall apply
 	Requirements (of which I am dubious of satisfying)
   >A person who does so as a business
   >A person who collects, arranges and provides information made available for transmission in accordance with the standards specified by a Cabinet Order
  effect
   >A reproduction of said work recorded on said recording medium... (2) The works may be automatically and publicly transmitted (including making transmittable) by using the source identification code of the works recorded on said recording media.... (2) The following is a list of the works
  In short, the search engine operator may duplicate and store the search target or automatically send a duplicate of the search hit.

 It is legal to share book titles
  Titles are not copyrighted works.
  	>Article 20 The author shall have the right to preserve the identity of his work and its title.
   Based on the statement "If the title is included in a work, there is no need to write 'a work and its title,' and therefore the title is not a work", the company argues that "if the title is included in a work, there is no need to write 'a work and its title.
