passage of time
Knowledge] is [crystallized] through dialogue with oneself in the past, transcending time.

	relevance
  [4836-170724 Using Scrapbox and other IT in seminars promotes face-to-face dialogue - shiology https://shiology.net/4836-170724-scrapbox%E3%81%AA%E3 %81%A9%E3%81%AEit%E3%82%92%E3%82%BC%E3%83%9F%E3%81%A7%E5%88%A9%E7%94%A8%E3%81%99%E3%82%8B%E3%81%A8%E5%AF%BE%E9%9D%A2%E5%AF%BE%E8%A 9%B1%E3%81%8C%E4%BF%83%E9%80%B2%E3%81%95%E3%82%8C%E3%82%8B-eb3d9e21abc3]
  [I want to be timeless - scrapbox-drinkup - Scrapbox https://scrapbox.io/scrapbox-drinkup/%E6%99%82%E9%96%93%E3%82%92%E8%B6%85%E8%B6%8A%E3%81% 97%E3%81%9F%E5%AD%98%E5%9C%A8%E3%81%AB%E3%81%AA%E3%82%8A%E3%81%9F%E3%81%84]
 	[Facebook https://www.facebook.com/nishiohirokazu/posts/10214033640651610]

 Relation to [Interval Iteration Method].
 	Long-term memory] is reinforced by being presented again at a time when the person has forgotten.
 [Chat] induces focus by [notifying] you about new posts, but it's hard to shine a light on old ones.
 Many [stock] type services are simply buried because the accumulated information does not generate notifications.
 The one that did it well was Facebook, which is primarily a flow, but shows "what I posted years ago today".
 	[Facebook's "This Day in the Past"].

 Sometimes we are reminded not by time, but by the actions of others.
 	I call it [social triggers].
 	This was made possible by my blog, Slideshare and Twitter.
  Make slides and publish them, and you will get mentions on Twitter.
 By observing the content over many years, one can get a firsthand sense of the difference between content that will continue to be needed over the long term and content that will be consumed in a moment of excitement and never mentioned again.
 	He begins to think about focusing on the former.
 Speaking from personal experience, the first book I wrote was about "new and interesting things" without a long-term perspective.
  After seeing the sales for the effort and the subsequent rate of information obsolescence, I wanted to make sure that the next book would last five years worth of value.
  That approach was correct.
  So I started writing a book for the next 50 years. #intellitech
  For that writing, I created a system that allows me to cross-search all my past writings.
  I realized keenly that even if you write good things on your blog or Twitter, they can easily be buried and "never happened.
  I needed a different system, and that's when I came across [Scrapbox].
