Difficult to manage research department
It is well known that using papers and patents as KPIs is not a good idea.
 I realized that the problem is that [research department management] is difficult, and even if you avoid the pitfalls of using papers and patents as KPIs, there are still difficulties.
 I wonder if it could be made into a board game... → [Research Division Management Game Proposal].
  In-game resources include money, time, personal knowledge, personal visibility, and company visibility.
 At least in the short run, when time resources are limited, an individual's optimal strategy tends to be "invest time in knowledge acquisition". As time resources increase, time will be allocated to other activities besides knowledge acquisition because "double the time does not double the individual's knowledge acquisition rate.
 In the ratio of individual visibility to company visibility, if the company's visibility is high, there is a negative bias against increasing individual visibility because it is more efficient to work under the company's name than to increase individual visibility
  I wonder if in such an environment, when employees are no longer outputting as individuals outside the company, quotas on the number of papers, etc., would be introduced.
 In cases where the objective is to gain knowledge or recognition, it is better to solve the problem in the most advanced way possible, and it is better to solve the hardest possible problem. On the other hand, in the case of "implementation by someone other than myself," it is better to solve the problem in the simplest way possible, and to avoid difficult problems if possible. Since there is a fundamental discrepancy here, the strategy of incorporating the results produced by researchers working in the former mode into products after the fact leads to such problems as "the solution method is excessively difficult" and "small and difficult needs are chosen as the target to solve, not large needs.
  As for difficult or not difficult, it is difficult to generalize because some believe that solving problems that are not difficult does not differentiate you from your competition. To rewrite it in light of this.
   In cases where the objective is to gain knowledge or recognition, it is better to solve the problem in the most advanced way possible. On the other hand, in the case of "implementation by someone other than myself," it is better to solve the problem using the simplest possible method. Since there is a fundamental discrepancy here, the strategy of incorporating the results produced by researchers working in the former mode into products after the fact leads to problems such as "the solution method is excessively difficult" and "the maintenance cost is high.
   When there is a trade-off between "difficult/not difficult" and "profitable/not profitable," and the choice is between "difficult and not profitable" and "not difficult (boring because it is obvious that it can be solved) but profitable," people tend to choose the difficult one, which is not profitable but is worth the challenge. The problem is that we tend to choose the more difficult one, which is not profitable but is worth challenging.

 I thought this type of problem was caused by the research department not communicating the needs of the business sector to the research department, but even if they did, it's hard to move when the researcher is in a mode where knowledge acquisition is the goal.
 Also an IP strategic perspective.
  Both papers and patents are "making knowledge public," and even if these are not KPIs, there is often a play to increase the visibility of an individual or company by making knowledge public.
  On the other hand, if a problem with a great need is solved in a simple way, it would be more reasonable to keep it secret because it would not lead to much publicity or invite imitation by competitors.
  In such cases, a rational strategy would be to "keep the internal algorithm secret and only use the results realized in press releases to raise the company's profile.
https://www.facebook.com/nishiohirokazu/posts/10214061541229107

RELATED.
 [Academia and business have different valuation functions.]

