Research Division Management Game Plan
#Management Games
	The issue is what to do with the game's KPIs.
  Axis 1: Individual gain maximization in the research department
		Axis 2: Maximize company gain
  A proposal where each player makes both decisions to run his own company and as an employee of the company of the person to his right.
  	Total score, product of scores, or something like that to determine the winning score.
   Depends on the number of players, but maybe the company should decide to have more than one employee.
   　More opportunities to make decisions about "which person to assign the work to."
    Some moves that allow employees to change jobs or the company to restructure (the game may be too complicated).

	The company can give the researcher a work order.
 	Effects of work orders: Researcher time -1 Company profit +N Company visibility +M
  	A "deal card" may be prepared. Profits and time vary depending on the researcher's characteristics and the chemistry of the case.
 Time without work orders = discretionary
 	Five units of time are given per turn and allocated
 	Depending on the amount of this discretionary time, "new technology cards" can be drawn, etc.
   The researcher, not the company, decides whether to invest discretionary time in new technology development and draw the "new technology card".
   I mean, there must be other options.
    Investing in Knowledge Acquisition: Increases the skill value of the researcher
     This is great for the company because it affects the profit and time spent when processing the case cards.
     But it increases the market value of the researcher, increases the possibility of changing jobs, and pays more wages.
    I'll go get the case myself.
     This is great for the company, but for the researcher, it just means less time, so knowledge acquisition is better.
    Individual's act of external exposure: Increased personal visibility
    	Increased visibility leads to increased market value.
				Changing Jobs
     is not necessary to include it in the game system this time.
     The reason is that it is too cumbersome to implement a system in a board game that allows people to change jobs without telling the company.
   	Just relaxing: Stress levels decrease
    	I don't think we need to include this. I would like to save introducing a resource called stress.
		Basically, the best value for the individual researcher is to invest in knowledge acquisition
  	Should we have a structure of diminishing returns, where spending twice the time does not mean gaining twice the knowledge?
   I'm not sure if it's true or not. I have a feeling that it is more efficient to do a lot of work at once than to study in small pieces of time....
   But basically, if the options are in a state of diminishing returns, it creates an opportunity for decision-making: "How many do I do and stop?"
    I wonder if that's the way the game should be designed.
   At the very least, the conditions for the occurrence of "learning together is more efficient" should be made stricter.
    If the researcher's play becomes "always optimal to acquire knowledge at all costs", there is no game...
   For example, to develop a skill that is now level N to N+1, you need to exceed N on a die roll, and so on.
    And the number of die rolls is the "time to throw together".
    In other words, "learn each skill ABCDE in 1 credit hour" is effective in the beginning, but soon it becomes "learn in 2 credit hours" and so on. Finally, "You have to put in all 5 credits to develop the skills.
     If it costs that much to develop a skill, should the power of the new technology created be determined accordingly? But if the new technology created by someone with skill 20 is designed to be level 20, would it just be a "race to put all the money into acquiring knowledge"?
     Should the number of dice be determined by the skill level the researcher has and the level of skill be determined by the dice roll?
     	And while I'm at it, should I leave the dice on the card as they are in level view?
		Q: Can't the company order the development of new technology as a work order?
  	A: I don't think it should be possible, but I wonder if it's a design choice.
   	Without discretion, players playing the researcher's side are not having fun.
    But I also agree with the argument that the lack of discretion is more in line with reality.
    The company can order the development of a new technology, but it cannot order other work to consume all five credits of time, and the researcher has the discretion to decide how much of the five credits to invest in the development of a new technology, since the development of a new technology is not a sure thing.
     You can make die rolls and other probability draws based on the amount of time invested.
     The probability varies not only with time, but also with knowledge and skills. So when the researchers are ordered to develop a new technology, they can claim that they have decided that it is better to invest in knowledge acquisition first.

 What does the new technology card do for you?
  It differentiates the company and increases profits.
  It might be better to simply use the effect "profit +N per turn".
  It can be made obsolete by other companies.
  IP Strategies: Patenting, Disclosing, and Secrecy
  	Patent:
   	Obtain patent royalties from other companies at every turn
   	Other companies can do "research on avoidance techniques" and if they are successful.
     Patenting: Other companies can decide which side to pay patent fees to.
     Go public: everyone gets out of paying patent fees
     Keep secret: Only you can escape from paying patent fees.
    Patents will be gone in a few turns.
    Bonus to company and researcher visibility
   Public disclosure:
   	Bonus to company and researcher visibility, no money earned.
   conceal
   	You profit at every turn, but you do not get royalties from other companies.
    If someone else patents the same type of technology later, the right of prior use exempts you from paying patent fees.
    No bonus is given to the company and the researcher's visibility.
　I have a feeling that the IP strategy part alone is interesting enough...
		The system is already quite complex, so it may be necessary to downsize it while keeping it interesting.

	You may gain "domain knowledge" just by playing the case card.
 	Rather, it may be better to have both knowledge gained through research and domain knowledge to have a synergistic effect.
