antitrust law
I want to write an article eventually about how great the antitrust laws are.

>Article 1.
>This Act prohibits private monopolies, unfair restraint of trade, and unfair trade practices, prevents excessive concentration of business control, and eliminates undue restrictions on production, sales, prices, technology, and all other undue restraints on business activities by means of combinations, agreements, and the like, thereby promoting fair and free competition and encouraging business creativity. The purpose of this Act is to promote the democratic and sound development of the national economy, as well as to secure the interests of ordinary consumers, by encouraging the exercise of creativity and business activity, and by raising the level of employment and real income of the people.

 AT&T was prohibited by antitrust law from entering the computer industry. So Bell Labs released UNIX free of charge.
 In 1972, the Federal Trade Commission (FTC) sued Xerox Corporation for antitrust violations.
  The ruling forced Xerox to license its patents to competitors, mostly in Japan. Four years later, Xerox's share of the U.S. copier market dropped from 100% to 14%.
  This freed up copier know-how and led to the generation of many inexpensive copiers.
  Palo Alto Research Institute, founded in 1970, invents technologies that support today's IT industry, such as Ethernet and GUI by 1980.
  In 1980, [Steve Jobs] pulled out key researchers, and the Macintosh was launched in 1984.
 [Microsoft's competition law violation case in the European Union - Wikipedia https://ja.wikipedia.org/wiki/%E3%83%9E%E3%82%A4%E3%82%AF%E3%83%AD%E3%82%BD%E3%83%95%E3%83%88%E3 %81%AE%E6%AC%A7%E5%B7%9E%E9%80%A3%E5%90%88%E3%81%AB%E3%81%8A%E3%81%91%E3%82%8B%E7%AB%B6%E4%BA%89%E6%B3%95%E9%81%95%E5%8F%8D%E4%BA 8B%E4%BB%B6]
  >Citing Microsoft's continued abuse of its position, the Commission issued a preliminary ruling in 2003 ordering Microsoft to sell Windows without the Windows Media Player bundle and to disclose information necessary for the interoperability of competing networking software with Windows desktops and servers. and disclosure of information necessary for interoperability with competing network software and Windows desktops and servers.
 Internet Explorer Bundle
 	Win98 comes standard with IE4
  95% market share at its peak
  2009 [Now with IE bundling -- European Commission writes to MS objecting - CNET Japan https://japan.cnet.com/article/20386634/]
  
 [METI calls Apple and Google app stores "possible violation of antitrust laws"! - iPhone Mania https://iphone-mania.jp/news-136289/]
 [(June 1, 2017) Handling of the case of alleged violation of the Antimonopoly Act against Amazon Japan, LLC: Fair Trade Commission http://www.jftc.go.jp/houdou/pressrelease/h29/jun/170601.html]
 [European Commission to investigate US Apple for alleged antitrust violations - Belgium 1 photo International News: AFPBB News http://www.afpbb.com/articles/-/2206307]
