A case study of a three-year-long synthesis on Scrapbox
Fruition: [same -> what's the difference?]

Keep track of the process.
	December 2017
 	It's the end of the year and I'm clearing out my desk.
  I look at the diagram I drew on the back of the paper and wonder, "Did I put this in Scrapbox?" I think
  Search by "blind spot"
 [A Case Study of Noticing Blind Spots in Others' Perspectives] at the end of this article (Sept. 2017).
  read
  'This is part of a long page, but from a Scrapbox perspective, wouldn't it be better to cut it out?' I think.
 Cut to [set that was assumed to be equal
  I remember when I was at JEITA and you were talking about how the set is not equal.
  I'll search to find it and link to it.
  Search for "focus on differences," "differences," "difference," "similarity," etc.
 Not what I was looking for [the "same" and "different" are compatible] (January 2015).
  This story says, "We tend to assume that 'same' and 'different' are incompatible, but that is because we assume that X and Y are a single point, and when both are sets, a situation can arise in which the sets are not equal but overlap greatly. In that case, if you focus on the common part, they are 'the same' and if you focus on the other part, they are 'different'".
  There was no "like" in this.
 Found by searching for presentations at JEITA using the keyword "KJ method" in the title of the presentation (May 2015).
  This was just a link to an external Slideshare, that's why it didn't show up in the search.
  Some of the talks had the inside slides deployed on Scrapbox, but this had not yet been done.
  Re-read the slides and extract the slides you wanted to mention and create a page: [difference between "same" and "similar"].
  This is the story of "it is beneficial to focus on the differences, seeing them as 'similar' rather than 'the same'".
 In other words, [synthesis] means
  The question of whether what we think of as "the same" is actually "similar" rather than "the same"? Raising the question of "what is the same?
  If they are "similar," then "what's the difference?" It is useful to notice blind spots by thinking "What is the difference?
  A single guideline is created that says

#Scrapbox Case Studies