This War of Mine Spoiler First Play Log
	They tell me they don't have a bed and nowhere to sleep, so I use the resources I have to make a bed.
 We don't have the resources to make enough beds for all the people? What are you going to do?
 At night, the surrounding vacant houses can be explored.
 I see, so this is where you get your resources.
 Finish exploring one vacant house and go to another.
 People.
 Findings!
 He screamed and ran away.
 Wow, someone with a weapon came to us! What should we do?
 You can't run away!
 Oh, he was killed.
 One of the only three players died easily.
 The other two are in a gloomy state.
 (omitted)
 Can the occasional merchant come in and barter?
 The gems and medicines you pick up appear to be of high value and can be exchanged for a variety of things, which is convenient~.
 (omitted)
	Going to a new home.
 Wow, people are coming out!
 In a panic, I hit him with a crowbar I had with me.
	The other party is dead.
 Obtained "medicine" from the corpse of the old gentleman.
 Ugh, I don't have a weapon, and you didn't have to kill this...
 I'm happy because the meds are very helpful in our dealings, but I can't honestly say I'm happy for you...
 (Next morning)
 The character Pavel, who killed the old gentleman, is mentally ill and out of action.
 (omitted)
 Pavel appears to have picked up.
 It's convenient to carry a lot of luggage, so they can actively go out to explore.
 The character who attacks you is killing you because it's self-defense.
 (omitted)
 "We've uprooted their resources, they can't live with this, it's as good as killing them..."
 Will it...
 (omitted)
 Pavel has stopped doing anything.
 Up until now, if nothing else, I could feed him food or talk to him, but I can't do that either.
 I don't know what to do...
 (omitted)
 Pavel has left the shelter.
 We don't know where they went, we can't chase them, and we're too busy living our own lives.
 I'm sure he will die....
 I don't know what I should have done....
 (omitted)
 As a result of answering the occasional "help me," which occurred from time to time, they came to thank me a short time later, saying, "Thanks to you for your help~.
 It's a little dusty.
 (omitted)
 For what it's worth, three people survived while two died.
 The game is clear, but it's kind of unexhilarating, and I feel like, "Huh, the war is finally over.
 Some people died, so it's not a "yay" feeling.
