Structuring information with links
 Structuring information with links" is not "structuring information with [hierarchical structures].
 The author didn't understand it at first, but it's not "structuring information through tagging" either.
 Scrapbox's [information structuring] mechanism is somewhat different from what we are used to. You should think of it that way first.
  Otherwise, they try to [hierarchize] or pre-tag
 The link can be summed up in one word: "[association]."
  [Mind mapping] a relationship where you're making a brushstroke and A comes after B, and so on.
  A relationship in which topic B comes up after topic A when you are having a casual conversation with another person.
  Relationships such as when you are working on a presentation material and after mentioning topic A, you want to mention B.
 Scrapbox is a good tool for describing this relationship
 You may link to a page that does not yet exist.
 	If you think, "I'd like to refer to XXX from this article," you can put a link to XXX at that point.
 There is no need to have a description of the relationship when writing
  If you're reading page A again and think, "I'd like to touch on the topic of page B from this topic," you can link to it then.
  Or if you're writing page B and you associate it with page A, you can link to it then.
 	The link is always bidirectional, and the linked page will also indicate that it is linked.
  Example
  [https://gyazo.com/5f657e0f13f9f58fed5c4cd032d5a547]

 As this process is repeated, a network of information connected by associative links gradually grows.
 In addition to the human's realization that "Oh, I want to touch on the topic of page B from this topic," there is also a way to write a sentence and then make a link to words that seem important in that sentence.
 In this case, it will usually be a red "unconnected link," but if the same word happens to be a link on another page, it will appear in the associative display at the bottom of the page.
 	Example
  [https://gyazo.com/c2884ea8d44104c34658df4ef25036f9]
 I wrote that it is usually an "unconnected link".
 	Example
  [https://gyazo.com/cc0733360681e7ebeede575001910390]
		The term "link" can easily be misinterpreted as "linking something to something else" at the time of its birth.
  Rather, it is an image of "a door that may be connected to something in the future.
