People ask questions even if they don't want to know anything.
 False: When people ask questions, they intend to know something.
 Positive: People ask questions even if they don't want to know anything.
  In that case, the intention is to
   . expresses a willingness to engage in conversation."
   See if they respond."
   We'll make sure there's some common ground."
   The type of people who find silence painful do it to pass the time."
 The question, "It's a beautiful day, isn't it?" isn't about knowing what it is.
  The main purpose is to express the intention to have a conversation and to check whether the other party will respond.
  So there is no need to think about the definition of "good weather".
  Since we assume the purpose is to "confirm that there is common ground," it is more appropriate to respond, "It's a nice day," or "Yes, it's cloudy, but would you classify this as nice weather?" It is more appropriate to reply "It's a beautiful day" or "Yes, it's a beautiful day" than to respond "It's a beautiful day" or "Yes, it's a beautiful day.

 [Words for everyday life | National Institute for Japanese Language and Linguistics http://www.ninjal.ac.jp/publication/catalogue/kokken_mado/18/01/]
  An international student's advice: "Oh, I'm going out. I don't like it when people ask me where I am going and check my destination.
   Words that express interest, not questions about where to go.
   	Words for relationship building
   "Yeah, I'll just be up there."
  Greetings are words for relationship building
   There are differences between cultures.
   	Japan often talks about the weather.
    Talking about food in China and Korea
    Some cultures prefer atypical expressions, such as complimenting the other person's clothing instead of the standard pattern.
 When we part ways, while waiting for the train on a train platform or something, I'll ask, "Where's the nearest station?" I thought to myself, "What is this person thinking of doing by asking me what the nearest station is?" I felt uncomfortable. I understood that this was the protocol.

 Okay, I get it! I guess there is a general desire "not to know something, not to communicate something, just to have a conversation," and because I have relatively little of that desire, I failed to recognize that the people around me were acting on that desire.

[Facebook https://www.facebook.com/nishiohirokazu/posts/10204963037252194]
