Empathy and Chat Protocol
[Facebook https://www.facebook.com/nishiohirokazu/posts/10204963037252194]

[People ask questions even if they don't want to know anything].

 The keyword "[awkwardness]" emerged, and after delving into what the definition of "awkwardness" was, the possibility emerged that it could be attributed to the cognitive ability of "awkwardness.
  >An uncle came to visit Megumi's house. Megumi made a cheesecake with the help of her mother. Megumi told her uncle, who was waiting at the table, "I am making a cake for you. I'm making a cake for you. He said, "I love cakes. I love cakes, except the ones with cheese in them. Here is a question. Who said the awkward thing? And why was it awkward?
   http://topicsnow.blog72.fc2.com/blog-entry-5179.html
   The basic assumption is that "telling X, the person who made the cheesecake for you, the fact that you don't like cheesecake causes negative feelings in X, which causes negative feelings in you, called 'awkwardness'".
    I understand in my head that the majority opinion is so, but my feeling is that "I am agnostic as to how X will feel by telling the truth, and even if it is negative, that is X's issue and not mine" feels right.
   tokoroten >No one is awkward because they know the fact that you are making a cake, but the uncle doesn't know that it contains cheese. That was my own conclusion...
			hikita >Since we don't have God's perspective, if I didn't know my uncle was making cheesecake, the situation would be awkward, but a statement might be sort of inevitable? If it's an allergy or something, you may have to tell him.

 So the "air-reader" with a high capacity for empathy feels negatively himself when he makes the other person feel negatively. That's why they come up with the idea that "if I don't do ~, the other person will feel awkward, so I'll do ~ first.
  [Sympathetic Shame]
 As a counterexample, if you fail to recognize that the other party will feel the negative emotion of embarrassment when you point out their error in public, you point out their error in public.
  The person pointing out the mistake thinks, "I don't know if the other person will have negative feelings or not, and even if they do, that's their problem. It is not right to get angry when someone points out a mistake.
 On the other hand, even those with innate empathy are not necessarily able to empathize with "people without empathy" because they are only able to emulate the cognition of "people whose innate cognitive patterns are similar to their own" based on their own cognition.
  In that sense, calling one "empathetic" and the other "unsympathetic" is wrong and "no empathy between Type A and Type B" is correct, but unfortunately Type A is the majority, so unknowing discrimination against minorities occurs.
 Was it more advantageous for survival for individuals to be sensitive to whether the other person has negative feelings and try to avoid them?

[Sympathy]
