通常実施権設定の裁定
Patent law is designed to ensure that ideas are made public and shared, but also that benefits are given to those who publish and share them.
So, there are provisions to counteract any action that hinders industrial development, such as taking a patent and not using it, or not allowing others to use it.
If a world in which ideas are openly disclosed and shared is desirable, we should not eliminate the patent system but make the arbitrage system more user-friendly.

 >(Ruling on the establishment of a non-exclusive license in the case of non-implementation)
  >Article 83 Where a patented invention has not been worked in Japan for a continuous period of three years or more in an appropriate manner, a person who desires to work the patented invention may request the holder of patent right or the exclusive licensee to hold consultations concerning the grant of a non-exclusive license. However, this shall not apply where four years have not elapsed from the filing date of the patent application pertaining to the patented invention.
  (2) If no agreement is reached or no agreement can be reached, a request for a ruling by the Commissioner of the Patent Office may be made. The same shall apply in the following provisions.
 >(Ruling on the establishment of a non-exclusive license to work one's own patented invention)
  >Article 92 Where a patented invention falls under the case as provided in Article 72, the holder of patent right or exclusive licensee may request consultation with another person under the same Article for the grant of a non-exclusive license to work the patented invention or a non-exclusive license for a utility model right or a design right.
 > (Ruling on the establishment of a non-exclusive license in the public interest)
  >Article 93 Where the working of a patented invention is particularly necessary for the public interest, a person who intends to work the patented invention may request the holder of patent right or the exclusive licensee to hold consultations concerning the grant of a non-exclusive license.

参考：特許法の目的
 >（目的）
  >Article 1 The purpose of this Act is to encourage inventions and thereby contribute to the development of industry by protecting and making use of inventions.
	Not only to protect, but also to "use".
 I want to encourage invention.
 The purpose is to contribute to the development of industry thereby

Japan Patent Office, "About the Adjudication System in Japan" [pdf https://www.jpo.go.jp/shiryou/toushin/shingikai/pdf/strategy_wg07/paper08.pdf].
 In Article 83(1) of the Patent Law, "not being properly worked" means
  If it is recognized that the implementation is very small and nominal in relation to the demand
  If you are simply importing and not producing domestically
 In principle, it is understood that the above is the case.
 The term "where there are justifiable grounds that the patented invention is not being worked properly" as used in Article 85(2) of the Patent Law shall be determined based on a comprehensive consideration of various circumstances, but the following cases are considered as major examples
  (iii) where the patented invention cannot be worked because the facilities, etc. necessary for working the patented invention cannot be maintained due to a disaster or other circumstances beyond the control of the applicant, etc.
  (2) Where the patented invention cannot be worked because the licensing procedures necessary for the working of the patented invention have been delayed due to circumstances beyond the control of the applicant.

This is probably where improvements should be made:
 5. adjudication results
  So far, a total of 23 requests for rulings have been filed for patent, utility model, and design rights (9 cases of non-execution and 14 cases of utilization), but all of them were withdrawn before the rulings were made, and there have been no cases where non-exclusive licenses were established through rulings.
I'd love to know more about what happened in each individual case.

#知財