Network structure and matching efficiency
[Network Structure] and [Matching Efficiency]
 The combining of information that originated in separate places (hereafter [matching]) in one person,
  It can be a catalyst for the creation of something new.
 When we look at cases where information is exchanged through interpersonal communication,
  More interpersonal communication will increase the probability of matching.
 However, the limits of human cognitive abilities limit the amount of interpersonal communication
 	ref [number of dumber].
	Think in terms of a graph with humans at the top and interpersonal communication at the sides.

	Suppose that a vertex can have at most N edges.
	A structure in which every member of the organization has an edge with every other member (a complete graph) cannot grow to a size larger than N+1.
 The hierarchical organization was created to solve this problem
 	If N=10, then a person in the role of "middle management" is responsible for bonding 9 subordinates and 1 supervisor.
  With this structure, one president, ten middle managers, and ninety lay employees can be combined.
  Maximum path length is 4
  In the structure so far, the flat employee still has the extra power to affix N-1 edges. There are several interpretations.
  	Forming a dense network within your own department.
   Forming a reasonable network within your own department and bonding with people in other departments with the extra capacity.
   	This bonding with other departments is generally considered to be of high value
    The expression "communication across departments is important."
    Departmental activities and cross-functional teams are actively being created in several large companies.
			To begin with, cognitive ability varies from person to person, so the "number of edges that can be stretched" also varies.
    Even those with inferior ability to put up a frontier can do so as a layman.

 Let N=10
 	In a group of 11 people, you can't put up an edge outside of that group, so it becomes [an octopus].
 	If you have a group of 10 people and you do all the joins, you'll all have one extra line, and you can use that one line to put up an edge on the rest of the group.
  A group of 9 people can put up two
  How many groups are appropriate?
  Even in groups of 11 or more, there should be little harm in thinning out the complete graph.
  	With that thinned out, we can stretch the edges to the outside.
   For example, one "group leader" will be in charge of the remaining 10 members and will mediate all information distribution within the group.
    The remaining 10 can put up 9 edges externally.
   	There are disadvantages such as one more step in the distribution of information within the group and SPOFs.
     The structure feels not so good on the skin, but can its "badness" be quantitatively demonstrated?
  What is the best way to stake out the edges to the outside group?
   Example, 10 edges come from a group of 10 people, so this can be treated as if it were 1 person with N=10

	Points to remember
 	Even if it is decided from God's point of view that such a network structure is good, it is the individual human beings who actually make up the network
  For example, in large companies, hierarchical organizational structures can be enforced
   In some cases, they are seconded to other organizations for knowledge acquisition.
  But how each individual behaves ultimately depends on his or her personal incentives.
			We want to design a network structure that favors individual people working based on their own incentives.

	Avoid SPOF and prisoner's dilemma
	I would like to confirm my hunch that a strategy that emphasizes "introductions of mutual friends" will lead to beneficial networking
 Another system would be to "generate an up/down link to those who are added each year."

	[Prisoner's dilemma of information exchange].
	[Destroying the Prisoner's Dilemma by Placing Observers].
	Trade-off between acquiring information [from flesh and blood] and acquiring information from books, etc.
  Information acquisition through interaction with a live person and by receiving lectures and other broadcasts
		SNS Effectiveness