Unexplored as a network formation system
	In [2011], when Dr. Takeuchi asked me to write a one-page article on unexplored areas, what I thought was the most important thing to convey.
  Information Processing,52(12),1487-1487 (2011-11-15)
  It was hard to cut it down to the last minute because they told me to put in my introduction after I had written it without any introduction.
   I'm not sure if "community" and "network" are too many letters, so I'm replacing them with alphabetical letters or...
 Unexplored is a system that selects people with high technical backgrounds and concentrates [social capital] #Selection and concentration
  [Yoichi Ochiai https://www.procommit.co.jp/mitou/interview/ochiai-yoichi] [""The interesting thing about unexplored is that you can compete with the person next to you on the basis of 'great'."]


[https://gyazo.com/5f61d167df0d8af5dd1e4d958c1829b1]
	Figure -1 Community Structure
	 The limit of cognitive ability is expressed by the fact that each point has a rank of 6.
	 Left: Dense but narrow structure for information distribution
 	Medium: Network structure of small, dense communities that are connected to each other.
 	Right: structure with wide information distribution but vulnerable to prisoner's dilemma due to one-to-one relationship

I used to think that it was essential for me to study more than one field, but now I believe that this can be achieved by connecting people with different areas of expertise and creating a community. How can we do this? Human cognitive ability is limited, and in a community that is too large, the connections will be too sparse. Also, in order to do something together, it is important to be able to trust the other person, and having a common friend is effective for this purpose. Combined with the fact that relationships outside the community are important for acquiring new information, a network structure in which small, tight-knit communities are connected through individuals belonging to both is preferable (Figure-1).

Fortunately, Unexplored Youth had a system for creating networks. It was the Boost Conference. This created a network by weaving together the weft of the same year and the warp of alumni from different adoption years. This network has produced a number of interesting results, which I hope to continue to produce in the future.
I believe it will continue. The world would be a much more interesting place if we could increase such networks. Here are three examples.

(PS) The destruction of the [Prisoner's Dilemma] by the existence of common friends is explained in detail in [Recommendations for Productivity through Community
---
[https://gyazo.com/4ea88d57ee788eb269c2447b7b9236bc]

---
[https://gyazo.com/86fc1cc1850ed843ab7d77bff2a70b02]


[https://gyazo.com/4ea88d57ee788eb269c2447b7b9236bc]
