Can you spot innovative talent in advance?
2018-01-06
Can we [connoisseur] [innovative] talent [in advance]? The question is
 Opinion that "you can't do it."
 Opinion that "[weird people like weird people] so they can make some kind of identification."
 Opinion that "[there are] good and bad [weirdos]."
These were considered together.


[https://gyazo.com/dbd42e255d8ab4cdd242e7e642975a5a]
Suppose there are six people in the observation range and one is a bit "weird" (=[outlier]).
[https://gyazo.com/de4697f1baf4fb2979fc58b8d63a5703]

There are four ways a person can behave in that situation.

Type A: [Average-oriented].
 Ignore outliers and try to behave closer to the average of others
 [https://gyazo.com/66dd2ae70d8a956f7a7e3a64bad88472]
 Depending on the competitive conditions, this was the most rational choice.
  But the worst choice in a situation where you're being asked to create something new.
  see [平均志向が最悪の環境]

Type B: [Imitation-oriented].
 Ignore the average person and imitate the outlier
 [https://gyazo.com/eb9e1486136e34c647670431fbc34ab2]

 Imitation occurs due to longing for the "outlier.
 This is mere imitation and therefore not beneficial in a situation where one is expected to create something new

Type C: [Uniqueness-oriented].
 Oriented to be unlike anyone else in the observation range
 [https://gyazo.com/d1a4049054a7b7029d86fba7367e1229]
 If "the world in general does X," then we dare to do the opposite of X, which is an act of genius.
 There is a longing to be "not average," to be "one-of-a-kind," to be "not like anyone else.
 Active in "creating something new."

Type D: [Self-oriented]
	All of the types A, B, and C mentioned so far were functions that took "the behavior of the people around them" as input.
 Let f(x) be a function whose input is "the behavior x of the people around me," and g(y) be a function that is independent of x.
		G(Y) is, for example, "my taste" or "sense of justice" or "logical consistency". In a word, my values.
 There are types that have a large difference in the range of values of this f(x) and g(y), such that they are exclusively [$ ||f(x)|| << ||g(y)|| ].
  There are many possible causes for why there are large differences in the range of values.
  	Poor cognitive ability for other people's behavior due to organic disorders
   Strong confidence in their own values.
    Strong confidence in their own reasoning and feel that others around them who make decisions different from their own are idiots
    He has strong confidence in his own sensibilities and thinks that anyone who doesn't think a picture he thinks is good is not in good taste.
    He has a strong confidence in his own sense of justice and considers anyone who disagrees with what he thinks is just to be his enemy.
   I've been exposed to an education and culture that tells me to value my own values without being misled by others.
   There is a success experience from ignoring f(x), which reinforces the behavior of ignoring f(x)

In terms of "behavior deviating from the average," Types B, C, and D are all "weird." From the point of view of Type A, if there were three people in front of you: Yoichi Ochiai sucking curry through a straw, a fan imitating Yoichi Ochiai and sucking curry, and a person who grinds frisks with a mortar and sucks them through his nose, all are equally "strange" and cannot be distinguished from each other.

How can we distinguish between these B, C, and D? If the question is, "Why do you do the non-average act?" If the answer to the question, "Because ________ does it," then it is confirmed as Type B. If the answer is "Because ________ does it," then it is confirmed as Type D. Type D answers based on one's own values, so there is no mention of others.

However, if Type D has already published its "own value-based answer," Type B may mimic that answer itself.

Type Cs, on the other hand, are usually ashamed of their thinking and try to hide it, and they often say things that make sense from the outside. They are usually embarrassed by this way of thinking and try to hide it, but they are reasonable in the open.

One way to identify these is to ask, for example, "If I want to get nutrition in liquid form, can't I just take a Widder-in-a-Jelly or something?" or "If I want the stimulation of menthol in my nose, why not just spray my nose with liquid huckleberry oil without going through the trouble of crushing frisks?" If they are rooted in their own values, they can have an in-depth discussion, but imitators and pretenders who are not rooted in their own values may not be able to refute the counterargument or may have an emotional reaction.
 It's going to be related to [the math department's "I know"]. You need to show it yourself, not what others do.

I guess I could sum it up in one literary phrase: "[A] weirdo with a core is good.

追記
	I'm starting to think it might be related to [axiomatic differences].
 Disagree with the conclusions drawn by the other party.
 	Example: it is not reasonable to invest time in the subject
 But when you dig deeper with logic, you can't find any holes and it comes down to axiomatic differences such as personal values.
 	Otherwise, they are simply considered "beings with inferior logical thinking skills"
 It comes down to differences in axiomatic systems, so neither can deny the other's system with their own system.
 So we both appreciate each other's ability to think logically, even though we have different conclusions (we describe each other as smart people, etc., even though we have different arguments).
