True Theory of Business
[https://gyazo.com/f957724dd1a8d214be71352a878638db]
 True Theory of Corporations: What Business Schools Don't Teach [Business Administration].
 [Takeshi Nakano]
 [Amazon http://amzn.to/2CS5uZj]

 The vague image I had of Silicon Valley was destroyed by the data, and I began to wonder if "Silicon Valley" was a kind of buzzword. I start to feel like "Hey, was 'Silicon Valley' just a kind of buzzword?
 "Don't you ever get angry when you hear people say, 'Oh, you're just a bureaucrat!'" I saw the description "What? I checked the publication date: May 2017.
  The author's biography on the back of the cover does not include any biographical information after 2005.
  [Wikipedia https://ja.wikipedia.org/wiki/%E4%B8%AD%E9%87%8E%E5%89%9B%E5%BF%97] would indicate that this is just my personal opinion, even though the current workplace is obvious.

	The style is to first pick up discourses in the world and then point out what is wrong with those claims with data.
  I get the impression that the reader is on his/her own to create a zinthesis, since it provides an "antithesis" to the "thesis" of the world.
 Compact new book size, but conveniently clearly identified by more than 100 references.

	Venture Capital's Connoisseurship Theory
 	Based on data showing that 80% of the 88 companies funded by the top 5 venture capital firms from 2011 to the first half of 2013, 70 of them were founders with board experience, connections, or education, "discernment is difficult."
   [Focus: The Falsehood of the Silicon Valley Myth, The Key to Success is "Education and Connections" https://jp.reuters.com/article/l3n0h9132-analysis-silicon-valley-idJPTYE98D00D20130914]
   I'd like to see more information on the "X or Y or Z" condition, because it tends to be too broad.
  I have no evidence, but I have a feeling that I can be a connoisseur of some kind.
   [Can you spot innovative talent in advance?]

	In 1952, when Minsky was a student, Bell Labs told him, "Don't get involved in research that won't take 30 years."
