History of the University
 Student Guild
  >Since the end of the 11th century, Bologna, where many jurists, including Irnellius, who studied the "Compendium of Roman Law," had private schools, became famous as the academic capital with a law school, and the origin of the university was a union formed by students who came from many countries to defend their rights against citizens and city authorities. The origin of the university was a union formed by students from various countries who came together to defend their rights against citizens and city authorities.
 training institute
  >In medieval Western Europe, the university consisted of four faculties: the Faculty of Theology (training Christian clergy), the Faculty of Law (training lawyers), the Faculty of Medicine (training doctors), and the Faculty of Liberal Arts, whose major role was to train professionals.
  >In England, under the leadership of the Anglican Church, education by the nobility was conducted at universities in the tradition of the medieval guild-like universities, and research was carried out and published in private academies.
	Around 1800, a university finally appears to conduct research
  Linguist, Prussian statesman, Wilhelm von Humboldt, University of Berlin
   >Under the motto of "academic freedom" from the state, and based on independent research by researchers and students, and with the aim of acquiring truth and knowledge, we adopted a model in which philosophy guides the theoretical study of not only these three disciplines but also all disciplines, including the natural sciences, around the traditional disciplines of law, theology, and medicine The model was adopted.
   >Universität Berlin became a model for universities around the world and helped shape its industry through a revolutionary shift in thinking to integrate research and education.

	The academy is more of an organization that does research.
 >The academy (English: academy, German: Academie, French: académie, Luo: academia), originally derived from the academia (rare: Ἀκαδημ(ε)ια/Akadēm(e)íā) founded by the ancient Greek philosopher Plato in Athens, has been used since the Renaissance as an academic organization, Since the Renaissance, the term has been used to mean "academic organization" or "academic society".
