Search strategy in the presence of competitors
 To analyze this problem, it is first necessary to model that "a rush to a particular option will increase competition and decrease profit.
 There is an unknown demand function in the choice space, which can only be observed with noise and gradually revealed in a Gaussian process manner. What is the strategy to maximize profit when profit is demand divided by competition?
 If all agents are set up to "choose the place with the highest expected value of demand," the first person chooses randomly because he has no information, and when it is less than the expected value of the prior distribution, the next person chooses to avoid that neighborhood. When one person finds a good location, all the rest rush there and everyone dies.
 If all agents are thinking "divide the expected demand by the number of competitors and maximize it," then when someone finds a good location, the next person randomly goes to a position on that side that is far enough away to not compete, the next person recognizes the slope from the two people's information and starts climbing the mountain, and soon [niche top] is occupied Niche Top] is occupied. #Niche
  The area around the top is then gradually filled, and once all of it is taken up, the unknown area is explored again. When the top is large enough, the strategy of competing with the top is also used in the process of exhaustion.
 If the expected value plus one standard deviation is 1 SD greater than the expected value for a good location found by the previous person, we go around and look for another location if it is smaller.
 This model seems to describe part of reality well, but as I was writing it, I was thinking that I don't have the ability to create barriers to entry for those ahead of me, and I can't prevent my profit margins from being lowered by those who enter later because the information about my success is available to all. I hope I can find enclaves and create barriers to entry before others realize it.
 I think this model describes well with respect to product development, but it is not very appropriate in terms of knowledge positioning. First of all, it is strange that the cost of taking any position is equal, and it is also strange that only the demand around the position can be taken. Skilled people can also satisfy demand with lower skill requirements.
 I am wondering how to implement a model in which tasks of varying skill levels are listed on the market, and labor of varying skill levels is also listed and matched...since both the task seller and the labor seller will change their listings based on the market information.

[Search strategy] #Search when [competitor] is present
[Twitter https://twitter.com/nishio/status/618369080706228224]
