tarot
[2015-01-19 https://www.facebook.com/nishiohirokazu/posts/10205132842017207]
 The other day, when I talked about how interesting it would be if all the metaphors in astrology, tarot, etc. were converted into data and subjected to principal component analysis, I thought it was interesting enough, but then I thought about the philosophy book "The function of human consciousness is that the subjective encompasses the objective, in other words, consciousness is a 'place' that encompasses the object" (Kitaro Nishida). (Kitaro Nishida), which I interpreted as a bunch of metaphors, and I thought it would be interesting if I converted them into data and conducted a principal component analysis.
 It's an interesting stop, but even more interesting.

https://www.facebook.com/nishiohirokazu/posts/10204953797021194
	[The Idea Tarot]
	[The reason for the creation of the blind spot card]

--- the one I posted here, the link doesn't seem to be connected, can I delete it?
<td><A><divstyle="width:150px;height:150px;"><IMG></A><A>I would love to see Ohkubo Kohei</A> use his knowledge of magic to verbalize "the structure that important inventions in magic history have. The only thing I know is "if there is something that customers don't want to see, emphasize the parts that they don't mind being seen".

12:20am /nishiohirokazu/posts/10204953783620859:5

<td><a><divstyle="width:150px;height:150px;"><IMG></a>After drawing TRIZ again, I thought that the first part is a rather generic collection of things, and the nesting and asymmetry are rather interesting perspectives, but the last part "increase oxygen I thought that the last one, "increase oxygen", could be more abstracted.

12:17am /nishiohirokazu/posts/10204953783620859:4

<td><a><divstyle="width:150px;height:150px;"><IMG></a>"Changing materials" and "changing methods" from TRIZ have also appeared as part of the "5 methods of innovation" in last year's edition, but I'm wondering if I should make 5 separate cards for these. I'm wondering if it would be better to use 5 separate cards, or a combined card.... The remaining three are "change the product," "change the market," and "change the organization," and the other one, "change the way to get paid," which is very important these days, is missing. I wonder if monthly installment sales had not yet been invented in Schumpeter's time.

12:09am /nishiohirokazu/posts/10204953783620859:3

<td><a><divstyle="width:150px;height:150px;"><img style="width:150px;height:150px;"><img></a>Back or read the page designated by the card number for an explanation.

12:09am /nishiohirokazu/posts/10204953783620859:2

<td><a><divstyle="width:150px;height:150px;"><IMG></a>My image is a table with a figure whose meaning may or may not be readable, with an explanation in the back.

12:07am /nishiohirokazu/posts/10204953783620859:1

<td><a><divstyle="width:150px;height:150px;"><img></a>The results of last year's brainstorm

12:02am /nishiohirokazu/posts/10204953797021194:0

2015-01-02  



11:59pm /nishiohirokazu/posts/10204953783620859:0
Amazon.co.jp | Store - From fashion, electronics to food [FREE SHIPPING usually] </a>Amazon.co.jp You can make it in PowerPoint and print it on business card paper.

11:14pm /nishiohirokazu/posts/10204942764905398:11
<A>Wisdom Cards - Idea Plant Online Shop</A>braster.ocnk.netTRIZ cards, were already <A>http://braster.ocnk.net/product-list/6</A>

9:34pm /nishiohirokazu/posts/10204942764905398:10
Amazon.co.jp - Store - From fashion, electronics to food [FREE SHIPPING] </a>Amazon.co.jp For now, let's collect the explanations of the total of 78 Major and Minor Arcana of Tarot, 64 hexagrams of I Ching and (10 planets + 4 asteroids) x 12 palaces of astrology from somewhere and check their main components. Let's try to find out the main components.

7:43pm /nishiohirokazu/posts/10204942764905398:9
Amazon.co.jp | Store - From fashion, electronics to food [Free Shipping] </a>Amazon.co.jpIt is important to be moderately detailed in promoting Corepon, but how moderately depends on the situation, doesn't it? So I thought it would be good to be able to adjust the aperture to "say among 10 pieces, this one", "among 32 pieces, this one", "among 64 pieces, this one..." and so on.

7:39pm /nishiohirokazu/posts/10204952661552808

7:28pm /nishiohirokazu/posts/10204942764905398:8
Amazon.co.jp | Store - From fashion, electronics to food [FREE SHIPPING] </a>Amazon.co.jp Principal Component Analysis, you can choose any n...

7:27pm /nishiohirokazu/posts/10204942764905398:7
Amazon.co.jp | Retail - From fashion, electronics to food [FREE SHIPPING] </a>Amazon.co.jp No, I still want to get that out of a principal component analysis, not a human conceptualization of it.

7:26pm /nishiohirokazu/posts/10204942764905398:6
Amazon.co.jp | Retail - From fashion, electronics to food [FREE SHIPPING] </a>Amazon.co.jp I know the first two are "yin" and "yang".

7:23pm /nishiohirokazu/posts/10204942764905398:5
Amazon.co.jp | Store - From fashion, electronics to food [FREE SHIPPING] </a>Amazon.co.jp Tarot, Osborn's checklist, astrology, and many other things are out there, but I wonder if there is a study that synthesizes the metaphors that these things point to and does a principal component analysis or something like that. I wonder if there are any studies that synthesize the metaphors and extract 40 patterns from the important ones.

7:22pm /nishiohirokazu/posts/10204942764905398:4
Amazon.co.jp | Store - From fashion, electronics to food [FREE SHIPPING] </a>Amazon.co.jpTRIZ focuses on how to resolve the trade-off relationship between physical performance as its basic premise, so to apply it to software and other things, you have to abstract yourself one more step. You have to abstract it one more step by yourself to apply it to software and so on.

7:15pm /nishiohirokazu/posts/10204952554110122

10:30pm /nishiohirokazu/posts/10204934610781550:0
Amazon.co.jp | Store - From fashion, electronics to food [FREE SHIPPING] </a>Amazon.co.jp Yes, so I've been wondering lately if I could make a tarot where the symbols on the front are math and science themed, etc.
