Knowledge Workers and Market Pricing
Express the skill level of [knowledge worker] as a non-negative real number in dimension n (for simplicity, we may start with dimension 1).

 Distribution of skill levels of goods (=[knowledge workers]) in the market
  Generally not uniformly distributed
 Distribution of skill levels required by buyers in the market
  Generally not uniformly distributed
 Assume that the quantity of goods satisfying the required skill level is inversely proportional to the price
 	In reality, buyers compete with each other in an auction-like manner to determine the utility that the buyer can obtain from the commodity, subject to other constraints, but the model is too complex to approximate.


	For example, if there are many jobs in the market that require around 30 skills and many jobs that require 90+ skills, the graph of skills and compensation should look like the graph in the [model where only the top players in the market get utility].
	Only the right end of the graph would be higher if "only the top people are hired."

	And by trying to draw a graph like this, you've implicitly assumed that the skill level is one-dimensional.
  Actually n-dimensional, with requirement levels set in multiple dimensions
		Then the phenomenon of "not the top on any axis, but highly regarded" can be expressed.
  [https://gyazo.com/0588c2fa917ac88ec2bd30f30ab21af6]
   There is a [trade-off] between skills due to the finite amount of time required to acquire them. On the graph, this is expressed in the form of a [constraint line] that skill1 + skill2 is less than or equal to a certain value.
    ref. [予算制約線と無差別曲線 – 瞬時に分かる経済学 http://wakarueconomics.com/%E7%B5%8C%E6%B8%88%E5%AD%A6/post-188] #予算制約線 #無差別曲線
		Aiming to maximize each skill leads to a red ocean
  Surprisingly unfocused with respect to mixing multiple skills.
   When the dimension is high, contrary to intuition, the mixed region is wide ([curse of dimensionality]).
   When N dimensions are N, there are N regions that are top for each axis, but N(N - 1)/2 regions that are top for the combination of two axes. mixed regions are more numerous when N is 4 or more dimensions.

#要実験
