A Manual for Identifying AI Scammers
 Many people think that expectations for AI are so overblown that the bubble will eventually burst, but it would be unbearable for those who are serious to fall into the valley of disillusionment, so why not kick the scammers into the valley first by providing a "How to spot an AI scammer manual" for those who make investment decisions? How about kicking the scammers into the valley first, and then aiming for a soft landing?
 If, after the bursting of the bubble economy, we swing in the direction of "human skin is important," we will end up with another "lost decade.

	Anyone who guarantees that it will work is a fraud.
 	Machine learning is basically a matter of trying.

	Incidents that are implemented but do not report what data to include and how much to include.
 	I don't know what to do with the customers I receive.
  If the terms of the contract were only for software delivery, would you cry yourself to sleep?

	Deliverables with just a little tweaking of the published sample code
 	Search by source code

	Using algorithms that cannot be accurate without sufficient data without verification
		There is no way to start implementation without first confirming how much data the customer can provide in the first place.

 Evaluate accuracy without separating training and validation data
 	If you do this (and if the customer does not understand that it is not a good idea and does not accept the data), the accuracy will be very low when you try to use it on new data.
  I thought they were intentionally doing tests that would only pass acceptance inspection, but maybe they simply don't know that they need to be verified separately.


There are three different people.
	Type A: The term "artificial intelligence" should not be used because the definition is unclear.
	Type B: The term "artificial intelligence" is ill-defined, but customers want it, so let's use it. If the result provides value to the customer, so be it.
 Type C: The term "artificial intelligence" is ill-defined, but customers want it, so let's use it. If I get paid as a result, so be it.
Type C is referred to here as AI fraudsters.

It is difficult for the average customer to distinguish between B and C. They are caught in C and lose money.
Since the bad impression extends to both B and C, B is damaged by C's conduct.
To reduce this damage, it is necessary to disseminate information on how to distinguish between B and C.

 [Hype cycle]
 [Quietly Spreading "Anti-Deep Learning" and "Anti-AI" - Nikkei Trendy Net http://trendy.nikkeibp.co.jp/atcl/column/16/090200078/011900221/]

 The title may be too radical.
 	[Don't find malice in being incompetent and sufficiently explained].


[DS Hitori📈 tweets: "And the hellishness of old men who have never heard of xgboost and start discussing this and that as they please based on variable importance alone..." https://twitter.com/factorydatamng/ status/1003660868633030656]
