The parable of the lumberjack
	A woodcutter busily chopping wood with a rusty [axe].
 A traveler teaching, "You can cut more easily if you remove the rust from the axe."
 The woodcutter replies, "I'm too busy cutting down trees to do that.

	[The 7 Habits
 	Seventh Habit: "[Sharpening the Blade]"
 	p.432
 		[https://gyazo.com/39d66f4d74dcade0b708fbe18d3bf848]
  Not an axe [saw].

	While you're sharpening your axe blade and feeling good that you're sharpening your blade, [chainsaws] may be being introduced on the next mountain.
		>The winner is the one who cuts down the most trees in three days. You can do anything you want, but the first thing you will be provided with is a rusty axe and a whetstone.
		> Fools continue to cut with a rusty axe because they don't have time to sharpen it. A somewhat sane man will sharpen it properly every day. The smart ones work part-time or go to the bank to buy a chainsaw until the second day.
		https://twitter.com/metatetsu/status/1081861461440266240?s=21

	Some people claim that Aesop's Fables are the source, but I have not been able to find one that clearly states which story it is.
	　I checked the list to see what might be related to Kikori, but it was a different story.
			https://ja.wikipedia.org/wiki/ペリー/index
   Perry 22 [https://en.wikipedia.org/wiki/The_Fox_and_the_Woodman The Fox and the Woodman - Wikipedia]
   　A story about a fox asking a woodcutter to hide him, and the woodcutter telling the hunter that he has not seen the fox and pointing to where he is hiding.
   　[The Fox and the Woodcutter]
   Perry 173. Hermes and the Woodcutter
   	[https://ja.wikipedia.org/wiki/金の斧 Golden axe - Wikipedia]
   	[https://en.wikipedia.org/wiki/The_Honest_Woodcutter The Honest Woodcutter - Wikipedia]
    The story of being the goddess of the fountain in Japan.
			Perry 302 [https://en.wikipedia.org/wiki/The_Woodcutter_and_the_Trees The Woodcutter and the Trees - Wikipedia]
   	The axe shaft is made of wood, a story about being betrayed and destroyed by someone you trusted because you thought they were your relatives.
   	[The Oak and the Woodcutters] This makes it a wedge.

relevance

[Ecclesiastes 10:10]

https://www.clairenewton.co.za/my-articles/the-wood-cutter-stories.html


#Parable
