unofficial resignation
Copyright belongs to the author by default. Article 15 of the Copyright Act is the rule that stipulates that copyright is vested in a legal entity only when certain conditions are met.
> (Authors of works created in the course of their duties)
>Article 15 Any work (excluding program works) created in the course of employment by a juridical person or other user (hereinafter in this Article referred to as "juridical person, etc.")  (2) The author of a work (excluding program works) prepared by a juridical person or other employer (hereinafter referred to as "juridical person, etc." in this Article) in the course of its duties and published under its own name shall be the said juridical person, etc. unless otherwise provided by contract, service rules or other regulations at the time of preparation.
>2 The author of a work of a program created by a person engaged in the business of a juridical person, etc. in the course of his/her duties based on the initiative of such juridical person, etc. shall be such juridical person, etc. unless otherwise provided for in a contract, service rules or other regulations at the time of creation of such work.

The text of the law is in the form if(condition)then{effect}. The condition part is called "legal requirement" and the effect part is called "legal effect.
If there are multiple legal requirements, they are connected by AND, so the legal effect occurs only if all requirements are True.

requirement
Article 15.1.
	1: At the initiative of a legal entity, etc.
 2: Prepared by a person engaged in the business of a corporation, etc.
 3: Created in the course of employment
 4: It is a work other than a program work
 5: Legal entities publish under the name of their own work
 6: Not otherwise provided for in the contract, service rules or other regulations at the time of its creation.
Article 15.2.
	1: At the initiative of a legal entity, etc.
 2: Prepared by a person engaged in the business of a corporation, etc.
 3: Created in the course of employment
 4: The program is a work of authorship
 5: Not otherwise provided for in the contract, service rules or other regulations at the time of its creation.

effect
	The author becomes a corporation, etc.

Examples of professional works
 [https://amzn.to/2HOA6Lf The World's Easiest to Understand! How Programming Works, book by Cybozu (Author)]
  Requirement 5: The corporation (= Cybozu) publishes under the name of its own work.
		Other requirements are also met.
  If it is "written by: Nishio Kawai", it is a joint work by the two authors.


#IP #Copyright

 [Report of the Conference of Research Collaborators on Copyright Issues Concerning Computer Programs | Report of the Copyright Council / Subcommittee of the Council for Cultural Affairs | Copyright Database | Copyright Information Center CRIC http://www.cric.or.jp/db/report/h4_3/h4_3_ main.html]
 [Copyright Law verbatim http://hirao-pat.in.coocan.jp/copyright/right6.htm#right6_2]
