U Theory and Tokoroten
Discussion with [Shinta Nakayama] about [U Theory

[2014]-04-27
[Facebook https://www.facebook.com/tokoroten.nakayama/posts/621307801294417?stream_ref=10]
 t> I finished reading the [U Theory] introductory book introduced to me by nishio.
  U-theory is logic in the first half, but it becomes [occult] in the second half.
  I know it is correct, but this is correct for those who have experienced U-theory,
  I need to convert the second half into language and logic for proselytizing.
 n> [Senge]'s book, or the story about how saying thank you to water makes the crystals clean, almost blew me away.
 t> Is this just because the person who wrote the introductory book couldn't verbalize it and swung to the occult?
  Is there another way to look at the big book translation?
 n> This is only my interpretation, but I think [Otto Schirmer] and [Peter Senge] are deliberately mixing the occult.
  Those who can identify the occult can read it and discount it, understanding that it is not the core of the argument.
  Positive effect on those who cannot identify the occult.
 T> Ah, I see.　So that's how you make a self-help book for the masses.
 n> Well, it may depend on what part of Tokoroten calls occult.
  The second half of the Introduction to U Theory is about the seminars that the translators are doing, right?
  That is not what the big U theory says.
 n>This is what "[water message]" is written on.
  The review says, "Photos and experiments with water crystals by a Japanese man, Masaru Emoto, which are introduced in the epilogue.
   [Emerging Futures http://www.amazon.co.jp/dp/4062820196]

 t> However, if you make it into language or logic, it becomes [how], and the self is not transformed because it is executed in [emulation], so maybe you are intentionally avoiding how.
 n> It is possible that the second half of the how in the Introduction to U Theory is the publisher's intention.
  Even if he thinks, "If I write how, it's meaningless.
   PS: Otto Scharmer's book, the big book, is not accessible to the general public as a result of trying to avoid the how.
 T> Ah, so this is a book advertising the seminar. I'm convinced.
  Is this the approach of a religious recruiter who says that if you take a seminar, you will be enlightened?
  In the meantime, I will read the translation of the big book one.

[Facebook https://www.facebook.com/tokoroten.nakayama/posts/621311631294034?stream_ref=10]
 t> U-theory is an extremely well understood [labeling] that [verbalizes] your [experience] for those who have experienced [crystallization], but if you try to share with others based on this label, you are likely to fail.
  The other thing is that U-theory requires a significant amount of [tacit knowledge], its verbalization, and its logic, so this seems to be a high prerequisite.
 n> Tokoroten gave a good labeling to what I thought when I read U Theory w> "U Theory is a labeling for those who have experienced crystallization that helps them verbalize their experience.
  It's a book that assumes you have prior "experience" and encourages you to verbalize it so that you can repeat it with awareness.
	t> I see, [reproduction by labeling], I didn't have that perspective.
 n> I imagine it is similar to cataloging "coding styles that any competent programmer would have found on their own" with a name like "Mediator Pattern" so that conversations can be had at the level of abstraction of patterns.
  #DesignPatterns #PatternLanguage

[Facebook https://www.facebook.com/tokoroten.nakayama/posts/621486617943202?stream_ref=10]
 I thought [flow theory] and U-theory were close, but something different came to me in language.
  [Flow] is the process of using one's brain to the limit in order to solve a problem, and then one loses one's self and switches to a purely problem-solving mindlessness, resulting in overwhelming performance.
 n> I wonder if flow is the state in which the distractions disappear by working on a problem of just the right difficulty level, and presenting is flow when you are working on the problem of "taking what is happening as it is and finding the structure in it".
	t> flow, an appropriate level of challenge is desirable because every time a problem arises, it blows the thinking out of the water.
  With presenting, it's a state of being able to think comprehensively without stopping to think on the issue by gathering all the issues in advance. I wonder if it is.
  Perhaps presenting is very similar to the state of [group flow].
 Is there a difference between n> flow and group flow?