Behavioral Strategies by Logic Facilitating Generational Change
 Demonstrate by logic, not by quotes from great men, that an action strategy that was useful in one situation is not useful in another situation
 Suppose there is an older person, A, and a younger person, B, and that person A has been successful in the past in situation P by taking action strategy X
 Mr. A tends to think "action strategy X is right" and tells Mr. B so
  Precisely, "In situation P, action strategy X is correct."
  In the current situation Q, it is possible that action strategy Y is more correct than action strategy X.
 Mr. A's opinion tends to be more justified than can be logically justified
 	Halo effect] due to Mr. A's age.
  Mr. A's results
   It's not surprising that you have more achievements because you have more time resources used than Mr. B.
		Mr. A's confidence
   By experience, "I took action strategy X and actually succeeded."
   Bias of thinking that one's past decisions were correct
 Input from Mr. A decreases the probability that Mr. B will take the preferred action strategy Y in the current situation Q
 How can we solve this problem?
 Mr. A's age, track record, and confidence are obstacles to any direct attempt to deny that "Action Strategy X is correct."
 First of all, acknowledge "Action strategy X is correct in situation P" and suppress Mr. A's rebellion.
 Then, it is shown by logic that the optimal action strategy changes depending on the situation.
  Example [the value of variation in quality depends on the level of demand].
  Example [environment with worst average orientation].
 This increases the probability that Mr. B will take the preferred action strategy Y in the current situation Q
	Facilitating [generational change] of [action strategy] through logic

ref. This thought pattern is another example of a [conflict resolution diagram].
The reason I wrote this, in [Imported Faith and the Late Majority], the first
>I'm waiting for social proof because I'm afraid of risk-taking alone for something uncertain.
I realized that using the expression "I'm afraid" was assuming that the other party was acting emotionally rather than logically, so I rewrote it as "I don't think it's rational to take risks.