Department from which the officer came from
tokoroten's hypothesis: "You can tell whether a company values informatics by looking at the departments from which its executives come, and seeing if any of them have informatics backgrounds."

	○ [Cybozu https://cybozu.co.jp/company/board-member/] The origin of the board members is clearly indicated. Many of them are information-related. Because of the large amount [see below https://scrapbox.io/nishio/%E5%BD%B9%E5%93%A1%E3%81%AE%E5%87%BA%E8%BA%AB%E5%AD%A6%E7%A7%91#5a65719faff09e0000e76fd4]
 × [NEC http://jpn.nec.com/profile/corp/executives.html] Profile starts with "Joined our company" [e.g. http://jpn.nec.com/profile/corp/executives/bio/n-endou. html]
 × [Sony https://www.sony.co.jp/pressroom/executives/] Like NEC, only information since joining
 × [Cookpad https://info.cookpad.com/corporate/management] It describes the previous jobs of the board members, but no information about their faculties.
 × [Nintendo https://www.nintendo.co.jp/corporate/officer/index.html] It only mentions the names of the board members.
  Tatsumi Kimishima, President and Representative Director Hitotsubashi University Faculty of Law
		Representative Director Shigeru Miyamoto Kanazawa College of Art (Industrial Design)
  Former President and Representative Director Satoshi Iwata Department of Computer Science and Engineering, Tokyo Institute of Technology
 △ [Preferred Networks https://www.preferred-networks.jp/ja/] 
 	He writes unexplored, not his home university.
	△ [Fujitsu http://www.fujitsu.com/jp/about/corporate/management/] From "Joined our company" as well as NEC
  The [executive personnel press release http://pr.fujitsu.com/jp/news/2008/05/23.html] states.
   Shudan Nozoe B.A. in Economics, Waseda University, Tokyo, Japan
 		Koichi Hironishi B.A. in Economics, Keio University
   Tatsuo Tomita B.S. in Physics, The University of Tokyo
   Shigeru Sasaki M.S., Information Engineering, Graduate School of Engineering, Iwate University
 [Saizeriya https://www.saizeriya.co.jp/corporate/information/outline/] only wrote the name.
 	Yasuhiko Masagaki, Chairman of the Board Department of Physics, Tokyo University of Science
  President and Representative Director Kazunari Horino Graduate School of Agriculture, Kyoto University

Additional Hypothesis for Nishio
	Companies that don't disclose the departments from which their executives graduated don't place much importance on the kind of professional education they received at university."
 It would make a difference if the founder was still alive or not."
 'I suspect there will be a difference in the distribution of departments between the founders and those who joined the company after it had grown and became executives.'
	If the distribution is significantly strange compared to the distribution of other firms (e.g., a concentration at a particular university), something special is going on."
  Personnel affairs, etc., in which academic cliques are used as a basis for judgment

 I hear there's a lot of stuff in the Toyo Keizai's Executive Quarterly.
  It doesn't say the price, but they will sell data.
   http://dbs.toyokeizai.net/products/list.php?category_id=12

 Cybozu
  President and Representative Director Yoshihisa Aono B.S., Information Systems Engineering, Osaka University
  Executive Vice President Osamu Yamada Graduated from Osaka University of Foreign Studies
  Director Shinya Hata Completed Master's program in Information Systems Engineering, Graduate School of Engineering, Osaka University
  Executive Officer Hideki Tsuji Graduated from Sundai Electronics and Information College
  Executive Officer ymmt Withdrawal from Doctoral Program, Department of Information Science, Graduate School of Science, The University of Tokyo
  Katsuhiko Matsumura, Executive Officer Completed Master's program, Graduate School of Science and Engineering, Tokyo Institute of Technology
  Executive Officer Yuka Nakane B.A. in Law, Keio University
  Executive Officer Tamotsu Hayashida Completed Master's program in Political Science, Graduate School of Law, Keio University
  Executive Officer Noriko Sekine Graduated from Yamawaki Gakuen Junior College
  Executive Officer Keita Kuriyama B.A. in Economics, Momoyama Gakuin University
  Executive Officer Tadamasa Hayashi Completed Master's program in Law and Politics, Graduate School of Law, Osaka University
  Executive Officer Teppei Sato Completed graduate studies, Department of Management Science and Technology, Graduate School of Decision Science and Technology, Tokyo Institute of Technology
  Executive Officer Shinnosuke Saito Green Mountain College graduate

