Contract forms for providing advanced expertise
 I think I saw a story once about using a mixed type of contract when contracting for [agile] development, not a contractor or quasi-contractor contract, but I'd like to see it again.
 IPA did a good job https://www.ipa.go.jp/files/000005404.pdf
 There was once a discussion about the appropriate form of contract for machine learning projects, and it is similar to agile development in the sense that it incorporates the possibility of policy changes through experimentation.
 However, the reality is that many large companies have weak knowledge acquisition strategies and have already been forced into a situation where they are unable to do so in-house, so they have to think about how to acquire knowledge from the external market. Therefore, we have to think about how to acquire knowledge from the external market.
 2018-01-24 [Twitter https://twitter.com/nishio/status/956011489822957568]

	PS
 	Why are "agile", "advanced expertise provision" and "machine learning" related?
		Why we need Agile is because we lack the ability to clearly determine requirements specifications in advance.
  If the ordering party can determine the required specifications, it is only necessary to develop according to those specifications, and there is no need for Agile.
  Agile is needed because humans cannot correctly determine requirements specifications in advance.
  In other words, Agile contracting provides a high level of expertise in "step-by-step refinement of specifications through implementation and experimentation.
  Development in machine learning is similar.
  We can only clarify step by step, through implementation and experimentation, the extent to which we can do this with the data we have at hand.
  These do not fit into a contracting agreement that assumes "what is to be made can be clearly defined in advance".
  It's [a false dichotomy] to make it a choice between a contractor or a quasi-contractor.

reference
 [Ruby/Rails Development Support Services - YassLab https://yasslab.jp/ja/agile]
 [System 39 | Joizo Corporation https://www.joyzo.co.jp/service/system39]


I think it's important [to avoid one-on-one relationships], but I haven't yet been able to articulate why well.
