Self-Management Strategies for Engineers_Draft
	[2018-03]-24 MANABIYA Keynote Address
	[Presentation Materials https://www.dropbox.com/s/iese0p9iq6y33hr/MANABIYA_%E3%82%A8%E3%83%B3%E3%82%B8%E3%83%8B%E3%82%A2%E3%81%AE%E3%81%9F%E3%82%81%E 3%81%AE%E8%87%AA%E5%88%86%E7%B5%8C%E5%96%B6%E6%88%A6%E7%95%A5.pdf]
	Lecture material [Self-Management Strategies for Engineers].
	[Self-Management Strategies for Engineers_Reference].

Do you want to move the memo before the lower creation arrival separately?

-----
 Outline of Lecture
  Many of you may say, "I don't understand or have any interest in business administration.
  And you are probably wondering, "Which is better to learn, Technology A or Technology B?
  It is the question, "What is the best return on investment of limited time?" and it is business administration that has considered this type of question.
  Some of you may say, "I am interested in business administration, but I don't know where to start.
  Rather than thinking about the management of an organization or corporation, it is easier to start by thinking about your own management, which is closer to you.
  In this talk, I will relate various management topics to the strategies of individual engineers in order to create a starting point for future learning.


	[Create opportunities for post-lecture communication].

[180308 note]
---- below is what I wrote around February ----.
 I'm trying to figure out what to talk about in my next presentation to IT engineers.
	[IT and Management] talked about information science for people on the business administration side.
 	There is value in combining multiple areas.
  Some said they wanted to hear from IT engineers.
 There could be times to talk about the business administration side of things for IT engineers.
 I've been asked a few times for advice on what I'd like to learn about business administration-wise, but what would be the best thing to do.
 	What specific needs do they have?
  Ask them on Twitter?
 If we use the term "business administration," many people may think that it is not relevant to them as they are not in the management team. It would be better to use "self-management" as a starting point so that people will see it as their own business.
  I was thinking more along the lines of "strategy" than "academics."

 Not interested in business administration
  Which would be better to learn, A or B?"
  It's about "what is the best return on investment of your limited time?
  Business Administration
 Interested in business administration, but don't know what to think about going there
  Manage yourself first before managing an organization or corporation.
	Aim to create a starting point for future learning

Self-Management Strategies for Engineers
Many of you may say, "I don't understand or have any interest in business administration.
And you are probably wondering, "Which is better to learn, Technology A or Technology B?
It is the question, "What is the best return on investment of limited time?" and it is business administration that has considered this type of question.
Some of you may say, "I am interested in business administration, but I don't know where to start.
Rather than thinking about the management of an organization or corporation, it may be easier to start by thinking about your own management, which is closer to you.
In this talk, I will relate various management topics to the strategies of individual engineers to provide a starting point for future study.

	postcapitalist society
 porter
 	hype curve
 	red ocean


	People who come to study groups = invest their time in acquiring knowledge, not in acquiring money.
  Be aware of your investment strategy.

I asked on Twitter.
 What kind of issues do people who want to study business administration want to solve?
  [https://twitter.com/hasegawayosuke/status/958562282619002886 hasegawayosuke] >The more engineering, the less specific the language of what the goal is and what the challenge is and what needs to be solved, the less specific the language of what the goal is and what the challenge is and what needs to be solved! How to do it is the issue I want to solve!
   It is impossible to completely verbalize in advance what the goal is, and as with agile development, it is necessary to repeat the cycle of experimenting with small units and revising the policy based on the results! (ref. Lean Startup)
   The term business strategy is used in many ways (ref. Mintzberg's [Strategy Safari]).
    There are those who say that you should plan well in advance, but perhaps the most comfortable group for IT engineers is the "you should experiment in small cycles to acquire knowledge" group.

 What is management anyway?
  I see management as "making decisions about what to allocate limited resources to.
  He believes that good management is "good management when the results of decisions are observed after the fact and the utility is high.
  	It's "observation after the fact," so it's impossible to know in advance what constitutes good management.
  Each person defines utility as he or she likes, whether it is money or employee satisfaction.
   So what is good management differs from person to person.
	It is like a person who has never written a program thinking about program design.
  Everyone is making decisions every day about what to allocate their limited resources of "limited time and money" to.
  This is naturally included in my definition of "management."
  I think it would be beneficial to use this as a stepping stone to consider


	Talk about [network formation systems]?
 	I've been talking about it in a dispersed way in relation to the unexplored, but I've never properly summarized it, so I'll take this opportunity to summarize it.
  Exchange knowledge and learn
  Create a network of exchange partners
  pay-forward
  	give&take begins with give
 Simulation of [Luck
  One big bucket vs. many small buckets
  [Luck after utility is satiated.
 Information accumulates in the hands of those who disseminate it.
  sow seeds
  [The Parable of the Tarantons]
	Important concepts are simple words, repeated several times

	[Niche Contingency Expansion Strategy] from [Niche Top Strategy].
  [Luck]

	[Create opportunities for post-lecture communication].

algorithm
 I'd like to combine the algorithms I've been writing all over the place in various lectures into one.
 Organizing the Story
 Many people are confused about how to determine Next Action for "Idea Generation" type tasks, which is basically a written method.
	It's important to encourage them to take action.
  It's easy to hear the end of the story.

#TODO