Intellectual production techniques for teams
[https://gyazo.com/91964440c42f3cd9daee4d50afd7647b]

 [Intellectual production technology of [team] - Introduction to [groupware] ([Blue Backs])
 [Fumio Mizoguchi] (Author), [Kiyoyoshi Kosai] (Author)
 [Amazon http://amzn.to/2nBiZ5F]

	Found while searching Amazon for "groupware" to introduce groupware-related books
 What is interesting is that this book was written in 1992
 	That is, a quarter of a century ago.
  It would be interesting to compare then and now and see what's different and what's the same #Look at the differences in similarities

 OHP projection device for Macintosh displays
 	Collaborate while sharing screens, great!
  → now
   The widespread use of projectors has made it easier
   A large monitor is placed in the conference room, connected to which slides are projected.
 After arriving at work, each employee turns on his or her dedicated computer, and within a minute or so, a notification appears saying, "You have received three e-mails.
  → now
   A portable computer called a smartphone is always on and always connected to the Internet.
   The flow of emails has increased dramatically [information flooding].
 Create sentences with a word processor
  No need to write by hand
  Repeated revisions won't leave you in the red.
  Intellectual Production Support
   The awareness that it is still just a shoulder to shoulder of simple tasks and not a full-fledged intellectual production support.
  Idea processor is a word processor that focuses more on the content development part of the word processing functions.
 The mouse may seem cumbersome, but once you get used to it, you'll feel like you're moving the arrows directly.
  → now
  	Mice are becoming more and more popular, in fact, touch screens are becoming more and more popular and mice are becoming less and less common.
	plotter
  Once written, it can be repositioned or resized after the fact.
  → now
   Some use PowerPoint and some use Excel graph paper.
   Some people use Illustrator, OmniGraffle, etc.
 database
  Mechanisms for handling information only
  Centralized data management allows for only one place to make corrections when corrections are made.
  → now
  	Various products came out.
   There was also Microsoft Access, but it didn't seem to be widely used.
   Web databases such as Cybozu's Dezie and kintone are being used by many companies
 file-sharing
 	→ now
  	Dropbox, Google Drive, etc.
 e-mail
  → now
  	Of course, it's still very much in use.
   In order to solve the problems caused by sending e-mails to specific addresses, the use of group chats, etc., as a place for communication among three or more people has become popular (LINE, Facebook Messenger, Skype, Cybozu Live, etc.).
   2010 [New Proposal from Cybozu "No-Email Workstyle" http://group.cybozu.jp/news/10092401.html]
 presence management

	KJ method with draw tool
  Not great due to screen size, frequency of updates, and resolution issues.

	The e-mail we use today can generally only send text messages."
  Seriously...
  Explanation that e-mails used by the institute can send attachments.
  Proofreading sentences is now easier.

 DTP
  The content sent by e-mail can be submitted as a manuscript as it is.
  If it's sent by facsimile, I have to type it in again."
  Unlike the phone, it arrives in my absence."
  Because the line between Kawasaki and Shinjuku still did not allow file attachments, the guerrilla was sent by facsimile, and the picture submission was sent by mail due to image quality.

[Communication] issues in [cooperative work
 Real-time and multimedia are important.
 Today, when we hear the word "multimedia," we think "hmmm," but when we hear that we could not attach files to e-mails back then, or that we could not send high quality images due to the connection speed, we realize how much we have evolved.
 "Attempts to improve the productivity of group activities as intellectual production activities by using computers to support communication within groups are gaining attention as groupware. p.71
 CSCW: Computer Supported Cooperative Work
interworking
 Software development in recent years has been at a remarkably large scale."
  Tripled in 15 years.
   1,000 as of 1989, 7 million lines.
   If it had grown at that rate, it would have 9,000 people and 63 million lines by now.
   >Development staff at peak times amounted to 7,000 to 8,000 people.
    [Mizuho Bank's system integration will start switching over in the fall of 2006 : Nihon Keizai Shimbun https://www.nikkei.com/article/DGXMZO19322120X20C17A7000000/]
   > Development of the Linux kernel has been very active. Version 2.6.30 has had 11,733 changes committed by 1125 developers in 3 months. It has added 1.14 million lines and removed 513,000 lines.
    [Become a Linux Kernel Developer! - Let's start small and get the hang of it: ITpro http://itpro.nikkeibp.co.jp/article/COLUMN/20090814/335535/?rt=nocnt]
  Collaboration in software development is important
 Cooperative work in the classroom


