selection and concentration
 Welch's strategy, the originator of "selection and concentration," was to eliminate inefficiencies within large companies that had become bloated through mergers and acquisitions.
 Closing unprofitable departments is famous because it is catchy, but creating [a place for communication] to eliminate [bureaucratic] processes was another way to shave off inefficiencies.
	The phrase "improved management by closing unprofitable divisions" is a rather cursory summary of his strategy.
 	It sends the wrong message, "It's important to reduce."
  In fact, it has not decreased because we have sold 250 businesses and acquired 370 businesses.

A strategy practiced by Jack Welch, CEO of General Electric (GE) in the U.S. in the 1980s.
 Cut all unprofitable businesses.
 Cleaned out the [bureaucratic] structure of GE at the time.
  What exactly did you do?
 	[Jack Welch [CEO, General Electric Company] | World Business Professional Management Edition | Diamond Online http://diamond.jp/articles/-/2139?page=3]
 		>Welch has turned his attention to the structure of the organization. He has been cutting away the extravagance of the organization, strengthening the capabilities of individual business units, and vigorously promoting the decentralization of authority throughout GE. The rock-solid management hierarchy that had been painstakingly built up over many years was thrown into the dustbin.
   >"Fight, hate, kick ass, destroy. Welch has openly spoken [anti-bureaucracy] to his employees.
  workout
   >Workout adopted by Jack Welch to break down the ills of bureaucratic organization
   [ref http://iandco.jp/%E6%88%A6%E7%95%A5%E3%83%A2%E3%83%87%E3%83%AB/%E8%87%AA%E5%BE%8B%E5%88%86%E6%95%A3%E7%B5%84%E7%B9%94/]
   [ref https://mba.globis.ac.jp/about_mba/glossary/detail-12067.html]
    >Workout is a method of organizational management at GE to realize a "boundary less company," which was introduced and implemented on a company-wide basis from the late 1980s.
    >Dozens of employees from various levels within the company gather for a two- to three-day
    1: Hold "town meetings" where people from various departments and levels can get together without paperwork.
    2: Examine the causes that make the job difficult
    3: Compare examples of improvements achieved with best practices
    [GE's "Sticky Note Method" will always solve problems! | PRESIDENT Online | PRESIDENT Online http://president.jp/articles/-/16518]
     An example of a specific operation

[https://books.google.co.jp/books?id=EX84DAAAQBAJ&pg=PA1992&lpg=PA1992&dq=%E3%82%A6%E3%82%A7%E3%83%AB%E3%83%81+%E9%81%B8%E6%8A%9E% E3%81%A8%E9%9B%86%E4%B8%AD+%E5%AE%98%E5%83%9A&source=bl&ots=HWvRlBhNu9&sig=Vt_TLYkGDPEUw6WYK6oV0sln6Nw&hl=en&sa=X&ved=0ahUKEwii7 PGE2YjZAhXITLwKHSFRC9QQ6AEIMjAB#v=onepage&q=%E3%82%A6%E3%82%A7%E3%83%AB%E3%83%81%20%E9%81%B8%E6%8A%9E%E3%81%A8%E9%9B%86%E4%B8%AD 20%E5%AE%98%E5%83%9A&f=false A rational but stupid strategy]
 Drucker: "Assuming you are not currently involved in that business, would you choose to start it now?"
  Larger scale through mergers and acquisitions without synergy in the 60s-80s
  Cost of increasing scale = [diseconomies of scale].
  	Specifically [bureaucracy], etc.

Very popular in Japan since the 1990s.

Case Studies in Japan
 [Why "Selection and Concentration" Fails in Japan? Successful Canon and Takeda's Clever Methods | Business Journal http://biz-journal.jp/2013/09/post_2821.html]
  >Canon has cut unprofitable divisions such as the personal computer business while maintaining the traditional lifetime employment system... Canon implemented a "selection and concentration" policy to focus management resources. Instead of firing employees, the seniority system was abolished and a merit-based wage system was approved by the union.
 	>Under then President Kunio Takeda's leadership, Takeda Pharmaceutical Company Limited (TPCL), in its 1995-2000 mid-term business plan, adopted a policy of "specialization in pharmaceuticals" and achieved results through "selection and concentration" by divesting unprofitable businesses.
  Scheme to transfer over 5 years
  	Form a joint venture with a term of about five years and let the partners have a majority stake.
   Eventual sale of holdings to partners


Before that, the opposite pattern [diversification] was in vogue.
A kind of pendulum