Early adopters and electorate
 It is harmful for [early adopters] and [speculaturs] to have [an elective mindset].
 [Democracy] was born and grew in power as a reaction against being ruled by a [minority] [aristocracy].
 Early Adopters and Speculaturs are in the minority.
 That idea of the superiority of a minority is an attack on democratic thought.
 It is harmful to cause internal conflicts in a situation where everyone has to work together to face "difficult challenges".
 Early Adopters and Speculaturs may prefer to make an appeal to the Majority and Ranches that they are inferior
  E.g. I am crazy and love [risk-taking]. I like to fantasize and I don't like a stable life.
  I can't think of an appropriate word to describe this, so let's call it a "[clownish] ideology.
   Image from [Court clown - Wikipedia https://ja.wikipedia.org/wiki/%E5%AE%AE%E5%BB%B7%E9%81%93%E5%8C%96%E5%B8%AB
   Clowns are not part of the hierarchical organization of the kingdom and are not punished for criticizing the king because they are madmen.
  Related: [borderline crazy].

	The pathology of the electorate
 	It's not right for early adopters to be elective in the first place.
  A person whose values are so far off the average that they take unreasonable risks earlier than average, so it's unnatural to think of them as being comparable to average sensibilities.
  Maybe that's an "early adopter pretender".
  Compensatory theory of insecurity
   People who choose the minority option because they really think it's optimal don't benefit from the electorate.
   They are not sure if they are making the right choice, so they try to find reassurance by thinking that they are the chosen people.
   [Self-esteem is impaired.
   To make up for it, they're dabbling in elective politics.
  brand-value theory
   Before the concept of early adopters, people who were the first to buy new products were indeed risk takers.
   It was risk taking, buying something that may or may not be worth it.
   If you see brand value in "I'm an early adopter who buys new products first," you are certainly an early buyer, but you are not a risk taker.
   The same cluster of people who buy expensive watches to show off to others.

 Even the term "risk taker" can have an elective rather than a neutral connotation for some.
  Just "people with lower than average risk sensitivity."
		Insensitivity!
