天才と秀才
I came up with a way to express the degree of genius and the degree of excellence in a mathematical model. For a given input, the correct output is determined by an unknown function, and the problem is to obtain the distance between the correct answer and the correct answer after a number of trials, and to obtain an answer as close as possible to the correct output. The genius level is the number of trials in a unit of time. When solving a completely unknown problem, a genius with a high number of attempts will naturally have an advantage, but if he/she is allowed to learn in advance, his/her score will be raised by the number of attempts, so that the longer the learning time, the higher the score of the genius relative to the other geniuses.

And then, tests are given for selection, but once the questions are given, they are used for learning data, so unless the scope of the questions is changed every year, the test becomes more and more favorable to gifted types as the years go by.

Both prior learning and trial-and-error can be expressed in a unified way by [the Gaussian process]. And unless the scope of the exam is drastically changed, sooner or later the geniuses with the ability to solve new problems will drop out and only the brilliant ones who can efficiently memorize existing problem-solution pairs will pass.
#要実験

I thought the quality of college students would not hold up sooner or later due to the decline in the younger population, but this may be worse than I expected.
As [signaling] loses its effectiveness from college admissions selection, firms will look for other signals that indicate "whether they can solve an unknown problem"

If we can create a trend where companies will hire you at a higher level if you have a track record of winning those types of proven selections, then you will have the option of investing your high school years to accomplish something, rather than investing them to get into college.

Companies can hire such people as high school graduates, and if they need specialized knowledge, they can pay for their tuition and send them to work as university students.
Why not have METI, not the Ministry of Education, develop the pipeline?
In other words, what is needed is to make a case for gathering high school students who are challenging questions that have no right answers, selecting those with high ability, having METI award them, and then having companies hire those awarded at a higher salary than new college graduates or pay their tuition to attend college.
Why not have a presentation of the best entries at the awards ceremony and then match them with companies? Under the pretext of protecting personal information, the Ministry of Economy, Trade and Industry (METI) will come in between and collect information on who the requests are being sent to.
There is a way to admit students through the AO examination, but there is also a way to make working graduate students who have worked for several years and whose working track record qualifies them to take the exam.
If you've been in the workforce for 3-5 years, there's no age difference between you and someone who went to a regular undergraduate program.

[Facebook https://www.facebook.com/nishiohirokazu/posts/10214484625285944]
