Revitalization Strategy for Japan
[https://gyazo.com/711e0741547a833d634b817173e65b7f]
	[Yoichi Ochiai]
 [Amazon http://amzn.to/2E8YLvd]

 I was thinking that the recent atmosphere of rushing ahead without regard for health and so on was like that of Yoshida Shoin, and then I saw Yoshida Shoin mentioned in the first three pages of the Strategy for the Rebuilding of Japan, and I thought, "I knew it...".

 [Work as Life]

 It is interesting that a peasant can have 100 different occupations, which is related to the current trend of promoting [parallel careers].
 Vertical integration of companies that make tangible goods was a product of an era when reducing costs between layers was more advantageous than [economies of scale] through horizontal integration of lower layers, and in smartphone apps, the network effect has made horizontal integration of lower layers so overwhelmingly advantageous that the platform strategy wins.
 The "[white-collar] uncle" problem is so excessive that I thought the only way to solve it was to kill him (or let him perish slowly because there would be a strong backlash if you do it too quickly), but they have devised a way to keep him alive, and it's smart.

	The [caste system] is actually a happy [warrior-farmer-artisan] from the theory that the [caste system] is actually a happy [warrior-farmer-artisan].
  Intention to drop the "merchants" who do not create anything new to the lowest caste.

 I can sympathize with the following: it is risky for high school students to choose a college without knowing the society, portfolio education should be provided to make them aware of the possibility of changing jobs, the number of ronin is decreasing but should be allowed more, the center should be stopped, etc.

	Take a position.
 Don't be a [critic].
 Face it fair and square.
 Move your hands.
 Earn your money.
 Don't have [uniform] [standards].
 Find your own value and love the [complex] things and the things that can only be done with time.
 Live without expectation, [thrilled] by all things, [despairing] of all things.
 Keep changing your standards of thinking tomorrow and the day after.
