Value of Choice
We are talking about a big difference between accepting 100% of random events and making choices according to [values].

Suppose that every day, random jobs are assigned to you. What difference will there be after 100 jobs if you accept all of them or if you accept half of the jobs that go in the direction that is favorable to you and decline half of the ones that go away? #Subjectivity
[https://gyazo.com/0ada95f96b8b74a8bbe2002c6c63e261]
The blue 0's are the peak peaks, the group that did not make a proactive choice, and the orange 40's are the peak peaks, the group that half refused. being near 0 is a situation of being mediocre, no character, no [career] building.

The effect of having a [choice to refuse] is very significant. Once you have a clear axis of your [values], you can move in the direction of your values by simply choosing and rejecting random events that appear on a daily basis, based on the criterion of whether or not to move in that axis. Compared to the distribution of the results of those who were influenced by the situation and did not make a [selection], the difference will be obvious after only 100 steps.

In situations where a minority group benefits, it is very advantageous to be in the minority. The reason is that if you are near the origin, the probability of profiting is low.
	see [worst environment for average orientation].

Suppose two random jobs are assigned to you on a daily basis; how is it different if you choose to accept the one that goes in your favor out of the two, compared to the "if it's not favorable, don't accept it" case above?
[https://gyazo.com/7dbbc22851b91ffddc9b801ccef9a7fc]
The one who chose between two options to undertake (blue) had an average value around 55. The expected value is higher for the one who chooses to perform the preferred task. Both choices are two options, "do/not do Task A" and "Task A/Task B," but the expectation value is higher when there are multiple task options.
This is due to the higher expected value of "do the more convenient" (blue: expected value 0.56) than "do not do when it is inconvenient" (orange: expected value 0.40) for the single task.
[https://gyazo.com/0b5b0d771071acce6f02f93bcad229c3]


In addition, of course, the three choices of "do Task A/do Task B/do not do Task A" are even better.
[https://gyazo.com/c3d6f1328314018a88e1fbe6e62e56c1]
Related studies: [quantity of options and quality of decision making].

Original Idea: It would be interesting to compare the distribution of a simple random walk with that of choosing between two random alternatives that are closer to one's values

Experimental condition, "random work" is a standard normal distribution with mean 0 and variance 1.
[Random walk]
