Academia and the Trap of Differentiation
from [差別化の罠]
Academia and the Trap of Differentiation
	Could it be that academia's novelty-oriented evaluation attitude promotes a differentiation trap?
		For short fixed-term employment
   The need to produce results within the employment period, and the risk an individual must take when investing time in a "radically non-traditional idea" that may or may not be successful.
  Is the peer review mechanism different from the market mechanism?
  	In the marketplace, a small number of enthusiastic fans can sustain a business even if the majority of customers are repulsed, see Hostile Brands
  	Is it difficult to continue research in academia that is repugnant to the majority of researchers in that field?
    Not really? I don't know, depends on the mood of the field.
    For example, at physics conferences, even occult presentations are given the opportunity to present themselves, but the room for such presentations is set aside.
  The composition is very similar: "Experts think there is a difference, but broadly speaking, there is no significant difference."
			Maybe the composition is a little different depending on who the "customer" is.
 			For companies doing business with the market, there are multiple "buyers" or "customers" who are willing to pay for their products
    For most researchers, the "buyer" or "customer" who pays for their research is the "employer" and not the singular
    	Except for professors who are doing a lot of joint research with companies.
    Five Forces by [Michael Porter].
    	The fewer buyers there are, the stronger the buyer's bargaining power becomes. Relatively speaking, your bargaining power becomes weaker.
 Q: Are you arguing that novelty is the most important value in academia?
		A: No. In academia, there are more people who value novelty than in business.
		Compared to business, where novelty is valued by a minority, and where the "time machine management" strategy of bringing successful American businesses to Japan and copying them is often successful, I think you would agree that academia values novelty more than business.
