Good engineers cannot be caught with money.
A story that came up while chatting.
 A good engineer has a way to get the money he demands. Therefore, good engineers will not come if you catch them with money."

Is this hypothesis correct?
 Unclear definition of "good."
	I think it's a detail by trying to represent it in a [mathematical model].

 Suppose an engineer's salary is determined by factors of skill and luck.
  In order to be able to attract competent engineers with money, "the element of luck in determining salary is quite high, and there must be 'excellent engineers who are unlucky enough to be paid low salaries.
  If you advertise a position with a high salary, you will get a flood of applications, so in order to select and hire competent engineers from the large number of applications, you need to be "able to filter competent engineers from the large number of applications.
  The first half implies "long-term employment but not discernible" and the second half implies "discernible with limited interview resources", an assumption that is too reckless....

	Company luck?
 	If this were also random, it would be no different than personal luck and structure.
 	Salary suppression bias due to company attributes is all that is needed.
  	It is also likely to be realistic. In companies with a long history of seniority, salaries of younger workers are suppressed in order to distribute them to older workers.



	Suppose all are willing to change jobs to earn a little more than their current salary.
 	unreasonable assumption
  The amount of social capital built up within the company will affect this travel cost.
 If the salary a person earns is determined by skill plus noise, the less skilled the person is, the stronger the inducement, no matter what amount is set.
 	In other words, the more you try to get good people, the more you need to select people from a large pool of applicants.
  Does the employer have the skills to select people?
  If a large number of people are gathered, it is possible to select good people by selecting from among them, but it is assumed that they have the skills to make the selection.
  Can we solve this problem in a different way?
	If you offer a salary high enough, with a small element of luck, and more than enough, and you have someone who is a decent connoisseur, you can hire them.

 There is no company that matches what I want to do.
  Engineers who are dissatisfied with the company but stay behind saying there is no company that matches what they want to do.
  Not particularly actionable.
  The same attitude of waiting for [a prince on a white horse] #even if
  Delusion that "someday the perfect opportunity (=prince on a white horse) must appear."
   That doesn't happen unless you're very lucky.
