Why are you so smart?"
I will be the keynote speaker at an upcoming event called [MANABIYA https://manabiya.tech/]. The organizers asked for questions for the speakers, and one of them was this
>How are you so smart, Mr. Nishio?
What is this question W. Someone who knows me must have written it as a story.

By the way, given that the list of questions I received includes questions about the total cost of the Ishikari DS and CSS3, I wonder if these questions were shared with all the speakers? Oh, stop it, you're embarrassing me.

My understanding is that most humans are humble in these situations. It is protocol to say, "No, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no, no. I'm ugly, I can't do the face-up Instagram thing, what should I do?" You get angry when you give constructive advice like, "If you're a virtual Youtuber, your face won't show. You have to say, "You're not ugly.

I have no intention of consuming the limited resources of my lecture time for such a sterile ritual, nor do I want to give the impression that I am an irreverent person by skipping the ritual, so I will not talk about this matter in my lecture.

On the other hand, "Are there any techniques that make you smarter?" It is quite interesting to think of this as a constructive question, and I have come up with three candidates, which I will present to you.

[# Sleep]
It is well known that lack of sleep makes the head very ill (SEE [Adverse Effects of Lack of Sleep]).
[Japanese people sleep the second shortest among the 29 countries in the world, after South Korea].
Personally, I also feel that lack of sleep slows down my thinking and makes it harder to get the words out.

[# Long-term storage of information].
What do you remember from the book you called two years ago? If you don't remember anything, it means that you didn't increase your accumulation for two years, which means that you are going backwards and forwards compared to your peers who are the same amount of years older.
Young people are more advanced when it comes to the hardware performance of the brain, so unless they accumulate more and more as they get older, they will only be at a competitive disadvantage.
I devoted a whole chapter in my book [intellitech], which will be out around June, on how to create long-term memory.

[# Wide view]
Being an information science specialist is an opportunity to be involved across many different fields. I'll use information in any field.
I didn't consciously do this when I was younger, but by continuing to attend Prosin and other unexplored events, I was exposed to unknown fields every year for about 15 years, and this worked effectively to give me a broader perspective.
It was through MUTOH that I decided to study technology management, and as a result, I am further deepening my learning by being involved in practical management issues that cannot be learned from books, etc., in the form of being a board member of MUTOH.
