Is 3D scanning of figures displayed at an exhibition and sale an infringement of copyright?
3-line summary
	Infringement of the right of reproduction.
 It doesn't matter if it is a 3D scan or not or how accurate it is, just taking a picture is an infringement!
 We should get permission from the copyright holders before we do any photos or 3D scans.

First, assume that the figure is a work of art and that the copyright has not expired because it was recently created.

Q1: "It's in the public domain, so it's okay to scan it, right?"
> (Use of publicly available works of art, etc.)
> Article 46 A work of art whose original work is permanently installed in an outdoor place as provided for in paragraph (2) of the preceding Article or a work of architecture may be used, regardless of which method is used, except in the following cases
This provision does not apply because the exhibition and sale is not "permanently set up in an outdoor location."

So let's consider infringement of reproduction rights.
> (Right of reproduction)
>The author shall have the exclusive right to reproduce his work.
This replication is defined as follows
>Article 2 (15) Reproduction means tangible reproduction by printing, photography, photocopying, sound recording, video recording, or other methods, and shall include the following acts with respect to the following items, respectively
Looking at Twitter, I see people arguing about whether or not to do 3D output after scanning, but taking the photo in the first place is a copyright infringement, right?

The discussion about scanning accuracy is also misplaced. If the content of the original work can be perceived by looking at the scanned image, it could be considered similar, so it would be considered similar even if it is not accurate enough to be output as a 3D image.
>The similarity of the subject matter to the original work may be judged by the standard of whether the essential features of the original work can be directly perceived from the subject matter or whether the subject matter is sufficient to make the content and form of the original work known.
[What is copyright infringement (METI/Ministry of Economy, Trade and Industry) http://www.meti.go.jp/policy/ipr/infringe/about/copyright.html]

Oh, some of you may be wondering about the word "tangible" in the definition of reproduction. The word "tangible" is an undefined term that appears only once in this part of the Copyright Act among all statutes. There are many cases of software piracy, for example, in which the right of reproduction is infringed regardless of whether the software is in physical form or not. If you think you can win, please go to court.

Other Q&A
 Q: Can I 3D scan an item if I purchased it?
 A: The purchase of an object is merely a contract to exchange money for that object, not a contract to license reproduction rights.
  So, it is an infringement of copyright as well as scanning exhibits without permission.
  However, if it is for personal use, it is OK.
   > (Reproduction for private use)
   > Article 30 A work that is the subject of a copyright (hereinafter in this Subsection simply referred to as a "work") may be used for personal or family use or other similarly limited use (hereinafter referred to as "private use"). Article 30 A work (hereinafter in this Subsection simply referred to as "work") the subject matter of which is the subject of a copyright (hereinafter in this Subsection simply referred to as "work") may be reproduced by the person who uses it for personal use or use within the family or other similarly limited scope (hereinafter referred to as "personal use"), except in the following cases (2) A work (hereinafter in this subsection referred to simply as "work") may be reproduced by the person who uses it for the purpose of personal or family use or other similar limited use (hereinafter referred to as "private use"), except in the following cases
  If you 3D scan, 3D print, and then sell it, it is clearly not personal use at the "sale" stage, so it is NG.
		By the way, it is not limited to 3D scanning, but it is also an infringement of reproduction rights to take a picture of a purchased item and post it on your blog.
  	I think it's done without a customary license, but it's the same state of affairs as someone making a customary unauthorized derivative work.
   It would be clearer if the seller wrote a few words saying, "I give permission to the buyer to take and publish the photos."
   If you want to ban 3D scanning, just write "3D scanning is not permitted."
   If nothing is written, it is "prohibited" by default.

	Q: What about secondary productions?
 A: The author of the original work has the same rights
  > (Rights of the original author to use derivative works)
  >The author of an original work of a derivative work shall, with respect to the exploitation of such derivative work, have exclusive rights of the same kind as the author of such derivative work has with respect to the rights provided in this subsection.
  The extent to which the secondary creator is obligated to manage the work depends on the contract when receiving the license from the original creator.
		For example, a case where "permission is granted only for sales on the day of the event".
   Unrelated to the 3D scan, for example, if a shoplifter steals something you were selling, are you supposed to be held liable for that shoplifter selling it outside of the day of the event?
   Taking it one step further, are you supposed to be responsible if someone who legitimately buys a figure from you on the day of the event sells it on an auction site after the event is over, etc.?
   If you are not sure, you have to check with your contracting partner and ask them to specify that they are not liable.

 Q: As an event organizer, what can I do if someone does 3D scanning?
 A: There are penalties for infringement of the right to reproduce.
  >Article 119 Any person who infringes a copyright, publication right or neighboring rights ... shall be punished by imprisonment with work for not more than ten years or a fine of not more than ten million yen, or both.
  and the current offender does not have to be a police officer to be arrested.
  >Criminal Procedure Code
  >Article 212 A person who has actually committed a crime or has completed the commission of a crime shall be the current offender.
  > Article 213 Any person may arrest an actual offender without an arrest warrant.
  > Article 214 When a person other than a public prosecutor, a public prosecutor's assistant officer, or a judicial police officer arrests a current offender, he/she shall immediately hand over the arrest to a public prosecutor of the district public prosecutors office or district public prosecutors office, or to a judicial police officer.
  Catch them in the act of copyright infringement and turn them over to the police officers.
  This may sound like an exaggeration, but it is the same as what you do when you find a shoplifter in a supermarket.
  But it's pretty expensive to do it after it actually happens, catching them red-handed and explaining the situation at the police station...
  So, just like posters to deter shoplifting, it is better to post "Unauthorized 3D scanning will be caught red-handed and turned over to the police" to demonstrate deterrence.

	Q: Is the copyright of the scanned data held by the person who scanned it?
 A: Yes, exactly. It is the same as if you took a photo and the photographer has the copyright to that photo.
  On the other hand, the existence of that copyright and whether it is legal to photograph and scan are two different things.

	Q: Are figures copyrighted?
 A: Yes, there is.
 	There are people who bring up the design system and say something like, "Isn't there a copyright on three-dimensional objects?" But the dividing line there is not "whether it is a three-dimensional object or not.
  First, let's look at the definition of a copyrighted work.
  > (Definition)
  > Article 2 (i) "Work" means a work that creatively expresses thoughts or feelings and that falls within the scope of literature, science, art or music.
		The reason why the design system is in place is that industrial products are not "within the scope of literature, science, art or music" and therefore are not copyrighted works.
  Figurines, on the other hand, are within the scope of fine arts and are works of authorship because they are creative expressions of ideas or emotions.
  Making a prototype is almost the same process as making a sculpture, isn't it? And since we duplicate so many of them, one might think, "Isn't that an industrial product?" But even novels are not one-of-a-kind works handwritten on manuscript paper, but mass reproductions made on a printing press and sold. In both cases, the copyrighted work is reproduced and sold.
