Auditing and Credit-Course Student Application Experience
 impetus
  Dr. Shiozawa's [/shiology] lecture was interesting.
  I learned more than enough in a 90-minute lecture, but people say, "Too little time to teach well.
  So why don't you just take the class?
  I confirmed with the professor earlier in the day that the Seikei University School of Law has a [non-degree student] system.
 procedure
 	Seikei University does not allow applications by mail, etc., and documents must be physically picked up.
  Documents will be distributed from 2/15-21, application period also from 15-21
 2018-02-11(Sunday)
  I met Mr. Shiozawa at the MITOU Demo Day and told him that I was planning to apply for a credited auditing course.
 Friday, 2018-02-16
  My wife asked me, "You need your transcripts from your previous university to apply for credited courses. I told her that I had the documents ready, but she threatened that it would take a long time to receive them even if I applied for them, so I wrote them in a panic.
  I looked closer and found that Tokyo Tech's website says that transcripts cannot be issued on the same day.
  My wife says to me, "I mean, [auditing student] is fine.
	2018-02-19(Monday)
 	Go to the Seikei University office to pick up your credited student documents.
  Once I was offered a non-degree student status, but when I asked "What is your purpose? I was asked "For what purpose?" and I said "I want to listen to more of Mr. Shiozawa's lectures because they are interesting," but I was recommended to be an auditing student here as well.
  As long as I'm taking it, I'd prefer to have evidence that I took it...
  They gave me a form for auditing, but just to be sure, I'm going to ask them to give me a credited auditing as well.
	2018-02-20(Tuesday)
  Tomorrow is the deadline for submission
  Still haven't received my transcript from Tokyo Tech at night.
  Give up and fall back to auditing.
  Auditing students need two photographs, an 82 yen stamp to be affixed to the return envelope, and a copy of the health certificate.
  They will be notified of the selection results on 3/16 and the deadline for payment of auditing fees is 3/31.
  Auditing fee is 40,000 yen
   Might be cheaper through Liberty University.
  It takes about 20 minutes to get to the station.
 2018-03-19
 	You will be notified that you have been accepted for auditing.
  Bank transfer must be made at the bank counter by the 30th
   They want you to bring a money transfer form that does not allow for convenience store payments, etc., and also a banker's stamped money transfer notice [Facebook https://www.facebook.com/photo.php?fbid=10214890741158587&set=a. 1175498944176.2027303.1129148772&type=3]
	2018-03-27(Mon)
 	Bank transfer at the bank counter
  I was a little unsure of where on the form I needed to fill in, so I didn't dare write anything.
  The person at the counter was very familiar with the process, and it didn't take long to fill out and submit the form as instructed.
 4/5 (Thu.) Orientation at the university from 14:00 for about 30 minutes. Receive your auditor's card here.
  6-401
  Food didn't come out easily at lunch restaurant, left station at 56 minutes, cab at 59 minutes, arrived at 9 minutes, 810 yen.
  [https://gyazo.com/3f264fa172b5cff02a25bd010642dea4]
		Classroom is 6-501
  They could use a library.
 Get up at 7:00 a.m. to go to class at 9:00 a.m.
 I'll try the concession stand and library on Saturday.
 	bus
   >5 minutes by Kanto Bus from bus stop No.1 or 2 at the north exit of Kichijoji Station / Get off at Seikei-gakuen-mae bus stop.
   [https://gyazo.com/3065ca27f6ef7cab44d56e26c1c626df]
  https://www.facebook.com/nishiohirokazu/posts/10215160848591104
 	It is no longer "[Seikei University experience]".
	library
 	Private booths can be rented by touching with a card.
  However, having used it twice, I personally would probably be more focused working in the open space of a library...
  I'd rather be in a cafe...
  I don't know if it's the lighting or the humidity, but my eye strain is terrible.
 Café under the classroom
