Think of an abstract
 Case studies of real-world problem solving for students who excel in competitive programming.
   Lecturer : Dr. Yasukazu Nishio (Director, Cybozu Labo, Inc.)
 　　Master of Science, Nara Institute of Science and Technology (NAIST); Master of Technology Management (Professional), Tokyo Institute of Technology
 　　Adopted by Unexplored Software Creation Project "Unexplored Youth" in 2002
 　　Author of "Technology Supporting Coding", "Natural Language Processing with word2vec", etc.
 　Title : "Solving Real-World Problems with Algorithms
 　Overview : What is the difference between solving a problem in competitive programming and solving a problem in the real world? The lecturer will use the truck delivery route optimization problem, for which he was involved in creating the algorithm, as a subject for explanation.

 Introducing case studies of problem solving with IT technology in the real world and how IT technology can change society for university students in the information field.
 Case studies of problem solving using IT technology in the real world and how IT technology is changing society for management students and working professionals.
		... "How Will AI Change Work?" as the theme.
  The type that does not just skim, but spends three times the number of pages to elaborate on a point.
  Aim to bridge the two fields by including both technical and managerial talks.

 For management students, especially those who are not necessarily programmers, the presentation will include examples of problem solving using IT technology in the real world and how IT technology can change society.
 	Case studies of how ICT is changing society.
  Is it the same as above?
  >Omnibus lectures by guest lecturers including those who are in charge of the actual business of companies that are innovating their industries through ICT.
 	We should include the story of [JA Miura].
   Information science is a cross-disciplinary force
   	go
   The abstraction of "information."
  The story of the Irodori system
  　Not technically amazing, but removed barriers to communication.
  If we talk about the C part of ICT, it is the parallel work made possible by advances in groupware.
			No parallel work = red ocean
   There is a blue ocean near the boundary of the company.
   Lower costs
   	[Lowering of activation barriers causes discontinuous changes].
