Learning History
When asked in an interview, I was curious myself, so I sorted out a bit of what I have learned and when. I am a transitional person. And I thought that because I had been "learning = producing some kind of output," I could put it all together like this later.

	2008 Haskell, ActionScript 3, Jython
 	[Blog post at http://d.hatena.ne.jp/nishiohirokazu/archive/200801]
  Published "Jython Programming" in April 2008
  [2008 slump]

	2009 TopCoder, Autism Spectrum, Erlang, Blender, Google App Engine, iOS App
  I was doing a lot of computer graphics stuff, from Context Free Art to Blender to SVG projects.
   Then I wrote a C++ program that directly hits libpng to render things that can't be rendered by the existing SVG renderer [Won an art contest http://d.hatena.ne.jp/nishiohirokazu/20090611/ 1244714716]
  I learned about a foreign card game called "Programmer's Nightmare," created my own card game, played it, rewrote the rules to my liking, and created new game rules: [Overview of "Battle of the Spaghetti Monster"].
		I was interested in the autism spectrum and did a lot of research.
   I was halfway through the certification process for the [Autism Spectrum Support Specialist http://www.autistic-spectrum.jp/publics/index/149/], but when I was asked to help with the facility's festival-like activities, I felt a mismatch with what I was looking for. I felt it was a mismatch with what I was looking for, so I quit.

 2010
 	Started reading Drucker around this time because of the [Drucker] boom → Entered the Department of Technology Management at Tokyo Institute of Technology in 2011
  Created a prototype that can recognize the position and orientation of a figure by placing it on an iPad capacitive touch panel.
		I'm Haskell'ing again.
  [blog post http://d.hatena.ne.jp/nishiohirokazu/archive/201001] would tell you more about it, but I'm bored.

	2011 Machine Learning
 	Implement machine learning algorithms yourself (rather than "using" them as a library) and visualize their behavior
  [Logistic regression implemented - Yasukazu Nishio's Hatena Diary http://d.hatena.ne.jp/nishiohirokazu/20111129/1322553293]
  [Estimating clusters of mixed Gaussian distribution model by k-means method, EM algorithm and variational Bayesian respectively - Yasukazu Nishio's Hatena Diary http://d.hatena.ne.jp/nishiohirokazu/20111122/1321925412]
   A tour de force!
  impetus
  	>In the spring of 2011, Nakatani initiated a study group to read PRML (a translation of PRML) in rotation within the company, as he thought it would be necessary for language processing.
   [Learning Machine Learning" at Junkudo when the wind blows - Cybozu Inside Out | Cybozu Engineer's Blog http://blog.cybozu.io/entry/654]

 2012 Alloy
 	The book "[Software Design by Abstraction - Formal Methods Starting with Alloy http://amzn.to/2tmakKH]" is interesting and difficult.
  [blog post http://d.hatena.ne.jp/nishiohirokazu/20120410/1334024972]

 2013 FPGA
  The Technology Behind Coding" Publication
  FPGA: [I made a life game with FPGA - Yasukazu Nishio's Hatena Diary http://d.hatena.ne.jp/nishiohirokazu/20130424/1366736980]
   I've dabbled in a lot of languages, but they all run on the CPU, don't they!" I've dabbled in many languages, but they all run on the CPU!

	2014 How to Learn
 	The feedback on the technology behind coding led to a lot of the columns being written about how to learn.
   [How Engineers Learn: Efficiently Gaining Knowledge and Linking It to Results: Special Feature｜gihyo.jp ... Gijutsu-Hyohron Co. http://gihyo.jp/lifestyle/feature/01/engineer-studying]
   [Kyoto University Summer Design School 2014] "Designing the Way We Learn"

	2015 Management Practices, Microcomputer
 	Appointed [http://d.hatena.ne.jp/nishiohirokazu/20150930/1443583326] as a director of [General Incorporated Association Unexplored http://www.mitou.org/index.html]
   I had studied management at Tokyo Tech and wanted to put it into practice, but I didn't have any entrepreneurial ideas, so when I was approached, I accepted.
		[Why can the IO pins of a microcontroller be used for both input and output? https://www.slideshare.net/nishio/io-52977913]
   I was curious about the principle of operation of the IO pins of the microcontroller, so I built it with transistors.

 2016 Management Practices (continued), IoT, Intellectual Property Rights
 	Participated in [Unexplored IoT Development Camp #1 - Yasukazu Nishio's Hatena Diary http://d.hatena.ne.jp/nishiohirokazu/20160614/1465891550]
  I became a [second-class intellectual property management technician. - The Hatena Diary of Yasukazu Nishio http://d.hatena.ne.jp/nishiohirokazu/20161127/1480251465]
   I took a class on intellectual property at Tokyo Tech because it was interesting.

 2017 Parallel Work, Reinforcement Learning (January -), Quantum Computing (December -)
 	Begins Machine Learning Technical Advisor at B-Ploud
   ["Even if the remuneration was zero, I was doing double work" - Why Yasukazu Nishio did not quit Cybozu Labs and started working as a technical advisor for machine learning | Cybozu Style https://cybozushiki.cybozu.co.jp/articles/m001358.html]
  [Reinforcement Learning]
		[Programming a quantum computer]

 2018 Quantum Computers (continued), Civil Law
