Specialist and Generalist Games
Understanding [specialist] and [generalist] strategies with the [game] metaphor. #Management game

	There are six squares. There are six coins.
 The squares symbolize areas of knowledge and the coins symbolize the time invested in knowledge acquisition.
 Consider a game in which coins are stacked on these squares to compete with each other.
 Now what strategy is advantageous?

	Favorable strategies vary depending on the conditions of victory.
 Winning condition type 1:
 	The number of coins in the square with the most coins is the winner.
 Favorable strategies in this case
 	Of course, pile all the coins in one square.
  This is expressed as 600000.
	This is the specialist strategy

	Winning condition type 2:.
 	You don't know in advance which squares will be played with which number of coins.
  After you finish placing the coins, roll the die to determine the squares to be used for the game.
	111111 is more favorable than 600000. 5/6 chance of winning.
 This is the generalist strategy.
 However, an interesting phenomenon
 	11111111 is not the only one, for example, 222000 and 11111111 are a 50-50 match.
   The risk of losing by going from 1 to 0 in one square with a probability of 1/6 is balanced by the cost of going from 1 to 2 in another square and winning with a probability of 1/6.
  320100 or 220110 against 222000 would be 2-1-3; by going 2 -> 0 you take the risk of losing at 1/6 chance and by allocating it to two fields you win at 2/6 chance.
  A more extreme example would be a three-way game where 002211 wins over 221100, then 110022 wins over it, then 221100 wins over it. Rock-paper-scissors.
  In other words, the axis of "absolute advantage" has disappeared.

Let me pull you back to the real issue.
	Specialist strategy is advantageous in situations where the job description is clear and you apply for a job in your area of expertise and get hired if you are the best among applicants.
 	However, jobs must be available in all fields.
  If there are no jobs in your field of expertise, you're out of options.
 Is the generalist strategy advantageous in graduate-hiring situations where you belong to a company and know after the fact what jobs you will be assigned within the company?
  Unless it's a company that will hire you even if your other areas are below average for applicants by promoting your strengths.
  A point reduction system requires that all areas be below average.
