Parable of the Summer Cicadas
[https://gyazo.com/5d167636a71637ebe424a99f9d7da8dc]
2020-06-13 [How to deal with other people's words] p.5

---
Greetings 2018-03-11
Tweet that came through @kensuu's retweet
>Get used to being hated. If you take a position, you will be hated 100% of the time. No one wants to be disliked, but you can't avoid it, so it's useless to think that you don't want to be disliked. Don't worry about it, just take a position. If you don't take a position, you won't be hated, but you won't be liked either. You won't make enemies, but you won't make friends either. The most important thing in life is one friend rather than a hundred enemies.
 [Twitter https://twitter.com/badassceo/status/971673946046124032]

There is a kind of sympathy among those of us who have experienced this, like "yes, there is that", but I don't think people who don't take a position for fear of being disliked will sympathize with this expression.

I describe this kind of thing as "the same as cicadas being noisy in the summer.

In summer, cicadas are noisy with their chirping. This is a [natural phenomenon] that is repeated every year.
Similarly, when some [output] attracts [attention], people will say [negative] things about it, a natural phenomenon that has been repeated often.

If you go around killing cicadas one by one because they are noisy, they will not quiet down at all. The effect is not worth the effort.
Similarly, if you respond to someone who says something negative, for example, "That's a criticism based on a misunderstanding," or "Isn't this part of your argument strange?" It is not worth the effort. It is not worth the effort.

Some people may think that if negative people are going to appear, it would be better not to engage in attention-getting activities. And there are those who think such a way of thinking is a waste of time, and that is why I am trying to persuade them repeatedly with various expressions like this. My way of persuasion is like this.
'The cicadas are so loud in the summer, there's no way to quiet them down. So what do you do? Would you retreat to a place where you can't hear the cicadas all summer?" Yes, cicadas are loud, but if you accept that that's the way it is, you'll soon get used to it and it won't matter. No one is frightened by the sound of cicadas every summer.

In light of this, look again at the opening sentence.
>Get used to being hated. If you take a position, you will be hated 100% of the time. No one wants to be disliked, but you can't avoid it, so it's useless to think that you don't want to be disliked. Don't worry about it, just take a position. If you don't take a position, you won't be hated, but you won't be liked either. You won't make enemies, but you won't make friends either. The most important thing in life is one friend rather than a hundred enemies.
My own expression is: "Get used to the cicadas being noisy. In summer, cicadas are 100% noisy. You don't like them, but you can't avoid them, so it's useless to think about them being noisy. I think that's a good point.

remarks
	Cicadas die quickly.
 Note that you may be surprised when you approach a fallen cicada thinking it is dead and it suddenly starts rampaging.
 Cicadas are just noisy, [no one has ever died from a cicada attack].

#Parable
