Case studies of how ICT is changing society
2018-04-17
 ICT and Industry."
  [東京大学大学院経済学研究科・経済学部 http://www.e.u-tokyo.ac.jp/]
  Omnibus lectures with guest lecturers from companies that are innovating in the industry
  Students attending the course are mainly graduate students of the Graduate School of Economics
  On a PC, you can Start Presentation from the note icon on the right.

[https://gyazo.com/9e04ce553ccbe8f0b4ba226d7a58fde7]
Case studies of how ICT is changing society
Omnibus Lecture "ICT and Industry", Graduate School of Economics and Graduate School of Economics, The University of Tokyo, 2nd@2018-04-17

Senior Researcher, Cybozu Labs/Specific Associate Professor, Tokyo Institute of Technology
B-Ploud Technical Advisor / Director, Unexplored Incorporated Association
博士(理学)/技術経営修士(専門職)西尾泰和

[https://gyazo.com/7a6e6576a206187ee2415033c549e191]
Facebook private group 2
After-sales service after class
(share lecture materials, supplement, answer questions, etc.)
A Facebook group has been created for

[https://gyazo.com/ea8982860a45568f6a1df886260fdc62]
自己紹介　3
Experimenting with my own work style
 東京工業大学 特定准教授
 一般社団法人未踏 理事
 B-Ploud Technical Advisor
 Senior Researcher, Cybozu Labs
Double jobs ([parallel work]) instead of side jobs (sub-work).

[https://gyazo.com/cf78bf843bf9cc1ff433a8b46d9615d8]
著書　4

[https://gyazo.com/c322e18532cb58c5138657f182c3a7bc]
Technologies Supporting Coding 5
Launched in 2013
Focus on knowledge that is less likely to become obsolete
Five years later, it's still selling.

[https://gyazo.com/ea208b30f5f97d6dd502cc646d5ff329]
小学生向け　6 
Co-author with Mr. Kawai (a colleague) of "30 Days to Build Your Own OS! Co-author with Mr. Kawai (a colleague) of "Introduction to OS Homebrew".
A book like "The Technology Behind Coding" for elementary school students.
Released 2018-03-28

[https://gyazo.com/fb0eb8a7080887d081bea53823d47133]
東京工業大学特定准教授　7

東京工業大学環境・社会理工学院
Innovation Science
技術経営専門職学位課程特定准教授

Social changes brought about by ICT technology
(especially changes in organizational structure and the nature of intelligence) are of interest!

[https://gyazo.com/847215778666f9c389a4361408e952f0]
一般社団法人未踏理事　8 

-What is unexplored?
-What is a General Incorporated Association?
-What is a director?

[https://gyazo.com/1aadc1929d3eb1503ccc2f7149e501ba]
What is an unexplored project?　 9

経済産業省所管の独立行政法人
Information-technology Promotion Agency, Japan (IPA)
Identification and development of outstanding IT human resources

Over 1600 graduates as of 2000
Excavation alone will dissipate. We need a nuke.

[https://gyazo.com/578a5b1cdbf076911241f2e4923e7914]
一般社団法人未踏　10 

In 2014, we will focus on graduates of the Unexplored
With the cooperation and support of various people
General Incorporated Association "Mito" is established.

理事・監事:
What is a General Incorporated Association?
Corporations that have eliminated the right to distribute profits from joint-stock companies (and instead pay lower taxes).

What is a board member?
A position in charge of corporate decision-making (director in the case of a stock company)
Mr. Kuchii of the 4th is not a board member due to his day job, but he has been advising us on the management of the program.

[https://gyazo.com/306682ad106ac5be8a1d9ab7ffca1ad8]
11

[https://gyazo.com/b6ae093d0eecb631fc07676ec7b3c504]
一般社団法人未踏の目的　12

Cross-industry network of creative talent
↓
IT-centered innovation

"An incorporated association established to accelerate IT-centered innovation by providing multifaceted support for creative human resources and creating cross-industry networks, led by alumni/alumnae of unexplored projects." http://www.mitou.org/

[https://gyazo.com/29889d70dbb7a4bdb8edfba391b93927]
Collaboration with Unexplored for the Development of the Japanese Economy 13

2017, at the "Unexplored Night" event hosted by Unexplored, Inc,
Opening remarks by METI Minister Seko to the effect that he would like to collaborate with METI and MEXT.

Minister Seko: "As the Ministry of Economy, Trade and Industry, we are not merely supporting the project,
I hope we can work together and inspire each other to do our best."

Yoichi Ochiai, "Minister of Economy, Trade and Industry Seko, in his opening remarks at the "Unexplored Night.
Elimination of Age Limit and Expansion of Budget for Unexplored,.
On regulation and deregulation to foster entrepreneurial soil
The Ministry of Economy, Trade and Industry (METI) has announced that it will work on this issue.
It was worth it to talk to the unexplored creators and ministers at the General Incorporated Association Unexplored! Wonderful . #Unexplored Conference
https://twitter.com/ochyai/status/840153093933154305

[https://gyazo.com/9e9d7c4fadcddce036892ea5f123f1f0]
自己紹介　14
Half done.
•東京工業大学特定准教授
•一般社団法人未踏理事
Technical Advisor, B-Ploud
-Senior Researcher, Cybozu Labs, Inc.

[https://gyazo.com/83cfcf16e89a22a96c75ba076876efdd]
B-Ploud Technical Advisor 15

[https://gyazo.com/9ad980597d7de6ed1acd3d63a5ff256c]
Supervision of PyQ Machine Learning Course 16
Learn machine learning from scratch, even for beginners, under the supervision of Nishio.

[https://gyazo.com/dd4565752444ccee8ae74d5867a78896]
See also: "From if Statements to Machine Learning." 17
For audiences that are not familiar with machine learning,
A talk on the ground by going step by step between if statements and machine learning was sponsored by B-Ploud.
Points to keep in mind when using machine learning in practice in the second half.

2017年9月公開以来、
Over 80,000 views of popular lecture materials
https://www.slideshare.net/nishio/if-80195170

[https://gyazo.com/70e0dcff6576cb2d1b95711c8f2e46e4]
B-Ploud's coverage of duplicate work 18
https://cybozushiki.cybozu.co.jp/articles/m001358.html

[https://gyazo.com/065f99aa13a9e5662e8f3fe2331d9b77]
Dual jobs speed up the learning process 19

[https://gyazo.com/876edf40afabfd1a82d25dcb98594097]
Senior Researcher, Cybozu Labs 20
Research department of a company called Cybozu
Medium- to long-term research and development at "Cybozu Labs
D. in 2007, and after a one-year post-doctoral fellowship at the University of Tokyo, he joined the company as a new graduate or a mid-career employee, I'm not sure.

[https://gyazo.com/41702c092a4cb10f7264b48b387df40c]
What is Cybozu? 　21
What kind of company is "Cybozu" that allows its employees to do this kind of double work?

[https://gyazo.com/1aaf339265aea98d0befc4e8f24cd82a]
22 when I looked at their website to introduce them.
What kind of company is this?

[https://gyazo.com/77993d307bf1c3f01db6b2e2808921c4]
We make a product called kintone... 23
You may have seen it in the ads in Tokyo Station and other places.
But maybe "Kintone" and "Cybozu" are not connected?

[https://gyazo.com/77231f433a363ccc3c57af182fc11644]
In all seriousness, let me explain 24
-20 years in business (listed in 2000, TSE First Section since '06)
-No.1 share of the domestic groupware market (11 consecutive years)
-Over 10,000 companies and 350,000 people use the cloud (cybozu.com) alone.
←Cloud
←Cloud
https://cybozu.co.jp/company/job/recruitment/business/

[https://gyazo.com/6d1143c336fcec26a8b21fda6fbc0ab2]
Global Expansion 25
San Francisco, Los Angeles, New York
Shanghai, Shenzhen, Taiwan, Ho Chi Minh City, Singapore
Philippines, Indonesia, Thailand, Myanmar India, Sydney
https://cybozu.co.jp/company/job/recruitment/global/

[https://gyazo.com/18a0af1ef539bec807e145b4108d3c83]
Platform　 26
Japanese companies have not been able to create a platform,
Is there any debate as to why?

[https://gyazo.com/561fd0390f10d5cc2c60cc0b8fab1aad]
Platform 27 http://group.cybozu.jp/news/16042501.html

[https://gyazo.com/8254de4404fcf2931adef4de200e31fe]
Platform 28 
-A report by Gartner Inc. of America
•aPaaS(application platform as a service) 
-One of the major enterprise vendors and the only Japanese company to be listed.
http://group.cybozu.jp/news/16042501.html

[https://gyazo.com/2a8858d2b8ca7191db3597680c78be62]
Platform 29
https://topics.cybozu.co.jp/news/2017/07/14-4153.html

[https://gyazo.com/84ae440d588e64ad2123ddc1dfaebec8]
Platform 30 
-kintone, a cloud-native web application development platform
-2017 addition to the Enterprise High Productivity Application Platform
-Named one of the 14 leading vendors by Gartner
https://topics.cybozu.co.jp/news/2017/07/14-4153.html

[https://gyazo.com/438fecc2f5cb686deb9548b91c15666f]
事実と解釈　31 
-Cybozu internally emphasizes the distinction between fact and interpretation.
-It is true that there are people who interpret "Japanese companies are not able to create platforms" in this way.
-Gartner interpreted "Cybozu is one of the 14 major vendors that make the Platform". It is true that they are publicly announcing this.
-Whether you are in fact creating a Platform depends on the definition of Platform. I am not going to argue. I will present concrete facts.

[https://gyazo.com/9ed09fbd7bf585beec2abca769a1c673]
Case Study: IRODORI System 32
-In the depopulated and aging town of Kamikatsu, the leaf business, a "garnish" of Japanese cuisine, has annual sales of less than 300 million yen, and one grandmother earns 10 million yen a year.
-The elderly harvest and ship "leaves" using tablets and PCs to monitor the national market.
http://www.irodori.co.jp/asp/nwsitem.asp?nw_id=2&design_mode=0 https://www.amazon.co.jp/dp/4797340657

[https://gyazo.com/80fbd52399d9cb78d7f4837ed9be1249]
33

[https://gyazo.com/8b08524e43b84f54f5896bbd7d68db09]
The Birth of Markets through Information Systems 34
-Information systems have facilitated the distribution of information.
-Timely production by immediately communicating demand information to suppliers.
-Timely production increases demand.
-Positive feedback occurred and a $300 million market was born.

[https://gyazo.com/5969a8c7eceb8281923e7a3a4a3b4257]
Case Study: Miura City Agricultural Cooperative's Dispatch Scheduling System 35

[https://gyazo.com/f17726d8a4581204938ec51f088a8a62]
「出荷作業8時間を1秒に」三浦市農協で起きた驚異の進化　36
http://wedge.ismedia.jp/articles/-/12062

[https://gyazo.com/fd27f971f30942a4ae49b4266bc3401f]
Algorithm eliminates 8H work 37
- "Preparing delivery schedules for shipments, which is one of the most troublesome tasks in agricultural cooperatives."
- "A task that used to take eight hours a day takes only one second."
- "proprietary algorithms."

I created this algorithm.
The amazing evolution that took place at the Miura City Agricultural Cooperative, which "reduced eight hours of shipping work to one second.
http://wedge.ismedia.jp/articles/-/12062

[https://gyazo.com/f87bf625d3d5a1b726c578aa1236c2f4]
What is "Create Delivery Schedule" 38
- "Knowing the quantity of shipments that will be shipped from the farmers the next day,
We determine the quantity of shipments for each destination, such as a market, and how the cargo is to be divided among the trucks of which carriers."
-The creation of a dispatch schedule takes 8 hours for a mid-level staff member and 56 hours for a seasoned veteran.
-Young staffer: "I can't do this as well as I should."

The amazing evolution that took place at the Miura City Agricultural Cooperative, which "reduced eight hours of shipping work to one second.
http://wedge.ismedia.jp/articles/-/12062

[https://gyazo.com/0dcb761f966841ed571e7b356a74887d]
Is it wrong to say "AI will take our jobs"?　 39
-Some people use the phrase "AI will take away jobs" with a negative nuance.
-This time it took away 8 hours of work a day, enough for approximately one human being...
-Mr. Masayoshi Iijima, assistant general manager of the cooperative's sales department, said, "The biggest thing is the reduction in working hours. I am hopeful that it will reduce the workload of the staff and that they will be able to use their free time more efficiently for sales and other activities.

[https://gyazo.com/1d4cfb8a226efc39277fe55394ff8a54]
Population Pyramid 40
出典:国立社会保障・人口問題研究所
http://www.ipss.go.jp/site-ad/TopPageData/pyra.html

[https://gyazo.com/81aa595a870f2813faaa5d2cedf44575]
Population Change 41
I and the generation younger than me grew up in an environment where the number of people was reduced every year.

[https://gyazo.com/29a52770804e3646f73075d070deb0d0]
1 in 7 will disappear 42
Over the next 15 years, the population in its 20s will decline by one in seven.

[https://gyazo.com/f2cdefc4941aa7a700f88c9e6b65dfeb]
When one in seven people disappear... 43
The work we are doing now with our 7-person team,
If the age structure of the team remains the same, in 15 years we will have to do it with 6 people.

If workload remains the same, workload per person will increase by 17%.

A person working 20 days x 8 hours per month would have a 17% increase in work, +27 hours per month.
Overtime +1 hour every day or -3 days off every month

[https://gyazo.com/8db3e3aa4220c64a7358fbf36db1db9c]
What is status quo 44
The "same way we've always done our jobs" is not the status quo.

The human load will increase and work will not get done.

To keep the work turning around without further increasing the human burden,
One in seven jobs will need to be "taken by AI.

[https://gyazo.com/2fc7776a41178a84cb34d9a3b9c80c2b]
1 in 3 gone 45

In the 15 years since 2000, one in three has disappeared.
I should have been "out of a job" sooner.
Lamenting the past is futile, so we do it now in a big hurry!

[https://gyazo.com/84203e714abc3da2c5b3b761fb9aced0]
What is the bottleneck?　 46

[https://gyazo.com/d5713edfd11986c134498eeec96a818a]
What is the bottleneck?　 47
-No data.
-Data not digitized.
-Even if the data is digitized, it's not pretty enough to use for analysis.

[https://gyazo.com/85eeafd3f1b0a200ac9017400b7a47dc]
Differences between machine learning competitions and the real world 48

Machine learning in machine learning competitions (such as Kaggle)
Neatly organized and ample amount of data -> machine learning -> results

Machine Learning in the Real World
Data collection → cleanly organized and sufficient amount of data → machine learning → results

[https://gyazo.com/b89645ccbbc4079461568d4f2e41fdef]
Mechanism for obtaining clean data 49
A mechanism to obtain clean data is needed.
When lecturing to information students, you should
```
The real world is largely made up of people, and computer programs are only a small part of the mix.
```
but this is the economics department, so you know what I mean, right?

[https://gyazo.com/ace58c84599ce4d0d9661ec72a3eae0c]
Incentives are needed 50
-Mouthing the words, "We need data," doesn't make data collection go any further, because it's more work.
-If eight hours of work is reduced to a fraction of a second and work is reduced, then people will spend more time collecting data.
-This will begin to gather data.
Data collection -> enough data neatly organized -> solve -> results -> back to data collection

[https://gyazo.com/e91815df910a24ed7eb747f3089f5831]
Bad Cycle 51
-Clean data is a management resource.
-but those who don't have the resources don't get value from them.
-As a result, investments that use other resources, such as people and time, to have that resource appear unattractive.

[https://gyazo.com/13f852f16b45761ca1665fff8f1f4486]
Good Cycle 52
-Create incentives for data collection
-Begin to collect data
-Accumulated data generates tangible value.
-Increase in value of data collection = incentive

[https://gyazo.com/c8a3d9cdeee3d240636050a0ad370acd]
Mental models of incremental growth 53
-Do not try to create a finished product from the beginning, but rather "plant seeds" that can grow into a large product in the future.
-Small start: Smaller first steps make it easier for customers to take the first step.
- "Minimum viable product" (MVP)*.

Eric Ries, "The Lean Startup."

[https://gyazo.com/6f4adb7c9520393fc05b99c916b41651]
Summary so far 54
-Information distribution creates value.
-Accumulation of information creates value.
-In both cases, start small and grow big.

[https://gyazo.com/bb27349299809104d5e0fa0a94486670]
Organizational Structural Changes with ICT 55
Once we've gotten to this point, we've foreshadowed the story.
Here's something else to consider.

[https://gyazo.com/f1350516d05fc013149d19d971c65609]
What is groupware?　 56

[https://gyazo.com/554553676509245ad2d46f43c3c35719]
What is groupware? 　57

Group + Software
Software for use by multiple people.

[https://gyazo.com/1deb4809e44e3e808048e26622b6cb43]
What is it used by more than one person for?　 58

[https://gyazo.com/17e38ebf828715aaa619dc76fa683632]
What is it used by more than one person for? 　59
情報の流通
情報の蓄積

[https://gyazo.com/dede2f6e4ba5ce6c2dd3ad4b770c4642]
情報の蓄積と流通　60
In the place (space) called "2018 New Employees" on kintone that Cybozu uses
This year's new employees write about various things on a daily basis, and other employees comment and "like" them.

I was in Cybozu Office on April 3, 2007 at 16:55.
I created a place (bulletin board) called "Nishio's own thing" and started to write various things on my own.

Then there have been 22376 posts so far.
It is also possible to connect from here and now to see what a new employee (me) was thinking every day 10 years ago.

[https://gyazo.com/b75f14686f23b0e0399a796e5cc58217]
Organizational Structural Changes with ICT 61
Information distribution and information accumulation occur with the introduction of groupware.
In considering what effect this will have, let's compare it to the past for a moment.

[https://gyazo.com/e2029e31afdb0e9939ecb1ef8df7486f]
Thought experiment: communicating information to a large group of people 62

Large-scale organized agriculture was practiced in Mesopotamia around 3500 BC.

Mesopotamia uses a lunar calendar, and the calendar and seasons do not correspond well.

In order for a large number of farmers to sow their seeds at the correct time
We need to get information from people who can observe astronomy to a large number of farmers. How can we do this?

[https://gyazo.com/e5fa81c16e7ef9f1259a1c6590803c93]
Thought experiment: communicating information to a large group of people 63

Information and communication technology was not well developed at that time, and information communication was mainly done by [flesh and blood],
The amount of information that a human being can process in a unit of time was the bottleneck of communication.

To make it easier to understand what this situation brings
Let's take the constraint to the extreme and assume that "one person can only interact with four people".

How can information be communicated to a large number of people under these conditions?

[https://gyazo.com/afa3723a52d457c8a056abd48db645c4]
Tree structure generation 64
 Put in place a "middle manager" who receives information from one person and communicates it to three people.

[https://gyazo.com/eed3781b4c0bf505ea0ff5837c22a5ac]
Role assignment by hierarchy 65
A) Those who decide "what to do" (when, what and how to do it)
B) Those who tell you exactly what they "do".
C) People who do exactly what they are "supposed" to do.

The person at the top decides what to do, and the person in the middle accurately communicates it,
Mental model of a "hierarchical organization" that is executed precisely by the people at the end of the line.

[https://gyazo.com/bd027047a0694586d6a1f8b607a68395]
情報伝達力の改善　66
Right now I'm communicating to about 50 people.
Gathering at the same place at the same time allows for more efficient communication than talking to each person individually.

Even ancient Rome used to communicate information through speeches.
Microphones and speakers allow the message to be conveyed to an even greater number of people.
Adolf Hitler could reach more than 1,000 people by using a microphone.

[https://gyazo.com/701d073d81ae501724958b5617b1f226]
Eliminate location restrictions 67

You don't have to be in the same place if you relay the video.

Cybozu has offices in Osaka and Shanghai, though,
Monthly company-wide events can be video-streamed and viewed from remote locations.

Historically, synchronous media without location restrictions came in the form of radio and television, and then the dramatic decrease in communication costs due to the Internet made it possible to broadcast video without a TV station.

[https://gyazo.com/d77a9a33ae3175495015988cea0ecf2f]
Eliminate time limits 68

If you put the videos on a server, you can watch them whenever you want.

The "at the same time" constraint is also eliminated. Communication is possible even when times do not coincide.

Moreover, it accumulates.

Of course, before the video servers, there were forms of posting "gochisho," which used text, and extra newspapers.

[https://gyazo.com/c42744d973326acf6cc7876be12eb18d]
Lower cost of information dissemination 69
-Video broadcasts are expensive in terms of equipment and manpower, but low-cost in terms of information dissemination through text.
-Information dissemination increases by creating a place where anyone can disseminate information without complicated procedures.
-The proliferation of smartphones with cameras makes it easy to attach photos and videos.

Who doesn't know about Twitter?

[https://gyazo.com/040e5420cfadbb6be93ccd097b072130]
Summary so far 70
Hierarchical organization was beneficial in communicating information on a large scale in situations where information and communication technology was not yet developed.
Advances in information and communication technology have lowered the cost of information transmission and dissemination.

[https://gyazo.com/7e765a045ea21bc1dbb4f83aa539e614]
Is it normal?　 71

I was a college student in 2000,
Students had group chats with each other via the Internet and would discuss late into the night before reports were due.

I suspect that today's students are also using some tool to distribute similar information.

These information distribution tools were commonplace when people who are 20 years old now can remember.

I was ICQ and Yahoo Messenger, but now it's Line or Slack?

[https://gyazo.com/9981e6b5d60d7fd71d411b87caa885eb]
About 25 years ago 72

Launched in 1992
"Email as it is currently used generally allows only text to be sent."
About the time when authors affiliated with NTT's research laboratories began to experimentally experience file attachments.

Fumio Mizoguchi and Kiyoyoshi Kosai, "Intellectual Production Technology for Teams."

[https://gyazo.com/d925ed67c308b9179d9429e0da13219a]
About 25 years ago 73

Advanced ICT use cases introduced by this book (DTP)
Manuscripts can be submitted directly by e-mail for convenience.
-Files cannot be attached, so please fax the guerra to me.
-Picture submissions are sent by mail due to lack of image quality with fax.

The Team's Intellectual Production Techniques."

[https://gyazo.com/deed331626581e80330872c4717a0a35]
The tools have changed. The rules? 　74

Organizations that were already large 25 years ago had the technical capabilities of the time.
They had the organizational structure and rules at that point to manage a large group of people.

Have the rules been improved to keep pace with advances in information and communication technology and tools?

[https://gyazo.com/c3b8ccfdbf833414a36f730dd4f34b6e]
Is this normal? 　75
-Have a child.
-Cannot work 8 hours a day to raise children.
-so I'm retiring.

[https://gyazo.com/9efb59a396df851b1cee40fde1d71d0a]
-Have a child 76
-Cannot work 8 hours a day to raise children.
-so I'm retiring.
-upWhy!

[https://gyazo.com/b42db04104ef46291a2befac146befa0]
Not a matter of course 77
-We don't have enough people.
-It would be a waste if people who learned the business quit.
-If "I can't work 8 hours" is the reason, then the rule requiring an 8-hour workday is wrong.
-Why don't you take 6 years of shortened work hours, remote work, or parental leave, and come back when you're done? Isn't it natural to say, "Come back when you're done!

[https://gyazo.com/760daa896dc359bba1e4c3f6997f9635]
"If there are 100 people, there are 100 different ways to work. "78

[https://gyazo.com/de83f6a460418daaea1e17ec1857ca0c]
New Management Tasks 79

Management has removed the premise of "meeting at the same place for eight hours a day."

Instead of enforcing a one-size-fits-all rule
Understand the needs of each member and change the rules accordingly.

Human Systems Engineer" to redesign systems composed of humans.

[https://gyazo.com/81df719e92040754477f8302cb0c5116]
The "departmental wall" problem 80
Another problem with hierarchical organizations
Other departments are far away

[https://gyazo.com/90dc0fc0af2c58928ab97965f3c7e5e6]
Job Rotation 81
The old way of dealing with this problem was job rotation.
Regularly change workplaces and duties.
This allows for human networking with other departments.

[https://gyazo.com/b9db8bcd739aaeb2bd8b53693ec93b7c]
Concept of Access Rights 82

Why can't I have access to the information in the department next door?

The time when information was shared on paper,
If some of the information was not allowed to be shown to other departments, we had no choice but to prohibit access to all of it.

In the digital age, with access rights,
Only some parts of information that cannot be shown can be partially hidden.

[https://gyazo.com/ffcb40513786c08797ce9b83a0881416]
Access rights 83

Only a portion of the data can be made public or private.
To use a crude analogy, stick Google Spreadsheet on Google Forms,
It is like being able to set accessibility for people and departments for columns and rows.
https://jp.cybozu.help/ja/k/user/rights

[https://gyazo.com/b01f452167c5ec5625ec97687b359935]
Promoting Information Distribution through Access Rights 84
-Only the "not-to-be-seen" parts are hidden by setting access rights.
-Other than that, the entire company will be open to the public.
-Internal distribution of "information that does not need to be seen but can be seen" is facilitated.

[https://gyazo.com/48e18dce4e41fd68e5d477d2118126f5]
事例1　 85
The minutes of general managers' meetings and other meetings of Cybozu are
It is open to all employees with a few exceptions and anyone can add comments.

Most of the topics are not allowed to be published here, but some of the discussions are presented with permission: https://cybozushiki.cybozu.co.jp/articles/m001358.html

[https://gyazo.com/63f130c2a0ba19096ad039350d3e24f3]
事例2　 86 
-My weekly reports in the research department are shared except for some non-public information.
-A certain Company A gave me a technical consultation and I reported it in my weekly report.
-Mr. B in the sales headquarters searches the full text of the groupware for Company A.
Discovered this and sent a message to me on groupware

[https://gyazo.com/f151be5dafd6e575a4c7dc7bbe9520de]
事例3 　87 
-Mr. C in the sales headquarters searches the full text about Company D.
-Human resources data revealed that Ms. E had previously worked for Company D.
-E's knowledge could be put to good use.

[https://gyazo.com/d847bfea4abfbe590cb91a78589e29ae]
The Value of "Unexpected Combination" 88
-If you search without narrowing your subject with preconceived notions, you will get surprising information.
-It's hard to make these kinds of surprising discoveries when the information system is confined to a specific department.
-by hiding only "what needs to be hidden" and disclosing the rest to the entire company,
The distribution of information across departments is encouraged and creates value.

[https://gyazo.com/9e35c4d0273112082ac216c5361c0c18]
Casual information dissemination 89

-To promote the distribution of "information that does not need to be seen but can be seen,
Encouraging information dissemination - by having new employees write daily reports.
Make it a matter of course to "send out daily messages to the entire company on the groupware.

-by creating a place where you are allowed to write your own words,
Feel free to send out your thoughts company-wide - you never know in advance what will be useful later.
So encourage and encourage transmission regardless of content.

On the other hand, if you make it a rule that you must get permission from your supervisor before posting company-wide.
Casual information dissemination dies easily. Even if it is possible with tools, it dies with rules.

[https://gyazo.com/779f4bb27206760f70c643e5b6f891ad]
Summary so far 90
Rules need to advance as tools advance
-Management that does not make the assumption that "we gather in the same place 8 hours a day".
-Revealing all but the information that really needs to be hidden, rather than "all together private".
-encourages casual information dissemination
→What does this facilitate?

[https://gyazo.com/9cf7b5ac0cc1ebd59e8161ef13ef180c]
複数部署の兼任　91 

-The casual dissemination of the work of other departments makes it easier for "hidden needs" to be discovered*.
-Easy to devote time to solving that need because it is not an "8-hour-a-day premise".
Multiple departments are more likely to be concurrently assigned to the same department.

*For example, a task that takes a full day every week in the accounting department may be viewed by an engineer in the development department as something that could be automated if he/she spent a day on it.
However, it is difficult for the accounting department to estimate the level of difficulty of that automation task, so it is difficult to make a formal request. →Appendix C

[https://gyazo.com/4ce4eb63db9898723934cb51604f37bd]
People are not a point but an expanse 92
Individual bridges multiple organizations

[https://gyazo.com/94c77687c2243992aa40c7bbc5c42795]
Individuals First, Organization Second 93
After more and more individuals to bridge,
Small individual-driven starts tend to happen first, although they can take the form of an "organization" after the fact.

[https://gyazo.com/6e0489cb3a3794fc658c0d89b561386a]
False dichotomy 94

-Is it a hierarchical organization? Not a hierarchical organization?"
Will hierarchical organizations disappear? No?" is a false dichotomy

-Individuals start small and work their way into the current hierarchical organizational structure.
Gradually more and more individuals do not fit the hierarchical classification.

-The "facts" of the organization are slowly moving away from the "interpretation" of a hierarchical organization.

[https://gyazo.com/5c9d993c22b61d580ba6f29ed8b6daf0]
Shortened working hours for childcare, etc. 95
Participating in external projects in a responsible capacity
This is also an individual bridging multiple projects

[https://gyazo.com/6f02712d3aae448c821166c64208c446]
Parallel Work 96
Participate in multiple companies and organizations
This is the same structure

[https://gyazo.com/9c0138805451ae432fd589fe9ccf3ddd]
知識の分布　97
Different organizations have different knowledge distributions.

[https://gyazo.com/a472611cd29b0c0fab7f78a46c2ba13a]
Bridging organizations with different knowledge distributions 98

[https://gyazo.com/d91d94d3f45102ad4f81bfc953fb1f52]
Benefits of belonging to multiple organizations 99
Knowledge exchange requires you to have knowledge that those around you do not have
That there is more than one "perimeter"?


[https://gyazo.com/096fbd4d5222312e20e44fec45153927]
Knowledge exchange is possible in each organization 100

Give them this.
I'll take this.
Repeat this...

[https://gyazo.com/07ede15abd4474ada95f023a98350aac]
Human resources with knowledge of multiple disciplines 101

Also known as "serial specialists" or "pi-type human resources."

[https://gyazo.com/d41f7953a8da1a0a10fba60c10352304]
Parallel Work 102
Why do you practice parallel work?
Because I believe it is a strategy that is beneficial to me personally.

[https://gyazo.com/c7feb378a98bc7be859b2244517b3766]
Blue Ocean 103

There used to be jobs only around the axis.

Parallel work is now possible, creating a blue ocean in this area.

[https://gyazo.com/f13d6a33aefb97a2eb5984262a5f060b]
General Laboratory Mental Model 104
There is a laboratory in the university, as a subset.

Wouldn't this also benefit from parallelization?

[https://gyazo.com/d874f5ab9f87c05482cd88cb2b67c900]
Cross-organizational Virtual Laboratory 105

[https://gyazo.com/65d014bfb10a0e0a1b1b45f6851aac56]
Current implementation 106
-I created a private group on Facebook.
-this time, anyone who listens to this class can participate.
-Write a link to join later in the Facebook group for this class.

[https://gyazo.com/b4f3ee06d37b2144a249806ac9045535]
Summary so far 107

-Multiple departments concurrently and when the rules change as technology advances,
Facilitates participation in multiple internal and external projects

-not a flashy change like "no more hierarchical organization",
Starting small from the individual changes the way we work.

-Private Facebook groups across multiple organizations
You can make it casually. I actually made it, if you are interested.

[https://gyazo.com/ebd9fbdd120b24096f682e7efaef3ac0]
Rules are the product of negotiation 108

-The rules are only provisional because someone has negotiated and discussed and agreed to them in the past.
-The rules should change as circumstances change, but not "the company should change the rules."
-If you benefit from the rules changing, you are the mouthpiece for negotiation and discussion.

"Cybozu is a great company, I wish our company could be like them."
Even if you wait idly and complain in a bar, "Our management team is stupid," it will not change on its own.

[https://gyazo.com/d1ca400518e90f4f4102b69c0638a99a]
Jobs Likely to be Lost, Jobs Likely to Remain 109
A) Those who decide "what to do".
B) Those who tell you exactly what they "do".
C) People who do exactly what they are "supposed" to do.

Automation by machine is more advantageous than by humans for jobs that require precise execution of predetermined "to-do" tasks.
Work that accurately communicates "what to do" is better served by information and communication technology.
More people will do the work of deciding "what to do."

[https://gyazo.com/1c6a0f21b269646807aae2d16fb60713]
Summary so far 110
-Population is declining and machines need to take more human jobs.
-Rules need to change in line with the evolution of tools
-Increased need for work to determine "what to do
= Work to negotiate and discuss rule changes

[https://gyazo.com/2d9e59c9cc016b402fc9e32a31c16b97]
To sum it up in one word: 111
Let's negotiate a rule change.

[https://gyazo.com/a4c68eb7591d27898c45fbb83f914de1]
以下付録　112

[https://gyazo.com/0c9ef92fcf11a0ff5da1ae4eff41924a]
付録A:三浦市の問題の規模　113 
-21 shipping stations
-About 50 market locations
•作物の種類が約40品目
-Broccoli, green radish, lady...
-Shipping about 600 tons a day - directing about 80 10-ton trucks.

Lady is a red radish (I didn't know that) that is used exclusively in salads.

[https://gyazo.com/a6f164b4a3f4619775ba1f3d564fe564]
付録B 114
Summarizing and communicating is still a human task.
We can draw out what is not in the language through observation and questioning.

[https://gyazo.com/2d3dd6aa6042c0bef18ae903cfec03af]
付録C:課題の提出と解決　115
The "cost reduced by the resolution of the issue" for the department submitting the issue, and
The "cost of resolving the issue" for the department resolving the issue.

[https://gyazo.com/d67dde731d58febaa261bd53608a0724]
116
If the department submitting the issue is unable to ascertain the cost of resolving the issue, their own "reduced cost" is the greatest.
Determine which option is best. Local optimum

[https://gyazo.com/a961c3178a65c7d60083bbf50b0f439b]
117
When considering overall optimization
The preferred alternative is "small cost, big cost savings."

[https://gyazo.com/38d369ffcf828f1ea03e7607f9f5466c]
118
In fact, the cost of a certain amount of cost reduction increases as the problem grows.

In economics, is it called the "law of increasing marginal cost"?
In the words of an engineer, "As the number of elements in the system, N, increases.
The element interaction increases on the order of N^2".

[https://gyazo.com/263a0d7e7306c50eca4b342f50e09fa0]
Appendix D: Cybozu's Corporate Philosophy 119
Creating a society full of teamwork

[https://gyazo.com/978b708d5e36c2c23b24521fbfa7acfa]
Appendix E: Will ICT Take All the B-Level Jobs? 　120

In the main story, due to the volume of the book, it was expressed as if all of it was taken away, but of course that is not the case.

The transmission of a single input to a large number of people (left figure) is being replaced by information and communication technology,
Getting a lot of input and extracting only what needs to be conveyed (right figure) is still not enough.

[https://gyazo.com/b3f735e7bebc427baa16af7bde1d2b67]
Remaining needs 121

-Summarize many inputs to produce fewer outputs

-Understand the situation of the recipient of information and extract "information necessary for the recipient.

-Language of "information that has not yet been verbalized" is created through questions and observations,
These distribution-enabling needs have not been technically solved and will become increasingly important in the future.

[https://gyazo.com/a261d4d2876b565b624b3a2740581abe]
Output destination is not only on top 122

However, the person you tell may not always be your boss.

The increase in working across departments draws out information from Department A,
More needs to be summarized and communicated to department B.

[https://gyazo.com/5e965f63d6b972ca2bd01dddd9fd2865]
付録X: 123 
MANABIYA基調講演
Self-Management Strategies for Engineers."
I described the knowledge acquisition strategy in more detail here.
I have included the whole thing because it did not fit in this lecture due to its size.

Slide addition for publication: This was omitted.


Case studies of how ICT is changing society