Columbus' egg
	Columbus, the discoverer of the New World, was told, "It's not hard to find a new continent because all you have to do is get on a ship and go in one direction and you'll find it," to which he replied, "Then try standing on an egg.
 There are people in the world who, after something new has been accomplished, say, "That can easily be accomplished."
  Saying so after the fact is by far easier to achieve than accomplishing it.
  There is a big difference between coming up with an idea and actually doing it.
  	When implementing an idea, there are many obstacles that are not apparent at first and must be overcome.
  	To say "it's easy" without thinking of the difference between an idea and its implementation is in itself a sign of the speaker's inadequacy.

 Whether the story of breaking the egg and standing it up is a historical fact is iffy.

	>In a triumphant ceremony celebrating the discovery of the New World, Columbus said to those who envied his success, "Anybody who goes west will hit land. To those who were jealous of his success, Columbus said, "Anybody try to put this egg on the table," and after no one could do it, Columbus lightly cracked the tip of the egg and put it on the table. To those who said, "Anybody can do it that way," Columbus replied, "After what others have done, it's no big deal. This is the anecdote of "Egg of Columbus," which is used today as a proverb meaning "Even if anyone can do something, it is extremely difficult to do it the first time and requires flexible thinking" or "reversible thinking.
 > Voltaire, however, pointed out in his "Treatise on Customs" (Chapter 145) that "this is a creation based on an anecdote by the architect Filippo Brunelleschi," and explained that the content of the conversation and other details had been appropriated directly. The anecdote is that in the 1410s, when everyone was having difficulty designing the dome of the Basilica of Santa Maria del Fiore in Florence, Brunelleschi, without showing any drawings or a completed model, said, "Let me build it. When the other architects were very much against it, Brunelleschi suggested, "Let someone who can stand an egg on a marble do the building. While no one else could do it, Brunelleschi crushed the bottom of the egg and put it up. Naturally, he was criticized by others, but Brunelleschi said, "The first one to do it is the hardest. If I show you the drawings first, you will copy them, won't you?" Brunelleschi responded, "If I show you the drawings first, you will imitate me, won't you? Brunelleschi's response was, "If I show you the drawings first, you will imitate me.
 https://ja.wikipedia.org/wiki/クリストファー and Columbus
