postcapitalist society
[https://gyazo.com/5af9d25bc8f28457a73564f389fb97e3]
	[Drucker].
 [Amazon https://amzn.to/2G1UP0B]

	Purchased in 2010-04
	I've mentioned it here and there, but it's scattered because it was done before I started using Scrapbox, and I'd like to summarize it eventually.

Q: When was the original first published? →1993

	[knowledgeable workers own the means of production].
 >Marx said that the greatest change that capitalism brought to society was the alienation of the working people. Workers did not have the means of production. They could produce only when they were lent increasingly expensive opportunities by capitalists. P.86
 >The relationship between knowledge worker employees and the means of production is interdependent. Neither can function without the other. P.87
  Knowledge workers here are not just "non-physical workers." see [Knowledge Workers].

	[The knowledge society is not a society of bosses and subordinates.]
 [Knowledge workers cannot be supervised.]

 >All of the jobs in knowledge work and most of the jobs in service work are not given. To improve productivity, we need to ask, "What should we expect from this work?" Answering this question requires risky [decision-making]. And there is usually more than one option. [Unless the outcome is clear, productivity cannot be improved. P.108

 >We need to consciously eliminate chores that do not contribute to results. Eliminating chores is the best way to improve productivity. p.114
 >For every activity, we must ask, "Is it my primary job?", "Is it necessary for my primary job?", "Does it help my primary job?", and "Does it make my primary job easier? If the answer is no, then it is a chore. It must be made a separate and independent task or eliminated. p.115

 >The one doing the work knows more about the work than anyone else. Improvements in work should start with those that do the work. It is necessary to ask those who work to take responsibility for managing their own productivity. p.116
		[自分の生産性向上に責任を持つ]

 >Knowledge demands continuous learning from knowledge workers due to its constant change. It also demands continuous learning from service workers as a continuous self-improvement effort. Moreover, the best way to improve productivity is to let people teach others. To improve productivity in a knowledge society, the organization itself must become both a learning organization and a [teaching] organization. p.118
		[Learning by teaching = [learning by exchanging knowledge with each other].
  [Learning Organization] = [Learning Organization]

	[Why productivity improvement is necessary]
 [No more middle management.]
 [Outsourced service labor]

	[Knowledge must be proven by deeds.]