There are different kinds of knowledge.
2018-03-25
When I mentioned that [knowledge must be proven by action], he pointed out that the word "knowledge" has several meanings, so it would be better to classify it and assign a different word. That's fair enough.

Page number is [post-capitalist society].

 Knowledge of Socrates:.
 	Knowledge of oneself, with the aim of knowing oneself and enlightening oneself p. 61
 Protagoras Knowledge:.
 	Knowledge aimed at what to say and how to say it well.
  Knowledge aimed at improving others' image of you. P.61
 Techne(skill):.
  Knowledge for the purpose of what to do and how to do it.
 	It was not considered knowledge in Socrates' time.
  Like how to break the stone cleanly.
  They were not taught systematically, but learned by imitation and hands-on experience.
 Technology:.
  It was invented about 50 years after 1700.
  The Encyclopedia, compiled between 1751-72 [Encyclopedia - Wikipedia https://ja.wikipedia.org/wiki/%E7%99%BE%E7%A7%91%E5%85%A8%E6%9B%B8]
  Knowledge that is intended to "increase worker productivity by providing workers with knowledge."
  Knowledge was recognized as a "resource" that could be given to workers.
  Worker->Productive Worker P.36
  　Knowledge aimed at transforming workers into productive workers
 Mechanical Engineering
 	Steam engine by Watt in 1776 (patented), etc.
  This has created a "worker + machine" system that is much more productive than the worker alone.
  It was feared that there would be a great disparity between capitalists who owned machines and workers who did not (Marx)
  It can be said that the knowledge is aimed at "improving productivity by improving tools," considering that a human-powered loom to an automatic loom and a waterwheel to a steam pump.
  Tools->Productive Tools p. 38
 Administrative Techniques:.
 	Scientific management method by Taylor in 1881.
  >Applied knowledge to the study, analysis, and assembly of manual labor jobs.
  1907, Ford System by Ford, etc.
  Knowledge aimed at "improving productivity by analyzing and improving workers' work."
  >Education and training have exploded productivity.
  >A few years after Taylor applied his knowledge to his work, the productivity of manual laborers began to grow by 3.5%~4% per year. This meant a doubling in 18 years. Since Taylor to date productivity has increased 50-fold. p.51
  Work->Productive Work p. 43
  　[nishio.icon]Knowledge -> productive work, then? A misnomer?
  　　No, this is a misinterpretation of the meaning of the arrow.
  　　Meaning "the goal of transforming a job into a more productive job."
  　　I've added it above.
 Meta-Management:.
 	Management concept by Drucker, circa 1950.
  The story so far has been "improve X's productivity by applying knowledge to X".
  Assign to this X the knowledge of productivity improvement itself.
  Knowledge for the purpose of "improving productivity gains through improved knowledge."
  Knowledge->Productive Knowledge.

2010-06-16
["What is Knowledge?" a reflection on reading Drucker's Post-Capitalist Society - Yasukazu Nishio's Hatena Diary http://d.hatena.ne.jp/nishiohirokazu/20100616/1276704066]

>What brought about the Industrial Revolution: The Industrial Revolution was brought about by the application of knowledge. Knowledge used to be about existence. Knowledge became an action. It became a resource.
>As a first step, knowledge was applied to tools, processes, and products for 100 years after the mid-18th century. That was the Industrial Revolution. At the same time, it brought about what Marx called alienation, class, struggle, and communism.
>In a second phase, beginning around 1880 and culminating at the end of World War II, knowledge was applied to work. The result was the Productivity Revolution. The Productivity Revolution defeated class, struggle, and communism.
>In the third phase, knowledge came to be applied to knowledge. That was the management revolution. Knowledge became the largest factor of production, replacing land, labor, and capital. p.24-25

>For a long time, since Plato's time, knowledge has had only two forms. Socrates believed that the purpose of knowledge is self-knowledge, that is, one's own spiritual growth. Protagoras, on the other hand, believed that the purpose of knowledge is to know how to say what one is doing. Knowledge meant logic, grammar, rhetoric, and general education. The same was true in the East. Confucianism was about knowing what to say and how to say it, the way of life. In Taoism and Zen Buddhism, knowledge was self-awareness and the path to wisdom.
 >There was this conflict between the two schools of thought, but knowledge was not about action. It was not utility. What gave utility was not knowledge, but techne (skill) as in Greek. p. 34

>Today, knowledge is the only meaningful resource. Knowledge in such a new sense is knowledge as utility. P.57