Teamwork Management Symposium
2018-03-30 [Cybozu Teamwork Management Symposium https://cybozu.co.jp/events/symposium/]

Summary of Facebook posts
 By having a "100 people, 100 different personnel systems," employees began to speak up and say, "What kind of work style do I want?" This [Hirschman]'s change from "disengagement" to "speaking up."
 	[Disengagement, statement, allegiance].
 The "work style reforms banning uniform overtime and any semblance of individuality," "It's not right to go in a direction that isn't fun," "The antsy video," "99% of the companies don't want it/multi-powered," "The monster that is the company is..."
 Mr. Horie: "When I was a child, I felt uncomfortable when people said, 'This is the way it is,' but I grew up until I was about a college student without knowing how to doubt, but in college I became 'Oh, I don't have to go to college,' and the uncomfortable feeling became a word, 'I don't have to find a job or do anything.'"
 Mr. Horie: "I didn't know about private junior high schools until I was in the third grade of elementary school, the adults around me didn't tell me about them, my homeroom teacher told me. I didn't know about my options." "I couldn't care less about taking the entrance exam six years later, so I played around on the computer, which turned out to be a good thing."
 	Teaching choices is very effective.
  You don't know in advance what will be useful.
 Horie: "[Demographics] is a very simple story, and students who enter the University of Tokyo should be able to understand it."
 I'm an outsider, so I look at ants and laugh at them. It's funny as satire."
  The guys who were lounging in the bar earlier, including the youngsters, we don't need all of them, their jobs are already gone."
  "You don't have to take a big stance like robots and AI, just use groupware."
  Do you guys need to be there?"
  Hori "If we do this, we'll lose money.""Those who don't want it.""Moderator "What should we do about those who don't want it?" Hori: "They should play" Mo: "They can't eat" Hori: "They should ask for help" Mo: "I'm not comfortable with that" Aono: "It's a wall of the mind"
 More and more people don't have to work, but they work by creating jobs they don't need due to the psychological barrier that it is not good to get paid for not working. The pathology of not knowing how to play.
 Aono: "I am leaving only what I want to do around me." Horie: "I even stopped being president, I have a corporation but I have left the president to someone else." "My only regret is that I can no longer use my organization of engineers." "My own IT talent pool is not large now, and it is hard to create.
 Mo: "If you're not working, you feel like you're not helping the world," Horie: "I'm sure you're still not helping." The ...
 Mr. Horie: "Our way of thinking has become work-oriented. Even now, we are benefiting from technology, and we can live without having to sweat and plow the fields from morning till night, and this is thanks to technology such as chemical fertilizers. If I had told you this kind of story 100 years ago, you would have said, 'Oh, that's only for a few capitalists.' We don't want a revolt because of the GAFA terrible, so there should be a reduction to the extent that there is no discontent. So we should just play along."
 Mo "If you play too many games and your grades drop..." Horie "It doesn't matter if they drop, the current elementary, middle and high school education isn't helping. You don't teach the principle of bitcoin or anything like that in school, do you guys not understand the principle?" We'll build H high school to compete with N high school." "It's not about what we teach, it's about practice." "Now that we have technology, we don't need three years to cook rice, a rice cooker is better." "The world has a high premium for high school students, some appeal to me too, I'm just young."
 Aono: "Horie-san is turning existing rails upside down, isn't he?" Horie: "No, I'm just revealing the seeds of my magic tricks, and when I do so, existing magicians resent me." "If it doesn't take 10 years to train at a sushi restaurant, the people who are in trouble when it is made public are those who make money from it.
  You're in the business of creating [information gaps] by hindering the distribution of information and making money off of it. Sure, if "it won't take 10 years" isn't true, we can just ignore it.
  The business model is to contain the knowledge within the group and profit from it (A), and Horie's business model is to take that knowledge out and distribute it widely (resented by A's people).
 Horie: "If we create opportunities for high school students to make rockets, high school students who want to make rockets will come to our high school. They don't need to go to college and then work for a company. Some people ask, "Can high school students enter the university?" Some people ask, "Can high school students enter the university? Of course they can, but there are people who think they can't, so they ask like that. I feel sorry for those who give up without asking, so we make high schools too."
 Mo "If I don't go to high school, there will be no way to find a job after that," Horie "Minowa-san and others are using up the company. He says that even if his salary at Gentosha were to go down to zero, he would not quit. He says he wouldn't quit even if his salary at Gentosha were to go down to zero. Aono: "I wonder if there are companies that would be willing to provide technical resources if they could have Mr. Horie's ideas.
 Horie: "Three years ago, he was an udatsu no kudatta guy." Aono: "What was the turning point?" Horie: "He edited my book, "Multipower, and implemented it himself before the book came out."
 Horie: "Minowa's lab is a perfect copy of [HIU]. Even rakugo artists first trace the classics, so I teach them to copy. If Minowa could do it, anyone can."
  [Minowa Editorial Office - CAMPFIRE https://camp-fire.jp/projects/view/34264]
 Horie, "More Stupid Hyperactivity than Little Cleverness."
 Mo: "This is a little off the theme of the new Caixa."
  [nishio.icon]No, no, no, the story of HIU and the Minowa Lab that was copied and created from it, "the current company" is an example of the implementation of a new organization that is totally different from the current company.

Session 2
 Fujita, the president, spends 95% of his time on abemaTV, and it is important to have a system that allows him to transfer authority to other executives.
 It's not a typical media business model, but one supported by the sale of goods, and it's personal motivation that makes the content so compelling."
 Why did you start [the new graduate president system]?" I thought about how to get talented new graduates to stay on their own. It's the same with other jobs. You have to trust them.
 Ventures and Lifetime Employment, Why?" We have to create a place where the losers who have tried have a second chance. We must create a place where people can challenge in peace, where people who have lost 120 million and 500 million can stay and take on the next challenge."
 The Internet can and must be reshaped because the industrial sector is so new."
 Almost Day is not a workplace for everyone. In the beginning, it was a group of sole proprietors who did things freely, and the management department must be creative in how to make it an organization." "Ordinary organizations try to eliminate the genus, but our company becomes better the more the genus individual shines, and we wind up with expense reimbursement and other expenses that are not valuable even if the genus is demonstrated.
 I'd start by saying, "We won't know until we try it, so we'll start by saying it's a morning order first. Maybe we can do it because it's small and we can see the whole picture; how are we going to do it with 8,000 people?"
 The Internet is a real distribution channel for information. People gather in interesting places and leave when things become uninteresting. Organizations can be the same way and can go from 80 to 800 to 8,000 people.
 There is a race to build trust before there is a race to develop talent. I don't want to listen to someone I don't know, and I don't want to take a job from someone I don't trust. If you harass someone, you will be found out immediately, and on the other hand, if you do it properly, you will also be found out immediately. At Almost Daily, the sense that people can be moved manipulatively is not good at all, as "facts come first, rules second.
 But large Japanese companies tend to think, "Employees belong to the company, and their time, skills, and connections belong to the company," and how could that be changed? In a sense, it is enclosure, but the way it is done is very loose. It's like a campfire with a fire in the middle, but it's up to each individual to decide how far away they want to stay. Big business tries to build the fence higher even though the fire is dying out; it's more important to keep the fire burning, right?"
 Market value is determined by a person's experience in making decisions. Increase the quantity and raise the quality. If we don't create opportunities for employees to make decisions that are bigger than the ones Fujita made when he was 22, they will become smaller and smaller.
 To be objective, we need to get feedback from other people's evaluations of us, and although they are naturally off at first, through repetition our self-evaluations will gradually come to match the evaluations of others."
 There is a gradation between 100 and 10 incompatibilities. If you surround a person with 10 incompatibilities, you are required to take responsibility for turning him or her into 100 incompatibilities, but if you loosen the restrictions, the incompatibilities can be resolved by doing multiple jobs. We need to open up the options and let the people make their own choices."


question
 Q: "What happens when your companies develop in the direction of 'we should consider that it is not a company premise'?"
 	Cybozu is still looking for a way to do this, but I think it would be better to have a philosophy and dissolve the company when it has achieved its goals, like a non-profit organization. Or, like a religion, there could be a 'philosophy' and evangelists could spread that philosophy.
  It is interesting that Almost Day is a company that does things the way we want to do them, and as a result, is recognized by society. The reason we went public was to show that it is possible to have a company with that kind of freedom.
  In CA's case, the mission is to create a 'company' that represents the 21st century. Ecosystem, creating a large number of subsidiaries, organically connected and working independently, responding to change."

 Q: "The difference between a CEO and a policeman."
 	'CA8 is CA8 is on the board of directors, replacing two in two years. Playing directors, they can return to the field at any time. Directors are not 'up-and-coming'."
  In the case of Cybozu, there are three directors, the legal minimum number, and since we don't try to do anything with directors, we don't pass authority to them. People with expertise exchange information and discuss and make decisions on a daily basis. Decisions are made at the general managers' meetings. Even ordinary employees can participate, and minutes are made public on the same day."
   What is your job, Mr. Aono? I host the general managers' meetings and make decisions.
   When decisions are made on the cloud, it is rather difficult to make them. The decision-making process is open to anyone who is interested. The minutes are made public immediately, and since we use the kintone application, there is a comment section. You can ask questions. It's not fair to not pick up on a question that you have.
   There's an example of a discussion happening next to the minutes of the general manager's meeting that I'm poking around in the second half of [this https://cybozushiki.cybozu.co.jp/articles/m001358.html].
  The board of directors is nothing more than a tool, so it is important to know what you want to do. It is interesting that a company with 8,000 employees and a company with 80 employees have in common the importance of having a board of directors who know the actual situation well.
  Our general managers' meeting is an advisory committee for Aono to make decisions, so it's open to everyone because it's better to have information gathered for decision-making."

 Q: (question not quite clear, what is a person?)"
 	Emotion Management."
  They are worth it just to be there."
  I think that if something is called a person biologically, we should just call it a person. It is only a tool that makes a company."
  "When I think about people, my favorite word is 'mankind.' It seems a little objective. I'm interested in how mankind, having evolved from monkeys, will change the world."

 'Q: I have the feeling that even if the most layman does his best, he can't change the company, but how likely is it?'
 	The level of difficulty is high. The first thing you need to do is change even one person around you. If you can't do that, there is no way you can change the company. If you can do that and get a lot of people involved, and the company still doesn't change, then you should quit the company. Don't sell your talent so cheaply."
  	It's about making the first move." "First you do it, then you try it and it doesn't work, then you admit defeat and decide not to do it again, and that's the decision-making experience."
  If you really want to change that company, and you don't have that much motivation, then the people around you won't get involved. Do you really have that much motivation?"
  He said, "If you feel uncomfortable and think something is wrong, there are three things you can do: change the company, change yourself, or change the place. Do you want to change the campfire song itself, or do you want to bring people who are not on board with the campfire song? What is the "change" in "I want to change the company?
  No one on the ground can change the company. There is no one called 'Mr. Company. We casually say 'change the company,' but it is wrong to personify it as if it were a human being, because it is a virtual person. It is you who should change, not the people around you, from whom you should not run away."
   [The "Mr. Company" does not exist. What needs to be changed is the same people who are there──I thought about side jobs and the company with Cybozu President Aono | Cybozu Style https://cybozushiki.cybozu.co.jp/articles/m001421.html]
