Side work for money and side work for achievement.
	There are two types of [side jobs] to begin with.
 	People whose income is not sufficient for their current job to do another job for money.
  People whose [what they want to do] is not equal to their current job, doing a different job to achieve what they want to do.
	Example: Shortened working hours for childcare
  Full-time work does not allow me to do the childcare I want to do.
  Reduce time restraints to accomplish what you want to do.
 Example: Community activities for engineers (volunteer)
 	For example, if your job at your current company is not "to organize an event for engineers to get together," volunteer to organize the event.
 	Community activities are not equal to company work.
	I'm doing another job for money, another job to achieve what I can't do in my current job, which is to "get more money".
 	So "side work for money" is a small part of "duplicate work for achievement".

-----
>I've been researching side jobs for a while now because I like the term "no side job ban," but it seems to me that two very different things are referred to by the same term "side job" in the world to begin with, and that is what is causing the discrepancy in the discussion.
>One is an action that satisfies the desire for money for those who feel that their current income is not sufficient, and the other is an action that satisfies the desire to do something that is not equal to what they want to do with their current job.
>It is of course the latter that is being referred to in the context of "double jobs," "engineers' activities outside the company," and "shorter hours for childcare," and since the goal is to achieve what they "want to do," they are not asking for an increase in salary or to reduce their work hours because they want to do it even if it means reducing their salary. The latter is of course the purpose of the latter context, which is to achieve what one wants to do.
>On the other hand, there are also those who think that the former is the natural choice when it comes to side hustles, and without resolving the gap between the two, the discussion will end up being confusing.
[2016-04-04 https://www.facebook.com/nishiohirokazu/posts/10208308752652988]

