layered organization
First, assume that "there is a limit to the number of people with whom humans can communicate.
If one president tries to communicate with a large number of people in this situation, he or she will need someone in between to "get the word out".
In the figure, one person only interacts with a maximum of three people, but a total of 10 people are communicating.
[https://gyazo.com/b5990644a6f79390786c2a96b885e4ed]

The larger the organization, the more people are in the role of "getting the word out" #MiddleManagement
[https://gyazo.com/553009b81c3bf33dd8b7fac5662fc610]

On the other hand, if we limit ourselves to the communication of information from the president to employees, we can communicate to a large number of people without using this method.
 Even before the Internet, the president could gather employees in the square and speak to them in high places.
 The Internet has made it possible to communicate at any time of the day without restrictions of place and time.
[https://gyazo.com/27d4cb993d8b9966ae168d5db2597081]
Technological advances and new information transfer mechanisms will create new forms of teamwork.
	Above is a story about how the president's ability to disseminate information has increased, making it easier to create an organization with a shared vision #Groupware
 The creation of a collaborative editing mechanism called a wiki led to the creation of a distributed and asynchronous lexicographic organization called Wikipedia.
 Many open source communities have been created by the ability to send source code revision diffs via email.

However, this "communication of information from the president to employees" is a one-way process, and if the reverse were simply done, the president's information processing capacity would be insufficient and he would get a flat tire.
[https://gyazo.com/6ca416b15e52d67441c776e2ba93fff1]

Communicating the president's words is "making one into many," which could easily be accomplished by the [easy to replicate] nature of digital data with a computer system in between, but "making many into one" is not yet technically possible.
[https://gyazo.com/6870d73a2d8fea4dfb9c9a190007f2e2]

Of the "conveying voice" functions of middle managers in hierarchical organizations, the part of listening to subordinates' words, summarizing them, and conveying them to the president has not yet been mechanized, and if this becomes technologically possible, there will be another major change in the way teamwork is done.

On the other hand, [teal organizations] seem to think that the "information needs to be gathered by the president," which is the implicit assumption here, is an unfounded assumption due to the success of hierarchical organizational structures to date.