Shrinking Knowledge Domains
	Suppose there are two methods: method X, which requires few resources and achieves fair accuracy, and method Y, which improves accuracy by investing more resources.
 	Method Y is written as NN in the figure because a neural net is considered here as an example
	Method Y is a method that has a [trade-off] between resource consumption and accuracy, so it is triangular in the figure.
 	This diagonal line will be referred to here as the [technical constraint line]. ref: [budget constraint line].
 When Method Y first appeared, it was a "useless method" that consumed more resources and was less accurate than Method X.
 [https://gyazo.com/c1f250b62c1c7f425808b62d808730f7]

	Method Y research is progressing and the technology constraint line is going up.
 As a result, the top of this triangle, the leading edge of the accuracy competition, exceeds the accuracy in method X
 Papers and other publications begin to write that method Y is more accurate than method X, and the topic becomes a hot topic.
 [https://gyazo.com/cef508a22fe8015e9065b6d0f54d46bb]

	However, it is not reasonable to say that method Y is the method of choice for business applications at this point
 This is because when customers evaluate the value of a method, they take into account not only the accuracy but also the resources consumed.
	In the figure below, Method Y has overtaken Method X in terms of accuracy, but Method X is still far better in customer evaluations
 [https://gyazo.com/6e833a4b016440d0c8d1d0085e759624]

	At this point, in reality, it is unlikely to lead to customer satisfaction, but attention is drawn and investment is made.
  see [Hype curve].
  [https://gyazo.com/1dc54bff18ef59975db6fb06dcb58d10]
	It is not irrational to invest for the long term with the expectation of future growth.
 	Allow employees time to learn in case they will need knowledge in this domain in the future
  Anticipate that Method Y will be widely used and hold down what will be needed for its use.
   Strategies equivalent to "seize the upstream of the supply chain" in industry
   A specific example is the investment in the computational infrastructure of Method Y
   	Typical example is Google's TPU development
	Short-term investments for the purpose of application at this point in time, well, of course they fail at a high rate.
 	It's being done by sucking nutrients out of people and companies that don't understand it and putting them into the long-term investments mentioned above.


	This long-term investment, especially in the computing infrastructure, will reduce the resources consumed by the same code.
 The contribution of the amount of resources consumed to the value found by the customer is reduced.
 	There are two interpretations.
  	Interpreted as overall higher speeds reducing the amount of resources consumed.
   Interpretation that even if the difference in consumption resources does not change, it is because the mapping to that money changes.
 The customer's evaluation axis becomes more of a "standing" line, and the "goodness to the customer" of methods X and Y is reversed. x
 	[価格の弾力性]
 [https://gyazo.com/64362a64b38f134676a6bdfad7e7b1a7]

	In this major trend, the domain of "knowledge that helps reduce consumption resources" is no longer valued by customers and shrinks
 >I am annoyed when people talk about AI using neural nets for things that "just use linear regression," but when I think about it, the world has wasted CPU time and memory using scripting languages for things that "just use C to write it," and eventually CPU and memory performance has improved to the point where scripting languages are fine. Eventually, the performance of CPU and memory improved, and it became OK to use script language. Now we are in a transitional period, so we are using neural nets for things that "don't need to be done with neural nets," but this boom will never end, and the number of people who can only do neural nets will probably increase.... And just as people who only know scripting languages say, "What is malloc? people who only understand neural nets will start saying "What is linear regression? And people who understand only neural nets will start saying, "What is linear regression?
		[Facebook https://www.facebook.com/nishiohirokazu/posts/10215044469841708]
	I am a resident of the old generation, the one who thinks "linear regression is the way to go," but just as happened in the relationship between C and scripting languages, a new generation will emerge that does not know the knowledge of the old generation, and will be able to create customer value without knowing it.

	[知識獲得戦略]
 [Roadmap oriented and ecosystem oriented]
