Edo-period herbal medicine (used as an antitussive and a breath freshener)
 A [Chinatsu Miyamoto Gairo Selling Complete Memorization, One Shot, Part 1 - YouTube https://www.youtube.com/watch?v=QUx8N3DDuvM&app=desktop]
 B [Gairo Sell. [Full, unedited] - YouTube https://www.youtube.com/watch?v=9WbLKQVEzJc]
 The original [Gairo Seller Ichikawa Danjuro - YouTube https://www.youtube.com/watch?v=zjrZMhRTg78]
　[https://youtu.be/8K4A-tXKAOY]

I am the master, and some of you may know who I am,
He left Edo and went 20 ri Kamigata to Soshu Odawara Isshikimachi,
If you come up Aomonomachi, you will see the Ranjibashi Bridge Toraya Rattanemon,
I have shaved my hair and now call myself Ensai.
This medicine is available from the morning of the first day of the year to Otsugomori,
A long time ago, a Tang Dynasty Chinese man named Uilou came to my morn.
When you come to the emperor, you should take this medicine,
When using, take in/out from between the crowns, one at a time.
Therefore, the emperor has bestowed upon me the name of Touchenkou.
In other words, monji is written with the words "yori," "suku," and "nioi," and is called "tochin kou.

Nowadays, this drug is spreading in the market and is being used in the bouillabaisse,
No. You can say that Odawara's, Haidawara's, Sandawara's, and Sumibara's are all different,
The only "hiragana" that can be used to signify "uiro" is oyakata ensai.
Perhaps you would like to visit Atami or Tonosawa for a hot-spring cure in our presence,
Or, since you will be visiting Ise, you will surely make a mistake.
If you go up, it is on the right side, if you go down, it is on the left side, Happou is Yatsumune, Omote is Mitsumune Tamado-zukuri.
Hafu has been pardoned to use the crest of chrysanthemum and kirinoto, and is a genealogical medicine, that it is.

No, I'm not going to go on and on about the family name.
For those who don't know, Shoshin pepper swallow whole, Shirakawa Yofune
Farewell Ichiryu, eat up and let's see that Kimiai!
First, place this medicine on your tongue like this, and then put it in your mouth.
No, I can't say, it is as if my stomach, lungs, and kang were all healthy, and a fragrant breeze was coming from the nondo, causing a bitter taste in my mouth.
The combination of gyocho, mushrooms, noodles, and other foods is like a god that has an instant cure for all illnesses.

Now this medicine, the first strange, tongue-twisting thing, Zenigoma flees barefoot.
If you start to speak out of turn, you'll be in for a world of hurt,
Sore sore sore sore, sore sore sore, sore sore sore, sore sore sore, it's coming around, it's coming around. Awa ya nondo, sattara na tongu ni kage-sassion, hama no tsu wa shin (lip) keicho, kaiai sabasawa, akosatana hamayawa, okosoto no homoyoro, hitotsu hegihegi ni, hegihoshi hakami, bon mame, bon gobo, tsumitade, tsumimame, tsumizansho, shishazan no shasojo, tsumitade, tsumimame, tsumizansho, tsumizansho, shishazansho The first is the hegihegi, the second is the hegihori.
Kogome no nama-gami, kogome no nama-gami, konkogome no nama-gami, shusu, hijusu, shusu, shuchin
Parents are also kakae, children are also kakae, parents are also kakae, children are also kakae, children are also kakae, parents are also kakae, old cuttings of old chestnut trees
Rainsuits, banggabaka, your leg band is kawagahan, our leg band is also kawagahan.
Shikkawa bakama no shippo korobi wo mihari hari naka chotto nuru, nuru chotto bundashite, kawaranadeshiko, nosekichiku.
Nora nyorai, nyorai nyorai, minyorai nyorai ni muyorai nyorai.
A little further ahead, the little Buddha is a bit of a pain in the ass, a little bit of a pain in the hosodobu and a little bit of a pain in the dojonryori.
Kyo no Nama Dara, Nara Nama Managatsuo, and a little Shigokanme.
Tea tacho, tea tacho, chatto tacho, chatto tacho, tea tacho, green bamboo chasen de chatto tacho tachi ya.
Kuruha kuru wa kuru wa nani ga kuru, Okokakera kobo in the mountains of Koya, 100 tanukis, 100 chopsticks, 100 cups of tenmoku, 800 sticks.
Bugbug Bugbug Mibugbug Mibugbug Mibugbug Mibugbug Mibugbug Mibugbug.
Kiku, kuri, kiku, kuri, kuri, mikikuri, mikikuri, together kiku kuri, mikikikuri, mikikikuri.
Mulch garbage Mulch garbage Mulch garbage Mulch garbage together Mulch garbage Mulch garbage together.
That nageshi naga naga naga naga is a naga naga naga naga.
Is the gomagara over there an e-gomagara or a ma-gomagara? That's just a little gomagara.
Garapi garapi kazaguruma, okagare spilt, okagare koboshi, yunbe also spilled and spilled again.
Taapu-popo, taapu-popo, chiri-kara-chiri-kara, tsutsutapo, tatsutapo-tatsutapo no ichidakko. If it falls off, boil it and eat it.
The things that are not eaten even if they resemble or are baked are the five sticks, iron balls, kanakuma douji, ishikuma, ishimochi, tora kuma, and tora kisu.
In the Rashomon of Toji, Ibaraki Doji grabbed Udeguri Gongou and held it in his hands, while Omushal, the Raikou, remained on his knees.
Funa, kumquat, shiitake mushrooms, godan, buckwheat noodles, somen noodles, udon noodles, and gudon koshinbochi.
There's a little miso in a little tub under a little shelf, a little ladle, take a ladle, scoop it, scoop it, scoop it, scoop it.
If you run to Kawasaki, Kanagawa, Chengaya, and Totsuka in Shindokutambo, you will only have to run three miles to get to the end of the road.
Fujisawa, Hiratsuka, Oiso gashiya, koiso yado wo shichi wo akimasu, soshu odawara to uchiinko
Hidagozananaru kisengonju no,hana no oedo no hana wirou
Look at that flower, and you will be at peace.
Even Ubuko and Hauko are not unaware of the reputation of this willow,
I must give, I must buy, I must give, I must buy, I must buy, I must give, I must buy, I must buy, I must give, I must buy, I must buy, I must buy
Breathe tight, and may the Yakushi Nyorai, the master of medicine in the eastern world, also see the light of day.

variation
	Hosomizo: "Hosomizo", "Hosodobu".
 	Ichikawa Danjuro is "Hosomizo
 Chrysanthemum chestnut: "Kikukuri", "Kikuguri".
 	Ichikawa Danjuro is "Kikuguri".
	The theory that "Itcho-dako" is "dried octopus
 	https://yugikukan.exblog.jp/9746505/
 	Ichikawa Danjuro is also a "hidako.
	Koshinbochi, Koshinhatchi
 	Ichikawa Danjuro is "Koshin Hatch."
	winning hand consisting of three kongs or pungs of winds and a pair of the fourth wind
 	Both clauses, "Yore, toru ku, koi," and "Toru ku, ori, koi, koi," are present.
 the pot calling the kettle black
 	There are both "issunsakino" and "choto-sakino."
	Koiso Inn
 	There's Yad and Shuk.
