Virtual Laboratory
	Can we achieve the customer value created by our existing product, "Laboratory," at a lower cost?
 What is the customer value being generated?
		A type of knowledge acquisition that cannot be acquired by reading books alone
  Discussion from various perspectives

	Where costs are involved
 	Physical Space
  Schedule coordination costs to physically assemble

	[Discussions on Facebook like this https://www.facebook.com/nishiohirokazu/posts/10215051925188087]
  Are we achieving the value we are looking for?

 Is [gate]([barrier to entry]) necessary?
		There are fairly high barriers to entry for regular labs. Academics and high tuition fees
  	Higher to cover the costs of university faculty and administrative departments.
  Some online salons use money as the only barrier to entry.
  	About 10,000 yen per month
  On the other hand, there are no barriers to entry for the above-mentioned spur-of-the-moment discussions on Facebook.
  	Really?
   	The ability to post something in response to Nishio's post that I feel would be beneficial from my perspective.
    	Something like, "That's wonderful, I agree." is not beneficial.
     Ability to have a different point of view & state it logically.
     Isn't this a pretty high hurdle?

		If there is a gate and an NDA, we can discuss matters that are ongoing and cannot be disclosed to the public in an unspecified manner.

	If you have to make it or not, you better make it.
 	You don't make it, you don't learn anything.
 If it's a question of whether or not to have a gate, we should have a gate.
 	Creating a group without a gate doesn't seem like a new learning experience.
  Important to be able to tie it up in an NDA and talk off the record.
  If it's a story that can be made public, you can write it on your Wall, not talk about it in a corner like that.
 So what kind of gate to build?
 	plan
   Tokyo Tech MOT students may participate.
   Students of the Graduate School of Economics of the University of Tokyo are also acceptable.
   	Scheduled to speak on 4/17.
    Bridging students from different universities leads to value
			Adopters of IPA Unexplored Projects
   Other persons specially approved by Nishio
   	Specifically, I assume people who have posted constructive opinions about my posts on Facebook.
   paid account
   	I'll have to think a bit more about whether or not to ant this.
    It is not very necessary to earn money, but it is useful as a measure of the value we provide to society.
    I am going to try a virtual secretarial service for a month for another matter, so if I can raise the cost of that, it will be sustainable.
    Paid plans for Slack can also be implemented.
    　→I quit the paid account. I think that if there are too many people who say, "I paid for it, so I'm a customer," it might not be in the direction I intended.
	[echo https://www.facebook.com/nishiohirokazu/posts/10215068142433508]
