Reference books at MOT
What do you study in MOT (Management of Technology)?" It is difficult to give a quick answer to this question, but since references are listed in the syllabus as public information, it would be a good idea to summarize them.

Therefore, I have consolidated the references of the Technology Management Strategy subject group of [Tokyo Tech MOT http://www.mot.titech.ac.jp/dept_mot/mot_lecture/].

	Strategic Management of Technology (1)
  Managing Innovation (Integrating Technological, Market and Organizational Change) 　J. Tidd, J. Bessant and K. Pavitt, John Wiley, 1997 
  Management of Innovation, Jotidh, John Besant, Keith Pavitt (NTT Publishing) 2004
 Corporate Strategy for Innovation
  R. A. Bergelman, S. C. Wheelwright, and C. M. Christensen, Strategic Management of Technology and Innovation (Top) (Bottom), Shoei, 2007.
  Center for Innovation Research, Hitotsubashi University, Introduction to Innovation Management, Nihon Keizai Shimbun, 2001.
  Junzo Ishii, Akihiro Okumura, Tadao Kagono and Ikujiro Nonaka, Management Strategy (New Edition), Yuhikaku, 1996.
  Kiyonori Sakakibara, An Introduction to Business Administration (1), Nikkei Bunko, 2002.
  Kiyonori Sakakibara, Strategic Theory of Corporate Domain, Chuko Shinsho, 1992.
  Henry Mintzberg, "[Strategic Safari]," Toyo Keizai, 1999.
  D. Besanko, M. Shanley, and D. Dranov, The Economics of Strategy, Diamond, 2002.
  P. Milgrom and J. Roberts, [The Economics of Organization], NTT Publishing, 1997.
  J.B. Barney, The Theory of Corporate Strategy [1] Fundamentals: Building and Sustaining Competitive Advantage, Diamond, 2003.
  J.B. Barney, "Corporate Strategy Theory [Middle] Business Strategy: Building and Sustaining Competitive Advantage," Diamond, 2003.
  J.B. Barney, "The Theory of Corporate Strategy [Part 2] Company-wide Strategy: Building and Sustaining Competitive Advantage," Diamond, 2003.
  M.E. [Porter], The Strategy of Competition, Diamond, 1982.
  M.E. Porter, The Strategy of Competitive Advantage, Diamond, 1985.
  M.E. Porter, Competitive Strategy Theory (1)(2), Diamond, 1999.
  Itami, Takayuki, The Logic of Management Strategy, 3rd Edition, Nihon Keizai Shimbun, 2003.
  Itami, T. and O. Karube, Strategy and Logic of Invisible Assets, Nihon Keizai Shimbun, Inc.
  Tadahiko Kawai, Dynamic Strategy Theory: Beyond Positioning Theory and Resource Theory, Yuhikaku, 2004.
  B. J. Nailbough and A. M. Brandenberger, Corpetitive Management.
  J. Macmillan, Game Theory of Management Strategy: Strategic Analysis of Negotiations, Contracts, and Bidding, Yuhikaku, 1995.
  Ikujiro Nonaka and Hirotaka Takeuchi, "[Knowledge Creation Companies]", Toyo Keizai Inc.
  Susumu Ogawa, The Emergent Logic of Innovation, Chikura Shobo, 2000.
  M. Numakami, History of Technological Innovations in Liquid Crystal Displays: Technology as an Action Chain System, Hakuto Shobo, 2001.
 Innovation Management (Spring Semester)
  Innovation and Entrepreneurship: A Collection of Drucker's Masterpieces" by Peter [Drucker], Diamond, \2100. (A new translation of "Innovation and Entrepreneurship: Principles and Methods", used)
  The Container Story" by Marc Levinson, Nikkei BP, ．2800
  OPEN INNOVATION, by Henry Chesbrough, Sanno University Press, \2310. #OpenInnovation
  The Innovation Dilemma" by Clayton Christensen, Shoei, \2100
  Platform Leadership" by Annabel Gower and Michael Cusumano, Yuhikaku, \3465
 Strategic Management for Research and Development (Autumn Semester)
  STARTUP: A Silicon Valley Adventure, By Jerry Kaplan, Translated by Kazuo Nihira, Nikkei BP Publishing Center, ISBN: 4-8227-4032-3
  Creation and Design of Technology [Yotaro Hatamura], Iwanami Shoten, ISBN: 4-00-005244-6
  ROVING MARS, by Steve Squyres, translated by Midorimiko Momoi, Hayakawa Shobo ISBN: 978-4-15-208860-4 ROVING MARS, by Steve Squyres
  The Essence of the JR Fukuchiyama Line Accident by Eiichi Yamaguchi, NTT Publishing ISBN 978-4-7571-2196-6 C0030
  How to obtain a copy of the "Forum 'Scenario for Sustainable New Industry Creation'" Download from the website of the 21st Century Policy Research Institute, Nippon Keidanren (http://www.21ppi.org/archive/past.html)
 Strategic Management of R&D Organization
  Allen, T.J. (1970) “Information Flow in Research and Development Laboratories”
  Harada, T. (2003) “Three steps in knowledge communication: the emergence of knowledge transformers,” Research Policy, Vol.32, pp.1737-1751. 4.
  Edward B. Roberts and Denis E. Malone, (1996) “Policies and structures for spinning off new companies from research and development organizations,” R&D management, 26(1), pp.17-48.
 Competency Development Competency Development
  Competency Utilization in Practice.
  Practical Competency Model" (Nikkei Business Publications, Inc.)
