20180408Note on task abstraction sticky note
2018-04-08 Posting sticky notes accumulated over the years to Scrapbox
Not completed, so more to come #TODO
And an explanation of "task abstraction" itself #TODO
	[Life purpose is created through abstraction of everyday tasks].

[I want to strengthen human intelligence.]
	Human-computer interaction enhances the ability to create as a system.
 I want to strengthen my intellect to reach where the geniuses of the past have not reached.
 Computers are young and we are the first generation that could do it and should do it now

	[Productivity improvement].
 [Engelbard]
  Not [artifacts], but [methodology
		I want to [verbalize] the methodology, because if you don't verbalize it, you can't program it.

	Strengthening Manuscript Writing
 	Language Support
  Computers ask humans questions to encourage language
  Facilitating Awareness through Chat
  Technology to Support Linguistics
  	[Clean Language], [KJ Method].
		Recall support
  Support for writing, output, and language
  Writing a lot of fragments #Writing method
  	I want to write down whatever comes to my mind immediately without worrying about where it is.
  Intermittent writing
  	agile
   Frequent release
   How do we consolidate that?
  [Incremental Writing] is one solution.
  Reuse of previously written material
  Large amount of data already in place
 	Stimulation promotes verbalization.

 Support and reinforce reading
 	Hard to read everything = hard to read everything "thoroughly".
  	Can't [Incremental Reading] help?
		Bottlenecks/suffering = created from trying to read more than you can.
  E-book management system
  	Handle cut and scanned PDFs well.
  Would it be nice to have something that can be operated without the SuperMemo keyboard?

 stress-free
  Too large a self-image creates stress.
  	I want to be noticed.
   You've done a great job.
  Keep doing what you want to do with your life-size self without hesitation.
   No stress.
   Results performance as a result, not as an objective
  Satisfaction of curiosity
  	Know what you want to know, do what you want to do
   Intrinsically Motivated Driven
  Is stress-free a good thing?
   Stress is also a pleasure?
   Too much freedom is unsettling
   	Why?
    Safe = low risk
    Learning by taking risks
    Moderate stress is necessary.
  Physical Treatment
  	sensory deprivation
   	Eye mask, [earplugs], isolation tank
   meditation
    Kundalini = body movement

	Solving the "Where is that?" question
  Skewering search for everything
  Aggregation of scribbles
  	Example: Facebook dump targeted for search
  A problem that is largely garbage.
   The probability of being "useful" depends on the output destination and other attributes
  	References and mentions increase the probability of being useful
  You should be able to search not only what you have written, but also what you have clipped.
  	Need to facilitate clip action

	[Motivational System].
		Motivation, time and energy management
  A system that can be implemented even if you don't have a lot of time to spare.
  Human capacity for self-management is unreliable and should be managed by computers
  	Same as externalizing because human memory is unreliable.
  Use yourself as an experiment and change things for the better for yourself.
  	Currently, the development speed is slowed down by the fact that it is published as a web service, which makes people worry about unspecified things.
   Wouldn't it be better to ignore all others for once?
  We're stuck with minor modifications to what we already have.
   [2017 Motivation System Renewal].
   [2015 Motivation System Memo].
			English version (in preparation)
   Use of data accumulated in Analytics
		Created a 25-minute song for Pomodoro, but it has not been released yet.

	SpeedReader
 	How to speed-read cut-and-scan PDFs
  I can only assume that existing PDF readers are designed by people who have no knowledge of decent speed reading.
   It's not possible to design something that doesn't allow you to "flip through it."
  I've confirmed that it's technically possible to flip through at a fast enough rate.
  	How to pre-render and read as a texture
  Current frustration: Conversion from PDF to a format readable by this tool is not yet in place.
  Additional Functions
  	I want to skewer search from multiple PDFs and jump to that page immediately.
   Currently, assuming that PDFs are stored in a single folder, the OS functions to skewer, open, and search again to get to the target page, but we want to simplify this procedure.
    It would be nice to have the ability to open PDFs by page.

	organization
 Methodological Support
 	How can the goodness of the methodology be verified?
  	Market reaction?
 What do you want to see happen regarding "the art of verbalization?"
 	It would be good if "good methods" such as the KJ method could be systematized
  You'll notice.

	Assistance in structuring lots of sticky notes and data
		Support for the construction of a [mind palace]=brain index
  	Is 3D the right answer?　I'm unfamiliar with it at this point, so I'm shying away from it, but it's the closest I can get to daily input/output.
  Systematization of knowledge
		It is also intertwined with our core business in terms of supporting the structuring of data accumulated in kintone.

	Market validation
 	prototype
  Market validation is a learning opportunity
  Learn by taking your ideas to market and seeing the reaction.
  More output, more feedback, more input
  Is this the right way to learn?
  	The market doesn't understand value until it's in some form.

	It's hard to keep writing manuscripts for money.
 	I can't stay motivated.
  Mindset of doing it to get feedback

	Increase presence in English-speaking countries
 	Branding in English-speaking countries
  Englishization of content
  Would you translate "the technology behind coding" into English?
  Now translate #intellitech into English!
  For what?
  	To get feedback from outside Japan

	If you find a method useful, you have a desire to share it with others
 	Usefulness = Increased productivity
  I hate the fact that my knowledge system is lost with death.
			I've gone to all this trouble to collect them, and now they're just going to dissipate again.
  I have to make sure that the next generation gets what I got at a lower cost than I did.

	Sokutsugi is not good at biting
 	[Proactive] and Reactive
	Create a new source of income that will grow while staying with your current company instead of changing jobs.
 Writing is mass production and sales outsourcing
	Businesses that start with customer needs and business models do not align with what they "want to do" and are not fun when they put that first.
 We should focus on what we want to do.
 	Why?
  Methodologies for generating wealth cease to work when utility is saturated.
		[post-capitalist society].
