If AI doesn't take away jobs, there will be three fewer days off per month.
2018-04-10
[https://gyazo.com/f5ec0cda55a77146c275265fb479a376]
 Created by Nishio from "National Institute of Population and Social Security Research" [download population pyramid at http://www.ipss.go.jp/site-ad/TopPageData/pyra.html]
 I and the younger generation have grown up in an environment where the population is shrinking every year.

[https://gyazo.com/d5fca9c9b9aa9462669925c2fcf1773c]
 Created by Nishio from "National Institute of Population and Social Security Research" [download population pyramid at http://www.ipss.go.jp/site-ad/TopPageData/pyra.html]
 Over the next 15 years, the population in its 20s will decline by one in seven.
 Let's say you joined a company and did some work in a seven-person team.
 	If the age structure of the team does not change, six people will have to do that job in 15 years.
  If the workload remains the same, the workload per person will increase by 17%.
  A 17% increase in work for someone working 20 days x 8 hours per month would mean an additional 27 hours per month.
   Would you work at least an hour more overtime each day or would you reduce your days off by three days per month?
   20 days x 8 hours a month" is pretty white.
    Cases in which the company is barely able to sustain itself with black labor at this point will not be able to do so.
  We need to cause enough "job loss" over the next 15 years to eliminate 1 in 7 jobs.
  "[Dear AI, please take my job!] Please!" is a desperate need


add (e.g. annex)
[https://gyazo.com/28715298f24b14a9dc0b05e44f70e292]
 If the jobs created in 2000 with an average of 900,000 20-somethings were pushed on to the 20-somethings in 2015 without being streamlined as they were, that's 1.5 times the amount of work, simple math!
 When those born in 1973 were in their 20s, how did those born in 1943, who were then in their 50s, cope with the "foreseeable future" of a 1/3 reduction in the 20-something population in 15 years?
 	I wish they would have redesigned it so that the company could run with 1/3 less workload....
  I wish Master AI had taken my job sooner!" I feel.

The original pyramid. It's hard to tell the difference when you're looking at the whole picture in a rambling way.
[https://gyazo.com/fbbb21fd36d7e84187f78fe9d789307d]
http://www.ipss.go.jp/site-ad/TopPageData/2000.png
[https://gyazo.com/fb8de1552935800604e6cce2c39ed9ae]
http://www.ipss.go.jp/site-ad/TopPageData/2015.png
[https://gyazo.com/991427ea331ad84ebf4b7906b43e7a23]
http://www.ipss.go.jp/site-ad/TopPageData/2030.png
Source: National Institute of Population and Social Security Research [download population pyramid at http://www.ipss.go.jp/site-ad/TopPageData/pyra.html]

 National Institute of Population and Social Security Research [download population pyramid at http://www.ipss.go.jp/site-ad/TopPageData/pyra.html]
 [Population pyramid]
	[Demographics]
