西尾研究室_秘密保持契約
Some people may be intimidated by the staid term "nondisclosure agreement," but it is intended to clarify what not to do, so that people can talk about confidential matters in peace. #Virtual Nishio Lab

Very simply put.
	Article 2: Almost all information in the group is confidential
 Article 5.1: Confidential information may not be communicated to a third party without the discloser's consent.
 Article 5.5: Confidential information may be conveyed to a third party with the consent of the disclosing party.
In other words, the rule is that we should consult with the discloser.

If you find any violations, please contact Nishio via email or Facebook messenger or raise the issue directly in the group.
-----
The word "group" in the following text refers to the Virtual Nishio Laboratory.
In the following text, "written" includes electromagnetic methods such as e-mail, Facebook messages, and Facebook group postings.

A new participant in the group (hereinafter referred to as "A") (hereinafter referred to as "A") and an existing participant in the group (hereinafter referred to as "B") (hereinafter referred to as "First Party") and the existing Participants of the Group (hereinafter referred to as "Second Party") hereby agree and enter into this Agreement as follows concerning the handling of information disclosed mutually between First Party and Second Party. Of the parties to this Agreement, the party who discloses or is in a position to disclose confidential information shall be referred to as the "Discloser" and the party who receives or is in a position to receive disclosure of confidential information shall be referred to as the "Recipient.

第１条（目的）
This Agreement sets forth the confidential treatment of confidential information disclosed mutually between the First Party and the Second Party in connection with the following purposes (hereinafter referred to as the "Purpose of Disclosure") This Agreement sets forth the treatment of confidentiality of confidential information disclosed mutually between the First Party and the Second Party in connection with the following Purpose of Disclosure (hereinafter referred to as "Purpose of Disclosure").
Purpose of disclosure: Intellectual study of group members

第２条（定義）
1. For the purpose of this Agreement, "Confidential Information" means any and all information disclosed by the Discloser to the Recipient within the Group during the term of this Agreement in connection with the purpose of disclosure.
2. Notwithstanding the provisions of the preceding paragraph, information for which the recipient can prove in writing or otherwise that it falls under any of the following items shall be excluded from confidential information.
(1) Information already in the possession of the disclosing party before or at the time of receiving disclosure from the disclosing party
(2) Information that is already public knowledge at the time it is disclosed by the disclosing party
(3) Information that becomes public knowledge through no fault of the recipient after being disclosed by the disclosing party
(4) Information lawfully obtained from a third party who has a legitimate right to the information without any obligation to maintain confidentiality
(5) Information developed or created independently without using the Discloser's confidential information
(6) Information that the disclosing party has expressly indicated is excluded from confidential information

第３条（目的外使用の禁止）
The recipient shall not use the confidential information for any purpose other than the purpose of disclosure without the prior written consent of the disclosing party.

Article 4 (Restrictions on Reproduction, etc.)
(2) The Recipient shall not reproduce, duplicate or alter the Confidential Information disclosed by the Discloser, in whole or in part, without the prior written consent of the Discloser. The Recipient shall also treat reproductions, copies and altered materials as Confidential Information, and shall keep them in strict confidence, clearly distinguishing them from other materials.
	(Proposed revision based on Article 15: "The recipient furthermore, the recipient shall" -> "In addition, the recipient shall" 04/13/2018)

第５条（秘密保持）
1. The Recipient shall manage and maintain the Confidential Information as confidential with the duty of care of a good manager, and shall not disclose or divulge said Confidential Information to any third party other than the Disclosing Party without the prior written consent of the Disclosing Party.
2. Notwithstanding the provisions of the preceding paragraph, if the Recipient is required to disclose Confidential Information pursuant to a lawful and proper order, request or formal procedure of a court, prosecutor or police, the Recipient may disclose such Confidential Information to the extent necessary to comply with such order, etc. In such case, however, the Recipient shall notify the Discloser in advance of the portion of the information to be disclosed and shall use its best efforts to ensure that the confidentiality of the information is maintained and shall follow the reasonable instructions of the Discloser.
3. The recipient may disclose confidential information only to the minimum number of its own directors, officers, and employees who need to know the information for the purpose of disclosure, and to attorneys, certified public accountants, tax accountants, patent attorneys, and others who are obligated by law to maintain confidentiality.
4. In the case of the preceding paragraph, the Recipient shall have its own officers and employees to whom it has disclosed Confidential Information assume obligations equivalent to those it assumes under this Agreement, and shall be jointly and severally liable with such officers and employees for any breach of any provision of this Agreement by such officers and employees.
5. the Recipient may disclose the Confidential Information to a third party with the prior written consent of the Discloser. In this case, the Recipient shall notify the Discloser in advance in writing of the contents of the Confidential Information to be provided, the date of provision, the method of provision, the place of provision and the counterparty type of provision, and any other matters necessary to specify the provision of the Confidential Information. In addition, the Recipient shall make such Third Party to whom it has disclosed the Confidential Information assume the same obligations as it assumes under this Agreement, and shall be jointly and severally liable with such Third Party for any breach of any provision of this Agreement by such Third Party.

Article 6 (No Obligation)
The LICENSEE and JQA shall mutually confirm the following items.
(1) The execution of this Agreement shall not obligate the disclosing party to disclose any information to the recipient.
(2) That the disclosure of Confidential Information to the Recipient hereunder shall not operate as an agreement to enter into any transaction, nor shall it preclude the Recipient from considering and executing by itself or with third parties, in compliance with its obligations set forth herein, transactions identical or similar to the transactions referred to for disclosure purposes. (2) Nothing herein shall prevent the Company from considering and executing by itself or with third parties transactions identical or similar to the transactions referred to for disclosure purposes in compliance with its obligations hereunder.
(3) The Confidential Information is provided by the Discloser to the Recipient on an "AS IS" basis, and the Discloser is under no obligation, express or implied, to warrant to the Recipient that the contents of the Confidential Information do not infringe the rights of any third party.
(4) No obligation to make any warranty as to the fitness for a particular purpose, accuracy, currency, legality, etc. of the Confidential Information under this Agreement, or as to the Recipient's use of the Confidential Information or the results thereof.

第７条 （保証）
Notwithstanding the provisions of item 3 of the preceding Article, the Discloser shall warrant to the Recipient that it has the lawful authority to disclose the Confidential Information under this Agreement.

第８条（知的財産権）
Disclosure of Confidential Information by the Discloser to the Recipient under this Agreement shall not transfer or grant to the Recipient any intellectual property rights or any other rights of the Discloser or any third party contained in the Confidential Information.
2. If the Recipient, in the course of the purpose of disclosure, comes to obtain technical results such as technical inventions, devices, know-how, etc., by using the Confidential Information disclosed by the Discloser, the Recipient shall immediately report to the Discloser to that effect.
3. The ownership and handling of all intellectual property rights pertaining to the technical results in the preceding paragraph shall be determined through separate consultation between the SUPPLIER and the SUPPLIER. The technical results shall also be regarded as confidential information until the attribution is determined through such consultation.

第９条（漏洩時の措置）
1. When the recipient recognizes that confidential information has been leaked or is suspected to have been leaked to a third party other than the disclosing party, regardless of the cause of the leakage, the recipient shall immediately report the situation to the disclosing party, investigate whether or not the leakage occurred, and if the recipient recognizes the fact of leakage, take necessary measures to recover the original state and prevent recurrence. If the recipient recognizes the leakage, the recipient shall take necessary measures to restore the original condition and prevent its recurrence.
2. In the case of the preceding paragraph, the recipient shall follow the reasonable instructions of the disclosing party.

Article 10 (Prohibition of Assignment of Rights and Obligations)
Neither the First Party nor the Second Party shall, without the prior written consent of the other party, assign, encumber, transfer, or otherwise dispose of all or any part of its rights and obligations arising under this Agreement or its position hereunder to any third party.

第11条（損害賠償）
1. When confidential information is leaked for reasons attributable to the Recipient and this causes damage to the Discloser, the Recipient shall compensate the Discloser for the damage.
2. In addition to the preceding paragraph, if the LICENSEE and JQA violate this Agreement and cause damage to the other party, the LICENSEE and JQA shall compensate the other party for the damage suffered as a result of such violation.

第12条（差止）
If the Recipient breaches this Agreement, the Discloser may demand that the Recipient be enjoined from using the Confidential Information disclosed to the Recipient.
The provisions of the preceding paragraph shall not preclude the disclosing party from making a claim for damages against the recipient.

Article 13 (Term of validity of contract)
The term of validity of this agreement shall be one year from the date of commencement of group participation. However, it shall be extended for another one (1) year unless a written request is made by either party at least one (1) month prior to the expiration of the contract, and the same shall apply thereafter.
The provisions of Articles 2 through 13 and Articles 15 through 17 of this Agreement shall remain in effect even after termination of this Agreement (regardless of the reason for termination).

第14条（反社会的勢力の排除）
The First Party and the Second Party represent and warrant to the other party that they do not fall under any of the following items and will not fall under any of the following items in the future.
(1) The company itself, its officers, or any person substantially involved in its management is a member of a crime syndicate, a member of a crime syndicate, a person who has not been a member of a crime syndicate for five years, a quasi-organized crime syndicate member, a company affiliated with a crime syndicate, a general assembly dealer, a person who is a target of social movements, etc., or a special intelligence crime group or other anti-social force (hereinafter collectively referred to as "anti-social forces"). (hereinafter collectively referred to as "Anti-Social Forces"). 
(2) Having a relationship in which antisocial forces are deemed to control the management of the company.
(3) Having a relationship in which antisocial forces are deemed to be substantially involved in the management of the company.
(4) Having a relationship that is deemed to involve the use of antisocial forces, such as for the purpose of making unjust profits for oneself or a third party, or for the purpose of inflicting damage on a third party.
(5) The Company is recognized as being involved in providing funds, etc. or benefits to antisocial forces.
(2) The relationship between the parties shall be such that the parties are able to
(6) If the company's own officers or persons substantially involved in the management of the company are socially criticized as antisocial forces, or if the company's own officers or persons substantially involved in the management of the company are socially criticized as antisocial forces.
(2) The relationship between the parties shall be such that the parties shall have a relationship to be
(2) Both the First Party and the Second Party represent and warrant to the other party that they will not by themselves commit any of the following acts or cause a third party to commit any of the following acts
(1) Unreasonable demands that use violent or threatening language or behavior.
(2) Any act that defames the other party's honor, credit, etc.
(3) Interfering with the other party's business by using deceptive means or force.
(4) Other similar activities.
(3) In the event that the other party is found to have violated any of the preceding two clauses or to have made a false declaration, either the First Party or Second Party may immediately terminate this Agreement upon giving written notice of its intention to terminate the Agreement. In this case, the other party who has violated either of the preceding two paragraphs or made a false declaration may not claim damages based on such cancellation against the other party who exercised the right of cancellation.
4. The cancellation provided for in the preceding paragraph shall not preclude a claim for damages against the other party by the party who exercised the right of cancellation.

第15条（改訂）
If a proposed revision is posted to the group and no objections are posted by any member within one week thereafter, the group members shall be deemed to have agreed that the confidentiality agreements with all other members shall be revised in accordance with the proposed revision.

第16条（準拠法、管轄裁判所）
The validity, interpretation and performance of this Agreement shall be governed by and construed in accordance with the laws of Japan.
2. The Tokyo Summary Court or the Tokyo District Court shall have exclusive jurisdiction over any and all disputes, lawsuits, or other controversies between the Company and users, etc., depending on the amount of the suit.
	(Proposed revision based on Article 15: "between the Company and the Users, etc." -> "between the participants of the Group" 04/16/2018)

Article 17 (Matters not stipulated in contract)
If any question arises concerning any matter not stipulated in this Agreement or any provision of this Agreement, both the LICENSEE and the SUPPLIER shall consult with each other in good faith to resolve such question.
