Ignore economic rationality
	There are various cases where it is better to ignore [economic rationality] in creating something new.
 Think about [people who don't need to make money] to survive.
 	People who have accumulated sufficient retirement funds #Early Retirement
  After [basic income] was introduced
 Make things because you want to make them without considering economic rationality.
  But isn't it possible to create and be satisfied with that?
  Cost of communicating to others what has been generated
  Cost of adjusting to meet the needs of others
		Isn't there an incentive to pay those costs?
 As a result, new things are created, but are they unlikely to develop into [innovations] that affect a large number of people?

discussion
	Most people don't make things for spontaneous motives in the first place.

relevance
 [kensuu https://twitter.com/kensuu/status/987919591006334976]
 	>I don't think [creativity] is compatible with a community that is paid for. So I think a society where BI is implemented will accelerate innovation.
	nishio
 	>I also think that the amount of new things created would increase if there were BI, but I am concerned that creators who are financially satisfied will create new things based on their own impulse to create, and then act "satisfied and throw them away and start creating something else.
 kensuu
 	>I think the pressure to connect with people is stronger than the pressure to connect with money, so I think it will be a hardship to not be able to throw it away.
	nishio
 	>I guess it depends on each person which pressure is stronger, but even if the pressure of "I have to make money" were to disappear, other pressures might just be created.
	kensuu
 	>I think that's why people like Shintaro Mercari, a serial entrepreneur who doesn't have to earn money until he dies, start businesses over and over again.
 nishio
 	>It is true that serial entrepreneurs work even when they don't have to. The desire to change society for the better may be free to flap their wings when they no longer have to earn a living to keep themselves alive.

relevance
	[Good engineers can't be caught with money.]
