Speed Reading Experiments and U Theory
An interpretation from a U-theory perspective on a speed-reading experiment in which the reader reads at incomprehensible speeds.
 'Is there any point in reading so fast that you can't understand what's in it?' "Doesn't it make sense?" That is my existing thought.
 Let go" of that existing framework (U Theory) #Existing framework
 That this is necessary can be explained by [the trade-off between search and use].
	After letting go and experimenting, we realized that it is not appropriate to use "[comprehension]" as a KPI in the first place.
 I wrote more about this in [definition of comprehension].

>[U Theory] talks about the need to [let go] of the existing once in order to [crystallize] a new concept, in short, the [trade-off between exploration and use] in [reinforcement learning]. If you only use the best method you know, you will not be able to find a better method. But if we keep trying new things in search of new encounters, we will not be able to reap the benefits of using better methods.

>"What's the point of reading at a rate that doesn't allow for a good description of what's in it?" I ignored the voice from my past self that said, "I've been trying anyway, but I'm getting blah, blah, blah crystallized. Just because I can now explain the contents of the book over time, does that make sense? I should ask. Even if I could perfectly explain the content of a book, it would be nothing more than a [degraded copy] of the author. It has not created any value to society.
>To create new value, make it easier to understand, make it shorter, combine it with other things.... Improving comprehension is preparation for the next move, not making it an end in itself.

tokoroten
>In my case, I think it is to talk to people about the half-baked ideas I have - it is unhealthy to spend time thinking about something that might have value, so I try to talk to people when I have it all together.
 >When it's a new "idea", isn't it already crystallized? I guess talking to people, even halfway through, isn't the "prototype and validate" phase.

>From the viewpoint of pragmatism, which says that the value of knowledge is whether or not there is [actual benefit] in using it, [the value of reading] is measured by "what you have produced" by reading a book.

[2014-04-16 https://www.facebook.com/nishiohirokazu/posts/10203077709640182] [2014-04] [2014]