acquisition cost
[Acquisition cost
>In general, those who have not mastered the skill of doing X may think, "It costs a lot to do X, so let's think of a workaround," while those who have mastered the skill may think, "Even if I take the cost of learning into account, it is better to quickly learn and do X than to think of a workaround.
[2017-04-15 https://www.facebook.com/nishiohirokazu/posts/10211846008402171]

How much does it cost to learn?
	That can't be known in advance.
 You can't know in advance, so you have to do something like "try to learn for an hour first" or else you can't estimate.
 The problem is that they don't do those challenges and assume the cost is too high and don't want to learn.

	[who are timid to learn]

	>People who estimate the cost of learning by impressionism as high and end up taking detours.
 [Estimates are often wrong.
 Could use a mathematical model to describe what happens if we make a mistake in estimating acquisition costs #Experiment needed
 	On the other hand, they find the cost of the detour cheaper.
  There is a cost of acquisition and a cost of execution after acquisition.
		Is it related to estimating techniques in uncertain situations?
  Related [Agile Estimating and Planning].


 [Shibukawa]
 >That may be true when it comes to things that can be multiplied like skills, but there are also areas where it's like adding up knowledge. I feel that no matter how far one goes in mastery, it will ultimately converge on something like "the weight of each individual's [waist].
 > I am not that attached to food, so it is a hassle for me to explore new restaurants, so I ask my wife to help me find places to eat or rely heavily on people in the know. I basically don't watch TV programs, and only watch those that are pushed to me by people I know, saying, "I think you'll like this, Mr. Shibukawa. I think I am more open to reading and translating English documents and writing books than others. I think Nishio-san's example can also be broken down into areas such as learning the language and thinking about the overall workflow rather than just the tool itself.
 > I think that the use of time resources is the same, and [curiosity] is also a finite resource, and there are several areas where people have "consumption < recovery", but it varies from person to person. I think there are a few areas in which people's "consumption < recovery" is different, but I think people are much less interested in invisible (non-physical) structures other than relationships or meta-knowledge that transcends fields.

