Pursuit of Excellence
[Drucker].
>The highest priority for one's own [growth] is the pursuit of excellence. From this comes fulfillment and confidence.

　Many people think, "I can't excel," [but] it's not hard to overtake those who avoid striving for excellence.
　Excellence is [a necessary condition for knowledge exchange] and has nothing to do with the total amount of knowledge
　　From the opposite perspective [one can learn from those with less knowledge].


>The highest priority for one's own growth is the pursuit of excellence. From this comes fulfillment and confidence. Competence is significant because it not only changes the quality of work, but also changes the human being. Without competence, there can be no good work, no confidence, and no personal growth.
[Management of Nonprofit Organizations] p.206
 Echo V [self-development].
	 Chapter 1: Self-Growth
			responsible job

>The first priority for the non-profit executive’s own development is to strive for excellence. That brings satisfaction and self-respect. Workmanship counts, not just because it makes such a difference in the quality of the job done but because it makes such a difference in the person doing the job. Without craftsmanship, there is neither a good job, nor self-respect, nor personal growth.
	[https://gyazo.com/80e664becda9b7e1788e4e8cb7d8bcab]
		>The first priority for the non-profit executive’s own development is [to strive for excellence]. That brings [satisfaction] and [self-respect]. Workmanship counts, not just because it makes such a difference in the quality of the job done but because it makes such a difference in the person doing the job. Without craftsmanship, there is neither a good job, nor [self-respect], nor personal growth.
	[Managing the Non-Profit Organization: Principles and Practices]

[Drucker].
[Professional Origins].
[Pursue excellence where the quality of work changes the human being itself. http://www.iot.ac.jp/manu/ueda/column/080223.html]
 [The highest priority for personal growth is the pursuit of excellence.
 [From excellence comes fulfillment and confidence.]
