The flow of legitimate peripheral participation theory emerges.
---
 This issue of "Organization Science" is a special issue on "Learning in the Field," with an article by [胖 Saeki], in which the concept of [conviviality] by [Ilyich] is mentioned, concluding that ultimately, learning is about creating [convivial] relationships with others. Interesting.
 Organization Science Vol.48 No.2 pp.38-49 Min Saeki "What does it mean to 'learn' in the first place: before and after [legitimate peripheral participation] theory."
 A discussion of the flow of [psychology] up to the creation of the orthodox peripheral participation theory and the possibility of subsequent change.

 After Watson said in 1913 that psychology would be a natural science if it focused only on behavior (conversely, anything else ain't science), psychology entered the heyday of [behaviorism].
  The idea in this era was that "if a behavior is rewarded immediately after it occurs, the behavior is reinforced" ([operant conditioning]).
  This, however, has been out of order for a long time.
 Krechevsky 1932
 	Analysis of the learning curve of discrimination learning in rodents
  Rats don't learn by having their behavior reinforced.
  Have a "hypothesis" of what to use as a clue to discriminate, and abandoning false hypotheses rapidly increases the percentage of correct answers.
  insisting that
 Tolman 1948
 	From the behavior of rats that have learned the shortest path in a maze, but cannot follow the path by placing obstacles (i.e., cannot reach the path by the combination of learned behaviors),
  Argued that rats learned not a set of behaviors but a [cognitive map] of where food is located
  	This is now experimentally shown to be [positional cells] in the [hippocampus], right?
 Two more examples are given, such as
 The bottom line is that the "learning by stimulus-response association" model is broken with respect to animals.

 However, CAI and behavioral therapy based on this model are producing results. Why are they getting results when they are based on the wrong model?

 From here, the story takes an even more shocking turn.
  When a chimpanzee and a human 3-year-old learn to operate a device that does not allow them to see how it works by following a specific procedure to remove candy by showing them a model behavior, both learn in the same way.
  Then you get to a state where you can see the inner workings and know, "What the heck, most of the steps are pointless.
  Chimpanzees skip meaningless steps, while humans dutifully perform futile ones. (Whiten+ 2005)
  	[Humans continue with pointless procedures].
  The major difference between humans and other animals is "culture," the "blind" transmission of what is taught as "supposed to be done this way" with the meaning unclear (Gergely&Csibra 2006).
  My interpretation
  	Rather than a species in which each individual thinks and acts on its own, a species in which some smart individuals create new rules and the remaining individuals blindly follow those rules without thinking for themselves may be more beneficial for survival, and natural selection may have selected that species.
   This is quite shocking to my value system, which always endorses thinking for oneself.

 Now, in the overall story, this story is a side note
 Returning to the original path, four landmark studies were published in 1956, when "this is how behaviorism failed and what other paths could be taken" were being tried and tested.
 	Bruner+'s "Humans formulate hypotheses, test them, and revise them,
  Miller's "short-term memory is 7±2", [Miller1956].
  Newell&Simon's theorem proving system,
  Chomsky's generative grammar

 Then two ideas appeared
  Focusing on human information processing, Milner+ believes that the key concept is "[plan]".
  Neisser's cognitive psychology idea that humans are trying to generate meaningful coherence from sensory input
 The latter will become mainstream.
 Winograd's understanding of natural language (the famous [SHRDLU]) led to an increase in research on how to express knowledge and language, and research on identifying and fixing bugs from the perspective that students who make mistakes in math at school are also making mistakes because of bugs in the programs in their brains.

 Piaget 1974 said that an anthropological point of view was needed in response to this.
 However, the idea was shown to be valid in Suchman 1987.
 Situated ([embedded in] a situation) communication is communication between a tool and a person, where. #Situated
 Lave was impressed by the word Situated and proposed the concept of Situated Learning in 1991.

 Here, learning is defined as "the formation of a person's identity as a member of a community of practice through participation in that community.
		[Legitimate Peripheral Participation and Scaffolding http://www.gsis.kumamoto-u.ac.jp/opencourses/pf/3Block/09/09-1_text.html]
 Saeki criticizes this orthodox theory of peripheral participation for not asking the question, "Why do people learn?

 Iriichi's conviviality is usually translated as "[self-reliant symbiosis]," but Furuse uses the term "[conviviality]" to refer to enjoying the company of others.
 In order to create a convivial society, he introduces Reddy's observation of his own child, and says that we need a second-person, rather than a third-person, relationship, in which the subject is responsive to our actions, and basically likes to have fun.
 This leads to the conclusion that to learn is to consider others as convivial beings and to try to create convivial relationships with them.