Thinking about adult developmental disabilities
 精神科治療学 Vol.32 No12 pp.1549-1559
  "Thinking about [developmental disabilities] in adults."

	Original reference for this figure, which was [discussed on Twitter at https://twitter.com/jingisukaan1/status/985404890838020096
  [https://gyazo.com/30787ea712efa401369c22ecf492964d]
		I thought it would be harmful for it to be separated from its context and left on its own, so I explained
  The author of this figure is [Hideo Honda].
   Shinshu University Hospital, Department of Children's Mental Health Care
		[I want to do], [I should do].

	座談会
 	A roundtable discussion among four supporters who both admit to having some developmental traits.
   [nishio.icon] I am very sympathetic to the "brief self-introduction" and the questions "how long is brief?" and "from what point did you introduce yourself?
		[Yui Hirono]
  	NPO DDAC (Developmentally Disabled Adults Association)
   [ADHD]
  [関根 礼子]
  	Specified Nonprofit Corporation Nest Japan
   臨床心理士
   [AS]
		[樋端 佑樹]
  	Department of Children's Mental Health Care, Shinshu University Hospital, etc.
   精神科医
   [ADHD]+[ASD]、ADHD多め
  [本田 秀夫]
  	Shinshu University Hospital, Department of Children's Mental Health Care
   [AS] Main, [ADHD], [motor tic].

	If you don't know your own characteristics, you can easily become maladjusted by trying to live in a way that doesn't suit you.
 Parents say, "I'm out of college, but I can't get a job."
 	If you are visually dominant and have a good memory, you can study.
  A high school education does not lead to a job, and people who have a relatively good work history are actually not very well educated.
  Conversely, a mismatch with the expectations of those around you, "I'm out of college, why can't I do it?
		High school teachers would let them go on to higher education anyway.
  	Transitional period, a time when if you want to go on to higher education, you can do it.

	Difficult interpersonal relationships in the workplace
 	Campaign for cheerful greetings to reduce turnover
  	I don't see the point of brightening it up.
   I don't understand the logic behind thinking that forcing people to greet each other cheerfully will reduce turnover.
   [nishio.icon]I don't know either and that's just a problem with the intelligence of the management.

	I can't cut corners just right.
 	They work hard and finish in 30 minutes the work that a normal person would do in an hour, and then they are given more work to do.
  In order to get people with ASD to perform, it is better to specify only the outcome and let them do it in any way they want.

	診断
 	From a doctor's point of view, it's based on whether you meet the diagnostic criteria.
  The parties are "in trouble."
  "Be there for the hardship."
  Diagnosis is not the same as whether or not the patient is in trouble environmentally.

	就労
 	I want to help people and make them happy.
   But when I work, I get angry.
  Otoko wa Tsuraiyo, Tsuribaka Nisshi
  	The protagonist can't do anything out of the ordinary.
  It would not be fun if all the characters in "Doraemon" were "Mr. Dekisugi-kun.
  Here is the figure on the topic
 		Figure often used by Dr. Honda in his lectures
   [https://gyazo.com/30787ea712efa401369c22ecf492964d]
   I teach people with developmental disabilities, both adults and children, to make their personal lives a priority.
    Think about whether you need it for your life and discard what you don't seem to need.
    I'll only do a few quotas that I really need to do.
  It would be good if we could openly say, "I am good at this, I am not good at that," and combine the two in society as a whole.
  If you don't have a job that is enough to make money to play with, you will be crushed.

	Good support, unwanted support
 	Easily deceived by others
  	Poor money sense
   I can't read the other side of things.
  It must be fun to be with all of you."
  	I don't really enjoy it.
   Don't impose your values on me.
   When someone asks me out, I'm burdened because I don't know how to say no.
   基本的に個別
   	Different people, different things.
    Requires pre-assessment and post-assessment coordination
  Don't try to adapt them to society.
  	It's good to tell people flat out that this is how the majority thinks.
   It's up to each person to decide whether they want to be with the majority or not.
  Many people lump it all together as "developmental disabilities" and don't have the training to look at each person individually.
  	Look at each person and make the most of each person
    [nishio.icon]This is the same idea as [100 different personnel systems for 100 different people].
  It's faster to get people to change than to change the person.
   The obstacle is that it is not easy to change.
   The parties cannot live without [cross-cultural] skills.
   Supporters don't always have those skills.
   It's difficult to support someone with low [social skills].

[非定型発達]
