I'll say the important thing again and again
When I used to give presentations at various technical events, I had an obsession with the idea that I should not be confused with other people's material.
Later, as I began to take the time to teach things, I became acutely aware that "surprisingly many people don't know what they think they 'all [naturally] know.

To leave out "what you think you know of course," and to leave out "what others might talk about," and only talk about the newly created parts,
It is like a cherry tree whose roots are thrown away, the trunk is thrown away, and only the newly bloomed flowers are torn off and passed on. #parable

It will serve as a temporary "flower watcher," but it will soon die because it has not taken root.
It does not function as a "blooming system" that is beneficial in the long term.

In the first place, human beings do not learn something just by hearing it once. Important things need to be learned over and over again.
So I think it is important to have an attitude of "I'll say it again and again because it's important," rather than fear duplication.
#Don't fear duplication

relevance
	Knowledge that is connected with various types of knowledge in a consistent manner is correct knowledge [consistency theory].
	The references should be mentioned whenever possible.
  It is beneficial in the long run to have good things properly visualized by being mentioned by many people in this way.
 You should not try to be a faithful copy of the literature you refer to.
 	A faithful copy can be obtained by going to the library and requesting a copy, so a human being should not bother to do it.
  Value is added by discarding, additional explanations, illustrations, etc. based on one's own sensibilities.
  People in the world will evaluate whether the value added is good or bad. If not, people will refer to the source of the quote. That is fine.
 If there are similarities after the fact in references that were not referenced
 	The fact that multiple people independently think similarly means that this idea is important, and I'd argue that it's important.
  If the literature is from a well-known person
  	It is my fault that I was not aware of the existence of the literature beforehand.
   On the other hand, the majority of readers are also unaware of that literature
    I know enough about the subject to write about it, and I couldn't have discovered it beforehand.
   You can be confident that you have single-handedly arrived at the same idea as the famous man.
   Therefore, you can speak your mind with pride, and you can also proudly introduce the fact that there are books written by famous people that are similar to it in the past.
			(Specifically, toward the end of his writing, he discovered that Einstein had written something similar.)

	concrete example
 	After writing "The Art of Coding," I was told it was similar to "[Master Programmer]."
  [The keynote speech of "Self-Management Strategies for Engineers" overlapped with Mr. Oikawa's keynote speech just before the event.
  	[MANABIYA "Technology Trends for Growth as an Engineer" Audience Notes - Captain Pat's Journal https://taityo-diary.hatenablog.jp/entry/2018/03/27/001011]
   [MANABIYA "Self-Management Strategies for Engineers" Audience Notes - Captain Pat's Journal https://taityo-diary.hatenablog.jp/entry/2018/03/25/133644]
  [Principles of technology that engineers should learn] and [Recommendations for self-taught programmers - Nikkei Trendy Net http://trendy.nikkeibp.co.jp/atcl/pickup/15/1003590/042501673/?rt=nocnt]

#Mindset #Policy
