Early adopters and limited resources
 [Early adopters] and [limited resources]
 Early adopters gain [first mover advantage].
 One of the advantages of being an early adopter is that if you're in a situation where [resources] are limited, the sooner you get started, the shorter the waiting time. I thought about this when I saw the measles vaccine.
  I heard on Sunday that there was a measles outbreak in Okinawa and that it might spread during the Golden Week holidays.
  By Friday, Nakano, Tokyo, and Nihonbashi were also buzzing with cases of the disease as soon as it appeared.

	Why do early adopters occur?
 	One cannot interpret a benefit one has not earned.
 	Those who have benefited first expect to benefit in subsequent years, and those who have never benefited do not.
		Discounting of value by waiting occurs.
  Early adopters increasingly value first-mover advantage, the rest do not
  Expected profit
  #NecessaryExperiments
		The cost of waiting by being inundated with
  	Waiting by constant capacity
  If the outflow is constant, the profit is reduced by sharing it among a large number of people
  	It's easy to see why the person who came early to get it in this case would benefit, but not why they came early to get it.
   There are fluctuations in the speed of information transmission.
   	A model in which we can make choices that make it easier for information to come to us, but we act immediately once the information comes to us.
    In reality, isn't the problem that the information is coming but it takes time to decide to act?
			In the model where information is passed randomly from the surroundings, the case where the action is taken based on the first piece of information, and the case where the action is taken after multiple gatherings and increased confidence, the latter is naturally delayed in time.
   Reinforcement learning [multi-armed bandit] to see if a new bandit will pull it when it appears #Experiment needed
   Wouldn't a model that uses the average of the opinions of those around you to infer prospective value after a sufficient number of opinions have been gathered have the same effect as [generalists are selected when evaluated by summing]?
