比較優位とπ型人材
	[Comparative Advantage = It is more efficient to do only what you are best at and trade with others for other things.
 [π-type human resources] = should have expertise in multiple fields.
	These two views appear to be at odds.
 What's funny?

	Comparative advantage is an argument for consumer goods for which there is sufficient demand
 	Consider that producing 10 wines is preferable to producing 100, and 100 is preferable to producing 10 wines.
  This only works if there is sufficient demand.
  Extreme examples for clarity
  	Let's say you alone are producing 10 things a week, one day a week, for which there is only a demand for 10 things in the world.
   It doesn't make sense for you to devote 5 days a week to it and produce 50.
		Rickard claimed comparative advantage in 1819.
  	We live in a time when things are basically scarce, and we don't think that demand is going to come to a head.

	Comparative advantage ignores distribution costs.
 	Portugal can produce a liter of wine for one person and a meter of woolen fabric for two people.
  	Let's say three people are now producing one unit each.
  England can produce a liter of wine with five people and a meter of woolen fabric with four people.
  	Let's say we have nine people producing one unit each now.
  Portugal outperforms the United Kingdom in both productivity
  But by concentrating on more productive wines, they make three units of wine.
  England makes 2.25 units of woolen fabrics by concentrating on more productive woolen fabrics.
  Originally, two units each were produced worldwide, but after concentration, the number has increased to three and 2.25 units, respectively.
  Although the number of shipments has increased worldwide, it is now necessary to transport two units of goods compared to the pre-concentration period.
  As an extreme example for simplicity, let us assume that the distribution of one unit of an item costs 100 units of wine.
   Naturally, no trade will take place.
		With respect to knowledge distribution, how much difference is there in distribution costs if one person has knowledge in two areas versus two people with knowledge in each area?
			As a concrete example, if we compare "a patent attorney who understands software" with "a two-person team consisting of a patent attorney who does not understand software at all and a software engineer who does not understand intellectual property at all", the communication cost between the latter two is much higher than that of the former.
		Not distribution costs [transaction costs].
  	Specific example 2, I was assembling a shelf I bought at MUJI and thought, I am not highly skilled at assembling shelves, so the idea of comparative advantage would mean that I should outsource.
   If MUJI offered an "assemble and deliver" service, I might have used it. But since it is not offered, it would cost me to find someone else to take care of it myself in order to outsource it. (= transaction costs)
   The assembly itself took less than 30 minutes; I built it myself because I didn't feel I could find and commission an outsourcing company within 30 minutes. What was the right thing to do? Is outsourcing still the right thing to do?

	Knowledge is not so much about "producing a lot of quantity".
 	Linguistic knowledge is easily replicated.
		The aim is to increase the probability of "[knowledge binding]" occurring stochastically.
		Devotion to one thing lowers the probability of bonding because it lowers the [diversity of information] that flows into one person.


	The production of goods and the production of knowledge are very different in nature.
 It is dangerous to bring strategies that have been beneficial in the production of goods directly to the production of knowledge.
