better late than never
[Slow and steady is better than fast and steady.
　A skillful but slow man is no match for a poor and fast man.

	["Slow and steady is better than fast and steady.]
 [Done is better than perfect]
 	[The Done Manifesto]

 >If you are a poor soldier, you have not yet mastered the art of war.
		[Sun Tzu]
 	The soldiers have heard of poor tactics, but they have not yet mastered the art of war
 >You are too slow to hear. I have not heard of it yet.
		Emperor Kammu [Shoku-nihon-ki - Wikipedia https://ja.wikipedia.org/wiki/%E7%B6%9A%E6%97%A5%E6%9C%AC%E7%B4%80], which seems to be in volume 40.

	It is used in the sense of "do it quickly with poor methods rather than trying to do it the perfect way and doing it too slowly.
 Sun Tzu, on the other hand, says, "There are many examples of successes achieved by doing things poorly and quickly, but I have not heard of many cases of successes achieved by prolonging the process in pursuit of perfection.
 	Some have pointed out that this is not a nuance.
  [General Association Sun Tzu Juku Column http://sonshijyuku.jp/column/column003.html]
			>After achieving a certain level of victory (this is the meaning of "poor"), when faced with the choice between whether or not to continue the war and gain new war results (so to speak, additional benefits), one must strictly refrain from making rash actions driven by immediate profits and emotions, and must be aware that the ultimate goal is to preserve one's own nation, and that one should quickly achieve one's political objectives (by means of war) by completing the war even though it may be an inadequate victory (this is the meaning of "quick"). The ultimate goal is the preservation of one's own country, and one should quickly achieve one's political objectives (by means of war) by seizing the initiative, even if it is an inadequate victory (this is the meaning of speed).
   > The root of this is the idea that "war is like a wildfire, and if you get carried away by victory and behave according to your desires, you will end up burning yourself out. Therefore, it is most important to be patient, stand firm, and restrain the spear at the appropriate point.
   > The tactical aspect of this is to say, "Don't eat the bait," and "Don't follow the feigned north" (Pt. VII, Military Conflict).
   > In other words, the former means, "Let's just kill them quickly, as the ancients also said that soldiers appreciate speed. It would be wiser to achieve the original political objective quickly, to preserve and strengthen the nation's strength, and to prepare for the invasion of multiple enemies who occupy the surrounding areas.
   > In other words, Sun Tzu's "poor speed" can be understood as the same as Lao Tzu's "know when you have enough" or "if you know when to stop, you will never be defeated". This is exactly what Lao Tzu meant when he said, "If you know when to stop, you will never be defeated. Shingen Takeda, a famous Japanese military commander, said, "In a battle, if there are ten battles, stop at six or seven minutes and retreat. Do not win too much. A victory of eight minutes is already dangerous, and a victory of nine minutes or enough is the groundwork for a heavy defeat for your side. This is an excellent description of what Sun Tzu meant by "too much speed.
 	[https://fujii-yuji.net/2016/12/theartofwar.html "My speed is better than my skill" - Sun Tzu didn't write such a thing - to those who always say "my speed is better than my skill" - Yuji Fujii::dot net To those who always say "poor speed" - Yuji Fujii::dot net]
 		>"If you prolong the war with expeditions, you won't be able to maintain the logistics, and your country's economy will collapse.
 		>I'm talking about taking a strategic and planning perspective of logistics and national economy, not tactics, which is rather the opposite of "just go ahead and do it, even if it's messy," which is the opposite.
   > The main point is that "prolonged warfare has never benefited the country," and it would be a bad idea to just cut out the "poor speed of warfare...". It doesn't say anything about "skillful and slow" in the first place.

["Slow and steady is better than fast and steady.]
