Circulate the task list
 [Water that has stopped flowing rots.]
 Putting tasks in the task list
 	The cycle must turn: the task list is checked frequently, it is done, and a sense of accomplishment is achieved.
  In other words, we need to design incentives to make it a habit there.
  However, during use, "stagnation" occurs and debris accumulates
  	Stopping is not desirable.
   If a task is not started after several days, there must be some reason why it is not started.
   	Tasks that are difficult to execute for some emotional reason, such as poor wording.
   If it continues to be placed on the task list without clarification, it will not be initiated in the future.
  When tasks accumulate on the task list, there are negative effects.
 		Increased number of tasks on the task list
    [Jam experiment] Too many choices inhibit behavior
   It stays on my task list and I feel bad every time I look at it.
   	You may not be aware of the unpleasant feelings, but they gradually accumulate and discourage the act of looking at the task list.
	The task list must be circulated.
 Let's reinterpret the task.
  Suppose the task list says "do what?
  It is not a literal "what to do" task
  Think of the task as "thinking about the theme of 'what to do' and transforming it into a different form.
  Simply transcribing is not "thinking and converting"
  It is "thinking and transforming" that changes the expression
  So, if you register a new task with a different expression, you can complete the old one.
  For example, increase the amount of information, make it more specific, or change the wording to make the content easier to understand.
  Task Breakdown
  information gathering
  	Example
   	1: "keruhyah" (I made a note of it immediately when I thought of it)
    2: "Rent a Kärcher washer" (this became a viable task)
    3: "Check out GW's website where you can rent a Kärcher cleaner" (turned into information gathering).
    Wife: "If I clean the windows now, they'll get dirty from the rainy season rains."
    4: Register "Check Kärcher rental site" in June schedule.
  In [GTD], put them in the INBOX first, then categorize them and put only the doable ones in the TODO list.
   But realistically, for a variety of reasons, inappropriate items get mixed in with the TODOs.
   	I would use TODO as a handy one-line memo.
    I thought it was a viable action when I wrote it.
     Not enough breakdowns to know the first step.
     Lack of information needed for execution
    When I wrote it, I thought I had enough information to execute it, but some of the information is only in my brain, and over time I forget it and don't understand what's on my TODO list.
    Circumstances have changed since I wrote it and it is no longer viable.
   So, it is necessary to deal with the possibility of garbage mixed in with the TODO list
   Also, the additional step of "put in INBOX and then move to TODO" may inhibit the behavior, as in the [experiment on individually wrapped cookies].

 Electronic task lists leave the old looking no different than the new.
  Fresh looking, but actually rotten.
   Rotten things must be thrown away.
   [Systematic Disposal]
  Good design for a task list that changes color as time passes after registration
  	Similar concept to [Obsolete Page
   	see: [Vol. 13 Obsolete Pages: Masui Labo Notebook Columbus Day｜gihyo.jp ... Gijyohyoron-sha http://gihyo.jp/dev/serial/01/masui-columbus/0013]
   Do not ignore color changes.

 Maybe there should be an opportunity to [regularly empty
 	Like "drain all the water out of the pond."
  GTD says empty your INBOX, this one empties your TODO list.
  Delete the entire task list?
  	There is a psychological barrier to simply turning it off.
    It's something I shouldn't forget, so I'm reassured by writing it down.
   So the rule is "anything changed to a different format is considered complete".
    If you transcribe "Do A" to the schedule book as "Do A on X day from 15:00 to 16:00", the task list side is done.
    Use a separate task list (can be another app, paper, or text editor)
     By transcribing, the old list is once DONE.
     Putting it in your mind by writing it down: the effect of [sutra copying].
     	If you're looking at it vaguely, you're unconsciously ignoring it and it's not in your head.
     Of course, you may change, add, or erase in the process of transcribing
   		My wife wrote the task on a piece of paper and circulated it by transcribing it on another piece of paper each day.
     	When I try to copy this, I get discouraged by the tasks that I have to transcribe over and over again.
      	This is due in part to the fact that many of the tasks are of the type that take a long time to resolve
       	That and the fact that it's being put into TODO without being broken down properly.
        At the time you register a task, you do not have a correct understanding of it.
        	Observing the fact that it is not executed happens first.
         After the fact, it is understood that it is not an easy task to perform
         After understanding, consider why it is not easy to implement
         Thinking about the reasons for the improvements will help you improve.

-----
2018-05-02 Wrote in Aiaifu while waiting for Apple Pencil to charge

stagnant water in a stream rots
I don't like it when you put a task on the task list and then it stops.
interpret differently
If the task "what to do" is stopped without completion
It is not a literal "what to do" task
Think of the task as "thinking about the theme of 'what to do' and transforming it into a different form.
Simply transcribing is not "thinking and converting"
It is "thinking and transforming" that changes the expression
So, if you register a new task with a different expression, you can complete the old one.
Increase the amount of information, make it more specific
Also called task breakdown
Break down the task or gather information for it?

Electronic task lists leave the old looking no different than the new.
New look, actually rotten.
Rotten things must be thrown away.
body dumping (e.g. of radioactive waste)
Task list that changes color as time passes after registration, good
Do not ignore color changes.
When stagnant, it rots.

----
2018-05-07 Wrote on PC while waiting for Apple Pencil to charge.
	The cycle must turn: the task list is checked frequently, it is done, and a sense of accomplishment is achieved.
 In other words, we need to design incentives to make it a habit there.
 However, during use, "stagnation" occurs and debris accumulates
 	Tasks that are difficult to execute for some emotional reason, such as poor wording.
  It stays on my task list and I feel bad every time I look at it.
  	You may not be aware of the unpleasant feelings, but they gradually accumulate and discourage the act of looking at the task list.

Maybe there should be regular opportunities to empty it.
	Like "drain all the water out of the pond."
 Delete the entire task list.
 	There is a psychological barrier to simply turning it off.
  So the rule is "anything changed to a different format is considered complete".
   If you transcribe "Do A" to the schedule book as "Do A on X day from 15:00 to 16:00", the task list side is done.
		My wife would write it on a piece of paper and then copy it on another piece of paper, circulating it daily.
  	When I try to copy this, I get discouraged by the tasks that I have to transcribe over and over again.
   	This is due in part to the fact that many of the tasks are of the type that take a long time to resolve
    	That and the fact that it's being put into TODO without being broken down properly.
     At the time you register a task, you do not have a correct understanding of it.
     	Observing the fact that it is not executed reveals that it is not an easy task to perform
      Improvements are made by considering what the reasons are for not being easy to implement.