Redistribution and gradient
Consider the relationship between the value you offer to others (give) and the value you receive from others (take).

For example, "the government owns all value and distributes it equally [equally] to everyone" is one extreme.
 #BigGovernment
 Value created by an individual through labor is not attributed to that individual.
  Denial of [private property
[https://gyazo.com/912fb2dbf3b756e8f263cd82652c6d13]

The other is that the government does nothing and the individual gets everything he or she earns.
 #Small government
	Do you get a take that corresponds to what you GIVE?
  The idea is that if [the market] functions properly, it will give you compensation corresponding to the value you provide.
[https://gyazo.com/e040776124485d1fe3f1214a049419bc]

The latter is a person with low value provision to others who cannot live a minimum cultural life.
[https://gyazo.com/16ed2192dff19dd807643e7e39023c23]

So the government takes some of the private property of those who provide a lot of value and [redistributes] it to those who provide less value.
This is welfare or unemployment insurance.
[https://gyazo.com/679b6e65301ef0d4668571400b70ce86]

point of concern
When the line is horizontal, there is no incentive to increase the value offering.
This is because even if you work hard to increase the amount of value you provide, what you gain will remain the same.

So, if we smoothly connect them so that there are no horizontal parts, we get this
[https://gyazo.com/d861472ec2e1d15dddbad4dd1d2db011]

Focus on [gradient
 Somewhere there must come a zone where the slope is less than 1
  A zone where the increment in the amount of value you gain is less than 100 when you increase the amount of value you give by 100.
 Wouldn't it be inappropriate for it to be in a zone that offers little value?
 	There is no incentive for those who do not provide much value to increase their value offerings more
  Both the current welfare and the smoothed version of it have a value provision near zero and a slope of zero.

A smooth curve with a slope of 1 in the zone of least value creation would look like this, for example
[https://gyazo.com/5d1e0dcdf1bb57c422e621c6fb8f7710]

Here's how each redistribution curve compares to the gradient
[https://gyazo.com/a2e07c36ee0a4d4940e4509580fe133f]


