What did the books sell?
 Self-observation of the creation process can be found here: [20180502 Self-observation log].
	I took it one step further by looking at the question, "What were books selling before the new Mach book?"

[https://gyazo.com/accbe15f3fd41f9f4fad905941a028cd]



[https://gyazo.com/17cbb52f6547410bf2979621c64d34ae]
 A situation where Mr. A and Mr. B are in close proximity and Mr. B can observe Mr. A's behavior as he teaches.
  First, Mr. A's work is communicated non-verbally by Mr. B watching from the side.
  Commonality of experience #Collaboration
  By verbalizing how Mr. A interprets a common experience, a common interpretation is made.
   If left alone as it is, Mr. B will interpret it in his own way.



[https://gyazo.com/0e9660b06eb6eb51ed57e14a6971127d]
	When the person teaching and the person being taught are far apart and cannot be observed directly
 	Common situations in books, etc.
 First, Mr. A verbalizes
  But at this time, experiences that are difficult to verbalize are left out.
  Raw experience may not be carried in book form
  It becomes an interpretation and verbalization of experience.
 It is an inferior learning format to the state of being able to co-observe.
 	will scale.
  Effective in a situation where the number of people being educated is increasing faster than the number of people doing the educating.


[https://gyazo.com/9040023c449174607fab46bc770b5f69]
 Mr. B, who has read a book that has been abstracted and verbalized, needs to connect that verbalized interpretation with his own experience
		Metaphors such as "fall into the belly," "become flesh and blood," etc.


[https://gyazo.com/9a53d18ca7247795234ba5e16c1f090f]
	This "coupling with one's own experience" is not easy
 So, the authors provide explanations in a simple way, include specific examples, use a novel format, or use a "comic book" format.
 This is a structure that is compromised to the reader by cost on the part of the author.

 That was fine in the days of small variety [mass production].
		Because the cost of authorship is borne by a large readership.
  When authors write "easy-to-understand books" at a cost, they sell more books for longer periods of time.
  Cost justified.
 Subdivision of fields
 Increased variety of products on the market
 The amount of readers per book has decreased
 Decrease in effectiveness of [signaling] in books
  [Bad money drives out good money.]
 Emergence of the Internet
 	The attractiveness of the book distribution channel has decreased compared to the quality, quantity, and speed of information distribution on the Internet.
 The incentive to do that on the part of the author is diminishing.
 Readers are also drowning in a flood of information.

	Agile and Waterfall
 	Books are written without the customer (reader) in sight.
  this is a big deal
  Problem when a customer realizes after spending money to create it that it doesn't exist.
  	Related: [Lean Startup].
		On the author's part, I want to know the customer's reaction as soon as possible.
  	Introduction of reviewers, etc.
  The software industry was quick to arrive at a similar idea.
  	Create and release releasable items as quickly as possible.
   Identify what needs to be created through dialogue with customers

liquidation
	What did the books sell?
  Abstracted concepts and helping readers combine abstracted concepts with their own experiences
