Clean space + KJ method experiment
[20150514 experimental log https://www.facebook.com/nishiohirokazu/posts/10205940279122630]
[20150520 experimental log https://www.facebook.com/nishiohirokazu/posts/10205982892707943]

 In the recent experiment of merging the CleanSpace and KJ methods, there were ultimately only two perspectives: a bird's-eye view of the KJ method sticky notes and a (virtual) moving view of the KJ method map.
 In clean spaces
  It's important to get six perspectives out there (because once you're frustrated by the complexity, you find new perspectives)."
  You have to physically move, you can't just do it on paper and think you're moving."
   (because the physical sensation of physical movement is important in promoting awareness)
  There is an opinion that
 Based on that, we should give more "perspectives in the KJ method map".
 So, assuming I'm in the KJ method map, I've come up with six locations.

  1: Ikujiro Nonaka's "Knowledge Creation Methodology" and "Knowledge Creation Companies
  2: Computer Science
  3: Mathematical Sciences
  4: Philosophy
  5: Psychology
  6: Strategic Safari

 Note for the record.
  [https://gyazo.com/f3a7ce45ab65c8864f1a8cdeaab2b0f7]

 Standing at number 6, I asked, "What do you know about 5 here?"
  5: Psychology is about the individual's mental behavior, but the layers of strategy theory are too detailed for individual psychology.
 Regarding 4 from the perspective of 6: Philosophy is mostly impractical. Pragmatism is, well, forgivable.
 Regarding 3 in 6 perspective: Mathematical science is also beneficial to strategy theory. There is a school of thought that views strategy in terms of game theory, quantitative evaluation of organizational behavior, etc.
 Regarding 2 in 6 perspective: I have no idea what computer science can do for strategy theory. I feel like it's slinking away in the distance.
 Regarding 1 in the perspective of 6: Knowledge-creating companies are one of the key literatures of a school of thought that emphasizes the study of strategy theory, so it's no surprise that 1 is in the most familiar position.

Now, move to 5.
 5 On the 6 Strategic Safaris from a psychological perspective: the position is blurry. Well, it is placed next to the Knowledge Creation Enterprise, but since the book is an introduction to "10 ways of thinking," shouldn't it essentially be scattered among 10 positions? Isn't this arrangement, in effect, only about one school of thought that values learning?
 Regarding 1 in 5 perspective: that was a story that distinguished between formal knowledge and tacit knowledge and argued that their mutual transformation is important for knowledge creation. As for tacit knowledge, some, such as Polanyi, are more than philosophical, but from this viewpoint, which has a neuroscientific basis, it is natural that there are kinds of cognition that are not verbalized, and rather philosophy takes verbalized formal knowledge for granted too much.
 On the 4 in 5 perspective: Yes. Philosophy. In philosophy, Merleau-Ponty and others have said that the meaning of words is institutionalized a posteriori, and that idea fits.

When expressed in numbers, it is confusing and often wrong.
 On computer science from a psychological perspective: Yeah, it's behind us, so we can't see it well. And that one has its back to us, too.
 On mathematical science from a psychological perspective: this is also behind me, but when I look back (oh, the cat is peeling off, restoration), that side is looking at me, though not straight ahead. I'm not really aware of the psychology side, but I'm not immune to statistics and data mining.

Now let's move on to philosophy 4.
 So what do we know now here?
  I can see philosophy's perspective on the whole thing. But only philosophy is in a different room across the bran rail....
 On strategic safaris from a philosophical perspective: hazy in the shadow of the knowledge creation company in the foreground.
 On knowledge creation companies from a philosophical perspective: That's a kind of philosophy, too, isn't it? In the Knowledge Creation Methodology, there was a classification of philosophy and a reference to Nishida's philosophy. I am not quite sure about the classification, but I found Kitaro Nishida's "Introduction to Philosophy" the easiest to understand book on philosophy that I have ever read.
 On psychology from a philosophical perspective: I wonder if we share some of the same motivations for wanting to know about human beings.
 On mathematical science from a philosophical perspective: far from it.
 On computer science from a philosophical perspective: further afield.

Now please move on to Mathematical Sciences.
 On strategic safaris from a mathematical science perspective: I'm not sure that strategic theory is equal to organizational theory, although there may be some talk about mathematical models of organizations in between.
 Knowledge creation from the perspective of the mathematical sciences: it seems far away and slinking away.
 Psychology from a mathematical science perspective: this is the closest to the front for me, but I don't feel like I'm seeing things over there.
 On philosophy from the perspective of mathematical science: distant in distance. But I feel something close. There is psychology in between, but there seems to be something in between that is not psychology. It feels like it's floating in the void.
 On computer science from a mathematical science perspective: we are very close, but we are passing each other by.

Now move on to Computer Science.
 Why am I in this corner?
 There was Weinberg's "Psychology of Programming" or something like that.
 Let's turn around for a moment.
 On strategic safaris from a computer science perspective: hmmm, seems distant. Blurry.
 I mean, in retrospect, this is almost the same perspective as actuarial science, so the way I see it is the same.

We are back to knowledge creation.
 So now, what do we know here?
 Oh well, computer science should have turned this way.
 There is a sense of what computer science is all about. Some things are distant. But there must surely be a connection mediated by psychology between computer science and knowledge creation.
 It's supposed to be a book on "learning embedded in situations" or something in the psychological field, but I believe it was originally about the user interface of a Xerox copier.
 Oh, "Psychology of Programming" and "Is the Light On?" are by the same author?
 (2018 supplement: also related to brainstorming with Computer's assistance, and knowledge sharing via groupware in the first place)

A review of this experiment:
He has made several mistakes due to his unfamiliarity with clean spaces.
 I've written my name on a sticky note and then I'm looking for a place to put it.
  It is not very good in using location as a metaphor.
  In the clean space, have them find the location first, then explain what they can find in that location,
  After that, I let them name it.
  If you name it first, as in this case, you are thinking in conceptual layers, and there is a sense that you are not utilizing the metaphor of the place properly.
  Number 2, "Computer Science," and number 3, "Mathematical Science," are exactly the names of the groups created using the KJ method, and they were probably placed in the corner because they did not feel any proximity to "Knowledge Creation" at the placement stage.
  Well, I got off to such a bad start, but I finally turned it over by saying, "Why are you looking away in the corner?" and I was able to remember that there are several bridges between what I thought were unrelated, so maybe that was a step forward.

 The clean space procedure is much sloppier.
  After moving from place to place, "So, what do you know about this place?" And sometimes you don't ask.
  After answering the question, I didn't ask if there was anything else at all.
  Maybe next time I do it, I should have the procedure in hand properly.
  Or don't do it alone and have someone else play the role of facilitator.

update
[https://gyazo.com/361026db4b09e3aaf2ab1b42e89c24a0]
 Two and three say, "Wouldn't it be better if we switched places?" I say.
 Philosophy has been walled off and withdrawn w
 I have ordered about 5 of Weinberg's books. Because I feel the need to delve into his point of view.
 Looking back, I feel that I am thinking in terms of layers of concepts when I write "Knowledge Creation Company and Knowledge Creation Methodology" on the first sticky note.
 Should I place all the labels I made using the KJ method on the floor first, then follow the separate clean space procedure to find 6 spaces?

-----
20150520
 I thought right after I finished the experiment of connecting KJ method and clean space, that the last time I did it, I made a mistake in the order of naming the questions to the space and moving them to the space, so it turned out to be a "KJ method of moving myself" kind of thing, and it did not turn out very well, but then a while later, I realized that the However, I still remember the map perfectly, so I knew that it was very effective as a mind palace.

 Questionnaire and notebook for answers.
 The project was completed in 1.5 hours. Quite useful results were obtained.

 This time, I wrote all the answers in a paper notebook, but since it was three A4 pages long, it is too much trouble to reproduce them here, so I will write them in the [Clean Space Experiment] scheduled in the near future.

 If I skip the process and just write about the results, the reader may not understand what is going on, but in the end, I concluded that the four key elements are the "Strategy Office," "Strategy Office design staff," "Library entrance," and "Mind Palace Architects and Design Office.

 This first KJ map was a list of sticky notes with TODOs, long-term projects, and directions to go.
 The perspective from which we do this KJ method was initially called the "KJ seat," but eventually became the "strategy room.
 I realized that some of the stickies should be handled by the library, not the Strategy Office.
 At the request of the library, one task was clarified in an area that had been underdeveloped because the task was not verbalized.
 I was also requested to "clarify why" and realized that I should be aware of why and how to arrange sticky notes in the strategy room in the first place.

 What I have noticed with clean space practitioners is that they tend to forget to ask the question, "What do I know now in this space?" after moving from one space to another. This is probably because we are more conscious of the totality of the relationships between spaces. Not good. The former is a question that MUST be answered, whereas the latter is "What do you know?", so the former is far more important.

 In terms of space, it was reaffirmed that the ties of material existence are not so much a problem but rather an opportunity for creative use, such as sitting on a chair that happens to be there, or on a sofa that happens to be there, or on a door that happens to be behind it instead of on the wall, so one can open it and move a chair to that spot.
