Learning by thinking
An experiment that showed that taking the time to verbalize how to solve a problem, rather than simply solving it, improved subsequent performance.
	[Learning by teaching]

Di Stefano, G., Gino, F., Pisano, G. P., Staats, B., & Di-Stefano, G. (2014). Learning by thinking: How reflection aids performance. Boston: Harvard Business School.

実験1
	Solve the puzzle, then see the posting below, then solve the puzzle again.
 	基準群: 
  	>You will now be asked to complete the second round of the MATH BRAIN TEASER. As before, you will have 20 seconds to find the right solution in each of the five math puzzles in this round.
  熟考群: 
			>Please take the next few minutes to reflect on the task you just completed. Please write about what strategies if any you used as you were working on the task. Also please write about what you think one can do to be effective in solving the math problems included in this task. Please be as specific as possible. When done, click on “Next.”
		共有群
   > Please take the next few minutes to think about the task you just completed. Please write about what strategies if any you used as you were working on the task. Also please write about what you think one can do to be effective in solving the math problems included in this task. Please be as specific as possible. PLEASE NOTE: Your notes will be shared with other participants who are asked to work on the same Brain Teaser task. When done, click on “Next.”

[https://gyazo.com/23cc20192556f03f989833938fd85a5e]

The contemplative and shared groups performed significantly better than the reference group.
The shared group tends to have a higher mean than the contemplative group, but not to the point of statistical significance.

field test
	Training in call center operations
 Traditionally 4 weeks of training and 2 weeks of on-the-job training
 Put 10 days of "15 minute consideration" into this
 >Please take the next 15 minutes to reflect on the training day you just completed. Please write about the main key lessons you learned as you were completing your training. Please reflect on and write about at least two key lessons. Please be as specific as possible.
	In the sharing group, 10 minutes to consider and write, 5 minutes to explain it to colleagues
 >Please take the next 10 minutes to reflect on the training day you just completed. Please write about the main key lessons you learned as you were completing your training. Please reflect on and write about at least two key lessons. Please be as specific as possible. When done, you will be given another 5 minutes to explain these to another participant who is completing the training process with you.
On the final assessment test, the contemplative group improved their performance by 22.8% and the shared group by 25.0%.
The difference from the reference group is statistically significant.
The difference between the contemplation and sharing groups is not statistically significant.
