ScrapboxDrinkup4
Event notes [/scrapbox-drinkup/Scrapbox Drinkup #4 Tokyo Edition].

	Honor System
 Functional differences are a drag on development.
 For commercial purposes in a registered company or business.
 	That's complicated when it's across multiple organizations.
 The page titled "Expense Application Procedures
 	There's a struggle down there.
  You can see the steps that were put together on the page as a result of the struggle

	Nota is over 80% dollars.

	[/scrapbox-drinkup/Scrapbox-Latest-News-2018/5 (shokai)]
	Note that the tag "diary" connects all kinds of things.
 	[Maybe there should be a function to find tags that are too connected and recommend splitting them?
  	Perhaps above a certain amount, it overflows the capacity of human cognition.
   [Limitations of the KJ Method

 Tagging pages for newcomers, etc.

	The image of the pinned page becomes a favicon.

	[/forum-jp]

	You can paste a map with Google Map URL.
 	Paste it and it becomes latitude and longitude.
  You can specify multiple addresses with vertical bar delimiters and as many pins as you want.
   [nishio.icon]It would be good to collaboratively edit a gourmet map of the area around the company or something like that.

	You can start the camera and put it directly from your phone.

	GA seems to put it in the form of UA-XXX-X

	Tacit knowledge in [in /shokai/Scrapbox] organization
 	I hope the link to the page in the shokai project is suggested.
  Maybe I'll use the Chrome extension.


	prospects
 	Can rewind to an older version from the edit history.
  	Excellent [nishio.icon].
  Show all rojets in Stream

	Write in Scrapbox for now.
 Google Docs used together
 	If you want to manage individual access with a high degree of confidentiality
  When shared with others
   Minutes, etc.
 Leads: invitation link in Slack
	Ease of co-editing

	5 patterns
 	README
  	Page for first time visitors
		minutes
		feedback
		Technical Memo
  	Write it anyway, and cut out the useful stuff on a separate page later.
   Interns do research.

	More links to nouns
 	Tend to rely on full-text search

	The norm is that if you don't understand a question, you should ask a question.
 	Did the others understand?
			I can tell if this one has an answer or not.

	Three pieces of information
 	wild
  cultivation
  Existing: On the iceberg
 tree structure
 social
 discussion
 A stock of ready-made information
 Maturity Model for Knowledge Sharing
 The gap between the group's knowledge being alive -> knowing the group's unshared knowledge is deep.
 	All companies are farmed, the latter are wild
 Farmed things don't become wild, from the wild.
 Scrapbox lowers the surface of the water.

 If you don't write what you want to write, it won't last a year.
 Scrolling is fun once you get over 300.
 If you say to a customer, "Search for Ootaki Radio at 9674," they'll get the message. You can also say it over the phone.
 The security of knowing that a character is saved when it is finalized; no need to press Ctrl-s. No need for an information card.
 Every morning you write down what inspires you.
  Turning to Most Linked brings up keywords that I unconsciously value.
  	Memories, Living and Dwelling.
   My goals became clear.
   [nishio.icon]Interesting, I'll do it later too.
  Apple Watch's gyro sensor moves pedals with Arduino
 Half of the people are in wheelchairs
 [/ootaki]
 I'm picking the best five for each 100.

Scrapbox Portfolio
	[/syunichisuge]
	beautiful eyebrows
 Designers need to build a portfolio to know what they can do.
 I like the ease of updating.
		It's too late for an update after the big exhibition is over and you've had a chance to catch your breath.
  do something right away
 Setting is also pinned
 	It's annoying when it's messy, so I've put up a white image.
 Discover new possibilities for yourself as your past work becomes connected.

[/yuiseki-books]
	Earth Bookshelf

I'm going to Scrapbox your paper.

If you look at the communication often in Chrome's developer tools, you can see the API.
ohtomi/scrapbox is amazing!

My LT [experiment to change the sort order in Scrapbox].

[/shiozawa88]

e-book
