scientific management
[https://gyazo.com/e68b015889e782d16dab36755946654a]
	[Amazon https://amzn.to/2IIRxMM]

	private plan for a piecework payment system
 Factory Management Law
 	Various wage payment systems
   How to incorporate the idea of sectional work into various wage payment systems
  The organization of the plant
  Credit hour studies
  Central Issues in Labor-Management Relations and Administrative Law
 Principles of Scientific Management Methods
 	~Fundamentals
  	Labor relations and plant management
   	Lao Tzu's interests are aligned.
    Higher wages, lower costs
    High efficiency and maximum production are important.
   Lazy work that runs counter to maximum production
   Causes of Failure to Work
   	1: Misconception that increasing efficiency creates unemployment
    	more production means more demand
      [nishio.icon]Really?
     The overuse of workers is easily debated.
     	For every one overworked thing, there are a hundred deliberately not working.
      This is the reason for the low wages.
      [nishio.icon]Is that right?
    2: Imperfect management methods encourage idleness.
    	natural slowdown
     	daily wages
      	If the pay is the same as the slower person, try to work at the same pace as the slower person.
     systematic laziness
     	Work slowly and make it look to the employer as if you are doing it at a considerable speed.
      The employer decides off the top of his head that the daily wage of a bank employee should be at most this much.
      Deception occurs between labor and management.
      When there are those who work hard, others have to work harder for the same wages, so they are restrained from working.
      Keep precise records of the work done by each worker, raise the daily wages of those with good performance, and quit those with poor performance.
     piecework system
     	If you work diligently and the unit wage rate is lowered, the transition is never in the employer's best interest.
    3: Leaving it to the workers is inefficient
    	Acting by the eye causes inefficiencies.
   Human Happiness and Scientific Management Methods
  ～The four principles of ~.
  	Old management methods that can only be realized if workers are diligent.
   Four new articles of the administrator's duties
   	Develop a science for each element of a foreman's job, and quit the old, eye-rolling way of doing things.
    In the past, workers chose their own jobs and learned as much as they could on their own, but now they must be scientifically selected, trained, educated and developed.
    Management and workers work together to make sure that all work is done in accordance with the principles of developed science.
    Tasks and responsibilities are divided almost equally between managers and line employees.
  Example of Zuku Carrying
  Excavation Studies
  Brickwork Study
  Improvement of inspection work for automotive balls
  Study of metal cutting operations
  Implementation of scientific management methods and their effectiveness
  	knowledge
   	Should the knowledge gained be implemented immediately or wait for the study to be completed?
    	In general, once a certain idea is made, implement and test it as soon as possible.
    Reform is done at a moment's notice.
    	Little by little, slowly.
     One at a time.
     Until that one worker is fully convinced that there is a benefit to the new method, he or she will not work on anything else.
     When 1/4 to 1/3 of the workers are converted to the new method repeatedly, the workers of the old method will see the benefits that the workers of the new method are receiving and will want to join them.
    Approval of the board of directors
   Effects and their distribution
