20140525 speed reading experiment
[May 25, 2014 https://www.facebook.com/nishiohirokazu/posts/10203332440368291] #Speed Reading Experiment

Psychological barriers to speed reading
I feel obligated to read the newly arrived books and reduce my reading pile to zero, or to reread my past notes.
You can't enjoy it if you feel obligated to. If you don't enjoy it, it won't last.
The reason why anxiety increases with high-speed speed reading for "just skimming through" is because there is no "fun" in it.
We have explored enough in the direction of pursuing speed,
In the future, train the ability to control the balance between speed and "what you get".

[Organization Design]" iPhone 320p 8m38
I wasn't sure why I bought it when I saw the title.
Read inside: this book is about organizational forms
It's written from the advantages and disadvantages of hierarchy.
Various companies call their organizational structure by various names, but they are a combination of basic structures
Functional and divisional systems
Talk about paths being on logarithmic order.
The second half of the meeting will also include process management and goal management.

■"Anti-Philosophical Fracture," iPhone 266p.
Wittgenstein. This is going to be heavy.
A bunch of fragmented sentences. Unstructured, so the speed-reading assist by structure does not work.
Bound by language. We are constrained in our thinking patterns by the language we are currently using, and we encounter similar problems over and over again.
→ Maybe we should not be limited to "writing a book" but should try different formats, such as painting.
People who are not used to looking for berries will not be able to find them. Those who are familiar with berries know where they are likely to be found. Before finding them.
Excessive demands will squelch legitimate demands -> Reading this reminded me of "Routine work drives out non-routine work," but that would have been in the "Organizational Design" section. Gresham's Law.
I have bits and pieces before I write anything structural; do you want to do it on Twitter?
How do we know what the correct tempo is?
I recall that Schopenhauer was also negative about reading a lot.
197p 17m38 Interrupted by interrupt
I didn't get the impression that he was reading slowly, but he was much slower than usual.
However, it is not too slow since the pace is over 6s/p while writing the above memo.
Continued ~266p 5m45
Just as music sounds different when played at different tempos, text is affected by the speed at which it is read.

■"Grounded Theory Approach" iPhone 264p 8m48 (too much meat, sleepy)
A book about improving the GTA
I remembered I had a book on how to conduct an interview.

■ "Developing Competency Management."
I remembered that there was a book written about how to conduct an interview.
Table of Contents, ~147p 6m01
Behavioral outcome interview (BEI)
~175p 10m23
Conceptual theories and used theories are two different things.
Focus on what you did during the critical event and the actual actions you took.
The question, "Why did you do ~?" is a question that asks for a postulated reason for an action.
Explain the purpose of the interview
What were the significant events, what were the circumstances, and how did you act there? Ask about
What was the most important step in that project?"
To avoid the "don't rephrase" induction, he said.
But "Is this what you mean by that?" to confirm,
It seems important to understand exactly what they are thinking.
If the conversation veers too abstract, ask for specific examples.

The second half took 10 minutes for just under 30 pages, a much slower pace of 20s/p.

Magic Knight Rayearth (2)" 202p 33m45
I measured the speed of reading manga as a test. slower than 6s/p.

What it Means to Understand: The Brain Science of Recognition.
Shigeru Yamatori: clinician specializing in memory disorders
Cannot distinguish → can distinguish → can identify
People with acquired vision do not see things from the beginning, they need to be trained to form mental images from neural input.
Brain damage causes a disability that can be copied but not know what it is.
Naming: mapping memory mental images to phonetic symbols
~56p 10m53
Unfamiliar words = symbols for which the correspondence has not been completed. Failure to look this up properly is dangerous.
Reflexes and emotional expressions are evolutionarily acquired memories, Darwin found that dogs and monkeys have emotional expressions in common with humans.
Types of memory
Memories that are easy to recall to consciousness → can be shared with others
　Memory of events Penfield's electrical stimulation experiments confirmed the playback of episodes, he thought that was the seat of memory, but it is disputed whether that is correct. He may have just pulled the trigger.
　Memory of Meaning
　　All that is taken in through the medium of symbols is the memory of meaning
　　Meaning of the matter
　　　An event is a one-time thing, but meaning is created by experiencing it over and over again ← It is created and nurtured by abstracting from multiple experiences
　　　Learn and you will learn, and you will never be bored again.
　　Meaning of Relationships
　　　The understanding of the positional relationship is the foundation of the project.
　　Concept of Change
　　　There are cases of cerebral injury in which the distinction between "open/grip" and "stretch/bend" is lost. It becomes difficult to distinguish which is which of the contrasted concepts.
Memory that is difficult to recall to consciousness = procedural memory
　Word order
0~97p 25m29
There's a lot to understand.
I can see the big picture.
　Major brain injury that makes you lose track of where you are in the city.
　I know which materials to read and how much time to spend on them.
　To get an idea = need a map.
...I can see it when I sort it out.
　Sense of being neatly classified
　I was able to categorize it -> I was able to organize my mind -> I got it.
　Whether the classification is scientific or not is immaterial.
　Cases where the patient does not know whether he or she is in the hospital or at home, or whether the person in front of him or her is a family member or a doctor
... I can see the path.
　Organizing = not chronological, but on the other hand, there is an understanding that shows chronological connections "this happened this way and that happened that way".
　Evolutionary theory and creation myths attempt to make sense of the question, "Why do I exist?"
...understand spatial relationships.
　Cubes cannot be copied depending on the site of cerebral damage.
I know how it works.
　(Wonder how this is happening. Do you run a brain model of how it works and agree that the results are the same as the observed facts? How did you come up with the mechanism? Can we know causality from observation?)
I can tell when it fits the rules.
　So far this was an understanding of the unknown, but this is a sense of fitting into a known rule
　(Is this a model as well as a "mechanism?")
　It's a special way of understanding that applies to the world of numbers, a world with a kind of closed structure."
0~144p 42m30

. intuitive.
　I feel "intuitively inspired" when I create the answer, but cannot consciously follow the process.
The cohesiveness of the group is evident.
　I "get it" when what is written in the text comes together as my mental picture.
　When you understand it, you can express it in different words and act on that understanding.
Discovering the rules will tell you.
　Experiments to discover regularity; frontal lobe damage results in poor performance.
　Hypothesis and validation Pasteur's experiment (sterilization shows that the bacteria do not spontaneously develop; repeated dilution and incubation shows that the bacteria are multiplying)
The following is an example of how to do it.
　Understand by replacing it with another "subject with which you know the relationship well".
　Area in units of Tokyo Dome
　Express how much you like it by how big it is
What it takes to understand
I think there is an instinctive desire to sort through the chaos and find meaning. Understood → pleasant
Memory and the web of knowledge
I think that the ability to "notice what you don't know" cannot be developed in such a passive manner.
Bringing it all together: To find connections between disparate mental images, we need to bring them together.
　Diagrams and text can be used to reinforce working memory
　Drawing a diagram" is useful to verify that you know what you're doing; you can't draw a diagram if you don't know what you're doing.
　Diagrams are also useful for clarification, because they make it easier to be aware of the big picture and the relationships within it.
When you understand it, you can apply it.
　Cleaning a razor with a brush and it's a pain in the ass -> find out that it's the same construction as dusting with a vacuum cleaner -> try cleaning the razor with a vacuum cleaner -> it worked!
　In the case of the glasses, the person can remove the glasses he is wearing when asked to take them off.

A case in which the patient cannot say "please write 6" but can say "from 1 to the next"; damage to the parietal lobe of the left cerebral hemisphere.
Cases of watering without understanding the situation that it is raining, staring at the clock without sleep because you have to go to the hospital the next morning, damage to the bilateral prefrontal cortex
Prefrontal cortex is responsible for selecting the best one for the site from multiple action plans
If you can think of more than one plan, you can compare them, big and small context.

Talk about how depth of processing of discrimination tasks affects memory (was it Talbing?).

Overlapping and heuristic understanding
Whether the answer is inside you or only outside.
Superimpose the input on the mental image
A case of aphasia, but when told "to the devil," can reply "gold bar."
Superimpose on a pre-acquired model
On the other hand, there are some that have no prior model
You can only verify it by making your own tentative plans and experimenting.
Natural science is just this.
Life is like that, you make a hypothesis, live it, and if it works out, you feel like you "understand the world".
0~236p 83m06

Overall, the pace is 20 seconds per page, about the same as the competency.
That's how long it takes me to read while making this granular excerpt.
11s/p for ~56p, 21s/p for ~97p, 21s/p for ~144p, 26s/p for ~236p
This is due to the fact that we don't have a bird's eye view at the end to understand the big picture.
I think I was in a bad state of reading the book, even if I didn't need to read it. The volume of the book was too much, too.
I left the timer running because I didn't want to add up the time I spent reading a book, but that doesn't tell me the lap time.
It is necessary to measure lap times, notice that they have slowed down, and correct the trajectory.

The Science of Thinking."
Shinichi Ichikawa: Professor, Department of Education; background in cognitive psychology
Calculate that a total of 186 pages and 20 s/p would take 62 minutes.
Part I is about logical reasoning.
Table of Contents 2m

4-card questions (Wayson's Choice Assignment) Same type of question but with everyday subject matter increases the percentage of correct answers, subject matter material effect.
Raise your hand if you scored 60 or above" - logically, it doesn't say "don't raise your hand if you scored less than 60" so you may raise your hand.
1 chapter 20p 7m = 21s/p

practical inference schema
Knowing the reason for the rule increases the rate of correct answers, because it makes it easier to use similar schemas in memory.
The "hands up" leads to a logically incorrect conclusion because the understanding that identification is being done leads to a different schema

When there is no schema, the theory is to create a mental model, generate concrete examples, and make decisions from there.
80% correct when 1 model is needed to give the correct answer, 20% correct when 2 models are needed, and 9% correct when 3 models are needed
Humans do not think in logical formulas, but in examples.
(Programmers skilled in logic formulas learn to take term-by-term true/false value combinations as examples, resulting in logically correct logical inferences?)
Chapter 2, 18p, 9m, 30s/p, a little slow.

Garcia effect Induction (generalization) is also performed on rats
The concept of category (how close a concept is to the object) influences confidence in the results of induction.
Sparrows, crows, penguins
Sparrow typicality (distance between bird and sparrow)
Why do atypical penguins contribute more to confidence? Add the concept of coverage → similarity coverage model
Infants vs. adults, gaining coverage impact as they grow up.
Chapter 3, 20p, 8m, 24s/p, a little slow.

Random series generate longer runs than humans expect, and humans find meaning in them.
Ignore specimen size
Confusion between discussion of differences in the mean of the distribution and discussion of the element as a whole
deterministic explanation for mean reversion.
Chapter 4 26p 9m 20s/p OK A little messy in explaining the above

Tendency to ignore prior probabilities
Transformation Three Prisoner Problem I heard that B is going to be executed, but the probability of my own execution increases.
Mismatch between intuitive and Bayesian models
Chapter 5, 20p, 8m, 24s/p, a little slow.

representativeness heuristic
Ease of retrieval heuristic (this is also called the availability bias, right?)
Anchoring and coordination heuristics
Diversion of answers: the numbers that affect the answer are used directly to anchor the answer.
The Problem of Unfair Backgammon
What is the difference between "roll a die and double it" and "roll two dice?"
Bayesian inference and intuition are at odds, interested in aligning with intuition through isomorphic representations
Chapter 6, 16p 10m 37s/p quite slow, but this is because it took me a long time to understand the isomorphic expressions in the unfair backgammon problem and the deformed three prisoners problem. It can't be helped.

The experience of solving a problem prompts you to solve other problems, which is called "transference."
Radiotherapy problem, ask them a hint question and its solution. The percentage of correct answers increases in two groups: the group that was explicitly told that the problem was a hint, and the group that was given a summary and the summary was in a form that could be used to solve the problem to be solved. →The group that abstracted from the experience and created a model that could be applied.
Chapter 7, 18p 8m 26s/p

When do we recognize cause and effect?
principle of covariance
"X causes Y to be Z": consistency (Z for any other X), agreement (Z for any other Y), and discrimination (not Z when it is not X)
↑Bottom-up, decisions based on lots of data collected
↓Top down
A case of recognizing causality from a single observed fact.
Causal schemes, naive theories, stereotypes

Motivation for learning, intrinsic and extrinsic causes, and stability and instability, depending on where the motivation is attributed.
Experiments in reattachment training
Chapter 8, 13p 8m30 39s/p Very slow

Emotions of self and pressure of others
(differential) mistaken identity effect
Bias to protect self-esteem
Desire to clarify their competence and the validity of their opinions
It would use social proof when it cannot be physically verified.
Desire to be perceived by others as a self-worthy communicator
Bias for brevity of story, bias for novelty that you won't hear anywhere else.
Chapter 9, 20p 7m 21s/p