Mach Lecture
	It's hard to design 8-12 90-minute university lectures from scratch.
	Can't we do it leaner?
	There are people who want to listen to Nishio's lectures (= potential customers)
 	Not knowing what the customer wants
  Asking a customer, "What do you want?" will not get you the right answer.
  We have to make it and show it.

 A [disruptive innovation] called [Mach New Book].
 	Mach = [thought economy].
 	How about the "Mach Lecture" experiment?

	Not "plan well in advance and get it done."
 	Situations where knowledge acquisition is of high importance
  We want to get customer feedback as quickly as possible.
   [Lean Startup]
  	Start small and release quickly
    [Agile]
  		[Learning Organization]

 I have a lot of past lecture materials.
  However, if you prepare a lot of lecture materials and speak in a speaking style, it becomes a one-way listening place like on TV.
	A style of speaking with lots of lecture materials
 	Separate roles for speakers and listeners
  It becomes a one-sided listening forum, like television.
    I want to have a dialogue.
    So, we prepare only bullet points of documents.
   The result is lots of time for questions.
   I want to make it a gathering of people who value that kind of time with me.

About this special lecture
I have given a number of lectures, including "Self-Management Strategies for Engineers," "Learning Techniques for Engineers," and "Designing Learning Methods," but in the style of preparing a lot of lecture materials and speaking, the roles of "speaker" and "listener" are inevitably divided, and it tends to become a one-way listening session like television. It tends to become a one-way listening session like a TV program.
Therefore, we have decided to prepare only a few bullet points and emphasize "dialogue" with the participants. We hope you will actively participate in the lecture and enjoy the "dialogue" with the lecturer.

参考文献
MANABIYA Keynote: "Self-Management Strategies for Engineers" https://scrapbox.io/nishio/%E3%82%A8%E3%83%B3%E3%82%B8%E3%83%8B%E3%82%A2%E3%81%AE%E3%81%9F%E3%82%81% e3%81%ae%e8%87%aa%e5%88%86%e7%b5%8c%e5%96%b6%e6%88%a6%e7%95%a5
... "Learning Technologies for Engineers" https://www.slideshare.net/nishio/ss-54458355
・Kyoto University Summer Design School "Designing the Way We Learn" http://nhiro.org/kuds2014/





-----
[Kazuhiro Shiozawa's Class
	Connect AppleTV to projector and project iPad screen mirroring
 	Can walk around freely and handwrite on materials
 Switch between Scrapbox and Metamoji Note with a four-finger left/right swipe to switch between apps.
 Write bullet points of what you will talk about in Scrapbox.
 Metamoji Note's laser pointer function is often used

 A 90-minute lecture is not the same as 12 classes.
  Completely different skills
  Tends to be a place to convey information
  Make it a place that contributes to growth


-----
	I asked my clients, "What do you want?" I asked.
  One is to answer the question, "What is AI all about?" The first is to answer the question, "What is AI after all?
  The second is, "How did you act to be valued outside the company?
  The third question is, "As a new professor, I would like to add value to Tokyo Tech MOT. What do you think?" What do you think?
		I think that the second story, which begins with the pain of not being appreciated within the company, will resonate with the audience, and I think that many people will be impressed with how he thought and acted from that point on.
 Strong fan perspective.
  I don't want to talk too much about my personal "I overcame such and such hardship.
  I don't really like the type of people who are happy to get on board and talk about themselves when these suggestions are made.
	We talked for a while and came up with the idea that "Intellectual Production Techniques" would be a good idea for now.
