擬制と推定
2015-11-19
Pseudoptimism is to assume that "Y is the same as X" for X and Y, which are essentially different. Presumption is to assume that "Y would be the same as X." The difference is that there is no room for objection to pseudo-simulation, but there is room for objection to presumption.

The difference between the two uses is explained by patent law
	[Patent Act, Article 48-3] Paragraph 4: "Where no request for application examination is filed within the time limit within which a request for application examination may be filed, this patent application shall be deemed to have been withdrawn."
 Since this is a quasi-action, I said, "No, I have no intention of withdrawing! I was just late!" is not acceptable.

On the other hand, [Article 103 of the Patent Law] "A person who infringes the patent right or exclusive license of another shall be presumed to have been negligent in the act of such infringement."
 This is an estimate.
 In the first place, under the Civil Code, a claim for damages presupposes that the party who caused the damage was intentional or negligent. [Civil Code Article 709] "A person who intentionally or negligently infringes the rights or legally protected interests of another shall be liable for damages resulting therefrom."

But it is too much of a hurdle for the patentee to have to prove that the infringer of the patent is intentional or negligent. Therefore, the Patent Act specifically allows for a presumption of "negligence" in cases of patent infringement. This is called "[the procedure for remedies to patent infringement http://www.meti.go.jp/policy/ipr/infringe/remedy/remedy03-1.html]". Since this is a presumption, if the person who is presumed to be negligent claims and proves that "No, it is not negligence! and if they can prove it, they are found not to be negligent. Specifically, for example, if the patentee was already using the patented content at the time the patent application was filed, a "non-exclusive license based on prior use" is granted, and the patentee is allowed to use the patented content even if there is a patent.

> (Normal License by Prior Use)
>Article 79 Any person who, having made the invention himself/herself without knowledge of the contents of the invention pertaining to the patent application, or having obtained knowledge of the invention from the person who made the invention without knowledge of the contents of the invention pertaining to the patent application, is actually carrying on a business in Japan at the time of filing the patent application which is the working of the invention or is preparing to carry on such business, shall have a non-exclusive license to the patent right pertaining to the patent application to the extent of the purpose of the invention and business for which he/she is working or preparing. 


[擬制]と[推定]
#弁理士