Put in your position and ask questions.
If you ask a question that does not have a correct answer and do not include your thoughts in the question, the other person may feel uncomfortable.


 In general, the act of making the other person think about the meaning of the question is disrespectful to the other person. The only time it is allowed is when a teacher throws a question to a student.
  It's the responsibility of the questioner to list specific examples for questions that are too abstract. In general.
 Is that generally true? I've never heard of it before.
 I see. That's the answer.
 In what sense is it "I see"? I really don't know, not that I'm trying to stir the pot or anything....
 I mean that literally.
 All I know is that you seem to have figured out something that I didn't. If you don't mind me asking, I'd be glad to know what you figured out. If you don't mind, I would appreciate it if you could tell me what you found out.
 It turns out that I did not share with you the assumptions that I took for granted. I need to investigate what others think.
  By the way,
  > Tell me what you figured out.
  This is an easy question to answer,
  > I wonder what he means by "I see".
  This is a difficult (obvious and abstract) question to answer, I felt.
 It seems to me that when people ask questions, they usually assume that there is something they want to know. So I am surprised and interested in the concept of "obvious questions" Now.
  I would be happy if you could explain your feelings expressed by the word "obvious" in some other words.
 > Your feelings expressed by the word "self-evident" in some other word.
  This is a polite question and easy for me to answer because it tells me what you know and what you don't know.
  If this were the case
  > What do you mean by "self-evident"?
  If the question is, "What is the depth of the question?
  So I said "shallow depth question" = "obvious question".
  In Pomodoro's argument.
  > What kind of ideas?
  Regarding,
  > "I don't really care which one" is an acceptable response. I don't object either, and there's no need to decide.
  And in fact, as you answered, why ask a question for which you yourself have such an answer? I have the impression that this is an "obvious question".
 If you are thinking that I had the correct answer to that question beforehand, that is a misunderstanding. I don't have the answer, but whatever they answer is OK because it will help me flesh out what they are thinking.
 > Help detail what they are thinking
  Help for whom?
 During Clean's sessions, he strives to "help the other person," or in the case of discussions on Facebook, to help himself understand what the other person is talking about.
  If you feel that the questions here are "easier to answer" than in the clean session, it is because I am switching to questions that encourage "sharing with me what you are already aware of" rather than "your awareness".
 OK. I'll reiterate now that the premise is much more shared,
  > What kind of ideas?
  This is a "help for the other person" kind of question, and I would argue that it is disrespectful to the other person to do that if they are not in a clean session.
 I apologize if I have offended you.
  However, I want to clear up a misunderstanding. How I felt was, "I wrote that I wanted to have a hackathon, but the topic hasn't developed. What do you think should happen by having a hackathon? →The answer is that ideas will come out of it, and then the answer is vague again, "ideas." What am I talking about? There was no intention to "encourage the other party to notice".

 So, I'm still somewhat uncomfortable with the concept of "obvious questions," and from what I've heard so far
   Shallow questions of "depth" = "obvious questions."
   Questions for which the questioner already has the correct answer
  There are two ways of expressing the word "depth," and as for the former, I don't know what the word "depth" means, and the latter is only known after the fact.
  I wonder if I can dig into where this concept came from, so my question: when did the term "obvious question" come to mind?
 > What kind of ideas?
  That's a few seconds of thinking about it after reading the question "What do you remember?". I don't remember at a finer granularity than this.
 I see. What kind of idea?" You thought for a few seconds and then asked, "Isn't this an obvious question?" I see.
  And when asked to delve into what that "self-evident" was, the word that came up was.
   >To be fair...
   >> What do you mean by "obvious"?
   >If the question is "What is the depth of the question?
   >So I said "shallow depth question" = "obvious question".
  He said. I interpret this to mean that when I first asked the question, I first felt burdened by not knowing the "depth," and then, assuming that the "depth" was shallow, I felt that the answer was something I already knew, and thus the expression "obvious" was used.
  In a clean session, we should not make choices based on our interpretation to avoid imposing our ideas on the other person, but in everyday conversation, it would be useful to make choices to ease the burden when the other person is feeling burdened. Reference.
  There is a common salesman's technique of asking questions that can be answered with a yes/no answer, or narrowing down the options to get an answer by asking questions to get a statement out of them.
  However, when we were exchanging about the type of ideas on Facebook, we couldn't see their faces, so we couldn't even tell if they were feeling burdened or not....
 I'd say "self-evident" or "shallow" might indeed be a bit confusing, so I'd say "messy."
  Questions that are too broad in how they are answered are "messy questions" and unkind because they place a burden on the respondent. Those kinds of questions are often asked when a teacher is reminding a student of something, and they actually give that impression, which creates a sense of rebellion by saying, "You are not my teacher right now.
 Interesting thought. I guess I'm thinking that questions with a wide range of answers and no right answer are the most common questions asked by teachers to students, so it makes them feel like they are not equal when they are asked those kinds of questions.

[Facebook https://www.facebook.com/nishiohirokazu/posts/10215463248590915]
