Speed reading experiment 20140531
Today's speed reading training
2014-05-31
「創造的認知」219p 8m30
Explanation of the GENEPROA model
Jiro Kawakita wrote the foreword.
Geneproa is a model that divides creation into generation and exploration.
I'm still not sure what the benefits of separating them would be.

Creativity Management, 186p 7m45
The cube diagram, when I first saw it, without a source, I had the feeling that I thought "what the heck".
For the third time in this book, I found out that it was Guilford.

Marketing Interview," 183p 15m32.
Focus on discovering unverbalized customer benefits
Resolving cognitive dissonance, the gap between ideal and reality is also cognitive dissonance, easy to ignore with justification, etc.
Interesting "Management of Silence," which finds value in silence and categorizes it into seven types
Factors that prevent true feelings from emerging: vanity, social roles, tacit knowledge
'If I were to explain this to a child' is useful for removing implicit assumptions

Organization and Groupware, 292p 6m44
For some reason, I felt like he was telling me to read it now, so I brought the book back.
It's a book from 1992 that says, "The computer of the future is a tool to support creative activities through team play."
Not much has changed.
pp134-215 14m

Information in One Notebook, Complete Edition" 263p 12m14
Reducing psychological hurdles such as pre-sorting by putting them in one book
I can tell you where it was written, even if it's analog, up to about five books.
As for where to go from there, we'll index it digitally.

Organization Patterns, 379p 10m35.
I'm not sure I'm getting a clear picture of this.

When I participated in a Python spa type thing?
If you put on headphones and pomodoro because you want to concentrate on your work.
And you won't be able to catch up with the interesting conversations going on around you.
That said, I'm not sure I'd be able to get the work done if I wasn't turning pomodoros...
If your goal is to input information, such as "read a book and make it a sticky note".
We could do the work that could be fragmented.