Advanced IT Human Resource Development for the Future
[https://www.youtube.com/watch?v=k4dnCKa46-g]

[IPA Symposium 2018 https://www.ipa.go.jp/about/event/ipasympo2018/index.html]
Panel Discussion: Advanced [IT Human Resource Development] for the Future

	panelist
 	Ikuo Takeuchi, Professor Emeritus, University of Tokyo / Project Manager, Unexplored Project
  Masahiko Inami, Professor, Research Center for Advanced Science and Technology, The University of Tokyo / Project Manager, Unexplored Project
 	塩澤 一洋氏（成蹊大学 法学部 教授）
  Tasuku Ukai (Representative of Unexplored Junior / Ministry of Education, Culture, Sports, Science and Technology)
 moderator
		Jun Taguchi (Chief Editor and General Manager, 1st Editorial Management Department, Impress, Inc.)
(以下敬称略)

竹内
	There is a difference between an eccentric and a weirdo.
 Odd has a good meaning, but strange does not.

塩澤
	[There are two ways to train IT personnel.]
 	Develop IT human resources[*].
  IT[* to] develop human resources
	Introduction of seminar and class scenes at the Faculty of Law
 	seminar
  	All use laptops
　 Everyone inputs questions at the same time and shares them in real time (Scrapbox's collaborative editing function)
　  Only one person can speak at a time with voice, but with IT technology, everyone can speak at the same time
  授業
  	QR Code to share documents
  	Everyone writes on paper first by themselves in response to a question (because it is not possible to have everyone in class with a laptop).
   Then explain it to your buddy (duo) partner.
   Then, anyone who wants to explain to the entire classroom raises their hand to share with the whole group.
 There are two types of education
 	Teachers teach and nurture students.
  Students teach and students grow
  We think the latter is better.

cormorant fishing
	There are two ways to educate.
  expand one's sphere of influence
  [pulls up top-tier changemakers].

竹内
	未踏18年
 Centennial Plan for Education
 Students Easy to do whatever you want because there is no sense of life.
 	A sense of life would put the brakes on.
 Unexplored target started
 	The number of unexplored families is increasing.
	The [PM system] was a good system.
 	[J・C・R・リックライダー - Wikipedia https://ja.wikipedia.org/wiki/J%E3%83%BBC%E3%83%BBR%E3%83%BB%E3%83%AA%E3%83%83%E3%82%AF%E3%83%A9%E3%82%A4%E3%83%80%E3%83%BC]
  PMs [single-minded] is important to adopt the sharpest talents.
  It is easy to become averagist when decisions are made by committee-like councils.
  	Related: [Harmonized average to get the sharpest talent].

稲見
	I am not an unexplored adopter myself, but I have many unexplored sharp people around me and my students.
 One unexplored person is a good influence on those around you.
 [教育の複線化]
 	It is important that students have a community outside of school.
 [半学半教]
 	University faculty do not teach students unilaterally, but learn from them themselves. Half learning, half teaching.

塩澤
	Participate in the Unexplored Boost Conference to encourage projects with legal concerns.
 Advise projects that "might be legally problematic" by saying, "You can do this if you do this."
 Free thinking and new manufacturing means that we are not bound by the current legal system.
 It's easy to say, "Oh, that's wrong under some law," but I'm not called to do that.
 	Suggest ways you can do it.
 Boost meetings are interesting.
 	Alumni are all over the place to give advice to current students.
  I feel like, "You're making Japan's IT!"

cormorant fishing
	network of seniors and juniors
 Especially unexplored juniors, middle and high school students are growing so fast.
 College students have a lab community; middle and high school students have no equivalent.

田口
	Is there communication across generations, locations, and companies?
竹内
	Unexplored Youth started in 2002, and a system of boosting meetings began.
 I'm going to put you all in a crucible.
 After a few years, they started letting alumni in.
 	Increased thickness
  Many alumni are also active and mess around with current students
  	Introduce people and technology
   Advice.
  Mostly positive effects
 How it works now
 	Around July Boost meeting All together Crucible
  Around November 8th training camp All together again
  Around February Results debriefing

田口
	Once adopted, results will be questioned, and how to evaluate them.
稲見
	The PM is committed to the outcome of the project because it was adopted.
 We are not "evaluating" from above, but we are a community of destiny.
 I've consulted with various past PMs.
 	Where we work with the creators to find solutions."
		This was both the hard part and the good part.
田口
	In the opinion of the actual adopters, Mr. Cormorant, are there any incompatible PMs or something?
cormorant fishing
	In my own personal case, it was a good match, but there are still cases where it is not a good match.
 But even if you take it to the council, it's just an average score.
竹内
	PMs are quite willing to talk about other projects that they have not adopted.
	奇×奇
	Fairly interesting.

竹内
	未踏人材
 	1/3 Entrepreneurial people who start their own business with entrepreneurship
  1/3 People belonging to large establiished organizations
  1/3 Those who go on to academia
 	The sum of this diverse pool of talent is worth more than one.
	Venture asset value 500 billion
 	A very cost-effective project, more than 100 times more than the taxes spent.

稲見
	I'd like it to be a place for some pretty strange people.
 VR also expanded from research on VR itself to research on how to use VR.
 IT is also spreading to places that were thought to be unrelated to IT
田口
	xTechか
塩澤
	In that sense, I would love to see you become a lawyer.
 One of my own students is a lawyer with a biotech background. A lawyer who can do his own genetic testing.
 	The multiplication of the two creates a high value.
 Laws are often viewed negatively, the rules of society, but you wouldn't view the rules of soccer negatively.
 Just like someone who has never programmed before would be wowed by a program.
	In sports, you know the rules and use them strategically.
 	Mr. Ochiai quit and was rehired the next day, or a strategy based on his understanding of the rules.
	We want people to be interested in the law rather than rejecting it out of hand.

cormorant fishing
	England
 	Lack of teachers to teach
  The more rural the area, the more it lacks.
  Problems in areas where there are no engineers around who are happily working.
 Unexplored = Make what you want to make with your own suggestions, fun
	I want to work with people who are making what they want to make, not people who are being told to make something.
	It's a shambles if your parents say you should do it, or your teacher says it's good for the exam.
 We need to change the mindset of parents and teachers.

田口
	I think the law is stifling innovative movement. Continental law is what is written is OK and what is not written is not. Anglo-American law is based on precedents, and what is not in the precedents is tried.
塩澤
	Japan is indeed continental law, but the Constitution says "all men are free."
 The Constitution sets rules to prevent the government from becoming bloated in order not to suppress individual liberties.
 Article 199: Whoever kills a person shall be punished by death or imprisonment for life or for not less than five years.
 	Legalism: Crimes are only those specified in the letter of the law; what is not written is freedom
  And it doesn't say, "Don't kill. It says, "If you kill, you will be punished in this way."
  Thou shalt not kill" is a religion
 The same goes for the rules of soccer. What is not written in the rules is free.
 	Freedom to do anything except what is explicitly stated as "not to be done."
cormorant fishing
	Keep challenging yourself.
田口
	Incident in which I tried to analyze Suica data and was told not to use it without permission.
塩澤
	I don't know the details of that case, but the rules for private citizens are mutually agreed upon and made. That is the contract.
田口
	It was not in the contract.
塩澤
	When it is not written in the contract, it is the letter of the law.
 There are two patterns in the text of the law.
 	Anything that says what you are "allowed to do in principle" and what you are not allowed to do (e.g., criminal law)
  Something you think "in principle you shouldn't do," but that says what you should do (e.g., copyright law)
 In truth, given that society changes faster than the law, the principle OK clause is preferable.
 [nishio.icon]Here, it's pretty much skipped over because it can't be explained verbatim, and some people might think we're jumping off topic.
  Supplemented by my interpretation, the flow is as follows
  	If it is not written in the contract (if there is no prior agreement between the parties), the provisions of the article are used as default values.
   The claim "don't use it without permission" is an act of demanding a specific action (inaction) from the other party.
   In order to require someone else to do an act, there must be an article that provides the basis for being able to do it.
   There are two types of clauses in that article: the type that lists what not to do and the type that lists what to do.
   The former is preferable to promote innovation
稲見
	Technology-based sports for 2020
  Various new and interesting sports are being created.
 	Even in elementary school, they would have made up their own rules to play by.
 	The rules keep changing.
 It would be good to have closer communication and interaction.
塩澤
	Laws are always applied to the future rather than when they were made.
 It was old when we made it.
 The world is changing and we need to keep changing it.
 It is too late to follow up on changes after seeing them, but it is necessary to foresee future changes and change them.
 The rules for both volleyball and badminton are changing rapidly.
 There are two words for "obey the law."
 	0 Comply with the current law.
  × The current law must not be changed by respecting it as if it were a golden rule.
  It's important to change.
	Law schools educate students to "be the rule changer."
田口
	Sandbox, laws can be loosened for a limited period of time, and the period can end when the business seems to be going well.

田口
	In other countries, VC intermediates or technology and business matching is popular, while unexplored areas may be weak.
竹内
	Weak.
 Just the other day, we had a closed session to pitch in front of the VC's.
 I don't think it's very clear what kind of support you are looking for.
 I don't think all of them need to be able to do it, in which case they should be matched with someone who can do it, but where are the people who can do it?
cormorant fishing
 Not all unexplored are oriented to have VCs put money into them, and not all of them are selected solely for the purpose of starting a business at the time of adoption.
	It's not right to criticize current students without creating a complementary mechanism.
稲見
　In a university, there are VCs hanging around, setting up cafes so that people can consult with them, etc.
 The startup model is just one option, not all of them are like that.
 Neither Unity nor WWW grew with VC funding.
 The bad thing is to stay small, we should burst out more.

塩澤
	No tower can stand like Mt. Fuji, a sliver of land is needed for sharp people to grow.
 It is important for non-IT people to become familiar with IT
