Does retweeting violate the right to identity preservation?
 https://togetter.com/li/1236554
 The basic premise is that different person B posted on Twitter without authorization from author A and without permission.
  Be careful, because some people are afraid and angry because this is forgotten and overgeneralized.
		>What is at issue is only copyrighted material uploaded to Twitter without permission.
  > I think that retweeting images and other content that the rights holder has legally given to Twitter will be made legal by the terms of the agreement. Please keep this in mind.
   [Rio Saito, Attorney at Law https://twitter.com/b_saitorio/status/1006749812102844417]
		In fact, Twitter's terms of service state
  > By submitting, posting or displaying Content on or through the Service, you grant us a worldwide, non-exclusive license (with the right to grant sublicenses) to use, copy, reproduce, process, [* alter, modify], publish, transmit, display and distribute such Content in any media or delivery method (known or hereafter developed) without compensation. (together with the right to grant sublicenses) to use, copy, reproduce, process, [* modify, alter], publish, transmit, display, and distribute such content in any media or method of distribution (known or hereafter developed).
		The important point is that author A did not agree to these terms of use because different person B posted the article without author A's permission this time.

	People who hear that "just retweeting an image someone illegally posted on Twitter is an infringement of their right to identity preservation" are asking, "Will I get arrested?" Cases where people are afraid that they will be
  Not an issue in cases where the retweeter cannot know if it was uploaded illegally or not.
  Criminal Code Article 38 [eGov http://elaws.e-gov.go.jp/search/elawsSearch/elaws_search/lsg0500/detail?lawId=140AC0000000045&openerCode=1#H]
  > Part I General Provisions of the Penal Code Chapter VII Non-completion of Crimes and Reduction or Remission of Punishments
  > (Intentional)
  > Article 38 An act without intent to commit a crime shall not be punished. However, this shall not apply where there are special provisions in law.
		The right of identity preservation is a moral right of authorship. The crime of infringement is provided for in Article 109 of the Copyright Act.
  >Copyright Act Chapter VIII Penal Provisions
  >Article 119 (Omitted)
  >2 Any person who falls under any of the following items shall be punished by imprisonment with work for not more than five years or a fine of not more than five million yen, or both.
  >(i) A person who has infringed moral rights of authors or performers (excluding a person who has committed an act that is deemed to be an act of infringement of moral rights of authors or performers pursuant to Article 113 paragraph (3))
		As you can see, there is no "special provision in the law," so if there is no willful intent, it is not punishable.
  Related:.
  	Examples of punishment without intent
    >Article 210 of the Penal Code: A person who causes the death of a person through negligence shall be punished by a fine not exceeding 500,000 yen.
    So-called manslaughter

	When B illegally posts author A's work on Twitter, B's copyright infringement is naturally established.
 	The issue in this case is whether C, who retweeted the tweet, is also infringing.

Related Articles
 http://d.hatena.ne.jp/redips+law/20180610/1528634701
 [IP High Court ruling showing that there is a risk of your identity being revealed to others simply by retweeting (Kiyoshi Kurihara) - Personal - Yahoo! News https://news.yahoo.co.jp/byline/kuriharakiyoshi/20180613-00086449/]
