Act on the Use of Information and Communications Technology for Preservation, etc. of Documents by Private Business Operators, etc.
 Zacky: The law that says you can store documents electronically #ICT Law
 [eGov http://elaws.e-gov.go.jp/search/elawsSearch/elaws_search/lsg0500/detail?lawId=416AC0000000149]
 Enacted in 2016

> (Purpose)
>Article 1 This Act provides for common matters to enable the preservation, etc. of documents by private business operators, etc. pursuant to the provisions of laws and regulations to be conducted by a method using an electronic data processing system or other information and communications technology (hereinafter referred to as an "electromagnetic method"), thereby promoting information processing by electromagnetic methods. Article 1 The purpose of this Act is to promote information processing by electromagnetic means and to improve the convenience of citizens through the reduction of burdens related to the preservation, etc. of documents, thereby contributing to the improvement of the lives of citizens and the sound development of the national economy, by providing common matters to enable the preservation, etc. of documents conducted by private business operators, etc. by means of electronic information processing systems and other methods using information and telecommunications technology (hereinafter referred to as "electromagnetic means") in accordance with the provisions of laws and regulations.
 Promotion of information processing by electromagnetic means
 Reduction of burden related to preservation of documents, etc.
 Improvement of convenience for the public
 Improvement of people's lives
 Healthy development of the national economy

> (Preservation by electromagnetic record)
>Article 3 Private business operators, etc. may, notwithstanding the provisions of other laws and regulations concerning said preservation, preserve electromagnetic records pertaining to said documents (limited to those specified by the Ordinance of the competent ministry) in lieu of the preservation in writing as specified by the Ordinance of the competent ministry. Article 3 Notwithstanding the provisions of such laws and regulations, a private business operator, etc. may preserve electromagnetic records pertaining to said documents in lieu of the preservation of written documents, pursuant to the provisions of the Ordinance of the competent ministry.
 [nishio.icon]Although it is limited to those stipulated in the ordinance of the competent ministry, those that have been stipulated by law to be preserved in paper form will now be allowed to be stored in electromagnetic records.

> (Creation by electromagnetic record)
>Article 4 Private business operators, etc. shall prepare documents that are required to be prepared in writing pursuant to the provisions of other laws and regulations concerning such preparation (limited to those documents pertaining to such preparation or the original, transcript, extract or copy thereof that are required to be preserved pursuant to the provisions of laws and regulations and are specified by the applicable ministerial ordinance). (limited to those specified by the ordinance of the competent ministry). (2) Notwithstanding the provisions of other laws and regulations, with respect to a document (including an electromagnetic record), an electromagnetic record pertaining to said document may be prepared in lieu of the preparation of the document, as provided for by the Ordinance of the competent ministry.
 [nishio.icon]Similarly here, documents that were supposed to have to be made in paper form are now allowed to be made in the form of zakka electromagnetic records.

>3 In the case of paragraph (1), if the private business operator, etc. is required to sign, etc. pursuant to the provisions of other laws and regulations concerning such preparation, notwithstanding the provisions of such laws and regulations, he/she may substitute his/her signature, etc. by a measure that clarifies his/her name or title and that is specified by the ordinance of the competent ministry.
 [nishio.icon]Even the type of document that requires a signature will be acceptable in a way that reveals the name.

The terms "written document" and "electromagnetic record" are defined as follows
>Article 2 (Definitions)
>(iii) "Document" means a document, paper, document, transcript, extract, authenticated copy, duplicate copy, duplicate copy, or other paper or other tangible object on which information that can be recognized by human perception, such as characters and figures, is written.
> (iv) Electromagnetic record means a record made by an electronic method, a magnetic method, or any other method not recognizable to human perception, which is used for information processing by a computer.


Act on the Use of Information and Communications Technology for Preservation, etc. of Documents by Private Business Operators, etc.
#ICT Law
