Act on Electronic Signatures and Certification Business
 Zacky, let's make it OK to use electronic signatures #ICT Law
 [eGov http://elaws.e-gov.go.jp/search/elawsSearch/elaws_search/lsg0500/detail?lawId=412AC0000000102&openerCode=1]
	Enacted in 2016

> (Purpose)
> Article 1 The purpose of this Act is to promote the distribution of information and information processing by electromagnetic means by ensuring the smooth use of electronic signatures, thereby contributing to the improvement of the lives of the citizens and the sound development of the national economy, by providing for a presumption of authenticity of electromagnetic records, a system of certification concerning specified certification services and other necessary matters concerning electronic signatures. The purpose of this Act is to contribute to the improvement of the lives of citizens and the sound development of the national economy.
 Ensure smooth use of electronic signatures
 (Distribution of Information by Electromagnetic Means and
 Promotion of information processing
 Improvement of people's lives
 Healthy development of the national economy

>Chapter II Presumption of Authentic Establishment of Electromagnetic Records
> Article 3 Electromagnetic records that are created to represent information (excluding those created by a public official in the course of his/her duties) shall be deemed to have been created by the individual concerned. Article 3 An electromagnetic record (excluding one created by a public official in the course of his/her duties) is presumed to be authentic when an electronic signature (limited to a signature that can be made only by the person himself/herself by properly managing the codes and objects necessary for making such signature) is made by the person himself/herself on the information recorded in said electromagnetic record. (2) When the information recorded in the electromagnetic record has been electronically signed by the principal (limited to information that can be signed only by the principal by properly managing the codes and objects necessary to do so), it shall be presumed to be authentic.
 Genuinely executed" means "created in accordance with the intention of the person who created it."
  Public documents prepared by public officials in the course of their duties are presumed to have been authentically executed
  A personal document signed or stamped by the principal or his/her representative shall be deemed to be authenticated
  Code of Civil Procedure Article 228
   >Code of Civil Procedure Part II Proceedings in the First Instance Chapter IV Evidence Section 5 Documentary Evidence
   > (Formation of document)
   > Article 228 A document shall be proved to be genuine in its formation.
   > 2 [* A document shall be presumed to be a genuinely constituted official document if its form and purpose lead to the conclusion that it was prepared by a public official in the course of his/her duties].
   > 3 When there is doubt as to the authenticity of the establishment of a public document, the court may, ex officio, make an inquiry to the relevant government agency or public office.
   > 4 [* A private document shall be presumed to be duly executed if it bears the signature or seal of the principal or his/her agent].
   > 5 The provisions of paragraphs (2) and (3) shall apply mutatis mutandis to documents that should be deemed to have been prepared by a foreign government agency or public office.
 In other words, an electromagnetic record that is electronically signed is presumed to be "authentically executed" just like a private document that is stamped.
