BMOT Series
A summary of [Tokyo Tech BMOT] related events involving [nishio.icon]. In general, you do not have to be an alumnus/alumna of Tokyo Tech MOT to participate.

Upcoming events

	[BMOT特別授業第3回「知的生産」]
  2018-08-22 予定
  Continuing with the theme of "Intellectual Production," a type of physical education class where the instructor does not teach one-way but rather the audience engages in discussion.
  We'll also be reviewing the first session, so even if you didn't attend the first session, that's okay.
  Plan to experiment with APISNOTE to try it out.

already held
	2018-05-26 [Tokyo Tech Homecoming Day "AI and MOT"].
 	>On 5/26 (Sat), Tokyo Tech's Homecoming Day @ Ookayama Campus will be held.
  > This year's MOT Lecture Series will feature alumni Goshin Kono and Yasukazu Nishio, who will speak on the topic of "AI and MOT.
   Tomoya Tachikawa - [Wish to share] [Go to Tokyo Tech Homecoming Day on May 26 (Sat)... https://www.facebook.com/photo.php?fbid=10212630911836823&set=a.10204042236765314.1073741829.1505859477&type=3]
  [https://gyazo.com/88ab7637e8ff4ec6e066233f8dc16a87]
		https://www.titech.ac.jp/alumni/hcd/event2018.html

 208-06-20 [BMOT特別授業第1回「知的生産」]
  >[Dr. Nishio will give a free public lecture at the Tokyo Tech Tamachi Campus!
  > Last week I became the secretary of the alumni organization of my alma mater, and since I wanted to do something interesting, @Nishio Hirokazu, who has been appointed as a specific associate professor at Tokyo Tech MOT (Management of Technology) since this April, helped me to organize a free public lecture!
   [立川 智也 https://www.facebook.com/photo.php?fbid=10212849492341199&set=a.10204042236765314.1073741829.1505859477&type=3&theater]
  	>In the style of speaking with a lot of lecture materials, the roles of "speaker" and "listener" are inevitably divided, and it tends to become a one-way listening session like television.
   > Therefore, we dared to prepare only a few bullet points in our materials and adopted a style that emphasizes "dialogue" with participants.

 2018-07-11 [BMOT: 東工大特定准教授 西尾泰和氏 ＆ ONE FINANCIAL(株)CTO 丹俊貴氏 特別対談 https://www.facebook.com/events/2042240129349257/?notif_t=plan_admin_added¬if_id=1529009261831415]
		>【参加自由】【東工大特定准教授 西尾泰和氏 ＆ ONE FINANCIAL(株)CTO 丹俊貴氏 特別対談！】
  > Have you heard of ONE, the app announced yesterday that buys a single receipt for 10 yen?
  > A conversation between Mr. Toshitaka Tan, CTO of ONE FINANCIAL, the company that provides this application, and Dr. Nishio, a specified associate professor at Tokyo Institute of Technology, was planned at Tokyo Tech.
  > Also, this time it will not be just a dialogue, but will proceed with live sharing of Dr. Nishio's notes with all participants. This is an attempt to visualize "learning by listening to others" a little more, and we think it might be interesting, and something might come out of it.
   [立川 智也 - 【参加自由】【東工大特定准教授 西尾泰和氏 ＆ ONE FINANCIAL(株)CTO 丹俊貴氏 特別対談！】... https://www.facebook.com/tomoya.tatekawa/posts/10212900309811604]
  [https://gyazo.com/05af3288e7a27e5c3b8c3557744663a0]
  I imagine that the first half of the session will be listening to Mr. Tan's presentation, and then [nishio.icon] will ask various questions and delve deeper into the topic.
 		Experiment of projecting [nishio.icon] taking notes on an iPad directly onto a screen
  [A conversation with Toshitaka Tan]
