Heart Sutra
My wife didn't know anything about sutra and wanted to know at least one thing about it, so I explained it to her using a slide I wrote a long time ago.
 https://www.slideshare.net/nishio/ss-38742646


 Kannon (Boddhisattva)
 	Avalokitesvara Bodhisattva (bodhisattva who looks over children, travellers and the environment) (travelers)
 	In Japan, it is better known as Kannon Bodhisattva.
  A bodhisattva (bodhisattva, bodhisattva sattva) is a person in training in search of enlightenment.
   It is a Sanskrit pronunciation with kanji characters (a foreign word), so there is no deep meaning in the characters.
 The depth of the line, Prajnaparamita Time
		When I was in deep practice
		Hannya means "wisdom" and haramita means "enlightenment" or "practice in pursuit of enlightenment.
   Both are foreign words.
 seeing the light, the five skandhas, the five skandhas, the five skandhas, the five aggregates
 	It's all empty! I had an epiphany.
  The five skandhas mean "all things."
   The five elements are color, reception, thought, action, and perception.
 all sorts of hardships and troubles
  All the bitter troubles are gone.
   I realized it was all empty, so the suffering stopped.
 bones left after cremation (esp. those of a Buddha or Boddhisatva)
 	Personal name Saariputta, one of his disciples. There is no deeper meaning as the usage narrates, "Saariputta, I am ~~."
 Color is emptiness, emptiness is color, color is emptiness, emptiness is color
 	Color=Sky
  And I'm just saying it in four different ways.
  The famous phrase "color equals emptiness" appears here.
 Receiving, thinking, doing, and understanding are all true.
 	Receiving, thinking, doing, and knowing are the same (i.e., they are empty).
  The five skandhas are a combination of color, perception, thought, action, and knowledge, so in essence, I am just explaining "all the five skandhas are empty" in a simplified form.
 bones left after cremation (esp. those of a Buddha or Boddhisatva)
 	Saariputta.
 This is the empty space of all the laws of the universe
 	The law of moro is empty, too. I mean...
 (unborn and immortal, immaculate and immaculate, unincreasing and decreasing)
 	Not born, not lessened, not defiled, not purified, not increased, not diminished
 Therefore, there is no color in the air, no thought, no action, no knowledge.
 	Hence, nothing in the sky.
  The five skandhas (color, perception, thought, action, and sense) are out again.
 No Eye, ear, nose, tongue, body, will
 No Color, voice, smell, taste, touch, law
 	There are no sensors to sense things, so there is no object that can be sensed by it.
	The world of the unaided eye, or the world of the conscious mind
 	There is no world that can be felt with the eyes, no world that can be felt with consciousness.
 There is no light, and there is no light, and there is no light, and there is no light, and there is no light, and there is no light
 	The state of not being in the light of wisdom is called "no-mind," but that "no-mind" itself does not exist. Since it does not exist, it will never cease to exist.
 Or, no aging, no death, no aging, no death, no exhaustion.
 	Nor do old age and death exist. And since they do not exist, they will never cease to exist.
 Suffering, Gathering, Perishing, and the Way of the Universe
 	Suffering, gathering, destruction, and the way are the four elements of the way to enlightenment (the Four Noble Truths). This is what I have been training to practice, but I have been told that I don't have this either.
  [The Four Noble Truths - Wikipedia https://ja.wikipedia.org/wiki/%E5%9B%9B%E8%AB%A6]
 No wisdom, no gain
 	There is no wisdom, and there is no way to gain it (which is a strong turnabout, since that's what I was practicing for).
 
 	Because there is no attainment of wisdom, the Bodhisattva is no longer attached to his mind, and because he is no longer attached, he is no longer afraid, and is able to detach himself from all crazy thoughts, thus reaching the state of nirvana.
  In short, the pressure of "I must be enlightened, I must gain wisdom" is gone, and I am free from the fear of "what if I can't be enlightened," and my mind is at peace, and I am happy.
  I didn't translate the "Yori prajnaparamita nakara" part, but it means "by this enlightenment".
 The three Buddhas, I have attained anuttara-samyak-sambodhi because of prajna-paramita.
 	Through this enlightenment, all Buddhas attain unsurpassed enlightenment.
		The three generations of Buddhas are all the Buddhas of the past, present, and future.
  Anuttara-samyak-sambodhi is a foreign word meaning the highest level of enlightenment.
   What is [anuttara-samyak-sambodhi - Cotobank https://kotobank.jp/word/%E9%98%BF%E8%80%A8%E5%A4%9A%E7%BE%85%E4%B8%89%E8%97%90%E4%B8%89%E8%8F% A9%E6%8F%90-26482]
 Therefore, know that Prajnaparamita, the Great Divine Curse, the Great Ming Curse, the Superlative Curse, the Equal and Unequal Curse, can eliminate all suffering, and that the truth is not false.
 	Hence, this enlightenment (wisdom) that we know is the mantra of the unsurpassed. It is the truth that removes all suffering.
  Immediately after this, the words of the incantation Hannya-Haramitta Curse are introduced.
  This is where I start to get the feeling, "Is this really written by an enlightened person?" I feel like, "Is this really written by an enlightened person?
  It's like, "You can go to paradise just by reciting the Buddha's prayer."
 The following is a brief explanation of the Prajnaparamita Curse. The words of the incantation are: 羯諦羯諦, Hara羯諦, Hara monks羯諦, Bodhisattva Sattvabhadra. Prajnaparamita Sutra
 	The incantation is "羯諦羯羯諦, hara羯諦, hara monks羯諦, bodhi satsubaba da" (gyate-gyate-hara-gyate-bojisowaka).
