Why do pens disappear?
 People who are prone to losing their pens may engage in the behavior of placing multiple pens here and there in an attempt to avoid the inconvenience of not having a pen. This induces the tendency to lose pens.
 If a pen with the same appearance is in more than one place, it is not clear where it should be returned to when the pen is finished being used. Therefore, they are returned to a different location than where they were taken. As a result, the number of pens in their original locations will decrease.
 It would be an improvement if, when looking at a pen, one could see at a glance where the pen should be returned to.

	事例
 	The day I got my Apple Pencil, I suddenly lost it (it was stuck in the sofa).
  I bought a case with a Pencil holder.
  I haven't lost one since.
  If there is a clear "where to put it back," it won't be lost.

-----
An experiment in making a [list of belongings
	Wife: "Ballpoint pen not included on any list."
	I "have two ballpoint pens in my notebook."
	Wife: "Why did you say you bought this at the convenience store the other day?"
 I "didn't have a ballpoint pen in my notebook at the time."
 Wife: "Why is there sometimes no ballpoint pen in my notebook?"
 I said, "Ballpoint pens disappear at a rather high rate. By keeping two ballpoint pens in my notebook because I don't want to be without one, I reduce the probability of losing both. Only once have I needed to buy one at a convenience store."
 Wife: "It is strange in the first place that ballpoint pens disappear. Why not just have one in your notebook?"
 I said, "I don't want to lose it."
 Wife: "If you think you'll be in trouble if it goes away, it won't."
 I said, "I made sure to put two bottles in because I thought I'd be in trouble if I ran out and I actually was in trouble if I ran out."

 Why is the pen gone?
  Let's say there is a pen in a certain place X, because it is not limited to notebooks.
  Use a pen in location X.
  If that pen returns to location X after use, then the number of pens in X should not decrease.
 Why doesn't the pen return to its original position?
  I leave it on my desk.
  They go to different places (e.g., pen holders).
  	Leaving it on the desk is another example of this.
 Why does the pen go to a different place after I use it?
  I don't know where to put that pen back, especially if I'm using a pen that has no personality.
  If the same pen is on your desk and in your notebook, you can't tell where it came from just by looking at it.
  Difficult to remember where a pen with no apparent difference in appearance came from
  Why not just look at the pen and know where to return it without thinking?
 How to experimentally verify this
 	Idea 1: Put a name sticker on the pen stating where it should be put away.
  今回の実験
   Change the pen for the breast pocket to a unique one
   背景
    Important to have a pen right out of the breast pocket.
    But the pen in his breast pocket often goes missing, too.
    I had two bottles in there.
    Because the pen he had in his pocket was a knock-off pen, it was knocked unexpectedly, exposing the nib and causing an ink stain on his breast pocket.
    There has long been a proposal to change the pen to improve this.
    Change to a cap-style pen
    2018-06-17
    I happened to pass by a bookstore that sold prominently colored pens.
    [https://gyazo.com/5cbed9a526c3ca141b89792307a937ca] [LAMY] Safari
    This pen is too thick to tuck into my notebook, and if I had it on my desk, it would stand out because of its bright colors.
    The notebook will eventually be mended with a slender, conspicuously colored pen.
 2022-09-11
 	This pen is not gone.

[iPad行方不明事件]
Why do pens disappear?