Technology and Innovation Explained
	Commentary on Chapter 11 of [Technology and Innovation] [2014-07]-17

[http://nhiro.org/tech_and_inov/page-01.png]
Technology and Innovation2014-07-17Yasukazu Nishio1

[http://nhiro.org/tech_and_inov/page-02.png]
Chapter 11 - This final chapter discusses the relationship between technology, [the economy], and biology.
-This presentation will introduce the contents of this book, present specific examples and related studies, and conclude with a summary discussion.2

[http://nhiro.org/tech_and_inov/page-03.png]
Introduction-Three principles of technology (p. 257) -The mechanism by which technology emerges (p. 258) -Technology becomes an organism (pp. 260-262) -Sources of competitive advantage (p. 265) -How to deal with technology (p. 269) 3

[http://nhiro.org/tech_and_inov/page-04.png]
Considerations-Why ignore the human will? -What's at the end of the line? -What is the difference between [Darwin's Theory of Evolution -The relationship between [order vs. life force] and methodological evolution -The picture of technological evolution4

[http://nhiro.org/tech_and_inov/page-05.png]
Three principles1 p.257 -1: All technology is a combination of elements -2: Elements themselves are technology -3: Technology uses phenomena for some purpose5

[http://nhiro.org/tech_and_inov/page-06.png]
Question three principles - 1: Technology is all a combination of elements 2: Elements themselves are technology - doesn't this definition mean that technology is an endless hierarchy? →Consideration 1: "What are the ends?" 6

[http://nhiro.org/tech_and_inov/page-07.png]
Question 3: Technology exploits a phenomenon for some purpose - e.g., "ranking by zero"? Is it not technology? →Introduction 2: "Mechanisms by which technology is created "7

[http://nhiro.org/tech_and_inov/page-08.png]
Introduction to Technology2 p.258 Mechanisms produced
-Combination of needs and seeds (effects that satisfy needs)
-Facing Limitations / Creating New Problems
-this creates a new need = [niche] niche: [English]niche [French]niche [German]niche: hollow -> Hamannus, hyperthermophilic bacteria
Needs are drawn more from human desires than from the technology itself8

[http://nhiro.org/tech_and_inov/page-09.png]
Role of the Economy - Informing Needs - Test for Commercial Availability -> "[Commercially available]" means "people willing to pay, profitable" i.e., "satisfies human needs, low cost "9

[http://nhiro.org/tech_and_inov/page-10.png]
Economy is also technology - there are "arrangements" of businesses, means of production, institutions, organizations, etc. - this creates opportunities for the next generation of "arrangements" - author: "So it's the same structure as technology! Nishio: "Are you ignoring "3: Technology uses phenomena for some purpose? →Let's think about "arrangements" 10

[http://nhiro.org/tech_and_inov/page-11.png]
Arrangements (1/3) - Value is created by making "[arrangements]" - e.g., barter (fish and wild vegetables) Value of things is subjective and can increase through exchange → Value can be created even if nothing is created - e.g., getting Rights (→currency) Exchange rotting fish (zero future value) for "the right to acquire things" → value created by exchange for inanimate objects11 #Arrangements create value

[http://nhiro.org/tech_and_inov/page-12.png]
Arrangement (2/3) - e.g. [alphabet].
 By agreeing on symbols to represent words, information can now be conveyed without being in the same place at the same time.
  →Value through standardization
 -example: computing with rank by 0 using rank by 0 is easy = value of human cognitive cost saved #thought economy
 ↑This value is standardized (cid:15483)Roman and Chinese numerals after the fact by the spread of good arrangements that can be obtained even when used by one person.
 (clay tablet and cuneiform) 12

[http://nhiro.org/tech_and_inov/page-13.png]
Arrangements (3/3) - "Arrangements" that do not use natural phenomena can also create value and meet human needs - If the economy is technology, then all arrangements of this kind are technology - arrangements with others Not necessary. One person can save his/her cognitive costs. -Isn't this the driving force behind the creation of new concepts? (concept = arrangement) 13

[http://nhiro.org/tech_and_inov/page-14.png]
p.260Introduction 3Technology Becomes an Organism - Technology becomes more complex and [top-down] design becomes more difficult.
-Especially when the environment changes rapidly, it is not possible to design rules in advance - so what is "design that can adapt to changes in the environment" to enable interactive changes? →Example 14

[http://nhiro.org/tech_and_inov/page-15.png]
Adapt to changes in the environment - designed to change [interactively] in response to changes in the environment - e.g., centrifugal regulators: http://ja.wikipedia.org/wiki/調速機

[http://nhiro.org/tech_and_inov/page-16.png]
Adaptation to changes in the environment - e.g.: Smartphones Rather than designing and preparing functions required by users in advance, users can install applications according to their own needs - from the smartphone perspective, "a mechanism that adapts after the fact to an environment (user needs) that is difficult to know in advance "16 A mechanism that adapts after the fact to environments (user needs) that are difficult to know in advance. "16

[http://nhiro.org/tech_and_inov/page-17.png]
Adapt to changes in the environment - e.g., behavioral information collection + software updates
Excel, etc. We do not know in advance what kind of operations users will perform or where they will stumble. Therefore, we need to collect information on user operations. Based on this information, improvements are made and the software is updated.

[http://nhiro.org/tech_and_inov/page-18.png]
Adapt to changes in the environment - e.g. load balancing of web services (e.g. Amazon EC2)
 Since they do not know in advance how much access they will receive, they cannot invest in appropriate equipment. Therefore, a mechanism was introduced to observe access and increase facilities after the fact.
 Unpredictability, speed of decision making is important → Automation
 Automation has eliminated human judgment intervention! 18

[http://nhiro.org/tech_and_inov/page-19.png]
Becoming an Organism p.261-262 - Isn't this what we call "learning"? -Technology acquires intelligence, doesn't it? -Isn't technology becoming biology? Nishio: "There is a gap from 'acquisition of intelligence' to 'biology'..." "Is it 'biology' instead of 'organism'?" →Detailed discussion of biology in [Discussion 2]19

[http://nhiro.org/tech_and_inov/page-20.png]
Sources of Competitive Advantage p.265 Introduction 4 - [Competitive advantage] comes not from "the ability to accumulate resources and combine them to produce output" but from "the ability to accumulate knowledge and combine it to create new [combination strategies]. Drucker is saying the same thing.20

[http://nhiro.org/tech_and_inov/page-21.png]
Sources of Competitive Advantage
-Have processing facilities with lots of competitive advantage resources from the time of the Industrial Revolution.
-Competitive Advantage in the [knowledge economy] societyHave a lot of knowledge have the ability to combine it21

[http://nhiro.org/tech_and_inov/page-22.png]
[Organizational Learning]
- "Ability to combine knowledge" is often thought of as an individual's ability, but it is also important to enhance the organization's ability to do so.
-Learning Schools] in Management Strategies
-Human abilities are enhanced by language, artifacts, and methodology.
-For example, enhancement by [groupware](artifact)
→[Engelbert], "[Augmenting Human Intellect: A Conceptual Framework]" (1962).
→ Mintzberg, "[Strategic Safari]," 22.

[http://nhiro.org/tech_and_inov/page-23.png]
P.269Introduction 5How to deal with technology - It is important to distinguish between technology that enslaves nature and technology that is an extension of nature (Nishio)Not very important23

[http://nhiro.org/tech_and_inov/page-24.png]
What is the human will? Discussion 1 - Why do the authors ignore the "human will"? 24

[http://nhiro.org/tech_and_inov/page-25.png]
[Selfish Gene Theory].
-Why do some individuals engage in "altruistic behavior" that does not contribute to the preservation of their genes? 1970s - some altruistic behavior is not rational from the individual's point of view, but is rational from the gene's point of view - the subject is not the individual, but the gene - even if it is disadvantageous to the individual, it is advantageous to another individual with the same gene → individuals are just "vehicles" for the gene25

[http://nhiro.org/tech_and_inov/page-26.png]
[meme] 1976 "[Selfish gene]" R. Dawkins.
-Information is replicated by the human brain.
-There are efficient and inefficient replicators, the good ones spread and the bad ones are weeded out.
-In other words, information is like a gene, and like genes, it evolves through natural selection.
→The human brain is merely a "vehicle" for memes26

[http://nhiro.org/tech_and_inov/page-27.png]
[Technium]
K. Kelly 2011 -Original title "[What Technology Want]" subject is Technology
 -technium = collection of technologies
 -Comparing the evolution of life and the evolution of technium27

[http://nhiro.org/tech_and_inov/page-28.png]
-Structural necessity and historical contingency are common among the forces at work in evolution.
-The third force at work in the evolution of life is blind natural selection.
-The third force of the technium is the collective free will of society28

[http://nhiro.org/tech_and_inov/page-29.png]
-Q: Why do the authors ignore the "human will"?
 -The idea that humans, like genes and memes, are merely vehicles for technology, and that technology evolves independently of human will.
 - "Human will causes technology to evolve faster than genetic evolution," K. Kelly argues. Differentiation from this? 29

[http://nhiro.org/tech_and_inov/page-30.png]
What about the ends?
Consideration 2 - If the definition is "X is all combinations of elements + element X", X would be an infinite hierarchy. What about the ends? -first technology, first life, first economy30

[http://nhiro.org/tech_and_inov/page-31.png]
First technology - woodpecker finches using branches to take insects - bearded eagles dropping bones and turtles on stones to break them and eat them - using the phenomenon to satisfy a need - appetite - not a combination http://ja.wikipedia.org/wiki/ダーウィンフィンチ類31

[http://nhiro.org/tech_and_inov/page-32.png]
First life - Yulee-Miller's experiment Repeated discharges into primordial atmosphere accidentally produce organic compounds such as amino acids - GADV hypothesis Peptides formed by polymerization of amino acids created in the above experiment have catalytic activity → promote reactions32

[http://nhiro.org/tech_and_inov/page-33.png]
First life - a spherical object whose shape was maintained by the hydrophobic interaction of core cellate water and oil. Alexandre Oparin claimed that it may be the origin of life -...in a random combination of these various elements, something that happened to have the ability to self-replicate grew (Nishio) (cell membrane: lipid bilayer) 33

[http://nhiro.org/tech_and_inov/page-34.png]
First economy - mycorrhizal fungi (and other symbiotic relationships) absorb phosphate and nitrogen from the soil and supply them to host plants, which in turn obtain carbon compounds produced by photosynthesis - in humans: barter fish and get wild plants in return 400 million years ago34

[http://nhiro.org/tech_and_inov/page-35.png]
By chance - I happened to drop a turtle on a stone and it cracked - I happened to be able to self-replicate - The first X that happens to be born when two parties meet that happen to benefit from the exchange35

[http://nhiro.org/tech_and_inov/page-36.png]
Darwinian Evolutionary Considerations 3 -The principle of Darwinian evolution is "random -> more successes by chance" random change gene random combination individual natural selection surviving individual random change_knowledge_random combination success? Failure? Application survived Application 36

[http://nhiro.org/tech_and_inov/page-37.png]
Beyond Random
 -The mechanism of technological evolution differs from Darwin's theory of evolution (p. 258).
 -ology = methodology to create techne that is more efficient than random
Methodology_Methodology_Knowledge_Methodology_Application_Success? Failure? Surviving Applications 37

[http://nhiro.org/tech_and_inov/page-38.png]
Beyond Random -> [Engelbart]"Augmenting Human Intellect: A Conceptual Framework" (1962) - Human abilities are enhanced by language, artifacts, and methodology - Artifacts -> tools and Artifacts -> tools, instruments, processing equipment Language -> concepts, nomenclature arrangements for phenomena Methodology -> scientific methodology, experimental methods
Power. "38

[http://nhiro.org/tech_and_inov/page-39.png]
[Scientific Method] Consideration 4 - [Descartes] "[Introduction to Method]"
-Clearly evidential rule: Only what is clearly recognized as truth should be the basis for judgment.
-Elemental decomposition: Consideration by breaking down into solvable elements. -From concrete to abstract: from simple to complex.
-Integrative: reconstruct the whole by complete enumeration and reconstruction, making sure that nothing has been overlooked.
-Promote recognition of early works on scientific methodology in the order in which they were written.
→But what turns out to be clear? http://ja.wikipedia.org/wiki/科学的方法

[http://nhiro.org/tech_and_inov/page-40.png]
Descartes
-I think, therefore I am.
-Only God-given "[reason]" is right. Human cognition and [experience] cannot be trusted. Of course, experiments and observational data cannot be trusted either.
-Using his reason, he doubted everything and only "his own existence" remained -> [methodical skepticism] -> he believed in God, and the correctness of science was doubted40

[http://nhiro.org/tech_and_inov/page-41.png]
historical background
-[Copernicus] "[On the Rotation of the Celestial Bodies]," 1543, published with his death.
-1616 [Galileo] 1st Inquisition.
-1637 Descartes, "Introduction to Method."
-1669 [Newton], the study of alchemy
A time when Christianity was stronger than science41

[http://nhiro.org/tech_and_inov/page-42.png]
How the world came to be
 Christianity: The idea that an absolute order called "God" created the world.
  → 39% believe in evolution in the U.S. (2009)
  ←1859 "Origin of Species."
  -1882 [Nietzsche] "God is dead."
  → Will to Power
  p.268 "All the various movements of the twentieth century that had pure order as their basis have collapsed."
  -Greece: "The world is born and grows up" philosophy
  ← oversimplification
   ID Theory: design science education by advanced intelligence, coextensive with evolutionary theory.
   2005 Dover trial -> unconstitutional
  nature=birth, nurture
  [Idea" of an ideal world under the influence of [Plato] and [Judaism] -> reality was "made" in the image of it.
  Christianity, inherited the concept of the transcendent from Judaism, used Plato as justification in the Middle Ages.
  Descartes: Human reason is [guarded] by [divine reason] → [Kant]:[Critique of Pure Reason](1781) 42

[http://nhiro.org/tech_and_inov/page-43.png]
p. 267 - "[Pure order]" vs. "[Unshapely life force]"
-traces the struggle against Christian values in the history of philosophy43

[http://nhiro.org/tech_and_inov/page-44.png]
Consideration 5: Evolution of Technology - Why go beyond Darwinian evolution? →What is the origin of methodology? →How is the direction of selection determined? Methodology_Methodology_Knowledge_Methodology_Application Success? Failure? Surviving applications 44

[http://nhiro.org/tech_and_inov/page-45.png]
What comes out of it? Methodology_Methodology_Knowledge_Methodology_Application_Success? Failure? 45 applications that survived

[http://nhiro.org/tech_and_inov/page-46.png]
The "random" end of the methodology is also in the hierarchy
Methodology is a value-generating decision that "produces good applications" → Technology Methodology Methodology_Knowledge_Methodology Methodology Success? Failure? Survived application methodology_knowledge_methodology methodology application success? Failure? Surviving applications46

[http://nhiro.org/tech_and_inov/page-47.png]
MethodologyMethodologyWhat determines? Knowledge_Methodology_Application Success? Failure? 47 applications that survived

[http://nhiro.org/tech_and_inov/page-48.png]
Role of the Economy
Test for commercial availability
(Kelly) Collective free will of society

Methodology_Methodology_Knowledge_Methodology_Application_Success? Failure? Surviving Applications
-Acceleration by the market - Unexpected success: meeting a different need than intended
-Improvement bias of widely used
-variety of uses bias ([openness]) 48

[http://nhiro.org/tech_and_inov/page-49.png]
summary
-Not only objects, but also arrangements = concepts create value.
-Methodology allows us to search for "combinations" more efficiently than Darwinian evolution
-Methodology is also a hierarchical technology
-Market bias toward more openness → openness makes combinations of elements more complex → top-down design impossible ([biologization]) 49

[http://nhiro.org/tech_and_inov/page-50.png]
Programming Additions
-Function Definition: Name a complex series of processes so that they can be performed under that name in the future.
-="designed like words in a language" (Chapter 4)
-="Arrangements" that reduce cognitive costs
-=hierarchical components (functions can be used as components to create other functions) 50

[http://nhiro.org/tech_and_inov/page-51.png]
History of Programming Languages
-Before birth: A computer that can change its calculations by wiring it with wires.
-Wiring is troublesome → Computers that can change the calculation by writing data
-Data is difficult to understand in 01001010 -> Program to convert human-understandable alphabet to 01001010
What notation to use is "up to you.

[http://nhiro.org/tech_and_inov/page-52.png]
History of Programming Languages
-Tedious to write similar processes over and over again →Decisions to reuse program pieces
-Too much trouble to follow the rules -> add instructions to the computer to reuse the program (ret)
-Troublesome to remember the position of a program to be reused numerically →Decision to use a notation to name and call a program piece →Birth of the concept of "function "52

