The discomfort of preventing flames
 I feel [uncomfortable], but I can't [verbalize] it clearly yet.
	The beauty of Scrapbox is that you can write these things down in fragments and structure them after the fact.
 So I'll write it down.
 The trigger was a presentation given by one person, A, that made several others feel uncomfortable.
 	As to the merits of the content of this presentation, it is out of scope this time.

 My opinion on the world's reaction to this
  >I was surprised to see that many engineers (as far as I observed in the TL) seem to have suggested that companies should do more checks before announcements. The mindset of "I want to output! is really precious, so I don't want to create psychological barriers as much as possible. It's a difficult point [teppeis https://twitter.com/teppeis/status/1010005862469939200]
  I feel the same way.
  	>Really, this, do you really think a world where engineers are checked by PR and legal before they make an outward presentation is ideal? [nishio https://twitter.com/nishio/status/1010137177450139648]

	>Ummm, the only way to focus on that is to present both the material and the presentation in a way that it does not appear on the Internet.
 >It is not malicious, and a slight lack of care, which anyone would have done, is now being flamed as "You don't consider the feelings of ________! (including people who have nothing to do with XX). [methane https://twitter.com/methane/status/1010139142599000065]
		>No, no, no, that's crazy, you think that's ideal? [nishio https://twitter.com/nishio/status/1010139718820827136]
			I regret that this is a bit wordy.
   The choice to "keep one's published materials off the Internet" is not a rational one, because "keeping one's published materials off the Internet" is, in the long run, a great loss for both the individual and society, and the probability of a flame-out x the loss from the flame-out is far less. purpose
  >The "flame war" may not be ideal, but when the group lynching of a private individual causes damage to the individual and his/her company that is totally out of proportion to the severity of the crime, there is no other way to control the damage. [methane https://twitter.com/methane/status/1010140716301860864]
			I feel intensely uncomfortable when I see this.
   What exactly is "damage?" How many millions of yen did you lose? Did anyone die?
   People in the world have a very strong fear of "flames" from this area, and it seems that just the mere mention of a flameout is enough to cause a great deal of damage.
   It is the recipient that creates the damage.
   If Mr. A is fired from his employer X because of this incident, that would be a bashing of his employer.
   	Not many people think that Mr. A's conduct is a crime worth dismissing, as the expression "damage totally out of proportion to the severity of the crime" suggests.
   I don't think it's appropriate for X to even allow Mr. A to refrain from making future announcements.
   X should be more like, "We failed this time... let's not get discouraged and keep on presenting! I think it's better to have an attitude of "We failed this time....

	>That's a bit too much despair for PR and legal. If you have a professional helping you who can promptly Slack or something with appropriate and constructive comments, you should use them, and I don't want to be forced to speak to your announcement as an individual, but if you're going to put your company name out there, I'd rather have a professional to ensure that standard [https://twitter.com/yugui /status/1010159538714996736 yugui]
		This is me not saying enough, and if you are going to give a talk on behalf of your company, it is good to have a professional help you!
   Of course we do this when we sell press releases.
  My focus was on this part here, "You have no business forcing me to speak on your presentation as an individual."
  I don't have a problem if they "promptly give me appropriate and constructive comments in Slack or something" instead of forcing me to interject.
  	Having that kind of easy access to consultation is much closer to the ideal state.
  By the way, I am of the school of thought that "even if you are presenting as an individual, you may put your company name on your presentation.
  　I am aware that there are companies that do not, but I do not believe it is ideal.
   I think that the parties involved, the company and the individual, should discuss this matter and decide what to do.

To summarize a bit.
	Presentation of individual engineers
 There is no way to prevent "flames" 100% of the time with any kind of announcement.
 	It is not good for a society or organization to move in the direction of "not presenting."
 Flames don't cause much damage.
  Apparently there are different opinions out there.
  There is a lot of controversy over the fact that Mr. Aono has filed a lawsuit against the company, but it doesn't mean that the sales of the company he is the president of will decrease or that anyone will die.
  	(I dare say that I am often talked about just because I am an employee, but my wife is a conservative with my last name, so it's hard to get into the conversation.)
  I've heard a lot of comments on the Internet about the poster "[Goal: 0 hours of service overtime https://matomame.jp/user/yonepo665/b5972a27e549bfa09598]", but I just thought, "Oh, I've caused a misunderstanding. It's not like anyone died or sales decreased.
  What on earth are people afraid of?

 No measures should be taken to impose costs or delegitimize individual engineers' presentations in an attempt to prevent something that will not cause much damage.
 
