Why not just sell a reproduction license?
To promote the trend of "using Scrapbox as a medium to provide better knowledge acquisition opportunities than paper books," instead of selling the "right to read" like paper books, it would be better to sell the "right to reproduce and process on your public Scrapbox".

-----
	Selling books in Scrapbox JSON format is a bit short of something else.
 The business model where customers pay a fixed amount in advance and only those who have paid can read the book is not good.
 It's lame because it drags down the business model of paper books, which are very costly to print and deliver information to customers.
 Instead of selling the "right to read," why not charge for a different right?
 For example, the articles on my Scrapbox are free to read, but not editable
  The act of highlighting areas of interest, such as "highlighting" in a book
  Extracting = the act of extracting only the parts of the book that interest you and making separate notes.
 You can edit it by copying and pasting it into your own Scrapbox.
  But in this case, copying and pasting into a PUBLIC project is an infringement of the right to make transmittable.
 You can quote an exhibit if you clearly state the exhibit and meet the requirements for quotation, but reproducing the entire text does not meet the requirements for quotation.
 	Even a portion of a text is not a citation if it is merely copied.
 It's the "sell the right to read" business model that gets you in trouble when you're copied and pasted into a public project in the first place.
 	There is no reason why this business model should not be followed.
  	For new content, unless you are using content from a book already published under that business model.
 So how about this idea
 	Grant to Buyer X the following and more
 	Permission is granted to reproduce the entire text, provided that specific phrases are clearly indicated at the beginning.
   Example: `This text is from [Self-Management Strategies for Engineers by Yasukazu Nishio https://scrapbox.io/nishio/%E3%82%A8%E3%83%B3%E3%82%B8%E3%83%8B%E3%82%A2%E3%81%AE%E3%81%9F%E3%82%81 %E3%81%AE%E8%87%AA%E5%88%86%E7%B5%8C%E5%96%B6%E6%88%A6%E7%95%A5], reproduced in full with permission of the author. `
		Permission is granted to extract portions of the information, provided that the source is clearly indicated.
  	If you cite more of your own content, you can do it without permission, but you can do it without permission to loosen the "more of your own content" part, which means you can just extract it and not mention anything, or you can just write "this is interesting".
  	Specifically, the "source identification" is a link in Scrapbox to the "full text page" mentioned above.
   Scrapbox will then automatically create a link to each "excerpt page" from the full text page.
   It would be nice to have a UserScript that can do this easily: [extracted UserScript].
  Authors do not claim the right of identity preservation for [linking], bolding, markers, and other embellishments on Scrapbox.
  The author does not claim the right of identity preservation if it is clearly stated that the work has been modified.
  	Specifically, it is enough to create an extracted page foo that retains its identity, and then write a line `This page is modified by X based on [foo].
  In exchange for these licenses, we will take some money from BOOTH.
   As a handy infrastructure. Or by other means, of course.
  	Those who want to pay more can pay extra.
   Intervention by a third-party booth leaves evidence of "purchase" with the buyer.
   Licensing agreements can be made without the hassle of affixing a seal to the agreement.

	In the meantime, I'll publish the text I sold last time as a new Mach book, and I'll see if I can get the above permission for additional purchasers.

	Q: What about novels, essays, etc., I don't see much image of altering them.
 	I'm interested in improving intellectual productivity, so reading as a pastime unrelated to intellectual productivity is out of scope.
  There is no reason why it shouldn't be altered.
  	For example, in a novel where there are so many characters that it is confusing, it is a good idea to link the first appearance of a character to the first page of the novel so that you can easily trace back to the character when you think, "Who is this? it is easy to trace them back to their first appearance.
   I hear it's easy to get confused because of the similarities in names, like the Three Kingdoms.
   I personally don't see the need or interest.

