Employment without IP
 Consulted with employee who wants to hire, but wants the IP to belong to the employee.
 3-line summary
  Since the purpose of the employee invention provision of the Patent Law is to "allow an invention to be automatically attributed to the employer (employer, etc.) if it is stipulated in advance," it is simply necessary not to stipulate an employee invention provision (Article 35(3) of the Patent Law).
  If you are concerned about a non-exclusive license to a patent held by an employee, etc., you should "indicate your intention not to exercise" the right in an employment contract or other agreement (Article 35(1) of the Patent Law).
  Since the employee work provision of the Copyright Act stipulates that "the employer (employer, etc.) is the author unless otherwise stipulated," the employee must "declare his/her intention to be the author" (Article 15 of the Copyright Act).

Basis Article.

First, Article 35 of the Patent Law is long and is quoted in its entirety at the end of this page. Some excerpts are given below.

The basic premise is that when an employee makes an invention, the right to obtain a patent for that invention belongs to the individual employee. Article 35 of the Patent Law allows the "right to obtain a patent" to be vested in the employer in limited cases as soon as it arises. Many people misunderstand this basic premise and its opposite, but be careful, because if you misunderstand it, you will not be able to understand the meaning of the article.

Article 35(1) of the Patent Act
>Employers, corporations, national or local governments (hereinafter referred to as "employers, etc.")  (2) When an employee, officer of a juridical person, national public officer or local public officer (hereinafter referred to as "Employee, etc.") has received a patent for an invention that by its nature falls within the scope of work of the said Employee, etc. and the act that led to the invention belongs to the present or past duties of the Employee, etc. (hereinafter referred to as "Employee Invention") (2) When an employee, etc. of an employer, etc. has obtained a patent for an invention (hereinafter referred to as an "employee invention"), or when a person who has succeeded to the right to obtain a patent for an employee invention has obtained a patent for such invention, he/she shall have a non-exclusive license to such patent right.
The legal requirement of this article includes "when an employee, etc. is granted a patent for an employee invention," and the legal effect is "the employer, etc. has a non-exclusive license to the patent right," so even if an employee is granted a patent for an employee invention, the employer has the right to use it (non-exclusive license). However, since it is not an exclusive license, the employer does not have the right to injunction, etc. against others or other legal entities.

Article 35(3) of the Patent Act
> 3 With respect to an employee invention made by an employee, etc., if it is stipulated in a contract, service rules or other provisions that the employer, etc. is to acquire the right to obtain a patent in advance, the right to obtain a patent shall vest in said employer, etc. from the time when the invention occurred.
The legal requirement of this article includes "it is stipulated in the contract, service regulations, or other provisions that the right to obtain a patent shall be vested in the employer, etc. in advance," and its legal effect is "the right to obtain such patent shall vest in said employer, etc. from the time it accrues," so if the contract or service regulations do not stipulate in advance Therefore, the right to obtain a patent vests in the employee if it is not stipulated in advance in a contract or employment regulations.
Many companies dislike this and create "employee invention provisions" in their work rules.

In other words, an employer who does not wish to own intellectual property should first make sure that the "right to obtain a patent" remains with the employee as a general rule by not doing the "stipulation" in Paragraph 3. If there is also a problem with having a non-exclusive license, the employer should indicate in the employment contract that the non-exercise of the non-exclusive license will not be exercised.

The tricky part is the employee's work. Citing Article 15 of the Copyright Act.
> (Authors of works created in the course of their duties)
> Article 15 Any work (excluding program works) created in the course of employment by a juridical person or other user (hereinafter in this Article referred to as "juridical person, etc.")  (2) The author of a work (excluding program works) prepared by a juridical person or other employer (hereinafter referred to as "juridical person, etc." in this Article) in the course of its duties and published under its own name shall be the juridical person, etc. unless otherwise provided by contract, service rules or other regulations at the time of preparation.
> 2 The author of a work of a program prepared by a person engaged in the business of a juridical person, etc. in the course of his/her duties based on the initiative of such juridical person, etc. shall be such juridical person, etc. unless otherwise provided for in a contract, service rules or other regulations at the time of preparation of such work.

The author is a legal entity, etc., unless otherwise specified. Therefore, as a "separate stipulation," it is sufficient to indicate in the employment contract, etc., that "the author of a work created in the course of employment is the individual employee.


Note that we say "you only need to express your intention" here based on Article 91 of the Civil Code.
> (Declaration of intent different from voluntary provisions)
> Article 91 When a party to a legal act has indicated an intention that differs from the provisions in laws and regulations that are not related to public order, that intention shall be followed.


appendix
Patent Law, Article 35.
> (Employee Inventions)
> Article 35 An employer, juridical person, national or local government (hereinafter referred to as "employer, etc.") Article 35 When an employee, officer of a juridical person, national public officer or local public officer (hereinafter referred to as "Employee, etc.") (2) When an employee, officer of a juridical person, national public officer or local public officer (hereinafter referred to as "Employee, etc.") has received a patent for an invention that by its nature falls within the scope of work of the said Employee, etc. and the act that led to the invention belongs to the present or past duties of the Employee, etc. (hereinafter referred to as "Employee Invention") (2) When an employee, etc. of an employer, etc. has obtained a patent for an invention (hereinafter referred to as an "employee invention"), or when a person who has succeeded to the right to obtain a patent for an employee invention has obtained a patent for that invention, he/she shall have a non-exclusive license to that patent right.
> 2 With respect to an invention made by an employee, etc., except in cases where the invention is an employee invention, any provision of a contract, service rule or other stipulation which provides in advance that the employer, etc. shall acquire the right to obtain a patent, that the employer, etc. shall succeed to the patent right, or that a provisional exclusive license or exclusive license shall be established for the employer, etc. shall be void. 
> 3 With respect to an employee invention made by an employee, etc., if it is stipulated in a contract, service rules or other provisions that the employer, etc. is to acquire the right to obtain a patent in advance, the right to obtain a patent shall vest in said employer, etc. from the time when the invention occurred.
> 4 In the event that an employee, etc. has caused an employer, etc. to acquire a right to obtain a patent for an employee invention, has caused an employer, etc. to succeed to the patent right, or has created an exclusive license for the employer, etc., or has created a provisional exclusive license for the employer, etc. for an employee invention by contract, service rules, or other stipulations, or has created a provisional exclusive license for the employer, etc. for an employee invention by contract, service rules, or other stipulations, the employee, etc. may, in accordance with the provisions of the preceding paragraph, obtain an exclusive license for the employee invention. (2) Where an exclusive license has been established for the employer, etc., and an exclusive license is deemed to have been established under Article 34-2(2), the employer, etc. shall be entitled to receive a reasonable amount of money or other economic benefit (referred to as "reasonable benefit" in the following paragraph and paragraph (7)). (2) A licensee shall be entitled to receive a reasonable amount of money or other economic benefit (referred to as "reasonable benefit" in the following paragraph and paragraph 7).
> 5 In cases where reasonable benefits are stipulated in a contract, service rules, or other stipulations, it shall not be deemed unreasonable to provide reasonable benefits in accordance with the stipulations, taking into consideration the status of consultations between the employer, etc. and employees, etc. in formulating the standards for determining the content of reasonable benefits, the status of disclosure of such standards that have been formulated, the status of hearing opinions from employees, etc. on the determination of the content of reasonable benefits, etc., and other factors. (2) The standards shall not be such that it would be unreasonable to provide reasonable benefits in accordance with the standards, taking into consideration the status of discussions between the employer, etc. and the employees, etc. in establishing the standards for determining the content of reasonable benefits, the status of disclosure of the standards as established, and the status of hearing from the employees, etc. on the determination of the content of reasonable benefits.
> 6 In order to encourage inventions, the Minister of Economy, Trade and Industry shall, after hearing the opinions of the Industrial Structure Council, formulate and publicize guidelines concerning matters such as circumstances to be considered pursuant to the preceding paragraph.
> 7 In cases where there is no provision for reasonable profits or where it would be unreasonable under the provisions of paragraph (5) to grant reasonable profits in accordance with such provision, the content of the reasonable profits to be received under paragraph (4) shall be determined by taking into consideration the amount of profits to be received by the employer, etc. from the invention, the burden to be borne by the employer, etc. in connection with the invention, contributions to be made by the employer, etc., and the treatment of the employee, etc. 
