Fallout Shelter
[Management game]. Manage an underground shelter in a nuclear-contaminated world.
Major resources are humans, electricity, water, food, medicine1, medicine2, money
Money is used to build production facilities and assign humans as workers to these facilities to produce electricity, water, food, and other resources.
If there is a shortage of electricity, production facilities will be shut down.
HP decreases when food is in short supply.
Lack of water decreases MAX HP.
Medicine 1 restores HP, and Medicine 2 restores MAX HP.

From time to time, external enemies attack.
When HP reaches zero, humans die and can either be discarded as garbage or regenerated using money.
Happiness decreases when corpses are left unattended. The average happiness of the entire shelter contributes as a bonus of up to 10% to the productive capacity. Happiness is not so heavily weighted that it can be ignored

Each person has seven parameters (strength, endurance...etc.) that determine the production capacity of each production facility. These parameters are used for various things, such as when fighting external enemies.
Parameters are enhanced by spending money to build facilities that train that parameter (e.g., a school to train intelligence) and assigning people to them (= consuming time without letting them work in other production facilities).
Parameters can also be enhanced by equipment.

Production in this game is threefold
	Work normally in production facilities
 Emergency production in production facilities.
 Go exploring outside the shelter

Increasing the number of people placed in production facilities and raising the status of those people will increase the speed of production. However, since the system is designed so that production is collected when a human taps on it after it is completed, it does not increase production in situations where a human does not check and tap on it frequently. For example, whether one person is assigned to a production facility before going to bed or six people are assigned, the facility will be completed by the time they wake up the next morning and the amount collected the next morning will be the same; assigning six people will only increase the number of people who complete production early and do nothing until they are collected afterwards.

Since there is an upper limit to the amount of resources that can be stored, there is no point in continuing to produce more than is needed, as it will overflow and be disposed of.

Emergency production is judged on the parameter of luck, and if successful, resources are obtained immediately. However, if it fails, an external enemy will appear.

Going out of the shelter to explore is a way to recover money and other meager resources. We need to have resources to make good equipment.

