人生100年時代の社会保障とPoliTech
【[落合 陽一]・[小泉 進次郎] 共同企画】[平成最後の夏期講習](社会科編) - 人生100年時代の[社会保障]と[PoliTech]
[https://gyazo.com/05f2a9b59ba2b322fca2d1929650d76e]
 [Nico Nico Live Broadcast http://live.nicovideo.jp/gate/lv314526819] Also see a detailed description of the event here.
 [Official Facebook https://www.facebook.com/heiseisummerclass/] For resources and more https://drive.google.com/drive/mobile/folders/163nvjFNiXsYy04 dsJeQkMIBv2WoBl4Ah
 [YouTube https://www.youtube.com/watch?feature=youtu.be&v=fV37SGxMqZs&app=desktop]

2018-08-01
	I participated. It was interesting.

	My notes (mainly Table A, [last summer session Table E]):
 	Table banter before the start of the event
  	40% with sports and walking included.
    I'm not.
   I want the school and the park to be open.
   	No place to play sports while collecting dues.
   	The Ministry of Education is telling us to open our schools, but the principals are saying, "Who's going to be responsible for this?"
  Plenary presentation begins
  PoliTech → Generate Action Plan
  	Technology Boot Camp: Can Do, Can Understand, Can Manage
  	I want to create an open place to absorb excuses.
   	Breaking down the state of not taking action by making excuses such as "it's technically difficult" or "it's difficult due to legal restrictions.
  Mr. Tam Kai Minutes -> Graphic Recording
  	I want to tell the world about GRARECO.
   Ochiai: "Let's write something that isn't a bureaucratic mandala, break away from the PowerPoint culture," "Draw and tell," "No one will read it if you leave it in writing."
		table banter
   There are "sports" that are "top sports" and those that are not. Attention tends to focus on the top sports.
   Happiness was high in 1996.
    Happiness x Satisfaction = Well-being
    Happiness precedes the economy.
   Fujitsu is amazing for hiring graphic recorders.
  If you don't have input, you won't get anything out. 5 minutes x 5
  	Followed by 30 minutes of case discussion
  Table A is all about life.
  Mr. Ataka.
   [I want a society that can spend on the future - Being between Neuroscience and Marketing http://d.hatena.ne.jp/kaz_ataka/20180526/1527308271]
  	Germany will overtake us soon.
   We're losing all of them.
   農林水産は40倍以上の生産性の差
			I'm not stretching my resources.
   	最低賃金G7中最低
    R&D 4～5倍の差
    大学費用3倍
   Only major country with high PhD costs (not free?)
   　As a result, the number of PhDs is down and soon to be overtaken by South Korea.
   Why? Country P/L fresh water is only 27%.
   3/4 is Social Security, then remaining debt = repayment of past Social Security payments
   We spend most of our money on the past and seniors and have no money available for the future.
   Budget size is second only to that of the U.S. and China, but the bulk of the budget is for social security.
  	Seven years from now, government bonds will amount to 65 trillion yen, can they be sold out?
   We have to figure out how to rebalance.
   Population has doubled since the war.
   Basic local governments Some localities are finally getting around with public spending on par with BI
   1: Investing in seniors and the past to invest in the future
   2: How technology can solve the problem of heavy infrastructure burden
  Mr. Oishi.
  	Elderly people Money Is it being used effectively?
    1 trillion annually, an increase of 9%.
   75 years old and over Accelerated care needs
   1/3 of all health care costs are spent by the over 75s, 13% of the total.
   Dementia, Japan has many.
   　15% spend time in the hospital
   Hospitalization is 3 times the cost of home; hospitalization itself is a health risk
   Prevention and care as well as treatment
   	Nutrition: Meat & Vegetables
    社会参加
    	Purposeful living slows decline in life skills even as dementia progresses
   In the UK, they give out iPads to people with dementia, and they teach
   2025 +550,000 people in need of nursing care +30% manpower
				Overseas, one person watches over 50 elderly people using sensors; Japan 10-20 people; 3x difference in productivity.
  	元気な高齢者、自立支援、社会参加
  Mr. Ochiai.
  　How to get the data
   How to display
   How to manage "AI tied to individuals
   What model is appropriate?
   Rare Case Study
  	Customization for each individual
   Communities of Practice
   Individual -> Mass -> Individual
  Mr. Ishikawa.
  	Social Security Origins
   MacArthur, 6 men Sams, Article 25, Section 2 of the Constitution, the state does social security.
   Halaheli → School Lunch
   Japan → Adult
   U.S. to European allies.
   Shichinosuke Asano, Japanese immigrant to the U.S. [Lara supplies - Wikipedia https://ja.wikipedia.org/wiki/%E3%83%A9%E3%83%A9%E7%89%A9%E8%B3%87]
   全国的保健制度
   GHQ's watchword was "Hurry up with the revolution, go slow and you'll stumble."
    [In just six years, the life expectancy of the Japanese people increased by 25 years--a feat of human history at GHQ that we do not know about (Yoshiki Ishikawa, "Preventive Medicine as an Idea," Vol. 4) | PLANETS / Second Planetary Development Committee http://wakusei2nd.com/ series/%E3%82%8F%E3%81%9A%E3%81%8B%EF%BC%96%E5%B9%B4%E3%81%A7%E6%97%A5%E6%9C%AC%E4%BA%BA%E3%81%AE%E5%AF%BF%E5%91%BD%E3%81%AF25%E5 B9%B4%E4%BC%B8%E3%81%B3%E3%81%9F%E2%80%95%E2%80%95%E7%A7%81%E3%81%9F%E3%81%A1/]
   Democratic principles, individuals are valuable -> test of time
  Mr. Muto.
   http://withals.com/category/?id=12
   Designing the use of technology
  Continued discussion at the table
  Sports and exercise should be separated.
  Exercise is measured by the rate of exercise implementation, exercise for health
  Sports is a connection-making activity
  	member of society
   認知症
   Need a hangout = solution to loneliness
   公園の行政
    In Japan, the main people in park administration are plant specialists and others; in the UK, in addition, there are sports specialists.
   公衆衛生の向上
   	In Europe, parks are part of public health
    Open to the public what the royal family had, use of PUBLIC SPACE
   Bon Festival dance
  事故の問題
  	Japan fears the risks and falls on the side of the ban.
   Lawsuit alleges injuries caused by park playground equipment
  Finland
  	If you don't shovel snow in front of your house and your neighbor is injured, the neighbor sues you.
  病院
  	It functions as a hangout for the elderly.
   But you can only see sick people, you can't see sports, you can't do preventive medicine.
   院内保育園
  Vibrant Hospital, not a hospital
  I don't like exercise in the first place.
  	Do we need to exercise for health in the first place?
   What if technological advances make it unnecessary?
   ←→ Exercise as a sport
  Is exercise necessary?
   Physical activity has decreased in human history and may be maladaptive.
  More people involved = community
  Minor reasons for fencing
  	The rules are complicated.
   I can't see his face.
   Is it better to change to competitions like gateball or inline skating?
   Swinging for Entertainment to Survive
  One parameter that contributes significantly to happiness in the data is "having someone to turn to in times of need.
  	Loose connections
  More and more people are living alone.
  	lonely time
   SNS
  Space saving and shortening of sports
  	Difficult to get 11 people together.
   Running, on the other hand, is solitary.
   eSports
   	Matching system that allows you to "do it together" even if you are not physically in the same place.
    The same goes for running.
    Zwift achieves that with an aerobike.
  A dormitory would be a good idea.
			It is useful to have a matronly person
   They'll cook you a meal.
   	Let's all get together for dinner, sort of.
   The concept of "coming back"
   	I have a place I can go home to."
    They leave the nest and come back every once in a while.
    From a cultural club perspective, "coming back to the clubroom" feels right.
    Maybe there should be a "theme" just like club activities.
    The dorms are determined by your interests, and all the boarders are interested in that.
    Dorms of Likes."
    	I like PCs, I can go to the PC dorm.
  The gym is 97% full and can't be rented at all.
  	mothers' volleyball
  西日本 避難所的位置づけ
  Need a "matching" service that is neither man/woman dating nor marriage.
  	There used to be "billboards" at stations, the age of smartphones.
   I'm sure we can match as well as post.
   	Nothing difficult because the technology is already there, and dating agencies are taking advantage of it.
   Private operators will not enter where there is no money to be made, so the national and local governments have to do it.
  You don't have to solve everything with Tech, hiring the elderly, caring grandmothers.
  All tables announced
  Tech Normal" is the key.
  	Nico Ochiai bites on Nico's comment.
   Completely agree. The mental model that if a great magical technology is introduced, the problem will be solved. x
   Challenges in technology application arise at the boundary when technology is "introduced into an existing system currently in operation without that technology".
   It is called "social implementation. The process of aligning technological elements with existing systems.
   The "poof great technology" has high boundary matching costs.
   Technology that may not look like much, but is already being used in other fields, is an example of successful integration with existing systems, so that value can be created efficiently through horizontal movement.
 	E: Outreach
  	Go to those in need.
   Difficulty in sharing information because it contains sensitive information → solved by information system
   Community
   Create participatory infrastructure
   	The municipality can also give you a list if you sign a contract, there is a precedent, they just assume you can't give it to them.
    If we can create a template and make applications and contracts easily available online, it will not increase the burden on local governments.
    All you need is a match.
  B: Educational Communication
  	I wasn't taught social security.
   	Silver Democracy gets worse.
    Teachers are media
				Sustainability, not ethics
   Schools are bad parent cancellation devices.
   Education to create five Zhuge Liangs instead of 10,000 so-so soldiers
   Don't let people convince you that pretending to be obtuse is "growing up."
   Open Teachers
   Draft "teachers," not conscripts.
   In the future, AI will teach
   Teaching the cruel truths of the world so that you can make your own autonomous choices.
    It's not the teachers today who can teach that.
   教師全滅論
   	What happens to teachers now?
    Tutors are needed Community building
    	That's exactly the kind of thing we can't leave to today's teachers.
		F: How to work
  	Not aware of fixed values.
   Challenge / Diversity
   Issues that we want Tech to solve are not coming from the field.
   Let's go visit the hospital.
   	Eye Center Vision Park
    Prescribe sports
    We created a place."
   安全な危険
   	A safe environment is not the only way to get out into the dangerous outside world.
    Safe Danger" is necessary to develop the ability to live in the dangerous outside world.
   	Controlled, "risky" with guaranteed recovery in case of failure.
   Kansai people proceed through the gaps in the rules.
  	Not "accept."
   They don't teach you how to work, do they?"
  	Graphic recorder is a meta-layer
  D: 財政
  	Still working at 99 years old
   Even if you predict disease, we all die anyway.
   I wonder if living a long, healthy life will help curb health care costs.
  Communicate correctly - Communicate with Nico Nico Live
  	The Power of Technology
  再生医療の法律は最先端
  	eye center
   Changing the rules.
		Q: (To Mr. Yamauchi) How are you able to move so much? A: I liked programming, I don't mind doing what I like all the time.
  　I think this was received in a "like makes like" kind of way, but I interpreted it differently.
   In programming, if you want to realize "what you want to realize," you have no choice but to make progress by repeatedly creating, running, observing the behavior, and correcting it, where no matter what books you read, the correct answer is not written.
   As is essentially the case with all manufacturing, programming allows for a very fast trial-and-error cycle by eliminating the need for raw material costs and processing machinery.
   Mr. Yamauchi is using this "naturalness" of software implementation by horizontally transferring it to social implementation as well. Since he is just doing what is "natural" to him, asking "Why?" does not bring back the answer that the questioner expects.

The resulting graphic recording
 [https://gyazo.com/d1aa9baaba4c7c72697a00e2c2bb208f]

終了後の感想
 Graphic recording, by abandoning the preconceived notion that "minutes are [one-dimensional] and taken along a time axis," and by allowing free placement, it is now possible to "put things that seem relevant close together. It is interesting to visualize the network of interrelationships between what was said, rather than the flow of what was said.
 I was thinking about the difference between graphic recording and bureaucratic mandala slides, but maybe bureaucrats have a hard time doing the "keep what you subjectively think is important and discard the branches and leaves" that is necessary to create a simple design. The good argument, "You can't just throw things away subjectively," is likely to win out. The GRARECO does the difficult thing of drawing a picture in real time, which creates a consensus that "it can't be helped if it doesn't have everything written down.
 Where should someone interested in learning graphic recording start? If left alone, it may be seen as a cloud, like "a skill that only skilled craftsmen can do," but I feel the world would be better off if we had a ladder leading up to the cloud.
		[Graphic Recording]
	The clarity of the specific action plan for the E team is amazing!
 	Maybe it's because Mr. Kuikei of the MIZUSHIDAN is in the business of putting muddled discussions into action plans, or maybe it's because w
			He was depressed that Marcom might get mad at him later for mentioning the name of his day job company, so I erased it.

 [https://www.facebook.com/tamkai88/posts/10209563986615791] [Tamura Kai]
[https://gyazo.com/2e6451f9c6a87a39bd2afc4d76288c75]
	[Seki's feedback: https://www.facebook.com/halsk/posts/10156702928784040]

	[Hiroyuki Takao's feedback: https://www.facebook.com/hi.takao/posts/1819716118097733]
---
2018-07-31
 I'm not required to do any prep work, but I've taken the opportunity to prep and put it together.
  [PDF(Dropbox) https://www.dropbox.com/s/8hqten80wlctxbu/%E5%B9%B3%E6%88%90%E6%9C%80%E5%BE%8C%E3%81%AE%E5%A4%8F%E6%9C%9F%E8%AC%9B%E7%BF%92.pdf?dl=0]
---
2018-07-24
	Performances.

	The concept of PoliTech is interesting.
 	Technology makes politics more efficient.
  This attempt would be the equivalent of a "council of experts" in the old concept.
 		The old expert meetings were never televised.
   This was because there was no other way to broadcast video than through a limited number of TV stations using the airwaves.
			Technological advances have drastically reduced the cost of relaying video.
   This change in cost structure has made new measures feasible.

>Objective: To realize "understand, doable, and manageable social issues.
>To promote the resolution of social issues by creating a situation where each individual can take positive action toward society in order to move forward to the next era, by recognizing the challenges Japan faces in the Heisei era and having faith in technology.
 Trust in technology" good word.
