Intellectual Production
I thought about what kind of title I would give to a compilation of what I had learned and thought about after reading various books, and came up with the title "[Engineers' Intellectual Production Techniques]," but when I thought about it, I realized that I had never done a survey of intellectual production techniques.
So I'll list the ones that caught my eye when I searched for "intellectual production techniques".


[https://gyazo.com/514b849bff3a41741798f7276913a4a8]
 EVERNOTE "Super" Intellectual Production
 2011/2/26
 [Tadanori Kurashita]
 [Amazon https://amzn.to/2uZ0uwy]
	>Modern businesspersons are constantly required to output some kind of information, whether it is "new projects and ideas for work" or "information on a blog for personal branding". Business people are expected to be efficient in these tasks and to produce high quality output in as little time as possible.
 > Evernote is a "database of knowledge" and a "second brain" that can streamline your intellectual production. It will also enable you to draw out new ideas and inspiration that did not occur to you before!
	Efficiency in generating output
 Although you have chosen Evernote as the service to use, it appears that you are essentially focused on "extracting ideas from large amounts of data".
 Oh, he's the author of "[Scrapbox Information Organization]," which I saw recently and thought sounded interesting.
  [I wrote a book about Scrapbox with Scrapbox | Sigotano! https://cyblog.jp/33884]

[Self-Taught Techniques to Enhance Intellectual Combat].

 Cloud Intellectual Production for Science - From Mail Processing to Paper Writing
  2012/1/20
  [Masatake Hori]
  Author of books such as "The Life Hack Compendium."
  	https://www.amazon.co.jp/堀-正岳/e/B004LWC04M/ref=dp_byline_cont_book_1
		I googled it and found that he tweeted about Scrapbox 3 hours ago. w
  >I use Scrapbox as an "external editing device" for storing my memories.
   https://twitter.com/mehori/status/1023139234109054976

[https://gyazo.com/3bdf25cd8a625d940156093815839355]
 New Intellectual Production Techniques that Increase Efficiency 10 Times - How to Google Yourself
 2007/12/14
 [Kazuyo Katsuma]


 No Need for a Notebook: Information Organization in the Age of Social Networking
 [Fumi Koda]
 [Amazon https://amzn.to/2mQepRq]
 The book seems to be an easy-to-understand explanation for people with low IT literacy.

[Feldman Method of Intellectual Production]

 The Power to Make the Most of Information" (Ikegami Akira/author)

[https://gyazo.com/3b8fd75a9b85089aa93fb8b3555bd38d]
[Amazon https://amzn.to/2LSRhR0]

I forgot to mention from within the books.
[https://gyazo.com/d2e603659ef1b96450020d657b616ecf]
[Amazon https://amzn.to/2AJW3uR]
