Writing in Scrapbox
 [I wrote a book about Scrapbox with Scrapbox | Sigotano! https://cyblog.jp/33884]
 It's interesting to see so many different people taking on the challenge of "writing a book in [Scrapbox]."
 By the way, "[The Engineer's Art of Intellectual Production],
  1: [Sticky note] with [written method].
  2: Create a draft table of contents using the [KJ method
  3: Writing & Reviewing in Scrapbox
  4: Converted to [Markdown] for editorial convenience
  5: Discuss & revise in Gitlab issues with editors
  6: Proofread PDF with [iPad Pro] and [Apple Pencil
 That was the trend.

If it's a question of "can I do it or not," well, I guess I can, but if it's a question of "am I suited for it or not," I don't think I'm suited for it.
The reason why I think so is as [Tadanori Kurashita] has already written on the above page:
>The biggest problem is that Scrapbox is not a tool for creating hierarchical structures. However, books are a crunchy hierarchical structure.
Scrapbox does not support the creation of [hierarchical structures], nor is it suited to expressing hierarchical structures.

If you are somewhat familiar with writing and Scrapbox, you may be able to force your way through by creating UserScript, but for those who are not familiar with writing a book for the first time, I do not recommend using tools and methodologies that help you create a hierarchical structure. In my case, it was the KJ method. In my case, it was the KJ method. [I wrote about it in detail in the article "Intellectual Production Techniques for Engineers" (in Japanese).

By the way, as to whether Scrapbox should move in the direction of supporting hierarchical structures, I think no.
The hierarchical structure is a limitation of the legacy format of books in the first place, and considering the value that a "book" as a means of knowledge transfer provides to clients, the future of books will be like a Scrapbox-like network of knowledge links with meta-information provided by the writing team, and presented in the appropriate order by client software that understands the reader's level of knowledge. The right direction is for the book to be provided by the writing team and presented to the reader in the appropriate order by client software that understands the reader's level of knowledge.

It's only been 17 years since Wikipedia was created in 2001, and although there has been a Wikibooks-like approach, it is still in a transitional phase, and e-books are still largely dragging down the paper book format. The technology to install knowledge in humans will eventually replace the paper book format with something more digital and efficient, and Scrapbox is a tool that is taking a step in that direction, so I think we can ignore [legacy formats].
