linking
For lack of a better word to describe my activities on Scrapbox, I have been using the word "linking," but after thinking about it, I have never explained it, so I would like to take this opportunity to explain it.

Linking: "parts of the text that *may* someday be connected to another concept" should be enclosed in `[ ]` and made into links.

There are a number of schools of thought on how to organize information. To put it briefly, the following four methods are mentioned here: A: create a folder and put the information in it, B: arrange the information chronologically, C: tag the information, and D: follow the links.

Style A has the problem that humans cannot find the "appropriate folder". If a folder called "Animals and Plants" were created and classified, it would be difficult to immediately answer which folder [Green Beetle] should be placed in. This is how "information in the appropriate folder" occurs, and you have to search around for the desired item because you can't find it, especially when there are multiple levels of hierarchy.

Disliking this, a method was born that dares to choose not to categorize hierarchically. These include the "super-organizing technique" of the "one pocket principle," in which documents are kept in one place, and the "one notebook" method, which avoids top-down division into multiple notebooks. In particular, advances in electronic devices have created a new style in which notebooks can be arranged in chronological order so that recently used items can be easily found, and old items can be searched for.

Tagging was created to aid in search. For example, at present, science and technology do not allow us to search for images using "images in the human brain" as queries, so if we want to search for images later, we must add words (tags) that will serve as a starting point for the search. With the spread of smartphones, the cost of "taking a picture and uploading it to a cloud service" has dropped so much that a style of photographing paper documents, etc., uploading them, and tagging them as necessary has emerged. One famous example is [Evernote].

Although it is obvious, humans cannot immediately answer the appropriate tag, just as humans cannot immediately answer the appropriate folder. Therefore, the phenomenon of "no appropriate tag" or "wrong tag" inevitably occurs.

Scrapbox links can also be used as tags, and Scrapbox itself uses a different notation for the same function: `[link]` and `#tag`. This `link' is a culture from the Wiki, and the link is to another page. This is where tags and links differ: a worldview where there are two kinds of things: `content (text, images, PDFs, etc.)' and `tags assigned to it', and only one kind of thing: `everything is a page' and `the body of the page has links to other pages'.

In Scrapbox, if you link to X from page A, and then link to X from page C, both pages will appear as two hops away from each other. The idea behind Scrapbox is that it is impossible to "tag pages appropriately in advance so that they can be found in a search in the future," but instead, by linking pages together, after you find one of them in a search, you can follow the links to get to the one you want.
 [/shokai/finalyfound#5a8ab92597c2910000e9df72]
 [Imojiru search]

So my feeling is that linkage is a process of "connecting information to information". It is not only linking to existing "pages that we know exist," but also to pages that may be created in the future. I imagine that I am only creating entrances to pages that have not yet been written. This way, when the page is created in the future, it will be automatically connected, and when you try to enter a similar link on another page, it will be suggested to you. I feel this would really accelerate the [knowledge connection].

I feel uncomfortable with "link" as a verb. It feels like the act of connecting to a page that already exists. I see "link" as a noun for the entrance to a path to another page, and say "link it" with the nuance of "leave the entrance open.

Dr. Shiozawa describes tagging on Scrapbox as "tagging," but I don't use it because I consider tags and links as different concepts as mentioned above, and another reason is that I don't like homonyms because they are troublesome when speech is input.
[/shiology/05133-180516 The essence of "tagging" Scrapbox to "hand carry"]

After writing this much, I searched this Scrapbox for "linkage" and found 8 hits.
[https://gyazo.com/9168ef153f73c787cd61f0666215ba83]
