The Intellectual Production of Engineers Errata
[*** notation].
 code:diff:p.XX(page number) l.YY(line number)
  - Text before correction
  + Revised text

[*** Errata for 5th printing].
 [Improvement for English version (chapters 6 and 7)].
	→(The differences will be organized in [Corrections for the 5th printing] at the timing of the 5th edition of the Japanese edition.

[*** Errata for 4th printing].
	[Improvement for English version (~1 chapter)
	[Improvement for English version (chapters 2 and 3)].
	[Improvement for English version (chapters 4 and 5)].
	→The differences were organized in [Corrections for the 4th printing] at the timing of the 4th edition of the Japanese edition.

[*** Errata for 3rd printing].
P.70
>- This timebox approach to personal task management was applied to the Pomodoro technique introduced by Staf fan Nöteberg in his book "Agile Time Management Techniques.
>+The Pomodoro Technique, proposed by Francesco Cirillo and introduced by Staffan Nöteberg in his book "Agile Time Management," is an application of this timebox concept to personal task management.

Corrected because "introduction" is misleading as "first made."

P.82
>- When a postsynaptic cell fires, the number of receptors on the surface of the postsynaptic cell increases. This means that fewer subsequent stimuli will cause the postsynaptic cell to fire.
>+ When a postsynaptic cell fires, the number of receptors on the surface of the postsynaptic cell increases. That is, fewer stimuli than it [* before] will cause the postsynaptic cell to fire.

P.119
>- Write down what you learn in a notebook. At this time, he recommends using mind mapping, which was proposed by Tony Buzan, an educational consultant. I won't go into the details of mind mapping here, but the idea is not to make a tight, precise notebook, but rather to write down words as they come to mind in a tree-like format.
>+ Write what you learn in a notebook. He recommends using a mind map, as suggested by educational consultant Tony Buzan. This is not a tightly packed notebook, but a tree of words that come to mind. By writing down key words, it helps you remember them later.

I thought [explaining the intent explicitly] would be better.

P.192
>- From the perspective of whether or not it involves physical sensation, it is quite often an abstract concept.
>+ From the perspective of whether or not it involves physical sensation, it is quite often an abstract concept.

P.152
>-This size of fusen, when placed side by side on A4 paper, can hold 25 sheets.
>+This size of fusen, when placed side by side on A4 paper, can hold 25 sheets horizontally or 28 sheets vertically.

When I was writing this book, I used A4 paper horizontally, but then I tried using it vertically and realized that I could put more on it that way, so I started using it vertically.

[Revised diff for 4th printing].

[*** Errata for 2nd printing].

P. 187
>Jiro Kawakita divided this into two categories: internal and external exploration.
	I should have indicated "[Explorations in Knowledge]" as the source for this.
 proposed amendment
	code:diff:
		-Jiro Kawakita divided this into two categories: internal exploration and external exploration. External exploration is information gathering by asking others or reading books.
 	+Jiro Kawakita, in his book "Exploratory Studies of 'Knowledge'," divided the exploration into two categories: internal exploration, which is the gathering of information from oneself, and external exploration, which is the gathering of information from others and books.
	Related: [internal and external expeditions].

[*** Errata for 1st printing].

[* Electronic p. 17 note 17].
	code:diff:P.17 Note 17
  -   https://ronjefries.com/xprog/articles/practices/pracnotneed/
  +   https://ronjeffries.com/xprog/articles/practices/pracnotneed/
 The URL is correct in print, but one f in the URL is missing only in the link to the electronic version.
 The correct URL is https://ronjeffries.com/xprog/articles/practices/pracnotneed/

[* P.26 Note 25].
code:diff:
 - I've been promoting recording anything I don't understand.
 + I encourage you to keep track of anything you don't understand, and

[* P.63-64]
	The figure (2) is drawn in the area of urgent but not important, although it is described as "Important but not urgent (2)" from p. 63 to 64.
 This is because the diagram is incorrect. If the current paper is to be consistent, it would be better to replace (2) and (3) in the figure. I would like to correct the axes in the figure in the next revision.
  [https://gyazo.com/41dd275da8255748963549ee45544c19][https://gyazo.com/e2b975126afb780bc4f3d1d5b4e2cc24]
  Left: Figure from this document Right: Original figure ([Urgent/Important Matrix])
  proposed amendment
   [https://gyazo.com/4e6656721626a749af9717f7ab40a933]


[* P.106]
 There is a balloon in the figure that says "this is the bottleneck", but there is no need for this to be attached here.
 This is probably because the callout that was attached to the figure on p. 112 was accidentally attached to this one as well.

[* P.128]
 There is a gap between the boxes before and after the required level increase, but the gap does not widen with the passage of time, so it should be unified with a gap both before and after.

[* P.136]
 Would it be helpful to add a reference to the column on p. 167, either in the text or in a footnote at the end of the section on "Making the Combination"?
 	→I would like to add footnotes to the main text, but the number of characters both before and after the footnote is too tight.
  So modify as follows to create a gap
  	code:diff:P.135-136
    -The same is true of words. In the same way, words may create a kind of afterimage in the mind, and the next word may arrive before the afterimage disappears, thus being understood as a single sentence. If this is the case, he pointed out, then the input of other sentences while the memory (afterimage) of the previous sentence is still present will promote comprehension of the sentence. This is similar to my own feeling. He called this kind of afterimage created by the text "rhetorical afterimage.
    +The same is true of words. He pointed out that words, in the same way, create afterimages in the mind, and that if the next word comes before the afterimage disappears, it will be understood as a single sentence, and if read too slowly, understanding may be hindered. He called this afterimage created by words "rhetorical afterimage. Reading another book before the afterimages disappear encourages the reader to discover connections between the books.
    
    - Binding is not something that happens only with more than one book. Let's say, for example, that you now have a problem that needs to be solved. How can you find a solution? If you don't know what to look for, you don't know the keywords to look for. It is only after you are reading a book and something unexpectedly catches your eye that you realize that this is what you are looking for. Your awareness of the problem and the knowledge in the book will unexpectedly connect to create the value of a problem solution.
    + Binding does not just happen between multiple books. For example, let's say you have a problem that needs to be solved. You want to find a solution, but you don't know what to look for or the keywords to look for. You read a book, look at something, and for the first time you realize that this is what you are looking for. Your awareness of the problem and the knowledge in the book unexpectedly combine to create the value of problem solving. The column "Consistency of Knowledge" on page 167 is also strongly related to this combination.
    
    -For example, my wife, while discussing in a graduate school of business administration class, thought, "There should be a line where you can lose money up to this point, but gain money from here on out," but she felt frustrated because she did not have the words to express it. When I explained the idea that he could not express well, he said, "Oh, that's 'break-even point,'" and I got a new word. Once you know the name, you can search about it, and it is easier to obtain related knowledge
    +For example, my wife was in a discussion at a business school when she thought, "There must be a line where you lose money up to this point but gain money from here," but she was frustrated because she did not know the word to describe it. When he later explained this to a friend, he was told, "Oh, that's the 'break-even point,'" and he had a new word. Once you know the name of a concept, you can search for it, and it is easier to obtain related knowledge



[Improvements for the enlarged edition of "The Intellectual Production of Engineers"].
