Faster disease to do it yourself.
[https://gyazo.com/278c27d3fdeb1e7a84e8077aeb2642dd]
 [Hiroshi Ogura]
 [Amazon https://amzn.to/2M7NqyH]

	The book describes the "do-it-yourself disease" as a condition in which people think it is faster to do things themselves because they "don't know how to delegate," "can't come up with satisfactory quality," or "don't have time to teach.
 In a presentation by someone who has been through a LoanDEAL transfer, he talked about how he realized his lack of [involvement], and I realized I lacked the ability to get involved as well.
  I was lucky enough to be surrounded by people who were "strong in their ability to get involved, smart enough to choose the right themes to get involved in, and have a long-term perspective that doesn't try to exploit me in the short term," so I got involved in a lot of things in a daze and this is what happened.
  In fact, going to a LoanDEAL event is in itself a form of getting involved with Seki-san.
	I bought the book because I felt bad when I saw the expression on the book's description page, "As the disease progresses, you become [a lonely successful person].

Two ways, "It's faster if I do it myself."
	I can do it faster because I can do it better than those around me.
 I don't know how to ask for help, and it's faster to do it myself than to worry about how to ask for help.

	The more work you take on, the less room you have for it.
 Affirm yourself by blaming others and the environment for why things don't work out.
 The members we have now are the best members, there is no "if someone better comes along" etc.
 The phrase "I can't ask you to do something because I'm too reserved" means "we haven't built a relationship of trust" just by using the pretty word "[reserved]" as a cover for it.
 	If there's [trust], "Can you do that for me, please?" It shouldn't be difficult to have an exchange of "okay/it's a little difficult right now."

	Four Happinesses
 	To be loved by others.
  Being praised by others
  Helping people
  To be needed by others.

Doing "work for your own praise" only tickles your self-esteem.
profit-and-loss arithmetic

	It's [selfishness] to think, "It's faster if I do it myself."
 	Tend to get intoxicated with the pose of altruism, saying "I'm working so hard" when they have their own work to do.
  [Teach them to fish, not give them fish].
  	There are two kinds of acts of giving.
   The act of giving fish is, in the long run, "If you don't give fish, your hunger will not be satisfied."
   Short-term satisfaction of having "done it
   So "act of giving" but "selfishness."

Founder of Yellow Hat [Shuzaburo Kagiyama].
	Happiness of having someone do something for you
 Do-it-yourself happiness
 I'm happy to let you do it.

 From a state of "the purpose is to get the job done" to "the purpose is to provide opportunities for growth through work.

Founder of Kyocera [Kazuo Inamori].
 [The smallest good is like the greatest evil, and the greatest good is like ruthlessness.]
 Avoid conflict, seemingly a "gentle man"
 In fact, selfishness.

	Three Misconceptions about "Delegating
 	What you entrust to us comes back to you with the expected results.
   That's not true.
   The basic premise is that failure and results that do not meet expectations are returned.
   It's funny that "I can't trust him because he might fail."
  Leave it to me = Throw it all in my hands
  	That is only if the other party is a professional who has grown to a level where it is safe to throw the whole thing away.
   In the majority of cases, you will be left in charge but remain "ready to help if the need arises".
  Delegate to make your job easier, delegate to make your job easier.
   That's after they've grown up enough.
   The goal to be reached in the future by "delegating.
  	For those who are not delegating now, in the short term, delegating will create more work.

The "boss's dilemma" that every manager faces.
	That we must bear both "short-term results" and "medium- to long-term results."
 Medium- to long-term results = growth of oneself and one's surroundings

Leave it to me = give me [the right to fail].
 [Failure is an opportunity to grow.]

Delegate authority informally.
 How to deal with organizations where it is difficult to formally promote and empower people with no track record
 Delegation of authority to informal on your own initiative.
 After the results are achieved, persuade them on a performance basis by saying, "Actually, he is the one who achieved these results.
 Giving opportunities to those who can't, so they can become people who can. This is education.
  But not just anyone.
  Responsibility and trust
  Give them a job that is a little harder and judge them by their work performance.

Don't try to make copies of yourself.
 I tend to think that the way I have experienced success in the past is the right way.
 I tend to say it like I'm tracing my own way.
 It's a robotic job from the other person's point of view, "I'm being told to do as I'm told.
 'If you're going to give me the job, let me do it my way, otherwise I'm out of this job.'
 Stifle the urge to meddle.
 	Or tweeting, "What I'm about to tell you is a soliloquy, so you'll have to decide for yourself whether you want to adopt it or not."
  Balance between push and pull. Don't push too hard, you will have 100 things you want to say, but say only 3.
  Don't say everything that comes to mind, but only what is really important right now, once you have accumulated it.
  It is important to give yourself the ability to make this choice.

PDCA cycle
 D to keep myself out of it.
 Inevitably, it will be weighted to the rest.

They don't come to me for advice when I say, "Let me know if you need anything."
 I would set up a time for the interview, maybe a meal, coffee, etc.

Assumption that "the work is too complex to outsource."
	Difficult because they try to make a 100-point manual.
 Create a 70-point manual.
 	For example, a list of minimum things to check

The same author's [The Art of Delegation].

Questions to eliminate assumptions
 "[Is it] really faster to do it yourself?"

[Shinzo Mori]
	"Any study that does not lead to a way of life is useless."

[Everyone is a teacher except me.]

[Yin and Yang virtues]
 [Yangde] takes energy away.
 Supplement with [yin de].
 Lecturing and writing are yang virtues, so they rob you of energy, so you need to compensate with yin virtues.

#Rolling force

[harajune's thoughts on https://www.facebook.com/harajune/posts/10156856776813217]
