Teach them to fish, not give them fish.
Allegedly a Chinese proverb, but quite dubious.
	By 122 B.C., the saying "If you want fish, go home and make nets" was born.
		But that's not a statement to the effect of "don't give them fish, teach them to fish."
	A 12th century Jewish rabbi wrote in his writings to the effect of "teach the poor a trade."
		That gradually changed in the English-speaking world to "don't give them fish, teach them to fish."
	The discourse that it is a Chinese proverb originated in 1961, but the source is not specified at that time

>The fish are not given to the fishermen because they are not given to the fishermen because they are not given to the fishermen. In the "Hanshu - Dong Zhongshu Biography", it is said: "Since the beginning of time, Han has always cured the greedy, and now he cannot be cured. The ancients said: "Amen to the depths of the abyss and the fish, but do not retreat to the net. In China, there is an old saying, "Give a man a fish, and he will not learn anything", which means to pass on knowledge to someone who has already learned it. The reason is very simple, fish is the purpose, 钓鱼 is the means, a fish is able to dissolve for a time, it is impossible to dissolve for a long time, if you want to eat fish for a long time, it is necessary to learn the method of 钓鱼.
https://baike.baidu.com/item/授人以鱼不如授人以渔

>The Huainanzi is a book of thought compiled by the Huainan King Liu An (179 BC-122 BC) during the reign of Emperor Wu of the Former Han Dynasty, who assembled a group of scholars to compile it.
	[Huainanzi - Wikipedia https://ja.wikipedia.org/wiki/%E6%B7%AE%E5%8D%97%E5%AD%90]

The baidu commentary says "临河而羡鱼，不如归家织网," while Wikisource says "臨河而羨魚，不如歸家織網。" is written as "临河而羨魚，不如歸家织网。 [淮南子/說林訓 - 维基文库，自由的图书馆 https://zh.wikisource.org/wiki/%E6%B7%AE%E5%8D%97%E5%AD%90/%E8%AA%AA%E6%9E%97%E8%A8%93]
Of course, Wikisource would be more correct, since there could not have been simplified characters in BC.
Will it be, "If you envy the fish when you come to the river, you must go home and weave a net," or "If you want fish, you must make a net."

But this context is
>The one who eats it does not destroy its vessel, the one who eats it does not break its branch. The source of the food is consumed, and the source of the food is dead. The picture is not fluent, the link is not dissolved, it is not dissolved.
	A person who eats a meal does not break dishes, and a person who eats nuts does not break branches. Those who block the source of water thirst, and those who disobey the book? Things wither. A tangled cord will not stretch, and a ring will not unravel. The knot cannot be untangled, and the loop cannot be unraveled.
So it seems to me that the nuance is "As a natural course of things, if you want to get something, you need to take care of the means to get it.

National Diet Library Japanese Translation of Huainanzi by Reinun Taoka (Sadaiji) http://dl.ndl.go.jp/info:ndljp/pid/753442
[https://gyazo.com/0da766e0c06f0f482a446d7b5cd1c5eb]


What is Hanshu?
>The "Han Shu" (漢書) is a history book about the Former Han Dynasty compiled by Hanguo, Hanjiang, and others during the reign of Emperor Zhang of the Later Han Dynasty in China.

What is Dong Zhong Shu Biography?
 [Dong Zhongshu - Wikipedia https://ja.wikipedia.org/wiki/%E8%91%A3%E4%BB%B2%E8%88%92]
	Millennium Book of the Han Dynasty Millennium Book of the Han Dynasty
>To stop boiling water, to save firewood, and to save your life. If you are in trouble with your zither, you must be able to save it, or you will be in trouble with your drum. If the government does not change, it is impossible for a good craftsman to make good decisions; if the government does not change, it is impossible for a great sage to make good decisions. Since the time of the Han Dynasty, it has always been the desire to heal, but now it is impossible to heal. As the ancients used to say: "The fish that swims in the deepest pool will not retreat into the net.
[漢書/卷056 - 维基文库，自由的图书馆 https://zh.wikisource.org/wiki/%E6%BC%A2%E6%9B%B8/%E5%8D%B7056]

The context of this is "If you cannot change when you should change, you cannot rule well, even if you are a great sage. Since the Han Dynasty came to power, all those who have tried to rule and failed to rule well have done so because they failed to change when they should have changed.

On the other hand, in the English-speaking world [Give a Man a Fish, and You Feed Him for a Day. Teach a Man To Fish, and You Feed Him for a Lifetime - Quote Investigator https:// quoteinvestigator.com/2015/08/28/fish/], according to a 12th century Spanish Jewish rabbi [Moshe Ben-Maimon - Wikipedia https://ja.wikipedia.org/wiki/%E3%83%A2%E3%83 %BC%E3%82%B7%E3%82%A7%E3%83%BB%E3%83%99%E3%83%B3%EF%BC%9D%E3%83%9E%E3%82%A4%E3%83%A2%E3%83%BC%E3%83%B3] said "To relieve poverty teach commerce". The earliest expression found entered into English translation in 1826. This expression was then gradually changed to the modern expression "If you give a man a fish, he will be hungry tomorrow. If you teach a man to fish, he will be richer forever.

Then, in 1961, Fred Nelson abruptly introduced this now-famous expression as "a Chinese proverb.

[Parable of the fish and the fishing]
OLD TITLE: [授人以鱼不如授人以渔]
