Free English Conversation School Course Experience
 I went to GABA's free trial course, and the quality was incomparable to Rarejob's. Rarejob was in the business of selling the experience of "speaking English", while GABA was in the business of selling consulting services to help people "learn to speak English".
 The strategy is not to sell at a low price to increase the number of customers, but to sell at a high price and invest the profits for higher customer satisfaction.
 Even though the trial session lasted 25 minutes, he spoke for two hours in all, including the consulting sessions before and after.
 The question was whether or not I would pay 9,000 yen for one 25-minute session. I was almost tempted to immediately decide on the 190,000 yen per month plan for 20 sessions, but when I came back home and thought about it calmly, I realized that I would have to go on a one-week business trip to Kansai + 3-day hackathon + prepare materials for PyCON JP and Kyoto University Summer School in one month from now. If I put the task of "completing the preparation spontaneously, making reservations spontaneously, and reviewing spontaneously for 20 rounds" on top of that, I feel that I will surely be over capacity. The time and mental burden is greater than the financial burden.

 After a night of sleep and thinking about it, I realized that "[looking for reasons not to do it]" is a typical "[looking for reasons not to do it]". When I think about what will be lost if the situation I fear actually happens, English conversation study is the lowest priority, so I can cut it off. The loss can be limited. On the other hand, if things go well, what you will gain is that you will get rid of your fear of English conversation, and new possibilities will open up. This is a situation where you should take a risk.
 I've made a list of the available time over the next month and there are 12 weekday evenings and 6 weekends, so it wouldn't be hard to fit in 20 courses.

[Facebook https://www.facebook.com/nishiohirokazu/posts/10203888001336968] [2014-08]-11
