KJ method in VR
Prototype to do [KJ method] in [VR] prototyped for [Oculus Go] in [2018] ([VRGROUP])
[https://youtu.be/jqJoju1gjWw]

	2018-06-25 [automatic slide movement].
 [物理演算の改善]
 	[draws near and reads]
 [Perspectives on two infospaces].
	[Grouping of slides 20180809].

2018-10-29 Summary at this time as we have decided to put the project on hold for now.
	I can't control things with the precision I expect.
 	When using a laser pointer to manipulate objects with a hand floating in the air, because of the shaking of the hand
 	Frustration at not being able to place visible sticky notes where you expect them to be
  Especially regarding the grouping UI.
  	Surrounding" is difficult.
   I made the choice based on distance, but it's also rather difficult (hand tremor).
 Speeds were not as high as expected.
 	As for the slides, maybe it's because I have over 100 stickies each with textures of a resolution that can be enlarged and read.
  	Should I keep the smaller texture until I zoom in and then replace it with a larger one?
  Is it physics-heavy?
  	I've implemented it in a secondary way to speed up the process.
  Should be confirmed by not texturing and taking a profile, etc.
 Web content was difficult to display
 	I thought it would be easy to use [Embedded Browser], but it does not support VR.
 Difficulty in making nameplates
 	Difficulty in creating a new nameplate sticky note in VR space, with no keyboard input and very difficult handwriting
  The most important part of the KJ method cannot be realized.
  Time may tell if the Oculus Go can't input Japanese from the keyboard.
 Loading content from Scrapbox
 	I hoped to be able to do this in the future.
		It would be interesting to automate the process with regard to placement: "When you load your Scrapbox project, it will create a map in VR space."
  But if you can't view the web content, you can't see the page content after all.
	Distribution difficulties
 	If you don't meet the requirement of 60+ FPS, you can't even distribute the beta in the first place.
