外部接続と内部接続
When considering taking data in service A to service B, connection costs will be lower if both parties adopt a common scheme (notation, data format, etc.). For this purpose, it is preferable to adopt a method that is [* currently] in widespread use. This is because each service provider is a separate decision-making entity, and cannot change the method in a coordinated manner.
[https://gyazo.com/f98f2d0c21ee52e810c8ec02bf1d3049]

On the other hand, in the case of connections within a service, any method can be adopted, since both connection target methods are controlled by the provider of service A. Since this is different from the situation described earlier, we will refer to the former as an external connection and the latter as an internal connection.
[https://gyazo.com/a68691fb877b00755ca57e591d197c63]

Both external and internal connections share the common objective of reducing the cost of connection in the common situation that "connection creates customer value." However, the direction in which they proceed to achieve this goal is different. In the case of external connections, the goal is to "select the most widespread method. For internal connections, the goal is to "select the method with the lowest connection cost," regardless of the currently prevailing method. If a different method is adopted from the currently prevailing method and the connection cost is lower, that is the source of competitive advantage.

具体例
	Apple has developed its own method for interconnecting its products: [Bonjour - Wikipedia https://ja.wikipedia.org/wiki/Bonjour]
 	Based on this technology, Apple products can be connected to other Apple products in the vicinity at no cost to the user in terms of configuration.
   In the situation "I was viewing a web page on my iPhone and then opened my iPad," "Would you like to see this page you had open on your iPhone on your iPad?" and appears in the dock icon (rightmost icon in the figure)
    [https://gyazo.com/93660562d6046b99016927758647ff62]
   If you take a picture with your iPhone and say, "I want that picture," you can give it to someone else via AirDrop without exchanging contact information between iPhones.
	Nota adopted the [bracketing] notation for page-to-page connections within Scrapbox.
  Notation `[connection destination]` to reduce the cost of connection to the limit.
  This notation is also automatic when copying and pasting URLs.
  In addition, similar searches are performed and suggested in real time when you are typing the contents of `[ ]`.
   [https://gyazo.com/279b913e15efc9759f977ab88bbb213d]
		This has dramatically lowered the cost of finding and connecting with what has been written in the past.

Saying "Why don't we just use widely used methods?" in response to this kind of R&D to increase internal connectivity is a "statement without management sense" that tries to give away future competitive advantages. It is meaningless to increase external connectivity without a competitive advantage. Increasing external connectivity is done after the fact, after internal connectivity has been increased.

[外部接続]と[内部接続]
[相互接続性]