What if a task estimated at 1 pomodoro takes 5 minutes to complete.
summary
	Let's be happy that a task that we thought would take 25 minutes unexpectedly took 5 minutes. It's important to enjoy the work.
 Not appropriate to count as "1 Pomodoro" because it was not 25 minutes of concentrated work
	If you twist an appropriate task on the spot and work on it for 20 minutes, that's not "one pomodoro".

[Pomodoro Technique] #Pomodoro
2012-11-14 [Hatena Diary http://d.hatena.ne.jp/nishiohirokazu/20121114/1352904902]
I wrote the rest of what id:Yoshiori and I were talking about in the car on the way to PySpa on Twitter, so I'm reposting it on my blog so it doesn't drift away.

I've been asked many times in my own past blogs about what I do when I have less than one pomodoro of work left over. In the original book, the authors mentioned reviewing what was done, repeating what was learned, thinking of ways to improve the work, and making notes of conclusions.

Maybe the author doesn't envision a situation where "a task that was supposed to take 25 minutes is done in 5 minutes"; if a 25-minute task is done in 22 minutes, I can still imagine using the rest of the time in that way, and if it's an input task like studying, it can be repeated in the remaining time.

But when you have 20 minutes left over after 5 minutes of "[difficult to estimate task]" like debugging, it doesn't seem right to "kill" the remaining time by thinking of a new task that would use 20 minutes on the spot. That would not be a "25 minutes of focus" that can be compared to other pomodoros.

So, if you have so much time left over that you don't know what to do with the rest of your time, I think you should gracefully cancel your pomodoro and start a new one.

yoshiori
 I see, but I need to do something about my lowly mind that thinks, "Well, I did a little work on that pomodoro earlier, and I feel like I'm losing something."


"Woohoo, I finished in 5 minutes what I thought would take 25 minutes, I'm a genius!" I'm a genius!

We are in pursuit of "[a] fun way to get the job done," so we should always choose the fun way: "I did it, I focused for 25 minutes," when we focused for 25 minutes but didn't finish the task, or "I did it, I finished the task," when the task was finished but not for 25 minutes.

I don't think a system that brings up "feelings of loss" or other negative emotions would be able to continue.

yoshiori
 Ah, I see, I forgot a little about the basic premise of "I want to enjoy my work! Of course there's a reason "so I can concentrate", but the basic premise is "to have fun"! Thank you! I feel a little better now.
 I think we have to be careful not to think too much and make tasks that don't fit in 25 minutes or are too small look like something we don't want to do.


Such tasks are supposed to be "crisp, beatable, comfortable tasks" if they are managed with a conventional TODO list. Pomodoro made it possible to get a sense of accomplishment quickly by chopping large tasks into 25 minutes, which is difficult to feel a sense of accomplishment with conventional TODO, but on the other hand, there is a disadvantage in handling tasks shorter than 25 minutes.

I feel that it is important to have a chance to feel a sense of accomplishment both on the scale axis of "completion of the task" and on the time axis of "25 minutes of concentration.

yoshiori
 Ah, I see, I should just think of the 25 minutes of concentration and the completion of the task as two rewards, how can I say it? I should try to eat a piece of chocolate to make it easier to understand. That way, if I finish the task in 5 minutes, I can eat one piece of chocolate and move on, and if I concentrate for 25 minutes and finish the task, I can eat two pieces of chocolate and take a break.


I think it is possible to make it an easy-to-understand material reward because "[a sense of accomplishment] = a mental reward. But if I do the chocolate system, there are two punishment opportunities waiting for me: "I'll get fat" and "I'll get cavities.

yoshiori
 That would add a pretty big task of "lose weight" and "fix cavities" to the list.
