A system that fools the reader.
I hate systems, media, authors, etc. that fool readers.

	assume that readers are too stupid to understand what you write about difficult things.
 Thinking that readers should remain stupid and not have to be provided with opportunities to grow.

	[参考文献の削除]
		Deprives readers of the opportunity to connect to a network of knowledge
  In English-speaking countries, references are listed, but sometimes they are removed in the process of translation.
  Some publishers do that sort of thing because they think "readers are stupid and don't need references," and it's obnoxious.
　	英語のWikipediaと日本語のWikipediaの参考文献の充実度の違い
  It is strange that a clear statement of the source, which is common practice in English-speaking countries, is not done in Japanese-speaking countries.
 Hide jargon
 	When there is a concept and a technical term X that is tied to it.
  	Readers will be confused if you suddenly explain in technical terms.
  	It is good to explain without using jargon, assuming the reader does not know that jargon.
   However, if the terminology is not mentioned at all, the reader loses the opportunity to learn about it
   Interested readers will be unaware of the appropriate keywords to look up on their own.
	hide the source material
 	I don't think it's a bad idea to make [Post-Capitalist Society] a bit more radical and incendiary, or to put [The Goal] story in an IT-oriented context.
  But the author hiding the original story is unforgivable.
  It is an act of trying to profit from the wisdom of our forefathers while keeping stupid readers who don't know the original story stupid.


	liquid food with a good thirst-quenching effect
 A book that should be chewed and eaten well
 Books you can read without using your jaw.
 離乳食
 They are treated like infants.
 	They're making fun of you.

	Allow readers to build a network of knowledge within themselves
 Clearly indicate the source so that it can be traced.

	[Singularity]
		Technology that accelerates human intellectual production is what matters.
  Specifically, high-speed scientific knowledge sharing via arXiv
  [only implemented in natural language].
  Sharing of source code, sharing of trained models, is happening.
