The trap of 100% understanding
A book that reads smoothly and feels 100% understood means that the reader could swallow it without having to rework the existing framework, which also means that there is no chance for jaw-dropping, firm-chewing type learning.
 There is a captive "I have to know 100%."
 Middle school studies were graded on a 100-point scale, but learning in the workforce is not. It is not a good idea to avoid it and prefer what is easy to understand or what is easy to choke down.

The value of learning is not in the input from reading a book, but in comparing and combining the information gained from that information gathering with one's own previous experience and building on it.
	The way it's combined, there's "Oh, this thing I've been experiencing has a name like that?" or "It contradicts my experience, doesn't it?" and then "It wasn't contradictory," or there's a gap that hasn't been filled in yet.
 [https://gyazo.com/2f5dd1e84cfed14dd0773b241702ce69]
		'What I experienced' matches the patterns in the books and names the patterns in my experience.
 [https://gyazo.com/78caaf82b122f23174029063e2707767]
		Cases where there is a seeming conflict between what you experienced and the information in the book.
  	By looking at your experience from a different perspective, you can find a new angle.
   It is an opportunity to break down the experience into smaller chunks and understand it in a more detailed way.
 [https://gyazo.com/bc610977bd1bc9384bc549fa1ddeaf50]
		Find gaps between your experience and new information.
  	Feelings I don't quite understand," etc.
  Becoming aware of the existence of what is lacking encourages the discovery of what fills the deficiency.
  [color bath effect]



[continued https://www.facebook.com/nishiohirokazu/posts/10216145544207879]

To begin with, p. 133 of [The Engineer's Art of Intellectual Production] said, "Trying to understand a book 100% is not setting the proper completion conditions."

[松下 幸之助]の[自修自得]
>"Let's take business administration, for example, for simplicity's sake. Business administration can be taught by others or learned from books. However, just because one has read 10,000 volumes of books on business administration does not mean that one can completely run a business or do one's job. It may be helpful in many ways. However, the real management and work cannot be taught, nor can it be learned, but can only be acquired through one's own creativity and ingenuity.
> Without the mindset of self-knowledge, even if you do as you are taught or as you read in books, you may be able to do certain things, but I don't think you will become a true professional. It is only on the premise of self-learning that we can make the most of our knowledge and the teachings of others.
> ("Sono Kokoromi Yayoi," PHP Kenkyujo)
