Employees are not colleagues, but customers
[Facebook https://www.facebook.com/tetsuya.isozaki/posts/10216325130071558?hc_location=ufi]
>Tetsuya Isozaki
>This is the best Iiri has ever said.
> I've seen a thousand startups, and most of the mental problems of their managers occur in the process of "expecting and being betrayed and getting hurt".
> Kensaku said before,
> "I realized that I had subconsciously thought that my employees were my friends, that they should be on my side, and I started thinking that my employees were users, and it just felt right."
> I think it is also common to say that
> For example, if you are the manager of a startup that aims to become a mega-venture, the members of the founding team are the people who will bring you billions or tens of billions of yen in assets in the future.
> It is a shallow mindset to "expect" something when we do nothing. If you think of them as "valued customers," you will naturally ask yourself how you can make them most excited. If you think of them as "important customers," you will naturally think about how you can best market, brand, and present your products and services to them.
> Looking at startups as a whole, I think the most successful companies are those with management teams that think like that.
	>Ieiri Kazumasa
 >My attitude toward all others is "[Believe, but don't expect]. Expectation is a curse for the other person and for me. Because I [expect]tL, I despair when I don't get the result I want. Belief is a one-sided act in which you take on everything, no matter what the outcome.
 > 
 > It's hard to be the one who is expected without permission and then despaired without permission, isn't it? Whether it is parents and children, corporate organizations, friendships, or love, we tend to put a spell on people in the name of "expectation. I believe that the only truth is that we do not ask for anything in return in the name of expectation, but only believe one-sidedly, and the one who believes bears all the consequences of that belief.
