Live as if you will die tomorrow, learn as if you will live forever.
>Live as if you were to die tomorrow. Learn as if you were to live forever. 
[A similar expression, often attributed to [Mahatma Gandhi], is found in several pre-Gandhian writings.
	>Variant on aphorism "Study as if you were to live forever. Live as if you were to die tomorrow" pre-dating Gandhi, variously attributed to Isidore of Seville (c. 560 – 636), in FPA Book of Quotations (1952) by Franklin Pierce Adams, to Edmund Rich (1175–1240) in American Journal of Education (1877), or to Alain de Lille in Samuel Smiles's Duty (1881).
	https://en.wikiquote.org/wiki/Mahatma_Gandhi

Although it sounds cool as a sentence, "[Live]" is a concept that encompasses "[Learn]" in the first place. While you are living as if you will die tomorrow, you cannot make the decision, "Okay, I will learn as if I will live forever. Since you are going to die tomorrow, there is no time to take such a long time.

While it is impossible to live forever, it is possible to die tomorrow, so only the first half of the story may be circulated. In this case, the importance of learning is underestimated. If you are going to die tomorrow, you should not spend time learning, but act with the knowledge you have now.

There is a difference in action if you die tomorrow and if you die in a month. If we assume the former, we will not start a task that will take two weeks. This creates a [bias] to pursue [short-term returns]. #Short-term

In a situation where you can move things in a direction that you think is good, even if it is only a little, you will do your best for that "little" now without thinking about the future, and people around you will be impressed by your enthusiasm. However, this does not mean that if you say to your children, for example, "Live as if you were going to die tomorrow," they will accomplish great things. This only works if the person has a great ideal and a strong sense of self-efficacy that his or her actions will bring him or her closer to that ideal.

After thinking about these and other factors, I personally think "die in 5 years" is just right now in my late 30s; 5 years ago I was thinking "die in 10 years." Should I extend the period more when I'm younger? Should it be shorter when I am older?

Mathematically, if the probability of dying in 5 years is 1/2, it would be just right, because it would leave the need for long-term investment since we might live, and it would also put pressure on us to output results in a tangible form since we might die.

It may be better not to fix a term. Thinking about what we would do if the time period were fixed is a way to change our perspective. Maybe it is better to switch from time to time, thinking that you will die tomorrow, in a week, in 49 days, in a year, in 7 years, and so on.
