The two options are misinterpreted as opposing concepts.
They were just two of many, but before you know it, they'll be considered opposing concepts.
[Original source Facebook https://www.facebook.com/nishiohirokazu/posts/10209536130136658]
	A and B are not originally opposing concepts, but as they are used in opposition to each other, some people interpret them as if they were opposing concepts.
 There was a time when "ROM/RAM" could be equated with "rewritable" and "pass-by-value/pass-by-reference" with "whether changes within a function affect outside the function".
  When you try to interpret that new reality in the [old framework], you're forced to make a weird classification.
 [However, when people started to look at the argument passing methods in Java and Python and say, "Is this passing by value or by reference? But then, when people look at argument passing in Java or Python and say, "Is this passing by value or by reference?
 Technological advancements will lead to things that cannot be well categorized in [past frameworks].
 	ROM(Read-only Memory)
 	Since [PROM https://en.wikipedia.org/wiki/Programmable_read-only_memory](Programmable ROM) was invented in 1956 and [EPROM https://en.wikipedia.org/ wiki/EPROM](Erasable PROM) was created in 1971, so "ROM" was already used to mean "nonvolatile memory" rather than "nonrewritable memory" by this time. As a result of the cost of rewriting becoming cheaper and cheaper through technological evolution, in 1977, "Electrically Erasable Programmable Read-Only Memory" [EEPROM https://en.wikipedia. org/wiki/EEPROM] was born.
  EEPROM.
  	Erasable without the need for UV (using ROM Writer, which can create high voltages)."
   Erasable at the same voltage as when driven (by making your own high voltage with a charge pump)."
  There are two levels of
 	When "EEPROM that does not require UV but requires physical work such as erasing and rewriting by hand" became "EEPROM that can be erased and rewritten only by electronic operation" due to technological progress, "Oh, is this read-only memory? I begin to feel a strong sense of discomfort.

[false dichotomy].
#Existing framework #Framework
#Conflict
#assumptions
