Perspectives and Eyes
A story I wrote in 2014 about my discomfort with the assertion that I do not want to be a manager, but that it is beneficial to think with a manager's perspective.

After rereading the text, I realized that "line of sight" and "point of view" are recognized as two different words with different meanings, but they are not clearly conveyed. As I write this, I myself am not clearly aware of the distinction between the two, so I am mistaking them. In the process of reprinting the text here, I thought, "Oh, I've been dragged down by the previous sentence here, and I'm confusing the two," and corrected it, finally realizing that "line of sight" and "viewpoint" are used with different meanings.

It is impossible for someone who is not Mr. A to think from Mr. A's perspective; it is Mr. A's responsibility to tell others what he sees from his perspective.
The word "perspective" refers to the position from which the viewer stands. Each person has different experiences and cannot stand in the same position as others.

The term "line of sight," on the other hand, refers to a way of looking. One way is to focus on "whether current customers are happy or angry." Another way is to focus on "future customer acquisition." There are ways to look at software maintainability, and there are ways to look at company survival. This is a skill that can be learned.

ooooooooooooooooooooooooooooooooooooooooooooo!

https://www.facebook.com/1129148772/posts/10203986126150027/
As for "it is beneficial to think with a manager's perspective," I agree that it is true, but I don't understand why that assertion is accompanied by the explanation that "I don't want to be a manager."
Management (i.e., successfully allocating limited resources to increase returns) is a useful skill for all people regardless of their role in the company, and it is essential to run a one-person company, yourself, regardless of whether or not you are in the role of manager in the company.

Ah, I see. So there are two ways of looking at the phrase "thinking from the manager's perspective": the nuance of "Mr. A thinks from Mr. B's perspective" and the nuance of "(Mr. A) learns the skills of X"?

Regarding the former, when Mr. B says, "Mr. A should think from Mr. B's point of view," I think, "Don't put your own lack of ability to communicate on the shelf," regardless of Mr. B's position. On the other hand, as for the latter, "You should acquire X skill," I think "True if the cost-effectiveness is worth it.

The conversation is ambiguous because Mr. A and Mr. B are supposed to represent the positions they hold, but the event is simply selfishness, "You should know how I feel. It is a common practice to represent without permission, "This is why men are like this (looking at one man)!" It is the same pattern as "This is why men are like this!

I found that "becoming a manager" and "having a manager's perspective" and "becoming an educator" and "having an educator's perspective" were recognized as "skills" in my mind, as was the relationship between "making a living through programming" and "being able to program.

So you responded, "Whether or not you choose that as a profession/role has nothing to do with whether or not the skill is useful." I agreed.
