It is not enough to have pages of concrete facts and pages of abstract concepts
It is not enough to have [pages of concrete facts] and [pages of abstract concepts
#Scrapbox Best Practices

[/shokai/2 hop link] 曰く
	Scrapbox can be fun if you consciously write two types of pages
  具体的事実
  抽象的概念
  	Existing technical terms
   Appropriate sentences that make it easy to recall the content
	Because it is easy to generate unexpected links of "concrete -> abstract -> concrete" and "abstract -> concrete -> abstract" by 2-hop links.

The occurrence of unexpected and surprising links ([serendipity] support) is one of the advantages of Scrapbox.
	Use it as an "engine for generating new knowledge links" rather than a "warehouse of dead texts."

But the important point is not "there are pages of concrete facts and pages of abstract concepts".
I think it's [how to title the page], how to create a page of abstract concepts.

Common behavior patterns
	Create pages for specific book A, book B, and book C = pages of specific facts
 Tag each page as "book" = abstract concept page.
This is a poor idea in terms of "creating serendipity."
For example, when I'm looking at a page of an economics book, I'm not happy to see a suggestion for a linguistics book because it's a book.
Why is it that this pattern is not good even though "create and link concrete and abstract pages" is satisfactory?
	The title of the abstract page is a tasteless "book"
 The concept of an abstract page doesn't sound particularly interesting.
 	Are you really interested in the concept of "books"?
 	If you put the tag `books' on each book page, you will see a list of those pages on the `books' page."
  	Are you really going to look at that page in the future?
   Too abstract of an abstract concept.
	   Patterns on the right side of [Do Not Classify
			I don't put a `book` tag on the entire book. I use the author's name as a link, so if you look at [Shigehiko Toyama page https://scrapbox.io/nishio/%E5%A4%96%E5%B1%B1_%E6%BB%8B%E6%AF%94%E5%8F%A4], his books and references to him appear in the link
	Abstract concept page is not recognized as a "page" and is thought of as a tag, so it is an empty page

How to make the abstract concept page "good" is important, but what that "good" is has not yet been verbalized.
