Berne Convention
from [copyright notice for OSS developed by a large number of people].
Berne Convention
1886 [Berne Convention for the Protection of Literary and Artistic Works - Wikipedia https://ja.wikipedia.org/wiki/%E6%96%87%E5%AD%A6%E7%9A%84%E5%8F%8A%E3%81%B3%E7%BE%8E%E8%A1% 93%E7%9A%84%E8%91%97%E4%BD%9C%E7%89%A9%E3%81%AE%E4%BF%9D%E8%AD%B7%E3%81%AB%E9%96%A2%E3%81%99%E3%82%8B%E3%83%99%E3%83%AB%E3%83%8C%E 6%9D%A1%E7%B4%84]
	U.S. and other countries refuse to participate
 	At the time, the U.S. took the formalist position that an application was necessary to create a copyright.
1955 [Universal Copyright Convention - Wikipedia https://ja.wikipedia.org/wiki/%E4%B8%87%E5%9B%BD%E8%91%97%E4%BD%9C%E6%A8%A9%E6%9D%A1%E7%B4%84]
	Treaty that "if (C) notation is made, it shall be deemed that an application has been made to create a copyright" even in a formalist country such as the U.S.
 	Article 3.1.
  >Where a Contracting State requires, as a condition of copyright protection under its laws and regulations, that delivery, registration, marking, certification by a notary, payment of fees, or production or publication in its country of origin, etc., be made in accordance with such formality, it may require that all copies of works protected under the present Convention which were first published outside its country of origin and whose authors are not its nationals, be marked with the name of the copyright holder and the year of first publication from the time of first publication, together with the symbol ©. In the case of a work protected under the present Convention which was first published outside its own country and whose author is not a national, such requirement shall be deemed to have been complied with as long as all copies of such work published with the author's or other copyright holder's permission bear, from the time of its first publication, the © symbol together with the name of the copyright holder and the year of its first publication. The © symbol, the name of the copyright holder and the year of first publication shall be displayed in a suitable manner and in a suitable place so as to make it obvious that copyright protection is required.
		http://www.cric.or.jp/db/treaty/bap_index.html
1988 The U.S. amends its copyright law to become a no-formality system. The following year, the U.S. also joins the Berne Convention.

Since all major countries have now ratified the Berne Convention on Formalism, notations such as (C) are unnecessary for practical purposes and are merely customary.

ref
	[copyright notice - Wikipedia https://ja.wikipedia.org/wiki/%E8%91%97%E4%BD%9C%E6%A8%A9%E8%A1%A8%E7%A4%BA]
