Opinions on Kindleization
We are gathering information that we have witnessed because the publishers do not seem to understand the needs of the Kindle version.
As for my book, "The Intellectual Production of Engineers," it will be available on Kindle by the end of November.

People who don't buy books sold now because they want the Kindle version.
 https://twitter.com/yoshida261/status/1036300104469106690
  >I'm very interested in Nishio-san's intellectual production techniques for engineers!
	https://twitter.com/koshigoe/status/1034718989333622785
 	>I've seen the book "The Intellectual Production of Engineers" and I'm curious about it, but there is no Kindle version and I can't snap it up.
 https://twitter.com/Dhj_NF/status/1033692922930241536
 	>I can't wait to get a kindle because I want to read it so badly: ......
	https://twitter.com/saicolobe/status/1025201291369144320
 	>I've popped in a request for a Kindle version. Looking forward to it.
 [Facebook https://www.facebook.com/nishiohirokazu/posts/10216232485021345?comment_tracking={"tn"%3A"R"}]
 	>or rather, I don't want to buy it unless there's a Kindle version (I'm losing control of my physical books).
	[Facebook https://www.facebook.com/nishiohirokazu/posts/10216232485021345?comment_id=10216233474566083&comment_tracking={"tn"%3A"R0"}]
 	>I'm not in Japan, so a Kindle would be great!
 [Facebook https://www.facebook.com/nishiohirokazu/posts/10216232485021345?comment_id=10216250532912531&comment_tracking=%7B%22tn%22%3A%22R%22%7D]
		>I will buy it as soon as the Kindle version comes out. I have old eyes, so please reflow if possible.
	https://twitter.com/Dhj_NF/status/1037326623521927169
 	>I'd like to see books like "Healthy Programmer" and "Intellectual Productivity of Engineers" become available on Kindle.
	Private chat taichi
 	>I'm still having trouble buying it as a pdf and sending it to my kindle. One reason is that I can't do that transfer process, comfortably, with just my phone.
 	>I've done it three times in the past month when I see a link to amazon on twitter or hateboob, go to amazon, and if they don't have a kindle version, I just decide to forget about it.
 	>All of them are Nishio's books.
	Private chat tokoroten
 	>When I want to introduce a book at a client's place, there are so many cases where I buy a kindle on the spot.
 	>That book was good. Not, I'll buy it on the spot on my kindle and display it.
	Private chat tokoroten
		>I have a dropbox for my ebooks, the ones I bought outside of kindle, but I manage them,
	 > I can't keep track of how far I've read, so I end up wanting to read it on my kindle.
	https://twitter.com/mtkasima/status/1044728471274971137
 	>I wonder if there is a Kindle version of "The Art of Intellectual Productivity for Engineers".
  > I've popped in a guru programmer instead.
	https://twitter.com/Dhj_NF/status/1044352638958034944
 	>Intellectual Productivity for Engineers will soon have a Kindle version: ............
	https://twitter.com/pchw/status/1048073722366578689
 	>I'm thinking of buying "The Intellectual Production of Engineers". →There is no Kindle version of this book.
	Private Chat flagboy
 	>I can't wait to get the Kindle version so I can buy it at work when it comes out.

People who want a Kindle version but are giving up.
	https://twitter.com/ninetyeighty4/status/1036964205092458496
 	>I wish "The Intellectual Production of Engineers" was available in kindle edition, but I'll have to give up and buy the book.


People who bought the electronic version and got into trouble.
	https://twitter.com/xudea/status/1041659137292042240
		>I bought an e-book of "The Intellectual Productivity of Engineers" and wanted to read it on my Kindle, but the file size was too big to attach to an email and I couldn't do Send-to-Kindle. I ended up transferring it as a PDF file, and I'm wondering why.
	https://twitter.com/paranishian/status/1038792856511500289
		>I thought my personal document that I sent to kindle on my Fire HD 10 was not reflected on my kindle at all, but it was inside the "send-to-kindle document" in "documents"... inside the "book (i.e. kindle app)". Can't you please do this for me? Only the intellectual production techniques of engineers are isolated.
	https://twitter.com/koizuka/status/1041953645531553792
 	>I can't recommend it until it's Kindle compatible.
	https://twitter.com/xudea/status/1041659137292042240
 	>I bought an e-book of "The Intellectual Productivity of Engineers" and wanted to read it on my Kindle, but the file size was too big to attach to an email and I couldn't do Send-to-Kindle. I ended up transferring it as a PDF file, and I'm wondering why.


People who have the paper version but also buy the Kindle version
	https://twitter.com/yuji_tsukuba/status/1037309828610240513
		>I was going to buy the Kindle version, but it didn't seem to be available, so I bought it in paper (I'll buy it again when the Kindle version comes out so I can easily read it on the train or something).
