Layers of action and layers of problem solving
	"You studied [management] at Tokyo Tech, but you don't do management?" is a question that makes me uncomfortable.
 There are [layers of action] and [layers of problem solving
 Comparing to programming
 	The "layer of action" of programming is typically the act of creating a program by tapping on a keyboard in front of a monitor
  The "problem-solving layer" of programming uses programming knowledge to narrow down the location of the problem and lead to a solution.
 The word management also has layers of action and problem solving.
 	If the question, "Don't you do management?" is a behavioral layer question, the answer is "no" because I do not intend to do a job that specializes in management behavior as a profession.
  If the question is about layers of problem solving, the answer is "we are already doing it" because we are already using it on a daily basis.


-----

>The other day, I was asked, "You studied management at Tokyo Tech, but you don't do management?" I felt uncomfortable when I was asked that question, but I have been able to verbalize it a little better.
> Comparing to programming. Programming is typically being in front of a monitor, tapping away at a keyboard. Using computer science knowledge to solve problems" includes that situation, but it happens all over the place. For example, if you connect a laptop to a projector and it doesn't show up well, you might try connecting another laptop to narrow down the problem.
> 
> The term "management" is ambiguous in that it can refer to a > layer of action, or it can refer to a layer of problem solving. The question, "Don't you do management?" In the former interpretation, the answer is "No," because I don't intend to do "a job specializing in management behavior" as a profession. In the latter interpretation, the answer would be "I already do it" because I already use it on a daily basis.
[Facebook 2015-09-02 https://www.facebook.com/nishiohirokazu/posts/10206799473401950?__tn__=-R]
