Hierarchy and moderation
	There is an ideology that hierarchical structures are not good.
 	[Scrapbox]
  [KJ method]
	On the other hand, hierarchical structures are often used
 	Book Table of Contents
  Foldering of files
  The [ultimate five hat hangers-on] of information design.
 for some reason
 	[Books are tools of finitization].
  Human cognitive abilities are limited.
  I want to make you feel like you understand as much as possible in a limited amount of time.
  We need to start [roughly] and gradually increase the detail [step-by-step detailing].
 	Hierarchy is a structure that naturally emerges when a person with limited cognitive ability tries to handle more information than he or she is capable of.
 So why does the "hierarchical structure is not good" philosophy arise?
 	A hierarchical structure of information that is beyond the capacity of a person with limited cognitive ability.
  This hierarchical structure is often incorrect
  Harmful if the wrong hierarchical structure is maintained
 What to do.
 	When creating a hierarchy
	 	Review hierarchical structure as appropriate.
 	 Consider a review of the hierarchical structure not just a hardship, but a time to organize useful knowledge.
  		[Opinions in favor of hierarchical classification]
  If you do not create a hierarchy
  	Making a front card: making a card that summarizes what is written on multiple cards in the KJ method.
   Create a page that brings together information scattered across multiple pages in Scrapbox and provides a general description of the information.
	[moderated].
 	Even those who affirm the hierarchical structure have to "repeatedly review the hierarchical structure" in the process of a properly functioning organization.
  	The hierarchical structure is not absolute.
  Even those who reject hierarchical structures have to work to create a "rough summary" of the process of properly functioning organization.
  	It's not a clear hierarchical structure, but it does have step-by-step detailing.
			The KJ method's idea of "not doing hierarchical classification" is also said to be no good because if you prepare a hierarchy first and apply it to it, you will not "discover a new framework," and it is nothing but a "hierarchy" that is created in the process of making and bundling tableplates.
  Neither extreme, but a middle ground would be the right one.
	Hierarchy and Perfectionism
 	Trying to put everything in a proper hierarchy.
	  This is bad perfectionism.
   The harm may be greater when hierarchical classification and perfectionism are combined.
  Assume that everything has to be put in some group somewhere.
  	Real world data says otherwise.
  Forcing a subject into some group where you can't decide where to put it at a quick glance.
  	If you do that, the next time you try to take it out, you don't know where it went in.
  	(Some argue that you can just search for it when you want to retrieve it, but we'll think about that another time.)
		Don't put things in the right place if it is not clear where they should be put.
  Don't classify things that can be listed without classification.
  	It only detracts from the list and hinders the use of information.
		Tend to think that having an "Other" folder is a bad situation, an example of failure
  	Actually, there should be an "other".
   KJ Legal Considerations
   	First, lay it all out flat, to make it easier to list.
    When you get close to the limit of what you can list, attach similarities.
    	At this time, a common hierarchical organization is to "create a folder, name the folder, and put it in the folder".
     The KJ method is the opposite: "group related things close together and name them" in that order.
     In this order, so to speak: "Create an unnamed folder, put what you think is relevant in it, and then decide what you want to name the folder.
   Huh? Don't we need to put things in "other" that we can't think of appropriate folders for?
   Hearing on the reason for dividing into [other].
