Opinions in favor of hierarchical classification
	The first place to get your head out of the sand is to create [a hierarchy].
	Maintaining the classification is an organization of knowledge and I find it beneficial.
	Initially, I thought, "It's amazing that they can maintain hierarchical classification."
	After reading it again, it seems that he recognizes that he spends a lot of time on the maintenance of the hierarchy & that the maintenance process is a useful knowledge organization process.
	2019-01-25 What I think about reading back now.
		I don't think I "tag and organize" in Scrapbox to begin with.

-----
https://twitter.com/takao_mofumofu/status/1033941361060446208
	Takao Ito I'm not very good at writing and then [tagging and organizing], and I don't get anywhere unless I first create a hierarchy. I think if I don't organize my mind by creating the first hierarchy, I can't move on to the next one.
		It's hard to explain because it's not a statement I've thought too much about, but if I write it down without sorting out where the knowledge I've researched falls in my own personal and hierarchical knowledge classification in my head, it's like I lose track of what I'm writing about halfway through? Maybe I'm just not used to tagging.
	nishio What do you do when you write down information that comes in from the outside, but not when you write it yourself? This is the case of information whose positioning is not clear at the time it comes in.
	Takao Ito What I just said is just for reorganizing and organizing by myself, so I guess memos, etc. are usually divided by the location where they were heard or the name of the event. However, the memo files are also divided into folders in a hierarchy. For example, Unexplored Events ⇢ Boost Conference ⇢ and so on.
	nishio I created a "papers" folder in the "references" folder, but I'm the kind of person who creates separate folders for each theme by mistake, which leads to chaos, so I feel that people who can maintain hierarchical classification are "the kind who can do magic!" I feel like a person who can maintain hierarchical classification is "the kind of person who can use magic!
	Takao Ito
 	I think about quite a few things, such as matching the level and type of information at each level. However, I maintain the classifications very frequently, and I think it takes up a lot of my time. However, when I am doing maintenance, I am organizing my knowledge, so I feel the time is quite meaningful. Maybe I just like that kind of organization.
		Incidentally, if you fail, you will have many "other" folders at each level.
