On jumping on the bandwagon
2015-09-09
What I wrote while listening to the lectures of other speakers at an omnibus lecture at [Tokyo Metropolitan University].
The speaker said, "[Let's] jump on the bandwagon."

	>I am concerned that "let's jump on the bandwagon" is also a rather high context way of putting it. I assume that the thesis that "math is important" and "the more abstract the knowledge, the wider the range of application," is playing as the prevailing tone, and you dare to "jump on the bandwagon" as the antithesis, right?
 >Abstract knowledge has a wider range of application, so the importance of such knowledge increases as we get older. That's why old guys are acutely aware of the need for it in their daily lives and advise students that "college math and stuff like that is super important". On the other hand, abstract knowledge is hard to apply and motivate if it's not connected to experience.
 >Based on that, "let's jump on the bandwagon" is a useful strategy for young people. Because the difference in the starting line is small, when young people fight against old men who have accumulated experience, the young people have a greater chance of winning. The strategy of winning on a favorable playing field and taking away attention, achievements, and connections (before they are taken away by the old men) is suited to the young people.
 >On the other hand, if you get caught up in the success of your "fad strategy," you will become jittery. My first book was a Jython book, and while it was a success in that I had a track record of publishing books, I personally interpreted it as a failure in the choice of subject matter because the speed at which the content became obsolete exceeded my expectations. That strongly influenced my choice of subject matter for the second book.
  The book I'm referring to here is [The Technology Behind Coding].
 >Well, now that I think about it, when the idea of publishing a book on the trendy word2vec came to me, I chose the strategy of "jump in and establish a track record". I can interpret that you jumped on the bandwagon because you couldn't compete with PFN people whose main job is machine learning itself in terms of the amount of accumulation in explaining the broad theme of machine learning.
 >To backtrack a bit, "jump on the bandwagon" is useful as a strategy for young people not only as a strategy against old men. Because it is a field with little accumulation, the time to realize what others have not done is short. It's a high-profile field, so the probability of getting feedback is high. In other words, you can turn the learning cycle around faster.
 >The concept of "fast learning cycles" was actually learned not in an educational book, but, perhaps surprisingly, in a book on venture management. Lean Startup. Going back, this is one of the factions in management strategy, and I wrote about it in a Cybozu-style manuscript that will be published soon
