Labor management of voluntary activities on holidays
	Developed from Cybozu's OSS policy presentation at Builderscon 2018
	 I saved the discussion of the labor management perspective itself because I think it's useful, but I think I'm on a different layer than the OSS policy.

	[Cybozu's OSS Policy https://blog.cybozu.io/entry/oss-policy]
		The purpose of "When using OSS developed for one's hobby in business, the copyright belongs to the individual even if it is developed in business hours".
	Pointing out that in cases where this is employed, black managers can put pressure on employees to "make this functionality happen by Monday," thereby allowing them to "work on service holidays" without paying for it, in the form of "employees voluntarily developing software as a hobby on weekends."
 	The pretext of "the copyright also belongs to the individual, and it's a hobby."
	It is true that the OSS policy makes it easier to do this, but in the first place, service holiday work is
 		'It's my day off, and I'm thinking about work.'
 	 'I'm on holiday and I've got an idea, so I'm posting it on our internal groupware.'
 	 I'm on holiday, but somehow I log into the groupware, see the notifications, and write a reply."
	 This is a separate layer from the OSS policy because it is a problem that arises regardless of whether the program is copyrighted or not, in the form of
 The cause of the ease of working on service holidays is
 		Having a system in place that facilitates telecommuting and remote work.
 	 That it allows me to work when I want and where I want.
	 There is no way to undo this. Discussion of labor management needs to be adapted to changes in the work environment.
 With respect to the discussion of workerability, it is illogical to argue with the attribution of copyright to the work created.
 	[Report of the Study Group on Labor Standards Law "On the Criteria for Determining 'Workers' in the Labor Standards Law" (1985.12.19) https://jsite.mhlw.go.jp/osaka-roudoukyoku/library/osaka-roudoukyoku/H23/23kantoku/ roudousyasei.pdf] should be the basis for discussion.
	Kazuho: It should be interpreted as working hours even when work is performed on a day off without the employer's instruction.
 	In general, it is considered necessary to explicitly instruct employees not to work voluntary overtime and to request them to stop working overtime when they do so.
			http://www.jil.go.jp/rodoqa/01_jikan/01-Q02.html


Discussion on ---- Twitter (2018-09-10)
[Twitter https://twitter.com/nishio/status/1039373746178408448]
	Kazuho Oku:
		You have proposed to use the "Worker's Criteria" for committing to OSS used by the company, but I disagree with that. Even if the code is used in the company, there is too high a risk that it will be considered an evasion of the law if it is not produced by labor if it is not directly under the company's direction.
 	In general, it is considered necessary to explicitly instruct employees not to work voluntary overtime and to request them to stop working overtime when they do so.
			http://www.jil.go.jp/rodoqa/01_jikan/01-Q02.html
  So even if there are no clear instructions, it is still considered work. This is true whether the work is committed as an official work or under an individual's name. However, there are workers who misunderstand that "if it is in your personal name, it is not your duty. Working on holidays under such a misunderstanding is a failure of labor management.
 nishio It is simply a matter of making it known that "it is not a good idea to work on your days off just because it is your personal name in a hobby repository, and if you want to work on your days off, ask your boss for permission and get paid properly," and there is no danger of the system being considered illegal or an evasion of the law. This is not a situation where the system is illegal or could be considered an evasion of the law, is it?
 Kazuho:
 	Misleading workers into working overtime is called evasion of the law.
		Mr. Nishio, you actually argued as if writing code for company use on holidays in your personal name without being directed to do so did not constitute labor, did it not? Companies have the responsibility to manage their employees' labor, and inducing them to work on holidays based on such a misunderstanding is a problem in itself!
	nishio I retract my statement that could be interpreted as "0% probability that it is labor" as it was an error, but I don't think it is also appropriate that you are making a statement that could be taken as "100% probability that it is labor". And I don't think we can reach a conclusion without specifying the specific case.
 Kazuho: I think "too likely to be considered evasion of the law" is a correct understanding of labor-related laws that view the company as a regulated entity.
 nishio: I don't agree with you there, but for now, can we just say, "Since there are such opinions, let's let it be known that employees should not work service overtime or service holidays"? Any ideas on how to keep employees happy and writing code?
 Kazuho: I would like the company to keep in mind that employees should not unknowingly work overtime when implementing the OSS guidelines, as this will lead to risk management for the company and protection of workers in society as a whole, I think it would be beneficial for the employees themselves to understand labor management.

---- Discussion on Twitter (2018-09-08)
[Twitter https://twitter.com/kazuho/status/1038311579844898816]
	Kazuho Oku: If the company defines "work" as company business and "personal works" as outside of business, it might be possible to claim that writing OSS code used by the company on Sundays is a hobby and not labor (or so I would argue), but it would still be a labor-management issue. I think it's a concern that the lack of distinction as a copyrighted work would increase the labor management ambiguity even more.

[Twitter https://twitter.com/kazuho/status/1038315661577994240]
	Kazuho Oku: I don't think a white company that pays its employees well should have labor management practices that discourage employees (I want to work freely), but I think white companies are also required to comply with the law (even if it is a bad law).

[Twitter https://twitter.com/nishio/status/1038307892254789634]
	Talking about labor management, the Sunday commitment to a hobby project is also a hobby, so it has nothing to do with labor management. There is no command and control from a superior or other person over that Sunday activity.
	Kazuho Oku: If there is an instruction that says, "I want this function by Wednesday," and you do it on Sunday as a personal work, shouldn't that be recognized as labor?　If it was done as a company work, it clearly is, and if it is exempted depending on whether it is an employee work or not, I think it could be considered as an evasion.
	I don't disagree that it is labor in that case, but even in cases where there is no writing of code or other creation of works (answering phones, standing by to respond to problems), labor can occur by order, so I think this is a completely different layer from the copyright discussion.
	Kazuho Oku: At the very least, I think it will be necessary from the standpoint of legal compliance to give proper instructions that "work should not be done outside of work hours" (even if it is a commitment to a personal hobby OSS). And it might be a bit annoying to lose the distinction of recognition of work or not with the attribution of copyright... And.
	I agree with you, "Don't work outside of work hours," and "If you do, report it properly. On the other hand, if the work is not a program work, the conditions for being an employee work are different, so I think it is unjust to use the attribution of copyright as a dividing line between whether the work is an employee work or not.
	Kazuho Oku: Yes. I am assuming that the program is a copyrighted work, but I am sure that there are points that are difficult to use otherwise, and I am sure that there are arguments as to whether it is really acceptable to insist on the separation of copyright ownership of the program.
