Examples of Editorial Proposal Rejections
[* Rejecting a proposal to revert additional text due to lack of space, and gradually cutting out surrounding text to generate space].
Original text ([The Art of Intellectual Production of Engineers] p.128)
> As of this writing in 2017, there is a large difference in the quality of Wikipedia articles between the Japanese and English versions. If this effect raises the assumed level of knowledge of books written by English-speaking authors, the cost to Japanese people of reading and understanding those translations will be higher. Whether the Japanese will be forced to learn the basics from the English Wikipedia, or whether machine translation will fill the gap, I do not know.

Editor's Comment.
>Ikeda: "I don't know whether the Japanese will be forced to learn the basics from the English Wikipedia or whether machine translation will fill the gap." I have received the addition of "I don't know whether machine translation will fill the gap or not. Would it be okay if I don't include this one?

Revision of the west tail (annex and delete the paragraph in front)
	before
		> Whether or not the reader has the knowledge the author assumes also has a significant impact on how the book is read.
		> In this book, "The Intellectual Production of Engineers," we refer to various books and concepts, but we make an effort to explain the contents of those books as concisely as possible so that the reader can understand them without having to read the books. On the other hand, we assume that the reader is a software engineer, so we do not explain the very basics of software engineering.
	after
		> Whether or not the reader has the knowledge that the author assumes will also have a significant impact on how the book is read. In this book, "The Intellectual Production of Engineers," when we refer to concepts introduced in other books, we explain the content of those books so that the reader can understand them without having read them. On the other hand, we do not explain the very basics of software engineering.
	before
		> I suspect that the appearance of that type of service will raise the level of knowledge that readers assume they know when a new book is > written.
  > So the author thinks, "This is something that can be easily found by searching the Internet without having to devote paper space to explain it.
	after
  > I believe that the appearance of informational services raises the level of knowledge expected of the reader, as the author thinks, "This is something I can easily find out by searching the Internet without having to devote paper space to explain it.

Nishio's comment
>I think this will work. I think this will work.


[* Rejects proposed particle modification and rewrites in if-then format].
Original text (p.52)
>- Make a "project" that has multiple "specific actions to take next".
>- If the "next concrete action to take" can be done in less than 2 minutes, do it now.
>- Leave the "next specific action to take" that you should not do yourself to someone else and put it on the waiting list to be contacted.
>- Write on the calendar what "specific actions to take next" should be done at a specific date and time.

Editorial comment
>"Specific action to be taken next" can be done in less than 2 minutes.
> ↓
>"Specific actions to take next" [in] 2 minutes or less.
> 
>"Specific actions to take next" that you should not do yourself.
> ↓
>"Specific actions to take next" [in] what you should not do yourself.
> 
>"Specific actions to be taken next" to be done at a specific date and time.
> ↓
>"Specific actions to take next" [in] what to do at a specific date and time.

Correction of Nishio (rewritten in if-then format)
>- If there is more than one "specific action to take next", make it a "project".
> - If the "next concrete action to take" can be done in less than 2 minutes, do it now!
> - If you are not the one to do the "next specific action to take", leave it to others and put them on the waiting list to be contacted.
> - If it is a specific date and time to do the "next specific action to take", write it on the calendar.

Nishio's thoughts
The intention of "If the next concrete action that can be taken in less than two minutes, do it now" was "If [the next concrete action] can be taken in less than two minutes [*, then do that action] now," but to change it to "If [the next concrete action] can be taken in less than two minutes [*, then do it now]" means that "[* The reason for such a misinterpretation is that the original sentence was poorly written, and the wording should be revised to clarify the intent of the if-then rule.


I have a feeling that there were more interesting examples, but going through the Gitlab changesets one by one was more tedious than I expected.
