Scrapbox Pseudo-Multiplayer Projects
[https://gyazo.com/47ebd2e89973015b191bc291eab95339]
	Many of the people crunching output on public Scrapbox projects are "one-person projects".
	There is some useful information here and there on individual projects, and there are indications that it would be interesting if they were well connected.
	Maybe they are not on board with "let's create a joint project and do it there" (more discussion on why this is).
	I sometimes wish Scrapbox had a "serendipity feature between projects".
 	but it creates dependencies between "projects" that could have been considered "independent" until now.
		In the first place, it seems to be a rare case that this functionality is needed, so it is not a priority to devote development man-hours to it.

	How about crawling the public project periodically (like once a day) and automatically reprinting it in the private project (PP)?
  [機械がScrapboxを読む]
  [scbot]

 Invite the author of each public project to PP
 	It doesn't matter if you participate or not.
  Since automatic reprinting is reproduction, is it important to explicitly tell them and make it look like you have permission to do so?
  	I suppose if the members of the private group are small enough, you could say "it's a reproduction for private use," but the boundaries are blurred and it's better to get the author's permission.
   If you make the private group only for yourself, you can experiment without permission, so you can try it that way first.

 Better if there is a mechanism for authors to know when their writing has been reprinted on PP and then edited.
 	Include the project name in the title when reprinting.
  変更通知をSlackに流す
  You can find out by searching Slack with your project name.
  Is there a better way...
  A bot that watches Slack notifications and assigns those that meet certain criteria to individual channels
  Or a bot to throw on Twitter at least once a day.

 If there is an update at the main site after it has been reprinted on PP
  If there are no updates in PP, simply overwrite...
  Marge?
  Keep old ones with dates?
  Create a diff page?

