36th Agreement
[Article 36 (Overtime and Holiday Work)
>(2) In the event that an employer has made a written agreement with a labor union organized by a majority of the workers at the workplace concerned (in the case that such labor union is organized) or with a person representing a majority of the workers (in the case that such labor union is not organized) and notified the relevant government agency of such written agreement, the employer shall not be liable for the working hours set forth in Articles 32 through 32-5 (hereinafter referred to as "working hours" in this Article) or Article 40. Article 32 through Article 32-5 or Article 40 (hereinafter in this Article referred to as "working hours") (hereinafter in this Article referred to as "working hours"), or the holidays referred to in the preceding Article (hereinafter in this paragraph referred to as "holidays"). (2) Notwithstanding the provisions of Article 32-5 through Article 32 or Article 40 (hereinafter referred to as "working hours" in this Article) or the day off set forth in the preceding Article (hereinafter referred to as "day off" in this paragraph), the working hours may be extended or employees may be required to work on a day off pursuant to the provisions of such agreement. However, the extension of working hours for belowground labor or other work especially harmful to health as defined by Ordinance of the Ministry of Health, Labour and Welfare shall not exceed two hours per day.
[nishio.icon]Only allow overtime or holiday work when certain conditions are met.

Chapter IV Working Hours, Rest Periods, Holidays, and Annual Paid Leave
> (Working hours)
> Article 32 An employer shall not have a worker work more than 40 hours in a week, excluding rest periods.
> ○2 An employer shall not have workers work more than eight hours a day for each day of the week, excluding rest periods.
> Article 32-2 Notwithstanding the provisions of Article 32-2, when an employer has stipulated, by a written agreement with a labor union organized by a majority of the workers (in the case that such labor union is organized) or with a person representing a majority of the workers (in the case that such labor union is not organized), or by rules of employment or other equivalent, that the average weekly working hours shall not exceed the working hours stipulated in paragraph (1) of the preceding Article for a certain period within one month, the employer shall, in accordance with the stipulations of Article 32-2, notify the workers of the working hours stipulated in the said paragraph or on the specified days. (2) Notwithstanding the provisions of the preceding Article, in the event that the working hours per week averaged over a fixed period of time within one month do not exceed the working hours stipulated in paragraph (1) of the preceding Article, the employer may have the workers work in excess of the working hours stipulated in the same paragraph during a specified week or the working hours stipulated in paragraph (2) of the same Article on specified days, in accordance with such stipulation.
> ○2 The employer shall notify the agreement set forth in the preceding paragraph to the relevant government agency in accordance with the provisions of Ordinance of the Ministry of Health, Labour and Welfare.
> Article 32-3 With respect to a worker whose starting and ending time of work is left to the worker's decision by rules of employment or other equivalent, an employer may, when the employer has a labor union organized by a majority of the workers at the workplace concerned (in the case that such labor union is organized), or when the employer has a labor union organized by a majority of the workers at the workplace concerned (in the case that such labor union is not organized), make a written agreement with a person representing a majority of the workers and stipulate the following matters (2) If the following matters are stipulated in a written agreement with a labor union organized by a majority of the workers at the workplace concerned, or with a person representing a majority of the workers if there is no such labor union, notwithstanding the provisions of Article 32, to the extent that the average working hours per week during the period stipulated in such agreement as the liquidation period in item (ii) does not exceed the working hours stipulated in paragraph (1) of Article 32, (2) Notwithstanding the provisions of Article 32, a worker may be required to work in excess of the working hours set forth in paragraph (1) of Article 32 in a week or in excess of the working hours set forth in paragraph (2) of Article 32 in a day.
> (i) Scope of workers who may be required to work according to the working hours pursuant to the provisions of this Article
> (ii) A period of settlement (a period during which the average weekly working hours do not exceed the working hours set forth in paragraph (1) of Article 32, limited to a period of one month or less; the same shall apply in the following item). The same shall apply in the following item)
> (iii) Total hours worked in the liquidation period
> (iv) Other matters specified by Ordinance of the Ministry of Health, Labour and Welfare
> Article 32-4 When an employer has stipulated the following matters in a written agreement with a labor union organized by a majority of the workers at the workplace concerned (in the case that such labor union is organized) or with a person representing a majority of the workers (in the case that such labor union is not organized), the employer shall, notwithstanding the provisions of Article 32 Notwithstanding the provisions of Article 32, if the working hours per week do not exceed 40 hours on average during the period specified in the agreement as the period covered by item (ii), and the number of working hours per week does not exceed 40 hours, the employer may, in accordance with the provisions of the agreement (including the provisions of the following paragraph, if such provisions have been stipulated in accordance with the provisions of the following paragraph), employ the specified number of workers. (2) The working hours of a worker may exceed the working hours stipulated in paragraph (1) of this Article in a specified week or the working hours stipulated in paragraph (2) of this Article in a specified day, in accordance with the provisions of the agreement (including the provisions of the following paragraph in the event that the agreement stipulates otherwise).
> (i) Scope of workers who may be required to work according to the working hours pursuant to the provisions of this Article
> (ii) The subject period (a period during which the average weekly working hours do not exceed 40 hours, and limited to a period exceeding one month but not exceeding one year. The same shall apply hereinafter in this Article and the following Article)
> (iii) Specified period (meaning a period during the subject period when business is particularly busy. The same shall apply in paragraph (3))
> (iv) Working days and working hours for each such working day during the applicable period (in the case where the applicable period is divided into periods of one month or more, working days and working hours for each such working day during each of the periods according to the said division to which the first day of the applicable period belongs (hereinafter in this Article referred to as the "first period"), and the number of working days and total working hours for each period excluding such first period) (i) the number of working days and the working hours for each such working day in each period (excluding the first period), and (ii) the number of working days and the total number of working hours in each period excluding the first period).
> (v) Other matters specified by Ordinance of the Ministry of Health, Labour and Welfare
> (2) When the agreement set forth in the preceding paragraph classifies the working days and total working hours for each period except the first period, the employer shall, at least 30 days before the first day of each period, obtain the consent of the labor union organized by a majority of the workers at the workplace concerned (in the case that such labor union is organized) or, if there is no labor union organized by a majority of the workers, a person representing a majority of the workers. (2) If a workplace has a labor union organized by a majority of the workers, or if there is no labor union organized by a majority of the workers, a labor union representing a majority of the workers shall, with the consent of a person representing a majority of the workers, determine the working days in each period not to exceed the number of working days concerned and the working hours per day in each period not to exceed the total working hours concerned, pursuant to the provisions of the Ordinance of the Ministry of Health, Labour and Welfare. (2) The number of working days and working hours shall be determined in accordance with the Ordinance of the Ministry of Health, Labour and Welfare.
> 3 The Minister of Health, Labour and Welfare may, after hearing the opinions of the Labor Policy Council, establish, by Ordinance of the Ministry of Health, Labour and Welfare, limits on the number of working days in the applicable period, daily and weekly working hours, and the number of consecutive working days in the applicable period (excluding the period specified as the specified period in the agreement under paragraph 1) and the period specified as the specified period in the agreement under paragraph 1. 
> ○4 The provisions of Article 32-2, paragraph (2) shall apply mutatis mutandis to agreements under paragraph (1).
> Article 32-4-2 In the event that an employer has a worker work more than 40 hours per week on average over the period of the subject work period, with respect to a worker whose work period under the preceding Article is shorter than the subject work period, the employer shall not work such excess hours (excluding hours extended pursuant to the provisions of Article 33 or paragraph (1) of Article 36, or hours worked on holidays). (excluding hours worked on holidays or extended hours pursuant to the provisions of Article 33 or paragraph (1) of Article 36) (2) In the event that an employer has a worker work in excess of 40 hours per week on average, the employer shall pay premium wages in accordance with the provisions of Article 37 with respect to the hours worked in excess of 40 hours (excluding hours extended pursuant to the provisions of Article 33 or paragraph (1) of Article 36 or hours worked on days off).
 (2) Notwithstanding the provisions of paragraph (2) of Article 32, when there is a written agreement with a labor union organized by a majority of the workers (in the case that such labor union is organized) or with a person representing a majority of the workers (in the case that such labor union is not organized) at the workplace concerned, with regard to workers who are engaged in businesses in which the number of workers regularly employed is less than the number specified by Ordinance of the Ministry of Health, Labour and Welfare (2) Notwithstanding the provisions of paragraph (2) of Article 32, a worker may work up to 10 hours per day.
> ○2 In the event that an employer has a worker work pursuant to the provisions of the preceding paragraph, the employer shall notify the worker in advance of the working hours for each day of the week to be worked in accordance with the provisions of Ordinance of the Ministry of Health, Labor and Welfare.
> ○3 The provisions of Article 32-2, paragraph (2) shall apply mutatis mutandis to agreements under paragraph (1).
