spontaneity
[Spontaneity cannot be coerced.]
	[Darb bind] Following orders to "do it voluntarily" is not voluntary.
 You can't give initiative to employees who don't have it.
 It is easy to crush the spontaneity of self-motivated employees.

-----
reverberation
[Twitter @garyu https://twitter.com/garyu/status/1055616293628338177]
	>"How to motivate" is often discussed in management-related texts, so I was surprised to see that it says, "You can't make an unmotivated employee be self-motivated. I wonder if they would start to move spontaneously if I gave them an appropriate frame of reference or set them goals that are within their reach.
 	[nishio.icon]Is that your image of "spontaneity = [motivation]"? My image was "spontaneity = the will to set goals by oneself.
  	>What I had in mind was about "spontaneously thinking and doing what is necessary to achieve a goal". When you are young, you are often given goals (goals) rather than thinking about them yourself.
   > It seems that Mr. Nishio's idea of "spontaneity" was the bigger one.

In my image, "spontaneity" means "setting one's own goals and taking action," so if someone else says, "Do this or do that," at that point the condition of "by oneself" is no longer satisfied.

The mental model that "when you are young, goals are often given to you" may itself undermine spontaneity.
	Although both finding a job at a company and starting a business exist as options, setting a goal and acting as if "finding a job is a given" under the influence of the voices of others around you, etc., is a state of no initiative.
 Even after getting a job at a company, whether to stay at the company, change jobs, or become independent, and whether to do or not to do what the boss, a stranger, tells you to do, are all options that exist.
 [example of living one's life because of age 30].

	If you recognize that there are multiple options and choose among them according to your values, well, "spontaneous".
	But if the question "Are there other options than the one I see now?" does not arise, and I am choosing from only the options I see, it does not look good if those options are controlled by someone else.

	On the other hand, there is no such thing as a "person who is completely unaffected by the opinions of others," so "spontaneous/unspontaneous" is a gradient
-----

[related Overwhelming sense of ownership].
[spontaneous action] [spontaneous] [spontaneous learning] [spontaneously teach others]

[How do you know what your options in life are?]
