Company Mental Models, Evaluation Systems, and Engineer Learning
The discussion evolved from whether it is right or wrong to learn something during work hours that is not directly related to work.

This tweet cleared my head a bit.
 [Twitter tkihira https://twitter.com/tkihira/status/1040262233396326402]
 >Most companies in the world evaluate employees based on output ≒ performance, so in order to incorporate study time into work hours, you have to change the evaluation system. Cybozu evaluates the market value of each employee, so even if study time is incorporated into work time, if the employee's market value can be increased during study time, the evaluation will be positive. This is my understanding.
 [Twitter tkihira https://twitter.com/tkihira/status/1040263125197643776]
 >If you think, "As long as I get results, it's okay, right? If you think like that, you will lose your evaluation at Cybozu without mercy. I learned a lot more from the message that raising one's market value is essential for engineers to survive in this world, and that the company encourages this.

There are two types of mental models of a company.
	Mental model of the existence of a "company."
	Mental model of "[there is no Mr. Company]."
		=The company is not the subject, but the people who have gathered there.
		[Campfire-type organization]

The former mental model says.
	Tend to think "I give the results OR time to the company and receive payment for it."
 With this approach, "It's not right for the company to pay me for using my time for my own studies, is it?
 Because they see themselves and the company as separate.

The latter mental model.
	Salaries are not paid for anything.
 The person is paid [basic income] for "being there."
 How much to pay depends on the value of the individual.
 	Market value and other factors are used to calculate this value.
	Since a company is an aggregate of people, an increase in the value of its people is an increase in the value of the company.
		So learning is encouraged.

[https://gyazo.com/473fe7dcce2ede55e6354f25bd5a1360]

>The model "workers do not have the means of production, so they sell their labor to a company (capitalist) that has the means of production and get paid for it" does not hold true for intellectual workers.
	Because [intelligent workers own the means of production

>I thought it would be a good idea to have the company and the individual's goals be in harmony, like Google's [OKR], and to have them [mix public and private] in a good sense. [harajune https://www.facebook.com/nishiohirokazu/posts/10216336390378914?comment_id=10216336692306462&comment_tracking=%7B%22tn%22 3a%22r%22%7d]

-----
Things that I had started to draw and then put to sleep because I thought something was a little different.
Two types of mental models for the company

[https://gyazo.com/fdc1ba7170e2493cf1d13b05daac97b7]

View the company as a "temporary phenomenon of people who share the mission" like a campfire or festival.
When I was drawing this diagram, I wasn't aware of the cut-off point that the evaluation system was different in the first place.
I was also trying to include in the picture parallel work, shorter working hours for childcare, etc., and the company's [blurring of boundaries] might be related to the #blurring of organizational boundaries.
