視覚剥奪実験2018-09-16
I put on a steamy eye mask.
I thought about what entertainment I could do with the loss of [my] vision.

	The move to turn on Netflix and listen to audio only is impossible to turn on and then operate the remote control to get to playback.
 	Wife: "There are some modern TVs that can play Netflix videos via voice input."
 Wife: "You should listen to the radio."
 	OK Google, play TBS radio.
  One shot success
 It's very easy to localize the room when the radio is playing.
 I opened the refrigerator and really wanted to take out the konjac jelly, but I couldn't find it, so I drank a paper carton of juice.
 I can go to the bathroom, do my business, and come back with no problem.
 	I knew I could do this because I've experimented with doing this before while wearing a VR headset.
 I tried to find my iPhone and said "Hey Siri" and my MacBook responded.
 	Wife: "That's a MacBook."
  I was looking for an iPhone, not realizing it was a MacBook.
  Wife: "Isn't that by the bed?"
  Discovering the charging cable by the bed by tactile sensation and following it to find the iPhone
 When I talk to my iPhone and say "Hey Siri," both my MacBook and both respond.
 	You can't tell if the iPhone in your hand has responded unless you can see it.
 	I did Siri activation with a long press of the home button.
  The home button is a physical button, so I can tell by touch, but I wonder what they'll do when it's gone.
 Attempts to use Siri to post to Twitter or Facebook, but "I don't know" or "I can't help you."
 	Maybe you can set something up in advance.
  I can't read the responses where I could post them.
 Wife: "I thought you could have it read to you in the accessibility settings."
 	If you talk to Siri and say "accessibility" it responds with a click, but you can't see it, so there's no way to set it up.
  Subsequent Notes
  	It is possible to use [VoiceOver] in Accessibility to have it read out loud on tap.
			Notifications can also be changed to read out loud settings.
   To set up a person with sudden vision loss alone, talk to Siri and say "VoiceOver ON".
 If you could post it on Twitter or Facebook, you wouldn't notice any comments on it.
 	Must be set to read out notifications
  Wife: "Isn't there some sort of tweak or comment reading feature?"
	  [Support - Tweeps: I want to use the read-out feature on PC delivery https://ssl.twitcasting.tv/indexsupport.php?pid=2525]
			I don't understand the process of losing your sight and then starting tweaking so people can see you.

	Google HomeからIFTTT経由でTwitter/Slackに投稿している人はいる
 	[I tried using IFTTT to post to Twitter and Slack via voice input from Google Home Mini - life cliff http://sarukichi7.hatenablog.jp/entry/2017/12/06/193000]
  
