Seafood Mixed Paella
https://cookpad.com/recipe/4566199
	This explanation doesn't make any sense at all, why?
 	Some implicit steps are skipped without mention
  	People with limited culinary experience can't compensate for that in their brains.
  There is a lot of extraneous information in the book and it's hard to tell what is noteworthy.
  	I was so focused on useless information like "green far away" and "type A, type O" that I missed the noteworthy "20 minutes after boiling" and "change to low heat after closing the lid."
   Maybe it's better to extract and organize information in advance that can easily lead to catastrophe if it's wrong, like the heat level.

A version rewritten to make it easier for me to understand
 wash one's hands of
	Check to see if the work space is tidy, and if not, clean it up.
 arrange materials
 	In our case, we put in a whole bag of seafood mix.
  	It has been experimentally confirmed that it is more than the amount, but it is okay.
  	They say if you leave it halfway, it's a pain in the ass to deal with.
  Vegetables are also available in a frozen mix of grilled vegetables, so use that.
  	They say vegetables are just fine.
   You can add extra komatsuna or something else.
   You can chop shriveled carrots and add them in.
   About a cup in a medium bowl, and the amount is said to be just right.
 Place oil and garlic in a suitable frying pan.
 	2 tablespoons of olive oil
  I have a tube of garlic, so I put it in just the way I like it.
  	Appropriate means about 3 cm plus or minus 1 cm.
	Add vegetables and seafood mix.
 Turn on the fire, turn on the exhaust fan.
 I mix it up a little because I don't want the top of the frozen food to melt.
 	No need to mix vigorously.
 Wait until about half melted.
 	Don't wait until it's all melted, it'll cook later.
  Measure the next material while waiting.
  400 cc of water
  2 cups of rice
  	Two cups means two cups of rice, which is the cup in the bag of rice, and two cups of rice that has been grated
  You need 1.5 tablespoons (15 ml) of chicken broth, but tablespoons don't fit in the jar, so measure 4.5 teaspoons (5 ml).
	Smells good when about half melted.
 Add rice, water and chicken broth.
 	Mix rice to correct unbalanced conditions.
 Wait until it boils.
 	Boiling" means bubbles rise to the surface from the bottom of the water.
  No need to wait until the whole thing is wobbly.
 When it boils, change to low heat (2 in the memory of the induction cooker).
 Add bay leaves.
 	If you forget to include the bay leaves, no big deal.
 shut the lid
 Start the timer for 20 minutes
 Wait 20 minutes
 	During this waiting period, you can wash the dishes and other items you used.
  Wash the cooking spoons, especially those used to stir the pot, so they can be reused for serving later.
  You can start clearing the dining table, etc.
 After 20 minutes, turn off heat and exhaust fan.
 Remove bay leaves.
 	If you forget to do this and put cheese on it, the bay leaves will be covered in cheese.
 Remove shredded cheese from freezer and sprinkle some amount of cheese over the whole mixture.
 	This "to some extent" means that the cheese is present in a generally scattered manner to the extent that there are no areas the size of a ten-yen coin without cheese. There is no need to place cheese until nothing but cheese is visible. It is not necessary to put cheese until nothing but cheese can be seen.
 Cover and wait until cheese melts, about 5 minutes.
 	This is not waiting for the cheese to melt.
 	 Wait because rice needs to be steamed after cooking.
  	So even if there was no cheese, we need to wait.
		Clear the dining table and make it ready for eating.
 Divide into bowls and bring to the table
  0.5 cups in four equal parts
 Put out black pepper and salt.
 eat
 wash dishes after eating
 Wash frying pan too.
	By the time you're done, the heat is off, so dish up the extra and wrap it up.
 	Immediately after washing, dishes are wet and need to be wiped with a cloth.
 Make room in the refrigerator for dishes.
 Put the plate in the fridge.
