How engineers learn
Article written as a special project for [Gijutsu Hyoronsha] WEB+DB PRESS Vol. 80, released on 2014-04-24.
[available on the Technical Review website at http://gihyo.jp/lifestyle/feature/01/engineer-studying].

The introductory article I wrote for Hatena Diary at the time [I wrote "How to Learn to be an Engineer. http://d.hatena.ne.jp/nishiohirokazu/20140427/1398524475], reprinted at:.
---
Vol. 80 itself was released in April, so it was titled "Welcome Newcomers! and "How to Learn to be an Engineer" is also intended for readers who will be working or going to school in April. How to Learn to be an Engineer" is also intended for readers who will be working or going on to higher education in April. However, we are sure that the contents will be useful for other people as well.

What inspired me to write this article was a column in my book "[The Art of Supporting Coding]," which was also a bestseller. I was asked to write a column because I had some extra space, and I wrote several columns about how to learn.

 p. 23, "[To confirm understanding,] output first."
 p. 26 "[Why I don't know what to learn]"
 p. 79 "[Concrete and abstract knowledge]"
 p. 80 "[chewing]"
 p. 82 "[Nibbling from where needed]"
 p.134 "[Gripping roughly and gradually detailing]"
 p. 235 "[Transcribing from one end to the other]"

This column has been very well received and praised by many people. For example, an Amazon reviewer wrote

>The columns that are not directly related to the purpose of this book were especially excellent for me.
>"What to do when your mind is overwhelmed by the vast amount of information" is the prescription, albeit a short one.
>This column alone was worth the price of the book (at least for me).

I am very happy to receive your evaluation, but actually, as the author, I am not satisfied with the results. In order to fill the margins of the column, I had to cram in a limited number of words, so I had to cut some parts out. In addition, because the columns were published in bits and pieces, some "connections" were inevitably sacrificed.

We were able to write 17 pages on this subject in this special issue of "How Engineers Learn". Here is the table of contents:

 [How to learn efficiently] --- [3 axes of knowledge] and [3 phases of learning]
 [How to take the first step] --- [Learn where you need to go], [Get the big picture], [Scripture].
 [How to understand deeply] --- [Comparison], [Learning from history], [Learning by making]
 [What to Learn], [What to Create] --- [How to Find Problems] and [How to Achieve Results].

If you compare this to the columns in "The Art of Supporting Coding," you will see that the knowledge is connected to each other in a network. The chapter "How to Understand Deeply" is less connected to the columns, but it is in harmony with the first chapter "[How to] Learn a Language Deeply and Effectively" in "The Art of Supporting Coding."

In other words, this special project, "How Engineers Learn," is "the art of learning that supports 'the art of coding. Although "How Engineers Learn" is written in such a way that it is safe to read by itself, it is even better when read together.

We hope you enjoy it. Thank you for your continued support.
---
[How [Engineers] Learn: Efficiently Gaining [Knowledge] and Tying It to [Results]: Special Feature｜gihyo.jp ... [Gijutsu-hyoron-sha].
[2014-04-24 #2014 #04-24 #2014-04