Add 2 to the denominator and 1 to the numerator
	The distribution of the two sides of a coin (independent trials that produce a table with probability p) is called the "[Bernoulli] distribution".
 The [conjugate prior] ([prior distribution] convenient for [Bayesian update], Kyoyaku~) of the Bernoulli distribution is the [beta distribution].
 The probability distribution after an observation is made is called [posterior distribution].
 	Bayesian, it can be derived from the prior distribution and observed facts by calculating it using [Bayes' rule].
 The estimation method in which the [mode] of the posterior distribution is chosen as the [estimate] is called [MAP estimation] ([maximum a posteriori probability estimation]).
 There is no reason why the mode should be chosen as the [point estimator] when a distribution is obtained, so it can be estimated by [mean value
 [The mode of the beta distribution is
	 [https://gyazo.com/56a931b048b951464e9fdc9c819e3ec2]
 The mean ([expected value]) is
 	[https://gyazo.com/4f515d445ece206476f50d00a3351c33]
	Beta distribution becomes [uniform distribution] when α=β=1.
 when the prior distribution is a beta distribution B(α, β),
 	After one observation of the table, the posterior distribution becomes B(α+1, β)
  The posterior distribution after one observation of the backside is B(α, β+1)
 So, after first assuming a uniform distribution as the [uninformed prior distribution] and then observing the front side A times and the back side B times, the probability p of getting the front side is
  Mode A/(A+B)
 	Average (A+1)/(A+B+2)
 That is, [MAP estimate] is [sample mean
 	In this case, for example, when a coin is tossed only once and a table is observed only once, "This coin will turn up with probability 1!" and estimate
  This kind of conclusion is not good ([overlearning]).
  So we'll use the mean of the posterior distribution, which gives more moderate results.
  	On average, I would estimate that "this coin has a 2/3 chance of showing up".
  Converges to the same value as [sample] number increases
	For this reason, the estimation method "add 2 to the denominator and 1 to the numerator" is used when estimating p for the Bernoulli distribution