Arrange them side by side for better listing.
[https://gyazo.com/cc9dc5e11269e9d6c6917034ecd441de]
	[Slide https://www.slideshare.net/nishio/03-1-kj] < [03 1 Structuring Fragmentary Information_Frontal and Actual KJ Method Flow] < [Designing Learning Methods]
	I couldn't find just the right picture, lined up on the edge, open in the middle.
	　This photo shows approximately 100 sticky notes arranged in a row for better listing.
	　The slides are illustrated with a time series of photos.

context
	P150 [(5.2.1) Arrange them in a row for better listing], it would be better to have a diagram showing how much volume would be generated if they were arranged in a tight row.
	On p. 152, in [(Column) Size of the labels], it says
		>This size of fusen, when placed side by side on an A4 sheet of paper, can hold 25 sheets.
	On p. 172 [(5.3) Tuning for Working People], it says
		>As a countermeasure, I put them on A4 paper. At the first stage of spreading them out and looking at them, I paste them on A4 paper in a tight line. If I am using 50mm x 38mm labels, I can put 25 labels on an A4 sheet of paper. If there are 100 labels, then 4 sheets of A4 paper will be filled with labels. Let's call this a list paper.
		This is a story about "putting it on paper for easy storage so it doesn't have to occupy a desk or whiteboard for a long period of time.
		Easily create a listable state of 100 stickies by putting 25 on each of 4 A4 sheets of paper, and easy to put them away.
	Original idea
		>If I use 50mm x 38mm sticky notes, I can line up 56 sticky notes on an A3 sheet of paper.
   [https://gyazo.com/18f3da6f75a98e9b733ffc2a552dbd1a]
 	A3 or A4 is fine, but now A4
 	　Early on, they actually used A3 paper, but A3 was too cumbersome, so they stopped.
 			Cumbersome to have to fold once for storage
 			Problem of sticking too close to the crease and getting caught when folding.
 		I have even tried [KJ method with folders] as an earlier step of this, which was also not good.
	Where to put it.
		P.150 was the inspiration, but it is disputed whether it should be in this location

draft
 [https://gyazo.com/e1682087b82652f92830cc024eba55d9]
  56 sheets of A3 paper

from [proposed additions to p. 150 - p. 168, Intellectual Production of Engineers].
Proposed additions to p. 150, The Intellectual Production of Engineers
#Engineer's Intellectual Production_Additions