Project Management
PMBOK] is a well-known textbook for project management in general
	This is quite voluminous, so it's quite a challenge to follow it in detail.
	There is much to gain from the table of contents alone.
 Anyone interested in project management or wanting to make some arguments against management should look through the table of contents.
 What I once noticed through my eyes
 	For me at the time, project management was not about large numbers of people, but implicitly assumed to be mainly about my own personal or a few people's projects.
  	This depends on the situation I was in at the time.
  I didn't even realize the need to secure [human resources], analyze [stakeholders], etc.
		There is also a significant difference in the quality of management between projects that have clear deadlines and lines of achievement and those that do not.
  	In the case of in-house developed software, this restriction is not so strict and management is relatively easy.
   On the other hand, in the case of contract work, there are clear deadlines and clear lines of achievement.
   How to proceed with an uncertain project under these circumstances is a very difficult issue, and the discussion of this issue is the main focus of project management.

	Specifically.
 	Information at a glance
  No oversights should exist.
  Being able to notice differences.
  The ease of noticing things that do not exist.
 These features are required

----- voice input
I think there's a lot to be gained from reading 6 O'clock alone, but if you're interested in project management and want to keep some sort of record of your management, you might want to look through 6 O'clock. I think that if you are interested in project management and want to keep some kind of record of your management, you might want to read through 6 O'clock.

he human resources and stakeholder analysis.
In addition, there is a significant difference in the quality of management between projects that have clear deadlines and lines to be achieved and those that do not. In the case of in-house developed software, management is relatively easy because these constraints are not strict, whereas in the case of housing projects, there are clear deadlines and clear lines to be achieved. Under these circumstances, projects with uncertainties can be difficult to manage.
How to proceed with a project with uncertainty is a very difficult task, and the discussion about it is the main focus of project management in Tokyo.

Specifically, the listability of information, the absence of oversights, the ability to notice differences, and the ease of noticing what does not exist are required.
