intellectual production
>When you say "learn," don't you have the implicit image that knowledge is outside of you and you take it into yourself? However, knowledge that is outside of you, e.g., knowledge in textbooks, is "knowledge that someone has already created and circulated. Since knowledge can be replicated, at the time the knowledge is circulating, there will be a number of people who already have that knowledge. This means that even if you take outside knowledge, that knowledge is unlikely to lead to [differentiation].
>On the other hand, knowledge that is generated as needed in the field of actual application is highly valuable knowledge that is not in circulation and fits the situation in the field. In other words, the source of value is not the possession of knowledge, but the ability to create new knowledge. This would seem obvious if we consider a concrete example. Memorizing what is written in a programming textbook is not a source of differentiation; the source of value is the ability to create new programs in response to situations. It is natural, isn't it? This concept of "the ability to create is the source of value" applies to areas other than programming as well.
[Intellectual Production of Engineers] p.243 [(7.3) Creating Knowledge].

Intellectual production is [the creation of knowledge].
　This "knowledge" is an abstract concept and needs to be made more concrete.
 　Knowledge in textbooks is "knowledge that is already in circulation.
 　　[Better to learn than not to learn], but such knowledge is [replicable], so it's hard to [differentiate].
 　Knowledge produced in the [applied] field is highly valuable.
 　　So there is value in "creating knowledge for the situation".
 　[Knowledge is outcome-focused information] (Drucker)
 　Knowledge must be proven by deeds.


---
[Definition of intellectual production and the "mindset" that emerges from it | shigotano! https://cyblog.jp/2888]
Neatly organized article on intellectual production
	I found it by searching for "intellectual production."

>Intellectual production is the process of submitting something new - information - in a form that can be understood by others, using the mind.
	[Technology of Intellectual Production] p.9
	element (e.g. in array, in programming, in programming)
		use one's head
  new
  [output].
 Comparison with [Intellectual Consumption
 	[Learning alone is not production, but consumption].
  [input is not output].
 Value of what is produced
 	[Input-output balance]
　The conditions for "submission in a form understandable to others" are strictly enforced.
　　[(6.2.5.5) Public Words and Private Words]
　　 He explained that first, it is verbalized in a way that only he can understand, and then, by refining it, it becomes an expression that can be conveyed to others.


When I used to translate it with Google Translate, it was translated as [intellectual production], and I thought it didn't feel right.
	I translated it at DeepL and it became [Production of knowledge], I think it's closer.
	[(7.3) Creating knowledge]

I believe that intellectual production does not have to be defined linguistically. Same with Wittgenstein's [definition of game].
　[(5.2.4.6) Family resemblance].

I think it would be good to involve Drucker's [knowledge worker] concept.
	>Knowledge workers produce knowledge, ideas, and information
		They said roughly the same thing.

What is [knowledge]?
　Drucker explains it all in great detail.
　There it is. Here it is.
　　[There are many kinds of knowledge.]
　It's a long story, so I'll summarize.
　　Humans have improved their abilities through the use of tools.
　　Ability is enhanced not only by physical tools but also by knowledge.
　　There is merit in generating such knowledge.
　　　= Need for Intellectual Production
　　　There is knowledge that would improve our ability to generate knowledge.
　　　= Intellectual Production

[Why invest in intellectual production techniques?]
　[Supplement to Why Invest in Intellectual Productivity?]

[/villagepump/intellectual-production].
[/villagepump/intellectual production is not stoicism].
[/villagepump/what is "altitude"].
