PMBOK
>The PMBOK Guide, Sixth Edition, categorizes the 47 processes into five basic process groups and 10 knowledge areas that can be applied to a wide range of projects.
> The five process groups are as follows
	[Start-up process group
 	By obtaining authorization to initiate a project or phase,
  A set of processes executed to define new phases of a new or existing project.
 [Planning Process Groups
 	Determination of project scope and refinement of goals,
  Furthermore, it is a process necessary to specify the set of actions necessary to achieve the goals that the project is to address.
	[Execution Process Groups] : :
 	To meet project requirements,
  It is the process of carrying out the work defined in the project management plan to completion.
	[Monitoring and Control Process Groups]:.
 	It is the process necessary to track, review, and control project progress and performance, identify areas of the plan that need to be changed, and initiate those changes.
 Termination process group]:: [Termination process group
 	The process undertaken to formally complete or consummate a project, phase, or contract.

> The 10 knowledge areas are as follows
 [Project Integration Management]
 	The processes and activities necessary to identify, define, combine, unify, and coordinate the various processes and project management activities within a group of project management processes.
 [Project Scope Management]
 	The process necessary to ensure that the project includes all work required to successfully complete the project and only that which is necessary.
 [Project Schedule Management]
 	It consists of the processes necessary to manage a project so that it is completed in a given amount of time.
	[Project Cost Management]
 	The process of planning, estimating, budgeting, funding, securing financial resources, managing, and controlling to complete the project within the approved budget.
	[Project Quality Management]
 	The process of incorporating an organization's quality policy regarding the planning, management, and control of project and product quality requirements to meet stakeholder expectations.
 [Project Human Resource Management]
 	The process of identifying, acquiring, and managing the resources needed to successfully complete a project.
	[Project Communication Management]
 	Processes necessary to ensure the planning, collection, generation, distribution, storage, retrieval, management, control, monitoring, and eventual disposition of project information in a timely and appropriate manner.
 [Project Risk Management]
 	The process of planning, identifying, analyzing, planning responses, implementing response measures, and monitoring risks associated with a project.
 [Project Procurement Management]
 	The process of purchasing or acquiring products, services, or outputs from outside the project team.
 [Project Stakeholder Management]
 	Identification of individuals, groups or organizations that may influence or be influenced by the project, analysis of stakeholder expectations and their influence on the project, and appropriate management to ensure that stakeholders are effectively involved in project decision-making and execution Processes required to develop a strategy

https://ja.wikipedia.org/wiki/PMBOK
