failure
	Failure is an opportunity to learn
  It is important to learn from our mistakes
   Failure is part of my great progress
   When we fail, we gain important experience.
 No need to avoid failure.
  Don't be afraid to fail.
 People who have never made a single mistake, who have never tried anything new.
  Instead of being afraid of failure, be afraid of doing nothing.
	Failure is necessary.
 Better to fail as soon as possible.
 Gentlemen, you will fail.
  If you avoid failure, there can be no success.
 	A series of failures until success
  Success is found through a series of small failures.
 Don't be discouraged by failure.
  Failure is when you give up.
   As long as you are challenged, you will not fail.
   It becomes a failure because it stops where it fails.
   If you keep at it until you succeed, it will succeed.
   It happens with every fall.
   Don't throw it away in the process.
  	If you fail nine times, you can succeed on the tenth.
	Ten times as many failures as successes.
  Only 1% of the work I have done has been truly successful.
 Everything you do, even if it doesn't work out, will benefit you in the future.
  If the present is success, then past [failures are the foundation].
  [Failure is what makes us grow.]
 There is no such thing as failure in the world.
  I have never made a mistake in my life.
   I've made the discovery 20,000 times now that light bulbs don't glow.
   That's not a failure, it's a success because we know it doesn't work that way.
 99% fail
  The whole job is a series of failures.
  My work was a series of failures.
 1% success is what I am today.
 I really feel sorry for anyone who never fails.
 My greatest honor is not to have never failed
 Honest recognition of the causes of failure
  [Open your mind to failure and you will progress and grow at a later date.
  	If you fail, think about why and reflect on it. It will surely help you in the future.
   Open up to failure to the point where you say, "This was a very good experience. Open your mind to the point where you say, "This was a very good experience and a valuable lesson.
 It fails a lot.
 More failures than successes.
 We must overcome failure.
 This experience must enable us to be successful.
 I have made many mistakes, but I am not afraid.
 [Failure is my teacher.]
 There's another way.
 Need someone who has made mistakes and made the most of them.


-----1 primary data
	Failure is an opportunity to learn
 No need to avoid failure.
	[Failure is] necessary. In fact, it is better to fail as soon as possible. By accumulating small failures, you will find success (Tadashi Yanai).
	When you try to do something, don't be afraid to fail. If you fail and lose, think about why and reflect on it. I am sure it will help you in the future. (Ichiro)
	Work is a series of failures until you succeed. If you are averse to failure, there is no way you can succeed.
	If you fail nine times, succeed on the tenth. Entrepreneurs and managers need to be that noble. Never give up in the middle of a project (Hideo Sawada).
	I fail ten times as much as I succeed (Eikou Harada)
 Everything you do, even if it doesn't work out, will benefit you in the future (Sun Myung Moon).
 There is no such thing as failure in the world. There is no failure while you are challenging yourself. Failure is when you give up (Kazuo Inamori)
 Only 1% of the work I have done has been truly successful; 99% has been a series of failures. And the success of the 1% that bore fruit is what I am today (Soichiro Honda).
 If my present is success, then my past is all about making [failure is the foundation]. All my work is a series of failures (Soichiro Honda).
 I believe that [failure makes people grow]. I really feel sorry for people who have never failed (Soichiro Honda).
 Instead of challenging yourself and fearing failure, fear doing nothing (Soichiro Honda).
 My greatest honor lies not in never failing, but in getting up at every fall. My work has been a series of failures (Soichiro Honda).
 It becomes failure because you stop where you fail. If you keep going until you succeed, it becomes success (Konosuke Matsushita).
 Those who honestly recognize the causes of their failures and open their hearts to the point where they say, "This was a very good experience. I believe that those who open their hearts to the point where they say, "This was a very good experience and a valuable lesson learned," are the ones who will progress and grow at a later date (Konosuke Matsushita).
 You will fail. You will fail a lot. You may have successes, but there are more failures than successes. Do not be discouraged by failure. You must overcome your failures. If you fail often, you will gain important experience. With this experience, we must strive for success.
 I have made many mistakes, but I am not afraid of them. [Failure is my teacher, and failure is part of my great progress.
 It is a common occurrence in the world that there is another way even though the way seems to be in a tight spot. As long as there is time, and as long as there are people, there is no reason for the path to be in trouble.
 It is good to celebrate successes, but more important is to [learn from] failures. How a company deals with failure shows how well it can draw on the good ideas and talents of its employees and how well it can adapt to change. Every company needs people who have made mistakes and made the most of them (Bill Gates).
 A person who has never made a single mistake is a person who has never tried anything new (Albert Einstein).
 I have never made a mistake in my life. I have made the discovery 20,000 times that a light bulb does not glow (Thomas Edison).
 It's not a failure, it's a success because we know it doesn't work that way (Thomas Edison).
