Ideas and Field Metaphors
[Differences and similarities in idea fields in "The Engineer's Art of Intellectual Production" and "Hybrid Ideas" - R-style https://rashita.net/blog/?p=25755&wt=2]
	Two were independent and used the "[field metaphor]" in the process of generating ideas.

[Note the differences in similarities].
	No two metaphors were identical.
 >(Nishio) Plow the field → sprout
 >Find a seed and plant it → Roots and shoots grow from the seed
	When I saw the difference, my thought was, "Maybe I didn't use the right metaphor for Hatake."
 The symbol "seed" that was not in my symbolic space.
 	I feel intensely uncomfortable with this.
  What is a "seed"?
  When we have a "seed" in our hands, do we realize that it is a seed?
  	Can you know in advance that certain information will lead to future ideas?
   unknown
   It is impossible to "find the seed" because it is impossible to know that it is a seed.
   [The Paradox of Search]
   [Discovery may be the wrong word.]
 To clarify my metaphor again.
 		Without explicitly obtaining or planting seeds,
  	The soil should be tilled and softened by stirring it up,
  	Something grows out of it on its own.
  	You will know after you grow up if what grows is edible and beneficial.
 	I just realized that's not a "field".
  What then?

	If the word "field" conjures up an image for readers of a place where crops of one kind are planted and grown in a tightly plotted area, that's not quite the metaphor I have in mind.
 	Oh, yeah, "I buried some kitchen scraps in a planter and something sprouted, and when it grew up it was a carrot, why?" Why?" Like that (true story).
  I saw a concept very similar to this recently, maybe on Sigotano.
  [Twitter https://twitter.com/shigotano/status/1042763510223056896]
  	>Scrapbox is a [hotbed of ideas]. It is a place where new ideas are born and where decaying ones are reduced and await the next oxidation. Once a piece of writing is deconstructed and sown, it may reappear as a new unit. Sometimes they are reborn as producers (catalysts) rather than members.
		When I saw this, I was also struck by the concept of "[decay]".
  [hotbed], [humus metaphor].

	[species metaphor].
 	[Twitter https://twitter.com/rashita2/status/1047362523379392512]
  	>In my case, something that sparks something (something written in Umesao's notebook of discoveries) is a "seed".
   > So it's like, we don't know what kind of fruit it will produce at the seed stage.
		If you're filling in "something that may or may not be a seed, and even if it is, we don't know what kind of seed it is," then it's not strange.
  In my case, I might bury all the food scraps that don't seem harmful to bury in the soil, let alone seedy.

	What, should this be corrected in the errata to "field -> soil"?
 	We need to check the surrounding text, not just this one spot.
 	I'll let it lie for a while for now and think about it.
