Busyness and feeling busy are two different things.
	Whether or not you are physically [busy] and whether or not you feel [busy] are two different things.
	 Busy feelings are associated with [agitation
	Agitation can also be caused by a lack of progress on an important task for an extended period of time
		Prioritizing urgent tasks leads to procrastination of non-urgent important tasks
	We needed to change gears at a time when we had more time to spare.

[Facebook 2018-10-18 https://www.facebook.com/nishiohirokazu/posts/10210072019893567]
	I've been trying to reduce my activity time because I'm still in a state of mind that I would have called "busy" in the past, but even after reducing it to a level that objectively there are many people who are much busier, my state of mind still hasn't returned, so I'm wondering if there is something different from being "busy" but how can I get it fixed? Hey ......
	I talked to my wife about it and found another interpretation that makes sense to me asari. In a nutshell, it is the [zygalnic effect], but I will write a biting explanation so that I, who "knew it but was not aware of it," can be aware of it in the future.
	We call it "busy" when there are "tasks that are close to their deadlines," "urgent tasks," and "tasks that have a specific date and time to be done" until the capacity is full.
 	In this state, task execution schedules tend to be in "order of urgency.
 Even if there is room after that, there is still "[anxiety about overflowing capacity]" again.
 	Therefore, they try to reduce the total amount of tasks by "hitting back tasks as soon as they come in.
	 In this process, "high importance tasks that do not have deadlines but should be done" are salted away on the pretext of overflowing capacities.
 By the time the number of urgent tasks has decreased, you will have a number of hard-to-be-started tasks that have been salted away for several months.
	 This unconsciously damages the mind, causing the symptom that "objectively I should not be busy, but my mind is restless.
	When the number of urgent tasks decreased, it was necessary to stop the algorithm of "hitting back tasks as they came in" and change gears to an algorithm of "doing the most important tasks first" and "breaking down ambiguous tasks.
		The importance-oriented algorithm proposed by the Seven Habits and others cannot be implemented without some mental capacity.
  There are multiple tasks of the type "If we don't do it now, it will be a catastrophe" because we are inundated with "tasks that are both urgent and important."
  In such a situation, while importance is difficult to measure, urgency is rather clear in terms of time to deadline, so it would be natural to move to an algorithm based on urgency.
 Completing tasks is an "act of reducing tasks," but dividing and clarifying large ambiguous tasks and pointing out problems that need to be solved is an "act of increasing tasks.
 	So we need to explicitly switch gears of mind as soon as we can afford to do so.

関連
	[2015-10-09]
