2015-10-09
What I wrote three years ago on [Facebook https://www.facebook.com/nishiohirokazu/posts/10207036430325725]. I'm not sure exactly what I was worried about three years later, but it appears that I am worried about a rather universal issue.

	Doing something unfamiliar increases frustration because you feel like you are achieving less per unit of time than you are used to doing.
  But if I avoid the unfamiliar and stop taking on new challenges and learning, I fear that I will become a useless middle-aged person.
	 I'm struggling with the board.
	I didn't get the challenge I had planned at the beginning of the year.
 	The idea that tasks should be granular and proceed little by little
  What should we do when a task is a large task that requires finer task granularity?
 Not physically busy, but feeling busy, frustration, is increasing. [Busyness and feeling busy are two different things.]
		心の問題
  [The cause is not in the outside world, but within you.]
	The idea that we must do what we can do at this moment coexists with the feeling that we must break down and proceed with the big task that we have not started because we have not broken down the task, and the former feeling rushes us to move toward the task at hand, so we cannot break down the task. The former feeling rushes you to move on to the task at hand, and you cannot break down the task.


	I think [the cause of frustration is] the desire for self-expression.

-----以下原文
A disease in which doing something unfamiliar makes one feel as if one is achieving inferior results per unit of time and increases one's frustration in vain.
But if I avoid the unfamiliar and stop taking on new challenges and learning, I fear that I will become a useless middle-aged person.
I'm struggling with the board.
I haven't been able to complete the challenge I had planned at the beginning of the year. I suppose I should make progress gradually by making tasks more granular, but what should I do when the task to be made more granular is a large task?

If I had to say whether I am busy or not, I would say I am not busy, but the feeling of busyness, of frustration, is growing.
I think it is fundamentally a problem of the mind, and the cause is probably within me, not in the outside world.
The idea that we must do what we can do at this moment coexists with the feeling that we must break down and proceed with the big task that we have not started because we have not broken down the task, and the former feeling rushes us to move toward the task at hand, so we cannot break down the task. The former feeling rushes you to move on to the task at hand, and you cannot break down the task.

I suspect that some sort of [binding] is occurring and I suspect that if I write it down for now and review it overnight with the feelings of others, it will be resolved.

When you say, "The cause is not in the external world, but within you," what type of cause is it?

What are the causes of agitation?
	I think the cause of the frustration is self-expression.
	I think he is in a state of being unable to admit that he is not achieving the level of performance he actually expects of himself, and his mind is battling between wanting to work harder and not wanting to.
	[Greed creates suffering]. To eliminate suffering, we need to look at greed and acknowledge the fact that it does not get what it wants.

As for the tasks I've been doing the last few days, my capacity is clearly inadequate.
	Apart from that, what is the reason for the tasks that are not progressing at all?
 This is also self-expression. They are thwarted when they realize that the prototype they have built will not work as well as originally planned.
 Then, they repeatedly start up other projects that seem to work, resulting in more work-in-progress tasks that are not progressing, eating up the brain's working space and causing thrashing.
 I admit that I do not have enough memory to run those projects in parallel, I have to write them to external memory and stop some of the processes.
 So which process do you stop? If you're only doing short-term tasks, you're not going to make any progress on long-term tasks, bound again.
 You have to admit that you are incompetent to proceed with tasks based on a long-term perspective. Because you don't admit that, you fall into the bind of trying to do both.
 We need to be stupid, work on short-term tasks, get them done, and reduce the number of them.
