Disadvantages of e-mail-based communication
Difference between [email-based communication] and [shared space-based communication
[https://gyazo.com/ddfd34f6921d969c1211c34b464983d1]

In e-mail-type communication, the exchange is shared only with those who explicitly put it in the addressee's name.
In the figure, Mr. B asks Mr. A a question, which Mr. A answers.
The exchange is not shared with Mr. C and Mr. D on the same team.
Therefore, Mr. C and Mr. D may ask Mr. A the same question in the future.
The workload is piled on Mr. A to either unearth and forward past responses to Mr. B or write new sentences.
[https://gyazo.com/20b56cd3f3dd0a06e6b1ece72dc3d697]

On the other hand, in shared-space communication, there is a place (space) where information is shared with everyone on the team.
When Mr. B posts a question to Mr. A in this space, Mr. A is notified that the question is "addressed to him.
At this time, Mr. C and Mr. D of the same team are also notified as "posts not addressed to me.
When Mr. A responds to Mr. B, the response is notified to Mr. B as "writing to me".
Mr. C and Mr. D are also notified that Mr. A has responded.
This information sharing will curb future questions from Mr. C. Mr. D. to Mr. A. and prevent Mr. A's burden from piling up.
[https://gyazo.com/694d7abe0c46767632f074e24f50f0c3]
If Mr. C is placed in the same situation as Mr. B in the future, the following four situations could occur.
	1: Remember my answer to Mr. B. No need to ask questions.
 2: I forget the answer to Mr. B, but I search the shared space myself and discover past answers to Mr. B before I ask the question.
 3: A question is addressed to Mr. A, but before the busy Mr. A can answer, Mr. B and Mr. D, who have free time on their hands, unearth past answers.
 4: Mr. A unearths past responses to Mr. B or writes new sentences
Only in this case 4, the burden on Mr. A is the same as for internal e-mail-type communication, and in the remaining cases the burden is distributed.

So [e-mail-based communication] has the disadvantage that the load tends to be concentrated on certain people.

Conversely, [shared space type communication] has the disadvantage of increasing the total amount of [notification].
To solve this disadvantage, "[notifications addressed to me]" and "notifications not addressed to me" are separated, and the former is processed first.
There is no increase from internal e-mail type communication if it is just "notifications to me," and the communication burden is reduced in the long run by the suppression of questions from Mr. C and Ms. D.
The spare time created by the reduced burden is used to read "notices that are not addressed to me," and to conduct loose [information sharing].

In the case of a system that cannot separate "notifications addressed to me" and "notifications not addressed to me," the
	'It's going to drift away in the chat room, so send it to me by email so I can search for it...'
 Don't chat in the chat room for communication." see: [self-explanatory and overflowing with notifications].
Phenomena such as the following occur.

relevance
　[Shared text communication increases learning opportunities].
　[Shared space type communication].
