Sanyuttha Nikaya 6.1.1
[Sanyutta Nikāya] 6. Brahmasaṃyuttaṃ 1. Paṭhamavaggo 1. Brahmāyācanasuttaṃ
Original [Brahma Kambo].
[Brahmanic scriptures, primitive Buddhism https://amzn.to/2OnAeYo] p.431
[原文 https://www.tipitaka.org/romn/cscd/s0301m.mul5.xml] [英訳 https://www.accesstoinsight.org/tipitaka/sn/sn06/sn06.001.than.html]

要約
 The line of [Buddha] who attained [enlightenment].
  This law is hard to understand.
  It is impossible for the greedy to understand.
  If I preach the Dharma and others do not understand, it is fatigue and anguish for me!
  So instead of willingly preaching, we retreat and remain silent.
 Brahma's line.
  Oh, the world is dying.
  Preach the Law.
  Some people's eyes are not yet stained with dust.
 Buddha
  I heard Brahma's plea and observed the world.
   Some have the eyes of wisdom untainted by the dust of vexation, others are terribly stained
   Some are born with superior qualities, others with inferior ones.
  The gate to immortality has been opened.
  He who has ears to hear, let him hear and cast away his own blind faith
  O Brahma, I did not preach the Law because I feared it would harm people.

解説
	Some people find this story offensive or inconvenient, but the fact remains that this was written
 	What the actual exchange took place is, of course, unknown.
 First, the Buddha thought, "It is impossible for a greedy person to understand the laws that he [understood]."
  And he thought, "[Trying to make those who don't understand understand create suffering]."
  The idea that suffering arises from trying to control the uncontrollable is a fundamental law of Buddhism.
  So Buddha thought, "Let's not preach."
  At this point, Buddha thinks everyone but himself is incapable of understanding.
 Brahma begs to be preached to because some people can understand him.
 At Brahma's suggestion, Buddha wonders if there might be someone other than himself who might understand.
  I would even go so far as to say that there is a difference in "innate qualities," which is a horrible expression from my perspective in 2018.
 He who has ears, listen."
  So you believe that there are those who do not have ears.
  The idea that "trying to make those who don't understand understand create suffering" hasn't changed.
  We are free from suffering by not trying to force the unheard to listen.
 I'm not sure what the last line is for.
 	That preaching the law to someone who does not have the capacity to understand it hurts that person?

A story about changing your mind when you are told that if you are trying to avoid your own suffering, it is not good for the world.
 Very human.
 Not a good story for those who want to make Buddha an infallible deity.
 Furthermore, the Buddha does not believe that all sentient beings can be saved, and worse, he even refers to "those born with inferior qualities," which is very inconvenient for a religion for the general public.
