Protein ratio
[https://gyazo.com/2c967fd11b9e4ba1519416917d38672a]
If you try a recording diet app, it's not so much about calories or carbohydrates, it's more about "Not enough protein!" Not enough fat!" I'm overdue for lipids!" was often pointed out to me, so I visualized the protein/fat ratios of familiar items.
The denominator is (protein + fat + carbohydrate), the numerator on the horizontal axis is protein and the numerator on the vertical axis is fat.
The percentage of carbohydrates comes diagonally from the constraint that the total is 1.
I really wanted to make an equilateral triangle diagram, but Google Spreadsheet does not have that function, so I drew diagonal lines by hand.
The closer to the origin, the more carbohydrates, and the closer to the diagonal, the lower the ratio of carbohydrates.

[https://gyazo.com/2d1a11ab815716ab285f38e42064924f]


On the far right, almost protein [Salad Sea Chicken https://amzn.to/2PJHv1k] is not so-called canned sea chicken, but this one, launched in August 2018
[https://gyazo.com/cbd955ef994f81b126aeadbb6296586e][https://gyazo.com/31926e0197a828ef53974a9740e75dad 成分]

The zone of tofu and cheese in the mid-diagonal area contains equal amounts of fat and protein. There is a zone of nuts clustered in the upper left corner. Eating nuts for the purpose of eliminating protein deficiency seems out of line. Nuts are good for fat deficiency.

I was eating the same foods in the same way because I have almost the same body shape as my wife, but in fact, my proper intake range starts beyond my wife's proper intake range, so eating the same foods was chronically inadequate. I was told I needed to eat two karaage kun or five eggs to get my score from a 50 to a 70.

I thought about buying protein, but I got it as a gift and left it alone because my joints don't hurt yet [https://amzn.to/2CvHjPt Nippi Collagen] is a protein, so it's good for supplementing when I'm lacking. I'll try this for now until the stock of the gift runs out.

https://docs.google.com/spreadsheets/d/198bIDXJkyA131XUups3r8w8Z9EVXhqaKajSNtiOlhFg/edit#gid=971061147
