will to power
>The will to [power] is one of the prominent philosophical concepts in the late writings of the German philosopher Friedrich [Nietzsche].
>The fundamental motive that drives human beings
	>Achievement, ambition, striving to "rise to the highest possible place in life".
	> "the willingness to own, dominate, be more than, and be stronger."
> Directly influenced by Alfred [Adler]. [Adlerian psychology] reflects the concept of the will to power. This is in contrast to the other Viennese schools of psychotherapy. They include Sigmund [Freud's] [Pleasure Principle] (the will to pleasure) and [Viktor] Frankl's [Logotherapy] ([the will to meaning]). Each defines a person's fundamental motivation separately.

>The first time these words appear in a published book is in the chapter "Thus Spoke Zarathustra," Part II, "Self-Transcendence.
> So Nietzsche criticizes the "[will to truth]" by which the "[sages]" try to make all things thinkable," as being the true nature of the "will to power" that tries to subject everything to the mind.
> That is, the will to power was initially closely related to [lusantiman] and was described as negative.
> However, Nietzsche eventually redefined the will to power as a positive concept.
> Daring to actively affirm [nihilism] and overcoming nihilism can be the will to power.

>The will to power is sometimes translated as the will to power, but the "power" of the will to power does not refer only to the so-called power of man to control others. Nor does the "will" refer only to feelings that arise independently in the individual. The will to power competes in all things, including natural phenomena. The antagonism of the will to power determines the form, arrangement, and movement of all things.
> In other words, truth does not exist as an unchanging Logos, but is produced each time by the will to power. This idea was carried over into [Gilles Deleuze's] philosophy of difference.

>Hitoshi Nagai also refers to this concept, writing that it is better to call it "[the power=will theory]" rather than "the will to power.

>Nietzsche holds that the Logosic, such as [Christianity], lusantimanic valuations, metaphysical values, etc., are what keep man away from "[life here and now]. And that man is a tragic being who must continue to recognize the values that are displaced by his will to power. But to reach this realization means to leave existing values behind and to attain a spirit of freedom. It is also a condition for becoming a [superhuman].
[Will to Power - Wikipedia https://ja.wikipedia.org/wiki/%E5%8A%9B%E3%81%B8%E3%81%AE%E6%84%8F%E5%BF%97]