Language of GTD and KJ method analogy
On 2014-10-20, a verbalization was made about the relationship between GTD and the KJ method.
The verbalization was done by writing it down on Facebook in fragments, and this page will preserve the logs and organize them in a readable way for interpretation in 2018.

Organized in 2018
	Interview [Without deadlines, you run toward a very distant goal that you never reach].
 After listening to you as an interviewee, I set around [output milestones], and the amount of output has certainly increased.
 But mentally exhausting = stressful.
 So I reviewed "[stress-free]" GTD.
	GTD does not say, "Write down everything you need to do.
 	I think this is very important, but I never noticed it before.
		Or more accurately, "write down everything that's bothering you."
  In other words, I'm asking you to write down everything that comes to your mind.
  	Do not filter by the following
	   whether or not it is feasible
 	  Is it a goal you want to obtain?
  	 Is this a current issue?
   	What you want to do or what you are forced to do
	This is similar to the KJ method of "write down what seems relevant to the problem.
 	Why is it "likely to be relevant"?
  They think people don't grasp the problem from the start.
  It is not feasible to "write out the problem" or "write only what is relevant to the problem."
		So we try to understand the problem by writing down everything that might be relevant and structuring it.
	Thinking back to the domain of GTD.
 	People don't know what to do from the start.
  So the first step would be to write down everything that's bothering you.
	Regarding after writing
 	The KJ method says, "Let's spread it all out so we can list it all."
  In contrast, GTD says, "Let's process from the top down, don't go back."
  This is because GTD assumes that the customer is in a state of "I have too many things to do and I can't collect them! This is probably because GTD is designed for customers who have "too much to do and can't collect!
  The KJ-legal approach is easily broken because there is no sense of progress.
  The GTD approach is a one-way street for now, and things go one way.
	In fact, some inbox contents are so closely related to each other that they should be "attached." I think they should be attached to each other.
 	Specifically, exactly what we're doing right now.
  	"Blog about the similarities between GTD and the KJ method" was my third line in my inbox.
   The "output milestone is suffering" was halfway down page 2.
   The former is clearly a task
   The latter is clearly not a task.
   	If it's something like "blog it," that's a task.
    But I thought it wasn't enough to be a stand-alone blog post.
   I gathered that these two and a few others were "similar" to each other.
   As a result, they stuck together and became a group called "verbalizing thoughts about GTD and the KJ method.
　　And then I reconsidered what the purpose of this group was.
   	To organize one's thoughts by verbalizing what is ambiguous in the mind in the form of sentences that can be read by others.
    I wondered what the next step would be to achieve that goal.
    The first step shouldn't be to blog about it.
    I could use my iPhone on the commuter train to write on Facebook, I thought.
    That is exactly what is being done right now.
	Another similarity between GTD and the KJ method is the emphasis on [bottom-up].
 	I often say things like, "Let's clarify our life purpose.
  However, GTD rejects such a top-down approach.
  We have tried both and believe that top-down does not work very well.
		Why is that?
  	Assume that the bottom is full of "what we have to do now".
   Introducing a top-down "[life purpose]" that diverges from this will increase the burden.
   As the burden increases, people reduce their load by turning a blind eye to "life's purpose" that is not their immediate need.
   As a result, only the [failure experience] of "I set a goal for my life purpose, but it didn't help" is accumulated.
		Reverse pattern
  	Write out a lot of bottoms first
   From there, abstraction proceeds as related items are attached in a KJ-method grouping fashion.
   As [abstraction] increases, human [cognitive load] decreases.
   It gets easier and easier.
   The extra energy created by the ease will allow you to think of new things to do.
   By repeating this process, the purpose of life gradually [crystallizes].


Original post saved: [Facebook 2014-10-20 https://www.facebook.com/nishiohirokazu/posts/10204440306264246]
	I've been setting output milestones all over the place since I heard Mr. Kozaki speak, and the amount of output has certainly increased, but this is exhausting...
	So we're reviewing "stress-free" GTD...
	If you reread it properly, GTD does not say "write down everything you need to do". I think this is very important, but I have not noticed it until now.
	Or, more accurately, "write down everything that's on your mind. In other words, write down everything that comes to your mind, without filtering by whether it is feasible or not, whether it is a goal you want to achieve or a current problem, whether it is something you want to do or something you are forced to do, and so on.
	This is similar to the KJ method of "write down what seems to be related to the problem. The KJ-method assumes that people do not know the problem from the beginning, and therefore, "write out the problem" is not feasible.
	So we try to understand the problem by writing down everything that might be relevant and structuring it.
	If you think back to the domain of GTD, people don't know what they need to do from the beginning, so the first step is to write down everything they care about, and so on!
	As for after writing things down, the KJ method says, "Let's spread everything out so we can list them all," whereas GTD says, "Let's process them in order from the top, and don't go back. This is because GTD assumes that the customer is in a state of "There are too many things to do and I can't collect them all! The KJ approach is easy to lose heart because there is no sense of progress; the GTD approach is a one-way street for now.
	In fact, some inbox contents are so closely related to each other that they should be "attached." I'm working on it right now. Specifically, the very thing I'm working on right now, "blog about the similarities between GTD and the KJ method" was on the third line of my inbox, and "output milestones are painful" was halfway down the second page. The former is clearly a task, and the latter is a task if you want to "blog about it" or something. But I didn't think the latter was enough to be a blog post on its own. I gathered that these two and many others were similar, and as a result, they stuck together and became a group called "verbalization of ideas".
	And when I rethink what the purpose of this group is, it is to organize thoughts by verbalizing things that are in a vague form in the mind in a written form that people can read. When I think about what the next step is to achieve that goal, the first step shouldn't be writing on a blog. I decided that I should just write on Facebook using my iPhone on the train to work.
	Another similarity between GTD and the KJ method is the emphasis on bottom-up. We often say things like, "Let's clarify your life purpose," but GTD rejects that kind of top-down approach. After trying both, we believe that top-down doesn't work very well.
	The reason for this is that when the bottom line is full of "what must be done now," the introduction of a top-down "life purpose" that deviates from the bottom line will increase the burden. What happens when the burden increases is that the person tries to reduce the load by turning a blind eye to "life purpose" that is not immediately necessary. As a result, the only thing that accumulates is the experience of failure: "I set a goal, but it didn't help.
	Conversely, if one writes down a lot of bottoms and then abstracts from them by attaching related things in a KJ-method grouping style, the human cognitive load decreases as the abstraction progresses, and it becomes easier and easier. The space left by the ease of the process allows us to think of new things, and by repeating this process, the purpose of life is gradually crystallized.
