Nietzsche, The Will to Power as Art
[https://gyazo.com/d8b50b5fc78cbd0698a03241b79b2a40]
	[Amazon https://amzn.to/2NQyouj]
	[Nietzsche], [the will to power] as art.
	Lectures by [Heidegger]. Heidegger's Complete Works, Vol. 43.

	preliminary investigation
		1 Euche as a metaphysical thinker
			a Fundamental and leading questions. Characterize Nietzsche's fundamental position first as "the will to power".
  	b The necessity of confronting Nietzsche's thought.
	Part I. The Will to Power. The Form of Nietzsche's Fundamental Position as a Thinker and Its Coming from Traditional Metaphysics.
		Chapter 1: The Formation and Structure of the Main Book. Nietzsche's fundamental metaphysical position.
			2 Book "The Will to Power"
    Biographical position of Nietzsche's main book.
    Compilation of posthumous manuscript fragments. Large octavo format and complete historical-critical collection. How to cite in this lecture.
			3 Plan and preliminary work to "[main building]"
    Testimony to the history of formation in Nietzsche's letters.
    Various Plans and Drafts. The first manifestation of the three fundamental positions.
			4 Will to Power, [eternal return], [value transformation] unity
			 The will to power as the fundamental character of being, and eternal return as the essence of being. The most important idea, existence thought as time, is not thought as a question about "existence and time.
				Current interpretations of Nietzsche's theory of eternal regression. [Alfred Beumler] and [Karl Jaspers].
				Compilation of a preliminary work, which was transcribed with the "will to power" as its main objective. The arbitrariness of the aphorism sequence.
   5 Structure of the "Main Book
				Repetition. Yes Question.
  	6 Nietzsche's way of thinking as a reversal.
		Chapter 2: Nietzsche's Theory of the Will
  	7 The existence of what is as will in traditional metaphysics.
			8 The Will as the Will of the Kahe
				The impossibility of deriving the concept of will from a particular domain of being. The will as a mental capacity. The will as a cause.
    [willingness] to be a determination to self, to go out beyond self and be a ...... Nietzsche's explanation of being master over the
			9 [Passion], [passion], and will as emotions
    The invalidity of psychology and physiology in the regulation of passions, passions, and emotions.
    Two essential elements of passion on the ground of the stipulation that the will to power is the fundamental form of passion.
					The first essential element, i.e., excitement, going out beyond the self
					The second essential element, i.e., passion as a seizure
				[the difference between passion and passionate passion], i.e., intelligence and blindness.
				Will as feeling (being mooded), i.e., openness to disclose oneself
   10 An Idealistic Interpretation of Nietzsche's Theory of the Will. [The will as an imperative].
   11 [Power and Will]. The Nature of Power
    The will to power as that which creates and that which destroys. The negative as the essential element of being in German idealist philosophy. Schopenhauer's condemnation of idealism.
    Euche's concept of power as a stipulation of existence and Aristotle's theory of dunamis, energeia, and entenkeia.

	Part II: Art and Truth. Nietzsche's Aesthetics and the Platonist Tradition
 	Chapter 1: The Contours of Nietzsche's Physiological Aesthetics
 		12 Fundamental and Leading Questions in Philosophy. Exhibiting the Linkage of Questions about Art and Truth
 		13 Five propositions about art. Their Relation to Nietzsche's Main Propositions on Art.
   	Art as the most transparent and well-known way of the will of the kahe
 			Grasping art from the side of creators and producers
 			Art as the fundamental genesis of all that is
 			Art as a counter-movement to nihilism
    Superiority of the value of art to truth
   14 Six Basic Facts in the History of Aesthetics
 			Aesthetics" as a name that calls for philosophical reflection on the nature of art
    Six Basic Facts
 				The Unnecessity of Aesthetics in the Age of Great Greek Art
     The origins of the question of art in the thought of Plato and Aristotle. The basic concepts of material-form and techne.
     The Beginning of Modernity, Art as a Cultural Phenomenon
     Hegel's Lectures on Aesthetics. Art as something that has passed away
 				Nineteenth-Century Aesthetics. Richard Wagner's Will for an Integrated Art
 				Nietzsche's "Physiology of Art" as a counter-movement to nihilism
 		15 Euphoria as an aesthetic fundamental state
 			Elucidating the conflicts of Nietzschean aesthetics. Art as a counter-movement to nihilism and as an object of physiology.
 			On the establishment of the rule that Apollonian and Dionysian are types of euphoria.
 			Euphoria as being in a mood while having a body.
  			The nature of euphoria in general. The opposition between the Apollonian and the Dionysian in Helderlin and Nietzsche.
  			The Question of the Inevitability of Euphoria for Art
  	16 Clarifying the Nature of Beauty
  		Kant's Doctrine of Beauty. Its Misunderstanding by Schopenhauer and Nietzsche
  		Beauty as prescriptive and normative
   17 Basic Aesthetic Attitudes. Creation and perception.
 			Characterization as "idealization" of artistic creation
    Contemplation and Perception as the Pursuit and Realization of Creation
 		18 Euphoria as a form-making force
 			Form as the state of the fundamental attitude toward what is
    Logical Emotions. The Reduction of Formal Laws to Raw Statehood
 			Summary and Perspectives. The unhelpfulness of the subject-object distinction for explaining aesthetic situations.
 	Chapter 2: Structure and Foundations of Nietzschean Aesthetics
 		19 The Great Style. Euphoria and beauty, the unity of interconnectedness between creation-enjoyment and form
 			The Meaning of Great Style for Nietzschean Aesthetics
 			The inevitable inextricability of the stipulation of art as a counter-movement against nihilism and the stipulation of art as an object of physiological aesthetics.
 			Strict Style. Rescuing the Classical from Misunderstanding by Pseudoclassicism
 			The great style as the unity of chaos and law. Music and the Great Style
    Art as the greatest stimulant of life. Interpretation of the main propositions about art.
   	iteration
  		The elucidation of the basic conditions of the great style. With reference to the oppositions of classical - romantic, active - reactionary, and existence - generation.
  		The pinnacle of Nietzschean aesthetics, the great style as the highest emotion of power. A retrospective look at the process of thought that has been
   20 Grounding of the Five Propositions on Art
  Chapter 3: Relation between Aesthetics and the Question of Truth
 		21 A conflict that inspires wonder between truth and art. A Question of Truth
  		Preparatory contemplation for questions of truth
  			basic vocabulary historicality
  			The primary trajectory of the significance of the basic term. Intrinsic and extrinsic trajectories. Prevention of equating essence with universal.
  		The truth problem must not appear. Attributability to the cognitive domain of truth.
   22 Platonist Interpretation of Nietzsche from the Standpoint of Basic Experience of Nihilism
  		Platonist and positivist interpretations of cognition
  		The fundamental philosophical position of overthrown Platonism
    Nihilism as a basic fact of Western history
  			Euche's words on the death of God
     Nihilism and the Great Politics
  			Nietzsche's position on Christianity
  		Establishment of the true as sensible
   23 The necessity of returning to Plato's philosophy to clarify the conflict between art and truth
  Chapter Four. Plato's Philosophy of Art
  	24 Peripheries and linkages of Plato's reflections on the relationship between art and truth
  	iteration
  	25 Plato's State. The separation of art (mimesis) from truth (Idea).
  		The Platonic method of Idea thinking. The perceiver locates himself between the [individual] and the [Idea].
  		Pursuit of the essence of mimesis
  			Hand Crafted Production
  			Artists' production
  		iteration
  			Creation, production and imitation. The three ways of immanence and existence. Uniqueness and immutability of truth.
    Mimesis and Individual Status (Perspectives)
  	26 [Plato's] "[Phaedrus]. The Meretricious Conflict of Truth and Beauty
    Preliminary Considerations. Phenomenological stipulations of the nature of conflict.
   	Plato's Question to Beauty and Truth. Dialogue "On Beauty"
   	Beauty as Exposure of the Real
    	The meaning of beauty for human nature. Attention to and forgetfulness of existence.
    	The Nature of Beauty. Reclaiming and Retaining Attention to the Presence
    summary
     The inextricability and conflict between beauty and truth

  Chapter 5: Nietzsche's stipulation that art is the will to the temporary
   27 Nietzsche's fall of Platonism
    Turning away from Platonism as the last step in overcoming Platonism
  		Presentation of the history of Platonism. An Allegory on the "True World."
    Critical Addendum. Overcoming and Strengthening Platonism
 		28 New interpretations of the sensible and the palpable conflict between art and truth
    Perspective character of life forms
    The Will to the Hypothetical and the Will to the Truth. The roots of Nietzsche's theory of regression. Art and Science

appendix
	A About the lecture and Nietzsche as a whole
		On the Nietzsche Lectures. Confronting Nietzsche.
  What was and still is considered Nietzsche
		[Confrontation ≠ Controversy.]
		Distortion of conventional Nietzschean philosophy
		Nietzsche
  What is the confrontation with philosophy in the first place?
  Intent of the lecture, very tentative and localized
  lecture
 B For two lectures on Nietzsche.
 	The entirety of the Winter Term 1936/37 and the Summer Term 1937
 		Nietzsche's Metaphysical Mission
   Two conditions for understanding this lecture
   The End of Western Metaphysics
 C Linkage between lectures in the winter semester of 1936/37 and the summer semester of 1937
 	Structure of the leading question
 	Intrinsic linkage of both lectures
 D Notes to Nietzsche Lectures
 	The Complete Works of Nietzsche in the Heidegger Collection (octavo)
