Assumption that adults are superior to children
[https://gyazo.com/eabe5dfb16c82323a7870f92603b3908]
I think many people have a vaguely concentric image of something like this.
The assumption that the knowledge that children have is part of the knowledge that adults have, that what children can do is part of what adults can do, and that the skills that children have are part of the skills that adults have.

But when discussing these things, if you make the child's side a specific individual and the adult's side a vague set, you are not making a proper comparison. If the child's side is a concrete individual, the adult's side should also be concrete. For example, let's say "you".

What is happening in reality is shown in the figure below.
[https://gyazo.com/9354409cbb13e6c8daf380e1422c3ef3]
Have you ever written a proposal and survived a 9x or more odds?
Have you ever implemented and even released a smartphone app yourself?
Have you ever implemented a proposal for a new idea that you can't find a flaw in the eyes of an expert?
Have you ever made a lot of phone calls all over the place to get the resources you need to accomplish your project?

There are real people younger than you who have accomplished things you have never accomplished.
In other words, the image of concentric circles is clearly false.
[https://gyazo.com/a8a25f8b528127baf4dcd17800195060]

Even between adults, it is not uncommon for people to say, "I can't do what someone else is good at," due to differences in expertise. If you were a 30-year-old programmer, would you say to a 25-year-old designer, "It's amazing that you can draw pictures at 25," or to a 28-year-old entrepreneur, "It's amazing that you can start a business at 28. Wouldn't that be rude to the other person?
[https://gyazo.com/ec5c6ff3017ee88332741751d07a8c7d]

There is no way that what is rude to say to a 25 year old is not rude to a 15 year old. It is implicitly [discriminating] based on age. You just don't realize how discriminatory you are.
