Rule Change, Hierarchical Organization and Scrum
[Rule Change], [Hierarchical Organization], and [Scrum]
	[Sectionalism (a movement to protect one's own department) occurs in a pyramidal organization.
 In cases where policies change frequently, [organizational boundaries] and [scope of defense] cannot be clearly defined.
 Tasks that are not clear organizational gaps are not picked up, and [inter-organizational fissures] occur when they claim that they are not in their own organization's defense against each other.
	[Scrum] makes [boundary of responsibility] fluid.

 >I think it is important to consider the optimal organizational structure for each company.
 > For example, a "pyramid" organization works very efficiently in a sales or production company. The president of the company only needs to give instructions to the head of each department, saying, "The budget and deadline are this, and you must produce this result.
 > On the other hand, I think agile development methods such as "Scrum" often work better in cases where policies change frequently, such as in GROOVE X's development department.
 > The reason for this is that in a "pyramidal" organization, for example, there is a tendency to protect one's own section, which is called sectionalism. As a result, the organization moves in the direction of "narrowing" its own domain whenever policies change.
 > The necessary countermeasure is "rules" that neatly define the boundaries between organizations and the scope of their defense. The "rules" should define the boundaries between organizations and the scope of their activities, such as "This work is under the jurisdiction of that organization. As long as this bridges the gap between organizations, there is no problem with a "pyramid" organization.
 > However, there is one pitfall, and as I mentioned earlier, in companies where policies change often, areas where "rules" are not set frequently appear. And often it gets overlooked. By the time they realize it, they have made up their minds not to pick up the gaps between departments, and no one is able to follow up in a positive manner, which leads to fissures in the organization.
 > In this respect, if organizational management like [scrum] allows for a fluid [point of responsibility breakdown] and a wide range of work deadlines, then the organization can tackle tasks with ease, making it more responsive to change and less likely to develop fissures between organizations.
[The "1.5-Month PDCA Cycle" Unleashes the Power of Members to Create a Flexible Organization｜GROOVE X Kaname Hayashi (Forbes JAPAN) - Yahoo! News https://headlines.yahoo.co.jp/article?a=20190816-00029096- forbes-bus_all&p=1]
