How to show people what you made
How to show people what you made
	I'm using it right now.
 	Upload screenshot to Facebook
  Take a video and upload it to YouTube
 (something) is good when it exists
 	Make it a 360-degree photo so that viewers can turn it themselves.
  Spit it out in the form of WebVR so that people who don't have VR can view it and edit it somewhat.
  Distribute the app itself

-----
 When you try to live broadcast a world created with [WebVR], it looks normal to you, but in the video, it's pitch-black while you're in the world.
  [Facebook https://www.facebook.com/nishiohirokazu/videos/10215489507847380/]
 I try to live broadcast the world I created in [Unity], but the live broadcast menu is Disabled.
 	I'm sure there are plenty of games made with Unity, so I don't see why we can't relay...
 When the Unity app is launched from the live webcast, only the video is dark as in WebVR.
 	[Facebook https://www.facebook.com/nishiohirokazu/videos/10215491198289640/]
	If you're shooting video instead of a live broadcast, it will be captured correctly.
 	Video is saved locally.
 	But I can't post that video directly to Facebook.
  When you open the video, it will be displayed in theater.
  We shared it in a crazy way, live-streaming it [Facebook https://www.facebook.com/nishiohirokazu/videos/10215492235555571/].
		Isn't there a better way?
 Connect to USB to extract video and upload directly to YouTube
 	It is a hoax that [developer mode] does not recognize it as a drive.
			It looks like [adb] can do it.
   It was rumored that it would not be recognized as a drive, but in [nishio.icon]'s environment, it is recognized without any problem.
  I saw Movies and almost made a quick assumption that there were no videos, but the correct answer is oculus/[VideoShots].
  [https://gyazo.com/89970dbd672afe28334aab8559006cdd]
		I was able to copy it to hand and upload it to Facebook [Facebook https://www.facebook.com/nishiohirokazu/videos/10215505711212454/].

 I want to [take a 360-degree photo and share it] within unity space.
  Looks doable https://qiita.com/ELIXIR/items/88126039121b9c7e334f
  It looks like there are assets for still photography.
   http://www.noshimemo.com/entry/2017/08/21/122945

 Or it would be nice if you could spit it out in webvr format.
[2018-06-06] [Resolved].
