Chomado's background
Notes on Chomado's very interesting career #career #rolemodels
	If the work at the company doesn't match what you want to do, you leave after 3 months and immediately change jobs.
		Even if the parents cry, "I joined [a major] company.
 Acquire skills through [practical] work in the venture.
 	I wanted to do programming, so I chose a place where I could do programming.
	At the same time, he continues to draw cartoons.
 	Niche-top strategy of "Engineer and Manga Artist" (cross-fertilization)
 Microsoft asked me to take an employment interview, and I thought I would fail, but I took a chance.
		[The idea of "No, but I'm still with you.

[Chomado-san rolls into Microsoft's "Cloud Developer Advocate" position from Nov! | Rikunabi NEXT Journal https://next.rikunabi.com/journal/20181101_p01/]
>After graduating from a private women's college with a degree in English Literature, Ms. Chomado went to work for a SIer. She was hired as a "system engineer" and was assigned to the testing unit, where her job was to look at an Excel file with a list of tests every day and take a screenshot of the test screen of an application that someone else had created and paste it into the Excel file.
> 
> "On many days I was putting up 200 sheets a day. We were not allowed to automate, so it was all manual. Everyone at work was serious and kind, but I originally wanted to work in programming, so I resigned after three months with the company and moved to another venture company the following week. At that time, my parents cried, saying, 'You went through the trouble of joining a major company in the midst of the employment ice age...' But I wanted to do programming, so I was lost. But I wanted to do programming, so I didn't hesitate. I did feel guilty, though."
> 
> Then Chomado continues his story at his second venture company. There, as a developer creating mobile apps (Android/iOS), he wrote code every day. Here, using Xamarin, a cross-platform development environment that allows native Android and iOS apps to be developed using only C#, I was in charge of apps for both platforms, from development to release, while working to standardize code between Android/iOS.
> 
> The server side was also written in C# (ASP.NET) to achieve code commonality between client and server, and the server also used Microsoft's cloud platform "Microsoft Azure" (Windows Azure at that time).
> 
> "It was good to experience Microsoft technology here with gusto, I was impressed by the high performance of Microsoft's IDE Visual Studio and the language C#, and I fell in love with programming more and more. Azure and Xamarin were also expanding rapidly. Azure and Xamarin were also expanding, although at that time Xamarin was still a third-party product, not part of Microsoft."
> 
> Mr. Chomado was also a cartoonist at the same time. With the title of "Engineer and Manga Artist," he continued to draw manga about his favorite programming subject.
> 
> One of the serialized comics, "Hashire! Code Academy" caught the eye of one of the evangelist team members at Microsoft, and he recommended that I interview for a position as a technical evangelist. He told me that he wanted me to work on spreading the technology to many people in an easy-to-understand way using cartoons and SNS, etc., and that he would definitely give me an interview.
> 
> "I was already a Microsoft fan who loved Microsoft, so if my skills could help Microsoft and the developers around it, I was eager to try for a job interview. To be honest, I thought I would probably fail anyway, so I decided to give it a shot.
> 
> Eventually, after passing six interviews, including code reviews and English interviews, he joined Microsoft in March 2016. Since then, he has been speaking at various events to share information and has over 46,000 Twitter followers.
