Tachikawa Model of Communication
The lecture "Entrepreneurship and Omnidirectional Communication" by Tomoya Tachikawa was held at [Tokyo Institute of Technology]'s Tamachi campus on 2018-11-07. The mental model of [communication] introduced in that lecture was interesting, so I wrote it down.

Mr. Tachikawa's Yosuga Co. runs a marriage agency. I have never used a marriage agency, so I had no idea what it was like, but it seems that a person in the role of coordinator communicates with clients and helps them to make things go in the right direction. As the president of a coordinator himself, Mr. Tachikawa has a business need to verbalize and teach other employees how to promote good communication.

On the other hand, I have the feeling that I [am] not good at communication. What kind of difference is there in the mental models that the two of us have?

Tachikawa-san suggested that "communication" should be broken down rather than being a vague lump, and drew a diagram of [event], [expression], [verbalization], and [interpretation]. At first glance, this model seemed to be the same as Nishio's original model that "[fact] and [interpretation] should be distinguished," but upon closer listening, there was a big difference.

[https://gyazo.com/d5300ee090d98d1a49fab193a4a28330]
In Mr. Tachikawa's model, there is an event in the mind of the other party, that event is verbalized and becomes an expression, and I interpret that expression. On the other hand, in my "[distinction between fact and interpretation]," the other party's verbalized expression is the fact, which I interpret. I ignore the other party's inner world because it is unobservable.

For example, one person may want to "start some conversation" and ask, "Did you change your glasses?" I might say, "When was the last time we met? To which I reply, "When was the last time we met? (true story) "Did you change your glasses? (true story) I took "Did you change your glasses?" literally as a question, "Did you change your glasses between the last time we met? I took "Did you change your glasses between the time we met before and now? Did you change your glasses?" I don't think there is a different intention behind the expression "Did you change your glasses?

In other words, there were two points of distinction in "distinguishing between events and expressions," and I was distinguishing the latter point. I called it "the distinction between fact and interpretation. On the other hand, I did not distinguish the first half at all. This may be the reason for my difficulty.
[https://gyazo.com/34621cf1a25dbac1b12606f2551d37fc]

----
According to Mr. Tachikawa on this page
	>This story about the glasses as an example, it's not a normal problem for communication, or as a result, you get what they are trying to do lol.
	>I don't think you're responding to the other person's intent if you cut off the conversation with "Yes, I changed my glasses.
	So I unearthed the actual statement.
 	[Facebook 2015-01-03 https://www.facebook.com/nishiohirokazu/posts/10204963013171592:30]
		In fact, "Did you change your glasses?" He replied, "I don't know," then looked them up after he got home and reported, "I changed them on March 2 of last year."
  >www, it's pretty hard for them to answer "I don't know".
