Motivation Systems and Lean Startup
The [Motivation System] was originally created by me after reading [Lean Startup], and I decided to experiment with it.
It is a minimum Viable Product, which means
	No server (data is stored in Google Analytics)
 No servers, so no personal identification.
	I wanted to do machine learning, but rule-based for now.
Released in

After a while of starting, I understood that if you do not aim to monetize, it is unclear what the goal should be.

>I read about Lean Startup and started with the intention of putting it into practice, but it has been beneficial in a different way than I expected. I thought the book was supposed to be about how to quickly find [needs] that can be monetized in a situation where [venture] companies have limited [time resources] and must aim for monetization, but since there are no [time constraints] and no [monetization], the premise is different.
https://www.facebook.com/nishiohirokazu/posts/10201996503010692

I wanted to use what I learned at a Lean Startup workshop at Cybozu in 2012, so I built it in a weekend with the idea that "I need a small product that I can control 100% by my own will.

Looking back after 10 years
	Since the Lean Startup is aimed at "startup managers," the basic premise is that "it is important to quickly find 'paying customers' in order to be able to retain employees on an ongoing basis."
	So while the main idea of "repeating small experiments to find the existence of customers" is common, there are variations in the definition of "customer".
	There is little incentive to find "paying customers" for an engineer's personal project who works for a company and earns his living there.

	The data gathered from this project was used in "The Intellectual Production of Engineers.
	It turns out that there are enough users who want this service to keep using it for more than 10 years.
		>[https://twitter.com/amachang/status/1552100154332762112 @amachang]: I still use this web app from time to time. Thanks @nishio https://t.co/PQeaEYS5Vo
