取っ手
The [concept] is connected to the easy-to-mention word "[handle]" and is usually operated by that handle.
　[Concept handles]

Referring to papers, etc. is something I have no choice but to do when I have to state the source, and it's usually hard to keep the title of the paper or something else in my brain, so I make up my own easy-to-reference words and use those.
	[nishio.icon] I have tried to rephrase it as "handle" because "handle" makes people think of a car steering wheel, but "handle" is still a good fit as the word I usually use to refer to this concept!

>When you have a word, you can use that word to do [thinking]. The elusive, fuzzy idea is given a "handle" called "[word]" and can be manipulated by grabbing the handle. Water is not portable as it is, but when you put it in a container, you can carry it around.
[The Engineer's Art of Intellectual Production] p.136 "Get [Tools of Thought]" [(4.5.3.3) Get Tools of Thought].

>Even if it is something that only you can communicate, words are the handles, and it is easier to [manipulate] if you have them.
[Intellectual production techniques of engineers] p.207 "Summary of [verbalization]" [(6.2.6) Summary of verbalization].

>[Engelbart] saw language as a means for individuals to break down their perceptions of the world into "[concepts]" for modeling the world. Language is used to map [symbols] to these [concepts] and to consciously manipulate the [concepts]. He believes that consciously manipulating these concepts is what it means to "[think]. What does it mean to model the world? It means observing the world, finding common [patterns] that appear repeatedly, and selecting only the useful ones to model. Design patterns were created by observing many programs and naming the structures that appeared repeatedly. This is exactly what we are doing: we are creating a "language. By creating a language, humans can think, "Let's make a mediator pattern here," instead of thinking, "Instead of lots of things interacting with each other, let's make a design that feels like it creates something that mediates the interaction," which reduces the effort of thinking. This is the benefit of mapping symbols to concepts.
[Engineer's Guide to Intellectual Production] p.36 Column: [(Column) Naming the Pattern] #Name #Name

Q: I think "[container]" or "[container]" is more intuitive, but why the handle?
A: [AUGMENTING HUMAN INTELLECT: A Conceptual Framework] の
> The grasping and handling done by these mechanisms can often be facilitated if the concept is given an explicit "[* handle]" in the form of a representative symbol.
The "handle" is a literal translation of the "handle" of the "handle," and the indefinite [metaphor of a liquid in a container] is a timeline that came about after the fact in the process of my writing.
　Related: [concept handles], [handles].

Q: What if we [cup]?
A: In my brain, it's [this https://www.biccamera.com/bc/item/3643684/]. w
[https://gyazo.com/defe94c1fec4aa3fc59f639a30fc2d62]
> "[Pot]" would this time give the image of "a vessel that can hold multiple ingredients at the same time. If you would rather that be the case, "pot" would be easier to understand, and if you want to correspond one container to one type of liquid, a simple "cup" would be easier to understand.
I see...
