Concept Handles
This "[handle]" is not a car handle, but a [handle].

	The concept is made easier to manipulate by adding a verbal [handle] to it.
		[The Engineer's Art of Intellectual Production] p.36 [(Column) Naming the Pattern].
   >Name the pattern.
   	>Engelbart saw language as a means for individuals to break down their perceptions of the world into "concepts" for modeling the world. Language is used to map symbols to these "concepts" and to consciously manipulate them. This conscious manipulation of concepts, he believes, is what "thinking" is all about.
		The Intellectual Production of Engineers p.137 [(4.5.3.3) Get the tools of your thinking].
			>In his Chapter 1 column, "Naming Patterns," Douglas Carl Engelbart cites language as one of the ways "to augment human intelligence. By creating abstract models of external events and naming these models, we can manipulate them in our minds and think about them. This is the enhancement of intelligence through language.

	This word as a "conceptual handle" is to increase the efficiency with which you think, so it does not have to be a word shared with others
	　Related: [word being created].

	see [metaphor for liquid in a container].
		[handle to manipulate the concept].


	[Pointer to object] # Pointer
 For example, `https://scrapbox.io/nishio/%E6%A6%82%E5%BF%B5%E3%81%AE%E3%83%8F%E3%83%B3%E3%83%89%E3%83%AB` is a pointer to a single object
 	URL: [resource locator].
			The pointer is [pointing].
 When we think of [natural language processing], we tend to assume [words] as the target [object], but that is not the case [expression].
		[Knowledge] may [point to] external things that are not included in [the corpus].
		Words can also be interpreted as referring to "its meaning."
  URL is an expression that quite clearly points to an external object
		This should be treated as the equivalent of a "word".
 Bracketing `[target page]` in [Scrapbox corpus
		This is an expression that points to another page
		The page title and its content may be strongly related, but they are separate
  	see [本の分散表現]
