Managerial One-Night Werewolf Commentary
Explain the game [one-night werewolf] in the language of [management studies] ([organizational theory]), not in the language of werewolves.

One Night Werewolf is a game of organizational decision-making control
	Many consider themselves on the side of good.
	Therefore, they tend to think that people who think differently from them are evil.
 Conflicts of opinion can occur in organizational management.
 But this isn't a conflict between good and evil.
 There is just a discrepancy in the direction we are aiming for.
 So you could be at odds with the kind-hearted person who offers you a seat on the train, and you are not evil, and neither is the other person.
	One Night Werewolf is a game that allows you to experience this situation where there is a discrepancy in the direction that the members of the organization are aiming for.
 Players typically split into two teams
 After about 5 minutes of discussion time, one person is chosen by vote, and that person is destined to have a terrible time in the game.
 Neither team wants their people to have a terrible time. That's what each team's win condition is.
	So, you make various statements during the discussion time and try your best to converge the opinions of other members into one that suits you.
 In other words, it is a game of control over organizational decision-making

Minority and Majority
	The organization's two teams are divided into a minority and a majority.
 Minorities are sacrificed by the majority vote if they are found to be in the minority.
 So the minority hides its true identity.
 Minorities typically know each other.
 	I'll make a small tweak here, depending on the variation of the rule.
 	Minority groups need to work together and control organizational decision making to suit their minority
	Majorities don't know each other (if they did, they'd just vote for someone other than each other).
	 So I don't know who around me is the enemy.
	 If Mr. A is told by another person B that "Mr. A may be suspicious," Mr. A knows that he is in the majority, so he would think that Mr. B, who pointed out so, is suspicious. But even if he asserts this, since only Mr. A knows "that Mr. A is in the majority," Mr. C, who hears his opinion, will not be able to distinguish between Mr. A being in the minority and Mr. B asserting that he is in the majority because he was pointed out to him that way.
  The majority needs to do its best not to be led into wrong decisions by the minority.
	Logical reasoning makes it clear to all and objective decisions are rarely made in this game.
 	Of course there are probabilistic highs and lows, but none of these phenomena are so low as to be negligible.
  	For example, if you are dealing 5 cards from a 5-player game with 7 cards and 2 "minority" cards
   Phenomena can occur where no one is in the minority. We tend to think that it is an exceptional event, a very small probability.
   But 2/7 * 1/6 = 1 / 21, so it happens about 5% of the time.
   In this case, if we do not come to an agreement that there is "no minority in the field", we are doing something terrible to our own people and losing!
 	It seems to me that there are more subjective factors than probability calculations and logic: reputation, trust, conviction, etc.

The approximate game situation is described above, but to make the story more interesting, a "special person" is introduced from here
 For any one person, who knows whether that person is in the majority or minority.
 	The information this person brings is important.
  But this person himself has no means of proving that he is capable of doing so.
		So to others, he's just "someone who claims he knows what he's talking about".
		Let's put ourselves in the minority.
  	Suppose some person A says, "I know who is in the minority; it is Mr. B."
   When this is the case, and the atmosphere of the place recognizes it as a fact, the minority team loses.
   what to do about it
   For example, Mr. B says, "Eh, no.
   Or someone C on the minority team claims "A is a liar, because I'm the real one."
   Now the mood is, "Which one of you is real?" becomes "Which is the real one?
  	If there is an atmosphere that declaring first is the real thing, the minority team will backstab you by declaring first.
 	If you, Mr. A, were the majority team and Mr. B said, "Mr. A is the majority team," your trust in Mr. B would increase
   But Mr. B may be a minority team and just happen to hit the mark by saying so at random. The majority team has a large number of people, so if you say that you are the majority team anyway, you will hit it with a high probability.

	I don't know how to explain it.
		Some people are hard to explain with this organizational management metaphor, but I personally find it very interesting.
 	A person who exchanges his/her role with one of his/her choice.
   The person being replaced can't see that.
   If Mr. A exchanges with Mr. B using this special ability and Mr. B is in the minority
    Mr. A has made himself a minority and he will lose if he doesn't keep that fact secret.
   	Mr. B becomes "the majority who believes he is in the minority".
    Other minorities believe that Mr. B is the minority and Mr. A is the majority, which is not true.
    Mr. A is not perceived by the minority as a peer, but he shares the winning condition
    A situation arises in which other players misunderstand your affiliation.
			In response to the above statement "who knows the role of any one person"
   	I can back up that claim by saying that I traded with that person and that claim is correct.
    On the other hand, we could point out that they are lying.
   And this person, again, has no way to prove to himself that he has that ability.
