Employment contracts where IP does not belong to the organization
Note what I thought about in creating an [employment contract] where [intellectual property] does not belong to the organization.

>In the event that JQA has created a work in the course of or as a result of the performance of its services, the author of such work shall be JQA.
> 2. If JQA has made an invention in the course of or as a result of the performance of its duties, the right to obtain a patent for such invention shall vest in JQA.

explanation
A work of a program written by an employee in the course of his/her duties is copyrighted by a juridical person according to Article 15(2) of the Copyright Act.
>The author of a work of a program prepared by a person engaged in the business of a juridical person, etc. on the initiative of such juridical person, etc. in the course of his/her duties shall be such juridical person, etc. unless otherwise provided for in a contract, service rules or other regulations at the time of preparation of such work.
Therefore, by stipulating in the employment contract that "the creator himself/herself shall be the author" and "otherwise stipulating" that "the creator himself/herself shall be the author", the work is not attributed to the corporation.

Inventions made by employees in the course of their duties "belong to the employer at a predetermined time" under Article 35(3) of the Patent Law.
> With respect to an employee invention made by an employee, etc., if it is stipulated in a contract, service rules or other provisions that the employer, etc. shall acquire the right to obtain a patent in advance, the right to obtain a patent shall vest in said employer, etc. from the time when the invention occurred.
However, most employees would find it difficult to read that from the blank article, so I have kindly clarified it for them.

Article 35(1) gives an employee a non-exclusive license to a patent, but I'm not sure if there should be a clause that prevents the employee from exercising this right. I think it is okay to add a clause, but I am not sure if there are cases where this would be a problem.
>Article 35 Employers, juridical persons, national or local governments (hereinafter referred to as "employers, etc.") Article 35 When an employee, officer of a juridical person, national public officer or local public officer (hereinafter referred to as "Employee, etc.") (2) When an employee, officer of a juridical person, national public officer or local public officer (hereinafter referred to as "Employee, etc.") has received a patent for an invention that by its nature belongs to the scope of business of the said Employee, etc. and the act that led to the invention belongs to the present or past duties of the Employee, etc. (hereinafter referred to as "Employee Invention") (2) When an employee, etc. of an employer, etc. has obtained a patent for an invention (hereinafter referred to as an "employee invention"), or when a person who has succeeded to the right to obtain a patent for an employee invention has obtained a patent for that invention, he/she shall have a non-exclusive license to that patent right.
The options are
	I don't mind having a non-exclusive license, so the status quo is fine.
 Specify in the employment contract the non-exercise of the non-exercise of the non-exclusive license
 The employment contract shall clearly state, "If the employee requests non-exercise of the non-exercise of the non-exercise of the non-exclusive license, the employee shall sign a non-exercise agreement without compensation."
 The term of the employment contract is terminated and the non-exclusive license is also terminated.
I wonder if there are such things as
