GDP
Talk about not understanding the concept of GDP.

[Facebook 2014-11-24 https://www.facebook.com/nishiohirokazu/posts/10204666387276130]

I've been studying macroeconomics because I don't know what the news about "negative real GDP" means, but are all of the following propositions true?

Situation: Mr. A produces three apples, sells them to Mr. B, and then buys processed apples from Mr. B to eat.

1: If Mr. B buys 3 apples for 3 yen and processes them and sells them for 2 yen each, Mr. B's production is 3

2: If Mr. B buys 3 apples for 3 yen, processes them and sells 2 apples for 2 yen each, and consumes the remaining one at home, production is 3 and consumption is 2.

3: If Mr. B buys 3 apples for 3 yen, processes them and prices them at 2 yen each, but cannot sell them at all and they all rot, production is 3 and consumption is 6.

4: If the government takes a tax of 2 and invests it in something, this is an import 2 (because that 2 is not passed on to any of the citizens, so it has gone overseas).

5: If the government takes a tax of 2 and makes it ODA or something, this is also import 2.

6: If the government takes a tax of 2 and spreads it around as a farm subsidy to Mr. A, production + 2 (because if Mr. A does not consume it, his savings will increase by 2).

If all of this is true, then I think it makes sense. On the other hand, I also think that there is a significant deviation from what is generally imagined from the terminology.
61 comments 1 share
3Miichi Kirishiro, Akiyoshi Nozaki, and Jiang Fuana
Nice!
Comment.
Share
Comment
Nishio Hirokazu
Nishio Hirokazu As for 6, if we make the rule "subsidies are offset against taxes", does it make sense without accepting the rule "subsidies are also considered production"?
Manage
4 years ago - nice!
Kohei Okubo
Okubo Kohei Just because Mr. B says, "This apple is 10 trillion yen," does that generate 30 trillion yen in production?
Manage
4 years ago - edited - nice!
Nishio Hirokazu
Nishio Hirokazu Ohkubo Kohei That still seems odd. If that is the case, I should consider that the production took place when the processed goods were sold, not when they were processed, so it would make sense if I assume "production 2 (number sold x profit), consumption 1 (raw material cost of goods consumed at home)" in case 2, and "production 0, consumption 3 (raw material cost)" in case 3.
Manage
4 years ago - nice!
Jun Harada
Jun Harada My knowledge of GDP has stopped since high school, but since GDP only includes final goods, I think that in case 1, the production is 6. The amount of money obtained by the vendor who sold apples to Mr. B should be treated as an intermediate good, and intermediate goods should not be included in GDP.
1
Manage
4 years ago - nice!
Jun Harada
Harada, Atsushi As for 2, I didn't know this until I googled it, but I heard that farmers' own consumption is included in GDP, so I think this also makes the production 6. If Mr. B produced 6, sold 4 in the market and consumed 2 at home, it would be neat as an explanation of 3-sided equivalence since production and expenditure are equal. I think this would be a cleaner explanation of the 3-sided equivalence.

But I'm not sure how to handle rotten cases and such after 3. ・・・・
1
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu I understand that the interesting point of Rickard's theory of comparative advantage is that even an absolutely inferior country can benefit from trade, but I am suspicious of the assumptions that "an absolutely inferior country must have items in which it has a comparative advantage" and "the cost of trade is zero," and I think that if the If the cost of trade is somewhat high, the inequality is inverted and "trade 0 is the maximum value", and how high the cost is inverted depends on the size of comparative advantage, right?
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu Another point is that you assume that the cost of reassigning workers is zero. That's why I'm against the TPP.
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu The premise that there was still a shortage of labor and goods, and that producing more with less is a good thing, is also at least inconsistent with the fact that unemployment is not zero.
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata I don't understand the connection between 1~3. and 4.~. 4.~ is talking about government BS. If "this apple is worth 10 trillion yen" is valid in the market, then 30 trillion yen of production has occurred, but if it is not sold at all and goes bad, it is no different from private consumption.
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata (on the assumption that Mr. B is producing without market intervention)
Manage
4 years ago - nice!
Kohei Okubo
Okubo Kohei I'm not sure what the definition of "established in the city" is.
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata In this case, the price tag is 10 trillion yen.
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata: I think the term "negative real GDP" itself is wrong (not that it doesn't happen). The correct term is "negative real GDP growth rate.
1
Manage
4 years ago - nice!
Jun Harada
Harada, Atsushi Thisup
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata Ah, I didn't see the middle of the discussion. Farmer's (Mr. A) own consumption contributes to GDP, but processor's (Mr. B/individual) own consumption (rotten, not sold) is completed in Mr. B's P/L. Is this not a good idea?
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata For Mr. A, if he wants apples, he has to buy them in the market. If there is a liquid market with a price of 1 yen per apple, then the production of apples contributes to real GDP.
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata I have a feeling that this topic will eventually come to the conclusion that "talking about (macro/micro)economics from a (micro/macro)perspective leads to a fallacy...
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu Masaki Iwata 
> I don't see the connection between 1~3. and 4.~, with 4.~ being about government BS.
This was done with the background that 1 through 3 are the simple case of GDP without government intervention, and from there I wanted to understand what changes would occur if there were government intervention.

Government intervention is, for example, the "government consumption" portion of the "Gross Domestic Product = Private Consumption + Government Consumption + Investment + Exports - Imports" in this document.
http://jica-ri.jica.go.jp/.../field/pdf/200803_aid02_02.pdf

According to the principle, the sum of consumption, taxes, and savings equals GDP, and I wanted to consider a case in which taxes are not zero.
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu Masaki Iwata Also, "negative real GDP" is a mistake for "negative real GDP growth", but I was rather surprised by "(not that it doesn't happen)" because I thought such a situation would never happen. In what case does it happen?
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata > 4: If the government takes a tax of 2 and invests it in something, this is an import 2 (because the 2 is not passed on to any of the citizens, so it has gone overseas).

I don't understand the "would have gone overseas." If it only adds to the government BS, then the deflator will only go negative.
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata In theory, you can think of anything. All you have to do is add "negative" to it.
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu >I don't understand "will have gone overseas". If it is only added to the government BS, it will only make the deflator negative.
In the situation where the tax was taken and the entire amount was used (i.e., no change in BS), I don't see any way to keep the equation constant other than to absorb the tax in excess of imports.
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu >Theoretically, you can think of anything. You just need to add "negative" to it.
For example?
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata Just let the money flow into a country where there is no consumer spending, no investment, no government spending.
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu That's positive GDP with the same amount of exports occurring. If you take money away from a country where no one is producing value-added products, is it negative GDP?
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata: It's not impossible to say that such a thing will not happen, because it can be created by fiddling with the values in the definition, that's all I'm saying.
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata (Probably a member here, I'm getting the opposite reaction when I say it won't happen.)
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu "All of the people are elderly who cannot work, print government bonds and import medical services from neighboring countries with that amount of money..." Hmmm, this would not be negative if government bond issuance - import = 0...
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata That's the thing, I don't understand how "invested it in something" becomes "went abroad".
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu Because there is nothing else to absorb from the definition of total expenditure. I would like to know if there is a different interpretation of the definition, because I also feel uncomfortable.
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu If we put the proposition in another equivalent form, "If government investment and consumption are increased without changing gross national product, the increase is cancelled out by an increase in imports"?
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata Buy back issued currency.
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu I don't think you're talking about the amount of currency issued or the constant gross national product section.
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata Eh... Are you assuming that the economy operates only within the constant equation of gross national product...?
Manage
4 years ago - nice!
Kohei Okubo
Okubo, Kohei, I mean, we're talking about an identity now, and you're saying, "If this really is an identity, then we can draw the conclusion that ~~...what does that mean?" What does that mean?
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu No, I simply have no idea what you are talking about. Since the theme is to understand the constant equation of gross national product (sorry if that didn't come across), if it appears in some section, please let me know, and if not, it's completely off-topic.
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu (Well, there have been off-topic remarks about deflators, but that's beside the point...)
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu To get back to the topic at hand, you asked under what circumstances a negative GDP could occur, and you suggested that we should buy back the currency that has been issued.
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata That aside, I thought I had closed my theoretical off-topic with "I'm sorry if that didn't come across.
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata I'm talking about buying back currency that has already been issued, which is a possible government action against tax collection other than investing in foreign countries.
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu >There are other possible government actions against tax collection other than investing abroad, right?
Are you saying that would result in a negative GDP? Or are you talking about something else?
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata Another story. It's a reference to the main topic.
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu I see, misunderstanding.
Manage
4 years ago - nice!
Yu Kobayashi
Yu Kobayashi Since "GDP = sum of value added," simply put, if the value added is negative (purchase at 100 yen and sell at 80 yen), GDP will be negative, right?
2
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu Then the question arises whether the GDP identity does not necessarily hold if the government buys back currency and destroys it, or if it prints money and invests it, or whether some ko expresses and absorbs it.
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata Originally, we were talking about understanding "negative real GDP growth rate," right? So I don't think it's off-topic to say "4. was used to improve the government's BS as a result of the tax collections in I don't think this is off-topic.
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata I think we just need to adjust the government final consumption expenditure section...
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu Yu Kobayashi Indeed. But if I buy something for 100 yen and sell it for 80 yen, it is considered negative production, and if I buy something for 100 yen and discard it without selling it, it is treated as consumption of 100 yen...
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata I don't understand why it is not clear whether you take the government as a participant or assume that the value of the "yen" here is determined solely by the private sector. (But if we take the latter position, we end up talking about where the "yen" comes from.)
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu >Wouldn't it be better to just adjust the government final consumption expenditure section separately...
What exactly do you mean by adjustments? Like, if the government uses 100 to buy currency, but reports 0 as government spending?
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata You can do that too.
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata (The result is the current "negative real GDP growth rate"...)
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu >We were originally talking about understanding "negative real GDP growth," right? So I don't think it's off-topic to say that "4. was used to improve the government's BS as a result of tax collection." I don't think this is off-topic.

Can you elaborate on this? I don't know why this is not off-topic, so if it appears to be off-topic to you, then I must be missing some prerequisite knowledge.
Manage
4 years ago - nice!
Yu Kobayashi
Yu Kobayashi Real GDP = Nominal GDP / Prices, so if prices rise sharply, the rate of increase can easily become negative, can't it? This is Japan today, right?
1
Manage
4 years ago - nice!
Masaki Iwata
Masaki Iwata The first problem is that the fact that the government is also a market participant is missing (government spending should appear in the GDP calculation formula), and the second is that in 4. the reason for "(because)" and "because~" is not set as a proposition, since the 2 is not passed on to any of the citizens, which means it went abroad. The reason for "because" is not set as a proposition.
Then the government is not a participant (it can only take the same actions as the private sector), and the "yen" is credited without the presence of the government. Then, the action of 'I studied macroeconomics because I don't understand the meaning of news like "real GDP is negative"' is itself an attempt at a false understanding.
Manage
4 years ago - nice!
Yu Kobayashi
Yu Kobayashi Sorry, Japan, not only real GDP growth rate, but also nominal GDP growth rate is negative...
Manage
4 years ago - edited - nice!
Masaki Iwata
Masaki Iwata Yu Kobayashi: Deflator has been negative since 1995
Manage
4 years ago - nice!
Yu Kobayashi
Kobayashi Yuu GDP deflator, if it grows positive, it will be the first time in 17 years (not '95, not '97?)
Manage
4 years ago - edited - nice!
Masaki Iwata
Masaki Iwata The reason why I've been rambling against 4.~ from the beginning is because I think the proposition itself is wrong for the original ~ to be understood. I think that is the reason.
Manage
4 years ago - nice!
Nishio Hirokazu
Nishio Hirokazu Well, I don't mind if you conclude that I tried to understand incorrectly, but what I wanted to do was to "understand what GDP is", and for that purpose, I made a country with only two citizens and examined what could be included in each element of the identity equation. I then started to consider what could go into each element of the identity equation, and I came up with a number of propositions, "If my understanding is correct, then this proposition is true, but it doesn't feel right. I listed them here.

Therefore, I have no objection to the statement in 4, "When government expenditures are recorded, they can only be considered as imports," whereas "acts that are not imports, such as currency repurchases, are not recorded as government expenditures.

So what about deflators and the difference between nominal and real is off-topic, right? Or am I still wrong in my understanding that this is off-topic?
Manage
4 years ago - edited - nice!
Yu Kobayashi
Yu Kobayashi Sorry, I am only talking about the "news that real GDP growth is negative" deflator.
