Transcript of BMOT 4th
Transcription of remarks from [BMOT Special Class #4 "Intellectual Production"].

Nishio: In the event description of Mr. Tachikawa's event, it is written as follows. Nishio: In the announcement for Tachikawa-san's event, it is written, "Since the characteristic of Nishio-sensei is that he digresses from the topic at high speed, he may not talk about books as much as you might expect. I thought that was a great thing to write in the event announcement, but I would like to talk about what a "derailment" is. What is a derailment?
Tachikawa: (laughs) I already feel like I'm getting sidetracked.
Nishio: I was planning to talk about what a derailment is, so it is not a derailment. I think derailment is a metaphor for a train. There are rails and a train running on the rails. The train is running on the rails. And when the train goes off the rails, it is a derailment. But I think this implicitly assumes the existence of rails. So, this class is a physical education class, and this event must have started with the decision not to prepare the rails in advance, so I wonder why Mr. Tachikawa thinks there is a derailment and ・・・・
Tachikawa: Because it is easy to understand. I affirm that it is a derailment.
Nishio: I see, I see. You said derailment is positive. When you say derailment is affirmative, what benefit do you see in derailment?
Tachikawa: What advantages are there to derailment? I wonder. I wonder what it is. In the first place, I'm affirming it. I'm going to derail the train. I mean, this is a class based on the concept that we are not running over the tracks. I'm affirming it in the sense that I'm following the concept properly.
Nishio: I see. I see.
Male: Is derailment subjective?
Nishio: Derailment is subjective....
Man: I feel that way.
Nishio: Yes, that's right. When there is a rail that says "this is how it is supposed to be," and when one deviates from that rail, that is a derailment. I don't have rails, and I feel like I am running in a field in any direction I want. If you have a rail planned, you might find something interesting away from the rail. This is supposed to be a flower. But you can't go this way. But if there is no rail, you can go freely like this. But if there is no rail, you are free to go this way or that way. So when there is something interesting, we can move in that direction immediately. You can react immediately. You can go to something interesting right away. I think this is the advantage of having no rails.

[https://gyazo.com/09f6af65238f9b71b8821a71569aec9e]

Man: I was thinking. It's like an airplane. In short, there are no tracks, but there is a fixed air route, and the plane flies over it. However, I have the image of a train running in a certain direction with a destination, while an airplane has a final destination. Dr. Nishio's story makes us think that we don't have to run around on a grassy field and end up there. We are allowed to participate, and I have a selfish expectation that he will lead us to the goal.
Nishio: I see. You said you have a feeling that you want me to lead you to the goal.
Man: Like the end of the lecture.
Nishio: I see. Leading to the goal. For example, if you declare in advance that this is the goal and try to reach it in time, it is quite difficult. The reason is, think of this as a map. Let's say this is the goal. If you run here and find something interesting while you are going this way, you will not be able to return in time if you go this way. There...
Man: It does come at the expense of fun, doesn't it?
Nishio: There is something interesting to talk about over here, but the schedule is to talk about the slides, so we have to talk about this one. But then he says, "Well, I'll go back to the slides," and then goes on to talk about the rest of the slides, and so on. In other words, the class is designed to run on a rail that has been created in advance. I often give such classes, but when I am asked to give a one-hour lecture, I think there is nothing I can't do if I use this style. In many cases, people expect me to make slides, so in those cases I make slides, but then my metaphor is that it becomes a one-way device like a TV that drops information in a one-way manner. One-sided. That's exactly how I imagine this area to be like a TV.
Male: When you say "goal," it sounds like you have to reach somewhere, but when you say "goal" in the same way, it's not about reaching somewhere, it's about exploring...
Nishio: I see.
Man: Let's take a broad look....
Nishio: Yes, that's right.
Male: Like thinking of it as an area.
Nishio: I see.
Male: I think you can see it as a goal.

[https://gyazo.com/95293878d4bfca18343843a4dd5b3b82]

Nishio: That is a very interesting angle. A goal is a metaphor for an objective, and the goal is to reach it. For example, when you go hiking, your goal is not to finish the hiking course in time and come back, but to climb a mountain and find a very nice river halfway up the mountain, and while you are playing in the river, the sun is gradually setting, so you may decide not to climb the mountain and come back. If we were happy when we came back, that would be fine, right? If you are happy when you come back, that's fine. It is not right to be in a hurry to get to the top of the mountain and come back down because time is running out. The purpose of hiking is not to follow the planned route, but to enjoy the process, or to look around and see the good scenery.
What is the purpose of hiking? is to enjoy the scenery. I thought it was very similar to that relationship. So it's a hike without a set course. You don't climb the mountain, you come down.

	The word "[hiking]" is unconscious here.
 In "The Engineer's Guide to Intellectual Production," p. 128, "[Mountain-climbing-type books and hiking-type books]", he introduces the story that "hiking-type reading is not about reaching the top of a mountain, but about enjoying the scenery.

Shall we go back for a moment? Is it okay to go back? Does anyone have any questions or tweaks? We talked about rail metaphors. We did not talk about a network of associations. It looks a lot like this hiking trail. This is a map. There is one piece of information and another piece of information, and this and that are connected by association. This is the information for each of them. The words "goal" and "objective" are very similar, but they are not the same. Whether or not you are going to climb a mountain and come up the course properly is another story, and the two are related but not the same. The fact that the associations are connected and talk about various things is an association that is very similar to the association of walking along a hiking trail, finding something interesting, and following the associations.
It's [an analogy]. The keyword hiking was not planned, so it is generated exactly here. There is a similar structure between hiking and association. In other words, there is an analogy between the two. By following this analogy, many interesting things can be created.
Let's dig into the analogy, let's talk about analogy in the MOT sense.
There is a paper titled "Developing Innovation Based on Analogy. What is it about?

	[Analogy and Innovation]

Tachikawa: Are you okay with the word "analogy"? I imagine that some of you might not actually know what analogy means. What is an analogy?
Nishio: Who says I don't have to explain what an analogy is? About half... Well, let me explain the analogy. It is quite surprisingly difficult to explain analogy, though.
For example, the price of a certain commodity goes up. This phenomenon and the phenomenon of a kite flying kite flying. Logically, there is no relationship between them. There is no objective logical connection at all.
In between, we can find subjective similarities, such as "Hey, is this similar? We can find a subjective similarity between the two. First of all, there is no relationship. But what if we were to subjectively find a relationship between the price of a product going up and an octopus flying a kite? As an example. Since this is subjective, there is no objective correct answer, so if I were to venture to find a relationship, I would think about what I could say.
This is subjectively thinking about what would be happening when the kite is going up if it were me.
When a kite flies, the wind blows. The force of the wind makes the kite fly. So what is the equivalent of wind here? When I wonder what it is that blows in the wind that contributes to the increase in the price of a product, I wonder if it is the attention of the customers. If you imagine a wind blowing and a kite flying, what other things can happen at that time? What other things happen before or after the wind blows?
For example, this is really subjective, so there is no correct answer. You may be wondering what the correct answer should be. I think this analogy is subjective, so let's say it is a memory from when I was a child, and the wind was so strong that the string of my kite broke and it flew away. It was too windy. It was too windy.
Then, what does the phenomenon of a kite flying away because the wind is too strong in kite-flying kites mean when we bring it back to our world? What does it mean in terms of products when the attention of the customers is so strong that the price of the product...tears off and flies away?
Men: Premium price?
Nishio: I hear it will be priced at a premium. Yes, that's right. Or, the supply of products would not be able to keep up. So bad things like that can happen. By having too much attention from customers.
I connect these associations to develop things. This is very subjective, so what is derived from it differs from person to person. But what this study is doing is that in an engineering consulting firm, analogies are frequently used in the creation of new products. 12 of the 16 people interviewed said they frequently use analogies, and the study shows that there was a relationship between the products made with various analogies and the products that were made with various analogies. The paper is a study of the relationship between the products made with various analogies and the products that were made with various analogies. There is a correlation between solution authenticity and analogy distance. On the other hand, there is a negative correlation with the duration of the project. So the project duration is worse if you use distant analogies. So, let's not talk about the detailed paper.
In this way, analogy is used to create new things, and it seems to be used in this way. And this time I talked about the "network of associations," and how you connect some trigger or something you are talking about, and connect it and connect it and connect it, and follow it, and follow it, and follow it, and follow it, and follow it, and follow it. I wander around the hiking trail, thinking, "There's an interesting flower over there, or a beautiful flower, let's go over there," and so on, and I weave my associations. I think this process itself is one of the best ways to create new knowledge.
Hiking was not a key word in my bullet point plan for this project.
I don't remember how it came up, but we were talking about hiking at some point...we were talking about railroad tracks, and we were talking about how you can't go there even if there are flowers on the tracks, and then we talked about airplanes and how airplanes can lead you to the goal. We then talked about how airplanes can lead us to the goal, and that the goal is to reach the goal. We started talking about the fact that there is only one final destination, and that this is the only one that will lead us to that destination. This story was about how when one goal is fixed, it is difficult to go in an interesting direction and then have to go back to the goal again.
That's when we started talking about hiking. I heard there were beautiful flowers blooming around here.
So the metaphor of comparing this to hiking was intellectually produced right here and now.
And the next time I write some kind of column, okay! Then I'll write a sentence comparing this to hiking, and then maybe two months later, something like this will be born.

	[Why Invest in Intellectual Productivity] Born out of a conversation at the first BMOT special class
 The analogy between price and kite in this area is discussed on p. 195, "NM Law and Analogy".

[https://gyazo.com/e38b34d3092bcade9a058af4cc8d0dbf]

I was wondering why I shouldn't prepare materials for the class. （If you prepare a rail, you are obliged to follow it within the time limit, and if you prepare a rail, it is not possible to move in a new direction based on feedback from the audience during the lecture. If we had prepared a rail, we would not be able to do that. If you do this, it will never become an interactive class, but rather a one-way class, like watching TV, where you just send information from here to there. The analogy of physical education has been used to explain why such a class is not a class, but this does not allow everyone to participate in the class, does it?
I would get paid if I wrote two pages of something like, "I'm going to write a book. (Laughs) Intellectual production turns into value. (Laughs) I'm back on the track I had planned, but it often happens that the first time I try to explain something, it becomes verbalized.
I think it is more efficient to throw a ball back at someone else than to try to talk about something like this or that by myself. I think that when I throw a ball back at someone else's ball, things are produced more efficiently. I wonder why that is.
The other day, I was walking along the street with Mr. Tachikawa. I don't remember why we were walking, but we were talking as we walked a very long distance, about one station or so, and for some reason thinking together is more efficient than thinking alone. We would say to each other, "I'm thinking about this, this, and this. Then we would say, "This is what I'm thinking about," and then we would talk about how we think it should be. I was talking about how productive these conversations are and why they are so productive. I think it is important that the stimuli that trigger our thinking come from outside. So, in the typical classes and lectures you attend, information comes in one-way and you don't have time to think about it.
Because, information is coming in at a very fast pace. On the other hand, if I were to give that style of class, I would only speak in one way, and there would be no room for your feedback. The reason for this is that, for example, if I prepare slides for a one-hour class and think that I have to speak on those slides within the hour, there is no room for feedback.
And this time, I have only this rail. The bottom part is for the next announcement, so I only have that part. How many minutes do we have left? Mr. Tachikawa.
Tachikawa: Less than 90 minutes to go.
Nishio: I have 90 minutes left. This is a lot of work. This is hard work, he said.
Nishio: So, I would have a really hard time if I didn't get a ball from the audience.
I hope you can understand this. In the process of playing catch with each other in such a way, knowledge is created. In PE, the teacher is always shooting the basketball in front of the class, or throwing the ball against the wall and having it bounce back. I believe that this is not physical education, but rather, it is a sport that involves throwing and catching a ball between you and me, or between you and me, and then throwing the ball back to each other.
That is part of the challenging experiment of this class, and it is a challenge every time we do it, whether it works or not.
Nishio: Yes. Then, those who have questions. Is there anyone who can throw the ball here?
Male: You mentioned earlier about analogy and innovation, do you have a little sample like that?
Nishio: When I started to talk about the sample, I was asked to open this paper, so I can't give it to you right now because I don't have it here.
For example, the structure of a gecko's sucker is used to make a product that adheres to a wall, and the shape of various objects in nature are analogously imitated to make other products. I only remember the example of the newt, and I don't remember what the other 17 were, but it is something like that.
This paper itself is a study of what the distance of an analogy has to do with something, and it has been known for some time that the analogy itself is used.
Male: Do you yourself, Dr. Nishio, use analogies in software development or something?
Nishio: Speaking of analogies in software development, I was recently thinking about creating a program to support intellectual production. I was thinking that since the process is the same as the process of a baby growing up, why not do it the same way? Or maybe it's finger pointing. ・・・・ The developmental process of a baby begins with the baby saying something like, "Wah-wah-wah," and then there's this. Then, after that, they start to point at things like that, and then they start to make noises, and then they start to speak one-word sentences, and then two-word sentences, and so on. Then they begin to speak one-word sentences, then two-word sentences, and so on.
I think search engines are pointing fingers now. Too abrupt (laughs) too abrupt (laughs)

	[babbling] and [pointing] trying to talk

Man: What do you mean?
Nishio: An intelligent being, such as a baby, uses pointing to communicate a pointer to an object in the real world. A search engine is software that returns a link to a keyword or other stimulus when it is received.
I think this is, in essence, pointing. I was thinking that this could be a developmental process, in which the search engine mechanism of pointing is further developed to produce one-word sentences, then two-word sentences, and finally sentences are produced and sentences are returned in response to questions.
If so, there are chatbots. Chatbots are programs that respond to sentences entered by humans, and are called "chatbots." Chatbots usually take one of two approaches: they return template sentences, or they generate sentences and return them. I think it would be better if they return pointing and indicating. But I thought it would be better if it returned pointing and indicating. I thought it would be interesting to have a chatbot that quotes a passage from an existing book and returns the entire passage, pointing out that the passage is actually located in this place in the book.
Sorry. Um, it's too abrupt, isn't it? It was rather too abrupt, I guess.
We thought it would be interesting to turn books into chatbots. If you let it read Jiro Kawakita's books, it would become a bot that talks to you about sentences in Kawakita's books.
The bot does not generate new sentences, but it can read Jiro Kawakita's books and learn to speak Jiro Kawakita's words. A bot that learns by having it read the writings of Fukuzawa Yukichi will speak the words of Fukuzawa Yukichi.
If these two bots are allowed to talk to each other, Fukuzawa Yukichi bot will respond to the keywords in the sentence spoken by Kawakita Jiro bot, and while Fukuzawa Yukichi bot is exchanging something in response, Nietzsche bot intervenes and suddenly starts saying that God is dead. I think that as soon as the keyword "God" is mentioned, Nietzsche-bot would immediately say that God is dead. I think it would be interesting to have something like that.
It's still an interesting base, but I'm not sure how practical it is yet.
When I was asked if I had ever developed software by analogy, that was the first thing I thought of.
Let me give you a more practical example. But, since analogy is so subjective, is it really true? But since analogies are very subjective, they are an important link in the creation of new things.
Man: When you say icons and analogies in that area, you mean trash cans and so on. I don't know if you guys understand what I mean right now. Like saving on a floppy disk. What do you mean by floppy disk?
Nishio: When you delete a file, you can't just drag and drop it into the trash and it will delete the file.
So it was really a metaphor. It would have been easier to implement a metaphor in which the moment a file is deleted, it is gone and can no longer be retrieved. The metaphor of the trash can was used to realize a system in which a file is buffered before it is completely deleted. This is an analogy. This is the analogy of the trash can.
And, for example, if you were a software engineer or an engineer of some kind, what would you think if you were asked to create a time machine? I think you would think that it would be impossible.
In fact, when I asked what the customer was looking for in terms of that time machine, the customer wanted to get back that file that he inadvertently deleted yesterday. I want to get that file back. If there was a time machine, I could go back in time and get it. Of course, I don't think it is really possible to physically go back in time and retrieve the file, but it would be nice to have such a time machine, and that is why the customer may be asking for a time machine.
In the words of a software engineer, that would mean having a backup system that automatically backs up data and allows you to go back and retrieve past data when you realize you have overwritten it. That would be the case.
This is exactly what Apple's Time Machine software has done.
Apple's backup system called Time Machine, which I can't show you because it's on an iPad, but if you press the "Enter Time Machine" button, the folder screen will change to 3D and a time bar will appear here. If you go back in time, you will be able to see files in the past.
So you can drag and drop past files to the current location and get a backup of the older version.
This is an analogy to a time machine, but it is an example of how engineers tend to assume that it is impossible to make a really good time machine, but by showing a real time machine, they are satisfying a need for a certain kind of customer. I think this is a very good example. I wonder if there are any images of time machines out there? I'll do a search.
Apple is very good at working hard in those areas.
This image is important and the folder is here on the time line toward the past.
Like now, today, September 2017. If you click on the button here, you can go back a little further, to the previous folder, to the previous folder, and so on! If you click this button, you can go back to the previous folder, and when you find a file that was here before you overwrote it, you can restore it and get the past file. It's like a time machine.

[https://support.apple.com/library/content/dam/edam/applecare/images/en_US/macos/highsierra/macos-high-sierra-time-machine-documents.jpg]
https://support.apple.com/en-us/HT204015


Men: Can't we go to the future?
Nishio: Hmm? I can't go to the future. Unfortunately. I can't go to the future. I would be surprised if I could go to the future.
Well, let's do a thought experiment. Let's say you had a time machine that went back in time as a backup system.
A time machine to the past. Naturally, in the metaphorical space of time machines, there is also a time machine for the future. So, what exactly is this time machine of the future, when we return to the story of the information system here?
Man: How about scheduling?
Nishio: Scheduling, I see.
Male: It would be good if the state that the computer expects to happen is realized. If the state that you want it to be like this is realized, maybe a time machine.
Nishio: It's about the computer being in the state that the user expects it to be.
Man: I think it could be a program or [a live person], but I think someone like a competent secretary needs this ahead of time. So I prepared it for you. A situation like that.
Nishio: I see.
Man: Oh, I didn't realize it myself, but I certainly need this. I was thinking of making this. I was thinking of making something like that.
Nishio: I see...three ideas came up...this is an interesting story...analogies are subjective, so they don't have to be the same. Each person has a new idea of what would happen if we pull back the analogy and ask, "How about this? Intellectual production is taking place. In this context, which of the following should we implement as a groupware company... There is no doubt that there is a need for schedule management.
If you do something in advance that you want this to happen at this point in the future, it would be nice to have a mechanism that actually makes it happen at that time.
For example, in the future, if a meeting is scheduled for tomorrow at 6:00 a.m. in this room, all you have to do is to show up there. But with a videoconferencing system, everyone's videoconference can start up at that time. So, for example, if you write in your future diary that you will have a videoconference with me, Mr. Tachikawa, and someone else at this time in the future, it would be like a time machine that would take you to the future. It might be interesting to think about it. It might be interesting to actually implement it. I think it would be great if a competent secretary could make it happen ahead of time. Sorry I can't think of anything right now.
Men: Each pattern like a behavioral prediction in a way: ・・・・
Nishio: I see.
Tachikawa: Yes, that's right. For example, with current products, Amazon's recommended products are probably close to that. For example, Amazon recommends books that I think would be interesting.
Nishio: Lately Amazon has been sending products to Edge's shipping office before the order is placed. It's scary, isn't it? They ship before you order. Of course, this is limited to certain items that are easily predictable, but for example, water or diapers, for which there are a certain number of orders, we can anticipate that there will be a steady stream of requests, so we can anticipate the orders and start shipping before they are placed. So, we anticipate their behavior and start shipping them ahead of time.
I think it's amazing that they came up with the idea of creating a system that ships orders before they are placed, but maybe they were talking about a time machine to the future inside.
Analogies are useful in the creation of new things, similar to how the people at Apple must have talked about a time machine to the past and named their product "Time Machine.
Man: If you are talking about the current time machine that you just mentioned, that the old one can be retrieved,
The future ones are, for example, the minutes of a meeting, which already have no content, of course, but if today's agenda has been decided, that much has already been filled in, etc.
NISHIO: To the extent that future minutes are pre...
Male: There is a to-do list that you have to make, but it is not a to-do list. There is a to-do list, but it is not a to-do list.
Nishio: Yes, that's right. It's like when you have to create a file for something, that file has already appeared.
Male: There is an open spot that needs to be filled.
Nishio: If the file is not in your possession but on the groupware, it is almost equal to say that you need to make the minutes and that a space is created for the task and the minutes to be shared, so there is a place for you to write and then you are asked to fill in this space. It's one way that tasks are generated. The things that need to be filled in...
Man: How did this turn into a time machine story?
Nishio: How did we get to the time machine? Explain the analogy. When I went back. I was asked for a specific example of using analogy in software, and the example I gave was so far-fetched that I felt the audience was pulling their hair out (laughs). When I thought of a software example, I remembered the example of Apple's Time Machine software. This is an example of using analogy, isn't it?
When we talked about this, we came to the conclusion that this is a time machine to the past, but if there is a time machine to the past, then naturally there must also be a time machine to the future. This is the space of analogy. There is a space of science fiction metaphor of a time machine, a space of parable.
When we imagine a time machine in our brain, we naturally associate it with the analogy that a time machine can go to the future when we hear that it can go to the past. This is an association.
Male: It's physical education. They're actually going to do it and see what they can do.
Nishio: Yes, yes. That's exactly the kind of association that occurred here, and then, in this world of analogy, it was developed by association.
This new time machine to the future is the key word. What would happen if we were to pull it back to the original world?
In fact, that's exactly what we all experienced here, and that's why I think it's important for us to have this kind of experience together.
Then, for example, you came up with various ideas, such as scheduling, or having the computer be in the state you expect it to be in, and so on. This is one way to generate new ideas. This is a concrete example of using analogies to come up with new product ideas. After an idea like this is born, it is necessary to go through a process of trial and error, experimentation, and improvement before the idea can be realized. The first step in the process of creating an idea from 0 to 1 is not something that can be done from this backup story.
For example, as it stands now, we have an automatic backup system. Think of an idea for a new product. If you ask me if I can come up with such an idea, I can't.
In such a situation, once you transcribe it to another world, the world of the analogy, the world of the analogy, the world of the analogy, the world of the analogy, the world of the analogy, which is spread by association in another world.
The pull back makes the image appear distant at first glance, but the distant associations occur.
It was exactly like a very physical education this time. Mr. Tachikawa.
Male: By coincidence, we were just talking for about three hours today about whether it is possible to build a time machine at work. I was thinking of a new business venture, and I wondered if it was possible to think of it in this way.
Nishio: I'm glad. That kind of luck, or maybe it was just a little bit of a time machine that happened to be left in my memory...
Since you were thinking about the new business, of course you were thinking about a time machine to the future. So what was left in the corner of your memory suddenly appeared here.
It was the first time for me to be able to improvise and expand the analogy to such a large extent, and it was very interesting.

[https://gyazo.com/4024bb6f94455b64034bf9f22a274669]

Tachikawa: Once I think you were trying to explain something by assuming the word "analogy". I asked him if it was okay to use the word "analogy" as it is, and from there the analogy went much deeper. I asked him if it was OK to use the word "analogy" as it is, and from there, the analogy thing went much deeper. What were you trying to explain with the word "analogy" in the first place?
Nishio: I forgot that. I'm remembering it now. I just walked down the street and found an interesting flower garden called "Analogy"...I just went down the street. I'm trying to remember what I was going to talk about, so please wait a moment.
Tachikawa: As I recall, there was.
Nishio: I was just about to tell you something and the flower garden of analogy was so interesting that I just ran around here a great deal.
Male: Dr. Nishio's book talked about leapfrogging ideas.
Nishio: That kind of story. Did I write about the time machine in my book? I don't remember.
Male: I was thinking that it would be interesting if you could show the results of your intellectual production techniques at this point in the discussion, like you guys are going to come to this point in the discussion. I thought it would be interesting if you could show us the results, if you could show us the signs of what you've done so far.
Nishio: You mean as a time machine in the future.
Man: So far we have started discussions and set these goals. So far we've had these discussions and we haven't made any analogies or anything at all yet. And yet everyone is coming up with this and that. I think it would be interesting to have some information about the possible conclusions that could be reached from the information there, and where we might go from here.
Nishio: It would be interesting to have a software system that could do that.
Man: We've been going off at this rate. The story. It's very interesting to see how the conversation goes in such a crazy direction.
Nishio: That's very interesting, but I'm not sure how to realize it, but I'm often told not to think about how to realize it during brainstorming, so I'll take that first as one of the interesting ideas.
Yes, it would be interesting to have a system that visualizes the direction of the conversation and suggests where we might arrive if we were to go off in this direction.
In chapter 6, 3-5 of "The Engineer's Guide to Intellectual Production," you talk about building a time machine. Actually, while I have this open, I actually have a scrap box where I have fragmented each chapter into pieces and put them all in the scrap box. So it is useful.
The publishers are very reluctant to put it on the Internet in this way. We are in the process of discussing with the publishers the conditions under which they would agree to this.
If it's to someone who has the book, sales won't go down just because you shared it. The publishers are saying, "If it's someone who has the book, that's fine, but how are you going to verify that they have the book? The publisher asked me how I would verify if the person has the book or not. I will think about how to verify it later. I have been talking with publishers about this very thing. If any of you are interested, please let me know later if you can show me proof that you have a book, and I will put it on the Invite page.
Male: It would be so useful to have a search or something.
Nishio: You can search this, and also, since this is cut by section, the images pasted in that section appear here. This is exactly where the analogy comes in. The analogy is to map the space of the assignment to the space of the metaphor, and by returning the associations in the space of the metaphor to the space of the original assignment by analogy, a new development can occur. The "2-4-1" is the first part of Article 6. This is what is written in Article 6-2-4-1.
Tachikawa: Do you all have any questions? Well, can I ask you a question? I have a simple question.
Nishio: Don't you like digressions? Well, let's just say that I like digressions.
Tachikawa: How many books was this?
Nishio: I think this is the fourth book.
Tachikawa: This is your fourth book, right, and writing four books is quite a feat, isn't it?
Nishio: It is hard work.
Tachikawa: I imagine that when you write a book, you have to organize your knowledge after you have put it out there. I wonder how you organize it.
Nishio: That's a tough one.
Tachikawa: In essence, all of the questions were asked with a key in parentheses, "How is it that you seem to be so bad at organizing, yet you do it so well?" Tachikawa: In short, all of the questions are in parentheses.
Nishio: I was wondering how you can organize information and turn it into a book when you seem to like derailing and are not good at organizing. I think it's a different activity, or a different state of mind, to derail in this real-time setting and to organize when you are alone and confined to writing. It's... I don't know if you can find that if you do a search on organizing. Because I don't remember myself.
Tachikawa: I asked this question because I thought that by asking this question, for example, it would provide a clue to the process by which those of you who attended today would be able to digest what you heard today and make it into your own flesh and blood.
Nishio: It says in the book that first you write it down and then you lay it out. That's right. You write it out first.
The book says to write them down, make a list of them, and summarize them while looking at the list. Then I summarize them and write them down. Let me give you a good example. I often write things down on sticky notes and organize them. It's called the KJ method. This is a version I tried on a paper folder, but it didn't work very well, so I don't recommend it.
This is a class I gave at the University of Tokyo in March, when I had to prepare a one-hour class, and I wrote down all the ideas I had for what I was going to talk about on sticky notes. This is what I tried.
I tried this using A3 cardboard, but I found that one A3 sheet was not enough space for one class, so I thought I needed more space.
Here's what happened to this folder made with the KJ method. I was asked to talk about this at the University of Tokyo's Department of Economics.
He would hmmmmm and hmmm and hmmm and hmmm and hmmm and hmmm.................
The reason for this is that students in the economics department are a different type of audience from those I have spoken to in the past, so I have to think about what I will say to a different type of audience each time. I have just realized that there are 122 pages of slides after I have written out what I am going to talk about.
We did something like that by making the sticky notes I mentioned earlier and organizing them. That's what it looks like.
Man: Do you imagine each one of these scrap boxes like each one of these sticky notes?
Nishio: When I first started using the scrap box, that was my intention, but I found that it didn't fit. I'll tell you why in a moment, because I remembered a good page. The reason is, the granularity of information written on a sticky is much different from the granularity of information written in a scrap box. I showed you this earlier, but I realized after publication that I had not written anything about what to write on a sticky note in the book "The Engineer's Production Technique.
I thought it might be hard to get an idea of how granular the information on a sticky note is.
This is what I thought of as a supplement. Sticky notes are really just words or short sentences, but this sticky note says, "If you're having trouble thinking of something, write it down first. I write a picture or a graph or something like that. For example, when I write a long sentence on a single sticky note, the second sticky note is attached to the bottom of the first sticky note, saying that a smaller unit is better.
This is the kind of granularity I use on these stickies. That's one line when you look at it on this page in the scrap box.
It's equivalent to one line of this. And since these wiki-style pages in this scrapbox have titles and content, it seems to me that the granularity doesn't match if I have to come up with a title for each one of these sticky note equivalents.
This one page is, after all, a page or a certain volume of a notebook.
I'd like to introduce something that is very relevant to this, and I'm just now remembering it by association.
Some people use something called [information cards]. What is an information card? It is the Kyodai-style information card that Tadao Umesao introduced in his book "The Art of Intellectual Production" in 1969. It looks something like this.
It looks like you can write a lot of sentences on these. Compared to the small sticky note I was handling earlier, I can write a lot of information on it.
What Mr. Umesao said was that a small card can only be used as a notebook. It cannot be used as a substitute for a full-fledged notebook. That is why he said to use B6 size cards. What he is saying is that it can be used as a replacement for a full-fledged notebook.
So it's a place to stock information. On the other hand, this person actually uses smaller B8 size cards as well. This has not been talked about at all, and it has been forgotten, but he has a small piece of paper called a kozane, which is made by cutting a piece of B8-size paper into small pieces.
He was looking at the book and said, this is my sticky note is not this way.
In other words, information cards are used to store a certain amount of information. On the other hand, when you are writing new sentences to formulate ideas, the small cards are used for the purpose of writing down all the thoughts and small fragments and then weaving them together to form a sentence.
That's what he uses too. Small cards are bundled and lined up to form sentences. Put them together and make sentences that flow like this
If you are going to write on a paper, for example, after writing on an information card, a book, or a manuscript paper, this paper is supposed to be crumpled up and thrown away. So there is a separate card that is used as a tool in the process of spinning out the information, rather than being stocked.
The fact that the two are used separately is actually a very interesting point, and the reason why only the information cards have become well-known is because it is difficult to sell these small pieces of paper.
I think I mentioned earlier that this was in 1969, and Post-It notes had not yet been invented.
I'm not sure what year it was that 3M invented peelable glue to make post-its, maybe in a book.
I wonder if I can find a hit if I do a search on 3M. started selling in 1980. So that's about the time period.
Therefore, when Jiro Kawakita was proposing the KJ method or Tadao Umesao was proposing the Kozane method or information cards, Post-it notes with glue on the back had not yet been invented.
Since there have been new technological advancements since they were invented, the methods of intellectual production themselves should be updated to use the new technology. So, I am using paper-based intellectual production now, and I am explaining it, but I really think it should be more digitalized, and I found a tab right next to it. I'm working on this right now.

	This: https://nishio.github.io/grouping/?

Sticky notes can be written on and moved around digitally, and now that we have the wonderful iPad, we can zoom in and out as much as we like, and even arrange many sticky notes in a row. Moreover, there is the Apple Pencil, a pen-like device that can write smoothly, so if we could use it to write smoothly on sticky notes, it would be perfect. I'm working on something like that right now, but the drag is still buggy and it doesn't work. It's not quite finished yet. I'm still working on it, but I'm hoping to make something like this. I've gone off on a tangent so much that I don't know where to go back.
Man: So the KJ method is before post-its?
Nishio: the KJ method was before post-its... the 70's.
Man: You do the KJ method with post-its now, I was wondering who started it?
Nishio: You mean who started using post-its for the KJ method?
Man: I don't know who it is, or maybe I don't even know who it is anymore, but...
Nishio: That's quite a difficult story. My wife is three years younger than me, and she told me that when she was in college, she used to do the KJ method using Post-its in her classes at a design college.
Man: Not many people say out loud that it was my idea.
Nishio: Yes, that's right.
Man: I was just wondering about that kind of thing.
Nishio: No one claims that I started using post-its. Surprisingly. Indeed. That's for sure.
I've been doing a lot of research and I've never seen anyone say I started the KJ method with post-its. So I don't know who is the original, but it is often used.
We talked about the KJ method, and then we talked about the Kozane method. The reason why he did so is that a page of scrap box notes is a larger unit than a sticky note of the KJ method. I told him that Umesao-san used B6 information cards and B8 kozane, and this is how it came to be.
The reason I asked why we were talking about the KJ method is because I was asked how you put that together.
This talk about how to put it all together, the conclusion is that you write it down so that you can list it and look at it.
First, write down the things that come to mind as they occur to you, and then make a list of them. Then, look at it.
By looking at the objects and moving those that seem to be related to each other to nearby objects, a group is formed.
I am doing something like that to put it all together. And I do it alone. If other people stimulate me, it will never get started. I work quietly and silently by myself.

Tachikawa: This is a simple comment, but I thought it was interesting. Thinking and summarizing are tasks that are completed in one's mind, but in fact, they are not like that at all, but are done with one's hands.
I thought that was very interesting. Listening to you today, I thought that it is quite important to move forward with the idea of thinking and working with one's hands as a matter of course.
Nishio: You said it was interesting to be working with your hands. I see. On the other hand, if you were told to think only in your head, wouldn't you find it disappearing as you are thinking? If you were told to think only in your head, wouldn't it disappear rapidly while you are thinking?
Tachikawa: I think so, but I think many people tend to think only in their minds. I think it is quite common for people to do that if they are not conscious of it.
Nishio: When I used to explain this at one of my high schools, I would explain which is easier, mental arithmetic or arithmetic by heart. I explained to the students that it is easier to do arithmetic than to do mental arithmetic. It's easier than mental arithmetic. Except for those who are very advanced in abacus.
Why? Because you don't have to remember.
Tachikawa: I think it would be good if it were more generally known that when one tries to think or scrutinize, the act of thinking is not just done in the mind, but includes moving one's hands and body.
Nishio: I see. I guess it's about moving your body. For me, it is a weight off my shoulders that I don't have to remember it anymore since it is in a form that does not disappear.
I think I am able to concentrate more on thinking because of this, but it is true that there may be things that I am not able to verbalize, but after actually working on them, I may realize that this is what I am talking about.
Tachikawa: Earlier, I was told that a lot of good ideas are born when two people are walking together and thinking about them while conversing. I think that may be part of the act of thinking. Walking down the street. That's what I thought.
Man: Do you write down what you talk about there somewhere?
Nishio: That's not good. I can't tell you what we talked about at that time, so I can't give you any examples. I don't know what we talked about at that time, so I can't give you an example of how something like this was born out of that conversation. We should have started recording at that time.
Tachikawa: We talked about something (laughs).
Nishio: Yes. We talked about how the most important thing we talked about at that time was not one person, but two. I don't think this is it...
Male: Two people can be like a substitute for writing. I think about it alone and put it out there, and then I think about the next thing.
Nishio: Yes, that's right. If you put it out. Inevitably, there is an output. Talking to each other means talking to each other.
Male: I think the reason why two people can make more progress than one person is because they can work out answers in small units, similar to how it is easier to proceed with a large task if it is divided into smaller tasks. Thoughts.
Nishio: Big task, small task. I think that is a very interesting approach.
When you are thinking alone that you need to come up with an idea, you are moving toward a distant and vague goal of coming up with a big idea for a big partner.
If two people try to talk about this, there is a limit to what they can say at once, so they say, "This is what I'm thinking about right now.
The output is cut up into boxes of smaller units, like I'm thinking up to this point, but this part isn't working. When speaking in words, there is inevitably a limit to what can be output within a certain amount of time, so inevitably it is necessary to cut into small units in some way, and it becomes a process of cutting out the important parts and then putting them out. So, when two people are walking on the street, one person will talk for an hour and the other person will talk for an hour and the other person will talk for an hour and the other person will talk for an hour and the other person will listen for an hour and the other person will listen for an hour and the other person will listen for an hour and the other person will respond to the other person's response. That is certainly the case when you are walking. That's what happens when you are talking, isn't it?
Man: Just the two of us. I think it's hard to put into words the things that are bothering you.
I think what you just said is that in order to cut into words, you have to make it small. If you don't make it small, you won't be able to understand it.
Nishio: I see. The unit of information that can be understood by hearing it through the ear has to be very small, doesn't it? You can't just talk about a book's worth of information in a flash, and you can't understand it by listening to it in a flash, so, inevitably, putting it into words means making it smaller. I see. That was very helpful. Thank you very much.
Male: I'd like to continue this conversation a little further. I was thinking about the output of each other, and I was thinking about this diagram. It says that the brain is connected by a network inside the brain and exchanges electrical signals.
If we consider the brain of the person on the left as brain A and the brain of the person on the right as brain B, we see here something like an underdeveloped brain C, which is a combination of the brains of these two people. In short, an output is more than an input, and an input is more than an output.
I was thinking that there is a situation. I just saw this and wondered if brains are a surprise and people got the ability to connect their brains when they got the ability to verbalize what they are thinking using words.
Nishio: I see. By getting the word.
Male: I think that words, or even words themselves, are a means of communication. So, I think that when people are able to cooperate with each other, they can reach a higher level than they could reach alone.
Nishio: In that sense, what happened in the early stages of the history of the human race when language was created was that there was one person who was very intelligent, and this person became a priestess or a chief priestess, and by communicating various words, the other young people could follow his instructions and move like his hands and feet. By communicating words, the other young people would follow the instructions of this person and move like his hands and feet, so that even though his physical power was weakened by age, he had a great deal of knowledge. In short, they are the elders. The elders became an army of living creatures that moved the younger generation, and their brains were connected to each other. This was one of the advances, wasn't it?
Male: On the contrary, I pay a lot of attention. If the elders tell the younger generation to do this or that in various ways, some of the younger generation will learn why the elders said what they did or why they said what they did, and they will learn that the elders have this kind of intention. I also think that when the elders are gone, someone will emerge from among the younger generation who can think about the elders.
Nishio: I see.
Male: That's how society is made, isn't it?
Nishio: I see.
Male: Younger people make use of the knowledge they received from the elders while arranging it in their own way. People's IQ is getting higher and higher with time. The IQ of people in the past was very low. If you think of someone who has more knowledge and is wiser than the elders, the younger generation can learn a lot by listening to what they have to say. For example, I feel that today's meeting is similar to that. That is my impression.
Nishio: I see. After all, people who just do as they are told do not come to think like elders, do they?
I wonder why the elders said that, and thinking about this why is very important, and thinking about this will help me to think in an elderly way in the future. What does this "elderly" mean?
Male: IQ when looked at the community as a whole, what would be the appropriate term? Is it IQ when you look at the community as a whole?
Nishio: I see.
Male: You know how people say that everyone at this company is smart, or that people at this company are generally not very good? I think that's the IQ of the community as a whole.
Nishio: I see. The goal of a company that makes groupware is to create software that raises the IQ of the community as a whole.
Male: I think managers are very conscious of that. On a daily basis. I think everyone is thinking about how to raise the IQ of their company as a whole. I think everyone here is thinking about how to raise the IQ of your department as a manager.
Nishio: How can we enhance it?
Male: I think there may be a clue to that in a place like this.
Nishio: I hope there will be. If everyone is happy with what was created here, we will know [after the fact] that it was a good thing to do this session. Now, if there are no other questions from the audience, I would like to remind you one more time where we came from. By the way, how many minutes are left?

[https://gyazo.com/49030d7e539a95eaf8f4ed6784d5c827]

Tachikawa: Let's give it another 20 minutes or so.
Nishio: 20 minutes to go. So you've been running around derailed for about an hour, unexpectedly.
Male: I was thinking from the point of view of sticky notes and dialogue, where value is created through thought,
When a person uses his or her head to create something of value, it means that there is input, and then he or she thinks about it and creates a little bit of value.
I think the key to success is to output with increased value, and to accumulate that value in any way possible.
I think that writing on sticky notes or having a dialogue with others is a similar way of doing things. By writing on a sticky note, I can put out my ideas as output. By visualizing it, I can eat it as input once again. I think that when you think in your own head, input and output get mixed up before you know it, and you can't build up on top of it properly. In a dialogue, especially when it is one-on-one, what you output, the other person eats it as input and returns with output using his/her own head. By using the same process as a sticky note, you can build up the input and output, and I think the key is to build up the input and output in units of small sticky notes.
Nishio: I see. I see. I will add a little something extra to the input and output it on the spot.
And it's the same when you talk to them, they say, with a little extra. Words are small units, about the size of a sticky note.
Male: I think it could essentially be a sticky note. I eat what I output as another input.
Nishio: Yes, that's right. This person writes a sticky note with a plus-alpha and gives input, and then writes a sticky note with a plus-alpha for that input. This is not essentially different from dialogue.
Male: You mean "I wonder.
Nishio: I see.
Man: Sticky notes are like my past self.
Nishio: I see...your past self. In other words, you are talking to yourself who is slightly off the time axis.
Yes, that's right. When I was writing various fragmented sentences on Facebook, Facebook would show me posts from a year ago, such as "This day in the past. Then I thought, "Oh, that's right!
I was muttering something like "I'm in the middle of writing that right now. The mumblings themselves are small fragments, but if I include them here, they expand into something much larger, which is a good thing. I am weaving sentences while having a conversation with myself from a year ago or three years ago.
I'm going to do the same thing here... Facebook means that what I wrote a year or three years ago will come back to me after a year or three years have passed. And since I have already forgotten what I wrote a year or three years ago, it is very fresh and surprising. On the other hand, since I was the one who wrote it, it is interesting to have a dialogue with someone who is interested in what I wrote, and although the keywords are short, they are words that are the core of information from which associations can be derived and spread. I know I sound like a strange person, but that's the way I put it. So all three have the same composition. I see. That was an interesting point.

[https://gyazo.com/bed1de3b171bed732365a66e12af5b85]

Nishio: I'm trying to remember what the original scenario was, so if you have any thoughts in the meantime, feel free to pester me further. Tachikawa-san pointed out how to put it all together, and we talked about putting it all together....
Man: I was wondering why we were talking about doing analogies before that...
Nishio: Why did you talk about analogies....
Man: Why were you going to do it? And do you understand the analogy? I was just saying.
Nishio: I see. I don't know what the gap was between here and there. I don't know either.
Male: Wasn't it written in that first one? To Agender.
Nishio: I don't see the word "analogy" in agender. It says "associative network. I am talking about hiking in the direction you want to go, following the associative network.
Man: Something about innovation titled...
Nishio: The paper. There was. Before I got there, I compared hiking with speaking in a lecture, and I said, "This is an analogy, isn't it? I started to say, "But," but Tachikawa-san asked me if I had explained the word "analogy" enough, so I started to explain what this analogy is. So, if I go back to the point before talking about analogy, I will return to the path I originally planned to take.
Would that be okay? Anyone who would like to explore the analogy further?
Mr. Tachikawa, I am now trying to go back to before the analogy was discussed.
So, we talked a bit more about trying to explain and being verbalized. I think what I failed to do last time was that the conversation expanded through associations, but because of the network situation at the venue, we were not able to broadcast the event and I did not record it because I thought not many people would listen to the recording, so I was unable to transcribe it. So, I thought that I should record the meeting when I had the possibility to come up with something interesting and associative. So this time, I recorded it. Actually, I was going to start recording here if I forgot to do so during the previous talks. I thought it was almost time (laughs) and that I had about 10 minutes left. So I am recording this time.
I will do something later to listen back or transcribe it myself. By the way, here is a page about what we did last time.
Last time we experimented with doing an online community at the same time as classes. This scrapbox is a collaborative editing system. Let's all go into the scrapbox and write here together first. And then say.
We started with everyone writing things here, and then we got into the story as we were writing here.
This was very unfortunate because we did not have Wi-Fi available at the venue, so everyone could only write from their phones, which was a bit of a failure, so we decided to have Wi-Fi available the next time we did it, but we did not make it this time. This was also quite interesting. While I was talking, I wrote down what I was saying and questions about what I was saying, and it was interesting to see how it developed with multiple people writing in real time on the scrapbox. How many minutes left?
Tachikawa: About 10 minutes to go.
NISHIO: We have about 10 minutes left. I was planning to talk about the story leading up to the writing of this book and the story after the writing of this book (laughter), but I thought it was going to be the main part here.
Tachikawa: As expected.
Nishio: As expected...
Tachikawa: Every time I give a lecture, I think of something I noticed or something I think would be good to do next time, write it down, and share it later.
The first is that Dr. Nishio often does searches during his lectures, either on Google or in his scrapbook. He thought it would be nice if he could reduce the amount of time he spends on these searches. Surprisingly, everyone waits for a long time for the search results to appear, and even if it takes only 10 seconds, that's a lot of time spent for 10 times the number of participants. I thought it would be interesting if we could devise a way to shorten that time.
The other thing is that I've done it four times, so I'm aware of it,
Every time, it's usually the last 20 minutes or so that are the most interesting. It's strange, but this class always starts slow each time. It's because the second half of the class gradually gets more and more interesting. It's the same for all of them. I thought, "I'd like to do some homework on how to make the last 20 minutes interesting from an early stage, for example. These are the two things I want to share with you today.
Nishio: How can we get this last 20 minutes of tension from the beginning early on, if for the first time, me and Mr. Tachikawa walk together and discuss it, and then come back and start by saying, "We talked about this earlier..." (laughs).
I think it's probably starting with the engine running. It's a bit spicy, but that's what I'm trying to do.
Tachikawa: Just to clarify, do you actually have your own subjective view now that the last 20 minutes are the most exciting?
How many of you honestly thought it was interesting after 8:30 or so?
Men: It was funnier before.
Tachikawa: Was it interesting before? Yes, it was. The feeling is different.
Nishio: Tachikawa-san, you've heard it four times, so you must be used to it by now.
How do you put it all together? Or, do you just throw the ball around knowing that you've read the book and that the answer is in the book?
Tachikawa: Yes.
Nishio: Right? It's tough because I look at things from the perspective of a supervisor, or rather an organizer, who is in charge of how to make the meeting more interesting.
Man: It was good.
Tachikawa: Good.
Nishio: It seems that Mr. Tachikawa found it more interesting than he expected. I am glad. I am glad. But how can I get to this 20-minute tension... If we exclude the warmth of the venue, I think the only way is to let me start speaking earlier. I think the only way to warm up the audience is to start me speaking early. When I gave a presentation at a reunion the other day, one of the people who had been with me since elementary school said, "You haven't changed at all. I was just wondering if that was true.
You are kind of in a flow state. You are immersed.
Male: But I think maybe it's the warmth of the venue that you all started talking about in the audience. I think it's a good thing that we have two hours, so it takes an hour and a half to warm up the room. If it's one hour, it's only half an hour.
Nishio: I see. So, the interesting part is when you start out in a situation where you have not prepared anything at all, and the audience gradually warms up to you, and they start to say various things, and that triggers the cycle to start turning. That's when the cycle starts to turn, and that's what's interesting.
Man: That's the way I think of myself.
Nishio: There is pressure on me every time.
Tachikawa: I think the frequency of your questions is increasing. Obviously.
Nishio: The frequency is clearly increasing.
Tachikawa: That is the case every time. I wonder if we can make some effort to move up the time when many questions are asked.
Nishio: Yes, that's right. This venue is full of questions. We talked about how it would be good if this venue was warmed up in advance, and as a discussion that came up at the last reception, we thought it would be good if we drank alcohol in advance (laughs).
I thought it would be a good idea to do the get-togethers first. The reason I ask is that Mr. Tachikawa is very interesting at every reception. I was told at the last reception that Mr. Tachikawa's talk at the reception was more interesting than my talk, and I was just in time to announce the next meeting. I was thinking that it would be good to have Mr. Tachikawa speak at the next reception because it would be very interesting. I was not involved in any of the activities, but a volunteer alumnus asked Mr. Tachikawa to speak at the next meeting. The next meeting will be held on November 7 in a room on the 5th floor of this building. If you are interested, please come and join us. I know that those who are participating this time are collecting e-mail addresses on the participation form, right?
I believe an announcement will be sent to that e-mail address, so if you are interested, please join us. I think that Mr. Tachikawa's talk is really interesting. Mr. Tachikawa is a marriage counselor, isn't he? After graduating from Tokyo Institute of Technology with a MOT degree. Why did you start a marriage agency? I can't answer that question. I'll leave that for the next time, but a marriage agency is an activity where there are men who want to get married and women who want to get married, and the goal is for the two to become compatible and form a happy family, isn't it?
I'm not good at communicating with other people's feelings and emotions. I don't know how to put this into words. I don't know how to compare it, but it is very interesting to hear how Mr. Tachikawa manages to run a successful marriage counseling center while worrying about it day in and day out.
Maybe they probably don't talk about specifics, like this kind of man and this kind of woman.
I don't talk about specifics like that, but I do try to abstract or obfuscate them to a more universal form, and then I try to think about human communication, and how to make people's emotions and feelings more positive.
For example, a person who was in a negative state like "I can't get married. For example, a person who was in a negative state such as "I can't get married," was converted into a positive feeling that he/she can get married. I think it would be interesting even without alcohol, but if not, I would be happy if you could give us an interesting talk even if we have to drink alcohol in the middle of the meeting.
Is it safe to end this class like this?
Thank you very much for your attention. Since this is the first time for me to make an announcement at the end, I was a little concerned about using up all the time until I ran out of time to make a proper announcement.
So in a way this was the goal. A goal to be reached. I think I went through a warp at the end.
I am glad that we managed to achieve our goal of making an announcement. Thank you for your kind attention.