Body Enlargement
>In abstract algebra, especially in body theory, field extension is one of the basic tools for describing the structure and properties of a body.
[Body enlargement - Wikipedia https://ja.wikipedia.org/wiki/%E4%BD%93%E3%81%AE%E6%8B%A1%E5%A4%A7]

I don't want to be mathematically rigorous, so I'll write softly: when you have a set and there are laws that are established within that set, you can create a larger set by adding things that are not in that set and still trying to maintain the laws as much as possible. This is often beneficial.

For example, when I was small, I had a set of numbers "1, 2, 3, ..." even vaguely, and the law of addition was established within that set. If we insert the law of subtraction here, we get, "How about two minus three?" I can't!" It became "I can't!

To this set of numbers, we add a "negative number", a number that is "non-existent" in the sense that -1 apples are not real. In doing so, the law of subtraction becomes a simple definition that is always viable.

Similarly, by adding the concept of imaginary numbers, which are not real, it becomes possible to rotate by multiplication and describe oscillating phenomena more easily.

I began to think of a "vector" with N numbers in a row instead of just one. This was also a non-existent number in the sense that "there are not (1, 2, 3) apples," but it was convenient for expressing things like speed.

Think of a "matrix" aligned with N*M or, more generalizing, N*M*L*... and consider tensors lined up with "M", the original ordinary numbers being "scalars" and "zero-order tensors", vectors being "first-order tensors", and matrices being "second-order tensors".

Various other extensions have been made, such as adding "infinitesimals," adding "infinity," making functions a type of number, and so on. The most useful of these extensions are often used. It is interesting to note that the concept of numbers is not an innate one, but rather an object that is created by people and evaluated according to its usefulness, just like a program.


Related:.
	[hyperquasi-analysis - Wikipedia https://ja.wikipedia.org/wiki/%E8%B6%85%E6%BA%96%E8%A7%A3%E6%9E%90]
 [Surreal number - Wikipedia https://ja.wikipedia.org/wiki/%E8%B6%85%E7%8F%BE%E5%AE%9F%E6%95%B0]
