2018-11-29
The concept of "[trashing]" the programmatic mechanical contributions to Scrapbox makes it uncomfortable.

On the other hand, cold start issue where it is difficult to perceive the value of linkage bonding without a certain amount of information.

This is an example of an unexplored name book that started after mechanically plugging in auto-generated content with a fairly high degree of garbage.

This is a mental model in which a human being "[cleans up]" a pile of garbage created by a machine.

When originally separated projects were exported and merged into one, the original creation date and time could be retained, so if merging was done after some time had elapsed since generation, it was possible to flow into the past data without contaminating new arrivals.

If past blog posts are merged with the actual date and time they were written, they will not appear in the updated list. But they will appear in the search and random view. And so on?

Mechanically generated is created separately from the main project

The concept of "[rotting]" [decomposition] in a positive sense.

Past output to [compost

Concept of [Tsuji Bracketing

Composting even other people's work

Related article recommendation by word frequency etc. is not good because the words to be selected are not good, and manual bracketing is human annotation of "good keywords" and "I would be happy if articles in which those words appear are recommended in the future".

The dilemma is that if you want to stream other people's work due to copyright laws, it has to be private, but for the sake of social triggers, you want the main output to be a public project.

The Everything and Everything [Composter] PRIVATE Project."
	[Composter - Wikipedia https://ja.wikipedia.org/wiki/%E3%82%B3%E3%83%B3%E3%83%9D%E3%82%B9%E3%82%BF%E3%83%BC]

We need a system where the composter is the hub for proper merging and updating.

What you should avoid is "overwriting a page with the same title if it happens to exist", so you can check it in advance and merge the contents or make it a separate page.

>Most of the garbage (about 80% w.b.) is water.
Most of the text is also unnecessary filler

Walking is a mess, you don't always get a solution to the problem you want to solve.