2018-12-01
The project [to Scrapbox the intellectual production techniques of engineers] was [rekindled] by the [social trigger] of [the intellectual production techniques of engineers and physical education-type classes].

Summary at this time
	Those who want the experience of reading the book as a continuation can read the book version, so there is no need to be concerned about maintaining the order.
 Multiple people writing in one book is quite a departure from the usual mental model of reading, so it's highly challenging.
	We should first test the hypothesis that the customer value of Scrapbox books is "connected here and there by keywords," which books do not have.

-----
 If Scrapbox had a "sort by oldest created date", each page of a book, etc., could be posted in order and read in sequence.
 	Toshiyuki Masui Can't you sort by "Date created"?
 		I was hoping that it would be in reverse order. Right now it's in order of newest to oldest, so pages created later come on top.

 The experiment of putting books in Scrapbox is not going very well, obviously due to the lack of links.

 Also, I still think people will feel like they can write in, so maybe it would be better to show a sample of how to rewrite it.

 The footnotes are right at the end of the page because you don't want to interrupt the flow but you want them to be close by.

 I've put the table of contents in the chapters now, so the links from the end pages go to the chapters suddenly, but this is not correct from a civil law map perspective, and you should follow the path even if it is a hassle until you have a map in your brain.
		The purpose was that when reading something that is hierarchical, it is good to descend from a large group to a smaller group in order to grasp its position in the whole.
  I put "The Engineer's Guide to Intellectual Production" into Scrapbox, and the next in the hierarchy of chapters is immediately at the end of the hierarchy, and when I first made it so, I thought that it would be tedious to click and retrace, but now I have changed my mind and think that clicking and retracing over and over is important for imprinting the positioning. However, I have now changed my mind and think that it is important to click and follow the chapters many times in order to imprint the position of the chapters.

 Those who want the experience of reading the book as a continuation can read the book version, so there is no need to be concerned about maintaining the order.

 The first hypothesis to be tested is that the customer value of Scrapbox books is "connected here and there by keywords," which books do not have.

 The hypothesis that it would be interesting if multiple people could rewrite the book is a natural idea for Scrapbox, a collaborative editing system, but it is highly challenging because multiple people writing in a single book is quite a departure from the usual mental model of reading.
		Toshiyuki Masui I once tried to read a novel in Scrapbox while editing it together, and it was a lot of fun. I think there is no problem if we work together in a similar environment, right?
  	My interest is in intellectual productivity, so whether it's novel or fun is out of scope.

	I still have a problem with the fact that I made it a joint editing project, which made me hesitant to make major modifications, and I wonder if it would be better to experiment on my own first.


