phase separation
>When two or more substances A and B are mixed, the ease of mixing at a given temperature is determined by the difference in energy before and after mixing (mixing energy) and the mixing entropy. When the mixing energy is positive, the separation of each component is advantageous in terms of energy and promotes mixing in terms of entropy, which is a competition of opposing effects. The phenomenon of separation into individual components is called phase separation. The opposite is the formation of mixed solutions or alloys: for a two-component solution, the solubility curve is approximately as shown in the solid line in the figure, and while the upper part of the curve can be mixed in any ratio, the inner part of the curve is phase-separated and does not mix homogeneously. The dotted line inside the curve is called the spinodal line, and it is inside this spinodal line that phase separation occurs easily. Phase separation in this region is called spinodal decomposition. The region between the solubility curve and the spinodal line is an unstable state where the phases are trying to separate, but are not moving in the direction of separation. As well as such phase separation in multi-component systems, phase separation between different phases of a pure substance can also be considered.
https://kotobank.jp/word/相分離-89670

>Spinodal decomposition is a phase separation corresponding to a change of state from an unstable state to an equilibrium state.
> Phase separation occurs, for example, when a single-phase alloy is quenched and held at a certain temperature in the multiphase region. Assuming that the alloy is in a non-equilibrium state after quenching and that the free energy G is defined, the state can be classified into two types according to the sign of the second-order derivative of the free energy with respect to the composition C.
> The positive state is called [metastable state]. In this case, the free energy increases due to fluctuations in concentration, and phase separation requires nucleation.
> The negative state is [unstable state], where the free energy decreases due to concentration fluctuations. In other words, the growth of fluctuations leads to phase separation, which is called spinodal decomposition. No nucleation is required, and even with small concentration fluctuations, the concentration difference expands due to the diffusion of atoms. Because the growth rate of the concentration fluctuation wave increases at a specific wavelength, the structure generated by spinodal decomposition often exhibits a periodic modulation structure.
https://ja.wikipedia.org/wiki/スピノーダル分解

http://tanakalab.iis.u-tokyo.ac.jp/research/NormalPS_J.html
