About "The Wrong Two
There are several concepts in this project related to the "wrong two~."
	[false dichotomy].
 [False choice of two].
 [false dichotomy].
 　[I thought there was more than one axis?]
 [三番目の登場人物]
Consider what the boundaries of this concept are.

The [dichotomy] is the idea that the elements of a set S can be divided into sets A and B without any confusion ([MECE]).
It cannot be established if there are elements that are not included in either A or B, or if there are elements that are included in both A and B.
Example: [can/cannot is a false dichotomy].

The [two-party choice] is the idea that one must choose between two [alternatives] A, B.
It is not viable if there is a third option or if both options can be taken at the same time.
When you are torn between two options, you may ask yourself, "Isn't it a false assumption that I have to choose between these two? Isn't there a better third option?" It is important to realize that there is a better third option.

'Is it this gold axe you dropped? Or is it a silver axe?"
　If you assume you have to choose between a golden axe or a silver axe, then you are "choosing the wrong two."
　The correct answer was "neither, it's an iron axe."

関連: 
　Decision quality is 7.7 times better when there are two options versus three options. see [Quantity of Options and Decision Quality].

[Binomial] is the idea that there is one axis, like a number line, with A at one end and B at the other end.
It can also be expressed that there is one value X, and as that value increases, A increases and B decreases.
If you can reduce B without increasing A, it is not possible.
Example: [the opposite of satisfactory is not unsatisfactory].
My use of the word may be a bit out of sync with the dichotomy in the dictionary sense.
　>《dichotomy》In logic, two concepts are in a contradictory or oppositional relationship. Also, to dichotomize a concept as such. Inside and outside, male and female, subject and object, Western and non-Western, etc. Dichotomy. https://dictionary.goo.ne.jp/word/二項対立/
	　Conversely, what is generally called an "A←→B" thing like you are talking about here? A [trade-off] relationship?
		2022-11-26 This, in the first place, this dictionary description doesn't distinguish between "dichotomy" and "dichotomy".
			>Binary opposition (dichotomy, binary opposition) is a term in logic. [https://ja.wikipedia.org/wiki/二項対立 Binary opposition - Wikipedia]
   This dichotomy and binary opposition are different articles in the English version
			[https://en.wikipedia.org/wiki/Dichotomy Dichotomy - Wikipedia]
				>A dichotomy is a partition of a whole (or a set) into two parts (subsets). In other words, this couple of parts must be
 		  >jointly exhaustive: everything must belong to one part or the other, and
  		 >mutually exclusive: nothing can belong simultaneously to both parts. 
  		Yeah, this is the concept I'm referring to by the term "dichotomy".
   [https://en.wikipedia.org/wiki/Binary_opposition Binary opposition - Wikipedia]
   	>A binary opposition (also binary system) is a pair of related terms or concepts that are opposite in meaning.
　　　　Yes, this is the concept I am referring to by the term "dichotomy".
　　　　　Examples: up/down, left/right, on/off
　　　　It gets weirder and weirder as you read on.
　　　　The dichotomy originated in Saussure's structuralist theory, which mutually determines the meaning of the other, as in "good and evil."
　　　　　I'm not talking about that.
　　　　They say things like, "Typically, one dominates the other."
　　　　　That's an idea in some philosophies, I'm not talking about that.
　Use the word dichotomy in the above definition until you find a better word.

関連
from [/villagepump/2022/11/25]
 About "The Wrong Two
 　The original is [false dichotomy], so "false dichotomy."
 　That's what I'm subdividing it into.
 　[False choice of two].
 　　The mistake of assuming that there are only two options.
 　　Which is correct, Proposal A or Proposal B?"
 　　　Proposal C could be the right answer.
 　　　It's not good to be [narrow-minded] about two options.
 　[false dichotomy].
 　　The mistake of assuming that a given x belongs to one of two sets A, B
 　　"Is x an A or a B?"
 　　　If A and B are not [MECE], then x can be "neither A nor B" or "both A and B".
 　　　Even if A and B are MECE, they can be both if x is not a point of no magnitude
 　[false dichotomy].
 　　The mistake of assuming that some x is on the A-B axis of conflict.
 　　"If you had to describe x on a five-point scale from 'very A' to 'very B,' what would it be?"
 　　A high performance head-mounted display is too heavy and puts a strain on the neck, while a lightweight display does not offer the same performance."
 　　　Performance and low load on the neck are considered on opposing axes.
 　　　Thinking in terms of this axis of opposition unconsciously excludes ideas that do not fit on this axis of opposition, such as "high performance, but used in bed so the weight can be released to the floor".
  [https://ja.wikipedia.org/wiki/誤った二分法 False dichotomy - Wikipedia]
  [https://en.wikipedia.org/wiki/False_dilemma False dilemma - Wikipedia]
  Surprisingly, the English version makes the dilemma the headline.

old title: [誤った2]
