From a Society of Security to a Society of Trust
[https://gyazo.com/b0c806a46d713875ca7611bc650b803d]
	From [Anshin] Shakai to [Trust] Shakai - Whereabouts of the Japanese-style system ([Chu-ko Shinsho]) New Book - 1999/6/1
 [山岸 俊男]  (著)
	[Amazon https://amzn.to/2L78Yst]

	The word "trust" is used in a variety of ways.
 If we take out the common part, we get "the expectation of the existence of a natural and moral social order" (Bernard Barber), but this definition is difficult to use
 Separate expectations for competence from expectations for intent
		There are two types of trust that "spouses don't cheat": "they're not capable of cheating" and "they're capable but they don't do it."
 	[nishio.icon]On the other hand, it might be simpler to say "the ability to overcome temptation" and "the intention to overcome temptation" after assuming that we are creatures vulnerable to default temptation
 The author's idea is to further divide this "expectation of intent"
 	The idea that others will take this option if it maximizes their self-interest, given the mechanisms in place to influence their intentions.
  例
  	If you disobey a mafia boss's order, you will be killed immediately, so follow the order.
   Disobey the village head's decision and you will be cut off from the village, so follow his orders.
  This is called "[reassurance]."
  Reassurance [social uncertainty] does not exist.
  This security is needed in a situation where this security has not been established [trust].

Japan is a trusting society" is an untrue perception.
	Can you trust most people? 47% of Americans and 26% of Japanese answered "Yes" to this question.
 Similar results when not only asking about self-perceptions, but actually conducting a social dilemma experiment. p.30
 	実験条件
   In this four-person experiment, participants do not face each other and do not see each other afterward.
   Each participant is given 100 yen, and each participant donates a portion of that amount.
   Twice the amount donated will be given to the remaining participants.
   This is repeated 12 times.
   The amount earned is paid as it actually is as compensation.
  In other words, if everyone does not donate, your income per donation is 100 yen; if everyone donates the full amount, your income is 200 yen; if everyone but you donates the full amount and you do not donate, your income is 300 yen.
 	Japanese donate an average of 44%, while Americans donate an average of 56%.
  p.46 With a provision to add a fine to the person with the lowest donation
  	Donations increase in both Japan and the U.S.
   Japan 44% to 75%, U.S. 56% to 76%.

	p.35 Lone Wolf Experiment
 	Japanese choose individual behavior irrationally compared to Americans.
	[Error in seeking cause in the mind].

	Deterrence through social systems can reduce social uncertainty and create a "safe" society
 But a secure society does not develop the skills to create "trust" in a situation where there is a lot of social uncertainty.
 This prevents us from getting out of a "secure society".
[https://gyazo.com/06296cb9a8644d94b1fbdec508bff6c9]

第3章 信頼の解き放ち理論

There is a big difference in trust in others between those who dropped out of high school and those who did not. p. 109
