Resignation to rigidity
	Talk about people accepting the inability to change.

	Listening to Complaints about Japanese-Style Large Corporations
		A: Older people who chose to adapt because they thought the company was incapable of change
		B: A young man who is angry with his elders
	There are many situations where B is blaming A.
	B blames A for not changing and I thought he was driving the change, "Hmm?" I sometimes wonder.
		We believe that workflow is something that cannot be changed.
			Why don't you just do it on your own?
				[Don't ask permission if it's a good idea.]
			Obediently comply with requests for tedious procedures.
				Why not just ignore them?
				Why don't you just give it a proper release without devoting resources to it?
				You wouldn't be dismissed for disciplinary reasons, would you?
				Even if you were fired, don't you have a new job?
		I have a set career path and I think I'm on my way up.
			No, it can't be.
			There is a "career path" that is verbalized, and it's not the "career head" who is ahead of the rest of us on that path.
			I think it's a classic way to create competition among acorns who don't care about each other, when there are no irregulars among their peers who are willing to ignore the course and get promoted.
	I've been trying to figure out for a while what the cause of the discomfort is, but they B also accept the idea that they can't change

	B "A is wrong, therefore I am right."
		Typical [slave morality] thinking.
		When both sides accept the idea that they cannot change, they both look funny.
		"Aren't they both wrong?" When I see "A is wrong, so I am right", I feel that "B is wrong".

	People who believe that even big companies can change are more interesting to talk to.
		More interesting are those who believe that they can make a difference in a large company and take action!
		And in reality, they have caused irregular promotions, drawn out large sums of investment, and launched new projects.
		Naturally, B gives explanations as to why these actions are wrong, but the more I listen to them, the more I seem to be sinking, my feet caught in a swamp of negative emotions.

 B is also trapped in something.
  It's like [petrification disease], a disease that makes you immobile.
  [learned helplessness].
