Buffett quotes
[Warren Buffett]
	Price is what you pay. Value is what you get.
		The difference between [price] and [value
 Be fearful when others are greedy and greedy when others are fearful.
 	Be greedy when everyone else is afraid, and be afraid when everyone else is greedy.
  [Fear] and [greed].
  [Risk-taking]
 It takes 20 years to build a reputation and five minuted to ruin it. If you think about that, you'll do things differently.
 	It takes 20 years to build [fame] and only five minutes to lose it.
 Risk comes from not knowing what you're doing.
 	Risk occurs when you don't [understand] what you are doing.
	You only have to do a very few things right in your life so long as you don't do too many things wrong.
 	Doing a few things right is enough. As long as we do not do many wrong things.
 Never ask a barber if you need a haircut.
 	Do not ask the barber if you need a haircut.
  Don't ask [stakeholders] for advice. You will get a [biased] answer.
 Chains of habit are too light to be felt until they are too heavy to be broken.
 	The chains of habit are too light to feel. Until it becomes too heavy to break.
 	[Even if]
 It's far better to buy a wonderful company at a fair price than a fair company at a wonderful price.
 	Buying a great company at a fair price is better than buying an ordinary company at a low price.
  The structure of fair and wonderful are interchangeable in English, but it is difficult to translate it into Japanese while keeping the structure.
	  Buying a good company at a normal price is better than buying a normal company at a good price.
 Time is the friend of the wonderful company, the enemy of the mediocre.
		Time is a friend to good companies, but an enemy to ordinary companies.
  	If a business does well, the stock eventually follows.
	 Our favorite holding period is forever.
 	Only buy something that you'd be perfectly happy to hold if the market shut down for 10 years.
 I think you are out of your mind if you keep taking jobs that you don't like because you think it will look good on your resume. Isn't that a little like saving up sex for your old age?

	Diversification is a protection against ignorance. It makes very little sense for those who know what they're doing.

	The stock market is a no-called-strike game. You don't have to swing at everything — you can wait for your pitch. The problem when you're a money manager is that your fans keep yelling, "Swing, you bum!"

	A truly great business must have an enduring 'moat' that protects excellent returns on invested capital.

	I try to buy stock in businesses that are so wonderful that an idiot can run them. Because sooner or later, one will.
		Sooner or later, an idiot will become president, so buy shares in a business that even an idiot can do.

	Most people get interested in stocks when everyone else is. The time to get interested is when no one else is. You can't buy what is popular and do well.

	Success in investing doesn't correlate with I.Q. once you're above the level of 25. Once you have ordinary intelligence, what you need is the temperament to control the urges that get other people into trouble in investing.
 	If you have normal intelligence, all you need is the ability to control your impulses.

 The dumbest reason in the world to buy a stock is because it's going up.

	
