One Night Werewolf Transcriptions 1-2
[BMOT One Night Werewolf #1]
[One Night Werewolf]

Mr. Nishio, Mr. Tachikawa, Mr. Yamada, Mr. Iwanaga and others

Nishio: Yes. I was the fortune teller this time. I thought it was not good because I had divined Tachikawa-san's middle last time and had no information about other people, so I divined Tachikawa-san this time. Unfortunately, Mr. Tachikawa was a villager, so I was in the situation of a villager and a fortuneteller. There are three possibilities that there are two werewolves among the remaining two, or one werewolf, or none of them are here.
Tachikawa: I am a villager, so I thought what Nishio-san said was true.
Yamada: I don't know the situation because I was also a villager and just sleeping again.
Iwanaga: I was a thief.
Nishio: Who did you steal?
Iwanaga: Mr. Nishio. Then it was a villager.
Nishio: Oh. So you are claiming that I lied when I said I was a fortune teller.
Iwanaga: Yes.
Nishio: Why would you need to do that when I was a villager?
Iwanaga: I am not sure about that. I am inexperienced.
Nishio: I see. Either I did that for some reason or what you just said is a lie.
Tachikawa: Why did you bother to appear as a fortune teller when you are a villager?
Nishio: That's why I didn't. It's because you really are a fortune teller. (laughs) You don't talk like you're supposed to be a villager. You are supposed to be one of us, you.
Iwanaga: Rather, we are friends over here.
Nishio: What?
Iwanaga: I believe we are friends here because I pushed the thief and got a villager. So I don't know either. I'm a villager...
Tachikawa: I don't know what that means so.
Nishio: I almost convinced myself for a moment that we are friends now, but from my point of view, I feel that you are definitely lying.
Yamada: Why is it that everyone is saying "friends, friends" but only here we don't feel like friends? I'm a little...
Nishio: We are deceiving each other here.
Tachikawa: I'm not one of them, because Mr. Nishio claims he was a fortune teller.
Nishio: Mr. Tachikawa claimed he was a villager.
Tachikawa: But Mr. Iwanaga says, "No, no, I was a thief and exchanged with Mr. Nishio, but he was a villager.
Iwanaga: I thought he has been playing tricks.
Nishio: So it is possible that I am playing tricks, but it is also possible that I am playing honestly and (Iwanaga-san) is lying.
Tachikawa: What either of them are saying is a lie. Without a doubt.
Nishio: That would be the case. From what these two people claim. Which do you think it is?
Tachikawa: Just too many advantages to lie to each other in this situation.
Nishio: No, no, no, if you were a werewolf, wouldn't it be one option to claim you were the thief?
Tachikawa: Oh.
Iwanaga: 〓00:02:51
Nishio: Because I was told that one or both of the two people I was going to try at first were werewolves, so there was a 1/2 chance that I would be caught.
Tachikawa: Yes.
Nishio: You want to make it sound like I am a liar to reduce that possibility, right, werewolves?
toll of a bell
Tachikawa: But isn't it strange to say that he was a fortuneteller and then go to the trouble of saying he was a villager and then turn around and say that Iwanaga-san is lying?
Nishio: I see.
Tachikawa: Because Mr. Iwanaga can honestly and normally say that I was a thief and a fortune teller.
Nishio: He was a fortune teller, which means he was a human, a thief, and a fortune teller.
Tachikawa: So, he is making the right move as a werewolf. But it is too mysterious that Nishio-san was a villager even though he went to the trouble of calling himself a thief.
Iwanaga: What is that?
Nishio: Isn't that a mistake? Simply.
Iwanaga: Maybe I made a mistake.
Nishio: It may have been a simple mistake, although it was not the optimal means, that is. Although it is certainly more optimal when it is explained.
Tachikawa: Yes. That seems strange.
Nishio: Does it make you feel weird?
Tachikawa: I understand!
Nishio: What? What did you find out?
Tachikawa: Perhaps you saw the villager's camp written at the top and thought it was a villager, but in fact it was a fortune teller! Tachikawa: I think that when they saw the villagers' camp written on the top, they thought it was the villagers, but in fact it said "fortune tellers" on the bottom, didn't it?
Iwanaga: No, I think anyone can tell from the stones. I don't have any proof.
toll of a bell
Iwanaga: I may have missed it.
Tachikawa: No, then it's already decided. 〓00:04:10The destination of the getaway? 〓
Iwanaga: No, but I think it's probably okay. That much is indeed true.
Nishio: Yes.
Tachikawa: I think Yamada-san is the most suspicious of them all.
Yamada: Is that so? Villager.
Nishio: Oh!
Tachikawa: I don't see the point of lying here. If that were the case, they would have talked back to each other. There is no need to say "villagers" at all.
The fact that Mr. Nishio has no reason to lie at all... and when you think about it, it's a process of elimination.
Yamada: I see. If that's the case, well, that's fine.
Tachikawa: (laughs)
Yamada: Is that what you mean?
Nishio: I think I would vote for this one (Ms. Iwanaga) rather than this one (Ms. Yamada), because from my point of view it looks like I am being lied to.
Tachikawa: Three seconds to go.
Nishio: When it chimes, it's time to vote.
toll of a bell
Tachikawa: Yes. I will go.
Three, two, one.
Tachikawa: Wow! One vote each.
Nishio: Oops, one vote each. So let's open it up. It occurs, doesn't it, this kind of thing?
Tachikawa: What?
Nishio: Two people (Mr. Iwanaga and Mr. Yamada) are talking over each other.
Tachikawa: What's that? Ew.
Nishio: So what I said at the beginning was right, because both of them are wolves, and whichever one of them ends up getting hung, the wolf loses.
Tachikawa: Ha - so bankruptcy.
Nishio: It had to be bankrupted.
Tachikawa: So there was.
Iwanaga: At any rate, it is a slight mistake. There's nothing special about this place.
Nishio: All I had to do was tell him I was a fortune teller.
Iwanaga: It should have been done.
Nishio: No, but, in that case, I think this is what would have happened
Iwanaga: Yes.
Tachikawa: You were right.
Iwanaga: As a result, we had to confuse them anyway.
Tachikawa: Oh wow.
Iwanaga: You have to make some kind of confusion in the five minutes. If there is no contradiction, it will be hardened.
Nishio: The only way to confuse the situation was to lie about my being a fortune teller.
Iwanaga: Yes.
Tachikawa: I see. If you think about it, even if Nishio-san was talking about a fortune teller, it would be absurdly risky for me to be a villager. Because there are only two villagers out of six cards. But if Nishio-san said that I was a villager, it was a good thing that he believed that I was really a fortune teller. Now that I think about it.
Iwanaga: So if it was a phantom thief here, what kind of lie would have been best? If it was a phantom thief.
Nishio: I guess I should have claimed I was a fortune teller. I don't know. I don't know which was better, but at any rate, since all four players are dead, but the victory condition of catching at least one wolf has been achieved, can we say that the human side won the case?
Iwanaga: Yes, that's right.
Nishio: That's not a very neat way to win.
Tachikawa: I also thought, if there is one, the fortune teller is me. I divined this place and was a werewolf. So I vote for Tachikawa-san.
Nishio: I see. I see. If I say I am a fortune teller and say that here (Mr. Tachikawa) was a werewolf, then I who said it was a human would also be lying, and the possibility that these two people (Nishio and Tachikawa) are werewolves increases.
Tachikawa: If it increases and Mr. Iwanaga gets on it, the vote will be split at least 2:2.
Iwanaga: No, it is quite possible that I am lying in general. It is more likely that I am lying.
Nishio: It comes down to how persuasively you can tell the story.
Tachikawa: Or it might be easier for the werewolf to win if you say that Nishio-san was a werewolf, because you can create a 3:1 composition. I am a fortune teller, and I told Nishio-san that he was a werewolf. So, Nishio-san is lying.
Nishio: So the story can be told very convincingly that the werewolf first tried to confuse the situation by lying that he was a fortune teller in order to prevent people from thinking he was a werewolf.
Tachikawa: And they are going to try to catch Nishio-san.
Nishio: Moreover, in this case, since I am used to doing this kind of thing and there is an atmosphere of the place that I am likely to do such a thing, I might have been able to afford to lead the audience to such an interpretation.
Tachikawa: This is interesting, including the look back.
Yamada: That's right. I thought I would talk about the phantom thief when I came around first, but I wondered if I could talk about it in a way that would be logically consistent when I did...
Iwanaga: It is difficult. You have to be familiar with it to do it.
Yamada: Yes. So, let's see, you are a villager.
Tachikawa: What should we do about this? Shall we try one more time and sort it out?
Iwanaga: Yes, that's right.
Nishio: Let's do it again. We have only done it twice.
Yamada: Yes. This, by the way, if it's more than two nights, this goes on for several...
NISHIO: It goes on for a few times and then gradually the number of people gets smaller and smaller and so on... the longer one play...
