One Night Werewolf Transcript 1 - Discussion
[BMOT One Night Werewolf #1]
[One Night Werewolf]

Iwanaga: I stirred things up a little too much.
Yamada: It is difficult to create a logical lie.
Tachikawa: It is difficult, isn't it? It is not often that I lie with impunity.
Tachikawa: During business meetings and such, quite a bit.
Yamada: Indeed, indeed. When we have to meet delivery deadlines due to internal circumstances, we have to make sure that we can meet the deadlines.
Tachikawa: Don't let the customers realize when you are like that.
Yamada: Do not be enlightened.
Tachikawa: Can't you really shorten the delivery date any further? It's like. It's really impossible. Call the factory right now, right in front of me. Like that (laughs).
Yamada: It's very exciting, isn't it?
Tachikawa: There are times, aren't there? But those times.
Yamada: Yes, there is.
Tachikawa: Call Mr. XX of the factory's manufacturing section here and now! And...
Yamada: I'm getting nervous.
Tachikawa: Hey.
Yamada: I tried calling different places.
Tachikawa: (laughs)

Yamada: Earlier I thought I was a fortune teller, and Iwanaga-san said he was a fortune teller too, and I thought he was a werewolf, but no one pointed at me...
Iwanaga: I should have also noted who pointed where as a result of the discussion.
Yamada: Indeed. I have the results of the process.
Iwanaga: You forgot to make a note of who pointed the finger as a result of the discussion.
Nishio: Oh - that would certainly have been a good idea. It would have been better to log it. This time I only kept the status. For sure.
Yamada: Indeed.
Tachikawa: Then let's write a little.
Nishio: I will bring the whiteboard.
Tachikawa: How was this? As a first experience.
Yamada: It's a pretty interesting game and everyone is logical...I can't lie well because my worldview is still developing. But it's fun.
Tachikawa: It's fun, isn't it? It would be a lot of fun to do this at a normal sleepover or something.
Yamada: I think I'm going to do it all night long.
Iwanaga: I lied to myself a little too much.
Nishio: Because Tachikawa-san is the first to lie.
Tachikawa: Oh, did you get the flow of lying in the three times?
Nishio: The flow of the game, the atmosphere, and the character of the person who plays the game are all important, and they become more interesting the more times you play the game. It is not the same game every time. You mentioned that it is difficult to tell a lie logically, and since it is difficult to tell a lie, I usually tell the truth while giving an aura that I am telling the truth, and when I am a werewolf, if I casually say that I am a villager this time, most people will believe me. I think it is one option to create an atmosphere of persuasiveness, that I am someone who is always honest.
Yamada: Indeed. I create a character that cannot lie.
Nishio: He says that he is a character who cannot lie, but he lies smoothly at the crucial moment. I think it is more difficult than one might imagine to tell a logical and consistent lie.
Iwanaga: It is difficult.
Nishio: The expression on his face and the atmosphere of his slurred expression make me feel that Mr. Tachikawa may be lying.
Tachikawa: I am often told that I am lying. I guess I have that kind of look on my face.
Nishio: Mr. Tachikawa, you are not good at speaking in an organized manner to begin with, but when you try to tell a logical lie, it is obvious, isn't it?
Tachikawa: (laughs)
Nishio: The other thing that was mentioned was that we should have kept a log of who voted for whom.
Tachikawa: Ho~!
Nishio: I think the memory of what the process was like in those three times is already slipping away, isn't it?
Tachikawa: As for the logs.
Iwanaga: The first tile, the one dealt, and the final landing.
Nishio: I wonder what happened to the ones that were handed out, and then, for example, the thief replaces them or something like that occurs.
Iwanaga: Also, who pointed where are the three basic log elements.
Yamada: Certainly, with that, everyone can reproduce.
Nishio: I feel that perhaps after one of these, I should have recorded it at that time.
Tachikawa: Yes, every time. And if I were to do it, I would have to do it three times and look back at each time rather than all together later, or I would forget about it.
Yamada: That's right. I can't remember if you ask me what it was the first time.
Nishio: The memory has been falsified to a great extent and the interpretation of the facts has become misaligned.
Iwanaga: Would you like to reproduce the logs for a moment, since they are important?
Nishio: Let's try one more play to log one more time now?
Tachikawa: I see.
Iwanaga: Do you remember the log? Do you remember? Like, what was the first one, what was the first position, what was the first position, what was the first position, what was the first position, what was the first position. Can you reproduce it?
Nishio: I don't remember. I don't remember at all.
Tachikawa: 1st position?
Nishio: The first position. My memory is already aware that "Mr. Tachikawa lied and rubbed me the wrong way," but I don't even remember if that is true or not.
Iwanaga: The first time was just me, one werewolf.
Tachikawa: I was a fortune teller.
Tachikawa: The Phantom Thief and the...
Iwanaga: Say it contains a thief and a werewolf.
Yamada: I was a villager.
Iwanaga: The final log is the same.
Tachikawa: Here's the vote. The thieves remain the same and the same.
Iwanaga: As a result who...
Tachikawa: Voting is...
Yamada: I can't remember the vote.
Tachikawa: I am voting for Mr. Yamada.
Nishio: Two votes were collected.
Tachikawa: Maybe Iwanaga-san put in Nishio-san.
Iwanaga: It wasn't as if the four of us scattered and we all died...
Tachikawa: That's the second time. I can't quite recall the last two times.
Nishio: Mr. Tachikawa died, right? As a result.
Tachikawa: As a result, I died.
Iwanaga: I think I was pointed out to Mr. Tachikawa.
Tachikawa: Yes. Moreover, I was the only one who talked most of the time in the first session.
Iwanaga: Yes.
Tachikawa: I was speaking 60-70% of the time. Everyone insisted that they were villagers.
Nishio: Yes, that's right; all three of you claimed to be villagers.
Maekawa: So we can't talk about it.
Iwanaga: I was the first one to claim to be a villager.
Tachikawa: Ah~!
Iwanaga: Fortune-telling results.
Tachikawa: I see.
Iwanaga: That's neutral.
Tachikawa: I see. I see. When you look back, one point is how you could have won, right?
Yamada: There is that too.
Tachikawa: I was a fortune teller, for example. I chose the middle. But I won't tell you the result yet, so please tell me your positions.
Yamada: Lead and go, you said.
Nishio: I see.
Tachikawa: So you would say, "But there were a number of villagers here, so I think it is strange.
Nishio: It is [a hypothesis] that this is what we could have done.
Tachikawa: I see.
Nishio: So that is one possible step to improve from the current situation, although I am not sure if we could have won or not. The next time the same situation comes up, we can test the hypothesis.
Tachikawa: Ah! Nishio. I felt that would be a great breakthrough. In other words, innovation is a result-oriented theory, as we at MOT have often said. If we had done this at that time, it would have worked. Innovation could have happened. Like, "Did we come up with Google in 2001? We should have done it.
Nishio: That is [hindsight bias].
Tachikawa: So you can see that as a frame of reference. Did you actually make that kind of decision at that time?
Iwanaga: One thought that may be a little off, but in terms of strategy for this game, we mainly take one of two strategies. Tell the truth or lie.
Tachikawa: True or false? Yes.
Iwanaga: Basically, there is a point where you don't know if it can be divided into [MECE] or not.
Nishio: I think it would be better to basically say that everything is ambivalent, because if it is known that it is either true or false, it will work against you.
Iwanaga: You have the choice of deliberately lying to yourself or telling the truth.
Nishio: I see.
Iwanaga: There is also the question of whether that is highly established or 100%. If you are the thief, you can't say 100%, can you?
Nishio: I see. What you say you are a fortune teller may actually be rewritten in a phantom thief.
Iwanaga: It could be. The only people who can say for sure are the thief or the fortune teller who saw here and exposed the thief.
Tachikawa: Yes, that's right.
Nishio: I see. But you think it is a certainty even though you can hardly say anything certain about it. You think the result of a fortune teller's observation is certain. How biased human judgment can be.
Iwanaga: So there are two situations. Either you are sure or you are not sure. For the one that is 100% certain, the decision is whether to tell the truth or a lie, and for the one that is ambiguous, it is too ambiguous.
Tachikawa: Because you can't testify. You can tell the truth with certainty, or you can tell a lie with certainty, and as for uncertainty...
Iwanaga: I don't really know what is true or false.
Tachikawa: It's like there is no real uncertainty.
Iwanaga: I don't know that part anymore.
Nishio: Most cases in the game fall on the uncertain side, so if you start saying that, you end up not knowing everything. It's like, okay, let's just catch it randomly then. It falls on that side, and that's not right.
Tachikawa: But the interesting thing is that in this game, there are only two patterns in which you know for sure what you just mentioned. Either you are the thief, or you are a fortune teller and you read the center of the room and found the thief. In this case, I am the thief.
Iwanaga: Or it could be that the werewolf is in two pieces. The kind of certainty is different, though.
	Tip: If the fortuneteller opens the middle two cards and they are both werewolves, then it is certain that "no werewolves are in the field" no matter how the thief switches the cards afterwards.
Nishio: He said he would make sure against the information of where the werewolves are.
Iwanaga: You mean that there is actually a level of certainty.
Tachikawa: There is a level of certainty. I see. There is a level of certainty.
Nishio: In short, you want to win. If you want to win, the information that there are two werewolves here means that you know that the rest are not werewolves, so you have to convince everyone that they are here.
Tachikawa: I thought it would be interesting if we could try this as a trial and then incorporate it into a project, but I felt that this discussion was very exciting to begin with. What I am doing now is thinking hard about the structure of a wargame.
Yamada: Yes, that's right.
Tachikawa: Something that is unfamiliar to you, something that is unfamiliar to you. A respectful wargame. Like the management of the world.
Nishio: [Uncertainty] that this is a task with [uncertainty].
Tachikawa: Tasks. How do you look at it in a structured way? For example, in group work, this group came up with this game system. For example, this is the framework that Mr. Iwanaga gave us. Our group discussed and came up with this framework. I think it would be very interesting to have them talk about it.
Nishio: If you find a [framework] and then follow that framework to increase the winning rate, then such an opinion is a useful framework, but there is no such thing as a framework that is useless for management among the frameworks that are often thought up by management scholars.
Tachikawa: Yes, there is.
Nishio: So we are getting criticism from other sources that we should not become like that. So, the question is, "Does such a framework really increase the winning rate?
Tachikawa: This is not a framework to increase the win rate, but rather a framework that focuses on the structure of a wargame...Now this is a framework that focuses on logic, isn't it? Ignoring logic, I can tell who is lying just by looking at their eyes. I can tell who is lying just by looking in their eyes. I can tell who is lying just by looking at their eyes.
Nishio: I think that the bias toward logic is a [cognitive bias] that tends to occur in MOTs, especially for people in the sciences. The expressions used to make the game convincing are not based on logic, and in fact, there are almost no situations in which we can say something logically certain in this game situation. I think most of the situations are uncertain. So, I have to appeal to the persuasive power of convincing others of my preferred means of not getting caught and not getting killed....
Tachikawa: For example, I think in a completely different framework.
Nishio: Hoho. Everyone is thinking about different things. It is interesting from a group work point of view.
Tachikawa: In other words, there is a pattern of sender and receiver of information. There is a sender axis and a receiver axis. Let's say you are talking and listening. It is easy to understand. There are two types of speakers: those who try to convey that what they are saying is correct based on emotion, and those who try to convey that what they are saying is correct based on logic. In other words, emotion and logic. There are two patterns on the receiving end, too, and this person is probably telling the truth. There are two types of receivers: those who receive the message with emotion, as if their eyes are telling them so, and those who look at what the person is saying to see if it is logically correct. There are four patterns for the speaker and the listener. The one that tries to appeal to the emotions with emotions. For example, some people are bad at reading people's emotions, while others are good at reading people's emotions. Here, you have to write down the bad and the good. There are two types of people. There are bad at it, and my emotions are bad here too. There are those who are good at expressing their emotions and those who are bad at doing so. Some people are good at logic and some people are bad at logic. If you are good with emotions and your opponent is bad with emotions, it is definitely better to attack with emotions, right?
Iwanaga: Yes.
Tachikawa: If you are good at conveying emotions and the other person is the type who listens emotionally but is not so good at seeing emotions, it will go well. On the other hand, if you are a logical monster and you use sweet logic, you will get stuffed.
Nishio: If you make an emotional statement about something, I will say, "Isn't that funny?" I would say, "Isn't that strange?
Tachikawa: Yes, yes.
Nishio: That's because it's a [logic monster] type.
Tachikawa: I was able to organize the framework in my mind. Depending on the angle from which you look at it, you can come up with a completely different story. This is interesting, isn't it? However, this is a very logic-oriented story.
Yamada: Yes, that's right.
Tachikawa: I think that logic is derived from this, but there is also emotion, and that's where we'll be talking about the future.
Nishio: I think that Mr. Tachikawa has drawn a picture as if "conveying with logic and conveying with emotion" are two separate means that can be chosen separately, but I don't think so. I believe that this side-channel information has a great influence on other people's decisions about whether or not to trust what they hear.
Tachikawa: Oh, I see. What an expression 〓00:24:20〓
Nishio: It's a bit complicated to draw a diagram. But the logic you just described was convincing, wasn't it?
Tachikawa: Yes, there is.
Nishio: This is an exercise in persuasion.
Tachikawa: I am now wondering if we are talking about the XY axis rather than the matrix.
Nishio: Hmmm. I don't know. I think it's a bad bias to try to interpret it by drawing a diagram. Of a science person.
Tachikawa: (laughs) I see, it oozes out...
Nishio: He said it would ooze out.
Tachikawa: Nishio-san's worldview is based on logic, and it is something that exudes emotion.
Nishio: Yes, yes. As for myself, I want to convey my message with logic, and I want people to be convinced with logic.
Tachikawa: The image is like a bullet train. It's like a bullet train... It's a logic foundation, but there's something out of it.
Nishio: Mysterious picture (laughs) I don't know why you chose the bullet train (laughs) I don't understand Tachikawa-san's emotion (laughs).
Iwanaga: It is blotting out. The diagram is trying to explain logically.
Nishio: The thumbing that is not logically conveyed is oozing out.
Yamada: I thought that the part that baseball catchers often observe was the very part that bled out.
Nishio: Oh which way are you trying to throw it?
Yamada: Which way are you going to throw it?
Tachikawa: Ah~!
Yamada: Is that how you imagine it? For example, when deciding on a pitch to distribute, I have information about the previous pitches thrown, but the batter has moved a little 〓00:25:58 or is he fixing his trousers? But if the batter moves a little or 〓00:25:58 his pants? I think that gestures and things like that become things that ooze out of the surroundings.
Nishio: Perhaps some people are good at suppressing that oozing so that it does not ooze out, and some people are not good at reading the true feelings of others from what is oozing out of them.
Yamada: Indeed.
Iwanaga: Yes, yes.
Tachikawa: I was thinking more like a pitcher and a catcher, or a pitcher and a hitter.
Yamada: Oh, I see. Indeed.
Tachikawa: In short, a hitter observes the pitcher. They wonder if he is going to throw the next pitch.
Nishio: You mean whether the strike ball is coming or not.
Yamada: 〓00:26:33 〓 indeed.
Tachikawa: That's right. And the pitcher also thinks about the hitter a lot. The catcher doesn't have to think about it. 3 〓00:26:40〓？ 3 〓00:00:26:40〓In the midst of all these people. I was just pulled into baseball, but even if you know that a straight ball is coming, you can't hit it if it's early, right? What does that mean...
Nishio: Let's say there is a person who is telling me very logical things even though I know on my own card that he is lying. If I insist that Mr. Tachikawa is a werewolf, and Mr. Tachikawa is a villager, he knows that I am lying, but there is no room in my logic, so he cannot find anything to break the argument.
Tachikawa: Yes, there is. I think there is.
Nishio: Isn't that the situation? The ball is too fast to hit.
Tachikawa: Oh, that's true. There are so many other ways to escape, but you can't think of any of them, or your mind stops thinking. That's exactly the state of being unable to strike, isn't it?
Nishio: Okay, tempers. So you can talk a lot with logic and [saturation attacks] can occur. By making the other party fill up the room to the brim, the other party stops functioning.
Tachikawa: There is.
Nishio: So that kind of attack is possible.
Tachikawa: It is possible.
Yamada: What I was thinking today was that as a beginner, I would probably not be able to win with logic. I thought there was a possibility that I would be exposed by my emotions, so I tried to tell the truth as much as possible while pretending to be lying.
Tachikawa: Do you tell the truth as if you are lying?
Yamada: Speak. In other words, don't let the lying part come out when you are lying.
Nishio: so that there is no difference?
Yamada: To make no difference.
Nishio: If the difference between when you are actually lying and when you are telling the truth becomes obvious, you are lying now! You are lying now. So, you need to create a character that is always like that...
Yamada: It's like I'm not sure if you're telling the truth.
Tachikawa: That's interesting. Usually, most werewolf players always try to make it look as if they are telling the truth. They try to make it look like they are telling the truth by telling lies...
Yamada: I don't know if it was done, but that was my goal.
Tachikawa: Is there such a strategy?
Nishio: Because each game is completed in a short period of time and can be played over and over again, our perception of the character is subconsciously created, that although what he said the first time was false, he is a person who tells the truth. We can take advantage of this.
Tachikawa: I don't know if I can talk about a winning strategy, but I think everyone can verbalize how they tried to win in their own way.
Nishio: Ah - so that's one now. Mine is to create the impression that this person is a logic monster who is always honest.
Tachikawa: That's right.
Nishio: Then when you are really a werewolf, you can confidently say that you are logically correct but claim that you are a werewolf but a villager.
Yamada: Yeah, yeah.
Tachikawa: Bring the tension between the lie and the truth as close as possible. I get the impression that you are a logic monster...
Nishio: Another thing is to create the impression that I am always honest. That's why I don't do things like the first time Tachikawa-san lied out of the blue. I think I am not good at playing in such a situation because it creates an impression that he is a liar.
Tachikawa: That's right.
Iwanaga: You can only do that if you get a villager card. If a werewolf card comes, I have to lie to get started.
Nishio: It doesn't start.
Iwanaga: I'm starting with two werewolves, so I have to be the kind of character that keeps lying ahead of the rest of the pack.
Nishio: So there is an influence of the tile allocation?
Iwanaga: I lied at the end, but I basically tried to stir up the relationship between the villagers, but without contradiction. Well, I don't know. I think it was a bad move.
Nishio: How do you think you would have played the game if you had been the first villager to draw?
Iwanaga: If I were a villager...I wouldn't be able to say anything ahead of time. Or I could just say that I am a villager, but that would be difficult.
Nishio: Can you verbalize it, Tachikawa-san?
Tachikawa: In my case, I think there are two kinds of talk: conscious talk and unconscious talk. In other words, I think there are strategies that are unconsciously adopted by people who are consciously trying to do things this way. What you have just said is all about the conscious level. I was actually not very conscious about it. I didn't think much about how to win. I was just thinking about what I was doing on an unconscious level, and in my case, I think I was unconsciously trying to lead the discussion.
	Addendum: [unconscious strategy] was not to win the game, but to [lead the discussion
Nishio: He was trying to take leadership.
Tachikawa: He was trying to take it. But I failed two out of three times, but I was still trying to take it. I realized after doing this that there was a way of competing on an unconscious level. How about you?
Nishio: The unconscious level is difficult. On the other hand, have you ever felt that Tachikawa-san is doing something like this when he observes me or others?
Tachikawa: Mr. Nishio, earlier you consciously tried to be logical, but can you actually act in a non-logical way?
Nishio: It behaves in a non-logical way, but I can't image what exactly it means.
Tachikawa: I think there are ways to win, for example, by acting as if you are someone who is not quite sure about the situation and actually stayed quiet but was a werewolf.
Nishio: I think there is of course such a way to win, but it is clear in this situation that Tachikawa-san would see through it if we did so, so we cannot make a choice here.
Tachikawa: Even if Mr. Nishio were to meet everyone for the first time and the people around him were completely unaware of his title, I would still use logic in the same way.
Nishio: But the last time we played with five people, I was in hiding for the first two or three times, playing that I'm new to werewolf so I don't know much about it.
Tachikawa: Ah~!
Nishio: I took the stance that I am a logic monster, but I don't know much about werewolf rules.
Tachikawa: Oh, I see.
Yamada: So it is expressed logically. That's great.
	Tip: When you have a strong interpretation that is inconvenient for you, you point out the fact that "But that's not a logical certainty," or "There are other possibilities," and when you speak or when you have a strong interpretation that is convenient for you, you do not point out that there are other possibilities. Then, when others point out "There are other possibilities, aren't there?" you respond with a response like, "Oh, I hadn't noticed that, but you're right! I didn't realize that, but you're right! I am aware that I am not good at lying, so I say only what is logically correct as much as possible. If the frequency of his statements were quantitatively analyzed, it might be possible to determine if he is a werewolf or not.

Tachikawa: How was it for you, Iwanaga-san?
Iwanaga: I was a werewolf at the beginning. I knew that I was the only werewolf in the first round, so all I had to do was decide who was going to catch the werewolf. I knew that I was the only werewolf in the first round, so all I had to do was decide who was going to be the catcher. So I just had to lie appropriately, and the second time, he talked again, so I just kept talking and talking. I was a werewolf werewolf.
Yamada: Yes, that's right.
Iwanaga: I'm rather reactive, but I'm about the second most talkative after Tachikawa-san.
Nishio: Can't you just shut up?
Iwanaga: I don't. Characteristically. I want to do something.
Nishio: I'm listening to you now, and you are talking about "what about individual strategies," but there are places where you think, "This person is acting in this way," and then you reactively say, "Then let's use this strategy.
Tachikawa: That's talking about the level of consciousness.
Nishio: But in some cases, even if we don't consciously verbalize our intention to do something like this, it is because something happened in a certain way, so we do it in our own way.
Tachikawa: You are further talking about reactions in the area of the unconscious. (Add a line to the diagram.)
Nishio: The number of axes is increasing and it is getting harder and harder to keep track of them. But at any rate, one thing we have learned for sure is that group discussions can be comparatively more lively as a group work by simply playing three times and then having a group discussion, don't you think?
Tachikawa: As I was looking at the game, I thought there were two topics in particular that I would like to talk about. The other is how each of us tried to win the game.
Nishio: Another failure is that there is no log of any discussion, so it is impossible to discuss what could have been done better here. We have forgotten.
Tachikawa: We are recording now.
Nishio: If you ask me if I would listen back, I would not. It's too much trouble.
Tachikawa: It's a hassle, isn't it?
NISHIO: There is no way they would do that.
Tachikawa: If it's garbled, it's still...
Nishio: Unless the letters appear here with a snap the moment they are finished, but I can't expect that, well, let's just say I can't expect that.
Tachikawa: That's right.
Iwanaga: I should have done only those three elements of log work.
Tachikawa: To put it another way, I think it is possible to look back on the previous play just in time, even if it is not left in writing.
Nishio: Play?
Tachikawa: I think it's better to talk about it once and then talk about this, and once and then talk about that, rather than to do it three times and then discuss it all together...
Nishio: It is better to look back on individual games one at a time, but on the other hand, if someone who plays a game for the first time is told to play it once and look back on it afterwards, they can't generalize because they only know just one case, and also, if you divide each time, you tend to go into details for that reason, but I think the opposite is true. Various things based on the experience of three times because it's after three times, when you've forgotten to some extent.
Iwanaga: The general point.
Tachikawa: I see. It is true that the discussion of structure and individual operations is rather general, isn't it?
Nishio: If there is plenty of time, I think it would be better to do three sessions together and have a discussion, then do one session and have a discussion, then do one session and have a discussion, but time is tight.
Tachikawa: The time allotment is now similar to that of the actual event, but I have done it three times, from the entrance to self-introductions and explanation of the rules. I've done it three times. You arrived here at about 8:10 a.m.?
Nishio: about 8:10.
Yamada: Yes, that's right.
Tachikawa: So it was only about an hour and a half.
Iwanaga: But, well, I introduced myself in a certain way, and it was normal. I also explained the rules rather...
Yamada: You taught me well.
Nishio: We did a 30-minute long one.
Tachikawa: Yes, that's right.
Iwanaga: Personally, from now on...I'm asking you to take some sort of stance on this and play the next game. Like, is it an honesty style or...
Nishio: play yourself with language?
Iwanaga: Play. Play with the language.
Nishio: They are going to experiment to see if it works.
Tachikawa: Also, just for fun, I'm going to try to word each strategy and then go around and try the strategy of the person next to me.
Nishio: Oh, I see.
Yamada: I'll try Logic Monster (laughs).
Iwanaga: Interesting but difficult.
Nishio: I guess it's all about individuality...
Tachikawa: It is difficult. One thing that makes it difficult is that it's personal...
Nishio: I'm going to experience it. I see. I dare a logic monster to try an emotional type of play.
Tachikawa: And what happens?
Nishio: It could be surprisingly done.
Tachikawa: I don't know. There may be something unexpectedly done.
Nishio: That is certainly interesting in terms of learning.
Tachikawa: I also came up with the idea of creating a "hierarchy" by comparing this to the business world. The order of speaking would have to be from this person first, and so on.
Tachikawa: Oh, like making a department head or something.
Iwanaga: So the order of 1, 2, 3, 4...
Nishio: So, we have a card for the department head and a card for the scribe who takes the minutes, and the person who takes the logs takes the logs and the department head says great things, and then we create an [asymmetrical] situation, like, "The department head is a werewolf" or "Oh no, this project is bad.
Tachikawa: Ah~!
Nishio: That's kind of interesting.
Tachikawa: I also brought [Avalon].
Nishio: But that's not possible in terms of time.
Tachikawa: It's a tough one. But I thought it was very interesting to create that asymmetrical situation. Moreover, the department heads and section chiefs are explicitly mentioned, aren't they?
Iwanaga: Yes.
Nishio: But we all know that a department head or a section chief is a great person, though explicitly stated, but it doesn't mean anything on this game. On the other hand, the secretary general has control over what is kept in the minutes. He/she can decide what to focus on and what not to focus on. In this position, I think I have more real authority to control the situation.
Tachikawa: What kind of interesting things did you notice by doing that, for example?
Iwanaga: In my opinion, the structure of the wargame is how to find an analogy between the structure of a wargame and a social company. Nishio-san says that most things are uncertain, not certain, which is correct in a sense, but incorrect in another. The thief is basically certain of himself. Therefore, the question of who has the certainty is also important in the company...〓00:41:07〓 but there are people who know that if they only do this, they will make a mistake, or that only this will work, but they cannot be trusted, such as the general manager or the first person to speak. I think there is an analogy between society and the people who are the first to speak or followers.
Nishio: I see. There is someone who knows exactly what is going on, but because we don't know who it is, we tend to ignore what they are saying even though they are right. This is very common in society.
Yamada: Likely.
Iwanaga: There is a pretty good chance that one of the four is a thief, because someone has a 2/3 chance of being a thief. That thief is the one person who knows absolutely for sure.
Tachikawa: By the way, there is a possibility that six people will do it on that day.
Iwanaga: Yes, that's right. If so, the probability would be a little lower.
Nishio: You will have more information coming out, right, and with five or six people, will there be more people in positions?
Tachikawa: The position holders remain the same.
Iwanaga: It does thin out, doesn't it? It's like the villagers come in and dilute it.
Tachikawa: It fades.
Nishio: The number of people who don't have information increases. [Public opinion] becomes more powerful.
Tachikawa: In case you are wondering, this is something for 3 to 7 players. There are 8 cards.
Nishio: I see.
Tachikawa: To put it another way, this game is not designed to be played by 8 players playing 8 cards. It is assumed that there will always be one thing.
Nishio: He said that the definitive information is in place.
Tachikawa: That may be quite a point.
Iwanaga: I think there are two kinds of definite information by social analogy. In this case, there are two types of definite information: the situation where the thief switches the cards here and there, and the fortune teller looks at the cards here and can see what the four of them are sharing the pie. In management, for example, there are people at the end of the research process who know that this is the only thing that will not work and that they cannot achieve this goal, or there are people at the end of the company who know with certainty that the company as a whole will die as long as it is conducted in this way. In other words, there are certainties in the big picture and certainties in the locality, and someone has to know where the certainty lies, and we don't know who that someone is, so basically we are managing uncertainty. I believe that this is similar to the actual field of technology.
	[Certainty of the big picture] and [certainty of the locality].
Nishio: Mr. Tachikawa, I think it would be very beneficial to have a discussion about finding analogies, similarities, and common structures with management in the real world.
Tachikawa: That's interesting!
Nishio: I think we should definitely do this from an MOT perspective. For example, if we hold this meeting once and share the stories that came out of it, I think people will want to attend a second time.
Tachikawa: The similarities are. There are three things that just got me excited as major...points. The individual strategies, the structure of the game, and the similarities with management. This is interesting.
Nishio: I think that if we just share this current discussion in written form, for example, then there will be people who will participate next time. I think this was interesting. The discussion.
Tachikawa: This is interesting.
Yamada: It was interesting.
Tachikawa: It's still interesting. The point is that you can taste it. Looking back at the game.
Nishio: In actual management, the equivalent of this one game would be one year, or three years, and then it would not be so easy to find out that this person was a werewolf, and there are many situations where the answer is not known.
Tachikawa: I don't think Monopoly would be so exciting to look back on.
Iwanaga: There are ways to do it, though. I am sure Monopoly can be done, too.
Tachikawa: But I don't know if I should have built the hotel then. I don't know. I mean, I was so lucky that I can't say.
Yamada: This game has a good degree of uncertainty.
Nishio: Yes, yes. I like that one more round is speedy.
Tachikawa: That's good.
Iwanaga: It would be nice if there was a [gradient of uncertainty]. If everyone knew all the moves, it would not be interesting, and if everyone did not know all the moves, there would be nothing to do and it would not be interesting. It is quite interesting that the design is intentionally biased toward certainty.
Tachikawa: I see. I wonder what I should do. I think it's time to close. I'm thinking about what kind of arrangement would be best...
Nishio: What do you mean by "erection"?
Tachikawa: Without getting too clicky...I'm going to talk plain now. I would like you to flesh out the plain part. Talk about plain talk. I'll either explain the rules lightly or properly. I'd like to have each group break up. Mr. Iwanaga is talking as if he is a member of this project (laughs), but we will be spread out. For example, in each group of 6 people, each person will play the role of leading the game. Well, that's how BMOT participants have been in the past. We'll play the game three times. It takes about an hour from the explanation of the rules to playing 3 games. Then, the rest of the game will be played. Then you can look back on the game. We will present three points of discussion as examples. Please describe the structure in your own words. Second, what strategy did each of you use to try to win? Try to put that into words as well.
Nishio: I don't mean that you should think about it, but, for example, "There is a way of thinking about this.
Tachikawa: It's like an introduction to a way of saying, "Yes, there is.
Nishio: I am sure that many discussions will take place even if we leave it alone, but it would be a waste if, as a result of the discussions, we find ourselves saying, "Oh, I see - I never thought to consider the similarity with management.
Tachikawa: Yes, yes. That is exactly what I mean. And the third is the similarity with management. So there are three points of view. You can talk about these points, or you can come up with a different theme for each of you to discuss. After the discussion, each group shared what they had discussed! I see, that's a way of looking at it. We just happened to come up with three different approaches because we are just the four of us, but there may be other approaches. There probably are, aren't there?
Nishio: Even with the current analogy, I'm sure someone will pop up with an interesting story about how they hadn't thought of that analogy.
Tachikawa: That's the minimum frame of reference. It's more like "please do as you please. I thought it would be quite interesting if it were like that. I think it could work. Moreover, this field is good for games. This is exactly the kind of place I was thinking of. This kind of table is good.
Iwanaga: Location is good.
Nishio: The location is just right.
Tachikawa: These places are better than classrooms.
Nishio: Certainly more than a classroom. Classrooms tend to be more formal.
Tachikawa: Also, if you don't do it on a flat surface, it's not suited to places with steps.
Iwanaga: Room 310 or something like that, C-310, which is rather large and has a desk just like this one.
Tachikawa: You used it once before.
Nishio: Ah~!
Yamada: Move it.
Iwanaga: It is a wide and flat system.
Tachikawa: The key theme here is the presence of round tables.
Iwanaga: Can we rent a round table?
Tachikawa: I guess a round table is a little small for 4 or 6 people. A round table is rather suitable, isn't it? I was wondering.
Iwanaga: But I don't think it's essential.
Tachikawa: Oh, I see.
Iwanaga: Well, if you can surround it.
Tachikawa: In that sense, as far as rooms are concerned, as long as it is a flat place, not a tier room, it is fine here or 310. Well, anywhere is fine.
Iwanaga: I am not sure if 6 is a good number of people.
Tachikawa: I think about 4 might be better. Hearing you speak now.
Nishio: Yes.
Tachikawa: Four is a good number. You say 4 is the number that does not generate free riders in the discussion.
Nishio: I see.
Tachikawa: With 6, there will be one or two people who cannot speak.
Iwanaga: I can't talk anymore.
Nishio: If you are a villager, you don't have to speak, but if you are a werewolf, you can't help it if you don't speak.
Iwanaga: There is also that.
Tachikawa: In the game and looking back...
Nishio: Oh, I see.
Iwanaga: Later in the discussion.
Nishio: It is certainly better to have a smaller number of people to make later discussions more interesting.
Tachikawa: That's right. It depends on the number of people on the day, to be honest. If the number of people increases...
Nishio: Since that is unpredictable, I think it would be better to use the results of this meeting to emphasize how attractive the meeting is, and to give the impression that the maximum number of participants will be filled if only this many people attend.
Tachikawa: I see.
Nishio: If we have three tables of four people with a maximum of 12 people, we will have a second meeting with a maximum of 12 people. Then, we can say that the first meeting was like this with 4 people and confirm that the minimum maximum number of 12 people will be filled, so that there will be no uncertainty about the number of people.
Tachikawa: That might be more interesting.
Nishio: If a participant says, "That meeting was interesting," and then says, "But only 12 people can attend. If someone says, "That meeting was interesting," and asks if we can increase the number of participants, we would be happy to have them join the management side.
Tachikawa: Let's do that. Then.
(laughter)
Nishio: Next time we plan to do it with about 12 people.
Tachikawa: 12, or 4x4, 16. well, maybe 16 is good. 12 or 16?
Nishio: Yes.
Tachikawa: You mean that the four of us are a unit.
Nishio: It's better to chop it up than to do one 30-person scale next time and think it's the end of the world.
Tachikawa: I see. So it's okay to repeat.
Nishio: People who repeat the same thing gradually come to understand, don't they?
Iwanaga: I think 12 is a good number, though.
Tachikawa: So, shall we go with 12? Shall we just go ahead and decide on 12?
Nishio: You can't just decide that it's 12.
Iwanaga: Surprisingly, it is hard to get to know them.
Nishio: I think this is beneficial when I participate and I would like to do more.
Tachikawa: I see.
Nishio: Tachikawa-san was also very excited and said, "I'm definitely going to do it! But he said that not many people would come even if we said we would definitely do it, and in fact, there were only four of us. In fact, there were only 4 of us, and we were almost down to 3 people.
Tachikawa: Thank you very much. For joining us today.
Yamada: No, no, I'm glad I came today. It was interesting.
Nishio: So I'm going to chop this up and every time it gets booked up quickly...
Tachikawa: It is better.
Nishio: That's better.
Tachikawa: You said it is popular.
Nishio: You could do it once a month or something.
Tachikawa: Indeed. I see. So it's a good way to get to know each other, and so on.
Nishio: Yes, yes. I think that as we gradually get used to the way things are done, the management side will get better at explaining things.
Tachikawa: I was wondering if it would be better to have 12 students, including outsiders, or if it would be better to have only current students. What do you think?
Iwanaga: We are quite busy with the current students.
Tachikawa: Current students are busy. I was just thinking about whether it would be better to close the session by saying that it is for alumni. I think it is quite impressive that four people can have this much discussion. I think that four people is a very large number, unless you are in a situation where you can feel somewhat secure. The reason I bring this up is that I think it would be better to keep the discussion closed. I have a hypothesis that it would be better to close the discussion...
Nishio: I think closed is better. The reason for that is I don't know what would happen if someone did not share the experience of having a group discussion.
Tachikawa: That's the point, isn't it?
Nishio: We all have at least had the experience of having various discussions with these four or so people in our MOT classes, right?
Iwanaga: And he has the spirit to blend in here in the first place, or he likes to talk, or whatever. I'm not at that level. To be honest, there are not three tables at this level. I think it's quite tough. I think there are many people who can't catch up.
Tachikawa: Oh, indeed. I'm sure. I have a high whiteboarding ability, so I have said three things, but it's not easy to summarize them like this.
Nishio: Is this coherent? (laughter)
Tachikawa: Maybe it's the fact that there are three different cut-off points.
Nishio: It was a very useful summary that came out that there are three cut-off points, so that sums it up. Certainly.
Tachikawa: See?
Nishio: I don't know what this bullet train of logic that is taking up so much space down here is (laughs).
Iwanaga: Logic that is not so logical.
(laughter)
Nishio: There is something coming out of the bullet train. I don't understand the meaning of having this bullet train.
Tachikawa: It's perfect.
Nishio: I'm a little curious what the metaphor is. What is the time frame of today's meeting in terms of time.
Tachikawa: We will do this closed.
Nishio: Once. I think a small start is good.
Tachikawa: 12 closed.
Nishio: Next time. We'll have to triple the number of people, but still. I think that's fine. As the next step.
Tachikawa: We will do it closed. I'll try to use the two hours of the talk in the way I mentioned earlier? First of all.
Nishio: I think it is good.
Tachikawa: Just to introduce a few of the cuts.
Iwanaga: Maybe try it one last time after organizing it. It would be interesting to try it one more time to give it some meaning.
Nishio: If there is enough time. If it looks like there is still time, I will try just one more time there. I know many people would like to do it one more time.
Tachikawa: After talking this much, I would like to do it again.
Yamada: That's good.
Tachikawa: Let's do one last time and call it a day. 7:00-9:00, including one 〓00:55:02〓, and we can finish at 9:10:15 or so, which is perfectly fine. That's good. Ah! One last time. 3 + 1. That's good.
Yamada: If you look at the elapsed time today, it looks like it will be enough.
Tachikawa: It could be good. It's done.
Nishio: I have done it. I also think that there is currently too little information to attract visitors, so I think it would be better to record this discussion and make a good use of it.
Tachikawa: That transcription of the recording is using Nishio-san's byte, isn't it?
Nishio: Please give me the audio data. I'll do it.
Tachikawa: I understand. Nishio-san, you are amazing. I'm asking for a part-time job.
Nishio: I want to do something interesting, even if it costs a lot of money, because this is interesting.
(laughter)
Tachikawa: Audio data to be sent to you.
