2018-12-20
I'll make a note of it because it sounds useful, but I haven't yet verbalized what should be the title.

Since time is wasted in peeling off sticky notes, we are talking about preparing in advance a piece of paper with a frame printed on it, like a 100-masu calculation.
2Toru Ogigami, Tokuhiro Matsuno
9 comments
Nice!
Comment
Share
Comment
Nishio Hirokazu
Nishio Hirokazu I told you at the reception, "The reason I used sticky notes this time was because sticky notes and pens happened to be available, so you should use what you are comfortable with when you usually do output. If you prefer to use a keyboard, use a keyboard" is the basic premise.
Edit or delete
Nice!
 - Reply - 2 hours ago
Nishio Hirokazu
Nishio Hirokazu So, if you have a 100-square calculation sheet, you can prepare it.
Edit or delete
Nice!
 - Reply - 2 hours ago
Kohei Okubo On-line
Okubo, Kohei The advantage of sticky notes is that they can be moved.
Delete or hide comments
Nice!
 - Reply - 2 hours ago
Nishio Hirokazu
Nishio Hirokazu yes
Edit or delete
Nice!
 - Reply - 2 hours ago
Nishio Hirokazu
Nishio Hirokazu: "Write at least 10 sheets in 3 minutes" was a task that everyone was able to complete after about 3 times. On the other hand, there were some who said, "After writing 10 sheets, I thought, 'I'm done,' and slackened off," by explicitly setting a threshold.
Edit or delete
Nice! See other reactions
 - Reply - 2 hours ago
Nishio Hirokazu
Nishio Hirokazu In that sense, I think it would be a good idea to prepare a piece of paper with 25 5x5 squares.
1
Edit or delete
Nice! See other reactions
 - Reply - 2 hours ago
Nishio Hirokazu
Nishio Hirokazu But I also worry that the more we prepare "something for the workshop," the more it will feel different from [everyday] life.
Edit or delete
Nice! See other reactions
 - Reply - 2 hours ago
Nishio Hirokazu
Nishio Hirokazu The experience of using sticky notes and pens, which we often see, creates an opportunity to look at the sticky notes the next day and say, "Oh, yes, let's do that. On the other hand, in a workshop where a special template is distributed and the participants fill it in, when they want to do the same thing after returning home, they have to start by obtaining the template.
Edit or delete
Nice! See other reactions
 - Reply - 2 hours ago
Nishio Hirokazu
When I did this at Nishio Hirokazu [Tokyo Metropolitan University], I distributed a blank A4 sheet of paper to everyone and asked them to write on it. At first, I thought about writing various things and filling them in, but I think I came to the conclusion that a blank sheet of paper is the best in terms of freedom.
