The "interest in education = end of growth" argument
context
 https://twitter.com/InsideCHIKIRIN/status/379474935514935296
 >(continued) In other words, if a person says, "I'm interested in [education]," that's the end of his or her own [growth]. It is only because he/she is aware of it that he/she can come up with such an idea. (continued)
 https://twitter.com/InsideCHIKIRIN/status/379481738105602048
 >I meet all kinds of people, including those who are in the "I want to accomplish this" stage, but I find it very interesting to talk with those who are in the "I want to teach what I have learned to those who will follow me" mode.

	Positive Opinion
		In fact, it is often observed that people who say they want to educate themselves, even though they don't have much
		It is more interesting to ask someone who is trying to accomplish something himself to give a lecture by forcing him to do so, than to have someone in teaching mode do it!
	negative opinion
		We learn by teaching.

Opinion of Nishio
	The term "education" is ambiguous and should be divided into two types
		One that has an expected outcome and success/failure can be judged based on whether or not that outcome was achieved.
		The fact that I was involved in education is an achievement in itself, without success/failure.
	What contributes to growth is "challenging things that you don't know if you can do.
		In other words, "former education" contributes to growth, but "latter education" does not.
	When you stop spending time on challenges, you stop growing.
		If those who want to "educate the latter" are avoiding challenges in other areas as well, growth will stop.
		If the goal is to "learn by teaching," the success/failure can be judged based on whether or not the lesson has been learned, so growth is possible.

First appeared 2013-09-18 on the bulletin board in Cybozu Labs
>It seems to me that we need to divide education into two types.
> 
> Education in which results are easily observable and the success depends largely on the skill of the teacher, such as educating students to pass as many exams as possible or helping dropout students keep up with the class,
> The "education" of the kind where it is not clear what the outcome is, such as lecturing at sepcans or organizing study groups, and even if something great is produced, it is not clear whether the creator or the teacher is great or not.
> 
> I think a certain percentage of growth comes from "challenging something you don't know if you can do," but the latter "education" is not a challenge.
> If a person prefers to do only the latter type of "education," the rate of challenge in that person's life will be reduced, and as a result, the rate of growth will probably slow down.
> 
> So, I agree with "I am interested in education" = "the end of growth" and I also agree with "I am only interested in 'education' that has nothing to do with skills -> the end of growth".
> "I think that "the skill of the person who teaches (the type of education) greatly affects the 'results'" is a challenge, so the rate of growth will not slow down.
