Examples of Figure Improvements
[https://gyazo.com/475aee87f095dc285ddf76fd51c6cbeb]
The figure below was beaten to the punch on Twitter.
[https://gyazo.com/19369d25f807ee6d69090be1c3b8cde6]
	Press Release http://www.riken.jp/pr/press/2018/20180912_1/
	Tweet you're hitting: https://twitter.com/ktrst/status/1078210911461097475

It's easy to criticize the "bad drawing," but it's not a very useful discussion unless you know how you would draw it.

Where I thought it was not good
	The time axis is used in a less commonly used "top-to-bottom, pyramidal" form.
		Usually left to right.
		The pyramid shape causes people to think "the top is the best one".
		The shape of the triangle leads some to believe that it depicts a relationship between three things.
		If you look closely, you can see an arrow on the diagonal, but it's too much to ask you to notice it.
	The majority of people don't know who that is when they see the photo.
		If you want to tell the story, you should caption it, and if you don't want to tell the story, you should delete it.
		When I captioned the name, "Who's Bacon?" I think a lot of people would be like "Who's Bacon?
	Mistake of writing "predictive science" at the top.
		If you're going to draw the time line vertically, that's where you're going to represent the "oldest" thing.
		I thought "predictive science" was the caption for this entire diagram.
		I didn't feel comfortable including "fortune-telling" in "predictive science," so I called it "the history of 'prediction.

Chat log under ----
(nishio) Who is the inductive approach guy?
I know the deductive is Descartes and the middle is Newton.
Ah, bacon.
(X) Bacon is an inductive approach?
(nishio)
>Francis Bacon developed Roger Bacon's "Four Causes of Ignorance" and presented the four idras, believing that the removal of idras is necessary for correct knowledge, and contrasted this with the traditional emphasis on deduction in Scholastic philosophy, which does not trust sensory observation unconditionally and uses the method of experiment to gradually develop positive He clearly stated the method of induction, which does not trust unconditionally in sensory observations, but uses the method of experimentation to gradually ascend to a positive proposition of law. The inductive method encouraged the development of natural science, but later gave rise to David Hume's skepticism.
[Empiricism - Wikipedia https://ja.wikipedia.org/wiki/%E7%B5%8C%E9%A8%93%E8%AB%96]

Descartes' Introduction to Method, which is contrasted with Bacon's, is a position like "If you think, you will know" or "Experience is not important.
If you go that route, you end up running toward mathematics and philosophy rather than natural science.
Descartes said, "Reason is the most important thing! and after thinking hard about what can be said with certainty by reason, he ended up saying, "I think, therefore I am.
Bacon, on the other hand, took the position that "experience" and "observation" are important.
Bacon and Descartes were born in the 1500s, and Newton in the 1600s. The discussions of this period led to the emergence of natural science, which separated itself from theology and philosophy and emphasized observation (experience and experimentation), a trend that continues.
When you think about it, the inductive and deductive approaches were not clearly separated, and even Newton's classical physics is based on observation (=experience), so the original diagram of the press is a bit different.
>In his main work, Principia, Newton declared in Latin: "Hypotheses non fingo" (We do not make hypotheses). He developed a philosophy and interpretation that only shows the causality of observable things. This is said to be a criticism of Descartes' naturalistic philosophy, which included "fictional" explanations. In presenting the law of universal gravitation, he is also said to have presented a new methodology, in which he did not explain why gravitation occurs or what it exists for, but only how it works according to its own laws, and that it is not necessary to hypothesize about the causes that bring it into existence. It is also said to have proposed a new methodology.
	[Isaac Newton - Wikipedia https://ja.wikipedia.org/wiki/%E3%82%A2%E3%82%A4%E3%82%B6%E3%83%83%E3%82%AF%E3%83%BB%E3%83%8B%E3%83%A5%E3%83 %BC%E3%83%88%E3%83%B3]
Hmmm, I guess I can't classify Newton as Cartesian.
Well, I just challenged myself to see what would happen if I drew the press's diagram, so if you have any differences in interpretation with me, you can just annotate it.
