What you need quickly! Organizational skills to get what you need out of the way!
[https://gyazo.com/dbd999a1a94b14cfe7fc67286ede9286]
	[Amazon https://amzn.to/2s0rbiw]
	[Akiko Ikeda]
	Edited by [Noriko Matsuda].

	[The author of "The Art of Tidying Up for Women Who Can't Clean Up! The author, who escaped from a messy room in "The Art of Tidying Up", improves her room from "a tidy room that looks clean" to "an organized room where things are easy to use" while being poked and prodded by her editor.

	The key is "[to] get what you need quickly and easily.
		Principles for achieving this
			Keep the same type of items in one place.
			leave lying around
				The more frequently used items are easier to take out: focus on [frequency of use
					Same concept as [Information Design

	Space for now
		Not a method to organize.
		Techniques for staying organized
		The basic premise is that there is a fixed place to put things.
		In principle, things should be put in their place, but it is inefficient to put them away every time you are working
		So "space for now" is introduced as a temporary storage space
		Create a situation where things are in one of those two places.
		At any rate, the space can be listed, so if it's not there, you know it's where it belongs.
		Items placed in this space will be returned to their original location at the appropriate time.
		If a space is created for now without its original location, it will be filled with stuff because the stuff in it will never be put back in.
		Naturally, it is not acceptable to place "for the time being" in a place other than the place that has been clarified as "for the time being space".
		Relates to the principle of "same kind of things in one place."
			A kind of "what's in use now" occurs temporarily.
			The items in use are grouped together in a "space for now."
			So when they're done using them, they're put back where they belong.

	Organizing paperwork that I was too lazy to get around to.
		The psychological burden decreased as the location was determined.
		It's hard to go through the process of classifying things that are not clear how to classify them.

	Same kind of thing."
		Just the "same kind" for me.
 		It doesn't matter how others see you.
 		[Soldering iron failure]
		It's more important to avoid putting unrelated items together and not being able to find them than to separate them into smaller pieces.
			Once it's big enough to list, then it's easy to find it even if it's not categorized.

	easy to give
		Easy to physically put in and out
		Label it so it's easy to remember OR so you know even if you don't remember.
		tucked away easily
			If they are too lazy to put them away, they are left around.

	[You can get what you need quickly and easily.]
	[Organizing]
