working hours
[Labor Standards Act]
Chapter IV Working Hours, Rest Periods, Holidays, and Annual Paid Leave
(working hours)
	Article 32
		(2) An employer shall not have workers work more than forty (40) hours per week, excluding rest periods.
		2 An employer shall not have workers work more than eight hours a day for each day of the week, excluding rest periods.
		[nishio.icon]This may come as a surprise, but first of all, this is the legal default value
	Article 32-2
		(2) Notwithstanding the provisions of the preceding Article, in the event that an employer has stipulated in a written agreement with a labor union organized by a majority of the workers at the workplace concerned (in the case that such labor union is organized) or with a person representing a majority of the workers (in the case that such labor union is not organized), or by employment regulations or other equivalent, that the average weekly working hours shall not exceed those stipulated in paragraph (1) of the preceding Article for a certain period of not more than one month, the employer shall, in accordance with the provisions of the preceding Article, notify the workers of such stipulation. (2) Notwithstanding the provisions of the preceding Article, in the event that the working hours per week on average do not exceed the working hours stipulated in paragraph (1) of the preceding Article, the employer may have the workers work in excess of the working hours stipulated in the same paragraph during a specified week or the working hours stipulated in paragraph (2) of the same Article on specified days, in accordance with such stipulation.
		2. The employer shall notify the agreement set forth in the preceding paragraph to the relevant government agency in accordance with the provisions of Ordinance of the Ministry of Health, Labour and Welfare.
		[nishio.icon]Regulations that allow overtime work when certain conditions are met.
			Since that specific condition includes "when it is stipulated that the working hours per week averaged over a certain period of time within one month do not exceed the working hours stipulated in paragraph 1 of the preceding article," this means that "temporary overtime may be required, but averaged over a month, it is 8 hours per day.
	Article 32-3
		(2) With respect to a worker whose starting and ending work hours are left to the decision of the worker pursuant to the rules of employment or other equivalent regulations, the employer may, if there is a labor union organized by a majority of the workers at the workplace concerned (in the case that such labor union is organized) or, if there is no labor union organized by a majority of the workers, may, by a written agreement with a person representing a majority of the workers (in the case that such labor union is organized), determine the following matters (ii) In the event that the working hours per week do not exceed the working hours set forth in paragraph (1) of Article 32 when the average working hours per week during the period specified as the settlement period in item (ii) in the written agreement with a person representing a majority of the workers at the workplace (in the case that there is no labor union, the following matters shall be stipulated, notwithstanding the provisions of the same Article, in a week. (2) Notwithstanding the provisions of Article 32, a worker may be required to work in excess of the working hours set forth in paragraph (1) of Article 32 or the working hours set forth in paragraph (2) of Article 32 in any one day.
			(i) The scope of workers who may be required to work according to the working hours pursuant to the provisions of this Article
			(ii) A period of settlement (a period during which the average weekly working hours do not exceed the working hours set forth in paragraph (1) of Article 32, limited to a period of one month or less; the same shall apply in the following item). The same shall apply in the following item)
			(iii) Total hours worked in the liquidation period
			(iv) Other matters specified by Ordinance of the Ministry of Health, Labour and Welfare
	Article 32-4
		(1) Notwithstanding the provisions of Article 32, when an employer has stipulated the following matters in a written agreement with a labor union organized by a majority of the workers at the workplace concerned (in the case that such labor union is organized) or with a person representing a majority of the workers (in the case that such labor union is not organized), the employer shall, in accordance with the following provisions (i) In the event that the working hours per week do not exceed 40 hours on average during the period specified in the agreement as the period covered by item (ii), and that the working hours per week do not exceed 40 hours, the employer shall, in accordance with the provisions of the agreement (including the provisions of the following paragraph, if such provisions have been stipulated in the agreement), notify the workers of the working hours specified in the agreement. (2) The working hours of a worker may exceed the working hours stipulated in paragraph (1) of this Article in a specified week or the working hours stipulated in paragraph (2) of this Article in a specified day, in accordance with the provisions of the agreement (including the provisions of the following paragraph in the event that the agreement stipulates otherwise).
   (i) The scope of workers who may be required to work according to the working hours pursuant to the provisions of this Article
   (ii) The period covered by the labor union (a period during which the average weekly working hours do not exceed 40 hours, and limited to a period exceeding one month but not exceeding one year; hereinafter the same shall apply in this Article and the following Article). The same shall apply hereinafter in this Article and the following Article)
   (iii) Specified period (meaning a period during the subject period when business is particularly busy. The same shall apply in paragraph (3))
   (iv) Working days and working hours for each such working day during the applicable period (in the case where the applicable period is divided into periods of one month or more, working days and working hours for each such working day during the period of each such division, which includes the first day of the applicable period (hereinafter referred to as the "first period" in this Article), and the number of working days and total working hours for each period excluding such first period) (i) the number of working days and the working hours for each such working day in each period (excluding the first period), and (ii) the number of working days and the total number of working hours in each period excluding the first period).
   (v) Other matters specified by an Ordinance of the Ministry of Health, Labour and Welfare.
		(2) In the event that the agreement set forth in the preceding paragraph classifies the working days and total working hours for each period except the first period, the employer shall, at least 30 days prior to the first day of the relevant period, obtain the consent of a labor union organized by a majority of the workers at the workplace (in the case that such labor union is organized) or, in the case that such labor union is not organized, the consent of a person representing a majority of the workers, If there is no labor union organized by a majority of the workers, then the working days in each period shall be determined with the consent of a person representing a majority of the workers, and the working hours shall be determined for each working day in each period not exceeding the number of working days and not exceeding the total working hours, pursuant to the provisions of Ordinance of the Ministry of Health, Labour and Welfare. (2) The number of working days and working hours shall be determined in accordance with the Ordinance of the Ministry of Health, Labour and Welfare.
		3 The Minister of Health, Labour and Welfare may, after hearing the opinions of the Labor Policy Council, establish, by Ordinance of the Ministry of Health, Labour and Welfare, limits on the number of working days in the applicable period, daily and weekly working hours, and the number of consecutive working days in the applicable period (excluding the period specified as the specified period in the agreement under paragraph 1) and the period specified in the agreement under the same paragraph. 
		○4 The provisions of Article 32-2, paragraph (2) shall apply mutatis mutandis to agreements under paragraph (1).
	Article 32-4-2 In the event that an employer has a worker work more than 40 hours per week on average over the period of the subject work period with respect to a worker whose work period under the preceding Article is shorter than the subject work period, the employer may not have the worker work the excess hours (excluding hours extended pursuant to the provisions of Article 33 or paragraph (1) of Article 36, or hours worked on holidays). (excluding hours worked on holidays or extended hours pursuant to the provisions of Article 33 or paragraph (1) of Article 36) (2) In the event that an employer has a worker work in excess of 40 hours per week on average, the employer shall pay premium wages in accordance with the provisions of Article 37 with respect to the hours worked in excess of 40 hours (excluding hours extended pursuant to the provisions of Article 33 or paragraph (1) of Article 36 or hours worked on days off).
	Article 32-5
		(2) Employers shall not engage in enterprises stipulated by Ordinance of the Ministry of Health, Labour and Welfare where the number of workers regularly employed is less than the number stipulated by Ordinance of the Ministry of Health, Labour and Welfare, where there is often a marked difference between busy and slow work on a daily basis, and where it is deemed difficult to predict such difference and specify the working hours for each day by rules of employment or other equivalent measures. (2) Notwithstanding the provisions of paragraph (2) of Article 32, when there is a written agreement with a labor union organized by a majority of the workers (in the case that such labor union is organized) or with a person representing a majority of the workers (in the case that such labor union is not organized) at the workplace concerned, workers who are engaged in a business that is deemed to have difficulty in specifying the working hours for each day, and where the number of workers regularly employed is less than the number specified by Ordinance of the Ministry of Health, Labour and Welfare (2) Notwithstanding the provisions of paragraph (2) of Article 32, a worker may work up to 10 hours per day.
		(2) In the event that an employer has a worker work pursuant to the provisions of the preceding paragraph, the employer shall notify the worker in advance of the working hours for each day of the week to be worked, in accordance with the provisions of Ordinance of the Ministry of Health, Labour and Welfare.
		3 The provisions of Article 32-2, paragraph (2) shall apply mutatis mutandis to agreements under paragraph (1).

