Science Non-fiction
Play with science fiction-style representations of everyday events

>The white rectangular blocks, mainly composed of polymeric polymers, were removed by tearing open the plastic packaging, processed with an energy wave irradiation device to edible softness, and eaten by pouring a liquid composed mainly of amino acids extracted from black algae and other organisms.
	=I ate individually wrapped rice cakes in the microwave with kombu dashi (kelp broth).

trick
	Describe something familiar
	It's non-fiction, so of course you can't put in any lies.
		For example, I tried to describe a "hot carpet" by writing "nickel-based," but when I looked it up, I found that kanthal, which is mainly composed of iron, is often used instead of nichrome, which is mainly composed of nickel, so writing "nickel-based" is not a good idea.
	Make the atmosphere more sci-fi
		Describes something familiar, but doesn't make it seem so.
		For example, "mochi" is such a local concept around Japan that it is called "rice cake" in English, so people from other planets would not use the word "mochi" when referring to it. The same goes for kelp.
		Dare to abstract terms
			Instead of "starch-based," it says "polymeric polymer-based."
				They are trying to evoke a kind of plastic by daring to conceal the fact that it is derived from plants.
			Instead of "microwave irradiation equipment," they dare to call it "energy wave irradiation equipment" to make it smell fishy.

[2019-01-06 Facebook https://www.facebook.com/nishiohirokazu/posts/10217233887495781]
>The white rectangular blocks, mainly composed of polymeric polymers, were removed by tearing open the plastic packaging, processed with an energy wave irradiation device to edible softness, and eaten by pouring a liquid composed mainly of amino acids extracted from black algae and other organisms.
	I microwaved individually wrapped rice cakes and ate them with kombu dashi (kelp broth).
	>Plants that have been bred to highly accumulate the macromolecules that make up the material of these white blocks.
		=稲
	>Mainly to prevent materials from being degraded by the growth of harmful organisms, a device that uses compression and expansion of fluorocarbons and other materials to cause heat transfer and create temperatures low enough to prevent breeding.
		=冷蔵庫
	>A device that causes electrons emitted from the cathode of a vacuum tube to orbit and resonate with a strong magnetic field, thereby emitting powerful energy waves that cause changes in the molecular structure of an object without contacting it.
		= A microwave oven that heats and cooks food using microwaves emitted from a magnetron.
	>The marine organisms are heated, dried, and sprayed with a special fungus that has been cultured in advance. The fungus breaks down the macromolecular compounds in the organisms' bodies, creating a unique taste and aroma.
		=Boil bonito, dry it in the sun, spray it with katsuobushi mold, and the mold breaks down the proteins to produce inosinic acid and other substances.
	>The main material of white rectangular blocks is a polymer compound in which a large number of α-amylose is polymerized by glycosidic bonds, resulting in a highly branched structure.
		[アミロペクチン - Wikipedia https://ja.wikipedia.org/wiki/%E3%82%A2%E3%83%9F%E3%83%AD%E3%83%9A%E3%82%AF%E3%83%81%E3%83%B3]

