knowledge consistency
[Intellectual Production of Engineers] Chapter 5, p.167 Column [(Column) Consistency of Knowledge].
-----
[ ] What guarantees the correctness of knowledge? There is no guarantee of correctness "because a book said so." What you actually experienced is correct up to the point of the experience itself, the fact of observation, but when you interpret it and attach meaning to it, it is no longer guaranteed to be correct.
[ ] As for areas where you can conduct experiments, you can disprove your interpretation by saying, "If this interpretation is correct, then the result of this experiment should be this way, but in fact it was not. In Chapter 1, I mentioned that when learning programming, you can verify your understanding by writing a program based on your interpretation and observing the results of its execution. This also allows you to notice mistakes, but does not guarantee that they are correct Note 2.
[ ], what should we do in areas where experimentation is not possible? One criterion that can be used in such fields is that it must be consistent with more of the same. This is another useful criterion, although it is not a way to guarantee correctness. Knowledge that is consistent with many things has a wide range of applications.
[ ] For example, knowledge that is consistent across books written by different authors is surely likely to be correct. When knowledge from a book aligns well with your own experience, you feel a sense of clarity. If you give a lecture and what you say there aligns well with the audience's experience, the audience will be very pleased.

[https://gyazo.com/4169ef3a64097dd3dcd5ad1de5a26496]

[ ] Many of us read a book and then make a few bylines or excerpts. It is a great learning experience to try grouping these excerpts on a label and see if it works. You may find that a sentence you extracted for the coolness of its wording doesn't quite fit in with the rest of your knowledge and floats away. On the other hand, you may find that a sentence that is not fancy at all is actually a very important piece of knowledge that connects information from several books.
[ ] Read the book, make a fusen, and form a group. Through this verification activity, you will see whether the sentences you extracted were consistent knowledge that could easily be connected to other things or not. By repeating this you will improve your skills in finding "knowledge that seems to be consistent with many things".
[ ] What happens when you collect "knowledge that seems to be consistent with many things" and use the KJ method for it? Listing and grouping "things that seem to be related" and putting a nameplate on them is a process of combining knowledge that seems to be consistent and verbalizing why it is consistent. Repeating this will increase the consistency among the knowledge and build a tightly connected [network of knowledge] within you. I find this very beneficial.

　Note 1: You introduced Einstein's diagram in Chapter 1.
 Note 2 Computer scientist [Edsger Wybe Dijkstra] says, "Testing can prove the existence of bugs, but not their absence. Source: [Brian Kernighan]/[Rob Pike], translated by Toshihiro Fukuzaki, Programming Methods, ASCII, 2000.

知識の[整合性]
[(Column) Consistency of knowledge]
関連
	[整合説]
