FACTFULNESS
[https://images-fe.ssl-images-amazon.com/images/I/410QuKHYY3L.jpg]
	FACTFULNESS 10 overcoming assumptions and the habit of seeing the world correctly based on data
	Factfulness: Ten Reasons We're Wrong About The World - And Why Things Are Better Than You Think
	[Amazon https://amzn.to/2Rg03vf]

When given 12 three-question quizzes about the current state of the world, the average number of correct answers was two, even though four of the questions should have been correct even if chosen at random.
The author initially thought this was a phenomenon of "[not] updating knowledge" (p. 18), but it is not an updating problem because even Davos participants, who are supposed to be acquiring new knowledge, make mistakes as well. It is due to "[an] overly dramatic view of the world."

 Chapter 1 [Divisive Instinct] "The Assumption that [the World is Divided]"
 	You assume there is a division between "developed and developing countries," but as of 2017 there is no such thing Figure on p. 37
 	The term I use corresponds to [false dichotomy] [false dichotomy
 	Three points to note
 		[平均の比較]
 		[extreme numbers compared].
 		[view from above]
 Chapter 2 [Negative Instinct] "The World is Getting Worse and Worse" Assumption
 	There is no buzz when there is gradual improvement.
 	It's a topic of conversation when there is a sharp decline.
 	Figure on p. 85
 	Three Factors
 		Vague memories of the past
 		biased reporting
 		Air of difficulty in saying "it's getting better" when it's bad.
 	The words "bad" and "getting better" go hand in hand.
 Chapter 3 [Linear Instinct] Assumption that "the world's population will just keep growing
 	[nishio.icon]抽象度が低い
 	Tendency to erroneously assume that the pace of recent change will be maintained.
 		要は[一次近似]
 		You would think the graph is straight.
 	Know that the shape of a graph is not just a straight line.
 		直線
 		[S-curve]
 		(playground) slide
 		kombu (any kelp of genus Laminaria)
 		倍増
 Chapter 4 [Fear Instinct] Assumptions that cause us to think of "scary" things that are not actually dangerous.
 	The easiest way to get other people's attention is to incite fear.
 	40 million planes have landed without incident, but only 10 fatal accidents make the news.
 Chapter 5 [Overestimation Instinct] Assumption that "the number in front of you is the most important
 	Trying to determine the size of a single number and making a mistake.
  	Don't judge by one number, compare.
  	4.2 million babies died in 2016.
  	I feel like this is big.
  	It actually went from 4.5 million to 4.4 million to 4.2 million over three years.
 	To overestimate the case in front of you.
 	[80-20 rule].
 		When things are enumerated, consider the possibility that 20% of them could account for 80% of the total.
 	Discussing per capita emissions rather than comparing the CO2 emissions of entire countries.
 Chapter 6 [Patterning Instinct] Assumption that "one example fits all
 	Differences within the same group, commonalities between different groups
 		The way of life is more influenced by income level than by culture or religion
 		https://www.gapminder.org/dollar-street/matrix
 	Majority: most or just a little over half?
 	Exception: do not draw conclusions for the entire group based on a few examples
 	Don't think you are normal.
 	Do not apply the example of one group to another
 		Higher survival rates for prone soldiers encouraged infants to sleep on their stomachs, leading to an increase in sudden infant deaths
 Chapter 7 [Fatalistic Instinct] Assumption that "everything is predetermined
 Chapter 8 [Simplification Instinct] Assumption that "the world can be understood in one way".
 	Think about the weaknesses of the ideas you are putting on your shoulders.
 Chapter 9: [Criminal Search Instinct] Assumption that "Blaming Someone Will Solve Things
 	Tends to be attributed to one hero when things go well
 		Thanks to social infrastructure and technology
 Chapter 10 [Impatience Instinct] "If we don't do something now, we will be in trouble.
 	Fast thinking [fast & slow] in a hurry

https://twitter.com/hyuki/status/1081848645970870273
	>When we see a "division", let's look up "distribution". When we see a dichotomy, let's examine "are those the only two things in the world?".
			[false dichotomy].
	>When you see "negative news," remember that "bad news is more likely to spread. More bad news does not necessarily mean more bad events."(while reading "Factfulness," Chapter 2)

	>"Let's not [fit] a straight line graph to everything" (while reading Factfulness, Chapter 3).
  >This "linear instinct" also,
  > "Divisive Instincts."
  > "Negative Instincts."
  >I'm also closely intertwined with...

	>We naturally look at things that are frightening, but there is a difference between fear and danger. (While reading Chapter 4 of Factfulness.)

	>Let's be vigilant when only one number comes up. Let's compare it to another number or ask for a percentage. (While reading Chapter 5 of Factfulness.)