Large and fast companies
>If we change the names of [large companies] and [small and medium-sized companies] to [slow companies] and [fast companies], some innovation may occur.
[@ochyai https://twitter.com/ochyai/status/1025158189405298688] [Yoichi Ochiai]

Interesting cut.
Until now, the naming of "[large company]" and "[small company]" implicitly generated a bias that "large companies are better" for students trying to choose a job. Students who received job offers from large firms would give big looks to students who received job offers from small and medium-sized firms.
The creation of the term "slow companies" moves in the direction of eliminating this bias. This is because other students will be able to counter with "Oh, you're going to a slow company (half-smile)" when a student boasts that he/she has received a job offer from a large company.
No one knows to what extent this elimination of bias will occur. It may not have much of an impact, or conversely, it may popularize among students the notion that joining a slow company is a very lame thing to do.

In the latter case, the recruiting activities of large firms, which until now have been underpinned by a large-company favoritism bias, will be severely affected. While some firms will sink as they are, others will change their behavior in response to changes in the talent market. For example, they may actively promote themselves by making a case study that they are a big company but also a fast company. In order to create examples, "different management" will be necessary, such as giving high discretion to "personnel who create new things" who can create examples. As people who can create new things become more valued, the content of their appeal in job hunting will also be affected. Even if students appeal their accomplishments in the form of "I was an assistant leader at a part-time job," they will not be recognized as "people who create new things. Students will start creating something new during their school years and appealing to their achievements.

Mr. Ochiai is highly favored, especially by students, and seems to use the term "slow-moving companies" in his speeches at universities and other institutions. This could spark a major change in society.

On the other hand, it is likely that we will often observe cases in the future where "people who wanted to join a large company but could not" will use this term to bash large companies. Simply saying "big company = slow company" is just a term substitution to satisfy one's pride, but in the end, it is still a judgment based on size. It overlooks the fact that speed is important.

Even large companies that are large in size can be fast companies. For example, CyberAgent is a large company in terms of the total number of employees, but it is famous for having a number of new graduates who become presidents of subsidiaries within a few years of graduation. This is an example of a large company creating more and more small high-speed companies and entrusting management to young people.
[CyberAgent's famous "New Grad Presidents" are actually new graduates who started their own businesses in their first year! What is the reality of CyberAgent's famous "new graduate presidents" | FastGrow https://www.fastgrow.jp/articles/ca-new-graduate]

Many people would think that Mitsubishi UFJ is also a big company and that it is hard and slow because it is in the banking business. Although many may not realize the connection because it does not bear the corporate name brand, [Japan Digital Design https://www.japan-d2.com/company] was created with 3.1 billion in capital. This is another example of a large company creating a high-speed company.
[Japan Digital Design (JDD), a spin-out from Mitsubishi UFJ, is exploring new forms of financial services｜TECH PLAY Magazine [Tech Play Magazine] https://techplay.jp/column/411]

There are many large companies that have not yet taken the step to create subsidiaries that are trying to change. [LoanDeal https://loandeal.jp/] is a company that acts as an intermediary between those companies and fast-track ventures, and many large companies are sending their own employees to fast-track companies. This is an example of how many large companies are becoming interested in the fast company type of talent and are embracing a special form of management.
[Large company employees move to startups on loan :The Nikkei https://www.nikkei.com/article/DGXMZO26142440V20C18A1XY0000/]