Propagation of new concepts
2019-01-17 [I thought about why people start to burn after being cut out of context on social networking sites (updated as needed) | Yoichi Ochiai | note https://note.mu/ochyai/n/n1cf555a8f0fd] and saw myself drawing a picture.
2021-11-23 The link is no longer available without billing. The original diagram is on [How to Think Half a Step Ahead] p.42.

[https://gyazo.com/7f548298e5065bde88e1964cb940f9df]
	Knowledge is [stacked] like a pyramid.
	Suppose a person (sender) comes up with knowledge C, which is one step advanced from existing knowledge B.
	Time is limited, so only disseminate information about newly created
	Those who have the knowledge B to accept that knowledge C can understand it (the understanding person).
	Also, some people can accept C and then suggest another D (developmental discussion).
	On the other hand, there are those who believe in C in a descent way without sufficient knowledge (increased awareness).
		Developing topic: they need to be understanding if they are to be happy: [to be understanding].
		Related: [how to give knowledge to those who lack knowledge].

[https://gyazo.com/4e138d48a8c4d7d8cd0cc8f7129a2a4a]
	There are two patterns of people who are offended by this blind faith
	Conscious Haters."
		1: First of all, I'm repulsed, "That kind of ungrounded thinking is not good."
		2: They are supposed to be the ones who understand C because of their knowledge build up to B, but because of the emotional backlash first,
		3: Thinking ends with "B and C are different.
			For him, B is grounded knowledge and C is not, so he thinks B is correct.
			Or, they are satisfied if they can deny what they don't like and are not interested in furthering the discussion.
		They were good [to hit the original source], not the granddaddy information, but they are losing money by not having that attitude.
	The "personality denial" is
		1: I have accumulated knowledge in different fields and am confident in it.
		2: There's no buildup of knowledge A, so "B or C?" I'm not sure if the argument is "A" or "B", but I'm not happy with the situation
		3: So the rebuttal is "the sender who is descending C is evil".
		It is because of [jealousy] that they rebel against the sender rather than the "growing awareness" person who has faith in knowledge by descent.
		The original diagram said "[pseudo-intellectual personality denial]," but I didn't understand the "pseudo-intellectual" part at first.
			Unlike the "awareness raising" crowd, you've built up a body of knowledge in other areas, after all.
			After a while, I thought, just as I wrote in [I'm afraid to say "I don't know"], that he's someone who is not immune to the fact that there are things he doesn't understand.
			So, even if they have accumulated knowledge in a certain field, they lack the intellectual training to tackle "what they don't know," so it is reasonable to call them [pseudo-intellectuals]. Related: [Ph.D. does not matter what field].
			Personally, I would be concerned that that labeling might lead to a personality denial battle.


	[exchange of triggers (Facebook) https://www.facebook.com/Ochyai/posts/2343392365671475]
	>This would be a perfect example of a D person. [src https://twitter.com/jimbukento/status/1085792834613985280]
		I see, I hadn't thought of this case itself in this framework (since I thought the emphasis was on the second half).
		If we consider this case in this framework, the information that the sender did not mention is that "knowledge is stacked in a pyramid."
		You can't help but think "I don't need to tell you" that you need prerequisite knowledge to understand things.
		I used a lot of [accumulated knowledge] metaphors in my book [The Intellectual Production of Engineers], so it was easy to verbalize this.
		As for the difference between A and B, I feel that there might be a slight nuance", but I tried to draw it based on my understanding

#Pyramid of Knowledge