The advantages of Scrapbox (Part 2)
What would happen if I wrote this now without reading [Scrapbox goodness] written on 2017-09-15
2019-01-25
 I wrote it and talked about it in a one-hour study session and only got about 40% of the way through.
	I got confused about whether the object of bracketing is a noun or a verb, which is not the main issue.
		The main point I wanted to convey was that "the sense of `#tags` tends to generate an implicit assumption that only nouns are allowed, but this is not the case, and you are free to use verbs and short sentences as well.
	I opened all the links and started explaining.
		Time estimates were not accurate.
2019-01-28 After putting in the time, the language has improved.
	[obsession with the nominative form].
	[Wiki is not a dictionary.]
	[Is a page title necessary?]
	[The obsession with output in the form of writing.]

---
	What is Scrapbox?
		It is a collaborative editing wiki that does not require an explicit save action.
			I could explain that, but they probably wouldn't get it.
		Information storage services focused on minimizing the cost of expressing links between information
		Links are very beneficial, but if creating links is a hassle, people don't link as much.
		What is [Wiki
			There is a "title" on the page where the content is written, and
			For example, a link can be made by `[[title]]` "Wiki Notation".
			hypertext
			What was `<a href="http://example.com/title">title</a>` in "Hypertext Markup Language" (HTML) is now `[[title]]` in Wiki notation
		In Scrapbox
			I'm going to push it further and make it a link with `[title]`.
			You can write so directly, or just select a part of the existing text and press `[` to make it a link there.
			This "act of creating links" is called [bracketing
			Pressing [ while typing a sentence automatically inserts closing parentheses.
				A fuzzy search is then run in real-time according to the string entered, and existing links are suggested.
				Demonstration: I'm going to do "suggestions" here.
				[Scrapbox suggestions are useful].

	[link concept].
		[Link], [tag], and [page title] are pretty close in meaning.
		Because the concept is new, there is no word that can refer to the concept of Scrapbox links, tags, and page titles in one word
		`#tag` `[link]`
		`#tag` and `[tag]` are functionally identical
		Tags look like what we call labels or hashtags.
			Because of this, people who have experience with existing tools that "allow more flexible [organization] than [hierarchical classification] by tagging objects" tend to misunderstand that "that's the way it is, isn't it?
			You can use it that way, but that way throws away an important part of Scrapbox's functionality and is quite wasteful.
			It is important to be able to tag = link words in a sentence (= bracketing)
			for some reason
				In an information organization system that attaches "tags" separately from contents, "tags" are "attached" to "pages".
				[https://gyazo.com/574365e195c7f430d96495c081b72df6]
				It doesn't mean anything more than "attached."
				On the other hand, when bracketing a word or phrase in a sentence, there is the "[surrounding context]" of the word
					explanation
						[Describing Scrapbox on a link basis - R-style https://rashita.net/blog/?p=24530]
						[Use in-sentence links instead of /shokai/HashTag].
							[Hashtags can only be read by people who know what the words mean].
	This is how it's used on this page so far.
		>This "act of creating links" is called [bracketing
		If it simply says `#Bracketing`, even if they are functionally the same, they are different for human cognition.
			= [hashtags can only be read by people who know what the words mean].
		This is a common practice in wikis.
		I wonder if anyone who is caught up in the idea of a hashtag-style information organizer would tag "bracketing" for this sentence
			Tends to include "category names" like `#books #diary #minutes
				The idea of hierarchical classification by folders has been dragged out.
			Instead of organizing by fitting into a known structure top-down, it's better to connect unexpected things bottom-up.

	As a feature inherited from the Wiki, the title of the page becomes the link target
		`[Bracketing]` link leads to a page titled Bracketing
		Used differently from `#book` style tags because it brackets important words in a sentence and is also a page title
			How to use short sentences like [fools learn from experience, wise men learn from history] as a whole link.
				The page with that title has a commentary about that short article.
			To bracket or bracket a verb: [to rot].
				If you follow this [rotting], it leads to [liquefaction of knowledge].
				Key phrases in noun form often tend to be [abstract concepts
				On the other hand, verbs are often close to [metaphors
				It is easy to generate the assumption that "it must end in one or a few noun words."
				In [Idea] p.70, Jiro Kawakita says
					>It is better to write "[one should] drink alcohol" than to write something like "an endorsing statement of the effects of drinking".
					He writes.
			[actively bracketing the verb].

	We don't categorize them hierarchically, we link them together.
		There are two sides to this feeling. Some say they want to "sort it out."
		One of the authors had this to say about the idea of "organizing in a hierarchical manner
			[/shokai/Hierarchy-organized WiKi does not scale].
		Humans are incapable of understanding and following complex rules.
		The requirement to write in the proper place in the hierarchical structure becomes progressively more difficult.
		When difficult demands are imposed, people stop writing.

	On the other hand, there are tools out there with the idea that we should stop organizing and find them through search...
	 To be found in search (unless vague search evolves more), you need to search with exact keywords
	 That's impossible for humans.
		It is impossible to keep them in the right place according to the hierarchical structure, and it is also impossible to properly attach the right keywords and properly search for them when you search for them.

	So, the concept of [Imozuru Search].
		If the information is connected to each other, all you need is a keyword in one of them.
	 Notation quirks can be linked to each other: [Example of finding quirks in Scrapbox].
	 Narrow down your search, select the results that look close, and follow the links to get to what you are looking for.
 	 [/shokai/ if it is eventually found].
	 Structuring information in a way that is neither hierarchical classification nor keyword search alone
		Need to have lots of links so that discovery can be made by following links
			So Scrapbox lowered the cost of creating the link.
			The approach of automatically creating links doesn't seem to be doing it at the moment.
			I don't know if they don't do it ideologically or if they just haven't gotten around to it.
			But at least they're not afraid to put content in automatically.
				[/shokai/garbage dumping].

	[Tadanori Kurashita] in [Scrapbox Information Organizing Techniques] classified the history of information organization into three categories.
		Information Organization 1.0: Location-based Organization
			Things can only exist in one place at a time.
			The same idea applies to placing files in a hierarchy of folders.
			If something can't be clearly defined where it's located, it's out of order.
		Information Organization 2.0: Don't Organize, Arrange
			Arrange them in order of update or access, rather than trying to organize them.
			Find by search
				Search = Refine
			Google has been successful in aligning by PageRank
			Services without a good ranking method tend to be "sorted by update time", etc.
			Sorting by access order is a rule of thumb that "things that have been used recently are used more often again".
		Information Organization 3.0:.
			Networked organization, connected by links
			In organizing physical objects, "put it [in] a place where it will be used often" is a common practice.
				Dishes and knives are usually kept near the kitchen.
			When certain information is used, information [related to] it is used more often.
				→ Linking by relevance of information and "[put nearby]" is realized.
			Relevance" is not only mechanically based, but also subjective to each individual.
				So it must be easy for humans to output that [subjective association].
				Scrapbox facilitated the related outputs by simplifying the notation of links to the extreme

 Subjective and objective associations
 	I don't know what the reason is for the "suggestions of related articles" that are often attached to blogs, etc.
 	On the other hand, in the case of Scrapbox, "things with a common tag" are connected by the name of the tag.
 	That "tag=link" was given by me in the past.
 	Manually selected words used to calculate distances [recommendation engine].
 	Manual Selection = [Whitelist].
 		In the recommendation engine implementation, words that are not useful for recommendations are called [stop words] and eliminated.
 		This is a blacklist.
 		When I used to build a recommendation engine with Cybozu-style article data, an unexpected word got in the way.
 			Due to the large number of interactive articles, the "person's name" becomes an overwhelmingly high-frequency word.
 			As a result, recommending by cosine similarity based on the frequency of occurrence of the word, or recommending by "the same person is in the dialogue article".
 	Scrapbox is a whitelist, not a blacklist, and the recommendations are not a blackbox, nor is the behavior understandable
 		Not "I don't know what it is, but it was recommended to me" but "This article contains the same tag.

	Explains the function of what is called a link or tag
		The word "link" gives the misconception that it is a connection between things that already exist.
	 The term "tag" is ambiguous, and different people have different images of it, but I think it can be easily thought of as a predetermined mark, like a Twitter hashtag, that has nothing to do with the text, but makes it easier to put it all together later.
	 Scrapbox is quite different, more like a "page title" concept
	[link to future].
		Links are identified by color
		External links are underlined, connected links are blue, unconnected links are red.
			The identification method of, well, it's hard to tell at first glance, isn't it?
			 The telomere-based obsolescence indicator is also hard to understand, but I'll explain that elsewhere.
	 Bracketing" as if highlighting important key phrases in a sentence
	 	At this point, the target string becomes a "link".
	 	Internal links as they are not external links.
	 	This link is blue if they are connected, red if they are not.
	 Of course there are "unconnected links," and that's not an unusual state of affairs.
	 	I haven't quantitatively examined it, but there are probably a large number of "unconnected links" out there.
			We don't link because we think it's connected, we bracket because we think it's important.
			This would unexpectedly result in several blue links.
			Connections to other pages are discovered after the fact.
			The phrase "[link to the future]" was a blue link that I thought I just thought of and didn't expect.
				Unfortunately, I didn't find any [useful] information in the link.
				However, this blue link has led me to the idea of a "link to the future" in the past.
				Of course, when I first wrote this "[link to the future]" it was a "[link to nowhere]."
				If you once thought about it, you could [search] for "future + link" and [find something], couldn't you?
				I tried.
					>Related article recommendation by word frequency etc. is not good because the words to be selected are not good, and manual bracketing is human annotation of "good keywords" and "I would be happy if articles in which those words appear are recommended in the future.
					 [2018-11-29]
     >The criteria for selecting strings to be tagged is "[future-self perspective]". It is what the future self wants to extract with.
     	2018-05-27 [tags in Scrapbox].
     	This is an article that [Kazuhiro] Shiozawa wrote in his Scrapbox on May 16, and after posting it on Facebook, there were comments on Facebook, and I thought it would be useful to record the sentences that came out of that exchange.
						My notes on this
							>Structuring information is done "so that it will be useful when you use that information in the future.
					A Google search found this
						>Mr. Sasaki said that Scrapbox is good for keeping track of ideas and things you want to do (in the future), not logs (in the past).
						https://idea-gym.com/scrapbox-training/#Scrapbox
							Not a place to store logs -> spoken of in terms of [not a warehouse to put dead text].
								This link itself is also entered with link suggestions, and when you jump to the link, it's empty but connected to about 4 pages ahead, and then you pick the one you think is original, and then there's an external link further down the page.
									You can get there by following the links [if you can eventually find them].

	2-hop link
		Once you bracket the keywords in the page, it is virtually the same as having a page.
			For example, if you click on it, the screen appears just like a normal page, not a 404 error.
			Blue links are shown not only on the real page, but also when a connection is made to a virtual page.
			Practically equivalent to "search 2 hops ahead in the network described by the link, and if there is content, it is blue
			Often presents unexpected connections because it explores one step beyond human associations
			[https://gyazo.com/3fe3192e02538b272b482993163b1184]

	The Context of Increasing Individual Intellectual Productivity
		I personally feel it's of high value.
		I didn't include it because I didn't understand its value at the time of planning and writing [The Art of Intellectual Production of Engineers], but I would definitely include it if I were planning it now.
		The "three sacred treasures of intellectual production" in my mind at the moment.
			KJ method using 100 small sticky notes
			Make it electronic and searchable
			Scrapbox
	It is difficult to perceive value unless a certain amount of bracketed text exists.
		If you don't feel it's worth it, don't spend time putting down sentences or writing and bracketing them.
		[Chicken and Egg] issue
	[Scrapbox notes]
		Just as notebooks can be used in a variety of ways, Scrapbox can be used in other ways as well.
		For example, taking advantage of the ability for collaborative editing, minutes of a meeting can be taken by multiple people in real time.
			Discussion is more likely to be useful because the discussion becomes textual.
			In the case of doing "one person writes on a laptop and then transfers it to a monitor for everyone to read," the record is poor if the person taking those minutes participates in the discussion.
			When multiple people are co-editing, what one person thinks "should be recorded" is recorded.
			Low bullet cost (1 space) and unlimited hierarchy, so there is no constraint to "one dimensionalize" the discussion
		For example, take your own study notes in Scrapbox.
			Bracket [unfamiliar word] and write what you have researched about the word on the linked page.
			If you write the definition of a normal distribution in a paper notebook, for example, on a certain day, if you want to refer to it a few days later, it is inconvenient because it is several pages away
			If it's digital, you can link to it.
			The cost of that link is low" (just change the string `normal distribution` to `[normal distribution]`).
			As you take notes, you create a network of knowledge.
		I think each is useful, but not quite what I'm focusing on here, which is "[increasing] intellectual productivity.

	Making flow into stock
		How do we create structured knowledge from everyday interactions (flows)?
		People who didn't even keep the flows and disposed of them.
			Verbal conversation
		All emails are stored and searchable.
		Cybozu bulletin boards, Slack, etc.
			The "letter" metaphor of e-mail has been stripped of its back-and-forth greetings.
			Permalinks appear.
				It will be possible to point to and share "past interactions."
		Togetter
			Able to discard exchanges on Twitter, rather than simply sorting through them.
				Slack permalinks are equivalent to "link to the public timeline at a point in time"
				Unlike Slack, where you are supposed to create rooms (channels) in advance for each purpose, Twitter has no rooms.
					So, after-the-fact, only pick up on specific topics.
		Co-editing: a long tradition from Wiki
		Modern tools are a combination of these elements
			[https://gyazo.com/adc8def51e6425916ce6d12774a327cb]


	

 I guess I could export my project and create a new project for explanation.

 An example of abstraction enhanced by the discovery of something unexpected by the link's ambiguous search suggestions.
		[Case study of abstraction in Scrapbox].

