Nodes of Thought2019-01-21
	I had a feeling something was about to be born.
	But I didn't know what it was.
	I felt that if I started working at this point, I would be swept away by my thoughts and fail to grasp the "something" that was so close at hand.
	So I drew it anyway on my iPad.
	I draw it, travel to the station, draw it again on the train, and then organize it on this page.
	[Nodal point of thought].

This part of what I wrote on Facebook on my phone while traveling:.
	Associating while typing words is different from what comes out while drawing a picture.
 I was translating my book on how to learn into English so that I could share it with English speakers, but what I really need to do is to share it with [Tayupinko people].
 	I had a feeling that something was about to be born" was a feeling that a new abstraction was about to be created as a result of the input of various experiences that had not yet been verbalized in the process of translating my book to English-speaking people.
 About the act of [read dictionary] #dictionary
	[fruitful metaphor] # fruitful
	 If the [metaphor] is highly developed within the metaphor space (lots of [networks between concepts]), it has an effect like providing [warp portals] to other spaces, [facilitating] the joining of distant ones.
	 Mapping non-computers [by analogy] to concepts in the computer science domain has worked beneficially
 The "[slow reading]" of translation is effective in assembling knowledge.
 Coupling is discovered after the fact.
 [concepts tied to diagrams] and inefficient with text.
	 Can it be a link to [metaphor space]?

	[https://gyazo.com/812c9a2ec5f31d5f68ead4938e396203]
		[2019-01-20 Facebook https://www.facebook.com/nishiohirokazu/posts/10217342805218656] and related
			A metaphor that chaos is already dead when you push it into a one-dimensional symbol string, and that a seed may be born from the corpse.
			Well, the problem is bigger because it can only represent one-dimensional permutations of symbols.
		 What meaning is expressed when two words are followed by one another?
		 The basic premise is that they acquire language while observing the same world, so they will be reading the same books and so on, and pointing.
		Supplemental Explanation:
			When humans acquire language, they acquire it by being in the same space as the person who teaches the language and observing the same things.
			Learning proceeds when pointing by eye gaze or [pointing] precedes speech, and adults provide feedback on the output of that pointing
			If a machine acquires language, it will be while reading the same books as a human or something.
		[https://gyazo.com/27ff7c383e9835e564061cb09a4eca0f]
			Need help with the "[building up work]" part of this.
		 [no permalink for human experience].
		 [forgetting], [disambiguation], [decomposition], [decay], [fermentation]
		 	Forget [unimportant] parts = [abstraction].
		 	What is important?
		 		Random wiring is fine at first, just learn after the fact.
		[Associations are not similar searches.]
			[https://gyazo.com/2cc8e89a9b7637bdf3b058044512a539]

			One type of similarity is not the only [metric] similarity search
			Relationships are diverse
			One way is to create multiple metrics by dimensionality reduction from a metric.
			Equivalent to variation in "what counts."
		[learning process that takes 10 years].
			Human learning takes more than 10 years.
			What happens when a machine is designed to take 10 years to learn as well?
			Must be interruptible
			Lower layer calculator will be upgraded over the course of 10 years, need a movable design
		I did my own [sutra]-like actions in the process of translating into English.
			[https://gyazo.com/2cc36da3e64441cb8b6d79285f420bc5]
			[Translation is one of the ways to read slowly] #Translation
			Cases in which Japanese words expressing "important concepts" do not fall easily into English
				Example "Thinking as you write"
				Expressed by adding an additional page and writing more explanations
				Different symbol spaces are caused by different distributions of symbols.
					Why not try to express yourself in a language with a smaller vocabulary?
						[Basic English - Wikipedia https://en.wikipedia.org/wiki/Basic_English] or
					Grammery says, for example, that words like "important" tend to be "overused, so why don't you use another word?" He says, "It tends to be overused, so why don't you use a different word? However, if we want to convey the same concept to non-native readers, we should not unnecessarily use different words to express the same concept.
					Isn't it enough to actively use very good / good / bad / very bad?
			What is the abstraction phase?
			be unbroken

	[https://gyazo.com/109a1860310ba4ba14e236781c852ebe]
		What is the [abstraction phase]?
			Connect keywords that appear in multiple locations
			Find and unify similar expressions
				Example: overall picture / whole picture
		What is the output/verification?　→[information to facilitate abstraction].
			The first output in the development of intelligence is [pointing].
			Learn from that feedback.
			[Pointing] = indicating a pointer.
				Example: Indicating a page with a book
			This is not beneficial from the start.
				Babies don't start out doing useful work.
			What specific feedback is needed?
				Important Questions
				But I tend to be biased toward examples.
			What does that feedback look like? #Clean Questions
			[information that facilitates abstraction] in the subject.
			What does abstraction look like?
			A
				[Extract the important parts].
				Give [handle].
				[link to other information].
			What does Scrapbox give humans?
				Bracketing = markup of key phrases that you think are important
 				Provide a means of referring to pages with detailed information in concise key phrases
 					Same functionality for page titles
 					Unlike mere permalinks on Twitter, Facebook, etc., a human can read the meaning from the title itself.
				link
					The connection is expressed in color.
					Similar key phrases are suggested by ambiguous search when creating links

	[https://gyazo.com/8345abdf478bb9c77b8635e3e0a32ab8]

	The associations you have when you are drawing are different from the associations you have when you are writing.
		Why not?
			The question is instructive.
				Some beneficial, some not.
				Should be low cost and negligible
		What's the difference?
	Painted, difficult to search for current status
		Search is a means of [human enhancement
		Difficult to convert all to language
		OK if some vertices are searchable: [potato search].

	The associations you have when you are drawing are different from the associations you have when you are writing.
		Why not?
			Easier to express "links" and "relationships" in pictures than in text.
			What is easy?
			No time axis, no restrictions on one-dimensional representation
				Even the process of reorganizing this section into bullet points is inconvenienced by the restrictions.
			Similar to the case of different Facebook threads joining later.
		 Coupling is discovered after the fact.

 [concepts tied to diagrams] and inefficient with text.
 	[https://gyazo.com/ad6c692f1e488887e6f68c493434247a]
			This of course means [human + computer = augmented human
		[Associative connection] and so on.
  Is there a case where [link to metaphor space
