Information to facilitate abstraction
I was thinking about what kind of information we need to give to educate the intelligentsia, and the inspiration came to me, "Isn't that [Scrapbox]?" I was thinking about what kind of information we need to give to educate the intellectual body, and the inspiration came to me. I realized that there are some differences, but it is interesting to note them down.
Derived from: [thought-node 2019-01-21].

[https://gyazo.com/064acee25a006f83fb276bcae396187f]

	The first output in the development of intelligence is [pointing] = indicating the pointer
		Learn from that feedback.
		What does the feedback look like?
		Information that promotes [abstraction] in the subject
		What does abstraction look like?
		A:
			Extract the important parts
			give a person a handle
			Links to other information
		What does Scrapbox give humans?
			[Bracketing] = markup of key phrases that you consider important.
				Provide a brief keyphrase reference (=handle) to a page with more information
					Same functionality for page titles
					Unlike mere permalinks on Twitter, Facebook, etc., a human can read the meaning from the title itself.
			link
				The connection is expressed in color.
					The machine is replacing what humans recall and associate with, "Here's something that might be related."
				When creating a link from a keyphrase, an ambiguous search will suggest similar keyphrases.
					Provides associations between key phrases rather than using key phrases as mere identifiers

Strictly speaking, Scrapbox provides a "means of important part markup" called bracketing, but it does not mark up important parts for long sentences entered by humans, so it does not mean that "Scrapbox is giving information to humans" regarding this part.
Suppose that for a sentence on Scrapbox, Scrapbox suggested "strings of text contained in that sentence that have been used as links or titles on other pages" as candidates for bracketing, that would be providing information that would encourage abstraction.
