Approval and Intelligence
https://www.facebook.com/nishiohirokazu/posts/10217342553412361

I think the story that [desire for approval] lowers [intelligence], there are experiments that show that it also lowers with sexual desire, it also lowers with fear, and I think the generalization is that having [emotion] lowers intelligence.
But when I think about it, a personality emulator in me says, "[Anger is beneficial]," and he actually achieves results with it, so what does that mean?
Does it mean that anger, greed and emotions create [motivation] for action and intelligence goes down a bit, but [the outcome depends on] the product of motivation and intelligence?
https://scrapbox.io/shokai/人間には承認欲求を刺激すると知能が下がるバグがある

In that light, the scope of observation may simply have increased due to the fact that the "barriers to becoming observable" have been lowered by technological advances and the design of services that encourage behavior by stimulating the desire for approval.

Masafumi Otsune
	For example, the instinct to turn the body and hands in the direction of the line of sight, though I assume it was beneficial for physical hunting and protection from flying objects. With the invention of the automobile, it would be dangerous if that instinct was exercised when driving at high speeds. Therefore, driving schools began to train people not to let their hands get caught in the movement of their eyes. There may be many cases in the Internet society where, due to the invention of tools or changes in the environment, reactions that used to be effective become harmful.

Emotions create "objectives," so sometimes the emergence of that objective is beneficial for the type of person who is highly capable of solving a problem but has not found the problem to solve. But since the problem is irrationally determined by emotion, it's undecided whether that objective is beneficial in the long run.

The idea is to separate greed from action through training. You should not suddenly grab food from a convenience store and eat it, even if you are hungry. This would have been OK in the hunter-gatherer era. Similarly, anger management, for example, has been developed to separate anger from behavior. Until just a few decades ago, it was not much of an issue. But as the social environment has changed in such a way that control can make a significant difference, people have become more aware of the need for control. In the past, an individual's ability to transmit information was limited, but technological advances have changed the environment. In this era, fear of transmission and overreaction to the response to transmission can easily lead to a significant difference, and the need for control emerges.
	[Emotional Control]

Around whether you should do ego searches, whether to use a consistent identity such as your real name, and how to handle your emotions when you see negative opinions.

The problem is that it's hard to recognize on your own that you're in a bad status, Apple Watch says, "Are you typing a sentence in anger right now? Get up and take a walk!" And it should say, and eventually will, if that control is beneficial.
	[Same observer issue]

Masafumi Otsune
	The desire for approval seems to come from the acquisition of skills and protective relationships that occur in interpersonal relationships such as parent-child or master-pupil in herd-building [social animals]. I wonder if the reason why one-dimensional axis ranking is popular as a buzzword is because we are used to dealing with simplified models like [hierarchical relationships] rather than seeing things from multiple perspectives. (Hypothesis)
		[nishio.icon]Besides the hierarchical relationship, it is also "Those in power are evil, and we are righteous! Let justice be done!" also seems to be a buzz-worthy impression ([lusantiman]).
			It's a simplified model, [processing fluency] may have something to do with it.

Jun Harada
	My personal understanding is that 0 to 1 cannot be done rationally in most cases, so impulse and desire are necessary, but 1 to 10 cannot be done emotionally, so it must be done rationally and intellectually.
	This is because there is often a fair amount of 0 to 1 that there is no market for, so unless it is based on personal taste, it is seldom accessible.
	On the other hand, he said, 1 to 10 has to be considered objectively at a certain level because it has to be easy to use with the agreement of many people.
		[nishio.icon]Interesting cut to divide 0 to 1 and 1 to 10.

Shinichi Kato
 Only one of my cats can push the doorknob open. The other one knows exactly how to make a sound so that the owner will listen to him.
	Some intelligence X may not be one-dimensional, such as a high intelligence from the perspective of objective a, but a low intelligence from the perspective of objective b.
	I mean, is it possible that intelligence tailored to the purpose of approval has been activated and the rest has been deactivated?
	 [nishio.icon] Indeed, I'm wondering what past experiments have measured intelligence by.

Hideki Kondo
 Did I mention the [Urge Theory]?
	We are in the modern age, so we tend to think from there, but evolutionarily speaking, it is the opposite.