Draft: IT Changes Cause Changes in the Rules of Work
Draft written in January
	see [Musashino City Endowed Lecture "IT and Rules Now and in the Future" in 2019].

	Musashino City Endowed Chair] "[IT and the Future of Rules Now and in the Future]" to be offered at [Seikei University] in the second semester of fiscal 2019.
	Coordinator [Kazuhiro Shiozawa]
	The target audience is mainly students of the [Faculty of Law] and all four grades of the four faculties (Faculty of Economics, Faculty of Letters, Faculty of Science and Technology) + 150 Musashino citizens.
	A gentle introduction to contemporary topics in the area of expertise and its near future
		I think it would be good to talk about how advances in information technology are changing the rules for how work is done, etc.
		https://logmi.jp/business/articles/320484

	Generational range of audience seems to be wide
	 Different associations with the term information sharing
	 	Post paper on a physical bulletin board
	 	Contact them in turn through the telephone network.
	 	circulate a circular notice (e.g. to the public)
	 	Posting on electronic bulletin boards
	 	Send Email
	 	Batch reporting on mailing lists
	 	Send a message to one person in chat
	 	In some cases, today's college students have a generation of class chat rooms on line in high school.
		I guess we should check the history first and create a common understanding.

Flexible working style
	[Individualized]
		Attitude toward the individual
		The opposite approach to [mass-produced] industrial products
	Payroll Tables
		Technology that does not face each individual, but bundles people together by job class or other characteristics to handle them efficiently.
	Cost of individualized service
		Absorbed by information processing technology
			[Cybozu HR system#5bb4465aaff09e00007dd9c4].
		Communication on groupware instead of physical interviews

hierarchical organization
	Organizational structure suitable for controlling a large number of people in a situation where information distribution is a bottleneck
		[command and control].
		An organization is composed of people who issue orders and people who follow those orders.
	It separates the "thinkers" from the "doers."
		Those who act are the first to detect changes in reality.
		If reality doesn't change, it doesn't matter if the thinkers are separated.
			If not, the inability to think based on the changes you perceive will be fatal.
	Responsibility to ask questions, responsibility to insist on what you want to do
		>As the program for working mothers was being expanded and expanded, a sales man complained to Aono, "Why do you support only mothers so much? What did Aono say? He said, "Well, tell me what you want me to do.
		https://logmi.jp/business/articles/320484

Environmental Changes
	The reason we set "rules" and make people follow them is because there are benefits to be gained by doing so.
		Law is not ethics or religion.
		If the situation doesn't meet, if the current rules are disadvantageous, they will be amended.
		The rules of the country, the laws, also have means of amendment.
		The same goes for internal rules; rules that are detrimental to working efficiently should be revised.

[partial access rights].

[Intellectual Production of an Engineer Before and After]