Bulleted notebooks work well.
[https://gyazo.com/b89406b9f18953f65e0fd2c47c405a2d]
	Bullet Journal" works well for the first time #bullet journal #bullet journal #notebook
	[Amazon https://amzn.to/2CGz6GK]
	Marie

	My wife checked out several books on [Bullet Journals] and suggested the one that she thought was the best for me.
	[The author Marie, who used to be a "bad organizer," has been using the Bullet Journal since she first came across it in 2013.

	Developer: Ryder Carroll, Digital Product Designer
		I have a [learning disability] and have created an ingenious way to improve my own life with [concentration] problems.
	The most important rule
		[Rapid Logging] : [Rapid Logging]
			Keep [rules as simple as possible] when writing.
			Marie's experience was as follows: "When I separated the pen colors by genre, it was easy to see when I read back, but I had problems writing because I didn't have the necessary color pen on hand. It is difficult to even carry a pen of each color when you are a [zuborah], so I stopped color-coding.
			I wrote in "[Colors of front cover and labels]" in [The Art of Intellectual Production of Engineers], "I don't distinguish the colors of my labels. It looks pretty when I do this, but it's a hassle to use multiple colors of labels." The same idea as
		The phrase "you can make anything but the basic rules to your liking" has taken on a life of its own, causing a trend of posting painstakingly and beautifully finished notebooks on Instagram.
			Simple things don't get shared because they don't look like installations, and only things that require a lot of work get noticed.
			Going through the hassle is contrary to the principles of Rapid Logging.

	A daily record called a "[daily log]."
		It is important that [space is not a limitation] and that [anything can be applied].
			⇔ Notebooks with pre-defined space for one day and pre-defined contents to be written
		The "anything" in "anything you want" is the following two words
			Things to do that day = [task].
			What came to mind that day
		Write whatever comes to your mind that day." = "[Write whatever comes to your mind]."
		Advantages of a notebook [in which you can write anything
			I just thought of something.
				Where to write.
				Do you write in a notebook or a notepad?
				Where to write in your notebook?
				How much to write about how much to write about how much to write about how much to write about how much to write about
			You can write instantly without thinking about things such as
			To take advantage of this benefit, it is a poor idea to generate "which color pen to write with".
		[From "a notebook for schedule management" to "a notebook for recording what you want to do and what you have done.
			Accumulating a record of what you've done gives you confidence.
			Know your [strengths] by looking at the record of what you were able to do.
			Logging" is the main focus.
			Manual [Lifelogging].

Four basic configurations
	Index: Table of Contents
	Futurelog: Six-Month Schedule
	Monthly Log: Monthly Schedule and Tasks
	Daily Log: daily schedule and tasks
Details
	index
 	Part that is to increase the freedom of placement of other parts.
 	Leave the first 4 pages or so open.
		Write what is on what page
	future log
		Write a six-month schedule on a spread.
		For example, divide the page into three parts.
	monthly log
		Write down your schedule and tasks for the month
		Write at the beginning of the month
	daily log
		This is the bulk of this notebook.
		I'll add to this daily.
		configuration
			Title (Today's date)
			Bullets and Keys
			page number

Bullets and Keys
	Make it easy to understand at a glance by devising a symbol (key) to put at the beginning of each bullet point.
	Not a special concept, but something that many people do naturally, and we've named it "the key."
	Early keys used
		□Task
		☑︎Completed Tasks
 	Clearly distinguish between "what just came to mind" and "tasks that really need to be done today".
 		This allows you to determine at a glance if what you really need to do today has been completed
 		Don't "task" something to the extent that it occurs to you that you might want to do it.
 Marie's early keys (excerpts) and Ryder's proposed key from 2015
	 [https://gyazo.com/4a3663b109d11de28e15290cd78a746c]
		Personally, I'm familiar with Marie-style "tasks are check boxes".
			I too had differentiated between "task, completed, and cancelled", but I didn't put a different symbol on the one I sent the next day.
			The postponement symbol keeps a record that "this task was not executed and sent to the next day".

Consider the relationship between [GTD
	Writing down anything that comes to mind" is a concept shared with [GTD].
	In GTD, Inbox is a "box for everything".
		Empty this Inbox
	In the Barrett Journal, the Daily Log is "a box for everything."
		Empty the box at night or the next day.
			= Looking back
		Uncompleted tasks will be rewritten in the log for the next day
 		This re-writing effort is positively worth it.
 			It creates opportunities to read and think.
 			Continued use of the same task list over multiple days does not provide this opportunity.
 				What you didn't do will just stay there forever.
 				Eventually I'll get sick of looking at it.
 	Tasks that continue to be carried over, that's what the logs reveal.
 	Is this task really necessary?"
 	If you don't do it today, you have three options
 		Cancel
 		Divide (e.g., into 5-minute and 10-minute increments)
 		(Marie didn't write it, but the logic is) schedule it on a specific day.
 	Difference between canceling and erasing
 		Unlogged electronic task management tools make it impossible to "erase" and look back.
 		Cancellation in the Valet Journal will be recorded as "I was going to do it and put it on task, but after putting it off for days, I cancelled it".
 		Even after you turn it off, you can look back.
 			Maybe things have changed and it's easier to do.
 			Maybe we can come up with a new way to divide them.
 			The objective you wanted to achieve might be achieved with a different method instead of that method.

 My impression is that it is a notebook technique that can nicely complement the daily practice part of GTD.
 	GTD is heavy on initial collection work.
 	The Bullet Journal is a [incremental] improvement by writing down all the kids you think of on a given day, clearing them out on that day, and repeating the process.
