Transcript CUMOT2018
Nishio: These three themes came up during our discussions.
At first glance, the themes seem to be completely disjointed: talk about software that promotes intellectual production, then talk about the importance of output, and then talk about career strategies. I have been asked to talk about these three themes 〓00:00:13〓题. I was asked to talk about these three topics at 00:00:13, and I thought it would be strange if I just gave a one-way lecture on the importance of output and you just had to do the input. I thought that would be unrealistic, so I have designed the lecture so that there will be time for output in between each of the three lectures. So, before the lecture begins, please have a sticky note and a writing utensil ready.
Please keep one sticky note per person, and the challenge is to write at least 10 notes in 3 minutes. 10 notes in 3 minutes means 10 notes in 180 seconds, so you should only spend about 18 seconds on each note!
So, please think of it as if we are only looking for that level of wealth. We are not asking you to write long sentences, but to write a story that you can write one every 18 seconds. We are asking you to lower the bar. Theme. You can write about "output" or anything else that comes to your mind. The hurdle is very low. You can really write about anything. The challenge is to write 10 pages in 3 minutes. Wait until these people join us (laughs).
Male: About output?
Nishio: About the output. If you have any questions, I'll ask anything. Moreover, or anything else that comes to mind. If I ask you to write freely about anything, I thought it might be difficult to do so. About output. For those of you who just arrived, do you have sticky notes at hand? Do you have a sticky note and a pen at hand? Are you ready? Preparation. This is a time trial game; the goal is to write 10 or more pages in 3 minutes. We are not looking for quality. We are looking for quantity.
Are we ready? Is there anyone who says they are not ready yet? No one. Okay, let's start. Let's get started.

First of all, many people sometimes make 〓00:02:54〓 unreadable, but may I ask you to expand what you have written so that I can read it? 〓00:03:00〓Check how many sheets you were able to write.
WOMAN: Just ten.
Nishio: Just 10 sheets. Have you finished spreading them out? There are so many here. 15 sheets or more?
It's more than 15 sheets here too. How many?
Male: 16.
Nishio: 16. more than 16. 18. maximum value of 18. median value of about 10, okay? Then who hasn't written 10?
How many sheets?
Male: 9 sheets.
Nishio: Nine sheets. Then the rest are all able to write 10 cards. Then who has more than 13 cards?
Men: 13 sheets.
Nishio: So, would you say that about 13 is the middle of the range?
Audience: (laughs)
Nishio: Appropriate. I would like to ask those who wrote 9 sheets about why they wrote 9 sheets.
Man: First of all, a lot about GMSS.
Audience: (laughs)
WOMAN: Such a difficult thing (laughs).
Nishio: You should have written it down.
Man: If I write it down, it's a little...
Nishio: You thought about writing it but hesitated to write it?
Man: Hesitation.
Nishio: I see.
Male: Hesitation 〓 00:04:53 〓
Nishio: After I wrote it, no, I should have crumpled this up. I should have thought about it after I wrote it.
Woman: Oh.
Nishio: As for the goal this time. The only goal was to write 10 or more pages in 3 minutes. I should have thought about whether it was OK to write this or not after I wrote it.
Yes, I did. That's how the first session of outputs ended. Let's put the outputs aside for a moment.

Session 1 of the lecture. I would like to proceed with the lecture theme of software that promotes intellectual productivity. I included it in the first session because Mr. Tachikawa asked me to talk about this by all means and because it is very much related to my self-introduction in the first place. I am a principal researcher at a company called Cybozu Labs. Many of you may know Cybozu as a groupware company. I am also a specified associate professor at the Tokyo Institute of Technology, and I do a variety of other parallel work.
My introduction goes on a bit longer, but I have written a book on the technology behind coding and word2vec various books. This book, The Technology Behind Coding, is a book I wrote just about 5 years ago. This book was released in 2013, and it is still selling well. Why is this the 〓00:06:20 formula that is hard to become obsolete? I wrote this book to write 〓. Five years later, recently this summer, I was asked to do an interview about this book, and I was interviewed and wrote an article about it. It is a very long-lived intellectual production. Books are the result of intellectual production.
Here is the book I wrote this year. The Intellectual Production of Engineers. I wrote this book five years later, but you will see a little more about the contents of this book later on. The key word in this lecture is output. The subtitle of the book is "Efficiently learn, organize, and output. The subtitle of the book is "Learn Efficiently, Organize, and Output. What kind of thinking is useful even 10 years from now? What kind of knowledge will be useful in the long term?
Yes, I am still introducing myself. I'm still going to introduce myself. Let's talk about Cybozu. Are you familiar with Cybozu?
We are a software company founded 20 years ago, which we are glad most of you know. We are a company that sells its software with the No. 1 market share in Japan. We are a groupware company. One interesting point is that more than 350,000 people use this product. Just in this part of the cloud, that is. So, most of you know that Cybozu is a groupware company, but what exactly is groupware? What is groupware? Can someone other than an employee explain it to me?
WOMAN: Other than employees (laughs).
NISHIO: Anyone who wants to try to explain. Then an employee.
Men: Simply put, software that shares information.
Nishio: Yeah, yeah. Software that shares information. In a nutshell, the theory is that it is software that shares information. What I am going to explain this time is that groupware is group + software. It is software that is used by multiple people. Then, what is it used by multiple people for? The purpose of using it with multiple people is to distribute and store information in a correct way. I was wondering what I would do if I got some totally different result. This is the purpose of groupware. Recently, we hear rather often about artificial intelligence and AI, don't we? Such talk has fueled fears that computers will catch up with and overtake the human line, and there are many such articles in the world, but this knowledge is very one-sided. But this is one side of the coin.
Slide from earlier. The human line this does not change, a straight line is drawn. This means that the assumption is that human ability will not change. In contrast, the computer's performance improves with time, so the picture is that it will one day surpass humans. As computers continue to develop, the capabilities of the people who use them also continue to improve. For example, the reason why computers were created in the first place is that human beings are not very good at calculation, but when we use computers to calculate, we can do a lot of accurate calculations at a higher speed. That is why the computer was created as a calculating machine. By using computers, human computational ability has been strengthened. It is making us stronger. What happened next was the birth of the Internet. What was strengthened by the birth of the Internet was the ability to distribute and store information. Before the Internet, for example, you would just go to the library and borrow a book. If I was in Japan and wanted to read a book that was only available in the library in England, it would be very difficult to order it from the library. I would write a request for a photocopy, send it by mail, and then get a photocopy made by a photocopier over there and sent back to me by mail. With the advent of the Internet, data such as pdfs stored on servers in the U.K. could be searched for on the Internet and downloaded immediately with a simple click. This is an amazing speed-up. This is a great speed-up in terms of information distribution among humans. In addition, the Internet has been so beneficial as a place to store information that people are putting more and more information on the Internet. This has created a huge amount of information, and the problem is how to find what you are looking for. This led to the creation of search pages. The search page was created to allow people to enter keywords and search for information from among the vast amount of information that cannot all be stored in the human brain. In the old days, a librarian would have been able to search for a particular item. In the past, librarians somehow had a certain amount of information in their heads about what kind of books were available, and when they said, "Librarian, I'm looking for this book, do you have it? and he would reply, "Oh, I think I might be able to find it on the shelf over there. And then he would return the book to the librarian and try to find it. Or, in the library, there is a library card. Have you ever heard of a library card? For example, there was a time when you would open the book index on a piece of paper, and if you opened the medical section, you would find a card with all the information on that medical book, and you would go to the shelf to get the book. How happy this has become thanks to computers and the Internet. How the time required for human intellectual production has been compressed. It has become so much easier. This is why we are becoming more and more enhanced with the evolution of computers. Computational power and the ability to accurately and repeatedly process information have improved, as has the ability to store information, and the ability to distribute and exchange information has increased. And the birth of search has strengthened our ability to recall information. Instead of a human being recalling information stored in the brain, we can search databases, libraries, and Internet search engines for keywords that we want to look up, and the information will be returned to us. This is a system that can recall information on behalf of humans on a computer. By utilizing this system more and more, human beings' intellectual production capacity will increase rapidly.
Groupware is software that empowers people. Groupware is software that is introduced into a group and helps the group increase its intellectual productivity by helping the group distribute and accumulate information. Why did I mention hundreds of thousands of people in a boastful manner earlier?
Why? It's because the company implementing that groupware has a capacity-enhancing effect that is sufficient to do so. Even if you pay that much money, you still get a return. It raises the power of the employees to that level. I don't remember how many companies there are in the world that think so, but there are many companies that are as shown in the graph. Groupware is a tool that brings this kind of accurate repetitive processing, accumulation, distribution, and retrieval of information brought about by computers to the company, and enhances human growth.
There are companies in the world that do not think it is necessary to introduce groupware, but if a company has only one or a few employees, it is not necessary to introduce groupware. But Slack and Chat are also a kind of groupware. It is software for use by multiple people, and it raises the level of information distribution, making it more effective than verbal communication, and since communication is done by text, it is logged and can be retrieved later. However, Slack's business model is to hold data hostage so that once a certain amount of logs are accumulated, they cannot be retrieved, so you have to pay to see them. It's a groupware. If the number of employees is small. This is what happens when the company gets bigger and bigger. Oh, I forgot to ask, but how many of you belong to a company of over 100 people? If there are 100 people in a company, it would be difficult to read the output of all 100 people if it all flowed to you. It's a little bit hard to read the information that is 100 times more than your output. That is a bit difficult. In the past, when there was no groupware, what we did was to divide people into different departments. Then, communication would take place only within a department, and communication across departments would go up the port line, be discussed at the general manager's meeting, and then come down the port line. There was no other way. One of the reasons for this is that it was the only way at the time. In this age of groupware, if information within a department is completely inaccessible to outside departments, the search cannot be effective. If you can only search within your own department, the volume will be small. If only some information that should not be shared is hidden, and the remaining information that has no reason to be hidden can be shared by all employees, then all employees can search and access the vast amount of internal resources. This is the kind of thing that can be done. This creates clues for cooperation between departments. For example, if there is a sales department and I am in the research and development department, and the departments are clearly separated, and we cannot see each other's information, we are very distant from each other. The people on the sales side would think that they do not know what the research department is doing, and the research department would not know what kind of people the sales department is getting information from, and then we would tend to have meetings together to discuss how to distribute this information. This is an actual example of information sharing, but it is also a case where a sales person searches for keywords within the company for information on the company he or she is going to work for. Then, a message would come up saying, "Mr. XX used to be from Company XX," or "Mr. Nishio from the research department is meeting with that company, but I don't know what he is meeting about, so can you tell me more about this meeting you went to a while ago? I don't know what the meeting is about, so I was wondering if you could tell me more about what you went to a meeting about a while ago. And then, "Yes, that's fine. This is the kind of information that can create clues for collaboration between departments to discover such information. By searching. This information would never have been in a single person's head, so the groupware computer remembers it for us. By storing the information and searching for it on the computer, the computer will remember that the person in question is from there, and that person has had meetings there before. That's how it works. Now that I've said all I have to say, Mr. Tachikawa, we've come to the end of Session 1, and it's time for outputs.
Tachikawa: Good pace.
Nishio: It is a good pace.

Nishio: So let's get right to the output time part 2. The theme is a little bit different. I'd like to talk about human enhancement or anything else that comes to mind.
Tachikawa: It needs to be cleaned up.
Nishio: If it takes time to clean up, you can leave it as is.
Male: It's going to get mixed up.
Nishio: I see that it is difficult to understand in counting the number of sheets.
WOMAN: Yes.
Nishio: I think we should have changed the color. Well, let's wait until everyone has finished cleaning up. Is everyone ready? Is there anyone who still wants to wait? Are you ready?
So, let's get started.
One minute left.
Is there room to finally spread all this out and list it? If it's a full desk full, I'll ask you to clear off your desk.
Yes. It is finished. So, who says they haven't written 10 sheets? How many sheets?
Women: 9 sheets.
Nishio: 9 pages. What happened to your writing earlier? Did you get nervous? Well, but since you wrote 9 pages, you could write almost 10 pages. Now, who has written more than 18 sheets? How many?
Male: 19.
Nishio: 19.
Female: 20.
Nishio: 20. this is interesting.
WOMAN: What - why?
Nishio: No, no.
Man: This is interesting.
Nishio: Interesting, isn't it? Don't worry, we'll have time to look at everyone's stuff at leisure during the group work time later on. So, who has more than 16 cards, one person, more than 15 cards, more than 14 cards, more than 13 cards? The median is 13 again. The people who can write a lot are growing, but the median and minimum haven't changed much. We have two more chances to practice.
Woman: (laughs)
Nishio: I am a little worried that this person who just came in will be the next minimum.
Man: I see.
Nishio: So there is already a difference of two practice opportunities. That's what I meant about the poor people who come late. It is okay. Let's not count 〓00:23:16〓 when it comes to the minimum.
Mr. Tachikawa, is the pace just right in terms of time?
Tachikawa: Just right. It's just a little bit roomy.
NISHIO: Just a little bit of leeway; are you okay with stretching it by three minutes? Now I would like to include thinking time. First, the Thinking Time will start for one minute; one minute of quiet, silent thinking time. After that, I will give a number to each person who raises his or her hand, and that person will give the answer. Thinking time has started, so if you all have any questions, please think about them.
Male: Questions for Mr. Nishio?
Nishio: Anything is fine.
Men: Whatever.
WOMAN: Anything?
Nishio: Question in this area.
Man: Question in this area.
Nishio: Thinking time is over. Does anyone have any questions, 1234, we'll take those four. Then in order, yes.
Male: Okay? I think it is quite difficult to reinforce this, and I feel that by having external engines and searches, people's ability to remember is degenerating...even though we remember, it is on the other side, so we recognize it as a no and remember it as such. I feel that this is degenerating. I am writing this as if the human base has not changed, but in fact I feel that it is degenerating. But I feel that we are actually degenerating.
Nishio: Would it be a problem if [flesh-and-blood] abilities degenerate? Even though we have computers. For example, I think that people today are not as physically strong as they used to be when they were farming, but what harm would that do?
Man: No, I don't think so.
Nishio: They say there is no such thing. The environment is changing, and people are also changing to adapt to that environment. The rules that are required are changing, so to put it another way, people who used to be very good at remembering things and who made money just by being very good at remembering things will not be able to make money in today's world. Because if you write down the data in the 〓00:26:10〓list format and search for it, you can easily find it. But in the really long-ago Ritsuryo period, a grandfather or a grandmother who remembered past history, etc., such a person would be 〓00:26:25 revered as the head of the village, as a person with knowledge? That was the 〓 state of affairs. That 〓00:26:27 Kaikyo? 〓 was changing rapidly with the creation of data, and the 〓00:26:30education system?  It is impossible for us to warp to a time when there was no Internet or electricity and work or live there, except in the case of a great war. Therefore, when we think about how to adapt to our current surroundings, it would be good if we could improve our abilities to replace those we don't need by losing the abilities we don't need.
Male: I may have been a little off. The point is that you don't have to be fast to get where you want to go, but you can get there if you can get in the car fast enough.
Nishio: If you look only at the slowing of the legs, it is a degeneration, but in terms of overall ability, it is just no longer needed.
Man: I see. Thank you very much.
NISHIO: Yes, the one with the second question?
Female: I have a question about groupware. Our company used to use Cybozu, but since the real estate industry is an old industry, the older employees could not keep up with the times and could not fully use it. All of us younger employees are hoping that these people will keep up with the current times. What kind of language should we use to get these people to think like groupware? What kind of words can we use to get them to think about groupware and the importance of information sharing?
Nishio: Very difficult (laughs).
Audience: (laughs)
Nishio: Rather than asking people who are unable to learn new things how to learn them, I would like to strengthen my own ability to gain the trust of the person, for example, and acquire the ability to draw out information from that person, and then write down what that person says on the groupware.
WOMAN: Yes, that's right.
Nishio: I think it would be more beneficial to use your head to think about how to improve your own abilities. Even if you did your best to improve their abilities a little, they would probably die soon.
Audience: (laughs)
Nishio: I think you should make it a top priority to get yourself as a way of using your life and the limited time you have in your life.
Female: 〓00:28:47 oriented intervention? Do you feel like 〓?
Nishio: Yes, yes. In summary, that's how it is.
WOMAN: Thank you very much.
Nishio: Yes, the third one?
Male: What I want to ask is whether the use of groupware changes the shape of the organization.
Nishio: I think there is a great possibility that the shape of organizations will change. The reason for this is that there are many hierarchical organizational structures in the world.
Male: Yes. I think I mentioned earlier that remaining in the current organizational structure is the best way to share information when it cannot be shared well. So I am wondering if the organization can be changed by using groupware.
Nishio: I think it can change a lot. First of all, the message from the top is directly conveyed to the people below. On the other hand, it is difficult for the top management to listen to what all the people at the bottom have said. For example, if there are 100 employees and the top management is one person, it is impossible for the top management to listen to what all the top management has to say. The role of listening and making decisions will be divided among the top management. What happens when information is shared and can be retrieved is that communication between departments becomes closer. If the distribution of information had been handled by human beings, it would have been a 〓00:30:05 3-course route, going up and down the reporting line. However, if information from other departments can be obtained by direct search, it is more efficient for the person who finds the information to contact the person in that department directly and communicate with him or her. This is more efficient than going up and down the reporting line. It is not so simple as to say that the structure of a company will immediately change just by installing groupware, but if we continue to discuss what kind of company structure is best while groupware is in place, the tree-like structure will gradually break down. The tree-like structure will gradually break down, or rather, it will change into a new form.
Man: I thought the middle line for example in the tree shape would disappear from what I just heard.
Nishio: I understand. If there are people who were only in the role of conveying information in the middle, they are the ones who will be completely replaced by computers and will no longer be needed.
WOMAN: Oh I see. That's the person who lost it.
Nishio: (laughs) Let's not talk about the person in question.
Woman: Exactly.
Nishio: The reason that direct computer-based information distribution was not possible was that if one person could only see 10 people at most, 10 people were needed in between to see 100 people, but if you tried to go directly to the people in between, you would lose them.
WOMAN: Yes, it does. It really wears on you.
Audience: (laughs)
Nishio: It's very hard to talk about (laughs). Actually, it will be officially released around January next year, but I have already made it public. I'm not sure exactly what it means, but the details have not been made public yet, and I don't know much about it myself. I don't know exactly what he is talking about, but I think it is becoming possible to change the structure of the organization, and there are a few companies that are willing to try such a change. So, I think that in 10 or 20 years' time, companies will not always have the same hierarchical structure as they do now. Okay, who was the fourth person?
Male: I'm 〓00:32:07〓(Laughs)I heard yesterday about a 〓00:32:18need-up of a side job in our company? I thought it was interesting to hear that various employees are doing it while working on the side, and what I'm interested in now is that intellectual production is fun.
There are people in the company who are intellectually producing and converting it into money outside the company. I wonder how we can do that. I have not yet reached that level 〓00:32:40 but there are many people who are doing various things such as running 〓00:32:43 〓salons and YouTubers, but what do you recommend for people to do now?
Nishio: No, no, no.
Audience: (laughs)
Nishio: There is no such thing as "if you do that," and you should not take those who say "don't do that" seriously! and don't take seriously those who tell you to do it. That is a typical 〓00:33:02 business of convenience? 〓Because it is. They tell you that they recommend you to do YouTube now and that you can live a comfortable and leisurely life just by doing this, and they take your money by telling you that you should come to their real salon and listen to what they have to say to do that. That is typical 〓00:00:33:17〓There is no good way to make money lying around, and when you want to do intellectual production and hope that it will lead to money in the future, it is a big project to try to do intellectual production and bring in money at the same time from the beginning. First of all, by doing intellectual production and moving it along, you gain the trust of various people and various 〓00:33:37 intellectual properties? I think it is better to think of it as accumulating 〓 and then converting it into money after the fact.
Male: Yes.
Nishio: I am slightly concerned that we are using too much time for questions, but I would like to move on as scheduled. I lost Mr. Tachikawa from Time Management. This is a blog post about our company where salaries, etc. are actually set online.

This is the second theme of the lecture, which is sort of the main theme. As some of you have already read the 〓00:34:08〓, I have just mentioned that the accumulation and retrieval of information through the Internet and groupware has enhanced human abilities, but only information that has been output is subject to software. Information that is only in the brain without output is not enhanced by software. My question is, if you had not written out the information before the class started, can you remember what you were thinking about output before the class started at this stage, when we talked about human enhancement through groupware and wrote it out? The discussion has filled up my mind and the discussion about output has drifted away. If you don't write it down, it will disappear. This is important. In fact, everyone has a sticky note that they wrote on, and later on during group work, they can say, "Before this class, I was thinking this way, but now I am thinking that way. If you don't write it down, it will disappear. If you don't write it down, it will disappear. Therefore, output is very important. Because if you don't write it down, it will disappear, and it will not be subject to the reinforcement that is in the software. When I talk about this, a common response is, "I don't know what to write. I don't know what to write. I don't know what to write. I don't know what to write. What do you mean by "I don't know what to write? If you say you don't know what to write, you are trying to output something good from the beginning. When I first asked you why you could only write nine pages, you said that you could not write because you had something you wanted to write about, but you were afraid that if you wrote about it, it might cause various problems. I am trying to write something good. When I write output, I am also concerned about other things besides output, and that is why the amount of output has decreased. You can't write something that is good, perfect, or great from the beginning. You have to write first, and it doesn't have to be a perfect story from the beginning. Write, even if it's just a word. You can write something that will not disappear, so you can look at it and see that it will not disappear, and then you can combine them and go on to bigger ideas. This is why I don't try to write good things from the beginning. Don't try to write something perfect from the beginning. I write down everything that might be useful, or a word that comes to mind, and make sure it doesn't disappear. What you write will not disappear. After the writing is done, it is combined after the fact and becomes bigger and bigger. Why are you smiling so much?
Tachikawa: When I called the restaurant for the reception afterwards, the moment they heard my voice, they said, "Oh! It's Tachikawa-san, isn't it?" And.
Audience: (laughs)
Nishio: I'm going to talk about something completely unrelated to the class. You can write down now if you find it interesting to do so. You can write down anything. Maybe this has something to do with intellectual production. If you think, "This might be related to intellectual production," write it down. It might be relevant. The reason is that this was a case of information being carried by the human voice.
Tachikawa: Well, I was very happy when I was told that it was Mr. Tachikawa, as a particularly important finding. So, if a store introduces such an algorithm, the moment they hear your tone of voice, it will be displayed as Ms. XX, and you can say, "Thank you, Ms. XX, for everything.
Nishio: I see. When a phone call comes in and you pick up the phone and say hello, voiceprint recognition runs and a list of candidates named "Mr. XX" appear and the confidence level is like 100%, 70%, 60%, and so on.
Tachikawa: Yes, yes, yes.
Nishio: So, if there is only one very high person, is it Tachikawa-san? Nishio: And if there is only one person who is very expensive, you can say, "Are you Tachikawa-san? Then the customer's loyalty will go up a lot, and the amount of money that can be plucked from Mr. Tachikawa at that bar will increase (laugh).
Tachikawa: It will increase.
Nishio: Sales could be improved.
Tachikawa: I think there is enough to go around.
Nishio: I think there is enough to go around.
Audience: (laughs)
Nishio: I digress, but it was a rather interesting story. I thought what if it was really unrelated when we talked about the bar, but it was surprisingly related.
Audience: (laughs)
Nishio: You never know what is useful until later. When I first heard about it, I thought it was irrelevant, so I didn't pick it up and said, "It's irrelevant. Good bye." If I had said, "Well, it's irrelevant," the story wouldn't have come up. So you can only know what is useful after the fact. This is my way of illustrating that you don't have to try to create something perfect from the beginning. First of all, you need to write down what is in your brain, even if it is only fragments. After the writing is done, it will gradually come together and become information. After that, other people will be able to see it. After the group work session, we are going to ask everyone to share these fragments with each other. When I say that output is good, the next common reaction is fear of output.
Woman: Oh.
Nishio: I think there are a few people here who think I'm not scary at all. There is one person here who is not scared at all.
Tachikawa: 〓00:39:32
Nishio: That's right. When I think about why some people are afraid of output, it is a matter of individual subjectivity, so I cannot say that you are afraid of output because you are afraid of it. The most common case is when people think that output is a written document that is read by an unspecified number of people, and they are afraid of what the unspecified number of people might say when they read it. Then, when an unspecified number of people read the text, they are afraid of what they might say, and they feel fearful of the uncertainty. Going back to the previous diagram, you think that the output is the whole. It is published and read by an unspecified number of people. Those who think that the output has to be put together into a proper text think that this is the end of the output. But this is the end of what I am recommending here, that you should do output, and you definitely should do it. Do this first. Do this first, because what you just put in your brain will disappear. This doesn't have to be public anymore, so you can put it on your personal note-taking app or something like that. If you put it in digital data, for example, it will be searchable. You can see what you wrote a year ago, remember what you were thinking a year ago, a year ago today, what day was it, December?
Female: 1 year ago...
Nishio: I wonder what I was thinking...yes. But if you have a habit of keeping a diary, for example, you keep a diary, so when you go home and look at your diary, you can see what you were thinking at that time. You don't necessarily have to make your diary public. You can write whatever you want. If you write in such a way and output your thoughts, you can look back on it later. It has the effect of being able to look back on it and see it later. Therefore, the important thing is not to think of output and publication as a single thing. You don't have to publish it. It is enough if only one person can read what you write. It is much more useful than writing nothing at all. But on the other hand, there are things that receive misguided criticism when you publish them. This is a specific example, but it was the first review I received after writing my book,
Audience: (laughs)
Nishio: I read the table of contents and half of it was known, so I didn't read much. The purpose was to know how to do output from input, but it says that the content that hits output is not written in chapters. I think I can read it at hand for those who can't read because of small letters at hand. Chapter 5 is a chapter that explains how to organize and communicate a large amount of knowledge that you have gained through input. It says that it introduces how to organize a lot of inputs into a form that can be output to others, and I thought, "This person hasn't even read the first part of the book. He says that he didn't read much because he knew about half of it from reading the table of contents, but if he had at least read the introduction, he would have known how to achieve the objective of output from inputs that you are looking for, but he didn't even read that. I am the first one to review this book.
Audience: (laughs)
Nishio: What do you want to do? What do you want to do though output early?
Audience: (laughs)
Nishio: If he received the book as a donation, he probably paid for it, but if he paid 2,500 yen or something, he probably bought it. It's like he didn't even read the first page. What did you buy the book for? I get comments like that. In fact, they do come. The more you output and the more that output is seen by many people, the more you realize that there is a percentage of people like that in the world. It is inevitable that such opinions exist. I often use the analogy that it is as inevitable as cicadas chirping in the summer. Even if you think the cicadas are noisy, it is difficult to stop them from singing. Cicadas are chirping in summer as a natural order of things. No matter how many cicadas are singing, no one has ever been killed by cicadas. Cicadas are just singing. I think that if we can think of it as such, we will be less afraid of cicadas. In fact, when we open our website to the public, there are people who are like cicadas, but on the other hand, we receive many times more useful opinions than that. As I do this, it gradually becomes more and more profitable for me to make it public. And as you receive positive opinions from various people, you realize that negative opinions are only a part of many opinions, and you are no longer afraid of them. Negative opinions. I am not so sure that I am not afraid of them at all. The feeling of fear gradually decreases.
For example, when I get this on the first review, I think, ehhhh, I didn't read it! But if the first 10 reviews are 9 positive ones and this one is a negative one, then you will have the ability to go through the reviews and see if this person is like that. So, by outputting and receiving positive feedback, you develop confidence in your own output. Oh, I just used the word "output" in a confusing way. It leads to confidence in your ability to make your work public. You will gradually become less afraid of showing your output to other people.
Going back to the topic of output, what will happen next if I continue to write down more and more of my thoughts, put them in writing, and accumulate them? If you write more and more. Then, when you look back on it a year later, you will have the opportunity to test yourself and wonder if what you thought about a year ago was worth it or not. You think that what you are thinking about now, what you are thinking about today, is very important, and a year later, you wonder why you were so worried about it. Or I conclude that it must be this way and this way, but after a year, I wonder why I was worried about it! Like that. Why did you think that? When you look back after a year, you are a little different person after a year. You share some background, but your perspective has changed! That's important, isn't it? I think it's important! I don't think so! I can repeat this dialogue with myself. The reason for this is that the output remains in your brain, so the person you were a year ago will remain there. In this way, I can talk to my past self, my self of one year ago, my self of three years ago, and my self of five years ago. When I repeat this process, I can talk to myself of the past, myself of one year ago, myself of three years ago, myself of five years ago, and so on, as the opposite side of the negative talk of not knowing what I was saying one year ago. I can see the values that will always be important to me. Then you will gradually realize that you value these things and that you do not value these things. It is important to know your values. It is very important to know your values and live your life in a way that makes you happy, so in order to know your values, it is very important to output what you are thinking now and look at it again a year later. As a concrete example, I have pulled out two embarrassing and rather crude examples from private memos I wrote in 2009. The market inventory of gold is several tons, which is less than half of Japan's current personal financial assets. I see. I see...so what's the point?
Audience: (laughs)
Nishio: I'm a little confused as to why I wrote this down nine years ago. I think I saw this at the time and thought, "Oh, I see," and made a note of it while reading some book. So what's the point? On the other hand, the claim that it is impossible to completely ________ written under it is meaningless. Because if you crown it with perfect, anything is impossible. Therefore, only the degree is the subject of discussion. For example, we often end up with arguments like this. If someone says, "I'm going to do ________, but isn't it impossible to do it perfectly? Nine years ago, I wrote this as something I could understand, and now when I reread it, I think, "Yes, that's right. This is important. It is futile to seek perfection from the very beginning. It is impossible. I mean, what is "perfect" in the first place? How far can you go in order to call it perfect? For example, let's say you want to write a perfect sentence and output it, but the time for completion will never come. If you say, "Let's write a book," and you say, "Let's write this book," and you decide to take the time to perfect the content of this book, it will not be completed even if it takes five or ten years. If you set a schedule of writing a chapter a month, and then you write the book while heaving and groaning, and actually extend it just once, you will have reached the point where you say, "Okay, I've finished writing it. So that's important, but I can't do it perfectly.
Man: I think the above is very interesting.
Nishio: Up, if you think it's interesting, you can write this down and go home.
Audience: (laughs)
Nishio: Because when I look back on it after a year and wonder why I wrote this down, I think, yes, this is important.
Male: 〓00:49:30 〓
Nishio: You can write that line now.
Audience: (laughs)
Nishio: Immediately what you think is important. It is a fact that at least now I think this is important. It is no use thinking now about what I will think one year from now. You don't know until a year from now. But now I think it is important. I don't know why he thought it was important. I don't know why he thinks it's important, because it's in his mind. But there is a great possibility that it can lead to something beneficial, so this is something that should be cherished. It is something that should not be thrown away.
Now, we were talking about the test of time, weren't we? Mr. Tachikawa, are you on time?
Tachikawa: It was very good.
Nishio: It looks really good. That's great! Now for a further specific example of the test of time. I'll tell you the naked truth, the first book I wrote was out of stock in about a year or two. This is a book I wrote in 2008, and it's about a programming language called Gython. I wrote a book in 2008 about a programming language called Gython, which is a processing system for a programming language called Gython. Good luck. I had to rewrite the source code because the new version of the language was released while I was writing the book, and I had a lot of trouble writing the book. I am ashamed to say that I still have the book. I feel that I should not use it as a reference because of its old content. It's hard for me to do that after all the hard work I put into the output. After writing this book, I wondered if I would ever write a technical book again! I thought I would never write a technical book again after writing this book.
-Three years later is the time when I forgot about it again after that, and after a few years in the test of time, my thinking changed and I decided to try writing again. But I still felt strongly that I should not write a book that would soon become obsolete, so I decided to write about something that would not become obsolete so easily this time. So I started to write about the history of programming languages and the ideas that led them to have the functions that they do. I wrote a book that focused on why the programming language was created. Five years later, in 2018, I still get a few tweets a month from people asking me to do an interview about this book or saying, "I'm doing an ego search on Twitter, and if you want to know about XXX, this is the book for you. I'm not sure how many there are, but that's about it. That is my impression. There are a lot of books out there explaining difficult-to-understand concepts, but this is the only book I can find that really addresses them! I am glad that I worked so hard to write this book, and that it was worth the effort. I thought, "I'll never write a technical book again because I had a hard time after writing this one! I thought. Forget the hard work. I usually forget about it after about five years. But I am writing again. This book is about software, but the reason why programming languages were invented for creating software was to make it easier for people to write programs by using programming languages than it would have been without them. In other words, it was to improve intellectual productivity. I began to think about how this story could be generalized to intellectual production, and I thought, "This is interesting. I kept a log of all the information on how I wrote this book, so I could write about that as well. This book is about the fact that I was able to write a book that lasted for five years, focusing on the underlying factors that made it possible to write this book. I personally aim to write a book that will be useful for 50 years, and I don't expect it to last 50 years without any modifications, so my challenge for the future is how to maintain the book so that it will last 50 years. This is 50 years from now, so I don't know how things will turn out yet, but I am working hard toward that goal. Specifically, I have been discussing with publishers about publishing all of my writings on the Internet, which they don't want to do.
I know I have mentioned this several times in passing, but I would like to summarize it once more here.
When you output, it accumulates. Because it does not disappear. Unlike files that exist only in the brain, output does not disappear, it accumulates. It accumulates. You can look back at what you have accumulated over time. When you look back, you will see that your past self is a little different from your present self. You have a different perspective, a different experience, and so on. So, the development of thoughts, such as "This is how I thought in the past," and "This is what I think in addition to that," will occur as a result of the accumulation of information. If I had not written them down, the information would have disappeared, and I would not even be aware that I was thinking exactly the same thing five years ago as I am now. If you write down your thoughts from the past and then read them back six months later and nothing has changed, that means you have not learned anything in those six months. Because learning means that your thoughts are changing.

So it's time for the next output session. You don't have to look at the sticky notes from the first session, and you don't have to think that you have to write something different from the first sticky note. But if you suddenly try again to write 10 notes about output in 3 minutes, will you get different contents or the same contents? If only the exact same content comes out, then you wonder what you were listening to in this class. (laugh).
Audience: (laughs)
Nishio: That was the foreshadowing. So, as soon as possible, do you have a sticky note and a pen at hand? I hope that's OK. Let's start the writing time. Yes, let's start. Let's start. Here you go.
One minute remaining.
Yes. Time is up. You can finish what you are writing now.
Who hasn't written 10 pages? This is your first time participating, right? Was this your second time?
Female: 〓00:59:01 〓
Nishio: So you weren't there in the beginning. Then remove them from the count. Is everyone else at least 10 cards? Then you have finally achieved it. Those who have been working on the goal of writing more than 10 sheets in 3 minutes from the beginning are practicing for the third time. In other words, three 3-minute practice sessions totaled 9 minutes. In other words, in less than 10 minutes of practice time in total, you have acquired the skill of writing more than 10 pages in 3 minutes. I can do it. Then, more than 18 sheets. 1, 2. how many sheets?
Female: 18.
Nishio: 18.
Male: 19.
Nishio: 19. then who has more than 13 cards? 1,2,3,4,5. then 13. not so much here. But it's a good thing that we all achieved it. If you have 〓01:00:00〓, please practice at home.
Audience: (laughs)
Nishio: If everyone was able to do it after practicing only three times, you should be able to do it if you do it too. Yes, that's right. Now, which do you think is better, to include or not to include Mr. Tachikawa's question?
Tachikawa: Could you repeat that one more time?
Nishio: Do you think it is better to include or exclude one-minute thinking time and question time?
Tachikawa: If you could proceed without including it for a moment.

Nishio: Okay, so let's do that. I would like to talk about this third theme, career strategy, which is lecture theme 3. You just talked about accumulating what you have written. This is the horizontal axis, time. This is now. This is five years from now. If you don't accumulate, your career is flat like this. Those who accumulate go up. When I discussed this lesson with Mr. Tachikawa, he told me that this was not the case. I told him that the important thing is to accelerate the process. Even if you think you are accumulating, if the speed of accumulation does not increase, there is an overwhelming difference between the red person and the black person whose accumulation speed gradually increases. This one is wider. This one is wider than this one. More than here. So we have to think about how to accelerate. Acceleration means improving efficiency. I think you have understood the efficiency of accumulating things by writing them down, but let's keep them in our brains and remember them. It is much more efficient to write things down and output them to paper than to try to remember them only in the brain. If you do this electronically, the problem of quantity and so on disappears, so it is even more efficient. The efficiency of remembering can be improved by reading what you have written in the past from time to time, or by making it electronic and searching for it. There are many ways to improve the efficiency of output, or the efficiency of writing things down, but one way is to use the same place that you are experiencing right now. One way is to use this opportunity that you have just experienced. This kind of place that encourages output is beneficial in accelerating the amount of output. The reason for this is that we tend to imagine that we can only output from within ourselves without any stimulation, and we tend to think that output is something that comes from within us and is brought out from outside. In this case, we are forcing the students to write 10 pages in 3 minutes on this very topic. Since you are here in this class, even if it is a limiter, you are forced to do it because you cannot escape from the situation. When I was pulled out, I wrote 20 sticky notes in a maximum of three minutes, which means I wrote one sticky note every nine seconds. So, you can now do that kind of thing quickly and easily. After the session, there will be a group work session. This is also a place where you can accelerate your output by being stimulated by the other participants' viewpoints and other things that bring out what is inside of you.
Mr. Tachikawa asked me to talk about parallel work, and the reason why he wanted me to talk about parallel work is that other lecturers have talked a lot about parallel work itself. But I was told that you are the only one here who is a company employee. So let's talk about it. Let's talk about why you are doing parallel work even though you are a company employee. This is actually an article that was posted on the company blog, Cybozu Style, when I started my own parallel work, when I started working as a technical advisor for B-Ploud. The title is usually curious. Why I started a machine learning technical advisory service instead of quitting Cybozu Labs, where I was doing double work even if I received zero remuneration. It's a story about how he had no reason to quit because his goal is to work in parallel. The title aside, the point I want you to pay attention to is not so much that, but why I did the double/parallel work. The point is to increase the speed at which I learn. I was asked a question in the interview and I answered that it is because I think it is important to increase the speed of my learning. This is also drawing out It is also drawing out what is inside me. I realized that increasing my learning speed is an important value for me, and through this dialogue, I realized again and again how important it is for me to speed up the cycle of absorption and output. I have seen these slides many times, and every time I introduce them, I have to look at them again and again, repeating the same thing over and over again.
If you belong to only one organization, information within that organization is usually biased. When you belong to only one organization, the information within that organization is usually biased. I think that when I go to other companies, I find that I have to do a lot more of it. When you go to other companies, you will experience more of the same. In this way, there is no opportunity to output your own ideas, and there is no place to practice outputting useful information. However, when you go to a different company for parallel work, for example, the experiences you have had in the company are different from those in the other company. There is a gap. Then, you might say, "Oh, that's the way they do things. That's the way we did it at my company." The moment you say, "Oh, that's the way we did it at my company," you are generating output. Information that had not been verbalized in your mind is verbalized and communicated. On the other hand, you see and hear many things at the company. You don't have to join a company. For example, you can be involved in NPOs, club activities, and so on, and then come back to the company and say, "I have experienced this at that company, and they use this kind of tool, and I think we should use it at our company, too. This is the kind of thing that happens. By belonging to these two different places, you have a chance to absorb information and spit it out, absorb it and spit it out. A place for output is created. You have a chance to output. This is what I drew in the diagram. Let's say the level of knowledge in Company A is like this and the level of knowledge in Company B is like this, and you yourself don't have much knowledge yet. In order to give knowledge to others and make them happy, you need to have knowledge that those around you do not have. So then, for the people in Company A, this part of the knowledge is beneficial to Company A. So we give this part to company A. Then they see and hear a lot of things in Company A and get this part. Company B does the opposite. As this process is repeated, the size of this part gradually increases and two parts are created. Company B has a lot of knowledge that Company A does not have 〓01:07:43〓、 while Company B has a lot of information that I have experienced in Company A. We can both create value by providing each other with information and knowledge that we do not have in our respective organizations. I think this is very important. I think knowledge is becoming more and more important. Knowing or not knowing the existence of a small tool can drastically change the efficiency of the way you work. But people who have been working in the same company with the same tools for a long time don't have the opportunity to know that there are more useful tools out there. So, what kind of chance do they have to find out about these tools? I'm just saying that LINE is just a concrete example, so whether it is really appropriate or not is on a case-by-case basis. So it creates an opportunity to come up with something like that. Human organizations are found in many places, not only in companies. This means that the tools, know-how, and knowledge to efficiently run a human organization can be found in many places. However, each organization knows only one way of doing things, so by exchanging that knowledge, we can increase the intellectual productivity of ourselves and those around us. This is very important, so I would like to encourage people to do parallel work. This raises the question of what is the first step in parallel work. This is the small start principle. If you don't know where to start when you begin, you are thinking too big. It is the same as stopping to think about publishing your output when you are writing. Start small with regard to parallel work. If you start small, the first thing to think about is getting paid in money from the beginning. As a task. It is too big a goal. Next, in many cases, people make the assumption that it is an employment contract. An employment contract. Have any of you ever had a contract other than an employment contract? Yes, these are the only two hands I can think of. For example, you have bought stationery, PCs, and so on. You have signed a contract of sale when you bought them. You were the one paying for it. You were the one who paid for it, so you are not aware of it at all, but you gave something to someone who received money from you. This is someone who used the sales contract as a way to obtain the consideration for receiving money. You were a party to it. I don't know why the timer started beeping. Maybe I touched it without permission. There are ways to earn money other than employment in various contracts, but I can't seem to think of any other way to earn money. For example, selling things at flea markets or making fanzines and selling them at fanzine auctions are all ways of earning money through sales contracts. So when we talk about parallel work, writing and selling dojinshis or making handicrafts and selling them on Mercari is also parallel work. But there are things you can learn from the experience of actually making and selling something. Especially for those whose company's job is not sales, I think there is a lot to be learned from the experience of making and selling products. One interesting point is that childcare is a parallel job. Although you do not receive monetary compensation, you are under a lot of pressure to keep a living thing safe that could die if you take your eyes off it, and you have to be available 24 hours a day. It's a very heavy job, and you can summarize that it's a physically demanding job, too. If no one does that job anymore, there will be no one left for the next generation, and the human race will perish. It's very much for the benefit of that kind of humanity, very much in the public interest.
WOMAN: I never thought that far (laughs).
Nishio: Yes. They are doing a very important job. The problem is that there are a lot of old men out there who don't think they are doing important work. It's hard to see this on the screen. I wonder if it is readable on paper. It's a story about the president of our company who took a 〓01:12:39〓 parental leave for parallel work 〓01:12:39〓 on Twitter.
Tachikawa: Did you take it in a groove?
Nishio: I took it in a groove. He said he took it in a groove. The mayor of Bunkyo Ward, who took the childcare leave, said, "Why don't you take the childcare leave too? First of all, I replied on Twitter to what such a person said on Twitter, and he said, "You should definitely take it. I thought it might be good for publicity, so I decided to give it a try," he writes. He answered in such a frank manner to the interviewer, "It might be good for advertising the company. I thought it would be good publicity for the company, and I thought it would be fun," he wrote. This is exactly what he wrote. This was the beginning of his challenge to take childcare leave and do parallel work. Our president. This president is parallel work. It's only two weeks. From the point of view of a mother who is raising a child full-time, I think it's only two weeks, but after taking childcare leave for those two weeks, I thought this is a terrible idea. This is very hard work for them, and in a society where people don't do this work and don't raise their children, the market will shrink because children will not be raised and the market will shrink. I have changed my way of thinking that a businessman has to be able to do this. This change in thinking is evidence of a learning experience. By experiencing the parallel work of raising a child, he was able to find work outside of the company and learn valuable lessons from it. After this, the president decided that he needed to change the personnel system to make it easier for everyone to live, so he changed various things to make it easier for everyone to work. (laugh) It's bad to say that the HR system is a mess, but it's a 100 different people, 100 different ways of working. I cannot see what will happen in the future, but we are seriously working on a personnel system that is 100 different ways for 100 people, not just a story. For example, I am a Carp fan, so when there is a Carp game, I go home early. I don't wonder why such a thing is OK. The top management has decided that a manager who does not accept such flexible working style is no good in response to a request from a subordinate who wants such flexible working style. Then there is the common middle management comment, "Why do you take vacations? Everyone is busy. It is not good if the manager is reprimanded. The manager is being reprimanded. I don't know what will happen, but I think it is interesting, and I am watching it with great interest to see what will happen in the future. It is one of the things I am observing. Please keep off the record what other employees who are flippantly talking here say about the president being interesting. But maybe the president won't be offended. He said it was interesting.

Yes. A concrete example. Since Mr. Tachikawa asked me to give you a concrete example, let me tell you about my own concrete example. 2007 is when I joined Cybozu Labs, so I am not yet a principal researcher. I have been working at Cybozu Lab since 2007, started serving as a board member of a general incorporated association called "Mittoku" in 2015, started serving as a technical advisor in 2005, and started serving as a specified associate professor at Tokyo Institute of Technology in April of this year, Just a few months ago, in the summer, I started working on a loan deal. A loan deal is a temporary transfer from a large corporation to a venture company. In other words, this is parallel work. We are a company that does business by intermediating this type of work. For example, there is a famous company called "M" and there is a not-so-famous venture company called "N", and if a person from this company moves to this company to work for a while, Loan Deal will act as an intermediary and meet with the person. I think there are many psychological gaps when people go to a different place, and they may feel confused, lost, or troubled. If the only people around them are from the new location, they may not know who they can talk to about their problems. So, we have a mentor who is in a position to keep them mentally safe, and LoanDeal is doing business to support them. So there are companies that promote parallel work. I just remembered what I was going to write in this specific example.
I was talking about getting paid in money, but I got a little confused because I was talking about getting paid in money, and then I said that childcare is not paid in money but is parallel work. As a concrete example of this, Cybozu, the company at the top of the list, is, of course, employed by the company and receives a salary.
The directors of the unincorporated association were not paid. This is what I refused to accept although there was a director's fee but I did not receive it.
The third, B-Ploud's technical advisor, is paid under an outsourcing contract.
Which one is the Tokyo Institute of Technology's Visiting Associate Professor? I am a Visiting Associate Professor, which means that I do not need to be paid.
This loan deal mentor is a situation where we are paid because this is a normal company. The feeling is that they are not paid by surprise. But if there is something other than money to be gained by doing so, then it is okay to do so. Yes, let's talk about that.
The reason why I accepted the position of director of the General Incorporated Association "Unexplored" without pay is that I graduated from the MOT course of the University of Tokyo about a year or two ago, just before this graduation. I spent two years, actually three and a half years because I stayed in school, studying business administration, and graduated, but when I returned to my company, I was not in a position to be involved in management, so I had no place to use the knowledge I had learned. If I continue to do the same job as before with no place to use the knowledge I have learned, I will soon forget what I have learned and it will disappear, and I will not know why I paid so much money to attend the university and learn. You will lose what you have invested in. I was worried that this would be a waste. I was thinking about starting a business, but I felt that it was not right to start a business just because I wanted to start a business, and I did not have any business ideas that would make me want to start a business. I was wondering if anyone would be interested in taking on the job. The kind of corporation I had in mind was a company that did business as a joint-stock corporation, but I thought this would be the same in the sense that the management of the corporate entity would be the same. I thought it was like management in the sense that a corporation has assets and must make various expenditures and receive money from somewhere in order to continue its existence, so I said, "Yes, that sounds good. After that, I bought and read Drucker's book, Management of Profit-Making Organizations, and did other things like that.
It's like if I feel that there is a chance to gain something other than monetary compensation, such as gaining my knowledge or experience, I do it even for free. Another story goes to the fact that we tend to assume an employment contract. There is an atmosphere in the world in which it is natural to get a job at a company after graduating from college. There is an atmosphere in which people think that they will get paid when they get a job. If that is the only experience you have had, you may have the misconception that it is the only way to get paid. I had two people raise their hands who had experienced other ways of getting paid, but that's about all there is. That's all there is to it. So it is easy to misunderstand that getting paid is the same as employment, but employment contracts are very cumbersome. I understand this because I am on the side that makes the employment contract, but I have to pay for insurance and so on. There are many troublesome things such as social insurance. Therefore, the employment contract is actually troublesome for the party who accepts the job. I don't want to do it as much as possible. It may be a bit of a misnomer to say that I don't want to do it as much as possible, but it is a heavy task. When you want to try parallel work, I think it is easier to take the first small step without an employment contract. If the other party's company asks you to conclude an employment contract, you may say, "Oh, you are going to conclude an employment contract? Then we need to consult with a company labor consultant.
So what other contracts are there besides the employment contract? I think it would be good to know the three in terms of getting money.
One very common is the quasi-consignment contract. For example, a client promises to attend a one-hour meeting four times a month for a fee of 50,000 yen. This is a quasi-mission contract. This is a contract in which you promise to do something and receive compensation. An employment contract is not like that. Every day you go to a specific place 〓01:22:07, and you are told by the 〓01:22:07業長? A quasi-commissioned contract is more light-hearted: "You can do XXX for me, so how much do you want me to pay you? A quasi-commissioned contract is more lighthearted, like, "You can do ________ for me, so how much do you want me to pay you?
Another type of contract is a sales contract. For example, if you make a coterie magazine and write a book about a technical subject that you want to write about, you can make a booklet and sell it at a coterie magazine sale, or if you make a handicraft and sell it on Mercari, that is a sales contract. Making software and selling it is also a sales contract. There is also a license agreement, but that is a detailed story, so I think the easiest first step is either one of these two.
I'm sure many of you have heard of the term "outsourced contracting" as a trap that can easily trip you up. Have you ever heard of the term "contractor agreement"?
Most people have heard of the term "outsourced contracting," so they tend to think that they have to sign an outsourced contracting agreement when they do something, but in a outsourced contracting agreement, the responsibility for completing the work promised in the contract falls on you. This is very inconvenient for parallel work. If something unexpected happens and the workload increases dramatically, you have your day job, but you are also responsible for the completion of the work under the contract. If you get paid, you are happy. A light relationship, like if it's hard to get paid, you don't have to get paid anymore, so it's better not to incur responsibility. There are things that gradually become clear as you start with a light relationship and do it. For example, you will come to understand the various ties and problems within the company you are working with, or the good points and bad points. You will also learn about your own work style. You will gradually understand how to make things easier for yourself and what kind of things you will have a hard time doing. Then, you will be able to prepare for a larger contract without worry. As a small start, I think it is very good to start with a small contract.
You asked me to give lots of specific examples. I did mention that I wasn't getting paid. director of General Incorporated Association Unexplored in 2015. B-Ploud This is an outsourcing contract. Is it okay if I tell you? It's okay to say it. The only thing you promised to do is to consult with us on chat. As for being physically restrained, the contract is for no physical restraints, and if you are restrained, there is an additional fee of an hourly fee. Occasionally, I am asked to attend a meeting, and I arrange the schedule so that I can go with the company to the customer's site and consult with them. It is not an employment contract because that is what the contract is for.
Tokyo Institute of TechnologyI mentioned that although this appears to be an employment contract, we are not actually paid for it.
The loan deal mentor is also an outsourcing contract. What kind of contract this has is that a report comes up once a week. The mentor will write a comment on the report and return it to the mentor. The mentor is required to write comments on the report and return it to the client, and to meet with the client once a month for a video conference or face to face interview and write a report on the meeting. The contract is based on how much they pay me. So it's very light. You might think, "Wow, someone like a monster doing amazing parallel work has just arrived," but I didn't do much. But I have learned a lot from it, and I am able to talk about it here today as part of what I have learned. As a concrete example. I am able to talk about how I am doing this.
The security camp instructors are commissioned by the IPA, a national organization, to participate in the camp for six days and five nights and give several hours of technical talks to the participants, who are junior high and high school students.
Would you be willing to write a manuscript for the magazine, for example, at a price of one page? Yes, that's fine. and then you write the manuscript, send it out, and get paid. Writing a book is the most special kind of contract, in which a percentage of the sale price is paid as royalties. We do a lot of different things like that.
There are a lot of things that generate income, but you may feel that you can do them while working as an office worker, don't you? Even if it is not possible to do so many things at once, trying to do one of them, especially those with limited time, or those that are done several times a week, does not seem to be so much work 〓01:26:48〓? 〓It's going to be less. It seems like it would be easier to do because there is no danger of the workload becoming very large. On the other hand, if you don't organize the writing of this book in terms of how much time it takes, it takes an enormous amount of time and doesn't make that much money financially, so I don't 〓01:27:08〓, I think every time I write it, but after about five years, I write it again. I don't know why. (laugh)
So we were talking about the importance of starting small.
Is there a time delay?
Tachikawa: No, it's fine.
Nishio: That's okay. I have just talked a lot, but I would like to summarize by saying that activities that do not aim for monetary compensation. If you are feeling anxious or fearful because of the large scale of the project, you should start with something smaller. If you are feeling anxious or fearful, you can start with something smaller, something that doesn't require monetary compensation. If you help by saying, "I'm just a little help, so I'll leave if I'm busy with my day job," and you feel psychologically uncomfortable with the person you go to, for example, you can say, "I'm sorry, I'm busy with work. I'm sorry, I got busy with my day job." And then you can go back to the place you went to. It's not rough. I don't have to do that at work. I didn't pay them, and they were just helping me out of the goodness of their hearts.
For example, in the case of the board member of the General Incorporated Association "Unexplored," if I thought it was a bad idea, I would have said, "I tried it for a year, but I'm too busy with work," and quit. But it was surprisingly not that hard, so I am continuing to serve.
Secondly, it is rather important to have small responsibilities. Because they can be heavy. I also like fixed-term projects that are separated by a period of time. For example, going to a security camp for 5 nights and 6 days to be an instructor means that you are physically restrained for the 5 nights and 6 days, but when it is over, you are sure that you will have nothing. When I did this project, the company gave me the OK to do it on company time, but I knew that if I took 6 days paid time off, for example, I would be able to do it for sure. Such projects with limited deadlines are easier to work on because you don't have to think of an excuse to quit if things don't go well with the other party when things aren't going well. I'll be sending out information again regarding my experience doing these things. As I output and publish, the next story will come again. The story gradually expands. As the snowball rolls, it gets bigger and bigger. I try to start small. It is easier to talk about parallel work if you start out small and say, "I am a person who does parallel work. I think that kind of strategy will make it easier to do parallel work. I have talked a lot about the small start principle using parallel work as a topic, but I believe that the small start principle is a useful principle not only for parallel work but also for many other things. That is why I use the term "principles.
I think this output of yours was the same. It was the principle of starting small. Don't try to do something big from the beginning. If you think you are going to write a perfect article and publish it on your blog from the beginning, the psychological hurdle will be high, and you will end up with a blog that you post only once a month, and you will start to lose motivation because not many people will visit a blog that is posted only once a month and you will feel like you are not seen much. I feel like I'm not being seen, so I start to lose my motivation. I'm sorry. I don't mean to blame the individual at all. This is a common pattern, isn't it?
WOMAN: It happens a lot.
Nishio: A really common pattern.
WOMAN: The truth is that it will be done within a year.
Nishio: That's right. Twitter is very popular now, isn't it? There are many times more users than bloggers. The reason is that everyone starts small because they can only write in 140 characters, and it is impossible to write a long and coherent sentence in those small 140 characters on Twitter. So, because we are given the excuse that we don't have to aim for big things from the beginning, we can all start small, and that's why there are so many people who send out messages on Twitter. As you start small and output your work on Twitter, it will gradually accumulate and become bigger and bigger. The larger things become even larger when they are combined after the fact. The things that have accumulated become parts, and this and that will be attached to each other. For example, Cybozu and Lawn Deal are promoting parallel work, and Lawn Deal is also promoting parallel work. I was like, "This is good. The mentors at Loan Deal are not working for the company, but for Loan Deal, and they usually announce at company meetings that something like this has happened at Loan Deal. I usually announce this kind of thing at company meetings, because it is beneficial within Cybozu. I get paid while doing parallel work at Loan Deal, and by sharing the information I get at the meetings at Cybozu, I feel like I am working (laughs).
Audience: (laughs)
Nishio: We are doing our job. We are doing work that is very beneficial to the company, which is taking knowledge from outside. During this time, I had the experience of attending Tokyo Institute of Technology as 〓01:31:56current working university exercise? That experience led me to Cybozu Lab and Unexplored, and my experience there led me to a specific associate professor at Tokyo Institute of Technology. It is like a snowball rolling down a hill and getting bigger and bigger as it rolls along. In the same way, I believe that if you aim to accumulate outputs and career opportunities based on the principle of starting small, the accumulated outputs will gradually grow larger and larger as they are connected later.
I am living now with such a strategy, and I have come to this kind of place to talk about this kind of thing. The reason I connected with Mr. Tachikawa is because we both graduated from the MOT program at Tokyo Institute of Technology. Mr. Tachikawa asked me to talk at 〓01:32:41キューモット? Mr. Tachikawa asked me if I would like to talk with him at 〓 and I said, "Yes, that would be great. and I accepted. Mr. Tachikawa said, "There is a guy doing parallel work that is just right for you. (laughs)
Tachikawa: Looks like I used it for convenience (laughs).
Nishio: I hear that you're conveniently doing parallel work and that if we let you speak, you'll be able to speak about something interesting without trying too hard on the subject matter. We have a good candidate, and now we have a lecturer.
Tachikawa: It is hard to comment.
Nishio: (laughs) So people shut up when they get the picture.
Yes, I am. Now it's time for the final output. Career strategy. Especially about your own future. This is not something that is very personal. It is about you. Your life will continue for many years to come. Please write at least 10 words in 3 minutes or whatever else comes to your mind. The moment it becomes about you, it may become more difficult. Don't worry about that, just do your best and write 10 or more words in 3 minutes. Let's get started.

Mr. Tachikawa, what is it like in terms of time?
Tachikawa: 〓01:34:13〓 and after this we have group work 〓01:34:15〓
Nishio: It says the group work is scheduled to start at 8:20 p.m. It's about 25 minutes past.
Tachikawa: 〓01:35:00〓

Nishio: You have one minute remaining. Yes, we are finished. You may finish what you are writing. Let's get on with the counting. No one seems to be. Then, who has written more than 20 sheets, more than 15 sheets, or more than 15 sheets? How many?
Female: 17.
Nishio: 17.
Female: 16.
Nishio: 16. What has decreased a little is the 〓01:37:20〓The moment when it became about me, it became difficult...I did not ask each person individually how many sheets he/she wrote, but I think everyone knows for themselves. Then you may find that you were not able to write as much on this theme, or that you were able to write a lot on this theme. You can look back on this later. Let's talk about the original schedule first, which is supposed to end at 9:00 a.m., so we only have 14 minutes left. The original plan was to have 5 minutes after this to look at the stickies of the other people in the group, because I think they are interested in various things. After that, I would ask the person next to me questions about the stickies that interest him or her the most, and have that person give me his or her output. Everyone will have one experience of asking a question and having their output drawn out by that question. I intended for them to experience asking questions to others and also to experience being asked a question and answering it. You wrote 20:25 at this time.
Audience: (laughs)
Nishio: As soon as the round of questions was over, we were planning to have free discussion until 20:40, and then we were going to have the group representatives present what they wanted to share with the whole group in a plenary group work.
Male: It's okay because the parallel work was interesting.
Nishio: What are you talking about?
Male: I found the parallel work very interesting. A little more 〓01:38:49〓
Nishio: I see. I see. Let's go to the end for now, shall we? This class ended with a group work session, but after the class was over, it often happens that after a few days have passed, people start to think about what they did at that time. This is a very important thing, because the ideas that have matured in your mind over time and suddenly come to you have been in your subconscious mind for a long time. It is very important to write down the thoughts that come to you so that they don't disappear. You are free to publish what you wrote, share it with other people, or send it to me. After making this slide, I asked Mr. Tachikawa if there was a post-work session, and he said that if there was a post-work session, I would have to 〓01:39:40 to 〓01:39:40 to 〓01:40. If there is such a thing, we must 〓01:39:40 or so. If there is, I would be happy to do it, and I would like to work on building up everyone's workload a little bit. Take at least 10 minutes today or tomorrow to write what you want to tell yourself six months from now. Schedule 30 minutes to read it back to yourself six months from now, somewhere in June of next year. This does not mean that you have to read it somewhere in June next year, but I am asking you to schedule a time to read it from what time to what time on what day in June in your schedule book today and tomorrow.
I thought this wasn't in the ones they were handing out?
Tachikawa: This is not in the syllabus.
Nishio: I'm not in it. So, take a picture or something. Or make a note of it.
Tachikawa: By the way, there is also Dr. Nishio's e-mail address in the syllabus, so it is safe for you to e-mail him.
Nishio: Now, what should we do with the remaining 10 minutes? So, I asked everyone to stand up and look at the stickies. If there is someone who has written something on a sticky note, let's catch them and ask them questions. Let's do it in parallel. We'll give up the whole sharing time.

01:41:11 - 01:50:55 Time to go through the stickies of other groups.

Nishio: Now, I think everyone is running out of things to talk about, so I would like to ask everyone to return to their seats and share what they felt by looking at the stickies written by others in the next 10 minutes. I would like to hear from anyone who would like to share what they felt when they saw what the person next to them wrote on their sticky notes. Okay, let's start with you, Mr. Nakayama.
Nakayama: What I was writing about 〓01:51:28〓, which is basically a technique or a structure, is basically an inner thing. I was writing about how I am strong on the inside 〓01:51:37〓
Nishio: I see. So it was an opportunity for you to notice perspectives that you did not have. Now, please give me someone else.
Male: A writing person. I thought it would be interesting to be sentence bound.
Nishio: Yes, that's right.
Male: I found the one who wrote in writing very interesting.
Nishio: Yes, that's right.
Man: I wrote it with keywords.
Nishio: I actually wasn't sure whether to include that story first. I was wondering whether to write it in words or in short sentences. I thought that if I tried to write it in long sentences, it would be too long, but I thought that if I started explaining too much, the output would be less exciting. I decided to have them do it first. I found that some of the participants ended up using only words. On the other hand, what is very interesting is that when the information is expressed in writing, it becomes more three-dimensional, or richer in meaning. When you look at various stickies, there are stickies that you don't understand when you see someone else's sticky, and there are stickies that you think are interesting. One year after I wrote the sticky, I will also think that it is an incomprehensible sticky or an interesting sticky. Stickies that I feel are interesting now. I think it is better to write such stickies. Anyone else who would like to share their thoughts?
Yes, please! Please.
Female: I am probably the one who usually outputs and even publishes her work, but the number of sheets did not change from the beginning to the end because I was accustomed to it. I was able to consistently produce the content, context, and sentences, so I thought it was important to do this on a regular basis.
Nishio: But we have to think about how to accelerate further than what we are doing now.
WOMAN: It's still more writing to accelerate. I want to get reactions. I actually published a diary that I had kept private, thinking that it would be good if it was this person, and that way I would gain confidence. Then, a few years later, I published it all, although it was child-rearing material. I received a tremendous response, and I felt that expanding my work in this way accelerated the process for me. I felt that spreading it out like that accelerated the process for me. I felt that I had risen in this way.
Nishio: Now that is an interesting story, first you wrote it privately. Then you opened it to a small group of people, and then you opened it to the general public to start small.
WOMAN: Yes, that's right.
Nishio: I think it is important to start small and gradually increase the size in order to clear the psychological hurdle to go public at first. I think the psychological safety is relatively high now that the meeting is closed to 12 people, but I am sure that what I have learned here will be universally beneficial. Or it can be someone you volunteer with, but it might be a good small start to experiment with what might happen when you tell those people. As a way of outputting. By outputting to people, that output 〓01:55:27〓
Yes, sir. Now, who would like to share at this desk? Anyone willing to share? Yes, I do.
Man: It's just my impression. The tendency of each sticky is amazing. 〓01:55:44〓这! Like that. I thought it was interesting. I've been thinking a lot about how I want to do a lot of double jobs 〓01:56:00〓
Nishio: I was talking about how interesting it is to see how different each of you are when you look at the various ways to remove the sticky notes. What I am wondering if I should have driven a little more is that everyone has a lot of text. They weren't drawing.
Venue: Ah~.
WOMAN: Sure. I'll do it at home.
Nishio: Even though there are a lot of arrows there. At home (laughs).
Audience: (laughs)
Nishio: The use of arrows. When something happens, he writes an upward arrow. For example, I drew a picture of two mountains. For example, I used to draw pictures of two mountains, and if I had to explain them without the pictures and with only text, the message would be different. Therefore, it is better to output in a way that is easy to output, and there is no need to stick to writing at that time. For example, you can use pictures or gestures when speaking to others. Now that the scheduled time has passed, I would like to end this session. Thank you very much for your attention.
Tachikawa: Thank you very much. Now, as I mentioned earlier, I think it would be a good idea for everyone to take a picture or something of this so that you can look back on it yourself.
Nishio: Of course, you can take the stickies you wrote with you home with you, or you can take a picture of a sticky written by someone else and take it home if that person is OK with that. I am sure there will be perspectives that I didn't have or that I will be able to appreciate.
Tachikawa: If you are attending the reception afterwards, what did those sticky notes mean? TACHIKAWA: Well, I was thinking that it would be good if we could talk about what those sticky notes meant. If you are going to the reception at 9:15 a.m., please meet me in the lobby on the first floor.
Tachikawa: And 〓01:58:54〓 or if anyone wants to borrow it.
Nishio: That's right! There was a sticky note that I wrote on. By the way, I wrote here that it was very hard for me to keep quiet during the three-minute writing time because if I spoke, everyone would hear it and I could not write it down. It is honestly hard not to be able to talk. Yes, I wrote that I would write a sticky note, too.
