One Night Werewolf Transcript 2-7 Discussion
[BMOT One Night Werewolf 2nd]
[https://gyazo.com/da53d97207dd8c17654854eb62415573]


Tachikawa: We are moving at a pretty good pace right now. More than I expected. Let's take a look back at what we have done so far and see what you think.
Nishio: Yes, that's right. Especially for the first time.
Male Y: At first, I still didn't get the gist of it.
Tachikawa: I was getting really good at the end.
Male Y: I didn't know how to bluff, so I tried to find out what would happen if a werewolf revealed himself as a werewolf, and I learned that, according to the theory, he would be revealed as a werewolf. What was interesting was that I felt that everyone had a certain expectation that this kind of person would confess in this way. I was not sure at first, so the second time, I let myself see what kind of conversation would take place. I learned a little bit more about how to do it, and I realized that it was okay to say something peripheral to what I was saying, and that it was also effective to blurt it out.
Nishio: Yes, yes. The game becomes more interesting. Whether it leads to victory or not, the game becomes more interesting.
Male Y: That's what I mean. But in that sense, the point of this game is that you have to quickly identify who your allies are.
Nishio: In that sense, werewolves have an advantage because they know each other.
Male Y: That's what I mean.
Nishio: It seems to be a good balance with the disadvantage of having a small number of people instead.
Male Y: It's like that.
Tachikawa: I see.
Nishio: 〓01:05:48 alteration? 〓Where here two people were werewolves. I'd like to bite again.
Man X: Yeah. So I got spoiled. So we became like a team and defended each other, so I probably didn't have enough power to argue by myself. I became a werewolf by myself.
Tachikawa: I was spoiled by Mr. Nishio.
Male X: Spoiled.
男性Y：(笑)
Nishio: This kind of relationship emerged spontaneously when we were working with this group, but it would be different if we worked with different members.
Male Y: I'm sure it will come out.
Nishio: The perception of this person as a character who does this kind of thing is a little different every time.
Male Y: Oh, I see.
Nishio: I may be giving off a dependable vibe this time. But I think it will be more like, "This guy is in trouble, we have to kill him quickly.
Tachikawa: A pattern to be wary of.
Nishio: Tachikawa-san was very cautious this time, wasn't he?
Tachikawa: Indeed.
Nishio: I was fortunate in that it worked out that way.
Tachikawa: I was also on the lookout for the entire game except for the second half. It was like I was always being caught. Why is that?
Nishio: Why. My interpretation is that these two are familiar with each other and will be perceived as knowing each other well. In that case, there is a pattern where one of them will be wary and one of them will be trusted, so that has to be defeated by one of them first.
Man Y: I see.
Tachikawa: Ah.
Nishio: I have to somehow draw the perception that Mr. Tachikawa is an unreliable character.
Male Y: You mean that the character could be established in the game.
Tachikawa: I'm afraid of character slip-ups.
Male Y: I see. That's interesting.
Man X: I've been thinking about things that are quite out of character for me. I joined this game because I wanted to act as sincere as possible because relationships will continue after this wargame is over.
Nishio: I do that too. Sometimes. There is a pattern where I act sincere and keep giving an aura that I am a sincere lecturer. But if a werewolf comes along depending on the cards I draw, there is nothing I can do. (laughs) You must not lie.
Male Y: You shouldn't. Because of the nature of the game.
Male X: So if I don't deceive myself in order to enjoy the game, I can't fool myself into thinking that I am in danger of lying.
Tachikawa: Oh, that's true. I feel that "you are a strong wargamer" is somehow not a compliment.
Nishio: Well, you have to separate the game from reality.
Tachikawa: True. Yes, that's true. I think it's great that people lie when they are werewolves in a werewolf game.
Tachikawa: Because
Male X: Oh, yeah. They make the game fun.
Tachikawa: Because yes. Because they are doing it with the spirit of service, to entertain everyone with their games. However, there seems to be a general perception that people who are good at werewolf are people of bad character.
Nishio: I wonder if so. Maybe some people think so.
Tachikawa: People often say to me. When I do that at a gathering of beginners, they say, "I don't want to lie too much." or something like that.
Male Y: Eh~.
Nishio: There are people who think they are on the right side if they say they don't want to lie.
Man X: I said I have a bad character because I am aware of those parts of myself that are not good.
Nishio: I am not lying, I am standing on the side of honesty, so I am good and that person who opposes me is evil. This is a common psychological pattern.
Man X: Yes, yes, yes.
Tachikawa: I see.
Male X: There is no heart next to the sex of the personality. It is a raw personality.
Nishio: I have no heart.
Tachikawa: This?
Man Y: The Rinshinben.
Nishio: I want you to write a rishinben.
Man X: Also, the only ally is taste.
Tachikawa: That's terrible. I couldn't write a marriage marriage the other day, so I had to get a customer to do it.
全員：(笑)
Male Y: That's hard.
Male X: The one used after the name.
Tachikawa: What was that? Oh, yes.
Male X: So you're great for making the game fun.
Tachikawa: It is my perception.
Nishio: That's right. I was not at all aware that I was lying to make the game fun. It was just for me to win.
Tachikawa: Ah.
Man X: Well, you know. It depends.
Nishio: To each his own.
Tachikawa: If the person who drew a werewolf says, "I drew a werewolf, so I don't want to play. Tachikawa: If the person who drew a werewolf says, "I drew a werewolf and I don't want to play," the game won't work.
Nishio: Yeah. It's like the game is over the moment you say, "I was a werewolf." The game is over the moment he says "I was a werewolf.
Male X: I was going to make a bad move too, but I really couldn't think of anything in my head. I'm sorry.
Tachikawa: I know I'm persistent, but in business, don't you ever find yourself in situations where you are the werewolf? For example, when you go to explain something to a customer, you must not lie, but there are times when you have information that you really want to hide.
Nishio: Or rather, the rest of us have to act as if we are confident even though we are not.
Tachikawa: Yes, yes. That's right. If I were in the sales department of a large company with normal personnel authority, it would be quite reassuring if I had someone under me who was very strong at wargames.
Male X: I think you may be right.
Tachikawa: This guy can act confident even if he is not, and win the trust of customers. I think that a person who is strong in wargames is basically a plus in terms of business skills.
Nishio: If it were a business skill, it would be [the power of persuasion] or [the ability to win trust].
Tachikawa: In short, that's what I mean.
Nishio: 〓01:11:13〓I think so.
Tachikawa: Trust is nothing.
Nishio: It's [subjective]. [Trust is subjective.
Tachikawa: Yes, that's right. Trust is, moreover, the 〓01:11:24 fund of trust? 〓 Never. In short, trust is easy to understand if you compare it to a wargame. So it doesn't matter if the person is a human or a werewolf. Whether the person is trustworthy or not. Right?
Nishio: Yeah? I'm a little confused about your question.
Tachikawa: Well, trust means that you can trust Nishio-san, whether he is a villager, a thief, a werewolf, or not, and that you can trust him now.
Nishio: Are you trying to say that Mr. Tachikawa subjectively thinks he seems to be saying the right thing?
Tachikawa: Oh, yes, yes. And, as is true in business, it is quite pleasant to make a positive proposal to the customer, isn't it? If you believe in it. If you believe from the bottom of your heart that the introduction of this service will be a plus for your company, then you will be able to make a positive proposal to the customer.
Nishio: So you can say what you sincerely think.
Tachikawa: But we can't objectively tell if it is actually a plus for the customer.
Nishio: The rationale is not particularly clear, because no project has a 100% chance of success. I'm not saying that if this project succeeds, it will be like this 〓01:12:54〓
Tachikawa: In the past, there was that one. 〓01:12:59〓時, one of my bosses was a former Hebelman. He was a guy who made educational videos for Hebel House salesmen. When I asked him how he was going to teach them, he said that he was going to make it so that they would like Hebel House anyway. In other words, we are trying to create salespeople who can sincerely think that this house is really good and sincerely promote it to customers. I see. He said that if they keep on selling without stopping, the customers will find out about it.
Nishio: When you just said that, I felt like a werewolf had been discovered. If you truly believed that you were a villager, you would be suspicious of me for saying such a thing even though you are a villager.
Male X: I thought about doing that. But I don't usually do that kind of thing, so I decided not to do it.
Tachikawa: I see. It means that even if you usually pull 〓01:14:02〓 you can behave quite well as long as you don't think you are a werewolf, right?
Nishio: If you can think of yourself as a villager from the bottom of your heart like this.
Tachikawa: If you put your mind to it.
Man X: That's what I mean.
Male Y: I see. It's more like becoming.
Tachikawa: No, he said, it's really a werewolf.
Male X: Is it like [theater]?
Nishio: Yes, that's right. Maybe it's theater. Maybe it's [theater in which I act out my confident self].
Tachikawa: What can I say?
Nishio: I think Tachikawa-san talks too much, so I'd like to hear more from you two.
男性Y：(笑)
Nishio: How did you like it? Try it?
Male Y: It's hard to trust words alone. After all, the possibility of a werewolf/werewolf remained until the end at this time.
Nishio: So it was there in logic.
Male Y: I was definitely left with logic. In the end, it was the way you spoke.
Nishio: Like, confident.
Male Y: The atmosphere and so on compel you to read there. On the contrary, I felt that the person who could create that atmosphere would win in the end. I thought it would have been great if Nishida's behavior at the end was a bluff. I thought he was a strong character if he was bluffing. Probably knowing Nishida-san up to now, I decided that it probably wouldn't happen. So I thought that what these two guys are saying is right first of all.
Nishio: If I had confidently said that I was the villager, I would have developed a suspicion that these two might be werewolves.
Male Y: Yes, yes. That was probably that one.
Nishio: I think the pattern of these two werewolves tag-teaming each other to deceive each other is rather 〓01:15:54〓
Man X: Well, my undergraduate degree was in the Department of Systems Innovation in the School of Engineering at the University of Tokyo,
Tachikawa: Oh, so it is system creation.
Male X: Yes. The test is like game theory. It is the famous [game theory] "Tit For Tat," which is about trust and betrayal, and in infinite trials, the optimal solution is for everyone to cooperate, but when there is a finite solution, they will betray each other.
Nishio: Yeah, yeah.
Man X: I know it sounds naive, but I am a person who believes that in my lifetime, a future or society will be created in which this will be the optimal solution. Therefore, I acknowledge the existence of werewolf-like elements in this world, but I live my life as if I am the one who should destroy them.
Man Y: I see. Excellent, that's it.
Tachikawa: Well, I don't know what I'm talking about. I'm not sure what you mean by "TFT" in the game "Tit For Tat.
Man X: Yes.
Nishio: Well, we are talking about an ideal world where there are people who betray each other, but everyone stops betraying each other and everyone does good things for each other.
Man X: Well, yes.
Nishio: That community. I would like that to happen, too, but I think of it as a way to create a closed community where the types of people who are already out there who would betray you are not allowed to enter.
Man X: Ahhh.
Nishio: The reason for this is that humans have tried in various patterns to direct all people in the world toward an ideal, but it has not worked.
Man X: Well, yes.
Male Y: Yes, that's right.
Nishio: I thought it would be a good idea to start with a small 5-meter radius and create a trustworthy group and expand it while protecting it. I don't know why we talked about this. In this sense, playing a wargame and exposing all the deceptions, including the deception, is a way to win trust. If I had intended to cheat when my life was in danger, I wouldn't have played like this.
Man X: I'm sorry. Eh, which one?
Nishio: Well, let's say that the person is planning to steal money or something like that, regardless of whether there is any chance or not, it is totally wrong to cheat in a game. You make a character like "I am a person who cannot lie at all," and then you cheat at the end of the game.
Male X: Oh, that's what I mean.
西尾：〓01:18:16〓
Male X: I think there is also signaling. It is a signaling expression that says, "I am a trustworthy person. I think it's interesting that sometimes it has the opposite effect.
Tachikawa: How can signaling be counterproductive?
Male X: Because if you were a werewolf, I think it would be a simple example of how you would be suspicious if you were signaling excessively.
Nishio: I am not a werewolf after all. I am a villager. That's actually zero information.
Man X: Well, yes.
Nishio: If you want to put it logically.
Tachikawa: Yes, that's right.
Nishio: 〓01:18:56〓题 that both of them are to be executed.
Male X: If you ask me, that's not true. I see.
Nishio: What? Is it the part where you have zero information?
Male X: No, so I thought I did that.
Nishio: Ah.
Tachikawa: I think there is a link between this and what is often said in real life about salespeople who are not easily trusted when they give a sales talk.
Nishio: Is it difficult to be trusted?
Tachikawa: Don't they say? I wonder what it is.
Nishio: I don't know, is that right?
Tachikawa: It's like a salesman who is not a good talker but sells a lot of houses.
Nishio: In detail.
Tachikawa: Yes. Tachikawa: Yes. "No, this is really like this, but...do...do..." Tachikawa: Yes. And then he would get up on the board and say, "This is how it is, this is how it is, yes. Yes. Here you go!" Surprisingly, people like that don't get people to buy their products.
Nishio: This commercial is a Japanease commercial of Japanease Takata in my brain.
全員：(笑)
Nishio: I thought it would sell.
男性X：(笑)
Tachikawa: Japan Net Takata doesn't deal much in houses, for example. I think the only items that are easy to sell with that approach are home appliances, and items under 100,000 are easy to sell with that approach. Anything above that requires a different approach.
Nishio: We need to cultivate trust over the long term.
Tachikawa: Otherwise, you would not be able to explain that without selling the Japanet-Takata house. I don't know.
Nishio: Well, I think it's hard to sell houses because it's a business like television where you have to sell to a lot of people and sell a lot.
Man X: For one thing, I guess you could say that I'm trying to accommodate the customer's feeling of being cautious because it's a big purchase.
Nishio: Like this person is suspicious.
Tachikawa: Yes, yes. Because there must be some reason why 〓01:20:35〓's selling only home appliances using that method, right? That's a little 〓01:20:47〓
Male X: This may be a little off topic, but have you ever seen a drama called "Ie Selling Onna"?
Tachikawa: Yes, yes. Keiko Kitagawa's?
Man X: Yes, I was watching the previous season. In order to help people who cannot make the decision to buy a house make that decision, they do everything in their power to design a house that is best suited to their lives.
立川：〓01:21:10〓
Male X: Yes, yes. In that case, Keiko Kitagawa would say, "This is like this, this is like this, this is like this, and this is like this. In that case, Keiko Kitagawa would say, "This is this, this is that, and this is this. It's not exactly the same as "getting up on a plank of water," but one of the elements that I think might not gain the trust of "getting up on a plank of water" is that it is not emotionally charged.
Tachikawa: I see.
Man X: I'm wondering if there is, and if it's emotional, then even if it's highly logical, it might be highly persuasive because of the emotion that goes along with it. I'm a slurring kind of person, but I'm still confident enough to make a sales pitch that will get people to make an important purchase.
Nishio: I see. I see. When I first heard about the lack of trust in the "stand-up water", my first thought was that the other party was too full of information too quickly, and I wondered if there was a sense of discomfort in that.
男性Y：不快感。
Tachikawa: Indeed...
Nishio: I don't know what's going on, but he's saying a lot of things, and I'm like, "What the hell is this guy?
Male X: Easy to understand. Easy to understand.
Nishio: Recognizing that there are people in the world who feel that way.
Tachikawa: I think that the number of such people is quite overwhelming. I wondered why everyone follows the same routine. When I think about it, I think people tend to accept things in a certain order. If you say things in the order we are used to, we can easily accept them, but if you break the order we are used to, we don't understand it anymore.
Male X: I think there is a lot of that. Well, I agree with some of them. There is no absolute only solution, but I think there are a few patterns that are used with a certain degree of frequency. I think the simplest one is "at the beginning" and "at the end.
Nishio: There is a typical pattern to make people feel like buying smoothly.
Tachikawa: It could be anything, but it could also be a mail-order program, or a so-called lead page on the Web, a page that sells the product. It's all designed accordingly. The pages are designed in this order from the top to the bottom, with a buy button at the end.
Nishio: So the majority might be inclined to buy it because of that, but the minority closes it by saying weh. The moment they see it, they say, "Oh, I'll buy it! and close the page. They close the page and say, "Oh, it looks like an infomercial. Maybe it's not so much that it's an infomercial-like page that gets people to click the button, but that there's a page that's not an infomercial that makes that pattern, and it closes the other way. It's not good.
Tachikawa: That's interesting. People like Mr. Nishio, who think that they will never fall for such things, buy mysterious limited-edition products for 100,000 yen. Recently,
Nishio: What is that these days?
Tachikawa: Have you ever bought such an expensive product?
Nishio: It's like I'm being deceived somehow...
Tachikawa: It's not about being deceived or not being deceived. There is some kind of characteristic.
Nishio: Oh, I'm wondering if there are decisions that are being made to quickly buy expensive things that cost around 100,000 yen.
Tachikawa: No, this is a very rough story. Women like such mail-order programs and often fall for them. But men try their best to avoid them as much as possible, saying, "I won't be fooled by such things. But on the other hand, men make surprisingly irrational decisions in completely different areas.
Nishio: Oh, it's like you're making a lot of irrational decisions.
Tachikawa: That's why limited edition figures for men sell like hotcakes. From a woman's point of view, why would she buy something like this for 10,000 yen? I don't understand the point, but this is good. It doesn't matter what the price is. I mean, isn't it men who buy AKB CDs in bulk?
Nishio: But that's not because the product is female. If I say that, I think there are more 〓01:25:26〓female bromides all kinds of bromides done by good-looking men like Kinpuri or something like that.
Tachikawa: Ah.
Male X: There are. There are. There are people like that. There are with different content.
Nishio: With different content.
Tachikawa: I see. Then it's not really a gender difference.
Nishio: Maybe there is a gender difference. I have not observed an equal number of female and male fans enough to observe a gender difference. It's mainly men. And I agree that a certain percentage of the men I know are paying a lot of money for such things.
Tachikawa: My wife buys five CDs with different jackets of her favorite artists.
Male Y: Seriously?
Tachikawa: It's a crazy 〓01:26:05〓 when you accuse them of that. TACHIKAWA: "I bought it. I see. This one and this jacket are different." And I said, "I see.
Nishio: That's how it's done there 〓01:26:17〓
Male Y: Coercion.
Nishio: 〓01:26:21〓Married couples should divide the amount of money they spend on their hobbies and be indifferent to what each other spends on them.
Tachikawa: That's the thing, but I 〓01:26:30〓
全員：(笑)
Nishio: What is this time, doctor, what is this time 〓01:26:35〓
Man X: Oh, but in the decision-making obligation, 〓01:26:38〓Preference is an incredibly important concept, so it's about who wants what in what order. That has a little bit less to do with price.
Tachikawa: So the selection relationship has two perspectives, husband and wife, which makes it difficult to understand what a family is.
Nishio: But when you form a team in a company, for example, you should proceed under the assumption that everyone in the team is different, right?
Tachikawa: Yes, that's right.
Nishio: A huge firestorm occurs as a result of assuming that everyone is in line.
男性Y：(笑)
Tachikawa: This is kind of interesting. It seems to be connected to MOT.
Nishio: In the end, everyone is in a different position. This game of werewolf is the same. You think they are your friends, but there are werewolves in the mix.
Man X: Could this possibly be someone who wants to change jobs and someone who wants to stay at this company?
Nishio: Yeah, yeah, yeah.
Tachikawa: I see.
Man X: So you are talking to each other. You are hiding the fact that you are going to change jobs.
Nishio: Yes. I'm looking for a new job behind the scenes.
Man X: Yes, yes, yes.
Nishio: "We have to make the company better!" Like.
Man X: Yes, yes. If you become a stronger wargamer, it will be easier to change jobs.
Nishio: Aside from making it easier to change jobs, well, it makes it easier to make favorable decisions. But, well, when changing jobs, isn't it not really necessary that people around you don't find out about it?
Man X: No, I don't know. My boss's boss pretty much covered it up until just before, but then he found out. The calendar kept getting empty.
NISHIO: The schedule is going to be empty. Oh, I can't put it in.
Man X: Because I can't get in. But well, I've lowered the point you mentioned. The part about trying to improve the company.
Nishio: For example, a person who wants to quit the company and a person who wants to stay in the company have different goals, but on the surface they are facing the same direction.
Man X: Yes, yes.
Nishio: I wonder if the situation is similar to a bribe. For example, when developing software, there are people who want to improve the quality of the software and people who want to finish the software project and be released as soon as possible. This is true even in sales, where some sales people just want to sell the software, so it doesn't matter if there are bugs or not, just get on with it 〓01:28:31〓。 No, of course there are people who think that since they are putting out software, they should not 〓01:28:37〓here. I think there are people who are seemingly on the same team, seemingly in the same company, seemingly with the same goal, but actually have a different goal behind the scenes.
Man X: Oh, sure.
Tachikawa: Why did you feel that way?
Nishio: The team doesn't think 〓01:28:52〓チームメンバー.
Tachikawa: Team members.
Nishio: Yes, yes.
Man X: The two concepts that were blurred in my mind have now been quickly separated by Dr. Nishio. Values and purpose are different.
Nishio: Values and objectives are different.
Tachikawa: Hmm? By values, do you mean values for whom, and what is the purpose?
Male X: When we say that we should communicate our values when we form a team, the meaning of "our objectives are different" is completely different from the meaning of "our goals are different" and I think it is not good to have different objectives.
Tachikawa: It is better to have the same objectives for all team members, isn't it?
Man X: I think it would be better not to include people with different objectives.
Tachikawa: But everyone's purpose in a company is different. For example, the most varied are those who seek a sense of fulfillment and satisfaction in their work, and those who seek a sense of purpose in their work, and those who seek a sense of satisfaction in their work.
Male X: That's important.
Tachikawa: People who say that work is something you do because you get paid for it. 〓01:29:44 〓
Male X: Values.
Male Y: It's the values.
Nishio: After all, the words "values" and "purpose" are used ambiguously now.
Tachikawa: I see.
Nishio: This is where the confusion arises.
Man X: Ahhh.
Nishio: I felt like these three were all here, and I thought, "No, no, no, which one is the werewolf?
男性X：大丈夫？
男性Y：(笑)
Nishio: The point is that when we talk about objectives, for example, we all have to have something in place such as completing this software by XXX date, but some people think that after they are released from this project, they will change jobs, some people want money, some people want to complete this software, and some people think they are going to be in the 〓01:30:23 〓 because they will complete this software. Some people think that they want money, others think that they want to complete the software, and some people are 〓01:30:23〓 because they want to complete the software. What is the goal of each person or individual is different.
Male X: Let's see, in hiragana, on the left is what makes you happy and on the right is what you want to do. A little column. What makes you happy?
Tachikawa: What makes you happy? What do you want to do?
Man Y: It's not what to do.
Man X: What should be done. I'd prefer to do what should be done. Let's do what should be done.
Tachikawa: This is something. A little bit.
Nishio: Now that's a werewolf situation.
Man X: What should we do?
Tachikawa: For me, the idea is probably a little different.
Nishio: These three 〓01:31:01〓
Male Y: Oh, that's what I mean. That's very interesting.
Tachikawa: What makes you happy? What's over here?
Man X: What should we do?
Tachikawa: Should we? In your mind, for example, when you think of software development, what were the values and what was the purpose?
Nishio: Let's say you are developing software for a project, and everyone on the team agrees that the software must be released on, say, March 31.
立川：納期？
Nishio: It could be a deadline. Well, there should be a goal for what that project is going to do that everyone on the team agrees on.
Tachikawa: The goal of the project.
Nishio: No, the goal of this project is objectively observable, and regardless of what individuals think, either the goal of the project has been achieved or it has not.
Tachikawa: Objectively.
Nishio: On the other hand, what makes us happy and what makes us happy are completely subjective to the individual, so it is impossible to observe whether or not they are achieved, and frankly, it does not matter.
Man X: (laughs) Yeah, yeah.
Man Y: It means that some people like doing the project and some don't like it but feel they have to work hard because they get paid.
Nishio: Yes. It is possible that there is a type of person in the project who wants the project members to be happy, but I think the default state is that each person has a different idea of what makes them happy, and they are not interested in what makes others happy.
Tachikawa: For example, it is a goal to have this software completed and delivered by March 20, isn't it?
西尾：〓01:32:41〓
Man X: Wait a minute yes, yes.
Tachikawa: 〓01:32:46〓, at the beginning of February, the customer will be satisfied with this. If we deliver the product as it is, we will get a big complaint.
Male X: No, that's, you know, I thought the same thing, I'm certainly not sure if it's an objective or a value to take the Q or the D in QCT.
Tachikawa: So, we already have no project team but the D team. So, there is a question of whether it is better to explain this to the customer and ask them to extend the delivery date, or whether it is better to just keep the delivery date and proceed with the project on time so that the customer will not complain. If it is the purpose of the project, for example, then the first thing to do is to absolutely keep the delivery on time.
Nishio: Purpose-based.
Male Y: Maybe this is all for a purpose.
立川：(笑)
Male Y: It's all purpose. That is why it eventually falls down to customer matter. The moment it becomes a delivery date with respect to this project, the other party is the customer, so the demand for that objective just changes depending on which the customer values. So it is not a value.
Nishio: If the customer asks for higher quality even if it means extending the delivery time, we must improve the quality.
Male Y: Yes, it has to be enhanced.
Nishio: In some cases, if the customer does not appear at this time anyway, I need to issue a press release at this time, so I don't want the release to be extended without my permission in order to improve the quality.
Male Y: Yes.
Nishio: Another point I wanted to make is from a different point of view, but it is known that such trade-offs may occur when a project is created. It is known that there will be a playoff between quality and deadline, and the team members need to agree on what to do instead. It's inherently there.
Tachikawa: Is there?
Nishio: In terms of the inception deck, we call it a trade-off slider, and I don't know if we can call it an inception deck if the team members are willing to discuss which they would prefer in the playoffs.
Tachikawa: Talking about something intuitive, it's more or less intuitive. This is my opinion. I don't think there are people who talk about it together and reach a consensus. It's just an idea.
Man X: Interesting.
Tachikawa: Why? There is a team leader who takes responsibility. That person decides and takes responsibility. For example, when the question is whether to take Q or C, I take this one, I take this one, and if it doesn't work out, I take this one. And if it doesn't work out, the team leader takes full responsibility.
Nishio: That is one way of thinking. The team leader is in such a position, and that is just one interpretation. On the other hand, in such a case, the team leader makes a decision, and the rest of the team members say, "Yes, I see. I see. The opposite is true, but the team leader is not the one who makes the decision. There are, of course, those who think that the team leader is a servant whose role is to support other team members so that they can work happily.
Tachikawa: Then I am not completely that way. In other words, the team leader decides the objectives. I think it is the team leader's job to then work to convince each person that it is a good idea.
Man X: Ahhh.
Tachikawa: It is also the team leader's job to make everyone think that the team leader thought spontaneously and decided to do it that way. So, for example, a team leader who says that the answer that everyone came up with spontaneously is the answer of the team organization is an extremely useless leader. It's just an evasion of responsibility.
Nishio: One interpretation is that.
男性Y：(笑)
Nishio: So if you want to convince all of Tachikawa-san for now and want them to think spontaneously and have a particular idea themselves, then the werewolves need to be stronger. 〓01:36:39 〓
Tachikawa: Ah.
Male Y: That's what I mean.
Tachikawa: I am weak.
Man X: Why are you saying that? Because if you don't argue with that, you won't become a stronger werewolf.
全員：(笑)
Man X: Werewolves can only get stronger by making the assumption that they are strong and then training them.
Tachikawa: Hey.
Nishio: Yes (laughs).
Tachikawa: Werewolves are really bad at 〓01:37:00〓
Man X: No, that's a waste of time. If you think you're strong, you'll be strong.
Tachikawa: What - really?
Man X: If you don't think, you won't get stronger. On the contrary.
Tachikawa: I see.
Man X: I don't know anyone who became strong while feeling weak. In any field.
Tachikawa: I see.
Nishio: Words with connotations.
男性Y：(笑)
Nishio: I think you will become stronger if you only act to make others perceive that you are weak but strong, and if you keep thinking that you are weak and need to improve yourself, you will become stronger.
Man X: That's great. It's a trend.
Nishio: But the very first time I gave a presentation, I was very nervous and slurred my words, and I don't remember who told me this, but I was told that if a speaker looks unsure of himself or herself, no one listening to the presentation will find it interesting, so no matter how anxious or worried one may be, one should always give a presentation with full confidence. I thought, "I see.
Man X: It has implications.
Nishio: So I guess it has a little bit to do with making 〓01:38:00〓 with werewolves.
Tachikawa: Ah.
Nishio: 〓01:38:07分? 〓 I'm sorry.
Tachikawa: That 〓 01:38:09 minute? 〓 Or maybe it's just maybe. Maybe my way of looking at the world is a little different from yours. I don't know. I don't know.
Nishio: At any rate, just say it.
Tachikawa: I wonder if he is not thinking for himself.
Man Y: I see.
Tachikawa: I would think that if he were thinking for himself, he would be more troubled. I have seen it that way, that the person who is more troubled is this person, thinking with his or her own head. There are probably many ways to look at it, and it depends on the person. For example, some people trust a person who speaks confidently, while others may trust a person who is not so confident. Well, it depends on the situation and the place. For example, I'm a werewolf...hmm...hmm...hmm...hmm...hmm. I play werewolf. But when I am asked by clients at work whether I would do marriage activity in my home or not, I always say with confidence, "It would be better to do it in my home for sure. I say with great confidence, "You should definitely do it at my place. And they all come to us. I say with a straight face, "Are you sure you want to do something worthwhile if you come to us and then decide not to go with us?
Male X: Well, I think that's good.
Tachikawa: And then, this is exactly the point of the werewolf project, when and under what circumstances do we trust people? This is interesting, so I would like to dig a little deeper. This is interesting, so I'd like to dig a little deeper. You said earlier that it is better to think about values and purpose separately, right?
Man X: Oh, no. I said that I had been living my life in a blur, but the moment I was told, I thought, "Oh, that's different.
Tachikawa: Different values and objectives?
Male X: There was a moment when I thought it was different, but when they told me, it was all messed up again.
Nishio: He says he is not sure anymore when he is told.
Male Y: But I guess we are divided on that. The objective is still the objective, not the value. We talked about consensus, about whether to take Q or C. That's the customer's matter. That's the customer's matter. If you don't have the customer's decision as the axis, you will never be able to satisfy the customer in the end. I think it is better to think that everything is achieved from the customer's perspective. I think it is better to think that everything is achieved from the customer's point of view.
Nishio: But it's just that the team shares one vision that customer matter is important. There are software makers in the world who don't think about the customer.
Male Y: That's the premise.
Nishio: If we create software that no one else has developed because we are superior in that technology
Man Y: I see.
Nishio: There are actually some ventures that fail badly after they are created, aren't there?
Male Y: Oh, I see.
Nishio: Conversely, since there are so many such ventures, books and other such teachings are being written that suggest that it is better to pay more attention to the customer's needs.
Male Y: So that's how it is.
Tachikawa: Let me tell you a simple story. There are two ways of making service products: one is to focus on the customer's needs and wants, and the other is to say, "If you don't have this, you don't know how good this product is.
Man X: Actually, that's what I've been thinking. I was waiting to hear about it.
Man Y: What I'm trying to say is. Male Y: Yeah.
Tachikawa: I think it is both.
Male Y: Honestly, there is.
Tachikawa: So, I don't know, but actually, there might be one that is right or the other. People often say that the iPhone is so and so. Because you think, "How can you use an early model like this? It's never going to catch on.
Male Y: But, as I said, it's also customer-oriented. When you release an iPhone, the customers are the masters, and since masters have many different ways of thinking, they are able to set their own criteria for judgment because they are customer oriented.
Nishio: Sorry. One more time.
立川：判断軸？
Male Y: The point is, whether you focus mainly on Q or C, QCT is definitely all about the customer in terms of what the customer has ordered. For example, if we were to release an iPhone and the whole world was our customer base, there would be some customers who want it quickly even if the quality is poor, and there would also be many who want it to be of extremely high quality. When you think that's a 50-50 chance that there are a lot of them.
Nishio: I see.
Male Y: The initiative to decide which side to take goes to the sender.
Nishio: I see.
Male Y: It's just that.
Nishio: Because our customers are a mass, not a specific individual, we look at them as a distribution and make decisions about where to target within that distribution.
Male Y: Yes.
Nishio: You can also say, "Let's take our time and make a good product and take it.
Male Y: Yes. That's right. That's what the gaming industry does.
Nishio: I see.
Male Y: The game industry is very particular, so it doesn't matter if we make them wait because we have all kinds of customers. We can do it at our own pace, so it's just a matter of making decisions at our house.
Nishio: And the customers who are very goofy about it are okay with this much pi.
Male Y: That's what I mean. So in terms of the initial cell phone, you put it out there as if it was normal for it to cut out. At that time, we were at a stage where we could make a judgment either way. We were not in a situation where we had to release a product of absolutely high quality, but rather, we wanted to release a product that could be used by people who were curious about something, so we probably released it first. So, depending on the customer's situation, which axis to put on the market will change.
Tachikawa: According to what Mr. Jifuku just said 〓〓01:44:23〓， if the customer waits, then the supplier can make a suggestion as to what part of the product should be cut out. If it's a niche, you have to ask more and more.
Male Y: Niche or not. We have to ask. If it is almost definite.
西尾：〓01:44:45〓
Male Y: If you have a niche but a reasonable clientele, you can probably make a lot of different decisions.
Nishio: Conversely, if the customer 〓01:44:58〓たる, there is no way to hear about it.
Male Y: Yes, yes.
Tachikawa: Indeed. It's simple now, but I feel some powerful theory, very powerful. If the customer is a mass, there is a proposal. In other words, if you are trying to make a new phone, you can't do it if you are asking the customers.
Nishio: 〓01:45:22I think there was a discussion about which is better or which is better. But when you are trying to create something new in the world, there is no way you can do it by asking the customers.
Tachikawa: No, I don't.
Nishio: That's where my values are. Leave other people's values aside and use your own values first of all, the prototype 〓01:45:51ブライバル? How about after you have completed the 〓? and then you have to go out and say, "How is it?
Male Y: So that would mean that it is getting closer to being equal there.
Tachikawa: What? What do you mean?
Male Y: Values and objectives.
Tachikawa: Ah.
Nishio: Equal does not mean the same.
Male Y: Yes, yes.
Nishio: You mean they are of equal importance.
Male Y: I mean it will change.
Nishio: Basically, rather than having the same level of importance, the two are orthogonal to each other on the X-axis and the Y-axis...it is not a matter of which is better or anything like that.
Male Y: You mean there is no such thing.
Tachikawa: I see.
Nishio: Tachikawa-san kind of went silent, though.
Tachikawa: They are just silent because they talk too much.
男性Y：(笑)
Nishio: The first thing I want to confirm is what is going on with regard to today's time schedule?
Tachikawa: Oh, almost perfect. You just somewhat put an end to the discussion, didn't you?
Nishio: Yes.
Tachikawa: So my plan is to have one last wargame and end at 9:00.
Male Y: Oh, I see.
Nishio: He said he would do it one more time at the end.
Tachikawa: Then doesn't it feel kind of good? Don't you want to try it again in this situation?
全員：(笑)
Nishio: We were talking about something that seemed to be rather business management 01:47:05 〓 but we could have been talking about how to win a wargame, and then I would like to try it again. 〓01:47:13〓Because we were even talking about the need to talk about it up to 〓01:47:13〓as a strategy.
Tachikawa: That's right. When I played with Mr. Nishida, I felt that a person who is a strong wargamer is a stronger manager than a person who is a strong mahjong player. Can someone who is a strong mahjong player be a strong manager? I am almost certain that a manager is a strong mahjong player. I am not a good mahjong player. Actually.
Man X: I'm weak at mahjong too.
Tachikawa: They are very weak.
Man X: Yes, that's right.
Tachikawa: I thought it would be better to be stronger somehow.
Male X: I don't know about that.
Nishio: It's not about getting stronger at mahjong, it's about getting stronger at management.
Tachikawa: I hope that mahjong will become stronger as a result. My objective is to become stronger in management.
Nishio: I wonder, isn't it still about acting confidently in a situation of uncertainty and circumstance? Mahjong, too.
Tachikawa: Ah.
Nishio: It's like bluffing in poker. Pretending to have a strong hand even if you don't have a hand in.
Man X: Oh, I see.
Nishio: In situations where it is more advantageous to pretend to have a strong hand, you pretend to have a strong hand regardless of whether the actual hand is strong or weak. You have to separate the two, don't you?
Tachikawa: Yes, yes, yes. Then let's do one last time.