One Night Werewolf Transcript 2-8 Last
[BMOT One Night Werewolf 2nd]
Tachikawa: Yes, yes, yes. Then let's do one last time.
Nishio: And then the drinking starts.
Tachikawa: This conversation will continue with another drinking session.
Tachikawa: Then let's check it out. Then I would like to begin.
Voice: Night has fallen. Fortune tellers wake up and choose someone to divine. 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0, close your eyes. Werewolves wake up and look at each other, 5, 4, 3, 2, 1, 0, close your eyes. Thieves wake up and steal someone's heart. 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0. Close your eyes. Close your eyes. Everyone wake up.
Tachikawa: Now for the last home run 〓01:50:30〓
Nishio: Now what do you have?
Man X: I divined it.
Nishio: Yes.
Man X: I divined and the other party was a werewolf.
Nishio: Yes. Who did you divine?
Male X: This is Mr. Tachikawa.
Tachikawa: I see. I see.
Male X: Well, it just might be going around after that, like a phantom thief or something.
Nishio: Is Mr. Tachikawa a werewolf?
Tachikawa: I am a villager.
Nishio: So you think they are lying?
Tachikawa: Yeah. I wondered why. Why did I lie?
Man X: I am not lying.
Male Y: (laughs)
Nishio: Come on, let's have a showdown.
Man Y: That's the one. Honesty has been a little 〓01:51:12〓.
Man X: Well, but I wonder for sure. In order to break the claim that I myself am a fortune teller, another fortune teller would have to appear, but are there any other fortune tellers among these people? Probably not.
Nishio: Why maybe?
Male X: No, well, yes. I don't see any reason why the evidence would be weak, though.
Man Y: Why maybe?
Tachikawa: Be more confident.
Man X: Sure. I'm starting to feel a little less confident.
Male Y: (laughs)
Tachikawa: (laughs)
Man X: It's just that I was a fortune teller and when I divined Mr. Tachikawa, he was a werewolf.
Nishio: Yeah, yeah, yeah.
Tachikawa: Well, that argument is well.
Nishio: I will hear that argument once. So, what was your position, Mr. Tachikawa?
Tachikawa: I am an ordinary villager.
Nishio: And what was it?
Male Y: I was a villager too.
Nishio: I am also a villager.
Male X: This is a bad one.
Tachikawa: Is it claimed that you are a fortune teller?
Man X: Yes.
Tachikawa: Are you claiming to have divined me?
Man X: Yes.
Tachikawa: Why?
Nishio: If there really is another fortune teller in this situation, I'm not sure why you don't come out.
Tachikawa: I'm not sure. That's the first thing. I don't think I understand it either. I think it's a joke from my point of view as to why I don't answer the question after reflecting on the past, but for those who don't answer the question, there are their own reasons.
Nishio: Yes.
Man X: Oh. Well, if there are others. I don't think there probably are.
Nishio: Well, he claims to be a fortune teller.
Tachikawa: Well, that is true.
Nishio: A pattern where there is no fortune teller, but there is a thief and the thief is silent because he was unlucky enough to draw a werewolf.
Tachikawa: That means...
Nishio: I think you drew a werewolf in the thief. I don't know who drew it, though.
Tachikawa: Ah.
Man X: Oh, so that interpretation is possible.
Tachikawa: I see.
Male Y: But it's difficult to bluff a fortune teller.
Male X: I didn't really think of it as much of a pattern.
Male Y: So it's like I dared to do it.
Man X: That's, that's great.
Male Y: I dare you, to finally come out of your shell.
Nishio: If the thief is robbing the werewolf, now the werewolf is coming out because he is a thief.
Male Y: (laughs)
Tachikawa: That's pretty strong.
Nishio: Hey.
Tachikawa: That's strong.
Nishio: I tend to assume that because I am a werewolf, I must hide it, but if there is a thief, in that case I am back to being a thief, so I would rather be stolen because I was a werewolf.
Man X: The one who says it will get himself executed.
Tachikawa: You don't say that, do you? That.
Nishio: I don't know if I would tell you.
Tachikawa: Eh, I won't say...will I?
Nishio: No, how much of that
Tachikawa: Is that the proposal?
Male Y: That's right!
Nishio: It's how much you trust the pattern of the thief taking the werewolf. I think that is suspicious. My situation here 〓01:54:33〓I'm really a villager this time, so I have no information. What I have on hand.
Male Y: I'm a villager myself, so what I can't figure out is which way Nishida-san has been playing it. Is he trying to go through the right people as it is, or is he trying to break out of his shell by setting up a bluff at the end?
Tachikawa: I'm a little bothered by the last one.
Male Y: It's tricky, isn't it? It's kind of like a bluff.
Tachikawa: 20 seconds left.
Nishio: Is Mr. Tachikawa really a villager?
Tachikawa: Yes. I don't understand why Nishida san calls it fortune-telling, and I don't understand Nishio san's mysterious proposal. I also don't understand Nishio-san's mysterious proposal.
Nishio: If they are really villagers/really villagers, there are three villagers, which is strange.
Tachikawa: Yes. That's funny.
Nishio: It is easy at the moment to say that the bluff failed in the werewolf in terms of atmosphere, but that doesn't work. There are three villagers.
Tachikawa: That's not quite right.
Man X: It's time.
Tachikawa: Oh, here we go. Yes, here we go. 3, 2, 1.
Man X: I've been hit.
Nishio: Eh?
Male Y: (laughs)
Nishio: Eh. I thought it was suspicious, but I couldn't find any evidence at all. Is there another one?
Tachikawa: There is one more person.
Man X: So that's how it is!
Tachikawa: No, this one. 〓01:56:09 〓
Man X: Two, huh? I see, I had assumed it was one person.
Tachikawa: The good thing about this game is that each game takes less than 10 minutes. If you know the rules.
Man X: You've been teaming up here?
Nishio: After all, you should be confident enough to say you are a fortune teller.
Male Y: (laughs)
Nishio: Hey - I wondered which one it was.
Male X: No, I just thought it was a strange development.
Tachikawa: Ah, but I get it. I learned a lot from Nishida-san's lack of confidence. I thought I must have looked like that too. I thought, "I see myself like this.
Man X: Yes, yes. So already from the objective point of view of the person being pointed to, you learn that when these conditions are met, this person will be pointed to.
Tachikawa: Indeed.
Nishio: We point out to each other that we don't seem confident (laughs).
Tachikawa: Nishio-san took voice data both last time and this time. I thought there was a lot of information in the video. Let's put aside for a moment what we should do with the analysis.
Nishio: Yes. I don't listen back when I take audio data.
Tachikawa: So, I don't really understand it even if it is written down. Why does it say 〓01:57:16〓? I saw this.
Nishio: Maybe it's that look or the atmosphere.
Tachikawa: Yes, and also the inflection of the voice and the use of small conjunctions. Also, even with conjunctions, your voice is loud or something like that (laughs).
Male Y: My role is more about how to clear my suspicions about Mr. Tachikawa and bring him over here.
Tachikawa: Yes, yes. We both knew that Nishida-san was going to say it.
Male Y: Yes, yes, yes.
Man X: It was my mistake for not coming up with that hypothesis properly. I should have said that maybe both of us are wolves. Ahh.
Tachikawa: But you didn't understand, did you? TACHIKAWA: But you didn't know, did you? Until then.
Nishio: I think it's strange that there are three villagers, so one of these two must be lying, but only one of them is 〓01:57:57〓 fortune teller, and he doesn't say anything like a fortune teller, but if he is confident that he is a fortune teller, then he seems to be a fortune teller, so I think this one is suspicious after all. I think he would have been more trustworthy.
Man X: Sure.
Nishio: This werewolf... it's not a viable pattern. It's villager, villager, villager. one of the two is definitely lying, and it's weird.
Tachikawa: From Nishio-san's point of view, yes. But I don't know if Nishida-san might be lying.
Man X: No, I should have reminded you more that I am a fortune teller.
Male Y: Remind me (laughs).
Nishio: Well, it's true.
Man X: Yes, yes, yes.
Tachikawa: That's really what 〓01:58:36〓I hardly look at what people are talking about, and I argue only with the tone of their words and so on.
Man X: Yes, yes.
Tachikawa: This is exactly the kind of situation. I reflect on this quite a bit. We do self-reflect.
Nishio: I was just thinking about this, but I don't look back when I take a video, but if I put the camera in front of me and take a picture of myself and then look back later and see what I am doing when I am caught, I would be very depressed, wouldn't I?
All: (laughs)
Tachikawa: Indeed.
Nishio: Don't you feel like your life will improve a bit afterwards, despite the dent?
Tachikawa: It would be interesting to try that. Each of us should turn to face ourselves and try to take a video.
Nishio: I see, I can just use my own phone and put it here in-camera.
Man X: Tight.
Nishio: Whether or not to look back is a matter for each individual to do.
Tachikawa: It was like, why don't you try it?
Nishio: I thought it would be interesting to try it once, so I did.
Tachikawa: That's interesting.
Nishio: But, the hurdle has been raised, so the number of participants may decrease again.
Tachikawa: Ah, yes.
Nishio: 〓01:59:30〓I think we should do this several times to increase the number of people.
Tachikawa: Wow.
Nishio: This is interesting to try. So, you should try it with more people. This time we are doing it with only a team, so we have to 〓01:59:41〓 human relations, but if you change the team after doing this, it will be different.
Man Y: I see. I see that of people.
Tachikawa: Ah! I got an idea.
Nishio: What is it?
Tachikawa: This is our 〓01:59:50〓 story. We usually can't take videos of ourselves, so we would take videos of each other to see how suspicious we usually behave during our blind dates.
Nishio: They move in mysterious ways without confidence.
Tachikawa: Sadly, I understand.
Man X: That's right.
Nishio: Presentations also make me sad when I take a picture of my presentation and look back at it.
Tachikawa: That's tough, isn't it? I feel like I'm a fool. You have to force yourself to create such a place. That might be a good idea.
Nishio: That is totally unrelated to this werewolf story, but it is your company's business.
Tachikawa: One of the purposes of BMOT is to participate in events and apply my findings to business. That's how we do it properly.
Nishio: I'd like to talk about this werewolf game. Werewolf is a game where you find a werewolf and catch him, but instead of that, you can invest in a werewolf, but not in a werewolf. The game is a pitch practice to see who could collect the most investments.
Tachikawa: Ah.
Nishio: Okay, so the person who is unlucky enough to draw a werewolf loses money. So is that it, or if you are on the werewolf side, should you collect investments within the werewolf side? Let's not play this game because it's getting complicated. There is absolutely no such game. I'm starting to feel like I'm getting confused in explaining the rules of the game. I have a very strong feeling that something like that could develop in an interesting direction, a learning play in the MOT sense.
Tachikawa: Yes, that's right. Also, this is only indirectly related to business, but if you play wargames, you can understand a lot about a person's thought process. Each other's thought process. What kind of information will make this person react in a certain way. If you play it at work with your boss and subordinates, you can see how they react to each other's information.
Nishio: No, that's no good. It does not ensure psychological safety when playing games.
Tachikawa: Ah. No good.
Nishio: Of course you would pretend to be such a good boy.
Tachikawa: Yes, indeed.
Nishio: If you decide that it is more beneficial to be recognized as a character who cannot lie than to win the game, then you will be able to win the game.
Tachikawa: It definitely will.
Nishio: "I'm a werewolf." It becomes.
Man X: Oh, really. The game is not up for grabs.
Nishio: It is not possible. Therefore, I think it is necessary to lie aggressively after everyone agrees that this is a game and that it must be connected to the real world. The beauty of games is that you can experience things you can't do in the real world. If we cheat in the real world, it would be dangerous.
Tachikawa: But I don't think you can do that, Nishio-san. In other words, many people in the world, when they deny the other person's opinion, they deny the other person's personality as well. You can't separate them.
Nishio: I think you have to train yourself to separate that from the rest.
Tachikawa: Originally, yes. Originally, yes.
Nishio: Why don't you just do werewolves as compulsory education in elementary schools?
Tachikawa: Because I debated too hard in elementary school, I became a hated person.
Nishio: Ah. So this story you just told me was about your own trauma.
Tachikawa: What was it?
Nishio: Talk about speaking from the standstill.
Tachikawa: Let's move that discussion around a bit.
All: (laughs)
Man X: Good. Calm.
Male Y: It was interesting.
Tachikawa: It was interesting.