One Night Werewolf Transcription 2-5
[BMOT One Night Werewolf 2nd]
Tachikawa: I'll take this place.
Voice: Night has fallen. Fortune tellers wake up and choose someone to divine. 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0, close your eyes. Werewolves wake up and look at each other, 5, 4, 3, 2, 1, 0, close your eyes. Thieves wake up and steal someone's heart. 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0. Close your eyes. Close your eyes. Everyone wake up.
	Mr. X's unnatural gestures
Nishio: Basically, you shouldn't get any information at night so that you don't notice anything.
Man X: Oh, excuse me. I'm sorry.
Tachikawa: If you want, you can shuffle again.
Nishio: Well, let's do it.
Tachikawa: (laughs)
NISHIO: It's just that there are people who feel something who have sensed it.
Tachikawa: (laughs)
Nishio: Yes.
Tachikawa: Well.
Man X: I'm a villager with no position, but I just thought there was a thief.
Nishio: I see. From timing. Well, well, well. I thought so too.
Male X: I believe there is a phantom thief, but if there is a phantom thief, I exchanged with the villagers that it would be beneficial to come forward as a phantom thief.
Nishio: merit when exchanged. There is merit in coming forward, but not coming forward means that the thief is a werewolf.
Man X: Ahhh.
Tachikawa: Is there a thief?
Nishio: No. By the way, there is no fortune teller?
Tachikawa: I don't know. I was a fortune teller hiding earlier.
Male Y: (laughs)
Tachikawa: It's possible that the fortune teller is silent.
Nishio: I don't think it's a bad idea (in terms of the rules) to talk on the assumption that there is a thief, but if we are in a situation where there was a thief and he took the werewolf, these two (Nishio and X) are not the thief. I'm in a situation where I'm thinking there was a thief, so whichever of the two was the thief means one of them was the werewolf, which means one of them is the werewolf now.
Tachikawa: But I think there was a phantom thief too.
Man X: Oh, so you're declaring that you're not a thief?
Male Y: (laughs) That question is interesting.
Male X: Can I interpret that to mean that you think there was a phantom thief, and that the person called "phantom thief" was someone other than yourself? Male X: I'm just confirming that I think there was a thief.
Tachikawa: Feel free to interpret.
Man X: Eh. It's a weird feeling. Why do you have to feel uncomfortable?
Tachikawa: (laughs)
Nishio: To be frank, Mr. Tachikawa, are you trying to say that you were a villager?
Tachikawa: I am a villager.
Man X: Oh, good then.
Nishio: So, by process of elimination, Mr. Y is a werewolf.
Man Y: I'm a werewolf? What? But why are you a villager? I'm not sure.
Tachikawa: What I don't understand, and Y-san doesn't understand either, is why Nishio-san is so natural about his being a village.
Male X: Yes, yes, yes. I don't understand that part either.
Nishio: Because you are a villager. I made the assumption that I was a villager because my card was a villager.
Tachikawa: Then why, despite the presence of the thief
Man X: Oh, yeah. Possibility of replacing the thief with a thief and becoming a thief.
Nishio: No, that's why the thief is coming out, if that was the case. That's why I traded the thief for the werewolf.
	If the thief is exchanging with Nishio, a villager, then the thief must be coming out, and since he is not, the thief is saying that he is not exchanging with the werewolf, and therefore Nishio's card, a villager, remains a villager.
Tachikawa: I'm trading with a werewolf there....
Nishio: Yes.
Tachikawa: Maybe. And the fortune teller does not appear. Up to this point. What I don't understand is that my common sense doesn't apply. That's it.
Male Y: (laughs)
Nishio: It's not common sense, just a bunch of bias.
	ref. [Common sense is a bunch of bias].
Male Y: Because I think the fact that there is a thief is probably a story that all of these people recognize.
Tachikawa: Fortune-telling at the same time. This is true.
Nishio: Really?
All: (laughs)
Tachikawa: According to my perception, the fortune teller should not be here. I don't know anymore because of the example I just gave you. I can't make up my mind. Basically, I want the village to win.
Male Y: May the village win.
Nishio: Mr. Y, you say something that sounds werewolf-like based on Mr. Tachikawa's argument, do you have any rebuttal? I have to make some kind of counterargument. I have to get rid of my suspicions.
Man Y: Oh, so that's what you mean. I can't get rid of my doubts. All I can say is that I am not a werewolf.
Man X: What was his occupation, he was a villager.
Male Y: Yes, yes. Only villagers, oh, I don't know if I should say villagers. That's all I can say, sorry. I don't have any logic or anything.
Nishio: No information observed.
Male Y: That's what I mean.
Nishio: Logic cannot explain that part.
Male Y: I can't.
Nishio: How much more credit do we need?
Male Y: Yes, yes.
Nishio: I found it interesting that Mr. Tachikawa is not trusted.
Tachikawa: When I work with these members, I always catch something every time. We get caught every time. Whether it is a villager, a fortune teller, or a werewolf, we get caught every time.
Nishio: I think you only remember the part where you were caught.
Tachikawa: I've only been caught this time.
Nishio: Yes. This time. For sure.
Man X: Like that.
Nishio: I'm the director of a marriage agency and they don't trust me.
Man X: That's right (laughs).
All: (laughs)
Tachikawa: No, you are easily caught, aren't you? Everyone is talking about me except for me.
Man X: Why are you doing it? You are the one doing it, aren't you?
Nishio: There is a sense of invitation, isn't there? In a sense, there is a sense of "I feel sorry for myself for being beaten up.
Man X: Yes, yes.
Nishio: If it's different, then it's different, but you have to argue a little more like this.
Tachikawa: No, it's not that. I think there was a thief. The thief seems to have drawn a werewolf.
Male X: Ten more seconds.
Tachikawa: So I'm thinking that one of these two is not a werewolf.
Nishio: Unfortunately, time out.
Tachikawa: Yes, se-no!
Nishio: 〓00:53:57〓?
Tachikawa: We have not gathered.
Nishio: Tachikawa-san caught one. What, but moreover, the fact that he is a thief now means that he was a villager himself? What was it?
Tachikawa: I was a villager.
Nishio: He was a villager.
Man X: Who is the werewolf?
Nishio: Werewolves.
Male Y: (laughs)
Tachikawa: Eh, wait a minute, this needs explanation.
Male Y: I don't understand this.
Male X: I got it. Yay.
Nishio: It was a different direction than I expected.
Man X: I thought maybe one of us would die.
Tachikawa: What was it, Mr. Y?
Man Y: I'm a thief. Phantom thief.
Nishio: exchanged with villagers but did not come out.
Man X: What? Why?
Tachikawa: Why didn't you tell me?
Man Y: Oh, this is my mistake. I didn't see this card. I was wondering what to say because I didn't see my card. I thought it would be okay if I just said I was a villager.
Tachikawa: Oh my God.
Male Y: Mr. Tachikawa told me that, so I thought that Mr. Tachikawa was a villager, or perhaps it was all right.
Tachikawa: Oh, so one of them was a werewolf. I don't know about that.
Man X: But if the level of conviction is low, the power of persuasion is weak.
Nishio: By not mentioning the fact that he was a thief but failed to see it, he is telling some kind of lie.
Man X: Yes.
Nishio: Taking into account that this was the first time, it is possible that saying something like, "I made a mistake," would have worked.
Male Y: Oh, that's what I mean. I see. You can talk about that too. Oh, I see.
Nishio: In any case, I confide everything sincerely.
Male Y: Oh, I see.
Tachikawa: "Um - I didn't see what it was. But I am a former thief and I exchanged with Mr. Tachikawa.
Male Y: Oh, I see.
Nishio: In that case, I would assume that Tachikawa-san was a werewolf and hang Y-san.
	If the story is "Mr. Tachikawa was a werewolf, and Mr. Y took it, and Mr. Y is a werewolf," Mr. Y cannot refute the story, so the story is "Mr. Y is a werewolf.
Male Y: (laughs)
Tachikawa: That's where our eyes met completely.
Male Y: Yes, that's right. That's what I mean. Roger. Roger.
Tachikawa: Let's do this one more time. Let's do it one more time.
Male Y: Okay. So we can look at the thief after we change it. Roger. Roger.
Tachikawa: Yes, yes. You can look at the thief.
Nishio: I shouldn't replace it after looking at it beforehand, but I'll take a shoo and look at it afterwards.
Man Y: So it's OK to say. The fortune teller can look at any one of them.
Tachikawa: Either one person other than yourself or two pieces in the middle.
Male Y: I see. You can look at the two in the middle.
Tachikawa: You can also look at the two pictures in the middle together.
Man X: Oh, what about the fortune teller?
Tachikawa: The fortune teller is.
Male Y: Oh, that's one of them. I understand.
Nishio: Like, look at the two in the middle and they were both werewolves.
Nishio: I've been a werewolf three times in a row, and it's time for a change.
Man X: Four times is bad.
Tachikawa: The cards are surprisingly, if you don't use them carefully, they will peel off rapidly, so please be careful.
