One Night Werewolf Transcription 2 - Rules Explanation
[BMOT One Night Werewolf 2nd]
Tachikawa: It's difficult to gather a group of 10 people.
Man X: Ahhh.
Nishio: Wasn't there a plan to say, "There are 12 of us, the early bird gets the worm. Sorry if we overflowed, but come back again." Wasn't there a plan?
Tachikawa: It's tough. It's, you know, difficult. What's difficult is...why is it difficult...that kind of thing...right here. Do you want to talk about that? Just a little bit (laughs).
Male Y (laughs)
Nishio: To be frank, this story. Is there going to be a reception? This time. If you're going to a reception, why don't you do it there?
Male X: I would like to.
Tachikawa: Totally good.
Tachikawa: My wife is away for the night today on a business trip to Nagano, so I can do whatever I want.
Man X: You can do whatever you want?
Tachikawa: So what shall we do? You have to explain the rules first.
Male X: Oh, I see.
Tachikawa: It is very difficult to explain the rules verbally.
Male X: 〓00:01:06 〓 who has done it before.
Tachikawa: Oh, I'm sorry.
Nishio: It's okay. It's okay. When you go beyond that stage, it's 00:01:11 〓.
Tachikawa: OK〓〓00:01:12〓
Nishio: Yes, that's right.
Tachikawa: Wow.
Male X: Oh, but I've never done a one-nighter.
Tachikawa:: It was very popular.
Man X: Heh.

Tachikawa: Well, how do you explain it? One of the points I was trying to explain the other day was that I couldn't explain it well. It is difficult to explain the rules of the game.
Nishio: Yes, yes. I will watch how Mr. Tachikawa explains it, so please go ahead.
Tachikawa: Yes.
Nishio: I'll send you some sneaky feedback later.
Male Y: (laughs)
Tachikawa: I've been feeling that way lately.
Man X: Oh, yeah.
Tachikawa: Let's see, in one-night werewolf, the four of us are villagers. We are either villagers with no position, werewolves, werewolves who eat people and kill them, fortune tellers who look at one place and tell what position that person has, or thieves who exchange cards with someone on the previous day and exchange positions. These are the four types of werewolves in one-night werewolf. In a normal werewolf game, the game repeats day and night, day and night, and in the daytime, someone searches for a werewolf and kills him or her. If a werewolf survives, one is killed at night. The objective is to reduce the number of werewolves to zero by repeating this process, but in this one-night werewolf game, there are only two turns, the night before and the next day at noon. If one werewolf is caught, the villagers win. If a werewolf survives, the werewolf side wins. That is the rule. In this case of 4 players, the breakdown is as follows
Nishio: Do you have any questions so far?
Tachikawa: (laughs)
Male X: So it's a guessing game, right?
Tachikawa: Yes.
Nishio: Yes. I don't think we talked about anything about the purpose of the game.
All: (laughs)
Nishio: Before you say anything about differences from regular werewolves...
Tachikawa: Indeed. In the case of four people, because there are four people this time.
Nishio: I don't know who is in which position as these are all handed out.
Tachikawa: I don't know. 4 players use these 6 cards. The breakdown is 1 card for the thief, 1 card for the fortune teller, 2 cards for the werewolf, and 2 cards for the villager with no position. This side is the same team human side.
Nishio: They are blue people.
Tachikawa: This side is the werewolf side. I'm going to cut this. You can cut it or just mess it up. Then I'm just practicing for now.
Nishio: It's a practice.
Tachikawa: I'll put it like this at random, and there are two cards left. I don't know who this is. Everyone looks at their hands like this.
Nishio: Only you know your position.
Tachikawa: I know. I'm going to close my eyes and look down from the situation that I'm in. First of all, I'm going to mouth off a little bit now, but after this, 〓00:05:13 voice guidance so that everyone can participate? 〓 will be used. The first thing to do is to start with the fortune teller's turn. The fortune teller will face up and tell one person somewhere if it is the fortune teller's card. I would like everyone to look up for a moment, though.
Nishio: Let's say you are a fortune teller. I don't think so.
Tachikawa: Then, I look at one of these two cards, here or here or here. And when I look at the card here, I look at both cards at the same time.
Nishio: I can see something.
Man X: Heh.
Tachikawa: Fortune tellers can do that. And when the fortune teller is done, he turns over again. Next, it is the werewolf's turn. When it's the werewolf's turn, only the werewolf looks up to see who is the werewolf, it could be one, it could be two, it could be zero.
Nishio: 2 werewolf cards among 6 cards. In short, there are all cases where there are two cards here, one card, and zero cards.
Tachikawa: So, the werewolf's turn is over. Finally, there is the thief's turn. The thief's turn is when the thief
Nishio: Let's say you are a thief.
Tachikawa: Let's say it's a thief. Then it is from here. You exchange a card from either here or here or here without checking it. After you exchange the card, you check that card to see what you have become.
Male X: Does the thief absolutely have to make the exchange?
Tachikawa: Yes. That's right.
Man X: Oh, I see.
Tachikawa: That is very much the point.
Male Y: Does that have to be changed?
Tachikawa: It must not. The thief must be changed.
Man X: You're a human being.
Male Y: And besides this?
Tachikawa: Yes. It has to be changed. This point is that the thief is the last to move.
Nishio: So after you think you are a werewolf and you look up and confirm that you are a werewolf, this could have been taken this way and changed.
Male Y: I see (laughs).
Nishio: This is bad.
Tachikawa: I get nervous when I become a thief and exchange my card for a werewolf card. I thought, "What am I going to do with this? After the night's turn was over, everyone would look up and we would have 5 minutes to think about what to do.
Nishio: about 5 minutes. We're going to discuss whether the story is suspicious.
Man Y: I see.
Tachikawa: So I am a thief. I am a fortune teller. No, I don't have any position. We talked and talked.
Nishio: Of course there are lots of people who lie because the rules allow them to say anything.
Tachikawa: And at the end of five minutes, we stop and everyone raises their fingers up! And
Nishio: I think it's suspicious.
Tachikawa: Point to someone you think is suspicious.
Male Y: You're pointing at werewolves, aren't you?
Nishio: Who thinks he is a werewolf.
Tachikawa: Point to the person you think is a werewolf.
Nishio: If I thought there were no werewolves at all, I would point to this place.
Man Y: I see.
Tachikawa: If the person pointed at is a werewolf, the villagers win. If it was the villager's side, the werewolf wins. That is the rule.
Man X: Yes.
Tachikawa: The explanation went very smoothly this time.
Man X: Because help is on the way.
Tachikawa: (laughs)
Nishio: No, no. I don't think I have explained it well. I think the first half is too much of a slog. I think I am too lazy, especially in the first half. First of all, let's try it out for the first time.
Tachikawa: Yes. I think this can be done normally. Now, by the way, let's see how the audio will be like.
Nishio: I'll give it a try.
Tachikawa: Yes.
Audio: Night has fallen. The fortune teller wakes up.
Nishio: Well, let's say you are a fortune teller and you do fortune telling.
Man X: Heh.
Nishio: So, I just flipped it over and I'll 〓 later 00:08:44 〓
Man Y: So you can just open it and look at it.
Nishio: Yes, yes.
Male Y: But we know the act of changing it.
Tachikawa: So I will do it while moving it.
Nishio: I'll move all the others.
Tachikawa: Move everything.
Male Y: Oh, I see.
Man X: You're a little touchy.
Male Y: While touching.
Tachikawa: While touching. Otherwise, it would be said that the card is moving.
Man Y: I see.
Nishio: I spoke without asking this.
Voice: 3, 2, 1, 0. Close your eyes. Thief wake up and steal someone's heart. 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0.
Tachikawa: Stealing here will change things.
Nishio: So, for example, you do this. So, you see this.
Tachikawa: That's what I mean.
Male Y: Do you have to do that while I'm counting this?
Nishio: That's right. Basically, if there is information such as, for example, a card moving or a slight rattling sound, the game becomes uninteresting, so we try not to worry about that as much as possible.
Male Y: That's true.
Tachikawa: That's where the night is.
Nishio: After this, there will be a 5-minute discussion time to decide who to execute.
Man X: I'm scared.
Man Y: I see.
Tachikawa: This is a very interesting game, but I want you to think about this game a little bit.
Nishio: MOT-wise.
Tachikawa: I think there are several different aspects. You can look at it from the aspect of how this game is structured in the first place. Or you can look at it from the aspect of how the game is structured in the first place, or how you yourself judge who is a werewolf and who is not. I think that's what I was trying to do in the three times I played the game. After we have done this three times, I would like to have a discussion with everyone using the whiteboard.
Nishio: One important aspect was left out. In MOT terms, this is a dangerous situation in which a team is managed by a person who cannot be trusted in the team by any means. That's what I mean.
Male Y:: That's what you mean.
Male X: Oh no.
Nishio: That. Then it's quite a real experience, and I don't want to experience this in a real company, but this is a game, so I can experience it.
Man X: It's like, someone is betraying you and you're leaking information.
Tachikawa: For example, that is one perspective.
Nishio: one viewpoint. One perspective of the cut.
Tachikawa: It is one of the cut-off points. Yes, it is. I wonder what kind of information we usually receive and judge its truth or falsity.
Man X: Yes, yes.
Tachikawa: I am very much confronted. For example, myself. Well, it's a long time to talk, so let's do it.
Male Y: (laughs)
Nishio: Let's do it. Let's just do it.
Tachikawa: If you go this far.
Nishio: I'm tempted to talk about it.
Tachikawa: I feel like talking about it.


