One Night Werewolf Transcription 2-6
[BMOT One Night Werewolf 2nd]
Tachikawa: I don't know. I can't win at all. I would like to continue.
Voice: Night has fallen. Fortune tellers wake up and choose someone to divine. 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0, close your eyes. Werewolves wake up and look at each other, 5, 4, 3, 2, 1, 0, close your eyes. Thieves wake up and steal someone's heart. 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0. Close your eyes. Close your eyes. Everyone wake up.
Nishio: I may not have to kill Tachikawa-san this time, but I was the thief and I took Tachikawa-san and Tachikawa-san was the villager.
Tachikawa: I see.
Nishio: The claim is that we are both clean.
Tachikawa: You claim that there is a thief here (Tachikawa-san on hand). Here (Nishio's hand) you say there is a villager.
Nishio: Yes.
Male X: Ahhh. If that is correct, doesn't that mean that either or both of them (X and Y) would be werewolves?
Male Y: Or there could be a werewolf here (mountain).
Nishio: Is there a fortune teller among the two of you?
Tachikawa: Do you have a fortune teller?
Nishio: Fortune teller. If you are there, I'm not quite sure how a fortune teller should act. I think you should ask some questions.
Tachikawa: It is a bit risky for Nishio-san to bluff that he is a werewolf and a thief.
Nishio: There is no need to pinpoint Mr. Tachikawa and say that he is a villager all the way down to the lowest probability.
Tachikawa: Yes, yes. There is no reason. That's a little hard to understand, or it's simply unlikely that he's lying.
Nishio: Low. If Mr. Tachikawa is not a villager, it is immediately obvious that I am a werewolf.
Tachikawa: Yes.
Nishio: So there is no need to go to the trouble of pinpointing and narrowing things down like the villagers.
Tachikawa: When it comes down to it, I believe that Mr. Nishio was really a thief. Then there is actually no point in discussing it anymore, Mr. Nishio. If we each point at each other and the two of us point at each other.
Nishio: No, the two of them might align and point to one or the other.
Tachikawa: Because they are both werewolves?
Nishio: Let's leave it at that. You have to convince the other person who might be on the human side which of the two is suspicious, and you still have to determine who is the werewolf, after all.
Tachikawa: In the end, yes.
Nishio: What do you think?
Man X: No, I'm just a villager.
Nishio: So you are just a villager? What do you think?
Male Y: Just a villager.
立川：(笑)
Nishio: Really?
Male Y: I'm really just a villager. Really.
Man X: It was a peaceful world.
Male Y: So what that means is that if you two are right, then you are probably werewolves. Almost certainly a werewolf. This is true, if they are right.
Nishio: Because there are only two villagers. It would be an ex-villager, a villager, and a werewolf.
Man X: Oh, that's what you mean.
Male Y: Yes, I would be a werewolf.
Man X: I see.
Male Y: Maybe it is. So, in the current talk, it probably makes sense. I'm a villager, so the probability that I'm a werewolf is very high. Unless there are two of them here.
Man X: Oh, that's what I mean.
Male Y: Or if this is a hypothetical werewolf as we are talking about now, it should be a fortune teller here.
Nishio: Indeed.
Man X: Sure.
Tachikawa: Oh, indeed.
Male Y: That's right. If this is a werewolf and not a fortune teller, he probably didn't make any statements at all in the story so far.
Nishio: Oh tsunda.
Male Y: Maybe where there is no way to speak up.
Nishio: It cracked me up quite a bit, though.
Man X: No, when I open it, it's like I'm the end of the culprit.
Nishio: I'm afraid the game is over as it is. There is still time. Don't give up yet.
Tachikawa: Totally different story. If Mr. Y were a werewolf, I could say the same thing.
Man X: Yes, yes, yes.
Nishio: The reverse is also true.
Man X: It was something too vivid.
Nishio: Is that so?
男性Y：(笑)
Tachikawa: Completely.
Nishio: I got the answer in your expression.
男性Y：(笑)
男性X：(笑)
Tachikawa: So you got out.
Male Y: I feel like I can't help it anymore.
Nishio: There was also another possibility that the two of them were werewolves, and that they were working together behind the scenes.
Male Y: Not zero.
Nishio: I'm already giving off an aura of not being like that.
Male Y: We were talking about assuming. I was just saying that when you assume, I'm a villager, so that's the only way I'm going to stay.
Tachikawa: 40 seconds to go.
Man X: That's great!
Tachikawa: So you are a fortune teller?
Nishio: Is there any fortune teller coming out here?
Tachikawa: Actually, actually. Here comes out the fortune teller. It's okay, you still have 10 seconds left. But for the first time in a long time, I don't think I'll be caught.
Nishio: Good for you.
Male Y: I don't know. Maybe it is possible that they are talking back to each other.
Nishio: Now, let's talk about catching Tachikawa-san (laughs).
Tachikawa: Oh no. Seven seconds to go. 5, 4, 3, 2, 1. Here we go! Ahhh...
Nishio: By the way, I was honest. I was.
Male Y: Yes. The same.
Man X: The calculation of two villagers had slipped my mind. It was a mistake to say "villagers" so easily. I should have said human.
Nishio: No, no, but you insist that you are the villager, and you are like, "I am sure I am the villager, so he must be lying.
Man X: (laughs) In my own personal truth (laughs).
NISHIO: [Speaking with conviction].
男性Y：(笑)
Nishio: "Huh? Which is it?" This side (Nishio, Tachikawa and others) must have been confused. Because there was nothing to judge.
Male Y: Yes. Yes.
Nishio: Oh, he said he failed.
男性Y：(笑)