One Night Werewolf Transcription 2-2
[BMOT One Night Werewolf 2nd]
Tachikawa: I know my card. Then let's go.
Voice: Night has fallen. Fortune tellers wake up and choose someone to divine. 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0, close your eyes. Werewolves wake up and look at each other, 5, 4, 3, 2, 1, 0, close your eyes. Thieves wake up and steal someone's heart. 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0. Close your eyes. Close your eyes. Everyone wake up.
Tachikawa: Yes. Let's go up for five minutes in the midst of this. Now.
Man X: Well. If there is a thief, there is a possibility that the thief is stealing from someone else, can I open mine to see if that is the case?
Tachikawa: I cannot.
	This explanation, "After the thief takes Mr. A's card, can you check the card?" If yes, then "Can Mr. A check his card, thinking that he might have been taken by the thief?" Then no, so it is ambiguous.
Man X: You can't?
Tachikawa: I don't know what the card in my hand is anymore.
Nishio: Why did you care about that?
Male X: Oh, no, I was a villager, but well, if it had been stolen, the declaration that I was a villager was itself a lie.
Nishio: Yeah, yeah.
Male X: Well, I can only say that I am a human being.
Tachikawa: But even if it was stolen by a villager, it is still a separate villager camp.
Man X: Well, as a camp, yes.
Tachikawa: Then that thief, if he exchanged, would say, "I make the exchange and there is a thief at your place. I have villagers here." I think he would say.
Man X: So that's what you're saying. Then maybe the thief is not here.
Tachikawa: There might be. Are there any fortune tellers?
Nishio: (laughs)
Man X: I'm not a fortune teller.
Nishio: Well, there is a 1/3 chance it could be in the middle. Although it would not be surprising if they are not there. Given the current situation where no one is coming out, there is a situation where the thief and the fortune teller are in the middle. In case you are wondering, this is based on everyone's current activities.
Tachikawa: It is possible.
Nishio: The most.
Tachikawa: It is the most likely possibility.
Nishio: That means there are two werewolves.
Male Y: (laughs)
Tachikawa: Oh, I see.
Man Y: I see. Is that what you mean?
Tachikawa: I think that is a possibility.
Nishio: Yes.
Tachikawa: Definitely no fortune teller here.
Nishio: Yes.
Tachikawa: So, the question is why there is no phantom thief. No, it might be a fortune-telling/thief thief. Maybe it is a fortune-telling/werewolf and maybe it is a thief. The fact that the thief is somewhere but does not appear means that the thief drew a werewolf. Because if he draws a werewolf, he cannot say, "I am a former thief and I drew a werewolf." You can't say that, can you?
Nishio: You would be coming out that you are a werewolf, right?
Tachikawa: Yes. But that person, the former thief, the current werewolf, knows who has the thief's card now.
Man X: I know.
Male Y: Yes, yes.
Male Y: So you're not just talking about coming out about yourself here. So it's just a matter of having a reasonable discussion in the end.
Nishio: Yes, we will discuss for 5 minutes.
Man Y: I see.
Nishio: There is nothing definitive information that can be known from the game conditions. Everyone is only speculating.
Male Y: So you mean.
Nishio: I will do my best to spread speculation that is good for me.
Tachikawa: What's a little suspicious is why Mr. X cared about the thief, and why he's a little silent (laughs).
Man X: I see...
Nishio: It was abrupt. The question of the thief.
Tachikawa: On a contrary reading, I can imagine that Mr. X is a former thief who may have drawn a werewolf.
Male X: I see. Not really.
Tachikawa: It looks that way.
Man X: I see.
Tachikawa: (laughs)
NISHIO: Anyone can say that they don't tell what they know. Unfortunately, it looks like you are hiding things.
Tachikawa: It would appear so.
Man X: I see.
NISHIO: I have to refute it. I have to refute it.
Man X: A rebuttal, huh?
Tachikawa: It looks that way, now. (laughter)
Male X: Going back, Tachikawa-san mentioned the theory that the thief and the werewolf were exchanged, but I don't think we know whether the thief was exchanged for a werewolf or a human in the first place.
Tachikawa: Was the thief exchanged for a human or a werewolf?
Man X: Yes, and there is still a possibility that the thief is still in this mountain.
Tachikawa: Oh, of course. That is, of course. So, without a doubt, the first thing is that there is a fortune teller here. I don't know if there is another thief here, or if there is a werewolf here, or if it is a villager. But really, what if there is a fortune teller/thief here. I'm usually the thief. I would say, "No, I traded with that guy. He was a villager. So I'm the villager." And I'm a villager. But if the thief doesn't come out, one of the possibilities is that he is a fortune teller. Or, if there is a fortune-teller here, the thief exchanged with a werewolf. It is one or the other.
Nishio: I feel like we are a little short on material to determine which is more suspicious this time.
Male Y: (laughs) Sure.
Tachikawa: So I was very concerned about these two people here, but for what it's worth, I thought they were completely interchangeable.
Male Y: (laughs)
Nishio: Yes, yes.
Tachikawa: It's funny.
Nishio: I'm giving you the nuance of feeling like those two are werewolves. Because I almost 〓00:22:55〓 myself just now.
Male Y: Roger. Roger. I see.
Tachikawa: I know you say it's suspicious, but these two are definitely exchanging.
Nishio: Furthermore, it is possible that Mr. Tachikawa is saying that he is a werewolf and is trying to incriminate others when he says he is "suspicious.
Tachikawa: They don't agree or argue, they just listen the whole time.
Male Y: Well, in that sense, I think it would be better for me to see how the discussion develops.
Nishio: Because it's your first time?
Male Y: Yes, yes, yes. That's for sure.
Nishio: I don't know which is which, so I'm waiting for one of them to come up with a rag. So, is it time to go?
Tachikawa: Oh, it didn't ring a bell. It's already over, isn't it?
Nishio: Doesn't it make some kind of chiming sound? That's it.
Tachikawa: It probably rang. It probably should have sounded. I set it on a timer. But it's been five minutes. Then I'll vote.
Nishio: So it's voting time. First, lift your finger up. Then you put it down with a "Yea! And then, you say, "Yes" and drop it. Who do you think is the best?
Tachikawa: Se-no! Yes, 2:2.
Nishio: Two votes, two votes.
Tachikawa: In this case, two people are executed at the same time.
Man X: Oh, yeah.
Tachikawa: If even one of them is a werewolf, the villagers win.
Male Y: Oh, I see. So if they point at you, you are already executed.
Tachikawa: That's right.
Man Y: Oh, okay. I'm sorry. I didn't understand that part.
Tachikawa: Execution.
Man Y: I see.
Tachikawa: Se-no! Ah, the werewolf wins.
	(They were both human).
Nishio: So the werewolf side wins. And I am the werewolf.
Tachikawa: Ah.
Man X: Ahhh.
Male Y: Ahhh.
Tachikawa: So that's how it is.
Nishio: I was the thief and stole Tachikawa-san's werewolf.
Tachikawa: Ah.
Male X: I kind of thought about that possibility.
Nishio: While Mr. Tachikawa said it, he also felt uneasy that he might be the werewolf left behind.
Tachikawa: No, but I thought it was definitely taken. I wondered who the thief would be.
Male Y: Ah~!
Nishio: So, at that convenient time, I was the first to talk about the thief.
Tachikawa: (laughs)
Man Y: Oh, you made me cry.
Nishio: It was like that. I won one.
Tachikawa: I was completely dancing around.
Man X: Yes, that's right.
Nishio: It is a game like that.
Man X: Interesting. Interesting.
Male Y: I understand.
Nishio: Then we continue.
Tachikawa: Okay, let's move on. We can do this quickly and easily.
Nishio: You can do it over and over again. After all, it is better to repeat a game several times to understand it than to spend a long time on one game and finish it only once.
Male Y: Oh, yes. Certainly. That's true.
Male X: The more people drop out, the fewer people will be able to participate.
Nishio: Yes, yes, yes. I'm the first type of werewolf to drop out, and I don't really like it.