Psychological Safety and Learning Behavior in Work Teams
A 1999 paper that mentions a concept called [psychological safety
	Edmondson, A., 1999. [Psychological safety] and learning behavior in work teams. Administrative science quarterly, 44(2), pp.350-383.
	Also mentioned by Google's [Project Aristotle].

>It introduces the construct of team psychological safety - a shared belief held by members of a team that the team is safe for interpersonal risk taking - and models the effects of team psychological safety and team efficacy together on learning and performance in organizational work teams.
	Psychological safety is the belief that the team is safe for "interpersonal risk taking.
	Team members must share this belief in order to be a "psychologically secure team".
	Psychological safety affects team performance through team learning behaviors

[https://gyazo.com/5a095a273e8b13a1fd6e5e902b807fab]

>Team psychological safety is defined as a shared belief that the team is safe for interpersonal risk taking.
	Definition of psychological safety: a shared belief that the team is safe for interpersonal risk taking

>> For team psychological safety to be a group-level construct, it must characterize the team rather than individual members of the team, and team members must hold similar perceptions of it.
	The word is about teams, not individuals

>Team psychological safety should facilitate learning behavior in work teams because it alleviates excessive concern about others' reactions to actions that have the potential for embarrassment or threat, which learning behaviors often have.
	No embarrassment or fear due to activities that lead to learning.

>regressing psychological safety on self-reported team learning behavior shows a significant positive relationship
	In fact, it was found to be significantly related to activities that lead to learning

How was the psychological safety of the team measured?
	survey
	[https://gyazo.com/8bb4289d9d93092bb7d6064f8ddb59cc]
		There is a translation [here https://rework.withgoogle.com/jp/guides/understanding-team-effectiveness/steps/foster-psychological-safety/]
		Some interrogative statements are asked back-to-back.
		This is what happens when you align everything in a positive direction.
   If you make a mistake in the team, you will not be blamed.
   Team members can point out challenges and difficult problems to each other.
   Team members do not reject others for being different from them.
   It is safe to take risky actions against the team.
   It is easy to ask for help from other members of the team.
   None of the team members act in a way that intentionally undermines their own work.
   When working with team members, I feel my skills and talents are respected and utilized.

remarks
	Shared beliefs are cultivated over time.
		It is created by accumulating experience of "how others react to your actions.
		Hard to reproduce in experimental environment

Video by this author
[https://www.youtube.com/watch?v=LhoLuui9gX8&feature=youtu.be]

