Tachikawa-san Communication Theory
2019-01-24 Transcript of a 1.5 hour dialogue with [Tomoya Tachikawa] on [communication] and other topics

 Tachikawa: Mr. Nishio, is this a company Mac?
 Nishio: This is the company's Mac.
 Tachikawa: Only the unexplored ones are put up.
 Nishio: If I receive a company sticker, I plan to put it on, but it's not often that we hand out stickers, especially when we introduce the company's products.
 Tachikawa: Indeed.
 Nishio: He said that there are surprisingly few opportunities to receive them.
 Tachikawa: Do you give them out internally?
 Nishio: I'm sure there are some in-house, if you go and get them.
 Tachikawa: Like it's a hassle to find out where it is.
 Nishio: Yes, I would just put it up if I happened to come across it.
 Tachikawa: There is an in-house hangout, or rather, a place with a water heater and drinks.
 Nishio: Yes, there is.
 Tachikawa: You can find pamphlets and stickers in such places.
 Nishio: I sometimes put them there, you know, the ones from other companies (laughs).
 Tachikawa: Do you have your own company's products?
 Nishio: We sometimes put our own stuff, too, when we have some left over. We make a new one and use this one from now on, but the old one is still there, so we put it here, then (laughs).
 Tachikawa: You don't use it, normally? To go outside.
 Nishio: I don't know, maybe.
 Tachikawa: Isn't it necessary for a new company to say, "This is the kind of company we are," or something like that? (laughs) Isn't that how you do it?
 Nishio: Maybe I should do that.
 Tachikawa: I don't know, Nishio-san, but I think that's what they expect us to do.
 Nishio: I don't know.
 Tachikawa: Isn't that what Mr. Mori and others do?
 Nishio: Well, I wrote "Cybozu" in big letters, and I wrote something like [100 different ways of working for 100 people] here.
 Tachikawa: I think it's good.
 Nishio: It is not easy to understand, because the only information is those letters (laughs).
 Tachikawa: I don't know if that's true. That's what I'm trying to do, create a society where people are connected, something like that (laughs).
 Nishio: I wonder if it would be a topic of conversation if you put a word of your vision here, or something like that (laughs).
 Tachikawa: That's it. I understand. I'll do that next time (laughs).
 西尾：(笑)

 00：02：50
 NISHIO: If there is something, if there is something you want to talk about, I'm listening.
 Tachikawa: Just as I had imagined. I am itemizing, as if there is such a thing. Bullet points of what I have been thinking lately.
 Nishio: I told them in a message that I would write down the bullet points in advance, but they were like, "Go ahead and think about it," and I thought that might be that, so I didn't tell them (laughs).
 立川：(笑)
 Nishio: Each other's thought patterns.
 Tachikawa: Lately, I've been wondering if you have an itemized menu.
 Nishio: verbalization structuring communicating, glad to see it gather, science-based and logical, package is more valuable than process, this last one is not comfortable to speak up.
 立川：(笑)
 Nishio: Aside from that, what is it that makes you happy to see them gather?
 Tachikawa: I was thinking about this yesterday.
 Nishio: If we only use keywords, we don't know what they mean.
 Tachikawa: You are doing SUD at Tokyo Tech, and this is the third year, and every year the number of students is increasing, 7, 9, 13, and just yesterday we had a joint meeting of first through third year students, first and second year students, each with their own connections, so we give them opportunities to get to know each other and get together each term, which is difficult after the program ends. After the end of the program, the opportunities to meet are reduced, but even after the program ends, everyone still comes, even though one or two years have passed. Even though it has been a year or two, more than half of the participants still come to the meetings. It was very touching. I thought, "Wait a minute," and that was the theme of this year's event.
 Nishio: What do you mean by "wait a minute"?
 Tachikawa: I wondered whether this feeling of happiness is a universal feeling, something that everyone feels when 100 people gather together, or whether it is a feeling that surprisingly few people feel.
 NISHIO: I think it is futile, that discussion, because I don't know which one is more, or even thinking about it, regarding the way people feel and feel in the world, and I don't think the discussion will yield any results.
 立川：(笑)
 Nishio: For example, when I give a lecture and there are 150 people who come to listen to it, some people get excited because there are 150 people there and they are listening to me, but I don't get so excited. I would have to spend two hours or so preparing materials for the lecture, and I felt that this was inefficient. I would rather have a deep discussion with 30 or 12 people. This is exactly the case here, where there are only two people.
 Tachikawa: Minimalist (laughs)
 Nishio: So this is what we want to do. It is a meaningless argument as to which people are more proportionally represented in the human race: those who say so or those who are happy to have a large audience. For example, when humanity is divided into the U.S. and Japan, the proportion among each would probably be different.
 Tachikawa: First of all, actually, that is not the main focus of this project, I agree.
 西尾：主眼は何？(笑)
 Tachikawa: My main point is that there are people who feel that what they think is valuable has little value. On the other hand, there are people who feel that what they think has no value to them has great value. I think that I usually don't live my life with much awareness of this fact. I think I usually live my life unconsciously, thinking that what I think is good for me is also good for the people around me.
 Nishio: I tend to assume that values are the same as mine.
 	Related: [Assuming a group of people is homogeneous].
 Tachikawa: Tend to.
 Nishio: On the other hand, exchanges of goods and transactions occur.
 Tachikawa: The value of gold in this area is different from the value of gold in this area.
 Nishio: The fact that I can pay 10,000 yen for something means that the person selling it thinks it is not worth 10,000 yen.
 Tachikawa: For some reason, I think it is worth more than 10,000 yen.
 Nishio: When a company does an IPO, there are people who buy shares at whatever price they say they will sell them for. I feel like, "Why? It's a personal value, and I just don't see the value in it, but people who think they know the potential for future growth better than the managers themselves are buying it.
 Tachikawa: But isn't the software business exactly like that? You are copying software that has been accumulated for a long time in the past and improved little by little with time and money, right? Simply put. What is the value then?
 Nishio: What is value? Quickly on the whiteboard (laughs).
 Tachikawa: From a sensory standpoint, in other words, what Mr. Nishio is saying, if someone sells something that is not worth 10,000 yen to him for 10,000 yen, he would be happy.
 Nishio: I am happy when it is valued higher than my own standard of value. Like, it's surprisingly high.
 Tachikawa: With a sense of concept, what exactly do you think we are paying for? For example, buying a painting, there are many patterns, for example, buying a painting on order. A painting, I have a lot of phrases to paint, roughly several levels. Practice time.
 Nishio: You are saying that it takes 10 years of practice before you can paint a picture in 5 minutes?
 Tachikawa: Yes, yes, this is the place, the time to draw.
 Nishio: The time it takes to implement the order into what was ordered.
 Tachikawa: There were three. Orders and so on.
 Nishio: There are about three types of patterns in how the pictures are taken. There are those that are ordered and painted, and those that are made and later sold.
 Tachikawa: What is already there.
 Nishio: [Ready-made](ready-made).
 	[Ready Made | Dictionary of Contemporary Art Terms ver. 2.0 http://artscape.jp/artword/index.php/%E3%83%AC%E3%83%87%E3%82%A3%E3%83%BB%E3%83%A1%E3%82%A4%E3%83%89]
 Tachikawa: Buy certain things, and also become a patron.
 Nishio: Become a patron, I see. These three are, from the point of view of the buyer, there is the pattern of ordering your own order and having it drawn and then buying it, there is the pattern of buying products in a line, and there is the pattern of finding a person, and patronizing that person.
 Tachikawa: For example, I think there are lots of them, they buy the same picture, but they have different time spans. Patrons are easy to understand, they buy this time as well.
 Nishio: I buy everything from time to practice.
 Tachikawa: I wonder what people mean when they say they buy something that is already there. I don't think it's the time to draw. Think of a motif. I think they think they are buying something here. They are probably buying with that intention.
 Nishio: How is it actually done?
 Tachikawa: It is hard to say what the actual situation is. In fact, fundamentalists say it is actually like this. He is like an art fundamentalist.
 Nishio: If that includes time for practice, then it should be bought for a price that includes time for practice, he said.
 Tachikawa: The argument is that what I just drew here in 10 minutes is not a 10-minute hourly rate. That is correct. However, when the person who is paying for the work insists on it, there is something that doesn't quite add up. Because it's 10 minutes.
 Nishio: It took 10 minutes to draw, what value do you feel for something drawn for 10 minutes? It is strange to measure it by time, isn't it?
 Tachikawa: To begin with, time has nothing to do with the painting itself, because the value of a painting is the painting's value. The value of a painting is the value of the painting.
 Nishio: In terms of the value of a painting, there was a time when you could sign a ready-made urinal and call it a work of art, because the value of a painting is ambiguous to begin with.
 	The [Duchamp Fountain].
 Tachikawa: Don't you think the exact same thing can be said about software?
 Nishio: Can you say? Are you paying including the time spent on development?
 Tachikawa: Yes, especially for the initial users of software, they are buying expensive software. I think there is a strong aspect that they are also buying the time involved in the development process. However, the more the software spreads, the lower the price becomes, and at some point, people start talking about making certain software free of charge.
 Nishio: First of all, I have some doubts about whether "the price of software gets cheaper as it spreads," and there is a structural difference in that, unlike pictures, software is usually purchased for a specific purpose and no one buys software for the purpose of owning it. On the other hand, I think it is the same composition that in order to create software, there is time to think about what kind of software to create and the motif, and of course there is time to study before tapping the keyboard and implementing the software.
 Tachikawa: Customers are software, no matter at what point or how they buy it, software is software as it is. But there is a big difference in where the customer subjectively pays value for and subjectively perceives it.
 Nishio: It's hard to understand if you are the type of person who makes and sells software, but from a SIer's point of view, when you develop a system to meet a customer's needs, the customer's actual operating hours are the same as the system's operating hours.
 Tachikawa: Yes, yes.
 Nishio: They want to pay only for the writing part, the part of creating the 〓00:15:19 〓, and the part of thinking about the motif, because then there is an incentive to accumulate a lot of practice, and the opposite incentive to invest in the part of practice, For the time being, the incentive is to gather a large number of people who are not bad, rather than to gather a large number of great people who have learned a lot, and this is rather disastrous.
 Tachikawa: There is a quote from the president of my part-time job when I was a student that really impressed me. It was amazing. I was so surprised. He once told me, "Tachikawa-kun, you should make better software than Excel, which is free. I was once told, "Make a better software, not a free one like Excel. I thought it was a great quote.
 Nishio: Excel is not free. How much do you think it costs?
 Tachikawa: He told me with a straight face to make something better than Excel.
 Nishio: Were you a student worker then?
 Tachikawa: I was in the second year of my master's program.
 Nishio: I believe that a student part-timer with a 2nd year master's degree can make something better than Excel. Because Excel is free.
 Tachikawa: Yes. I was surprised. It was the president of a construction company. With a straight face, I said, "What are you talking about? Excel is top-of-the-line software. When I told him that Excel is the most advanced software in the world, he said, "What are you talking about? I don't know what you mean. He got mad at me.
 Nishio: In the end, there is a discrepancy between the two of them as to what that finest refers to and what they mean by good.
 Tachikawa: Because if I start explaining that politely, again, my face gets more and more grumpy.
 Nishio: I understand, I can see that, even if you tell them that the two of them have different values, it does not lead to a relationship between the student worker and the president, in which they acknowledge each other's values, even though they are different. I don't think that's what you're supposed to do in that situation. So [the definition of good is different].
 Tachikawa: One is.
 Nishio: Excel is a highly versatile software that can satisfy the needs of hundreds of millions of people by itself, and can be distributed to a large number of customers, and can be used, for example, to make products on graph paper. And yet, it was also amazing that the data was not lost that often, and that it worked fairly stably. But that was not what the president was looking for. He wanted software that would understand his needs and scratch his itchy back, not a variety of tools.
 Tachikawa: That's right. I was surprised and shocked to think that there are people who see the world that way.
 Nishio: They are there. We find value in versatility because we are, after all, people who find value in making and selling products in a versatile way, [and] most people in the world are only interested in whether their needs are met.
 Tachikawa: I was surprised when I talked about this, because I still remember that story from about 10 years ago. It was too shocking. I learned a lot. That's how I think of people. This president is a graduate of Keio University, so he must not be a stupid person. He must not be a stupid person, but when he said that, I thought he was serious.
 Nishio: Yes, surprisingly, smart people who are unfamiliar with IT have more unexpected values than we think.
 Tachikawa: Yes, perhaps it is more troublesome for people who think they are clever and not IT-savvy than for those who think they are stupid and not IT-savvy.
 Nishio: I think it's tricky, because they have so much confidence.
 Tachikawa: I am saying the right thing.
 Nishio: I can't admit that my ideas are wrong, no way, I can't admit that the student worker has the right values.
 Tachikawa: He said something like, "I think you should stop this habit of immediately refuting me like that" (laughs).
 NISHIO: In the end, since this is a difference in values, he could not show evidence that he was right by arguing, so he used other means to show that he was superior.
 Tachikawa: Going back to the topic, where do you pay for software? You don't do calculations like, "This engineer has practiced for 10,000 hours, so how much is that?
 Nishio: Whether you have practiced for 10,000 hours or not, that's the difficult part. In the end, the skills of engineers are hard to observe, [information asymmetry]. So, in order to [signal], in order to sell yourself at a high price, one way is to take a certification exam, for example, by the IPA, or some kind of Oracle master, or something like that. One way to do that is to take a certification exam, such as IPA's or Oracle's, or some kind of master's degree, and use that as a signaling tool, or another way is to talk a lot at events and increase your presence. In the end, if you don't do that, the obvious thing happens, even if you have useful skills, you can't usually observe whether you have skills or not, so payment is not made. It's a lemon market, right, and they will pay the lower price.
 Tachikawa: What is the lemon market?
 Nishio: Lemons, due to the asymmetry of information, you cannot tell whether a lemon is sour or not until you buy it, and in such a case, you buy it thinking it will be a sour lemon. The people who pay for lemons are only willing to pay a low price, and this phenomenon occurs.
 Tachikawa: It's very much the same with marriage agencies; customers only pay here.
 Nishio: That is, there is no way to see or measure the level of marriage counseling skills or practice. I have no idea if marriage counselors are really good enough to be people to consult with. For the most part, everyone thinks they stink.
 Tachikawa: I think so, I wonder what customers base their decisions on.
 Nishio: It is difficult to make a decision to pay a certain amount of money and consult with them.
 Tachikawa: I think everyone is, pseudo, replacing the practice part with age. To some extent, I think people around 50 years old are selling the highest.
 Nishio: I think it's enough to ask for advice. On the contrary, if someone says he/she is a 23-year-old marriage counselor, he/she would not be trusted at all. But in fact, there are definitely 23-year-old students who have more sense than a 50-year-old man.
 Tachikawa: They are definitely there. But it definitely won't sell. You have to be very creative in how you sell it. It's like you don't know if it will sell even if you devise a way to sell it.
 Nishio: If it doesn't sell, it's so much better to have a consulting uncle at the front desk to give direction to the back. Rental uncle interface
 立川：(笑)
 Nishio: I would have the rental guy sit there and listen to the story, and then I would do the story behind him, and then I would tell him to listen to this story in the back.
 Tachikawa: I am quite comfortable with the "rental uncle" interface. There are many cases where such an interface is needed in business. But it needs to look like an uncle, and it needs to be dignified.
 NISHIO: Dignified, or maybe someone who seems to have lots of life experience, but is kind enough to listen to me. I am not sure if I want an uncle, I am doubtful, and I would prefer an auntie.
 Tachikawa: It seems that people believe what their grandmothers say. It seems that the most trusted person, when separated by age and gender, is the grandmother.
 Nishio: I see. I understand, but I was thinking about my future and groaning a little, wondering if my grandfather would not be trusted.
 Tachikawa: In the first place, women on the whole are trusted, and among them, grandmothers are said to be especially trusted.
 Nishio: I am wondering if the women are doing something that is credible as a fact, or if we are somehow being down-estimated. It is a possibility, isn't it? Somehow, we tend to perceive women as being better when it comes to communication with others, which may actually be superior, or it may just be that men are being unfairly discriminated against.
 Tachikawa: I know, there, swamp again.
 Nishio: I don't know, and let's not do that because it will cause a flame war.
 Tachikawa: (laughs) How did we get into this conversation?
 Nishio: On the subject of perceived value, the value you think you have and the value others think you have are two different things. When something sells, the other person perceives it as having a higher value than you do. In relation to this story, there is a saying that says, "Concentrate on your strengths. The reason for this is that I take it for granted. However, I have found that people who are not me unexpectedly appreciate what I take for granted. I think this is a signal of strength. If someone says, "I want to do a side job," it is not a good idea to do a side job that anyone can do, such as buying blog posts for a certain number of words, because it is not a strength of yours. When I say, "What are your strengths? What are your strengths? At that time, I asked, "Have there ever been cases where you did something because you liked it, but the people around you were very happy with it? I think that's the same thing. In the same way, there are times when you think your activities are worth this much, but the people around you think they are worth much more. This is personally very disappointing, but the programs I write are not valued as much as I think they are.
 立川：(笑)
 Nishio: A bombshell. The commentaries and explanations I write are overwhelmingly appreciated more than the programs I write are appreciated more than I think they should be. People say that I am easy to understand, or that I have a talent for explaining things in an easy-to-understand way. However, when I understand and output my work properly, I feel that I can do this, and that people just don't understand it properly.
 Tachikawa: I, the story that links to the story written in Mr. Nishio's Technology Supporting Coding, that is, if we force ourselves to name it, it is a meta-program.
 Nishio: I don't know what the term "meta-program" means, can you explain what you mean?
 Tachikawa: In essence, what makes programming is the thought process. I believe that Mr. Nishio has an advantage with regard to the design and development of that thought process.
 Nishio: Design and development of a thought process, a way of thinking?
 Tachikawa: It is exactly the way to think. In other words, why is this process written in this way in this programming language?
 Nishio: In this kind of situation, this kind of software with this kind of functionality and this kind of language is more suited for this kind of situation. This kind of implementation is more efficient for this kind of calculation. That is exactly the same as understanding the computer architecture, the data code, and thinking that if you are going to do this kind of processing with this data code, you should use this kind of algorithm, but rather than me doing that to the computer and creating it, I am doing that to the human being. I wrote a program, a verbalized version of it, using the brain circuits I use for programming computers and applying it to humans, and when I say there, a program is a Japanese description of how humans should think. For some reason, that natural language is more highly regarded in the world.
 Tachikawa: Indeed (laughs), quite a reputation.
 Nishio: My 〓00:28:36〓 is a program, isn't it? Why, yes, it is. It's strange.
 Tachikawa: Indeed, Mr. Nishio has been evaluated in the area of natural language.
 Nishio: My "technology that supports coding," which is output in natural language, is something that I have been programming in computers, some so-called CPU programming, some so-called non-Neumann architecture programming such as FPGA, and some slightly different programming that is made of a collection of related declarations. When I started supporting coding, there were still various languages, and I think I was at the stage of writing sentences that were abstracted from those various languages, but that was the turning point, It began to become clear that the natural language explanations I produced were more highly regarded than the programs I produced.
 Tachikawa: From Mr. Nishio's point of view, I think he was unwilling.
 Nishio: I am unwilling. I want to make programs, too. To be honest, I am not very good at communicating with people, so I would like to stay in the mountains and write software that I like, and if the software sells well, and if there is enough money to live on, then I would like to stay in the mountains and live without communicating with people. I want to live as a recluse without communicating with others. There are novelists, you know, who build model trains and play with them where they have withdrawn. He is famous, but I can't find his name. (PS: [Hirotsugu Mori, https://ja.wikipedia.org/wiki/%E6%A3%AE%E5%8D%9A%E5%97%A3#%E8%B6%A3%E5%91%B3]) I thought he was that kind of person, but he communicates unexpectedly and understands human beings through the analogy of a computer. So, human architecture, human thought processes, programs, operating systems, and communication between humans and humans are all protocols, all computer analogies.
 Tachikawa: I was rather like explaining that protocol of humans from the analogy of computers, and it was well received by some. Yesterday, I had Mr. Nakayama talk about it. The reason I learned about this course was that there was a person named Mr. Nishio, who invited me, and he said that there was a science-oriented, logical, and asperous marriage counselor (laugh), which was quite a shocking punch in my mind. (laughs) It was quite a shocking punch in my mind.
 Nishio: I don't remember if I said asspel, but I think you and I are kindred spirits, or something like that. I, too, am not what you call, an average developer. He said, I'm not a typical developer, leaving aside Asper or ADHD or whatever.
 Tachikawa: I didn't realize I had ADHD until I became an adult. Even now, I am aware that I have ADHD. But as for Asperger's, I am not really aware of it. So, if it's true, I must be serious (laughs).
 Nishio: I don't have the circuitry to understand Asperger's, not whether it is pathological Asperger's or not.
 The point is that the protocols are different, the communication protocols between aspergers and the communication protocols of the typically developed are different, and the problem is that the aspergers who have problems only have this circuit of the asperger communication protocols. Some people who originally had difficulty because they did not have it, but later, through learning, managed to emulate the general-person communication protocol and are doing their best to do so. On the other hand, there are people who did not have this circuit so much, who originally had this circuit, but it was not so hard for them, and they are able to communicate without major problems, and people who originally had this circuit, but are now able to understand Asperger's, and have good communication skills. The other is a person who used to be this way, but now understands Asperger's and has good communication skills. There are also people who are able to accept that there are other people in the world who think like them, and are able to communicate in an eminent manner. So, as far as people here are concerned, the bottom line is that they have a high ability to see people who are operating in a different architecture than themselves. This is different from having emotional cognitive abilities, because I think this is an emanation ability.
 Tachikawa: I think the reason I didn't fit in at the company was probably because my eminence was weak. I didn't understand what my bosses and seniors were saying, and they probably didn't understand what I was saying either.
 Nishio: I don't have any information on what kind of interaction was going on at the time of the story that you say you didn't understand, so I feel a little bit like I don't really know which one it was just from that story, but rather, it was how it was when you were a child before joining the company, like five years old.
 Tachikawa: For my part, from the time I can remember until I was in junior high school, I thought that everyone around me was an idiot. I took it for granted that everyone could not communicate with me. Isn't that a terrible idea? I thought that since everyone was dumber than I was, it was only natural that I couldn't communicate with them, and that I shouldn't feel stressed or complain about not being able to communicate with them.
 Nishio: I see, you recognized that they were people who could not talk to each other.
 Tachikawa: Isn't that bad, quite a bad character. After high school or so, I finally realized that it wasn't something like that, but that I finally understood my objective position, and that not being able to understand what was being said was not a one-dimensional story, but an n-dimensional story.
 Tachikawa: At first I thought that whether I could understand or not was one dimension, so I thought that there were people who could understand my thoughts, and of course I could understand them best, so when I was at the top and people who did not understand my thoughts were at the bottom, if I put one dimension between whether I could understand or not, then of course I would be at the top. I think that's what all people do. I'm talking about all people, of course, but they don't realize it. On the other hand, as you progressed, a generalization occurred that you understood that this is a situation where there are a lot of things that are hard to arrow, so for each person, there are people who are easy to get through and people who are hard to get through. As a developmental process, you have a broader perspective, that kind of thing.
 Tachikawa: Well, I don't know if I'm the smartest or not, but I think everyone has their own 〓00:36:00〓, and I think it's something that changes at some point in their development. I think that sense of omnipotence was a bit morbidly strong.
 Nishio: I don't know what's pathological. It's common for children to feel omnipotent.
 Tachikawa: It was really amazing. I seriously thought that everyone was an idiot except me. It was terrible.
 Nishio: In that sense, by the way, did you go to cram school when you were in elementary school?
 Tachikawa: I started going to cram school when I was in the fifth or fourth grade of elementary school.
 Nishio: What did you think of the people in the school?
 Tachikawa: I was able to study reasonably well. However, even though I could study well, there was really no one who could give me new or interesting perspectives. It wasn't until I was in junior high school that I finally began to find the stories of college students who worked part-time interesting, and from there I realized that some adults had interesting ideas.
 Nishio: I realized that I was not alone and that there were many other interesting people.
 Tachikawa: Then, when I entered high school, there were so many people there that I finally realized that the world I was living in was very small, and that the people I had looked down on in elementary and junior high school were not in that kind of positional relationship.
 Nishio: I think in hindsight that they must have known more than they did.
 Tachikawa: Yes, I realized it when I was in high school, not now. But I really was that kind of kid in elementary and junior high school.
 Nishio: My story is quite similar and different in some ways. I, for example, had difficulty talking to those around me when I was 10 years old or younger. It was really quite difficult to communicate with my elementary school classmates, but I could have a conversation with my parents.
 Tachikawa: I was the same way. My father was almost the only person who could make it.
 Nishio: In my case, it is not that the people around me are stupid or anything like that. I don't understand. I also felt sorry that they broke the piggy bank I had made for my summer homework. I was writing down the results of my experiments in my notebook, and some people wrote poop on the top of my notebook, and I was like, "I don't like it, there are strange people here.
 Tachikawa: I'm amazed you didn't lose your mind.
 Nishio: The turning point for me was when I entered a cram school in the fourth grade of elementary school. This is what is called a cram school that allows students to enter a preparatory school. When I went there, I don't particularly remember that the people around me were interesting, but the classes were very interesting. I take classes there. And then I entered Nada Junior High School.
 Tachikawa: I don't know Nada Junior High School, or I only know it as a name. It seems to be a great junior high school.
 Nishio: In my interpretation of Nada Junior High School, one-third of the students are very serious and can study, one-third are weirdos, and the rest are people I don't know how to describe, but they are fairly smart by the world's average.
 Tachikawa: One of the leading schools in Japan.
 Nishio: In terms of the prevalence of, say, Asperger's, which is normal in this one-third or so that we are drawing, it would be one or two in a class of 50 students, and I think there were definitely double digits in Nada, even if you think about it roughly. I am sure there were double-digit numbers at Nada, so there was a tremendous amount of them.
 Tachikawa: People who live in society there with Asperger's feel very comfortable communicating with other Aspies, don't they?
 Nishio: Poor people who live in a place where there is only one Asperger's student in the class, their self-esteem is damaged. But fortunately, about one-third of the class has Asperger's, which may be an exaggeration, but there is a large percentage of Asperger's in the class, and when there are that many Asperger's around, there are people who have a high tolerance for the existence of Asperger's, And there are people who have a high tolerance for Asperger's, such as teachers. Because they were in such an environment, their self-esteem was not damaged. People with high Asperger's tendencies who were in this group entered the math department of Kyoto University, and they went on to do what they wanted to do in their respective fields, and even though their way of thinking was quite different from the average, they were still valued for that, and they were able to live their lives. That's a happy vision. Fortunately, I am an Asperger's sufferer who grew up in a greenhouse like this without withering away under the blizzard.
 Tachikawa: Most people are probably exposed to the elements at some point in their lives. I don't know if it is after entering university or after joining a company, for example.
 Nishio: I think the timing of my exposure to the withering of the trees is probably after the completion of the unexplored area.
 Tachikawa: What kind of that thing is that, what was your status at the time, a student? Or a working person? How old were you?
 Nishio: After the completion of the MIZUKEN, there was a group work session in a class at Nara Institute of Science and Technology University, but I didn't fit in.
 Tachikawa: I'm dyed in the wool of unexplored protocols.
 Nishio: Rather than being steeped in unexplored protocols, it's more like, "I think this is the way to do it. I have a track record. I don't understand your opinion. Isn't your opinion wrong?" Without realizing that this may hurt the other person's pride and create an emotional backlash. That's why it's serious ... more serious than Mr. Tachikawa's. It's more serious than Mr. Tachikawa's. I years, Mr. Tachikawa is in high school timing, right? That is occurring at the timing of graduate school.
 Tachikawa: Oh man (laughs).
 Nishio: I skipped a grade and came here.
 Tachikawa: It's a bad one (laughs).
 Nishio: The reason is that, compared to a child who simply has a sense of omnipotence, I did not have a sense of omnipotence, but somehow, I think this is the way to do it. I was not saying that I had an omnipotent feeling, but I was saying that I think this is the way to do it, and I was not saying it with logic, but there are people who resist somehow, and I could not read any logic in why they are resisting. Now I can see, they are working with their architecture. For example, for the 〓00:43:36 〓 to be undermined, I was very emotionally repulsed, and now I understand, but I didn't understand. Even if you are a senior, even if you are a teacher, they said I think you are wrong. That's tough.
 Tachikawa: That must be hard (laughs).
 Nishio: So after this, there was a life course of failing to find a job and a course of succeeding. This was a close call. I was interviewed for a job at NAIST, and I was asked to "diagonalize this matrix" and "What? I was fine with that, but if I had done the same thing at a job interview, I probably would have been rejected in many cases. I was lucky that Mr. Takesako invited me to Cybozu Labs, which had just been established at the time, and asked me if I would like to apply for a position with this company. He was an interesting person, and fortunately, one of my seniors at NAIST invited him to speak at a technical conference because he was an interesting person. I also blog openly without worrying about Asperger's or anything like that. I blog about what I have researched technically, and anyway, there is a large amount of information and output when I put it in a list. So I put that list on my application and submit it.
 Tachikawa: When you have an opportunity to make a presentation, you don't have to make a new one at all, you can just pull it from there.
 Nishio: No, I was just creating new things. At the time, I didn't have anything in particular in mind, so I was making presentations and other things to coincide with the presentation period, and thinking about what I could do that would be new and interesting, like, "Okay, let's do this. That's what I was doing. As a result, I became a "person who has tried a wide variety of things and has a track record of presentations. We were lucky that this was the case and that we were hired. After that, you have a nonconformity, to society. I wondered what work was all about. I had a lot of trouble, and it is very difficult to explain in one word, but one thing I understood was that I had submitted my computer graphics work to an art competition and won a prize there, and that the target of evaluation was not limited to the company. I have come to a place in my life where I do not have to worry about whether or not I am evaluated by a specific place, because there are many people here and there who evaluate me.
 Tachikawa: That is quite a breakthrough.
 Nishio: Yes, and as a result, I made the decision to go to Tokyo Tech for MOT, despite the president's opposition.
 Tachikawa: By president, I mean the president of Cybozu Labs.
 Nishio: The president of Cybozu Labs was against it, but I said I wanted to go, and I did go to MOT.
 Tachikawa: That's a good turn now, isn't it?
 Nishio: I was lucky that things took a turn for the better after that. I think there were scenes here and there in each branch where my life was ruined afterwards.
 Tachikawa: There is, in fact, this, after this, it was good because this is what happened, but if this part, this part had stopped (without the breakthrough from maladjustment after joining the company by winning the art contest), it would have been a failure.
 Nishio: Yes, I might have concluded that it was a mistake to join this company after being invited. As a result, I am living with great enthusiasm now, so I am happy with the outcome, but only when I die will I know if my life was good or not. This now might actually be a failure.
 Tachikawa: Indeed, but I think it is important to live with enthusiasm when you are in your 30s or so (laughs). I think it is quite difficult if you cannot live your 30s and 40s with enthusiasm. Of course, things may change from there, but I think it's time for us to start living in our 30s and 40s with a lot of enthusiasm.
 Nishio: In theory, even if you start at the age of 60, you have 20 years to go until you reach 80. What is more serious is that during the 60 years before that age, if you have a sense of learned helplessness, a sense that you will not do well even if you try, then when you run into obstacles, you will avoid them instead of trying your best to overcome them. If you avoid it, you will never have the experience of breaking through. #Pessimistic misconception
 Tachikawa: That's right, so the sense of meaningless, groundless omnipotence we had when we were young is, in a sense, an engine, and if we don't use it well and get to where we can go first, we will suffer afterwards.
 Nishio: When launching a rocket, there is an engine used for acceleration.
 Tachikawa: We disconnect them at some point (laughs).
 Nishio: It disappears, maybe it becomes physically difficult or something, and it becomes a bit of a fetter.
 Tachikawa: I think it's pretty much a matter of feelings, but it's a difficult story to overcome because it's a matter of feelings. That part is quite difficult.
 Nishio: I think the issue of feelings is very important, because it is the theory of feelings that makes people act, and the issue of feelings is the source of all problems.
 Tachikawa: Yes, it's a matter of feeling, THAT'S ALL.
 Nishio: In the world, there are many life hacks such as tools to improve productivity, but the most important thing is to motivate yourself before that, and if you are not motivated, it does not matter what tools you use.
 Tachikawa：The current talk about reducing overtime work is not going to happen unless there is a strong motivation to reduce overtime work in the first place. As for living overtime, there is a rather strong motivation on the part of the workers.
 Nishio: I have a strong motivation not to reduce it.
 Tachikawa：Working until around 7:00 p.m. and going home is nothing but a pain for young and physically fit employees. If they were paid overtime, they would want to do it.
 Nishio: If you take the Tozai Line at 5:00 a.m., you will die, and the train will be packed. If we do it until around 8:00, the trains will be running late, so we might as well do it until 8:00.
 Tachikawa: Working past 7:00 p.m. is sometimes fun, isn't it? I don't know why it is fun.
 Nishio: Do you enjoy working around 7 pm?
 Tachikawa: Maybe it's not time.
 Nishio: Like when it gets dark and quiet. Like from your experience when you were playing games?
 Tachikawa: There are people who seem to get excited. On the contrary, such a person may not be working at all in the morning. What were we talking about?
 Nishio: Returning to the question of whether or not each of the two people have Asperger's, we are talking about the ability or inability to communicate.
 Tachikawa: Let's say we both have Asperger's, hypothetically speaking.
 Nishio: "There is a tendency to do so. I think it is not good to give a name to a disease based on amateur judgment, since it is a name attached to a disease with proper diagnostic criteria. I don't think it's a good idea to give it a name based on layman's judgment. There is definitely a tendency.
 Tachikawa: Since we are prone, how did we acquire the protocols with society? If we can verbalize the process of acquiring the protocol, I think there are many children who can be helped by it.
 Nishio: There are people out there, just like we used to be.
 Tachikawa: Yes, yes, I didn't fit in.
 Nishio: If we can understand what is meant by a typical developer protocol or a typical developer architecture, we will be happy.
 Tachikawa: I think such a story would be very valuable to society, because, I mean, is this something that will be made public?
 Nishio: Check before you publish.
 Tachikawa: One of our clients had Asperger's disorder. He was very aware of his lack of communication skills and had spent his entire life not fitting in with his surroundings. But he is a very good learner. Every time I meet with him, I ask him how he thinks women feel when he says something like this. I don't give them the answer, but we think about it together. That's just basic, like, "Hey, do you want to get a cup of coffee? When a woman says, "Would you like to have a cup of coffee?" on a date, the woman drinks coffee, which means she is going into a coffee shop, which means she wants to sit down now, she has that kind of motive, something like that.
 Nishio: Like, I wonder if my feet hurt.
 Tachikawa: You said you need to do the conversion.
 Nishio: Like, what shoes are you wearing, they were high heels, sorry for taking you around. That kind of thing, right?
 Tachikawa: That is a natural protocol from those who have acquired it and can do it quickly, but from those who don't have it.
 Nishio: I heard that whether you understand how women feel or not, or whether you had a sister or not, has a huge impact on you.
 Tachikawa: The presence of siblings is a good way to practice communication. We did that kind of thing incessantly. As a result, that person improved a little bit.
 NISHIO: So it's a skill that can be learned. The protocol for the typically developed person, which in that case might be the female protocol, is a skill that can be mastered to think about what it would be like to live this way.
 Tachikawa: A pretty old man learned it well. I was impressed that he could make it in time.
 Nishio: It is not a hardware nuance, but a skill that can be learned.
 Tachikawa: Moreover, even as an adult, it is possible to learn in a pseudo way. That was a successful experience for me. I think there are a lot of people whose lives will be enriched by this process.
 Nishio: I think there are. Especially like us in the past.
 立川：(笑)
 Nishio: In the area of how I mastered it, during this period when I was troubled and bewildered after joining the company, Kuchii and I were having a serious philosophical debate until late at night. I don't remember the specifics of our discussion now, so I'm just calling it a philosophical debate, but in short, we talked about what people are, how they think, how they act, and so on. Our values were very different. We had a philosophy and logic component, so we delved into the logic and understood that there was a difference in the hypothesis we both accepted as a working hypothesis, and that our axiom systems were different. We had a serious discussion about how we could construct the same thing if I were to adopt your axiomatic system. I don't think it was for educational purposes, but as a result, I became an emulator for Mr. Kuchii, and he became a very useful tool for me. By having each other as emitters, we were able to create a link. A very efficient communication channel was created.
 Tachikawa: In other words, emitters are never one or the other.
 Nishio: Communication is more efficient when both parties have the other's emulator in each other's mind. This is because they are almost the same person. Although they have different knowledge, they share a common mind in terms of thoughts, as fused personalities. This is as an explanation.
 Tachikawa: I like the fusion personality. In a fusion personality, you can have a virtual partner's personality by having emitters of each other's communication protocols. In this way, they can act as if they are one personality, when seen from the outside.
 Nishio: When you say "behave as one personality when viewed from the outside," you are referring to a third character. To be more specific, let's say there is a certain project that Mr. A and Mr. B are working on, and for this project, Mr. A is usually at the wheel. However, when information or questions come in when Mr. A is not available, Mr. B cannot make a judgment himself, but he can emulate Mr. A's thought process and think, "I think Mr. A has this intention and is doing this, so I think he will produce this output for this input. Then, I send an e-mail to Mr. A asking if this is correct, and Mr. A responds to the input to the project with something like, "Yes, but I would like you to do something extra here. I can respond to the input to the project. This is a true story, but it happened just the other day.
 Tachikawa: Hearing that, I remembered the e-mail I sent to Mr. Nishio at the very beginning asking him to give this kind of lecture. Looking back on that one, I think the hypothesis was way off, but anyway, if you build up hypotheses in different places, it becomes observable what is different and what is the same.
 Nishio: Certainly, when I received the e-mail with the hypothesis that there must be such and such a pattern as a result of analyzing this lecture, I myself did not agree with the hypothesis, but this kind of analysis is what I wanted to do, and my personality feels value for it, and it's like, oh great, I was like, "Oh, that's great.
 Tachikawa: At the time of that e-mail, I heard that Mr. Sirota was a little bit upset. I thought, "Nishio-san probably likes this kind of thing.
 Nishio: I really appreciated that e-mail. There is, after all, some kind of architectural difference between us and Sirota-san, and when we have a very efficient and mutually happy communication pattern or event method, it does not necessarily make everyone happy, and there are people with different values in the world.
 Tachikawa: That was quite an impressive event. Looking back, I think it was good that I wrote with a drastic hypothesis at that time, instead of a strange and ordinary e-mail.
 Nishio: If we had received a normal request, we would have made a normal announcement and that would have been the end of it once and for all.
 Tachikawa: It is strange, isn't it? That's my premise, and the information was so big, like, Mr. Kuchii is the one who says it's interesting.
 Nishio: After all, the members of that area are of the same family.
 Tachikawa: So, I can hypothesize that it would be better to say it this way.
 NISHIO: On the other hand, I'm not sure if Mr. Kuchii is really a kindred spirit, or if Mr. Kuchii is a stereotypical developer, a protrusive type.
 Tachikawa: I don't know (laughs).
 Nishio: This is because he is too good at mastery and can really perform the typical developer protocols at a higher capacity than the typical developer, even though there is some evidence to believe that it is this way (pattern of atypical developers mastering the protocols of typical developers).
 Tachikawa: The assumption is that there is probably a very high probability that this (pattern of atypical developers learning the protocols of typical developers) is the case, but there are just some things that we can't say. Gray as close to black as possible (lol).
 Nishio: In short, due to overwhelming skills in understanding others, the learning is so advanced that it is no longer possible to tell how it started out.
 Tachikawa: Yes, yes, there you can't tell. I can't tell the difference. He really looks like he reads SPA Weekly or something.
 Nishio: Barely, instead of reading the weekly SPA, at least, if it were this time of the year, I would have gone to the pachislot. He is someone who can talk about sex work and things like that on a regular basis in order to get along with people in the physical labor field. He's a super person who can learn to the point where he can really understand the other person's interface, what they are interested in, and then he can talk about what they are interested in. So it's a type of person who is no longer, I don't know, what the initial values were at the beginning of this birth. On the other hand, maybe the reason I developed such superhuman skills of understanding others to such a degree is because I recognized from childhood that the people around me were different from me, and I waved that I had to understand them.
 Tachikawa: The great thing about Mr. Kuchii is that he made a rather early decision that we had to understand. I think we have grown to adulthood in the sense that we don't have to understand.
 Nishio: I don't understand, whew, and I got to the point where I got a job.
 Tachikawa: (laughs) I think it's great that you retain that much, though.
 NISHIO: That's why I did it this way all along.
 Tachikawa: The most important thing that came out of today's discussion is that there is tremendous value in the process by which so-called non-typical developers, whether adults or children, can learn the thought process of a typical developer. And to be more precise, there is a debate about whether a person is a typical developer or not, and people have several communication protocols, which combine to form their individual thinking habits.
 Nishio: If you try to draw a line based on whether a person is a typical developer or not, you will definitely get into trouble, so instead, you talk about how people have several vectors, some people are easier to get across if you explain them with logic, some people are easier to get across if you take it to the side of empathy.
 Tachikawa: I'm proud of myself. There was a woman named 〓01:04:12〓, and we were all having a discussion. We were talking about how to verbalize the process of starting something new. One of the female students said that if I could wake up in the morning and have that thought in my head for 10 days in a row, I would do it. She said it could be anything, like a bag she wants or something new she wants to start. When I heard this, I thought to myself, "What a dilemma!
 Nishio: I thought too that we would do it on the first day. It was the same (laughs).
 Tachikawa: Until the 10th, 5 days at most.
 Nishio: To begin with, I don't think I can remember 10 days. I can't remember how many days it is now.
 Tachikawa: I was surprised to learn that there are people who live with a way of thinking that is extremely different from my own. It was quite interesting to know that there are people who live their lives with a way of thinking that is so far removed from their own. Are there a lot of them, or are there surprisingly few?
 Nishio: First of all, it is important to know that there are a lot of them. You said at the beginning that people tend to assume that everyone is the same as they are, but that is not true, that everyone is different from them.
 Tachikawa: I had a very strange feeling as a child, and now that I am an adult, I can explain that feeling. When I was a child, I could not verbalize the strangeness. As an adult, I realized that what is good for me is not equal to what is good for others, because I am different from others.
 NISHIO: Because they come to me and say, "You should follow this religion.
 Tachikawa: It is the right thing to do, that is, don't do what you don't like people to say to you either. It's just strange, isn't it? That's just normal. So that word is not good.
 Nishio: It is not very good because the basic premise is that it is homogeneous. You have to make sure they know what you want them to do and do it.
 Tachikawa: That was morality.
 Nishio: You cannot give a gift to someone who says, "I love this cartoon character, so I'll give it to you. There are people who cannot say, "Let's have a drink together, I love alcohol. There are people who say, "These cookies are delicious, so I'll give them to my child who is allergic to wheat. It is all the same. What you think is good for you may not necessarily be good for the other person.
 Tachikawa: Even the things that we believe to be true from a relatively high angle can be quite different. This is not the main point. This is not the main point, but I think it is debatable whether all ways of thinking should be respected in a completely flat manner. But basically, there are many different protocols of thinking.
 Nishio: The idea that all ideas should be flatly respected is the one that often creates a paradox. Should we respect "the idea that all ideas should not be flatly respected?"
 Tachikawa: That's a paradox.
 NISHIO: So let's leave it at that. After all, I don't think humans are capable of treating things equally with respect to the scope of their own observations, so I think it comes down to what you think is good and what you don't think is not good.
 01：08：50
 Tachikawa: I am very positive about things like giving some communication protocol modules to people who have communication protocols that are difficult to live with, I think it makes sense. In contrast, out-of-form development, what do you call it?
 西尾：非定型発達者。
 Tachikawa: I'm talking about what kind of 〓01:09:21〓 should be taken for atypical developers. What I often see is, let's make a place for them.
 Nishio: Let's make a place to stay and get along and be friendly and congenial, like I said I don't like that kind of thing (laughs).
 Tachikawa: Yes (laughs).
 Nishio: Why do you assume that if you are friendly with people, for example, if you go out to lunch with them, they are happy or whatever?
 Tachikawa: The basic premise is wrong.
 NISHIO: That is, I don't know if you people who are typically developed think it is fun to go out to eat food with other people, but for us, it is fun to discuss with a few people who are agreeable to each other. In the world, for example, there are textbooks like Adult Atypical Developers or Adult Developmentally Challenged, which are written by doctors who are typical developers, regarding Asperger's tendencies, doctors are a field where Asperger's tendencies are low. I'm high in math and stuff like that.
 立川：意外、低い？
 Nishio: Medicine is low. That is an interpersonal activity. So, of course, aside from the fact that there are high doctors in the world. On the other hand, it has been 5 or 10 years since I became interested in atypicals, so the world has warmed up and there are many opportunities for atypicals to output how they should be for atypicals. It's interesting to see that. It was interesting to read a recent article (this one: [Thinking about Adult Developmental Disabilities]) in which there were about five atypical developers, and they were all asked to introduce themselves one at a time. How much is a word? Like this. Like this, like this, like this. Like this. One word means one word, or five minutes, or one minute, or something like that. It's like this, like this, like this. I can relate to it. I can relate to those people. It's like, "Please stop giving vague instructions.
 Tachikawa: For example, Mr. Nishio, with Mr. Kuchii, acquired a little bit of humanity through our discussions. In my case, I had a tendency to force myself to get involved with others. Specifically, when I was in high school, I was a member of the festival committee or the student council.
 Nishio: Was that forced on you rather than voluntarily raising your hand?
 Tachikawa: It was spontaneous, I know I'm not good at it, or rather, I'm aware that I'm not good at communicating with people, but I thought there would be no problem if I did it because I'm not good at communicating with people. I didn't believe it would be an obstacle, and when I actually did it, there would be a lot of mess and friction. When it came down to it, I wanted to solve this friction. I don't want to deal with my communication skills, I want to deal with this friction that is happening between me and other people.
 Nishio: I see. While there are many opportunities for people to be crushed by feelings of self-blame that they fail to communicate because it is their fault, the phenomenon of friction occurs between both parties. I dislike the common talk about the lack of communication skills, and the case of communication failure is something that occurs between both parties, so it is not either party's fault.
 Tachikawa: Yes, it should not have been a story about which side was at fault in the first place. It is a story of mismatched communication protocols. It is not really a story where either party is to blame.
 Nishio: But those who tend to fail, in short, those who are out of step with the majority, have a higher probability of experiencing failure, and the moment they think of tying it to themselves as their own responsibility, their minds are torn to pieces.
 Tachikawa: That's right. In my case, the fact that I was able to avoid being crushed was probably due in large part to my mental strength. I thought it would be meaningful if I could organize various communication protocols.
 Nishio: What exactly do you mean by organizing?
 Tachikawa: First of all, we need to clarify what axis should be used for classification, and then, to some extent, we need to be able to explain in language what the smallest constituent unit of a module looks like, and then, using that as material, we can formulate a body.
 Nishio: I see. Now, Mr. Tachikawa started the discussion with a top-down categorization of what kind of categorization should be used first, but as I wrote in [The Art of Intellectual Production of Engineers], if you first go and collect specific information, and then collect it as a list, you can create a structure after the fact. Maybe in the process of doing your daily work, you will come up with lots of examples. If you write down what you think first and let it lie for a while, things like this will fall out and you will be in a position to collect a lot of abstracted and anonymized information, which I can't do. That is an example of what happens when a man and a woman who wants to get married communicate with each other, who wants to have a good relationship with their partner, and it would be amazing to collect 100 cases of this and discover a structure from it. It would definitely be a book that would sell, it has real data. If we can abstract, structure, and properly explain what we have learned from the many people we have talked to, we can create something very useful. There is definitely a need for it.
 Tachikawa: What we are doing exactly has not changed all the time; it is the verbalization of people's thoughts.
 Nishio: By accumulating what you have been doing only within yourself, in output, written above, it will not disappear, and you will be able to have more at once than you can have in your primary memory. Don't you think something very interesting will happen after you accumulate 100 or so things like that?
 Tachikawa: I do.
 Nishio: It is useful and, for example, very beneficial as a training material when the company expands and new people come on board.
 Tachikawa: We are continually expanding our educational materials, but we have not added such a major topic in the past few years.
 Nishio: I don't know how fast it will accumulate after starting this, but it will accumulate gradually, so it will definitely reach 100 at some point.
 Tachikawa: Unless we set a deadline of six months or three months, I don't think we will ever reach 100.
 NISHIO: I'm thinking 100 right now, so I think it's far away and I'm losing heart. For example, after we are done with this, we set a timer and do, let's write down everything we can think of, and then we can count how many sheets we have.
 Tachikawa: Because if you do a few sheets that you put on it, you can see how much of a burden it is.
 Nishio: It's hard because I think it's a work burden, it's not, it's like I'm taking something that used to be heavily supported only in my head and getting it out, it's easier, it's easier because I wrote it and put it here, it's springing back up again. I reap more and more, and mushrooms grow. The more you take, the more new ones grow.
 Tachikawa: I've been doing this consciously for a long time, but I have an assignment, and I have a stack of notes that I've written all over the place, and I can't remember which one I had a similar idea about a long time ago. Nishio-san, you have been trying to figure out how to do this with a scrap box, how do you do it?
 Nishio: Even if you think you have written something similar before when you first decide to write something, you write what you think is important now. The reason is that trying to find something in common makes the work heavier, so I don't do that, but rather, I output and finish the output first. In order to do the work of finding something similar before, it has to be a list, so if I write a long list on a piece of paper and it becomes a lot, it's hard to find it. So I use sticky notes, and you can only write a little bit on a sticky note, and when you get to 100 sticky notes, if you have 100 sticky notes, you can see them all on your desk. It happens that this one and this one are three months apart, but they are saying the same thing. Scrapboxes are weak there because you can't look at them side by side like the KJ method, and I tend to write long sentences. But sometimes a key from a year and a half ago that contains the same keywords will turn up, so both the KJ method and the scrap box are beneficial, but either alone is no good for me, and if I were asked to throw out one or the other, I would keep the KJ method and throw out the scrap box. Why, because it is the only way to list and synthesize.
 Tachikawa: I have a similar problem. Ever since I was a child, when I was just walking down the street and various ideas would pop into my head, I would wonder what I should do with them. I used to vent about it by writing on my blog, but even if I wrote on my blog, I still had a lot of past diary entries from my mixi page.
 Nishio: Yes, I feel there are useful things buried in past blogs and Twitter comments, but I can't dig them out.
 Tachikawa: I keep wondering if there is some good way to do this. Certainly, I think it is important to post sticky notes.
 NISHIO: Also, I feel like there was a good one in the past, but if you can't find it, then it's not there. If you can't find something that you can't take out, now you spend five minutes of your time and you can find it or you can't find it, let's say you were able to find it, you spent five minutes of your time, and if what you thought about in five minutes was more valuable than that, then that would be better, and if it doesn't come up right away, then it's not going to be there. It's worth less and less. If you search a bit, search for your own statements on Twitter, or search your own blog, or search for a few keywords, and you don't find it right away, then it's not there. If you feel like there is, it's just your imagination. Just like cleaning out your room, if you put something aside in case it will stand for a translation someday, it won't be there when you need it.
 Tachikawa: Nishio-san, have you ever played Magic the Gathering?
 Nishio: No, I don't.
 Tachikawa: Do you know what a card game is? In the idea of Magic the Gathering, there has always been a story about whether there are cards that can't be drawn.
 Nishio: Is there any card that cannot be drawn? (laughter)
 Tachikawa: Yes (laughs). The faction that believes that even cards that cannot be drawn exist is a faction that hates discarding a deck of cards. But the faction that believes that cards that cannot be drawn exist in the first place is not afraid to use cards that have the effect of discarding the deck.
 01：22：19
 Nishio: You say you are just going to let out whatever you are thinking at the moment.
 Tachikawa: There is an idea that has been booming in my mind recently, as much as the power of manipulation, and that is how, experience, and learning, I think many people are probably saying something similar. For me, learning is the amount of experience.
 Nishio: There is a possibility that the next one will come in time. If you don't mind, can you take a picture now and send it to me later on Facebook or something?
 01：23：30
 Nishio: While we are closing the session, the recorder is still running, so you can talk about whatever comes to your mind.
 Tachikawa: Another thing is how to maximize the amount of learning from experiences and feelings. In short, there are people who gain very deep knowledge from the same experience, and there are others who gain nothing. So, I've been thinking a lot lately about how to gain deeper knowledge from the same amount of experience.
 Nishio: I think it is strange to measure by the amount of experience.
 Tachikawa: I only refer to experience as quantity for now because I am not sure how to measure quality.
 Nishio: The quantity and quality of experience are both concepts that correspond to a single scalar value. So, although many pieces will fit into the mesh that has been prepared for them, it will end up with a 〓01:24:42 〓.
 Tachikawa: So it's like you have to be ready to accept it.
 Nishio: Or rather, you need knowledge to understand. To be frank, for example, if I were to speak in German while I am speaking in Japanese here, you would not be able to understand me, Japanese or German.