PM Hack
>The Unexplored Junior program received 105 applications in 2018, and it looks like there will be even more this year, so it would be interesting to see one PM hacker who researches the interests and preferences of PMs and other things in advance and catches one!
https://twitter.com/codeMo_Iwate/status/1091691749880225792

Interesting summary of each PM's reaction to this statement

Teramoto PM
>I'm not absolutely recommending it because it's an interesting story, but I'm willing to do it if you want to. I'm not sure if "hobbies and interests" necessarily match the criteria for adoption, but if past adopters cooperate, I'm sure the first round will pass.
https://twitter.com/teramotodaiki/status/1091715956609495040

west end
>I think that if you get selected for a project that is not "what you want to do", it will only make the weekly meetings and debriefing sessions more difficult.
	>Unexplored Junior is not a game where you get 500,000 yen if your project is accepted, so I recommend that you check the annual schedule and other details properly. If you choose a theme with the goal of being accepted, you will have a hard time executing the project afterwards. You will be happier in the long run if you think carefully about what you want to do.
	>"Long-term" means that adoption is not the goal, of course, and even the results reporting session is not the goal. It is often said that "[the results debriefing is not the goal], it is a start" at the unexplored results debriefing.
https://twitter.com/nishio/status/1091843503443693568

PM Ishii
>If you are too familiar with a field, you will naturally see things that you can't comment on, and it will be difficult to link this to the adoption of the project.
	>I think it's more appealing to play to [your strengths], rather than to propose something that you don't know much about and don't truly want to do because it fits the PM's taste, but somewhere along the line you'll see that.

Seki PM
>I think there is more weight on how the proposal should be explained rather than the trend of the ideas, and there may be a preference for that.
	>Writing may seem like a technique, but in order to write properly, it is necessary to think about what the idea is to solve and how far you can think about the issue as if it were your own through a solid survey and deep thinking. I think it is important to think about how far you can think about the issue as if it were your own.
	>This year, with the increase in the number of applications, the amount of time to avoid per-paper review will decrease more and more, so it is very important to be able to write a proposal. I think the second round will be tougher to see if you cheat in writing your proposal. If you can cheat that well, I think you are well qualified.
 >I think that even if it's not well-written, if you have passion and can express it as passion in your proposal, it will come across. I honestly didn't know what @SoraSue77's proposal was about last year because it was just passionate, but I felt like it had potential, and several people were interviewing him.
 > A series of tweets around here are about #UndergroundJuniors. I'm waiting for your application. After I finish my thesis, I plan to write a blog about how I have & will look at the review documents.
https://twitter.com/YoshifumiSeki/status/1091851150561660929
