If you're going to talk about it, read it.
	>I was saved by the negativity in "The Intellectual Production of Engineers" about "if you are going to talk about 00, you should at least read xxx". I'll take that as a good thing since I was studying something else on my own time. People's time is finite, and the reading experience depends a lot on people's prerequisite knowledge and experience, and I don't remember everything anyway.
		>I totally agree with the second half, but I only feel uncomfortable when you describe it as 'I was negative about "if you're going to talk about 00, you should at least read xx"'!
			https://twitter.com/nishio/status/1093194631238434816

Think about why you feel uncomfortable.
	For ease of explanation, I'll rewrite the symbols to "If you're going to talk about A, you should at least read X."
	Good thing I was studying something else on my own time.
		agreement
		If you learned about B instead of learning about A, there is nothing wrong with that.
		Compared to learning about A because "everyone else is learning about A," you are choosing what you want to learn about, and that's rather nice.
	People's time is finite.
		agreement
		You can't learn everything because it's finite.
		What to invest limited time in is an individual investment decision
	The reading experience is highly dependent on a person's prerequisite knowledge and experience
		agreement
		You don't get the same thing from the same book.
	I don't remember everything anyway.
		agreement
		It's not like a human downloading a file to a computer.
		We don't remember everything, and computers are better at remembering everything.
	Negative about "if you're going to talk about A, you should at least read X."
		hmm
		There's nothing wrong with learning B instead of A, and in learning A, it might be a good idea to read Y instead of X.
		But when someone talks about the KJ method, for example, and says, "The KJ method is a method of classifying things by writing them on sticky notes," I say, "What are you talking about when the proponent himself has said so many times [not to classify]?" And it goes, "What are you talking about?
		This is a "if you're going to talk about X, at least read the book where it was proposed" composition.
 		I'm not saying, "Be faithful to the scriptures."
 			Once you understand it, you can modify it to suit your situation or cut corners in areas you deem unimportant. Recommendation
 			But the "once you understand it" is not done.
 			[In "Shori-ba-ri", "Shori" comes first.
 			Related: [who calls what is not a mind map a mind map].
		This could be an impression that depends on the relationship between A and X.
			If you're going to talk about programming, at least learn Haskell."
				A is very wide and X is high cost
				NG feelings
			If you're going to talk about Haskell, at least read the Haskell tutorial."
				A is narrower and X is lower cost
				This is the opposite of the "of course" feeling.
			NG feels that "claims that impose high cost burdens on a wide range of people"
			If the scope is narrow, I feel that "if you're going to talk about it, you obviously need to know the premise."
		You said you were negative about "if you're going to talk about A, you should at least read X" which is not limited to A and X, even though my feelings are different depending on the content of A and X. You came up with A and X which are not negative, which led to your discomfort.
