Granularity of sticky notes
Amount of information written on sticky notes
A few one-word items are okay, but all those things can interfere with grouping.
The "long form" is too informative.
Short sentences of moderate length are good.

However, saying this first puts pressure on those who are not familiar with the writing method to write sentences of a reasonable length, making it harder to get the writing out. This has been a problem for some time.

After [20190205 Tachikawa-san KJ method experiment].
>I did this unintentionally yesterday in a KJ method session, but when I got just one word, I asked, "Can you add another word?" I'm glad I assisted him. I usually say, "I don't care what you write," because many people lose their ability to write when they add more constraints, but assisting them to fatten it up more right after they write doesn't stifle their writing.
>On the other hand, for those who write long sentences, "So what if I say this in one sentence?" I don't know if we can cut it down after the fact like that.

I'm sure I could mechanically support an assist regarding the granularity of the stickies.

----
>Some one-word ones are okay, but all of those will interfere with the grouping.
>"Long sentence" is too much information.

Examples of one-word items
	one word
	long sentence
There is a danger that it is too abstract and that this itself could almost serve as a "classification frame".
approach
	No particular target is needed unless it is all one word.
	If we do it, I'll ask, "If you had to add one more word, what would it be?" or some other fattening question.
		One word." - "One word is too abstract."
		Long form" - "Let's break up the long form."

Examples of too long
	>Some one-word ones are okay, but all of those will interfere with the grouping.
With text editors, etc., I would unintentionally write something of this length.
When you are writing by hand on a sticky note
	Bottleneck in the speed of hand movement
	Ratio of "speed of thought" to "speed of output."
	Positive effects of "writing by hand is a pain in the ass"
(in Nishio's case), which is naturally compressed by

	May have a one-word sticky note.
	If all you have are word stickies, you can't group them.

Writing by hand instead of using kana-kanji conversion creates a bias to avoid words with difficult kanji and to choose plain expressions
	[Handwritten advantages].
