leeway
[https://gyazo.com/5009c2b0d688e2f3a2d3ca748db9ef1b]
Assume that utility growth slows as the quantity of resources increases ([law of diminishing marginal utility]).
Assume that utility growth is negligible when resources exceed 1 because it is easier to think in extremes.

There are three patterns of situations.
[https://gyazo.com/ee5ebebbd5fe5153afe117844695c1fd]
Situation 1: Everyone's resource production exceeds 1
	There is a surplus of resources for all of us.
	No one is trying to get resources from others.
	When a project (festival) is planned that temporarily consumes resources to create utility, everyone brings their resources.
		Because it's more interesting (and has more utility) to hapnp an event than not hapnp it due to a lack of resources.

Situation 2: Not everyone's production is above 1, but the average is above 1
	Transfers are made from those with excess resources to those with insufficient resources.
		Because when transfers take place, society's overall utility increases.
	The resource provider has no particular utility in putting out the resource itself.
		This time we assume flat utility for simplicity, but in reality there is a non-zero slope, so this resource transfer does not occur spontaneously
		There are cases where there is utility, such as finding value in increasing the utility of society as a whole.
	The recipient of the resources increases his or her utility by receiving them.
		All are satisfied to the same degree
		Communists believe that in an ideal state this would be the case.

Situation 3: Average production is below 1
	Transferring resources so that they are all equal makes everyone unsatisfied.
	The resource provider resists because he/she will be unhappy if the result of the resource transfer is less than 1
	Resource receivers
		Some people will get it until they are satisfied and some won't.
		Equality leads to inadequacy, including my own.
		Getting resources by being appreciated by those who put out the resources is a way to fulfill yourself.
			Motivation is extrinsic.
		not relaxed
			Those who are unfulfilled at this time, of course, do not have the luxury of space.
			Even those who are currently satisfied cannot be reassured that their sufficiency may be taken away

When I heard Mr. [Sogawa] stressing the importance of giving people more space, I thought he was right on the spot, but when I thought about it again, I couldn't figure out what "more space" was, so I sorted it out, but in the end the word "more space" was not mentioned until the end, so maybe something different Maybe it is something different.