intersubjectivity
	Inter-subjectivity
	When two people [share] [subjectivity] with each other, a shared third subjectivity, intersubjectivity, is constructed
	Can there be an "objective?"

	Encyclopaedia Britannica
  >In the terminology of E. [Husserl], it is also called intersubjectivity or co-subjectivity. [In contrast to [phenomenological reduction], which reduces to the immanent realm of [pure consciousness], [intersubjective reduction] clarifies the formation of other subjectivities, the egos of others, through the transference and transfer of the ego via the appearance of the body of the other in [the sphere of the ego's belonging]. In the communal subjectivity thus acquired, the transcendental world is internalized and its objectivity is [founded]. Later, through discussions by M. Heidegger, M. Merleau-Ponty, and others, Wataru Hiromatsu defined this term as a situation in which individuals share a single world while recognizing each other as subjects. Today, the term is used to refer to the underlying structure that precedes the differentiation of self and other.

http://tanemura.la.coocan.jp/re3_index/2K/ka_intersubjectivity.html
	A new way of thinking about subjectivity, presented together with Husserl's phenomenology
		presented in the context of [the composition of the objective world].
		>Subjectivity does not fundamentally function independently as an ego-cogito, but rather jointly, with intersecting functions, and when this intersubjective jointness of subjectivity is projected onto the object, the representation of an objective world arises.
	Subjectivity does not confront the world each alone.
	>Phenomenology questions the structure of the world's existence by returning to the world-constructing work of subjectivity, and attempts to view objectivity as the correlate of the joint workings of such multiple subjectivities. That joint work is intersubjectivity.

>Husserl arrived at a different view of truth than Descartes while following the Cartesian method. The logical structure is the same: I need the Other for my idea to be the truth, not just my mere assumption. However, Descartes' other, God, is my other in that he is inerrant and therefore the opposite of me, who is prone to error. Since God is always with truth, he guarantees the objectivity of truth. In contrast, Husserl's other, or other-self, is my other in the sense that I cannot occupy more than one place at the same time, and more than one body cannot occupy the same position at the same time, but it is fallible like me. Therefore, when I and the other coincide, it is not guaranteed that their truth is eternal and unchanging as God perceives it. There remains the possibility that it may be modified by the appearance of another other self. Therefore, objective is no longer appropriate for this truth. Instead, a new concept of intersubjectivity250 or intersubjectivity is introduced, in the sense that truth is a unity between multiple subjectivities, a unity after mutual modification. This transformation from objectivity to intersubjectivity may seem to lighten the value of truth, but it is also a necessary step forward for modern philosophy, the philosophy of subjectivity, in that it does not appeal to something transcendent of man, and that the basis of truth is the agreement of men.
	Shinagawa, Tetsuhiko, 2015, Ethics, Nakanishiya Publishing.

	[1712 Nights "Phenomenology of Intersubjectivity" by Etmund Husserl|Seigo Matsuoka's A Thousand Nights and a Thousand Books https://1000ya.isis.ne.jp/1712.html]
	

	Need an atmosphere where subjectivity can be shared
		[Psychological safety?]
