KJ method with Notability
How it started: When I mentioned that I was thinking of creating a software application that would do KJ-like things on the iPad, I was told, "Why don't you just draw that on the notebook app, surround it with a nasenawa, and move it around?" I thought it might be possible, and I wanted to identify what the difference was in the first place.

This summary was written after doing the [KJ method] on [Notability]:.
Wanted to create my own electronic KJ method tool.
The reason.
	Advantages of being digital data
 	Unlike paper stickies, digital data can be easily copied and reused for other projects
 	Especially capable of importing from other formats.
 		From Scrapbox Bulletins.
 		From the PDF of the lecture slides
 	Version control eliminates concerns about changes and deletions.
	I need text data.
		I want to search and do natural language processing
		But keyboard input on an iPad is a pain in the ass, you know?
		I want to flick input on my iPhone.
			I want to jot down my thoughts while walking or on a crowded train.
			There should be an export method app for the iPhone.
		Do you want to voice input?
	How does it compare to an outline editor?
		Tools that can't draw a quick diagram are a loss.

And how about the current iPad notes app (Notability)
	I thought the two steps of selecting and moving with a lasso would be a hassle, but it was surprisingly possible.
		Because of the original need to dictate which ranges were grouped when grouping.
	First you need to zoom in and draw.
		Because of the A4 size limit when zoomed out
		The pen is in its thinnest mode.
		Hard to use because the eraser is not small enough.
	Boundaries are your own.
		The lack of borders on the stickies was hard to get used to at first.
		Once I grouped them, I drew my own boundaries and I don't care anymore.
	Notability text box is useless.
		Not subject to lasso selection

The current Notability is
	Fat and easy to copy and paste, so it can be reused for other projects
	❌Import from other formats is currently not possible.
	❌Text data impossible

latest version
[https://gyazo.com/1a050398ef0d7eb93d4532b2155dba3c]


log
Version 1
[https://gyazo.com/e1055ebffcea5e9b46432066b9f332a3]
Version 2
[https://gyazo.com/191612010d54e1b818ac8f2c896538f6]
Version 3
[https://gyazo.com/70d68a98910783c23555b37172685ae1]
Version 4
[https://gyazo.com/88d78f0d5c2000eced6168d5be53ae61]
Version 5
[https://gyazo.com/51fbdfb562010382d535143b2f467bbf]
latest version
[https://gyazo.com/1a050398ef0d7eb93d4532b2155dba3c]

In the final version, the number of sticky notes would be about 60.
