Original methods and fidelity
	Discussion of whether we should be [faithful] to the original methodology
	It's [a false dichotomy] to argue that "we should be faithful" or "we don't have to be faithful."
	There is a long-established three-step explanation of skill acquisition in the martial arts and the performing arts: "[Shori-ba-rui]" (the three stages of skill acquisition).

	First, follow the pattern. This means to be faithful to the original method.
		In this process, knowledge about methods that was outside of you is internalized within you.
		By actually using the method, you can accumulate your own experience.

	After that, the mold [breaks spontaneously].
		>If the disciple learns to observe, he will break the rule himself. Separation is the combination of these two, and also the protection of the two.
			Kawakami Fubaku (1719-1807), founder of the Edo Senke school of tea ceremony
		Compare to programming:
			First, try entering the code as it is written in the textbook (Mamoru).
			Eventually, "What would happen if we changed this part?" will naturally arise.
			As you try it out and learn from the results, you will be able to write programs that are not just a copy of the code in the textbook.

	The word "detachment" is difficult to explain in words alone, although those who have experienced it will say, "Oh, that's it.
		It is not "the teacher told me to do X, so I have to do X" (mamoru) or "the teacher told me to do X, but I dare to do Y" (shakai), but rather "I think it is good to do Y, so I will do it".
		A bird's-eye view of the "defenses" and the "breakthroughs" that are well understood but not biased toward one or the other
		There's a [dialectic]-ness to it.

	Those who insist that we should be "faithful" are those who have not yet reached the "breaking point."
		Or [ritualization of means], [businessization of methods].
	Those who insist that "you don't have to be loyal."
		If you're assuming "first follow the pattern," you're making a decent argument.
		If you neglect "first of all, follow the pattern," then you are a person who cannot even "follow" the pattern.


Whether this idea is unusual in the world?
	Because of the weak influence of [monotheistic] thought in Japan, the idea that righteousness is transformed over time was stronger than the idea that righteousness is given to humans from outside.
