Incremental Writing
[2016-03-05 Facebook https://www.facebook.com/nishiohirokazu/posts/10207981242385436] The day before this: [Elaborative IR]
Incremental Writing, I am concerned that the manuscript may never be completed because of the increasing number of references and fragmentary descriptions that may be useful for the manuscript... I may be too impatient to ask for results in the first few days.

[Incremental Reading] is doing well. I even want to digitize the paper books that I brought back from the office, tear them apart page by page, and shove them into IR.

I wonder if the process of filtering out only the past various writings that are relevant to the theme and plugging them into IR itself could also be done incrementally.
I think I could implement a cycle of: put in the teacher data, review from the most probable, answer with y/n, y's go into IR, y/n is added to the teacher data....

When writing a book, I always wonder whether to start with an abstract overview or a concrete story, but in the end, even though the sum total of energy required is less if I start with an abstract overview, people lose their minds quickly if they start with something abstract, so the learning rate, taking motivation into account I think it would be better to start from a concrete theme and develop a story.
	[Kazuki Kouchi] In mathematics, for example, when learning set theory, topology, or group theory, if you only follow theorems and proofs, you will not understand most of them, and it is better to learn slowly with appropriate examples.

[Yoshiki Shibukawa] http://help.supermemo.org/wiki/Incremental_writing This one? Looks interesting.
	nishio> To take this opportunity to briefly explain, "spaced repetition", which is often found in learning books, is the foundation of Incremental Reading, and after using the flashcard application SuperMemo for a long time, I thought, "Why not read electronic information sources, make excerpts from them, and then systematically decide the review intervals for the excerpts? In addition to that, "I can make flashcards of topics I'm thinking of writing about, add to them little by little, and then read them back to improve them, and that's what I've been doing. I can add to the flashcards as I go along, and then read them back to improve them.
	I can attest from my own experience that [Spaced Repetition] and Incremental Reading are beneficial, while Incremental Writing has the potential to be beneficial, but I'm not sure yet.
	I have always wondered if there is a solution to the problem that sometimes we read a book and make excerpts from it, but if we don't reread it with a proper sense, we end up with a "self-satisfied feeling that we just made an excerpt and it's on our hard drive" or "it's been so long, we don't understand the context when we reread it again", IR is one of the solutions.
	This kind of "reacting to a trigger stimulus and writing a commentary on it" is less stressful than when you are groaning in front of a manuscript that is about to be written. By inserting the writing into a similarly spaced review process, the commentary will grow incrementally, with the writing itself becoming the stimulus a few days later. I understand that this is the core concept of Incremental Writing.
	Another bonus is that knowledge is fragmented and presented in an unexpected order, which allows for a "coupling" to occur that does not occur when reading or writing in a sequential manner
	What I haven't quite figured out yet is whether I should put the sentence that says "~ is the concept of Incremental Writing" on the reference side or the finished writing side.
	[Yoshiki Shibukawa] I see. So it is a combination with flashcards?