The sin of viral things
>(Obstruction of business by damaging computers, etc.)
>Article 234-2 A person who damages a computer used for a person's business or an electromagnetic record used therein, or gives false information or illegal instructions to a computer used for a person's business, or by any other means causes a computer to fail to operate in accordance with the purpose for which it is used or to operate contrary to the purpose for which it is used, shall be punished by imprisonment with work for not more than five years or a fine of not more than 1,000,000 yen. A person who interferes with the business of another by giving false information or unauthorized instructions to a computer used for the business of another or by causing a computer to fail to operate in accordance with its intended purpose or to operate contrary to its intended purpose by other means shall be punished by imprisonment with work for a term not exceeding five years or a fine not exceeding one million yen.
>2 Attempts to commit the crimes set forth in the preceding paragraph shall be punished.
1998 Additions

>(Unauthorized creation of electromagnetic records, etc.)
>Article 168-2 Any person who, without justifiable grounds, creates or provides any of the following electromagnetic records or other records for the purpose of using them for execution on a person's computer shall be punished by imprisonment with work for not more than three years or a fine of not more than 500,000 yen.
>(i) Electromagnetic records that give a person, when he or she uses a computer, unauthorized instructions that cause the computer not to operate as intended or to operate contrary to the intention of the person
>(ii) In addition to what is listed in the preceding item, electromagnetic records or other records describing the unauthorized instructions of the same item.
>2 The same shall apply to a person who, without justifiable reason, makes an electromagnetic record listed in item (i) of the preceding paragraph available for execution on a person's computer.
>3 Attempts to commit the crimes set forth in the preceding paragraph shall be punished.
2011 Additions

The former requirement is "interfering with business" by means of a viral-like program, whereas the latter is the creation or provision of that unauthorized program.
