How to turn around improvements that do not see immediate results
In the process of preparing the English version of "The Intellectual Production of Engineers," there was a bit of confusion about how to proceed, so I consulted my wife.
Summary of the results.

2019-03-20
If you can fix it and check the results instantly, then fix it and check the results immediately.
But let's say there's a 10 minute wait to see the results.
For example, a situation where a file needs to be regenerated before the results can be checked, and that takes 10 minutes.
If you fix one place in this situation and try to check it right away, you'll have to wait 10 minutes.
If it takes 1 minute to fix and 10 minutes to wait, a large part of the work time is consumed by the waiting time, not good!
Inefficient
What can we do about this situation?

One option: work in parallel while waiting!
It's pretty hard to turn this around successfully.
Suppose you make a correction and while waiting for the file to regenerate
Can the file be regenerated further for that modification?

Inversion of the idea
Do not work in parallel while waiting
	If you get confused trying to execute tasks in parallel to make the most of waiting time, don't do it!
	Just work on one pomodoro, apply file regeneration, and take a 10 minute break.
		What if the waiting time was longer? For example, an hour.
			We can work on different tasks, we're trying to do the same thing, that's why we're confused.
	Why didn't they take this seemingly obvious approach?
		That's because I lacked the management of the feeling of "wanting to fix it as soon as I see a place that needs to be fixed".
			Why do you want to fix it as soon as you find it?
				That's because they don't write down the corrections they find.
				I'm worried about forgetting because I don't write it down and I want to fix it.
				You won't be able to move on without correcting it.
			Why do you want to check the results as soon as you fix it?
				That's because I didn't write down "what kind of problem and by what means I fixed it".
				Worried about making corrections or forgetting what corrections have been made
				So you'll want to check the results right away.
			The way to solve this problem is to first record the [areas that need to be fixed] when you find them, and then record them when you fix them.
				see [3 patterns of what needs to be fixed].

[Before time management, you need to manage your feelings.]
	Since we usually manage computers that do not have feelings, we tend to fall into the wrong way of thinking about people who do have feelings, such as "Let's make them do tasks in parallel because the waiting time is inefficient.
	It's hard to know how much time to spend on each corrective task without first understanding the big picture.
		Even if you're working on a job that isn't tight on deadlines, running with no end in sight can undermine your motivation.
		The default is to "look through the whole thing first and list all the areas that need to be corrected"
			If the task is too large, you can also [divide by quantity], for example, "First, an entire chapter.
			Or you can [divide by time], "I'm going to list the things that need to be fixed in the next 25 minutes.
				I wrote about this in chapter 2 of [An Engineer's Guide to Intellectual Production] [(1.3.4.3) Separate Your Time].
	You want to fix it right away because you're not keeping track.
		What is the granularity of the record?
			"[Do you] sleep and wake up and figure it out?"
				As I will find out tomorrow.
			Sense of adequate detail is acquired gradually through training.
				If you don't do it, you won't learn it.
			If you have a record that shows who you are tomorrow, you can do "the rest tomorrow" at any point in time.

[https://gyazo.com/fc6a8b16c96626f7f3024b3d38e25966]

