path dependency
>how the set of decisions people face in any given situation is limited by decisions people have made or events they have experienced in the past, even if past circumstances are no longer relevant
https://ja.m.wikipedia.org/wiki/経路依存性

In particular, in the context of [organizational knowledge acquisition], it is used to refer to the suppression of the acquisition of knowledge B when comparing knowledge A, which is clearly related to the "business being conducted at the moment," with knowledge B, which is not clearly related to the "business being conducted at the moment.
　From the perspective of individual members of the organization, when they take action to acquire Knowledge B, there is a "cost of persuading the decision maker to make the decision to devote time and other resources to Knowledge B".
　Acquisition of knowledge A is low in its cost.
　This difference in cost creates a bias in the individual's decision to choose knowledge A as the acquisition target.
　When viewed as an organization as a whole, it is not total optimization to have a situation where all members have acquired Knowledge A and there are no members with Knowledge B in the company.
　[https://gyazo.com/babc113eaf8c33f15b7fafb597cf50a5]

Some argue that this is the principle by which [disruptive innovation] occurs.
　Newly generated knowledge is knowledge that is not being used in current operations
　Existing firms lose out due to knowledge gaps because path dependence on the part of established firms prevents them from acquiring new knowledge and startups do not have that bias.

Examples of countermeasures
	Lowering the cost of persuasion
		>For example, if there is an engineer who wants to learn Rust, he can buy a Rust book even if he does not use Rust in his assigned work. [Is personal development of OSS for business use on holidays business? - Cybozu Inside Out | Cybozu Engineer's Blog https://blog.cybozu.io/entry/2018/09/13/113000]
		Making such a declaration in advance can lower the psychological hurdle for the individual.
　People who belong to more than one organization
		[Pulling and combining from the outside world what is not in the company].
		[There are two channels through which information flows into an organization.]
		If you belong to more than one organization, your "current business" will also be more than one.
　　In some cases, it is negative for the individual: [company boundaries and individual reputation].
　Establish a research department
　　Create a department with the responsibility of acquiring and creating knowledge.
　　Lower persuasion costs related to members' knowledge acquisition behavior
　　　It's a business in itself.

relevance
　[The Dilemma of Acquiring Knowledge from Outside the Company]
