Management in Ordinary Times
2019-04-11
Contingency management and peacetime management are two different things.
	What is the difference between emergency ([contingency]) management and [peacetime] management?
	Emergency ([contingency management])
		The axis of value is less clear.
			Like "survive."
			Catching up with and surpassing the West" is also a state of diminishing axes of value.
				It is important to know if there are few axes of value.
				An "emergency" is an example of a situation that arises.
 	Fewer axes, so you can discard what is not relevant to your axis from a lot of information.
 		One or a few people can make a decision.
 		Become a [master-formed organization
 	The word "[leadership]" conjures up images of one person leading many.
 	　This is contingency management
 [Management in Peacetime]
 	There are plenty of axes to grind in peacetime.
 	　Reality is complex to begin with and cannot be expressed on a few axes.
 	　　I had no choice but to focus on some of them in an emergency.
 		It's cognitively painful for one person to make decisions on multiple scales.
 			When one person tries to make a decision, it exceeds that person's cognitive capacity.
 		I can't make a choice between the two.
 			Difficult to determine "this information is not necessary."
 			Makes it difficult for one person to grasp the whole picture.
 		Tend to get dragged down by [quantitative KPIs].
 			It's hard to recognize a state with a variety of axes, so we jump to a simple scale.
 		　We have abandoned a proper understanding of reality with its diverse axes, so the problem is usually a mismatch between simple KPIs and complex reality.
 		The cost of communicating information is greater.
 		　Due to the difficulty of discarding
 		　Both of the following increase the burden
				　To be transmitted in words.
				　Receiving and understanding words.
 		Best practices in this state are "transfers."
 		　Delegate decision-making to those who are positioned closer to specific information
 			Reduce the amount of information transfer required
 			The style of communicating a large amount of complex information from the person who has the information to the person who makes the decision, and then making a decision, is time-consuming & often leads to wrong decisions due to insufficient information communication.
 			Peacetime leadership does not try to centralize everything to itself.
 			　Because that's where the bottleneck is.
 			　The role of repeatedly transmitting distant goals and guidelines for decision making becomes stronger.
 			　Because information dissemination is easily scaled by software.
 		The scale will vary.
 			Become a [multidimensional organization
 			Mixed results are useful in expanding the scope of search
 			[trade-off between use and exploration].

[BMOT20190411]

2022/11/15
　I saw a discussion about the reforms that [Elon Musk] is making after he bought Twitter that are undermining [psychological safety].
　　Psychological safety is management in peacetime, and contingency management would be appropriate in Twitter's current situation, where bankruptcy is a possibility.
>[https://twitter.com/tokoroten/status/1592474413337018369 @tokoroten]:[https://twitter.com/tokoroten/status/1592474413337018369 @tokoroten]: I feel like you don't distinguish between [management in wartime] and [management in peace time]!
>We're talking about management in times of war, and you're side-stepping the standards of management in times of peace, so the conversation is getting a bit muddled.

