Multi-skilled workforce and trial cycles
>For "in-house developed, original, original system projects," the percentage of multi-skilled personnel on the team will determine a significant percentage of the product's success or failure.
> 
> So it is better to fill all the leadership classes of a team with multi-skilled personnel. And because the percentage of multi-skilled personnel in that team will affect the scrap-and-build cycle, it is better to have a small team of 3~7 people in the pre-production phase. With such a team, changes to the game concept are judged solely on whether the game will be interesting, and no one is thinking about losing what they have created. This is because, as multi-skilled personnel, they are not workers whose deliverables are evaluated, but are in a position to be evaluated by the sales of their deliverables.
	[KAERU D War: Tough Teams Attack Uncertainty in Game Making, Shifting from Firepower Warfare to Mobile Warfare｜KAERU D｜note https://note.mu/kaerusanu/n/n519c3f91420a]

	Percentage of [multi-skilled personnel] shortens trial cycle
		Why?
		I think this, written in another paragraph, is the key
		>Pre-production often fails, and when it does, it is important to give up meekly. If you can't get rid of it because of the sunk cost of making it, or if you go through with it just because it looks cool in a visual art sense, it will be disastrous afterwards.
		People with high sunk cost bias are not good at throwing things away.
		The project envisioned here has a high probability of failure and requires repeated trial and error.
		In situations where people should fail and take on new challenges, high sunk bias prevents action.

	Why do multi-skilled personnel have lower sunk cost bias?
		Being a multi-skilled personnel is a result, the main one being the "first generation" as discussed here
			[Why does the "first generation continue to hold the line" in game making?" and how to become one, and the pitfalls｜Kaeru D｜note https://note.mu/kaerusanu/n/n6a5de71356e8]
		People who made things before the division of labor was developed gain experience in activities with the goal of "completing things".
		On the other hand, those who joined a company with a well-developed division of labor later and participated in manufacturing were given "their share of the work" and gained experience in activities aimed at "completing their share of the work"
		With respect to the discussion of whether or not to discard B when there is a sub-element B in a certain game A
			People who feel their goal is to "complete game A" don't mind losing game B.
			People who feel that their goal is "to complete element B" feel that it's a total denial of their work accomplishments.
