vector
The story surprised me to hear that the world's most common mental model is something like "a vector is an arrow" or "a vector is a quantity with direction and magnitude".


A New and Complete Dictionary of Arts and Sciences of 1764
	vector explains it as "an astronomical term, a line connecting a planet and its center (or elliptical focus).
	It also says that the origin of the name is because the planets look like they are being CARRIED by the lines.
	By the way, vector means "carry" in Latin.
[http://gyazo.com/7d3e1f537d091d5add09d900ab04bab2]

Encyclopaedia Perthensis of 1816
	The idiom Radius Vector appears, but there is no occurrence of vector by itself.

A book written in 1855 explaining Newtonian mechanics
	The word vector appears, but only in the idiomatic form "radius vector.
	As far as the equation goes, it's not what we would call a vector today.
		r is, in today's terms, "the length of the line segment connecting the focal point of the ellipse to a point on the ellipse."
[http://gyazo.com/dd77e478a5d85e864a5650d91af73bd7]

 1687 Newton's Principia Mathematica
 1835 Hamilton, Definition of complex numbers without square roots of negative numbers
 1843 Hamilton generalizes complex numbers and defines quaternions, calling the imaginary part by the term vector
 1878 Clifford invents the concept of inner and outer products, showing that the equivalent of the product of quaternions can be defined for three pairs of numbers
 1881 Gibbs, in writing a textbook on electromagnetism, uses only the three pairs of numbers in the imaginary part (vector part) of the quaternions in isolation.
 	It was much later that the non-3D "arrows" that we now read as vectors came to be called vectors.
 1636 Affine transformations studied as a branch of geometry
 1857 Linear transformations including Cayley and affine transformations are represented by matrices
	 In the same year, Glassman, in the course of his research, creates the concepts of linear independence, scalar times dimension, and
 1888 Peano gives a modern definition of vector space
	 In this area, the vector is finally formulated, as we now call it.

Elements of Vector Analysis by Gibbs (1881)
	[https://gyazo.com/20ef5347adc43921d21c7440fa325544]
	The beginning is similar to the current definition of a vector space
	But when you start saying there are three unit vectors, you're implicitly assuming a three-dimensional space.
		[https://gyazo.com/d84d0852eaf8956b27790e51e5742802]
	Define two types of multiplication for vectors on p. 5
		[https://gyazo.com/da7744c6707dfc4542f2d44877fa7df3]
	And this result
		[https://gyazo.com/79af5c3758a1c5c236b81ad83df58769]
		and [quaternion numbers] are attributed to
