Problem Solving Methods
[https://gyazo.com/5d78a66b3a3115494c2b429310051195]
[I thought only about the team] P.106

>The "[problem]" is "the [gap](difference) between the [ideal] and the [reality].
	[The problem is the gap between the ideal and the reality.]

	>"Causes" are infinite. All past actions are connected to reality. Therefore, we do not aim to list all causes. It is important to deepen our understanding of the cause-and-effect relationships that caused the reality, using logic trees and other tools to break down the causes.
	>"Ideals" are also infinite. Different people have different ideals... If there is diversity in an organization, it is natural that ideals will differ. What is important is to narrow down which ideal to aim for among members. If the ideals are different, the challenges will naturally be different. In order to promote teamwork, the team must narrow down and fix the ideal that they are aiming for.
	>The problem-solving method is not much different from the problem-solving frameworks often used by consultants. What is important is that it is a company-wide standard framework and that all employees are expected to use it. A common framework is necessary for effective discussion. It's one of the ways I force my employees to maintain [a diverse organization].
		Benefits of creating a [common language
		Maintain a [diverse] organization = keep productive discussions among diverse members.

	>The point of this method is that it defines cause and issue as "action.
		I had my doubts about this.
		The "[action]" here is not an action in the sense of [dead man's test].
		Include "didn't" in the action.
			>"Because we failed to predict the recession," or "because we did not take measures against the recession," they will look at their own actions.

	>Everyone has "[dissatisfaction]" in the workplace. Is this a good thing or a bad thing?
		Dissatisfied = gap between ideal and reality
		A state of having the next ideal without settling for the status quo
	[Disappointed]
		>People become discouraged and angry when they are faced with a huge gap between their ideals and reality.
		>There is always a cause.


	[Ideal map]
	[expressing ideals qualitatively].

	P.131 Decision-making is "drafting" and "approving
		This "drafting" is done by the problem-solving method
