(5.2.4.6) Family resemblance
[Intellectual Production of Engineers], p. 160, additions that come after [(5.2.4.5) Benefits of reducing burden through classification].
---
[https://gyazo.com/a3c832d9b96f39ed63d35fdeda59bfb5]
Fig: A family

A "family" is a group. There are not necessarily characteristics that are common to all members of this group. Even if there are no characteristics that are common to all members, the whole group can be loosely connected by characteristics that are partially common to all members, forming a group.

The term "[familial similarity]" was coined by [Ludwig Wittgenstein]. He considered whether groups of what the term "game" refers to share common characteristics and argued that not all games share common characteristics, but rather a complex web of similarities that overlap each other. He simply referred to groups connected by familial similarities as "families."

I explained it this way: "I am a
>When you find one that seems to be related, move it so that the two warps are close to each other. By repeating this process, a group of warp lines that seem to be related to each other will gradually form.
[The Intellectual Production of Engineers] p.152

Classification first determines "characteristics common to the group" (CRITERIA), and then decides whether or not a person is a member of the group based on the presence or absence of those characteristics. On the other hand, [group formation] in the KJ method requires only a relationship among individual members, not common characteristics. This is much like the idea of familial similarity.

It seems we need advice to release the captivity of "we must create a group with common characteristics."

-----

There is an interesting experiment regarding familial similarity.
	Norenzayan, A., Smith, E. E., Kim, B. J., & Nisbett, R. E. (2002). Cultural preferences for formal versus intuitive reasoning. Cognitive science, 26(5), 653-684.

[https://gyazo.com/4c60884f971a6a15541414557d2a0c70]
Which group does the target object resemble? European Americans and East Asians gave diametrically opposite answers to this question.
[https://gyazo.com/26318f028c04d1e3c3906a8c03c30b89]

Let's delve into the two ways of thinking.

This flower has four attributes.
 Attribute 1: Target petals are round, Group 1 has 3/4 petals round, Group 2 has 1/4 petals round
 Attribute 2: Target flower center is a single circle, 3/4 of Group 1 is a single circle, 1/4 of Group 2 is a single circle
 Attribute 3: Target has leaves on it, Group 1 has leaves on 3/4, Group 2 has leaves on 1/4
 Attribute 4: Target stems are straight, Group 1 has 0/4 stems straight, Group 2 has 4/4 stems straight

In this situation, would you put the target in group 1 or group 2?

 Rule-based: Attributes 1-3 do not clearly separate the groups. Attribute 4 is the criterion that separates the two groups, and if the criteria are followed, the group should be placed in Group 2.
 Family resemblance-based: the idea that since three of the four attributes indicate that "group 1 is closer", it should be placed in group 1.

Interestingly, when the question is not which is similar, but which should be classified as similar, East Asian also makes a rule-based decision. In other words, East Asians consider classification and similarity to be different, while European Americans do not distinguish between the two.

Rule-based is easy to explain to others the reason for the decision. It can be a clear proposition: "If the stem is straight, it is group 2." On the other hand, it is vulnerable to noise. In this example, attribute 4 could cleanly separate the two groups, but if noise is present and even attribute 4 cannot separate the two groups, Rule-based falls into the trap of thinking that "there is no clear criterion to distinguish these two groups. It is also weak when some of the attributes are unobservable. If attribute 4 happens to be unobservable, the decision is reversed.

Family resembranse-based is resistant to noise and to unobservability. However, the reason for the decision cannot be simply explained. If we dare to explain, the rule would be: "If the petals are round, one vote for group 1; if the center of the flower is a single circle, one vote for group 1; if it has leaves, one vote for group 1; if the stem is straight, two votes for group 2. The rule is: "The group with the highest total number of votes shall be the group with the highest number of votes.

The KJ method was born in East Asia, Japan. Jiro Kawakita strongly insisted that it is not a classification. The idea of familial similarity may make it easier to understand for people of European descent.
