Cognitive Resolution
2021-10-29
[https://gyazo.com/2ccd037d634495ca9fa005f843d1374b]
I thought the one-dimensional version of the picture was better.
　I realized I could put it in [a series of pictures of two people saying different things], so I redrew it.
　After I drew it, I realized that there was a diagram similar to ["similar" is not a fact].
　In the previous figures, the boundary itself was out of alignment, but this also caused the meaning to be different from the "difference in resolution"; this time, the boundary is aligned.
　　Because [even if the resolution is the same, there are individual differences in the way they are delimited].

---
2019-06-11
I wrote the following on a page called [1D version of cognitive resolution
>I added the diagram I wrote in "[similarity] is not a fact" because it was difficult to understand when I reviewed it later.
>[Cognitive Resolution] drew in two dimensions, but this is drawn in one dimension. What is being represented is the same.

[https://gyazo.com/91df7115e9d7b7d3e914ff99472c0443]


---
2019-04-20
	Associated after drawing [Current Satisfaction], [Current Satisfaction 2
[https://gyazo.com/5733d894680e6441b2fd526f68b99afc]
	The same object captured with a high resolution camera will look different from the same object captured with a low resolution camera.
	Even if you look at the same thing in the same way, you will see it differently if the person's [cognitive] resolution is high or low.
	The difference in [resolution] is also the cause of the [interpretation swing in the proximity of meaning

	Example of low resolution
		A big bug flew in!"
	Example of high resolution
		A buzzard flew in, no harm done."
		A wasp flew in, and it's making a ticking warning sound.
		[Oscillatoria - Wikipedia https://ja.wikipedia.org/wiki/%E3%82%AA%E3%82%AA%E3%82%B9%E3%82%AB%E3%82%B7%E3%83%90]
			Large insects you see in urban plantings, etc.
			Some people are afraid of them because they mistake them for bees, but they are harmless.
		[Wasp - Wikipedia https://ja.wikipedia.org/wiki/%E3%82%B9%E3%82%BA%E3%83%A1%E3%83%90%E3%83%81]
			>M wasps have a strong defensive behavior of their nests and territories, so when approaching within 10 meters of a nest or territory, they will fly around the approaching person in an alarming behavior.... When wasps approach a nest or engage in a standoff with a bee, they will engage their left and right mandibles and strike each other, making a warning "ticking" sound, which is the final warning stage. In reality, most of the time, they attack in groups without warning. ) If you hear this sound, you should leave immediately as instructed.

There was also a page on [resolution of reality] with related content.

---
2022-09-17
　On 2019-04-22 I wrote about the example of the tussock moth, Ooskasiba.
　Below is the Ooskashiba
	[https://gyazo.com/baa42b4a6d481a4b37e0454fa5d5c8e4]
	Below is a Horsfield's hawk in the family Scarabaeidae
	[https://gyazo.com/827142fdebfb9d1df6ea4c45ff3edfff]
		https://www.insects.jp/kon-gahosihou.htm
　I didn't know the difference between the two.
　　When I saw the following video, I almost answered "What's this?" I was about to answer "a toucan" to the person asking "what is this?", but someone answered "a robin" first.
　　I looked them up and found that both are in the tin family.
　　　In other words, I would have recognized all creatures with the characteristics of the tinhorn moth collectively as the "giant skylark."
　　　Typical example of low resolution





