Nodal Point of Thought2019-04-21
Notes on getting out of bed
 [Methodological skepticism]
 [Dig deeper]
 [explain in your own words].
 [my words]."
 [Don't look outside for the right answer].
 [Verification] of "[can it be explained or not]."

[Nodal point of thought 20190419].
	>As for breaking free from adherence, the first step is [methodical skepticism], isn't it?
	What does "methodical skepticism" look like in the case of
	Doubt anything that gives room for doubt.
	Methodology for elaborating thoughts
	It is a methodology, but often only the idea Descartes finally arrived at as a result of using it, "[I think, therefore I am]," is taught in a descent way.
		Typical "[taking the top of the pyramid] is not what I expected" phenomenon.
		Memorizing and humming "[cogito ergo sumu]" and the like doesn't make you smarter.
	The "problem you tried to solve," the "method you used to solve the problem," and the "answer someone gave you" should be considered separately.
		I think, therefore I am" is only Descartes' answer.
			[copying the answer is futile].
		Descartes' "problem to solve" in the first place was "to find the right one for sure."
			In many cases, we're not trying to solve this problem.
		Descartes, a smart man, produced knowledge that is still mentioned in textbooks today, more than 300 years later, and his methodology is "methodical skepticism"!
			The practical value of learning and utilizing this methodology would be [philosophy as a practical science].

	Whether you can explain words in your own words
		[People who memorize things by rote can't dig in].
		The key is "in your own words."

[https://gyazo.com/eee6e8045aabf56519bf5f9c0e253ea6]
	Picture of a monkey throwing boxes at random and waiting to reach a banana by accident, and a human being who can efficiently search for solutions by piling them up with the intention of making them higher.
		Real monkeys are smarter than that. The idea that if you make random attempts you will eventually find the right answer is less than ape.

	[Technology evolution is non-Darwinian].
		[Random is the worst methodology.]
		Better to use it than to do nothing, but something that should be moved to other methods as soon as possible.
