2014 Leverage Memo Discussion
What I thought looking back after 5 years.
	>If the object to be written down was a single file, you would inevitably see what you've written before when you write.
		Okay, the advantage of "[seeing] next door".
		In Scrapbox, after adding a link, you can see "what the link is connected to".
		[Facebook's "This Day in the Past"] is also good
	There's the question of what to do with the private memo.
		Now Scrapbox has a separate project to put private stuff.
		But as a result, my frequency of looking at that project is by far the lowest.
		It's just a warehouse: contrary to [not a warehouse for dead text
	After 5 years, I still look at Twitter from time to time after all, so it was probably a good move to use private-bot to broadcast it to Twitter!
		This speaks to the image of "flowing my leverage memo," but it could be combined with [Incremental Reading].

---
April 2014 exchange [Facebook https://www.facebook.com/nishiohirokazu/posts/10203114800607433]
	O: How's the leverage memo? How much do you feel like you can look back and see?
	N: I've been adding leverage memos to one file, but I think the psychological cost of looking back over them has increased and decreased in frequency once I've printed over 8 pages. I am making leverage memos of leverage memos.
	O: Like a memo of a memo that gets polished up?
	N: Polishing. Under the working hypothesis that "knowledge needs to be read over and over again in order to be able to apply it to situations," leverage memo solves the problem of "but it takes time to read it over and over again," by "extracting only the important parts and making it easier to read it again.
	O: The fact that Nishio-san is able to continue is the strangest thing of all!
	N: I'm uncomfortable with the word "continue". I never stop reading, there's no reason to quit taking notes on what I read as needed, and if the object of my notes is a single file, I'll inevitably see what I've written before when I write. I just checked and it was March 6, 2009 when I started.
	O: It's not like you have to look at it often in your free time.
	N: As soon as you feel obligated to do something, you're not going to do it.
		But personally, my leverage memo is much more implicit than my Twitter timeline, so I'd like to have a system that can randomly present my leverage memo from the past as easily as Twitter does.
		It would be nice to see the leverage memo while waiting for the train.
		Should I create a dedicated leverage memo account on Twitter?
		Create a dedicated private account → Run a bot that randomly selects from past statements and posts at appropriate intervals →...
