20190422 unexplored interview
The video of the interviewee received during the event of Unexplored Juniors is now available.
I'm talking about network reconnection with unexplored foundations as hubs, but I didn't feel like I could get the message without the prerequisite knowledge.
	In 2011, when Dr. Takeuchi asked me to write a one-page essay on "Unexplored," I wrote what I thought was the most important message to convey: "[Unexplored as a network formation system].
 	I was adopted in 2002, so at this point it had been 9 years.
 Mr. Ukai was adopted in 2011, Mr. Arakawa in 2004, Mr. Yasukawa in 2012, and so on.
 	Alumni/alumnae participated in the annual results reporting meeting, and a loose network was created through face-to-face meetings.
		A "place for alumni/alumnae to give advice" was created for current students each year.
			A common purpose began to arise, "to support the projects of current students."
			Instead of just meeting face to face, "discussions" occur when we have a common goal.
			Get to know each other better.
				Related: [Gathering is the first step, staying together is progress, working together is success].
	In 2014, the General Incorporated Association Unexplored was created to do things that are difficult to do at an independent government agency.
		Unexplored Junior is a project started by Unexplored alumni who got together at an Unexplored Foundation event and hit it off in a bar.
		The costs for the first year of the unexplored juniors were covered by the unexplored foundation.
			Later, sponsors increased and the company became independently profitable.
	Unexplored Junior can be described as "a network formation system created with reference to Unexplored.
		And the creation of unexplored juniors is itself an effect of the "formed network".
		A situation in which a cycle of positive feedback is being built

2021-03-10 Subtitled.
	https://twitter.com/nishio/status/1369489946130612230

[https://www.youtube.com/watch?v=OUTLUlDSbP0&feature=youtu.be]

Related [2020 Unexplored Foundation: Project Generation Growth Process].
