Small trial and error required.
[https://gyazo.com/2c90a33b8ad90794277ff5479d2c4ee2]
If Organization B imitates the actions taken by Organization A to achieve its ideals, it will not work.
Previous discussions on this topic:.
	[copying the answer is futile].
		The story that copying the answer given by organization A to organization B is futile because the problem to be solved is different.
		I wrote that we need [abstraction], not copying the answer.
			⇔ How exactly can "abstraction" be done?
	[transfer of learning] in [Kaizen Journey].
		that copying the practices of organization A to organization B is futile.
		I say we should take the difference between organization A and organization B.
			⇔ The people in organization B don't know enough about organization A to make a difference.
				How exactly can we do that?
				Once you've taken the difference, how do you know how to reflect that difference in "practice"?
					It comes down to "abstraction."

The truth is that the ability to abstract is important.
But thinking that "first we need abstraction" prevents us from taking the "first step"
Isn't the first thing we need is a small trial and error?

[https://gyazo.com/bfb3ee3b4043f9277e5afea5d690a37d]
	Organization A's actions are actually a collection of detailed actions
		We didn't reach from reality to ideal by a single action.
		It's a series of small actions that have taken 10 years or so to move toward an ideal.
	Make the first step small: the [small start] principle
		Make it easier to step out
		No single one of them will achieve the ideal state.
			We need to make sure the B's are convinced of this.
	See if the result of a step forward is "closer" to the ideal.
		There is a discrepancy between the current situation in organization A and organization B, but there shouldn't be too many small actions that are completely counterproductive.
		Gain experience in making improvements.
			Success stories and concentration of resources may also occur.
		We need to convince the people at Company B that this is [trial and error] and that the results can be poor.
		After getting used to it, we'll make a few changes in our behavior to match Company B's current situation.
			Hopefully by this time I'll have a little confidence and resources.

Company A didn't go straight ahead in the first place, nor did it reach an ideal state.

[https://gyazo.com/d103961b7ec73e9ad58862514415fc64]

