Pleasing the masses is evil.
'Can't please everyone with your deeds and works? Then please a few. Pleasing the masses is evil."

Nishio's translation of a fragment of a poem by [Schiller] quoted at the top of [Klimt]'s [Nuda Veritas] (The Naked Truth).

[https://gyazo.com/1ea5800961b99420f9f9d740c67007c6]

Meaning that instead of trying to please the vague "masses," we should try to please a few more specific people.

relevance
 [leading painter]
　　The best poets write what ultimately few "I" think is good.
　The ambiguity of "the masses."
　　[Dazai Method]
　　[The monster that is the company.]

Translation Considerations
	Kannst du nicht allen gefallen durch deine Tat und dein Kunstwerk, mach es wenigen recht; vielen gefallen ist schlimm.
		Tat appears to be That in the picture.
			Not that it's an error, but the old spelling of Tat is That, first orthography in 1902.
		Tat means "deed" and Kunstwerk means "work of art.
		durch deine Tat, "by your actions."
		Kannst du nicht ~ , which means Can you not
		allen for all, wenigen for few, vielen for many.
		Mach es! ― Do it!
			mach = second-person singular imperative of machen
			So, "You should ~."
		recht is right, Mach es wenigen recht, meaning "do right for the few".
			I'm not too sure about the syntax interpretation here.
			It's a conjugated form of wenig, meaning "FEW," but it can be in the dative, genitive, or dative case.
			recht can be an adjective or an adverb.
				I think you need ist to use it as an adjective.
		schlimm is "bad."
		I'm not sure of the nuance of the word "gefallen" in "vielen gefallen ist schlimm", which is the same word as in the first half, and I'm not sure which translation to use for "please", "satisfy", "appeal", etc., but I think these three verses are a composition of the same verb applied to three subjects, "all, few, many". I think the composition is that the same verb is applied to "all, a few, and many.
	I'm not familiar with German grammar and syntax, so I'd appreciate it if you could point out any errors.

reference translation
	>If you cannot satisfy the multitude with your deeds and art, then do deeds and art to satisfy the few. It is wrong to please the multitude.
		https://www.artpedia.jp/nuda-veritas/
	>Consider how difficult it is to make everyone happy with what you do or what you express. Let some people be happy. Remember that it is wrong to make any man happy.
		https://www.musey.net/4456

Thoughts on translation
	I want to translate it into modern language.
	The distinction between "all," "a little," and "a lot" should be clear.
		Reference translation 1 is "many," "few," and "many."
		Reference translation 2 is "all," "how many," and "how many."
		Neither one feels right.
	Related Concepts [Leading painters].

	(Reference translation 1 describes it as a passage of "[Yosei ni yosu]", but I cannot find anything like it in "[Yosei ni yosu]".
		[Full text of the 3rd "Yoroshiku ni yoroshiku" (Yoroshiku for Joy) | Hamamatsu Freude Choir http://www.freude.or.jp/?page_id=499]
		The lyrics of Symphony No. 9, which is also the subject of [Beethoven's Frieze] by Klimt, are derived from the lyrics "[Yield to Joy]," so you may be confusing the lyrics with that.

	[Friedrich von Schiller - Wikipedia https://ja.wikipedia.org/wiki/%E3%83%95%E3%83%AA%E3%83%BC%E3%83%89%E3%83%AA%E3%83%92%E3%83%BB%E3%83%95%E3 %82%A9%E3%83%B3%E3%83%BB%E3%82%B7%E3%83%A9%E3%83%BC]