Jiro Kawakita did not say to abstract.
In the process of making tableplates for the KJ method, [abstraction] occurs as a result. However, Jiro Kawakita does not say, "Do abstraction. Rather, he says, "Never abstract too much.

>The reason why the nameplate comes to mind is that the one-line headings on some "familiar" pieces of paper have not only a meaning on the letter-symbol side, but also an "associative" atmosphere surrounding and surrounding the center of the meaning. This is the reason why I cautioned against "never over-abstracting" when creating one-line headings, "don't stick to rigid idioms and terms of art," and "retain as much of the original material's 'earthy' flavor as possible. The minimum necessary "conceptualization process" is important, and should not be unnecessarily reduced to a "concept. ([Idea] p.141)

This is because the word "abstraction" itself is abstract.
	When people are told to "abstract," they don't know what specific actions to take.
	So to call the process of nameplate making an "abstraction" is itself [an excessive abstraction].

relevance
　Associative atmosphere → [shadow of a word].

Jiro Kawakita made the distinction between "abstract" and "conceptual" in an attempt to explain this.
	The term "conceptual" refers to the fact that the attempt to "abstract" results in something that is not firmly built on top of the concrete.
　(Nishio often describes them as "abstract concepts like floating weeds" that are "not firmly rooted in concrete facts. see [parable of the floating weeds and trees].")
	>Is it possible that the higher the group formation, the more abstract the nameplate becomes? Quite a few people think so. But I would first like to distinguish here, in my own way, between the terms "abstract" and "conceptual. If you make an imprecise grouping, as you accumulate the groupings in several stages, they will become more and more out of touch with the actual situation. Finally, it becomes ridiculous, and the grasp of the actual situation collapses. I would like to call this situation "conceptual.
	>On the other hand, the more precise the grouping, the more it gets to the heart of the matter. This is what I call abstraction. Therefore, "abstract" is very different from "conceptual. If we call something abstract in this sense, we might describe it as becoming more abstract the more groupings are piled up. And in this sense, the more abstract we become, the more we have the ability to get to the core of concrete things. I would especially add this because there is quite a bit of false popular belief that "the more abstract you become, the less useful you become for concrete things." If we were to illustrate this metaphorically, it would look like Figure 26. ([KJ method: Let the chaos speak for itself] p.153-154)
 > [https://gyazo.com/987bf8eaf0a3f74ecfacceaf75c7db3a]
