About 2012 Pomodoro
I'm reprinting here an article I wrote for Hatena Diary in 2012, which was automatically reprinted on Hatena Blog, because I received a reference to it on Twitter.
src: [About Pomodoro - Yasukazu Nishio's Hatena Diary https://nishiohirokazu.hatenadiary.org/entry/20120621/1340206214]

---
About [Pomodoro
編集
I tweeted about it on Twitter when asked, so I'll summarize it here so it doesn't drift away.

First of all, those who say "1 pomodoro in 25 minutes, so in 8 hours, that's 16 pomodoro?" should understand that that is as strange as saying "a human can run 100 meters in 10 seconds, so he should be able to run 4200 km in 4200 seconds". You cannot maintain the speed of a short-distance runner in a long-distance run. People who make such calculations based on "working 8 hours a day" do not understand Pomodoro's goal of "concentrating and achieving results in a short period of time" in the first place.

This is not my way of interpreting the situation. If you have read even the preface of the Agile Time Management: An Introduction to the Pomodoro Technique, you will immediately recognize the misunderstanding. It states. I thought I could do 12 Pomodoro minutes a day. However, when I opened my eyes, I found that 8 pomodoros at most was a realistic line" (quoted without the part not related to the meaning of the sentence).

The rest is an introduction to how I do things.

BGM
First, I made a playlist of about 28 minutes of songs that I have been using for work background music for some time, and I listen to it with muffled headphones while I work. The last song is a slow one. It kind of tells you that the end is near. The last song that tells me that the end is near is included to avoid being startled when my work is suddenly interrupted by a buzzer, or conversely, to avoid being so focused that I don't notice the buzzer. It takes time to bring the work to a satisfactory conclusion.

Since this is the background music, I do not use a tick-tock timer. I was annoyed with timers whose tick-tock sound was slightly delayed by the work load, and I also wondered if it would be a good idea to actively make the sound at work in the first place.
	(補足2019)
		Using a physical tick-tock timer is a good idea, but I didn't use it because I didn't think it would be a good idea to make a "tick-tock, jingle" sound at work.
		I tried the tic-tac-toe app on my phone, but stopped because of the tic-tac-toe timing delay.

timer
The iPhone's standard timer has a silent end tone and a 25-minute countdown. I can see the remaining time at a glance. However, since I basically judge the end by the music, I think it might be better without it. When I look at the timer and see 1 minute and 30 seconds left, I feel like it's too short to do anything and I'm wasting my time.

The disease of wanting to create task management software
Engineers tend to say, "Is there any good task management tool? But now I manage my tasks with sticky notes and notebooks. I can work more easily now than when I was trying to do something digitally through trial and error. I understand the desire to create a good software, but why don't you first identify what kind of specifications are necessary by using the alpha version of the paper version? Paper may be sufficient for your needs.

付箋
By the way, I forget what size the sticky note is called, but it's the size of the throwaway paper in the bottle-shaped gum container. It's like writing one pomodoro's worth of tasks and leaving a blank space. The margin allows me to write a little more, but not so much that I hesitate to throw it away when the task is done. It's just right.

(PS: This is it...4cm*5cm in size. http://www.mmm.co.jp/office/post_it/list01/653rp.html )

These sticky notes are divided into temporary variables, and if they are no longer needed after they are out of scope, I immediately roll them up and put them in the trash. When I used to use larger paper, I would strike out the ones I no longer needed, but it was ugly. I've since become comfortable with the size of the paper, which I can throw away mercilessly.

If you use a large piece of paper for your task list, you will end up writing things on the task list other than "what you need to focus on now," and then you will see them while you are working, which will cause unnecessary processing. The list with all the tasks should be placed somewhere out of sight while you are working. For this reason, I use small sticky notes for "current task.

Another advantage of using small stickies is that tasks that have been written but not executed become physical "stickies that stay on the desk all the time" and gradually lose their adhesiveness and seem to fly away in the wind. If you don't want to lose them, they are "non-urgent but important tasks" and should be done with care, otherwise, don't do them. If not, don't do it. Roll it up and throw it away.

手帳
Also, this is something my wife has educated me on. In the past, I used to use the monthly spread of my notebook for writing "future plans" and did not look at it very often. My wife, who is much more experienced in her work than I am, uses it differently. She keeps a daily log of her "present" as well as her appointments, and the past dates are basically filled in. The benefits of this.

First of all, the frequency of opening a notebook increases overwhelmingly. Especially for R&D workers like myself, we don't have many appointments because we don't have many appointments with other people. If you don't have many plans, your notebook will be empty, and you won't look at it very often, and as a result, you will forget to write things down or look at them, making it completely meaningless.

This is [Organizing what you need quickly! Organizational Techniques to Get What You Need Out!!!]. The techniques in tidying up books by people who can tidy up assume that things have a fixed place and are regularly put back there. It is so obvious that it is never mentioned, but that is the basic premise. If that basic premise is not fulfilled, copying techniques alone will not work. Pomodoro and GTD are the same, and I think the implicit basic premise is that "there must be a list of tasks, and it must be reviewed and updated on a regular basis.

If I had had a job when I was younger that involved meeting with a lot of people or having a lot of meetings, I might have learned how to use a notebook naturally. Unfortunately, I did not acquire this ability until recently. I started using the same notebook as my wife the year before last and tried to imitate how she uses it, and as a result, two months ago, a situation began to develop where the notebook is checked every day, the Pomodoro accomplished on that day is written in the notebook, and the past dates are basically filled in. I'm getting much better at estimating the amount of work I can do in one pomodoro. I feel like I am in control of my concentration.

付箋(2012-10-02追記)
I write the pomodoro I plan to do tomorrow on a single sticky note and stick it in my notebook (often).

Review it in the morning when you put it on your desk at work and revise it if necessary.

Work. Each Pomodoro sticky note is thrown away as soon as the Pomodoro is finished, but "what has been completed" is recorded by checking a check mark on this "Today's Task Sticky Note".

At the end of the day, transcribe the completed pomodoros into the notebook and discard the sticky note.

Often, while performing a task, I think of a "task that should not be done now. I write it on a separate sticky note and stick it in my notebook. The notebook is usually closed, which prevents me from getting distracted by other tasks while I am executing them. I review it during breaks between Pomodoros, during the Pomodoro, and at the end of the day to decide when to do it and when not to do it.

Not much time (Added on 2012-10-02)
I can't estimate the time for debugging or anything; I started one pomodoro and it took me five minutes." What do I do with the other 20 minutes?" I see. It often happens that a part of the Pomodoro is left over as a result of trying a task that is difficult to estimate. What do you do in those situations?

Since the start is not clear, it is not suitable for doing "something completely different" that requires a fresh start. Therefore, it is better to do something related to the work you have just done. Among those tasks, it is better to do "tasks that do not take much time" or "tasks that can be separated by time. For example, tasks such as "downloading a document that I will need later" or "cleaning up the sticky notes on my desk" are likely to be completed quickly and will increase the productivity of the Pomodoro, the task that follows. Tasks such as "Googling and researching" or "flipping through a reference book" do not have a clear goal and time cannot be estimated, so they tend to be done lazily if done without a time limit. They are suited to "skimming" time.

過去の記事
Pomodoro started.
A year and a half ago. A fresh diary of the day I just started. Compared to those days, I have much less "distractions during the pomodoro caused by me".
Pomodoro Reconsidered
Article 3 months after starting. The mistake of working without turning the timer has not gone away yet. I wonder if it is because I haven't done the measurement of the mistake of not turning the timer after all. This article also did not turn the timer.
Sequel Pomodoro
The effect is to move forward with one task a day, even if you don't feel like it. It is important not to immediately put a newly arising task on the "to do today" list if it is not urgent.
Pomodoro and PDCA Cycle
The "I'll do it today" declaration is followed at the end of the day by a "Did you do it?" check at the end of the day. If you just put it in the task list, even if you don't do it on that day, the check will not run.
Pomodoro is here - Togetter Summary
Pomodoro talk by nishio and yoshiori - Togetter Summary
