Rules for not making up words on your own.
>The problem with the affinity diagram method can be summed up to one point: "It is difficult to conceptualize the higher level. (Abbreviation.)
>This can be solved by "not making up words on your own. The difficulty comes from trying to conceptualize it poorly, so we can just borrow words from lower-level data.
	[You can't come up with a good idea - Tokyo Institute of Technology Engineering Design Project - Medium https://medium.com/titech-eng-and-design/%E3%81%84%E3% 81%84%E3%82%A2%E3%82%A4%E3%83%87%E3%82%A2%E3%81%AA%E3%82%93%E3%81%8B%E6%80%9D%E3%81%84%E3%81%A4%E3%81%8F%E3%81%AF%E3%81%9A%E3%81%8 C%E3%81%AA%E3%81%84-150d649d6082]

This appears to be a plot evil if you only look at the letter of the law.
	The method is focused on lowering the hurdle so as not to hinder ideas, but by introducing a "no-go rule" you are raising the hurdle.
	Limiting sampling to "the first thing that comes to mind and is written on a sticky note" precludes the adoption of what comes to mind later

But if you read the rest of this blog post, the impression you get from the first half of the post is the opposite: that it's a bit of a "no-brainer".
>You may be thinking, "What the heck, I can't abstract it at all," but product/service development (unlike ethnography, etc.) is not about analyzing data itself, but about creating new value through analysis. Therefore, it is OK to chop up the words of data and combine them to create a new story without any abstraction.
I agree with the idea that "creating a new story" in this part is important and "abstraction" is not necessary. I think you are raising the bar by using the "don't make up words on your own" rule to "create a new story."

If "creating new stories" is important to you, then this is the wrong place to start.
>The problem with the affinity diagram method can be summed up to one point: "It is difficult to conceptualize the higher level.
Do these "higher conceptualization" and "abstraction" mean the same or different things?
If they mean the same thing, it is a situation of "trying to do something that is not necessary and saying it is difficult," and if they mean different things, there seems to be a confusion in the speaker's understanding when he explains by invoking the unfamiliar terms "higher conceptualization" and "abstraction.

I use the term "nameplate making" in the KJ method to describe this process, and I instruct by saying, "Please make a nameplate that explains the contents of this group. If the participants have not yet mastered the skills of nameplate making, they naturally cannot make nameplates when I ask them to do so, so I ask them to verbally say, "Please explain," and assist them in making sticky notes. This creates a "story of why these stickies are here.

I wrote an actual example in the "Group Formation Requires a Change of Mindset" addendum in the "Intellectual Production Techniques for Engineers" section.
>I asked about each group, "What is this group like?" and listened to the explanation. If the explanation was too long, I would shorten it by asking, "In a word?" If the explanation was one word, I asked, "What is one more word? If the explanation was one word, the group asked, "What would you add to it?
If this does not work, i.e., the group cannot be easily explained, then the original group is not appropriate to begin with and should be broken down and rearranged. Jiro Kawakita also says to verify if it can be explained well.

[Idea method] p.74
>After a considerable gathering, I picked up a piece of paper from one of the teams and took a closer look....
>Read more...
>"Why did I collect the five pieces of paper here?" is the rational counter-question....
>Once in a while, I realize I made a mistake collecting them in one place...
>In most cases, the contents of the five pieces of paper tell us the reason why we should collect these five pieces of paper.
