Scrapbox to manage project tasks.
2021-03-11 see [updated status indication should be a pictogram at the beginning of the title].
Looks good, so I'm going to move closer to this in the future.

[There are two types of task management.]
-----

I observed the shokai's approach and thought about it.
	[Priority is determined by integrity.]
	[Developed by Scrapbox]

procedure
	1: Decide on tags for fine-grained pages about your project
		Looking at the usage of shokai, it seems that this fine grained page is neither an "Issue" nor a "TODO" page
			There are fragments of "this is the way it should be."
		Like the Inbox in [GTD], you need a place to write things down and put them in anyway, regardless of whether they are tasks or not.
		shokai says "no longer tagged"
			This is probably after the following process, so anyone starting now should put it on
 			First, manage everything with a common tag.
 			In operation:.
 				Maps can be made in the brain.
 				Too many pages and too many "pages with common tags".
 			This results in more segmented tagging
	2: Write down everything you care about.
		Create a page and tag it
			It's more convenient for Scrapbox if they are individual pages.
		Even putting the listing on a tag page is a good first step.
			It is important to lower the hurdle for the first step.
			Making a list is a low psychological hurdle because we are used to it.
			If you want to write something that can't be expressed in one line, just turn it into a page.
			Add an additional description to the line, and then use the "new page" menu to bundle it into a new page.
				The link to the tag page is automatically added.

	If all pages about that project contain the keyword X, it is easier to narrow down the search
		No need to be a "link" with keyword X
		If it is a link, it will be listed on the Keyword X page.
			That's an advantage when there are few, but becomes meaningless when there are many.
 Advantages of making pages, old ones sinking naturally?
	One thing you can do at a time, so don't be full of TODOs.
		[WIP Restrictions]


An example of how writing development considerations all over Scrapbox can combine and advance ideas in a design where they were not anticipated.
>I was wondering if the add and edit screens for stickies and the detail view screen should be the same thing,
>I was reading a past discussion and it said [stickies are immutable],
> Then it should be a "reuse" button, not an "edit" button, I concluded.
	[Reuse instead of "edit"].

Related [Scrapbox and Project Management].
