pRegroup2020
Tags for fragmentary tasks related to [Regroup] (pieces for Regroup project)
　Renamed from pRegroup to pRegroup2020 on 2021/01/04.
	Context: [project task management with Scrapbox].

A note on the current situation for when we come back.
　[You can create a new map offline].
　　Using [mobile export tool] as a prototype
 　If you go offline while editing before the cloud save is done, and then come back online again, you should not overwrite edits made elsewhere.
 　　Read in the transaction first, overwrite if you can, if not, try to merge, and if ultimately you can't merge, notify the user.
 　The need to create this has decreased as I've become primarily a telecommuter in Corona.

[Is co-editing really necessary?]

[TESTING FOR PRESERVATION]
	> If you try to do something like "save locally when offline," you'll need to disconnect anyway.

Shuji Hamaguchi brain model would be good to map with Regroup.

　Attach creation and modification dates to items

	Resolve the situation where ReactApp appears in the title.
		Put "Set Title" on map?
		Throw the range rendering results to gyazo or something else for thumbnails?
	Is the sticky in the top left most corner the title of the map?
　Looks like a good idea to add a "Set as Title" menu to the sticky.

	The group's frame is a fixed size, but then it's hard to select when zoomed out, should we make it zoom dependent?

	Lasso drag, no ghosting yet, which is great when you're simply organizing, but hard to do when you're trying to line up with what's already in place.

 The ability to move single stickies even in lasso mode makes it easier to organize a large number of stickies on a PC, but it is inconvenient to switch tools only for parallel movement.
 	Should it accept multi-touch, so pinch to zoom, two fingers to translate?

	I know there are multiple ways to operate it so that it can be used on both iPad and PC, but to avoid mishaps, it's better to judge the device and destroy unnecessary paths. There's no need for the iPad to have a parallel movement mode in the menu in the first place.

	Not redrawing when path style is changed.

	When I create a read-only link, Safari blocks the popup.

	I've been able to save a 4-page note.
		That's the upper limit we could hit, though, so I'd like to visualize the remaining amount.
		Or make it full-blown uncapped.

 When I tried to move a sticky and drew a line as a result of multiple sticky import in pen mode, the sticky disappeared when I Undo.
		Undo path bug, undo is implemented, but the status indicator on the undo button is buggy, so the button cannot be pressed.
  If you write something and undo it while it's still in the buffer, the first thing that was drawn will disappear, not the buffer.


 Single sticky add dialog, rather unnecessary.


	Easy Export -> [Mobile Export Tool] [pKakidashi].
	Solving the inconvenience of Notability -> [pTegaki].
		[Note-taking experiment]

	Discussion at the end of 2019
		[There are three types of diagrams], what I really want to do is [diagram for thinking] = [increase my intellectual productivity].
		There's a blurring of axes on [diagrams for communicating] and [diagrams for sharing] to make it easier to explain to others.
		[You must first thoroughly satisfy your own needs].

	[The style you are currently selecting should be visible on the screen].

	[Regroup2020-01-27]
		I want to eliminate pain points in the KJ method using paper sticky notes.
		　[Situations where you might want to use Regroup]
			The "infinitely wide whiteboard" condition is more appropriate for this purpose


	[Import from Scrapbox]
　　Type in Scrapbox URL instead of importing text
　　[not aiming to look as good as Scrapbox].

　[Full-size image sticky]

	[Style change UI improvements].

	[Lasso selection is not ghosting.]
	 Movement with the lasso is sluggish because it is not ghosted.
	 There is also a delay after the lasso move.

 Palm contact may cause violent screen movement
	Add Item
		Drag and drop to an existing group

	Palm rejection, only pen input should be accepted.
		Parallel movement for finger operation

　Overall view
　　If no coordinates are specified, first zoom out to where the entire image is visible.
　　In the future there should be a mini-map

 The bottom of the canvas is cut off about the height of the toolbar.

 And copy/paste, "Copy is fine with the balloon, but what about paste?" So now that we have a generic menu, we can put it there for now.
  I'd love a shortcut key, we have a problem.
  	I want to use it on my iPad, so the functions I want shortcut keys for should be in the menu.
	 I'd like [feedback] that says, "I copied you."


　Undo with lasso selected, lasso remains

　Border of a group of paths
	　Maybe a border could appear on the ghost when a group of paths are dragged.
 	Result of [Automatic Path Grouping
 		I lassoed the garbage to make it disappear and it all disappeared.
 		A border may appear when selected.




[pRegroup2019]

done thing
	[pRegroup-done-2020]
	[pRegroup-done-2019]
