There need not be a single vanishing point.
	Parallel lines, when extended, intersect at one point
	That is the cause of what is called the vanishing point in one-point perspective.
	However, in Ghibli's background painting, the vanishing points of the right and left walls do not match [src https://twitter.com/Masa_Ikku/status/1133353250474737665].
	They say it's done intentionally.
		>In "Princess Mononoke was born this way," he said, "One-point perspective is an illusion discovered by Westerners. I would draw it with two vanishing points without any problem" (atmosphere). [src https://twitter.com/TN23_Kehaya/status/1133401790840393730]
	This method seems to have been commonly used in hand-drawn architectural perspectives and animated backgrounds before Miyazaki's anime [src https://twitter.com/eno1963/status/1133361014622179328].
		Example of achieving the same thing in 3DCG: [src https://twitter.com/eno1963/status/1133392109053054980]
		Vanishing point is created by "parallel lines intersecting at one point", so the right wall and the left wall must be parallel to each other to occur.
		In the case of this image, the 3D model itself is deformed.
			Perhaps to narrow the distance.
	The Spider-Man movie similarly "deforms what is parallel in reality so that it tapers off" [src https://twitter.com/yanamosuda/status/1133362578057441282].
		[https://gyazo.com/a8c2caa6aac92695f28c2ecf48efea6d]
		[src https://www.youtube.com/watch?time_continue=63&v=vH-LpARZurY]
	Why does the phenomenon of "this is more natural for humans" occur?
		There are two theories: 1.
			A: Because humans move their gaze to look at their surroundings and combine them into a single image [src https://twitter.com/Masa_Ikku/status/1133372628733792256].
			B: Because it is a composite of what the two eyes see [src https://twitter.com/mizpi/status/1133426655010017280]
		Think about how natural it would be if something long and vertical were drawn.
			Human eyes are aligned horizontally, so there is no "two eyes effect" with respect to the vertical direction.
			On the other hand, both vertical and horizontal are the same in terms of moving the line of sight

This was a [blind spot], but it's not versatile enough to be a [blind spot card], so I'll note it once.
