Feedback 3
	0.3
		>Just remembering the answer not allow you to adapt to the situation.
		>Just remembering a fact or the the answer to a problem doesn’t allow you to adapt to the situation.
		adapt/adjust?
		How about: Just remembering existing solutions of existing problems doesn’t give you ability to solve new problem.

		>based on data of those who do not motivate more than 12,000 people.
			>Is this correct?
		I mean:
			There are more than 12,000 people
			They are not motivated
			They used my web-service to motivate theirselves
			I collected data from them

		>We also need to remember  what we have learned. In Chapter 3 “To train memory,” I explain the mechanism of the brain,  experimental results on how to learn, and how to efficiently fix the memories enabled by software.
		"how to efficiently fix the memories enabled by software"
			I want to tell:
				how to remember efficiently
				not only mnemonics techniques
				but also there are software to enhance your remembering ability

		>It is easy to think that "learning = input," but it is necessary to verify learning by outputting. However, as the amount of knowledge increases with many inputs, it makes it difficult organize  the material and being able to relate it to others.  
		The structure is "A but B. However, C"
		How about:
			>It is necessary to verify learning by outputting. However, as the amount of knowledge increases with many inputs, it makes it difficult organize  the material and being able to relate it to others. 
			correct?: "it makes it difficult"
		>Since human beings can’t copy the knowledge we have acquired  entirely to other people
		I mean:
			We can’t copy the knowledge in the brain of others

		>I think “what to learn” is more important than “how to learn.”
			>Is this correct?
		Yes, because even if you learn useless knowledge efficiently, you can't gain value from the knowledge.
		Of course, there are no "correct answer" for the question "what to learn"
		I'll tell "there are no correct answer" in the chapter.

from [pIntEn]
Feedback 3