How to deal with unmotivating comments
It occurred to me that if people who are trying to do new things in large companies collected comments that discourage them from doing so and distributed them to young people along with a set of coping strategies, innovation in Japan would become more active.

Call for comments on demotivation & how to deal with comments
-----
	The discussion was very lively on Twitter [src https://twitter.com/nishio/status/1135513301910204416]
		What I missed when I started.
			Whether it was a supervisor or a third party who made the demotivating comment has a big impact."
			I was envisioning a "third party who inadvertently makes demotivating comments."
			Some large companies are actively trying to demotivate people with the idea that they want to demotivate their subordinates because if they do something strange, it will affect their own career prospects.
			The former can be passed off, but the latter tries to demotivate with clear intent.

-----
	I think it's fine, but what do others think?"
		Sample Answers
			Thank you!"
				You take "I think I'm good" literally and go through the second half.
				What do others think?" does not mean "What do others think, you answer now?"
					There's no way I could answer a question about what other people think of me.
						You wouldn't happen to ask such a crazy question, would you?
				If you are explicitly told "Hear what others think.
					If that's the line of someone who has command and control over you, you'll have to do it.
					When you have a hearing, of course say "Mr. X said it would be nice," first.
	It's unprecedented."
		Sample Answers
			'Yes, it is! So it's worth doing!"
			If you're doing something that has precedent, you're just following in the footsteps of other companies."
	Something similar was made by ~~ (another company, research institute, etc.)."
		Sample Answers
			I see." Thank you for the information! If you don't mind, I'd like to know more about it."
 			The "similarity" is merely subjective to Mr. X.
 			That "Mr. X has had things in the past that he feels are similar" is not a reason to stop.
 			A vague "I heard there was something similar" has no informational value.
 			You should specify what exactly you consider similar.
	We have applied for a patent on this technology" (not my boss, but someone from another organization).
		Sample Answers
			'I see! Let me know your application number so I can check!"
				Patent applied for" does not mean "patent right registered."
				The fact that you put it this way means that the speaker does not have patent rights at this time.
					Not a reason to avoid similar work areas.
				If it is true that you applied for a patent, it will automatically be published after 1 year and 6 months unless you withdraw it.
					Ask for the application number in the form of "I'll check when it's published."
				Possibly not even "applied for" due to ambiguity in Japanese.
					I'm preparing an application, consulting with a patent attorney to see if I can file, and thinking about filing."
						Some people say, "We have a patent pending" in this state.
					There's no reason why I can't tell you the application number, so if you don't tell me, I can assume you didn't file.
	We have applied for a patent on this technology" (not my boss, but someone from another organization).
		Sample Answers
			'I see! Please give me the patent number so I can check!"
				If the patent registration is truly registered, you can check the patent online.
				Look at the claims of that patent and if they don't apply to what you're trying to do, don't worry about it.
				Even if the claim is applicable, the provisions of Article 69 of the Patent Law can be used.
					>Article 69 The effect of a patent right shall not extend to the working of a patented invention for the purpose of experiment or research.
	"We compete with 00 in the company."
		Sample Answers
			I'd rather eat myself than have someone else eat me."
				Suppose that the company's product A may compete with the product B that it is now trying to sell.
				Since the same market share is compared between "only A has it" and "A and B are eating each other", the conclusion is that the investment would not be happy in the latter situation.
				But implicitly, however, you're making the assumption that others won't enter the market, and there's no evidence that's correct.
				If you compare the same market share between "A and company B eating each other" and "A and company B eating each other," your company is better off.
			rebuttal
				It would be a duplication of investment, so if you're going to do it, talk to the other side and sort it out."
	You're going to have to take the blame! Are you okay with that?"
		Sample Answers
			Yes!" (cheerfully)
			It's unclear what exactly the "responsibility" is, but the people saying it probably don't understand it, so it's useless to discuss it.
				If you want to try it, you can ask, "What exactly is your responsibility?" I'd be happy to ask.
			You can only discuss it after you have a specific problem and are asked to take specific responsibility for it.
				I see, I'll go talk to my lawyer to see if I should quit.
			rebuttal
				'You can't do that, the responsibility can only be taken by PMs and above, so we have to be cautious.'
					Hmmm, I don't know what to do.
	'It was only made into a project this year, but it was originally a one-person project from last year, right? So I can't include it in this year's evaluation."
		Sample Answers
			I see!" (cheerfully)
			I see the situation that Mr. X does not want to evaluate as a given constraint because it is futile to discuss it in any way.
			The "Mr. X doesn't appreciate it" is subjective to Mr. X. Mr. X's issues, not yours to deal with.
			'Mr. X doesn't value you' doesn't mean 'you're not worth it.' It could be "Mr. X doesn't have the eyes to see."
			It is better to move in the direction of creating an evaluator other than Mr. X. For example, be evaluated by the market, be evaluated by someone greater than Mr. X, etc.
			If an evaluator other than Mr. X evaluates you, it proves that Mr. X did not see things the way you did.

	Will it be profitable?"
	Will it always succeed?"
	What synergies do you see with your existing business?"
	We've had our fill of that kind of thing."
	You're still inexperienced, so maybe you need to get more experience."
 'It's all well and good to do that, but this is a big company and there are transfers and stuff, so there's no guarantee that you'll still be here next year. If you can't continue with the people who are left, then you shouldn't do it."
 It's already been decided that this area is under the jurisdiction of Department XX, so we can't touch it."
 We can't build barriers to entry because we don't have any strengths that are unique to our department, and if people imitate us, we're finished."

	Cases where the person with the authority to make a decision does not make a decision
		It should be considered as a GIVEN constraint "not to be decided".
		If there was a person who started his own business in the same situation as you, he would not have the "money will come out if you get the decision makers to say yes" situation itself.
		So "the decision makers don't say no" is the default state of society.
