Listening Chat System
2021-09-10 In order to create a new version of Keichobot, we decided to keep the old version here.

---
This is a system that assists humans in putting into words "thoughts that have not yet been clearly verbalized" and encourages awareness.

Specifically.
　The program [nisbot.icon] and a human chat with each other
　The program extracts key phrases from human statements and asks questions about them
　When people are asked questions, they think more concretely, from a different perspective, and their thinking develops.
　Repeating this will turn vague thoughts in your brain into an observable chat log!
　Often in this process, I realize that I have assumed something or made an oversight by thinking only from a particular point of view!

操作方法
	画面例
		[https://gyazo.com/6b2e63fcadb339191138e054833d6d0a]

	始め方
 	Accessing https://keicho.netlify.app/ will bring up a chat-like screen
 	　There is no account registration.
 	The program begins by asking you, "What would you like to see happen in this conversation?" and asks you, "What would you like to see happen in this conversation?
 	　You answer it and the conversation begins!

	treatment
	　Type a sentence in the input field and break the line to make a statement.
 	The program will select keywords from your statements that you might want to dig into and ask you questions about them.
 　　The first time may take about 10 seconds.

	how it ends
	　There is no end to the dialogue.
　　You may disregard and leave the program question at any time.
　　Show URL to share will issue the URL of the page (log screen) for others or future self to view the log.
　　[** [https://gyazo.com/a2e3fb334295139e50d889e45c29d1d2]]→ [** [https://gyazo.com/648afca607e965e7c1beb856b90d5dbe]]
		Export for Scrapbox" on the log screen produces output in text format suitable for pasting into Scrapbox.
			[** [https://gyazo.com/b477da1720b11efef0a3a5d26e7246c5]] →[** [https://gyazo.com/b34aa7f3486f33da279a69af3ba4550b]]
			It will look like the following
				[nisbot.icon]What would you like to see happen in this conversation?
 	  [nishio.icon]操作方法の解説がしたい
  	 [nisbot.icon]What type of commentary is that?

Tips on how to expand on a story
　One of the best tips for getting a conversation going between people is to [Answer, Add, Ask]. This means that you not only answer the other person's question, but also add additional information and then ask the other person back.
　In this chat system, the program asks the questions. So you answer the questions, add more information, and expand the conversation.
　If the program's question is out of line with what you want to talk about, you can direct the topic by adding more information than the answer to the question. The program decides that words that come up repeatedly are important to you.

Image of usage
　For example, when you think, "Hmmm, what should I do about X?", you can talk to this system on your smartphone while taking a walk and say, "I want to organize about X" and interact with it.
	See [Sample of how to use Kikidashi Chat] to see how the author uses this system.

[Keicho:高度な使い方]

object-oriented mode
 [Writing support mode]
 [Reflection support mode]
 [proposal support mode to make].

[** FAQ]
 Handling of written submission data
 　No third party will read the URL unless you give them the "Show URL to share".
 　　Specifically, the 20-character randomly generated ID attached to the URL is used to identify the dialogue
 　	例: `https://keicho.netlify.app/#talk=yAJxKTwc1ryiUTUbihUA`
 　The developer (Nishio) can read
 　　I intend to use it for machine learning training data.
 　　If there are many people who do not like this, we will consider offering it as a paid plan.

	Initial icon [https://gyazo.com/28e60b661e014a084303c67a83c7ea7f]
 	[https://icons8.com/icons/set/bot Bot icon]  icon by [Icons8 https://icons8.com]
	Homemade icons [nisbot.icon].
