transactive memory
	[What is "transactive memory"? - Japan's Human Resources Department." https://jinjibu.jp/keyword/detl/607/]
	[how to build a high-performance organization by learning from the world's most advanced management science "Transactive Memory"｜#Organize Your Thoughts https://www.countand1.com/2016/10/implication-from-transactive-memory-to- build-high-performance-organization.html]
	>"Who knows what" knowledge,
 > This seems almost equivalent to sharing tacit knowledge in the SECI model.
 	https://twitter.com/tokoroten/status/1135441728608002048
	>self-disclosure -> psychological safety -> chit-chat -> self-disclosure
 > Transactive memory is created by cycles of
		https://twitter.com/tokoroten/status/1135442423545454592
	>"Is it better for everyone in the organization to have such a transactive memory, or is it better for the organization to have someone like a "transactive memory shop" and have it centralized in that person?"
		Paper recently published in the Academy of Management Journal (read later)
		[How is diversity in Japan, to be frank? / Interview with Shoei Iriyama, author of "The World's Most Advanced Management Studies You Can't Learn in Business Schools" (Interviewer: Yasuyuki Iida) | SYNODOS | Page 2 https://synodos.jp/newbook/15645/2]
	>There are a certain number of "information curators" who track, organize, and input a vast amount of information within the company.
		[A story about an employee who reads all the daily reports of about 500 people and is truly amazed at how well he keeps track of internal information | Cybozu Style https://cybozushiki.cybozu.co.jp/articles/m005360.html]

Q: Do you feel that the Cybozu curators were born spontaneously and you started calling them "curators"?
A: 
	Some people were originally interested in the activities of various people in the company.
	I was sticking my neck out because it was a free to watch situation.
	As the organization expanded, everyone began to see the benefit of such people's activities.
	→Positive Feedback
I think.

	It was done without any particular name in Cybozu.
	It's called an "information curator."
	Published in the on-demand media
I thought this was the phenomenon of "positive feedback is now circulating and can be observed from outside the company".
