Examples of time lost due to problems
After nine years of making my own board game, I have come to realize that I lose motivation when I think of "mass production" and gain motivation when I think of "improvement of a one-off product. Therefore, I decided to upgrade the parts of the game that used to use hard sleeves and poker chips for inexpensive prototypes by using materials and methods that are not suitable for mass production. The cards will be laser engraved in acrylic.

----- 
Come to TechShop and work in Illustrator (1 hour)

I didn't outline the text in XD and couldn't open it on my TechShop Win machine & it wasn't in the menu under text. Convert to Object -> Path -> Convert to Path (Cmd+8) and it's OK.

I researched what must surely be there and learned about the "Graphic Styles" feature, a feature from Illustrator 9.0. It is convenient to apply styles by drag and drop. #There must be power

I was thinking of different designs last night, but I'm starting to think a minimalist look would be cooler...
Life counters and flag chips, the same thing, is a good theory.
→ Then we found out that if we made them the same, the players would be confused.

We need to get cracking because we have a schedule behind us today and can't extend it if it doesn't work out.
	First, check that there are no problems with each data in black acrylic, which has the most area to spare.
	Start processing with data that has no problems, while concurrently correcting any data that has problems.
I thought I'd plan in advance to get cracking, but I don't really have anything else to decide...

I dare you to verbalize what you thought:.
	If there is risk, work to gain knowledge is a top priority
	Processors and humans can be processed in parallel, so they are processed in parallel.
	First, complete the minimum promptly and then do additional things in the remaining time.

----
Use of laser cutter (1 hour)

Acrylic size over
	The black acrylic that was to be used first was too large to fit the size of the laser cutter (vertically).
	After consulting with the staff, they said that since I had a woodworking SBU, I could cut it with a band saw as a special exception only this time.

out-of-scale deviation
	What was originally 6 cm is now 94 mm.
	Something went wrong in the process of opening a PDF to print at A4, opening it in Adobe XD, modifying it, and then opening it in Illustrator.
	Good thing I noticed it before processing.

At this point, 20 minutes of time has passed!

typographical error caused by selecting wrong kanji when word-processing
	Red line for cutting, black for engraving in TechShop environment settings
	But the actual data was ignored because the text was grayed out.
	I noticed this after processing.
	I fixed it and reworked it, but I had to change the paint color of the path, but I changed the color of the stroke of the path, which was even more of a failure.

Cards have been cut up to lvl 2, but only one lvl 3... if you play up to lvl 2, well, there you go...

----
looking back
	good thing
		I could experiment with laser engraving on acrylic.
 	I could make it up to lvl 2 two players.
 the bad thing
 	Time is running out.
	 I wanted to make it to lvl 3 (ran out of time).
	 I wanted to try a translucent card (ran out of time).
	 Delicate spacing between rounded corners and content
	 	The frame of the card was originally a square, but on the day of the event, I came up with the idea of rounding the corners.
	 	The result is a subtle positioning of content and rounded corners.

next time (occasion)
	Book the laser cutter for 1.5 or 2 hours.
	Outline the text once it has been modified.
