training
	Different people imagine different things when they think of the word "nurture."
 	A: "There is a training subject X and a mentor Y. X listens and learns from Y." Image
 	B: "Subject X will be able to collect information on his/her own and choose his/her own path".
	From Mr. B's perspective, Mr. A's "nurturing" is counterproductive because it takes away [decision-making opportunities].

	About the subject of the training finding another consultant Z on his own.
		Mr. B. "Very favorable."
		Mr. A. "It's a bad practice that neglects the leadership."

	Suppose training target X has multiple advisors, Y and Z, and the advice of one advisor, Y, is completely ignored.
 	Mr. A. "It is not good that X neglected Y."
	 Mr. A. "Having more than one person to talk to is the cause of the problem, so you should limit yourself to one."
 	Mr. B: "X [discarded] advice based on his own judgment. That's great."
		 If you incorporate all the advice you hear, you will not succeed.
		 It is a wonderful growth to be able to [discard advice][make decisions].
	 Mr. B: "The problem lies on the part of Y who failed to give useful advice."
		 Single consulting partner increases the probability of being unlucky and hitting a consulting partner who cannot give useful advice: [Sensei Gacha].
		 There is no way to know these probabilities in advance, so the only way to reduce the luck factor is to increase the number of consultants.

	case
		I'm trying to do a project with training target X.
		Y thought it was better to take means A for the success of that project.
		Y advised X that "means A is good.
		But X ignored the advice and took means B.
	Opinion of Mr. B (me)
		When working on a type of project with uncertain outcomes, it is impossible to know in advance whether means A or means B is better.
		Y advised that he thought "means A is better than means B."
			This is only an interpretation.
			There is no guarantee that it is correct.
		X took measure B.
			That's because X didn't agree that "means A is better."
			Because Y failed to provide a convincing decision.
		When Y blames X
			Harmful because it is an action governed by the desire to "control others."
			In this case, Y is a toxic person and should be eliminated.
