Should the stock price go up?
While "stock prices better go up" may appear correct in the short term, it is incorrect in the long term.
It is good for the stock price to rise at the same pace as the growth in corporate value, but if the stock price rises faster than that, a selloff will eventually occur.
[https://gyazo.com/3fc85511fb36314dda7978cd376e20e8]
This graph shows a company value that grows 7% annually and a stock price that rises 14% annually and falls back once it exceeds twice the value of the company.
In 25 years, the enterprise value increases 5.42 times. In the process, the stock price, which has risen faster than the corporate value, has experienced two back-to-back declines.
Those who purchased just prior to the selloff would be in the red for the next six years.

If you continue to purchase this stock regularly over a long period of time, your profit margin will be as follows
[https://gyazo.com/1f7bfcaf54d0fa0bfddc266e09498cad]
Compared to the case where the stock price rose at a rate of 14% as per the corporate value, there is a 31.7% difference in asset value when compared to the case where the stock price rose at a rate of 14% as compared to the case where the stock price rose at a rate of 14% as per the corporate value, because of the longer period of buying overpriced stocks, and the timing of the stock price falling back to a level corresponding to the corporate value.
This graph is an ideal case where the stock price is equal to the corporate value, so the following graph depicts what would happen if you start buying when the stock price deviates most from the corporate value.
[https://gyazo.com/778e003ed404cb9f19533643848e0efc]
If one buys a single stock just before a selloff, it will be in the red for six years, but in this case, by continuing to buy a certain amount even after the price drops, the recovery is quicker and the stock will be in the black after three years because it is in a so-called "nanpin" situation.
Compared to the case where stock prices rise in line with corporate growth, this is about 5 years behind.
