Boost Conference
The "Boost Meeting" is a training camp that has been held in the Unexplored Project, where everyone gathers and stays overnight at the start of the project.
Would the common noun be "kick-off meeting"?
Since I often hear people say, "I'm referring to an unexplored way of doing things," I thought I'd compile some information for you.
Notation shaking: [Unexplored Boost Conference].

-----
>By inviting energetic OBs to the boost meeting (a brainstorming camp to boost development) held a while after the adoption of the project, we have tried to form not only horizontal ties but also vertical ties. In fact, this has now created several tangible and intangible ecosystems. In the entire MEXT, a voluntary conference called Esper20XX (where XX is the year), which was launched by alumni, has created and strengthened such vertical and horizontal connections. What is expected now is that this ecosystem will not be limited to the "Mittoku OBs," but will grow to encompass all the fields related to IT.
[Ikuo Takeuchi, 11 Years of Unexplored Projects https://www.jstage.jst.go.jp/article/jssst/28/4/28_4_4_3/_pdf]
[Unexplored Ecosystem]
-----

	At the time of the first year (2002) of unexplored youth, there was already a boost meeting
		I don't know where this came from.
		I don't remember if it was a camp at this time (even though I was a participant).
		It was 23 projects, so did we split it into two days?

	Second year (2003)
		[SoftEther.co.jp - SoftEther Development Diary - SoftEther VPN System (old web site) https://www2.softether.jp/jp/vpn2/old/journal/07.aspx]
		>On 9/13 - 9/14, there was a meeting among adopters of "Unexplored Software, Unexplored Youth Section" at a certain place. Usually at the "boost meeting," we give a presentation on the outline of the software we are developing and the parts that have been completed so far.

	In the fourth year (2005) of the unexplored youth program, a quota for alumni participation was created.
		(There may have been alumni participation in this previous year, I will check with Mr. Kawai later.)
		Participation in the Boost Conference by inviting applicants from alumni who continued to be involved in the unexplored after graduation.
		Five alumni slots are available
		2005-09-01-02

	5th year (2006)
		September 10-11, 2006
 		Dr. Takeuchi announced, "By all means, let's have a big turnout of alumni. Dr. Takeuchi announced
 			Did you like what the alumni did at the Boost Conference the previous year?
 		OB quota increased to 10
 		Participant Comments:.
 		 [Boost Conference - Blog by Sadayuki Furuhashi http://frsyuki.hatenablog.com/entry/20060912/p1]
 		 	>It was amazing. Exciting.
     > VIVER is no time to be inferior. We must make more and more!
 				[Sadayuki Furuhashi]
				[Bay Area Info Bureau: now participating in the Unexplored Youth Boost Conference http://blog.bz2.jp/archives/2006/09/post_40.html]
					>Today I am attending the Unexplored Youth Boost Conference. As an alumnus of Unexplored Youth, I was given a special PM slot to attend. I'm sorry I can't talk about the contents of the conference since it is a closed conference, but there are many interesting projects this year and it's fun.
					[/mitou-meikan/Masato Odo].
		Second time for unexplored youth as the event is now held twice a year.
			March 20 - 21, 2007
			This also has 10 alumni quotas.
			Apart from the alumni quota, two invitations were made for Geek quota, not limited to alumni.
				One of them is[/mitou-meikan/Yoshinori Takezako].
　　　　Later PM.

	Sixth year (2007)
		Phase I/Phase II on an irregular schedule.
			For the past few years, unexplored was held twice a year.
			The formation of a network of near age ranges occurred because twice the amount of adoptions were made in the "small age range" situation of youth (Foreshadowing A).
		7/7-8 Phase I Boost Conference
  	13 alumni participated
  9/22-24 Development Camp
  	An IPA and independent development camp was held by 16 alumni
  	Participants were spread across five adoption years/periods, indicating that a vertical community was formed across the years.
  Oct. 13-14 Phase II Boost Conference
  12/2-3
  	

[Since 2008]
 Fiscal Year 2008
 	Name changed to "Exploratory IT Human Resources Discovery and Development Project
 	9/20-21
 		Boost Conference for the first half of 2008
		The maximum number of alumni is 15.
		Foreshadowing A results in an increase in the number of alumni and their willingness to participate, causing an overflow problem.
			>From the members of 2006_Upper/Lower and 2007_1/2, we will limit the number to about 5 to 7.
		[I went to the first half of 2008 Unexplored Youth Boost Conference - Bay Area Information Bureau http://blog.bz2.jp/archives/2008/09/2008.html]
			>I was allowed to participate in the Unexplored Youth Boost Conference, which I always attend, again this time as an alumnus.
   > I can't write about the contents of the Boost meeting due to confidentiality issues, but I will try to convey just the atmosphere.
   > 
   > What is the Unexplored Youth Boost Conference?
   > The "Unexplored Youth Boost Conference" is an opportunity for all the "Unexplored Youth" adopters to meet and present their adopted projects.
   > It is also a place where a large number of unexplored youth alumni come in and give a warm shove to their juniors.
   > 
   > Unexplored Youth has strong vertical and horizontal connections
   > It is customary to have a social gathering on the first night, at which the alumni present whatever they like.
   > This makes for a good conversation piece and brings the people in the room closer together.
   > With unexplored, there are not so many vertical and horizontal connections, but with unexplored youth, thanks to boosted meetings, the vertical and horizontal connections are much stronger.
   > 
   > I'm a little envious of some aspects.
   > I was adopted in the second phase of the Unexplored Youth Program, but the atmosphere at the Boost Conference then was not like it is now.
   > Perhaps because of this, horizontal ties are not very strong among the early adopters of unexplored youth.
   > The connection became stronger around 2006.
   > When I see the unity of the students at the University of Dentsu, the University of Tsukuba, and the Takeuchi Lab at the University of Tokyo, I am a little envious, but at the same time I think that we must do our best to continue this culture.
   > 
   > The level of this year's adopters is high!
   > The level of this year's adopters is higher than in previous years!
   > That's no wonder, because this year they are the fiercest applicants ever, with a record number of 90 applications and 18 adopted, winning out over a fivefold increase in the number of applicants.
   > This is a very promising outcome report meeting!
   > 
   > Why don't you apply for Unexplored Youth?
   > There are countless things that unexplored youth can gain.
   > There is no doubt that the people you meet, especially those you meet at unexplored youth programs, will have an irreplaceable impact on your life in the future.
   > Young people under the age of 25 are encouraged to apply to Unexplored Youth.

		March 7 - 8, 2009 (Sun.)
			Boost meeting in the second half of 2008

		June 27, 2009
			First? Interim report meeting
			Participation in programming symposiums by some adopters had been substituted for the interim debriefing, but the number of participants became too large, so they began to hold their own debriefing sessions, mainly by alumni.

	Fiscal Year 2009
		August 22 (Sat.) 23 (Sun.)
			Boost Meeting in the first half of 2009
			>At the reception, have alumni give a 5-10 minute presentation introducing themselves and their message to current students.
			However, there are similarities in what the alumni want to convey as a message to the current students, which later led to the problems of "boring time with alumni talking about the same things all the time" and "the time of the reception being eaten up just by listening to the alumni talk".

Information was checked through August 7, 2009. To be continued.

Around 2009, IRC was running on [/mitou-meikan/ Satoshi Oshima's] personal server, which was used for communication during boost meetings (maybe).
	Methods used at programming symposiums, WISS, etc. see: [announcement parallel chat].
	→ Later, it was moved to Facebook to solve problems such as "asking creators to include IRC but they don't" and "users unfamiliar with IRC cannot look back at the logs of their presentations". Facebook is still being used, but as of 2019, issues such as the lack of automatic updates when opened from a PC have led to discussions about whether there is another way.


2015-07-12
[Attended Unexplored Boost Conference - xarsh https://xar.sh/post/1466661816/]
　Every once in a while an incident like this happens that triggers such negative emotions.

2019
	An experiment to allow unexplored junior creatives to attend the Boost conference was conducted and was well received.
	An attempt was made to introduce the Slack channel used by unexplored alumni/alumnae to current students

2020
 An attempt was made to introduce a secret Facebook group of unexplored alumni/alumnae to current students.
 Held online due to COVID19


