Chit Chat2019-07-31
	board game
		Pandemic = cooperative game
		Why does lord play (a situation in which one player gives instructions to another player to follow) occur in cooperative games?
		When everything is public information, the optimal solution is for the smartest person (or the person who is familiar with the game) to give instructions and make everyone follow.
		For a cooperative game to be an interesting game, it must have non-public information.
		It's frustrating that I can't communicate my confidential information, when if I could I could communicate my confidential information, I could have a holistically optimal strategy.
		Paradoxically, we are acutely aware of the importance of information disclosure and information sharing.
		Provided that the sharing of information does not diminish your value.
			Some people try to create their own value by monopolizing information.
			>Some will try to maintain their own superiority by not sharing information with their subordinates and creating an information gap between themselves and their subordinates.
			[What do companies that have a lot of talented people leaving in droves have in common?　An Undercover Roundtable Discussion of Talent Drain Companies Reveals (2/6) - ITmedia Business Online https://www.itmedia.co.jp/business/articles/1907/26/news008_2.html]
		In learning teamwork, it doesn't make sense to play a game about an organization that is working fine, but to experience a severely dysfunctional organization in game form and feel the misery, and then act to avoid reproducing it in reality.
			So I think it's good to play a "[bad organization]" game like [Avalon].
			that in my review of [Board Game Connect Camp 2017].
				[The Fake Artist Goes to New York] and [Resistance: Avalon].
			The basic premise of cooperative games is that everyone shares a common winning goal.
			Even in real organizations, the ideal state is that everyone shares the same goals.
				In reality, however, goals often diverge.
				[Werewolf] type games have a similar situation, where the game setting is to cooperate to defeat the werewolf, but there is someone in the group who has different victory conditions, and who that is is undisclosed information.

	Where do people who want to change society go?
		People who want to change education go to the Ministry of Education or to large corporations that can afford to invest money in education.
		The play to hit companies with the amount of money they have is often more effective than the state does.
		The country has a lot of ties.

	Play to hit with funds
		This is not always the best efficiency.
		Play for greater employee freedom
		Do not prevent enthusiastic people from doing what they are passionate about
			Interrupting enthusiasm will cool it down.
			If you don't let enthusiasm get in the way, enthusiasm creates value (potentially).
		Money cannot create enthusiasm.

	The last few decades have been a history of lowering the bar for speaking up.
	Text site → Blog
		Cost savings by not writing HTML directly
	Blog → Microblog (Twitter, Tumblr)
		Psychological cost savings by stripping away the formatting that blogs implicitly required (e.g., a post must have a title, etc.)
	Business communication has changed from e-mail to chat tools
		Cost savings by stripping away the formatting (greetings, "regards," etc.) that email implicitly required.
	Twitter
		What are you doing now?"
			Verbalization by asking questions
		140 character limit
			You can post without much to write about by making sure you don't spend a great deal of time on it.
				Gives an excuse to those who can't disseminate information without writing an "organized blog post."
		Favorite
			Unlike the current heart, it was initially a star named Favorite
				This was a word sometimes used as a synonym for bookmark
				Related: [social bookmarking].
			Because Favorite was designed to notify the subject immediately, this became a "one-click means of returning a positive [stroke]".
			Speakers were rewarded fast for speaking up, which [reinforced] the act of speaking up
		[Hook model]
	Slack custom emoji, LINE stamps
		Communicate in a way that does not involve typing text

	Interesting person to talk to.
		Conversely, what kind of person is [uninteresting]?
			[When you can't verbalize X, ask, "On the contrary, what is NOT X?" I ask]
		People who don't talk about the future at all.
		People who are too picky.
		He says he has something he wants to do, but when asked if he is doing anything to achieve it, he says no. He is probably going to say the same thing next year and take no action.
			You say you want to do it, but you don't actually want to do it that badly.
			Cognition has already gone haywire.
			Avoiding facing up to the fact that there is nothing you want to do, the swamp thinks that this is what you want to do, even though you don't want to do it.

	self-disclosure
		Not always possible.
		Gray old man.
		（Is it greasy?)
		Self-perception more than the actual situation.
			Excessive pride
			This is another [cognitive derangement].
		Tweets that need affirmation of self-knowledge
			But it is "old man's boast" and "old man's sudden self-talk," so it is evaluated negatively by others.

	Altruistic behavior is cosmetic.
		Is that true?
		Since it is not possible to determine in advance whether a person is a benefactor or not, selection and concentration are not possible, and disbursement is necessary, the theory
		Related: [long-term investment, not altruism].

	[orimar3 "Mitsuo Aida made so much debt in his hometown and caused so much trouble to others that his hometown refused to allow him to establish an exhibition hall of Mitsuo Aida. The words of a lousy, no-good man strike a chord with people." / Twitter https://twitter.com/orimar3/status/16520902320]
		[Personality and opinion are two different things.]

	Don't hit people."
		seemingly sound (justifiable) argument
		You can't use X as a way to get your point across to people."
		Those who have no other means of communicating their opinions than X will have no means of communicating their opinions.
		If you have an opinion, please write it down in LISP."→I can't express my opinion even if I have an objection.
			I can't even offer an objection to the way this discussion is going.
			I think I saw something English-speaking about this, but I forget.
				It's like if you're making an argument against someone having an unpleasant emotion, and you impose the "don't make emotional arguments" norm against what you're describing about emotions, you can shut down the argument of the offending party.
				[Tone Polishing]

	Teaching [individuals who break through] is a good thing [spontaneity] [enthusiasm].
		Can individuals who break through be raised?
		The theory that they cannot be acquired.
		The [false dichotomy] theory of "can it be raised or not?"
		[https://gyazo.com/d1627410d54fc0014528a8f7994c9848]
			You can't just "grow it."
			We can prevent them from growing up, easily.
			When you thoroughly avoid things that "hinder nurture," they can grow on their own.
	After hearing this story, "[have you] made any changes?"
		before: I thought there were two kinds of people.
		after: is a gradient.
			[https://gyazo.com/815c8eba69665263ce5a7a0ceb3866b4]


	Child and Parent Metaphor
		[https://gyazo.com/4ee2b0815d072bb117a6b30a43f3d889]
		Children go through a period in their upbringing where their parents are absolute powerhouses.
			Due to the physical size difference.
			Gain experience that "if your parents disagree, you can't carry it out."
		Pulling that mental model into adulthood.
			If your boss disagrees, you can't do it."
		But even if the boss disagrees, adults have options, such as changing jobs.
		You are the decision-maker about your adult life

	It's interesting to hear about people who are buggy.
		Interesting to see people who are outliers, not average.

	Self-disclosure" is an [abstract concept] word.
		It was interesting to see how many things in this chat came down to self-disclosure.
		But isn't that "self-disclosure" an abstract concept with little concreteness?
		Are you not relieved and stopped in your thinking by attributing it to the label "self-disclosure?"
		What exactly is this "self-disclosure"?
		When "self-disclosure" takes place [what happens next]?
		What happens [a short time before] "self-disclosure" takes place?
