深圳支払い手段
Notes as of August 2019 as things can change quickly [Shenzhen].
2019-11-04
	旅行者用Alipay: https://twitter.com/tks/status/1191319805686452226?s=21

	7/21
		I can no longer use WeChat Pay to get money transfers from Chinese people.
		>Tsuraumi. I got caught by this the day before yesterday and could not recharge... I can no longer use the method of having a Chinese person send money to me and receive it (when I receive it, I am sent to the account verification screen). I can still receive Alipay, but .... Maybe it's just a matter of time.
			[岩佐 琢磨 https://www.facebook.com/search/top/?q=%E5%B2%A9%E4%BD%90%20%E7%90%A2%E7%A3%A8%20wechat&epa=SEARCH_BOX]
	Alipay HK (Hong Kong version) may be used in some cases with a credit card
		7/12 [[Good news: I was able to use Hong Kong's version of Alipay (AlipayHK) to make payments in mainland China | Cabreblog https://kaburelife.me/alipayhk-challenge/]
			[Hong Kong travelers should include! How to Activate Hong Kong's Version of Alipay AlipayHK | Cabreblog https://kaburelife.me/alipay-hk/]
			香港(+852)の電話番号が必要
				SIMカード or eSender
					I bought a SIM, but haven't tried it.
 				eSender: SMSをWeChatに転送する
 					[A must for China business travelers!　eSender" to get a Chinese phone number for SMS without having a SIM | Shiftall blog https://ja.blog.shiftall.net/archives/501/]
 						In this explanation, you get a mainland China phone number, but all you need is a Hong Kong number
 						Real name registration is needed for mainland Chinaって書かれてるから、実名認証が必要なのは本土の番号を得るときだけかも
			I could create an account.
				(8/6) Error when trying to register credit card
				Local: Error again trying to register another card
	(8/1)
		>If you use regular Alipay (not the Hong Kong version), it is not so difficult. You can use your Japanese phone number. The rest is passport and a selfie. [Shigeru Kanemoto https://www.facebook.com/nishiohirokazu/posts/10218875643858664?comment_id=10218875738461029&comment_tracking=%7B%22tn%22%3A% 22r%22%7d]
			This was tried on 7/11.
		(8/2)There are reports that you can create an account for the continental version of Alipay with eSender.
			Server busy kept coming up on 8/1, but they were able to do it on 8/2.
		(8/5) There is a report of passport authentication with a Japanese number.
		(8/6) [nishio.icon]I was able to create an account with a Japanese number.
			The continental version of Alipay requires you to create an account with a Japanese phone number and then enter your passport number to get a review, but I don't know where to enter that (the remaining balance screen, I was told).
			[https://gyazo.com/15700eb71d702b0c0bf480d23f5d9294]
			It was from the "me" button in the lower right corner, not from the buttons on the top page.

			Me→Balance and you will get a screen asking you to add an ID (I forgot to take a screenshot).
				[https://gyazo.com/7005ba647116cca995de24f4c0d6d987]
				If you select Face, you will be asked to select your country, and if you select Japan, you will be authenticated with your Passport.
				When sending a picture of my face, I mistakenly sent it even though it wasn't taken properly.
		(8/7)
			I got an SMS notification.
			[https://gyazo.com/ac181c0f0936d6e907525f7e94682bb2]
			already yǐ already
			The testimonials you submitted at the time of your Zipteco operating status examination have already passed the Artificial Nucleus."
			審核: 審査
			So you can pass it.
			しかしAlipayを開くと「Failed: Server busy」が表示される
				Pressing Retry keeps that screen on.
				I hit cancel by mistake.
					I'm back on the home screen.
			It looks like I could do it because the balance screen no longer asks me to submit ID, but I'm not sure if this is the right thing to do.
				Does it mean that the screening was completed and only the screen showing the results of the completed screening was server busy?
		  After this, I was actually able to receive the money transfer locally, so it seems safe to ignore this server busy
	I left Japan in this state, but it was a painful mistake.
		I could get a local resident to send money in this state.
		But when I press Pay, I get the following display
		[https://gyazo.com/38973eb01ac5482a52382f0ee9d7a375]
		This Enable should have been done in Japan.
			When you try to Enable, you will be asked to create a Payment Password.
			At that time, an SMS will be sent to the Japanese number you used to create your account, asking for verification.
			If you try to do it locally, there is no way to read the SMS sent to your Japanese number.
				I thought of a move to use au's worldwide data flat rate, but it didn't work (I'll try again below).
			Trying to change to an e-Sender phone number.
				Indication to the effect that "someone has already created an account using this number, so it cannot be used".
				[https://gyazo.com/f93e317da303013be13f2347c99c15db]
				I think this simplified button is for merging accounts, but I'm not sure who created the account and merged it...
				 There have been similar cases of putting money into someone else's account where the balance and payment history is still available.
			The Hong Kong SIM that I use for internet connection locally has 10 digits after the country code, and I can't use it because it says "incorrect mobile number format".
	8/10 au's "Global Data Flat-rate" is now available!
		Pointing to a local SIM and installing au's "Global Data Flat-rate App".
		When I used the "Global Data Flat-rate App" with an au SIM pointed to it, I got the following error
		[https://gyazo.com/3b52e5a2c368b469f35ee01b88ba568c]
		I had given up earlier because following these instructions did not resolve the error.
		In the process of writing what I did on this page to organize the current situation, I opened the PC version of the [World Data Flat Rate https://www.au.com/mobile/service/global/au-world-service/sekai-data/] web page and the instructions were different
			[https://gyazo.com/92a2f67787b683b03d863aa5e49794e3]
		I followed the instructions in the web version and successfully got a "flat-rate worldwide data plan".
		Now I could receive SMS.
 8/11
  I could be the payer in a person-to-person transfer.
   Splitting the cost of food and drink
   The other party sends a QR code via collect, we scan the code and send the amount of money.
  Could pay at a convenience store.
   Enter the amount of money into the reader at the convenience store
   This one gives out a QR code with pay, and the machine reads it.
   [https://gyazo.com/426b0291dda08b326347dcfd137e8b1d]

  I haven't tried it, but it should be possible to make a payment at a store that doesn't have a reader terminal as well, since it's essentially a person-to-person transfer.
	8/12
		It worked with subway ticket machines.
			Scan the QR code displayed on the ticket machine
		The subway seems to have a worse internet connection during the rush hour to get home, and I had a timeout (super time) once.
