Shenzhen Study Group
Tuesday, 2019/08/06 17:30 - 19:30
[[Junior High and High School Students Only] Let's listen to Mr. Takasu talk about Shenzhen, China! - connpass https://mitoupgwg.connpass.com/event/137536/] [Shenzhen]

Instead of the speaker talking about the content of the lecture material, the participants watched the video beforehand, and the Q&A session lasted the entire two hours on site. Interesting.
>Mitochi Junior will be hosting a "Deep Sense Study Tour" for alumni in August 2019, and this is a pre-learning event designed to familiarize you with Deep Sensei in advance.
> However, it would be a waste if it were only for people related to Unexplored Junior! So we welcome general participants as well as those from Chiyoda Senior High School, which has provided us with the venue, on the condition that they watch the following video in advance!
> In order for the event to be more detailed and in-depth, with an emphasis on Q&A, participants should be sure to read through the following video in advance.
[slido style]

-----
self-introduction
	switch science
	Your job is to develop partners.
	Fly to various countries and import them to Japan.

Innovation of the "what can be done abroad can be done in China" type
	Chinese Google Chinese Facebook
	DJI drones and tiktoks are not imitations.
	Accelerated by copycat innovation, innovation to create something truly new is now possible.

MakerFaire in the U.S. and China don't have many Ph.
	They are busy and fear losing time.
		→Use a board that is dead.
	Most advanced boards are sold in Japan in the first year.
		Oculus DK1 Priority for Japan over U.S.
	The Japanese make the worst ones.
	Because the best people are made to spend their spare time.
		I get home at 5:00 and don't have to work on weekends.
 	Do hobby projects in your spare time
		[nishio.icon][forced regular work hours] and [no side jobs] combine to put some people in a situation where they can only do their hobbies.

China is too fierce when it comes to hardware manufacturing.
	M5Stack A company that was founded 2 years ago and already has about 3 pacts.
	Educational tools sell tools that have connections with local governments.
		Products of paclitical companies that are children of local government leaders are sometimes introduced.
	So we'd rather sell worldwide than fight in China.
		It pays more to join a professional team in Japan than it does in Brazil.

Population Distribution in Shenzhen
	Average age 31
	Only about 7% were born in Shenzhen.
		In Shanghai, for example, more than half the people have been there for a long time.
	People who come here as migrant workers return to their hometowns when they get older.
		Small population over 60 years old.
		No money is taken from welfare.
　Easy to put new things in government services
	　Fewer people complain about "you can't check out books at the library without a smartphone."
	Taxes are high in Shenzhen if you don't have kids.
	Shenzhen government has too much money.
	　I don't need welfare for the elderly or childcare support.
	Investments can be made, such as making furpiao into a blockchain.
		[Strong Government" on the road to digitization How the "fāpiao", or "issue vote", works, which is the basis of the economy https://wisdom.nec.com/ja/business/2019062601/index.html]

Is the salary high?
　The city is becoming less and less palatable to factory workers.
	　Prices increase faster than salaries increase.
　Not many factories in central Shenzhen due to environmental regulations.
　They're spreading out across the Pearl River Delta.
	Minimum wage 2200 yuan 38,000 yen
		I want about 6,000 yuan.
		Go to a company that has nice overtime.
		Overtime and holiday work premium wage rules are properly followed.
			If a company does not comply, workers will flee quickly.
			Workers can quit instantly and get a job right away at the factory next door, so there is no reason to continue working for a black company.
		Not for life.
			Employment is the image of "let's go get this quest" in Monhun.
	White-collar is different.
	　They're going for an IPO, so they're receiving in stock options and their salaries are low.

Maker Boom in China
	Obama's MakerFaire at the White House started the boom.
		Today's DYI is tomorrow's Made in America.
	China imitated it and adopted a mass innovation policy.
	The hurdles of being president and lending money were high.
		→Opinions on Some Policies and Initiatives for Actively Promoting Popular Entrepreneurship and Universal Innovation," Kokusha [2015] No. 32.
	Chinese Internet Buzzword Becomes Maker
	The U.S. has 10 million years and China has 165 million cities.
	6,000 Maker Spaces have been created.
	There were 200 in Shenzhen alone.
	The Prime Minister actively visits the venture and gets the press to report on it.
		Young people want to venture out, but parents are reluctant.
		I'll convince them by telling them that the Prime Minister is here.
	The country will feature the person who can write the best program in China.

Faire has different colors in different regions.
	Faire in Hong Kong is run by university professors, so there is a high percentage of education-related
	Shenzhen will have more hobby projects.

MakerFaire went bankrupt, how does that affect you?
	The American MakerFaire received a billion yen and melted it down in two years.
	Other countries just pay a license fee, so there's no problem.
	They did what they put their money into that didn't make money.
		Like Burning Man, dealing with flames, etc.
		Hired firearms handling staff to pay the bills, but no black was found in the ticket price.
		A $70 ticket, for example, would have put them in the black, but they didn't try to do that.
		Dale: "I'm not excited about making it a kickstarter fair or an education fair."

Can a second Shenzhen be created?
	The Chinese government is also trying to create a second Shenzhen, but it's not working.
	Subsidies increase the number of companies looking for subsidies.
	We can't be the factory of the world unless we have people, electricity, and people are willing to come to the factory.
	[Factories of the World].
		Originally, there was a global labor shortage, and Japan used to take care of that labor shortage.
		But with rising wages in Japan, it was becoming less and less profitable.
		China reformed and opened up in 1978, and a special economic zone was established in Shenzhen in 1980
			[Reform and opening up - Wikipedia https://ja.wikipedia.org/wiki/%E6%94%B9%E9%9D%A9%E9%96%8B%E6%94%BE]
		Timing was good.
			Shenzhen was built because Shenzhen received orders from around the world.
		If you build a special economic zone where there is nothing, no one will come. If you build it where it is already popular, vested interests will complain.
			Shenzhen had Hong Kong next door, but the mainland side was a blank slate.
		Xiamen, on the other side of Taiwan, which became a special economic zone at the same time, has also been fairly successful.

Is innovation a matter of money?
　It's not a matter of money, it's a matter of will.
　Creating something new is creating something that doesn't exist now, so the lack of a track record makes it look suspicious.
　QR payments are also happening a lot of rogue things.
　The Chinese government gave a "quit it" type of opinion when QR codes were a security hazard.
　Alibaba ignored it.
		The advantage of not listening to "everyone's opinion
		No company should operate based on everyone's opinion.
		What we all agree on is predictable.
		Somehow, when it becomes widespread, it changes the world."
		I thought there was a man in the Chinese government who would not allow Alipay.
	How to achieve this in a democracy is still unanswered.
		A problem that only gets 80 points when the best people do it by consensus.

antfinancial
	[Ant Financial - Wikipedia https://ja.wikipedia.org/wiki/%E3%82%A2%E3%83%B3%E3%83%88%E3%83%BB%E3%83%95%E3%82%A3%E3%83%8A%E3%83%B3%E3%82 %B7%E3%83%A3%E3%83%AB]
　Before Alibaba, it cost $40,000 to lend money one time; you have to lend about 20 million to recoup your costs.
　Only about 15% of the total population can borrow money
　Alibaba made it possible to do everything with AI and to lend small amounts, like 3 million.
　Automated screening process determines loan approval or rejection in 3 seconds.
	　A system of lending money to the remaining 85%.
　The government thought it would be better for China.

"disrupter 30"?
	A culture that praises those who disrupt existing markets.

There are two kinds of startups.
	Subcontracting lowers profit margins, so factory owners create startups.
		We get so many orders, we're making them, so let's make and sell them ourselves."
	Graduated from college.
		We'll make a whole new product, just give us money."
	[nishio.icon]Maybe the former "low-hurdle startups" have increased the number of participants in the startup ecosystem itself, creating a smoother flow.

Personal Information Situation in China
	WeChat Pay for spending money, Alipay for work.
		The two separate lives are divided in terms of national sentiment.
		I don't want the contents of my Alipay wallet to be visible to others.
			Alipay+SNS has failed.
		Scoring for behavior and scoring for lending and borrowing are now separated.
	surveillance camera
		People who have never used it are just complaining.
 	Shenzhen, forgotten items are now returned.
		Forgot bag in cab → Check cab company from surveillance camera footage.
		→Contact the cab company.
			All cabs these days have drive recorders so drivers can't steal what they forget.
		→I'm carrying another customer right now, so I'll bring it over there when I'm done.

How are manufacturing personnel developed?
	No school teaches how to build a phone or a drone.
	Once in the factory, you can learn through practical work.
		Like becoming a cartoonist's assistant and then submitting your own work.
	When you think about it, Japan's manga debut system is well organized.
		A contest called "Newcomer of the Year."
		Selling works by veteran artists and newcomers in a tiered format.
	Good schooling can be copied, so there won't be much difference from country to country.

age
	People in their 50s can't be dignified because of their communist upbringing.
	The veteran president is about 47 years old.
	When the kid is 25, the parents are 47, and well, they can mentor him.

Economic Discussion
	We can't complain about politicians, but we have no control over the economy.
	996 license
		Condemnation of a work pattern that makes people work from 9:00 a.m. to 9:00 p.m., six days a week.
		Even the national press is talking about it.
		Jack Ma (founder of Alibaba) commented on it, and criticisms of it, etc., were published in the national press, and Jack Ma's slightly softened comments were placed in the stream.
			'You can't be working because someone else told you to.'

Reactions to the FAA sanctions
	Opium War Museum
		[Opium War - Wikipedia https://ja.wikipedia.org/wiki/%E9%98%BF%E7%89%87%E6%88%A6%E4%BA%89]
		The memory of being treated badly for economic reasons has not faded.
	"Staying up at night creating our own operating system"?
		Not like that.
		Increase the amount of savings, or buy land in Malaysia.
		Few people sacrifice their personal lives for a cause.
			No one keeps working for a black company.

The Chinese are about the size of Europe.
	South and North are as different as different countries.
	Sui and Tang Dynasty were created by people from the south, Qing Dynasty was created by people from the north, pigtails, and Mongolian influence.
	Vietnam and Thailand are both in Fujian Province
	Canton = Yokohama Chinatown
	Shenzhen has many migrants from Hunan Province.

What you should see
	Friday, Saturday, Sunday: The one where all the buildings glow, definitely see it.
	You should go to the bookstore, there are so many hardware books.

Not many CoderDojo-like non-profit activities?
	The concept of non-profit activities in Japanese doesn't really fit.
	Google also does a lot of loss-making activities.
		An entity that makes a profit in a business uses its excess profits to engage in loss-making activities.
　There's too much of an air of "let's do business" and make money out of everything.

disparity of wealth
	extremely intense
	Most IT skills widen the gap between those who can and those who can't.
	Alibaba is Maker's definition of doing business that we've never done, and it's OK to buy and sell weird stuff.
	It's hard to live in motivational poverty, not even that.
	The time when there was no gap between the rich and the poor was the Maoist era, when many people died of starvation.

public order
	When the economy starts to grow, anyone with a little bit of brains would rather work than commit crimes.
 Only super stupid people commit crimes.
 I'm more afraid of car accidents.

Chinese language study abroad at Shenzhen University is recommended.
	About 140,000 for 4 months with tuition textbooks and insurance.
	I can go for about 300,000 including living expenses, etc.
	Student visa and a local bank account
	Don't get paid in China.
		Getting paid in Japan is OK.
