Unexplored Junior Shenzhen Tour 2019
2019 [Shenzhen].

advance preparation
	[Shenzhen Means of Payment]

Day 0 (8/9)
	15:55NRTâ†’20:00HKG
	Designed to communicate locally via WeChat
		I had been using Mattermost until just before the event, but there was a possibility that we might not be able to connect locally (a fear that was unfounded).
		It is better to increase the volume of information distribution, but it is not good to push out the communication channel, so a separate chat room was created for chit-chat.
		Dice and rock-paper-scissors stamps by default, good.
		I was asked after a while if there was a "pinning" function. I answered "No, if you need it, you can use the pinned chat to "forward" the message," but it never went into operation.
			Only important communications can be channeled to the contact chat.
			There can be adult-only chat.
				(Maybe even a kids-only chat).
	[Weibo]

	Demonstrations in Hong Kong had intensified even before the tour.
		For safety reasons, take a ferry directly from Hong Kong Airport to Shekou Shekou in Shenzhen
	I had bought a data SIM in advance for local communication, but did not have a SIM replacement pin, so I borrowed one.
	When I arrived at the Hong Kong airport, I suddenly received an SMS.
		It seems to be an AU service that says, "In this country, you can get free internet for 24 hours a day.
		[Free World Data Flat-rate Campaign].
		Good service.
	board a ferry
		[https://gyazo.com/a1c033fad6e33b47bf797fb5d89766ca][https://gyazo.com/66f5caf2249a01e334433235ba2c526f]
			Ginger juice, lemon-like drink, dried tangerine peels, sweet and salty.
		In this natural, I was thinking of keeping a diary in Chinese to practice my Chinese as well.
			[day before departure https://www.facebook.com/nishiohirokazu/posts/10218932671804327] [day 0 https://www.facebook.com/nishiohirokazu/posts/ 10218939450693795]
			After this, the amount of input information was so large that Chinese was not fast enough to record it, so I went back to Japanese.
			Also, WeChat communication among people who came to the area was more important than writing to people in Japan.
	Arrive at hotel around midnight [Facebook https://www.facebook.com/ukai.yu/posts/10219343666923124]
	VPN Information
		They recommended ExpressVPN for 30 days free, but I was too tired to do that on the first day!
	Coke in the fridge is 25 RMB, 375 yen
		A 500 ml Coke costs RMB 5 in the city
	Q: Do I need to tip the bed-making staff? A: NO
	Q: How do I drain the bath water? A: Turn the drain cap-like thing on top of the valve.
	Whether the room needs to be cleaned or not is toggled by a button, just like a light switch.

Day 1 (8/10)
	Breakfast dining room is an operation where you verbally say your room number.
	I immediately locked in my room card key, but after authenticating it at the front desk with my room number and date of birth, a new card key was issued.
	I asked a local person to send money to Alipay, but when I tried to use the money to send money to Tokoroten and each other to test the operation, we both got hit. see [Shenzhen means of payment].
	Attend DJI workshops
		Sentosa Hotel
		[video https://www.facebook.com/nishiohirokazu/videos/10218947750901295/]
	[RoboMaster S1]
 	[RoboMaster S1 - Educational Robot - DJI Store https://store.dji.com/jp/product/robomaster-s1?set_country=JP]
 		3499 yuan
 		[Amazon https://amzn.to/2Z7j1TT]: Â¥64,800
	[tokoroten], who wrote on WeChat that he was "compatible with national defense," was suddenly banned from WeChat. w
		He said the cause is unclear and it may not be a good idea to be in development mode.
	Create a hero
		There's a RoboMaster cartoon on Netflix.
		"affordable is important in education"
			The context of small drones, that it is important for education to have access to them yourself.
			ã€€I understood that it is important to be able to buy inexpensive products, own them, and tinker with them as much as I want, instead of spending limited time at programming schools with expensive products that cost tens of thousands of dollars.
	You can also program drones in block language and Python.
		Somersaults are also one line
			It's an easy mechanism to do great things by adding a middle layer, PHP-like.
		Images taken below from the drone are sent to a computer, where the position is estimated and misalignment correction information is fed back to the drone.
			The cloth that is drawn underneath has a black and white pattern on it, which probably acts as a marker.
			Drones collided with each other during the demonstration.
			The fabric was flapping in the wind from the drone itself, which may have caused the crash.
			If the floor was like a gymnasium, they would have taped it, but since it was a hotel conference room, I guess the situation is that they couldn't fix it.
	Actually split into teams of 5 players each to play against each other.
		Can be operated with manual controls.
			As a result, you can teach them how to operate the system and play against each other on the spot without much advance preparation time.
			We're lowering the hurdle for the first step.
		[https://gyazo.com/0144b1af634190716b3caf22ef34dffa]
			The cord seen in the back is the recovery point.
				Hit points are recovered when the camera is ready to recognize the mark.
			Other special items and other items can be used by scanning the mark.
	Writing a program allows you to create "custom actions".
		Writing programs to accomplish things that would be difficult to accomplish with manual human manipulation
		Writing the program makes my robot stronger.
		It's truly "Learn to win."
			[https://gyazo.com/5170fa1ab74a3453ea083169c5c64836]
			I like this tagline very much.
			A clear, concise, and compelling message about why we study.
	>Thank you DJI for hosting us and letting us try out the latest educational robot, RoboMaster S1ðŸ¤– 
 > Syu Katou is so good and won ãŠ—ï¸ [https://www.facebook.com/ukai.yu/posts/10219349215981847 src]

	Huaqiangbei Electric Town Tour
		Meet in front of Huaqiang Electronics World No.2 Store
		Unmanned convenience stores are linked to an Alipay or other ID when opening the lock to identify "someone".
			What is taken is the weight sensor.
		Split into several teams
		Stores selling parts
		Xiaomi
		I didn't want to buy anything in particular, so I bought some hawthorn candy at a convenience store.
			[https://gyazo.com/c3c38c8a56e02fcb765323f219dfce35]
				I hear it's good for the stomach?
		Betel nut, difficult to eat (it says something about oral toxicity).
			[https://gyazo.com/8f4311380952a83144d29dbc2fa77cb8]

	View LED Show
		Video [Nishio Hirokazu - I was watching this with some young creatives, wow https://www.facebook.com/nishiohirokazu/posts/10218949777831967?__tn__=-R]
		[https://gyazo.com/5d996d9524afe1e9b62b91261ddfc38a][https://gyazo.com/4b8167d7b6582574bfcce318ed5c610e]
		LEDs on the building change to match the song.
		>It was a spectacular light show. [kyasbal https://twitter.com/kyasbal_1994/status/1160160603425533952]
		[yasulab https://twitter.com/yasulab/status/1160156689812742144]
	[https://gyazo.com/eb08638ce366958fad2294bdb85ca385]
		The park has a much denser LED display that broadcasts, "The light display is over, so take your trash home."
	[Fully Automated Families https://twitter.com/kyasbal_1994/status/1160118616873828353]
	[GoogleMap is useless in China https://twitter.com/tokoroten/status/1160071129521741825]
		>Mapping data is restricted in China and Google, a foreign company, is not allowed to use it.
			[src https://twitter.com/tokoroten/status/1161083790493507584]
	dinner
		>Last night I saw a projection mapping using a building in the Fukuda area... but I saw the illumination of LED lights on the building.
  > We had hot pot for dinner. While we were eating, Mr. Isamu Ishikawa from the Ministry of Foreign Affairs talked to us about China, and I learned a lot. I can only see a future where everyone will be active globally in 10 years time. [Facebook https://www.facebook.com/ukai.yu/posts/10219355068248150]
		The graphic data showing that Japan, and the older generation in Japan, underestimates China compared to the rest of the world, and the glimpse I saw of bookstores made me feel a sense of urgency to see this with my own eyes. I will go see the exhibition tomorrow.
		[Which countries are driving the world economy today?]

	I came to Shenzhen without enabling payment on the alipay account I made in Japan with KDDI SIM, and when I enabled it, I was troubled because the authorization code was sent to me by SMS.
		â†’Solution: [Shenzhen Means of Payment].
	I find a sign that says "Concept Store". [vivo Lab Concept Store]
	They recommend ExpressVPN for free for 30 days, but before you do that, try the experience of being blocked first!
		Huh? I can connect to Facebook and Google even though I'm on hotel wifi in mainland China? Is the hotel itself on VPN?
			[traceroute https://gist.github.com/nishio/efafe649ce5dbea76c0ad66e0d3cd4d1]
			A company called DYXNet, headquartered in Hong Kong, provides VPN services.
	People fidgeting to get to the hotel pool.
		I have zero interest in it, so I didn't go through with it.
	No laundry facilities, room service is available.
		You mean to tell me that rich people who stop at the Hilton don't do their own laundry!
		I was after a zabuza in the bathtub.
		T-shirt 50 yuan, pants 65 yuan

Day 2 (8/11)
	[Unity https://twitter.com/kyasbal_1994/status/1160001767561519104]
	Shenzhen Book City Go to Central City (the main branch of a huge bookstore)
	A lot of Keigo Higashino is stacked flat.
	 [https://gyazo.com/cbc920082a933c53d0ec1556330e82e4]

	My impression of Shenzhenä¹¦åŸŽ [Facebook https://www.facebook.com/nishiohirokazu/posts/10218956377636958]
		I don't get the impression that the "technical level is very high." Rather, my impression is that it is both high and low, and that there is variation.
		It seems to me that the Japanese publishing industry has been optimized to "publish books that sell" (i.e., introductory books for amateurs), making it difficult to produce highly specialized books, whereas the Chinese market has not been optimized in this way. Related: [setting the wrong KPIs].
		I think this trend of optimization has been strengthened by the shrinking of the Japanese publishing market, so it may not happen in China in the foreseeable future.
		In China, the number of Chinese readers is much larger than in Japan, and this may be a reason for publishing technically sophisticated content with a small target audience without much concern. In terms of not having to be sensitive to the volume of intended readers when selecting a theme, a comparison could be made with the dojinshi market, such as the Gijutsu Shokuten (Technical Book Exhibition).

	This is the biggest gap when compared to Japan.
		[https://gyazo.com/6f397bfa895e4a48c81637f0fac2184c]
		There's a military section.
		In Japan, illustrated books for young children include Self-Defense Forces vehicles, and the printing of additional copies is stopped (i.e., no more copies can be printed and distributed).
			[The nature of the illustrated "Hataraku Kuruma" issue - Who is a threat to free speech - Agora http://agora-web.jp/archives/2040906.html]
		While in Japan it is considered taboo and its distribution is halted, the configuration of this bookstore suggests that it would normally be distributed in China.
		If publishers fear the risk of stopping reprints, they are less likely to publish books that mention those kinds of topics.
			As a result, there is little way to know what the rest of the world is up to, etc.
			The lack of knowledge increases fear and even more so emotional repulsion: [knowledge is the antidote to fear].
		Shelf
			[https://gyazo.com/c7fa979d1de7651e62daf4db23a614cd]
			This flat green book is labeled "Future Wars."
				"Future Wars: Science and Technology in Global New Collision" (Science and Technology and Global New Collision)
				Originally published in English as "Future War: Preparing for the New Global Battlefield" ([Amazon https://amzn.to/303ItLe])
				The Japanese translation is "Future War: Can the U.S. Military Win the War? " ([Amazon https://amzn.to/305qALQ])
				 It's a title that makes me wonder if it's being translated properly.
			[3 photos https://twitter.com/kyasbal_1994/status/1160380997361266688]
				I'm curious to see what "The Great Japanese Defeat" is all about.
			What kind of books did you have?" The first thing I remembered was "Clausewitz and Sun Tzu's The Art of War were lined up."
		Technical book corner
			[https://gyazo.com/332e9de5e10be66f6e437e736b0a9d6f]
			Hacker Offensive and Defense Compendium: a book that outlines attack and defense methods with respect to electronic intrusions and more.
	ã€€It's interesting to see the reality that some people might have an emotional reaction to these realities, but the reality is that there are adjacent societies with and without such emotional opposition.

	Interesting devices
		[https://gyazo.com/db8a612a95b4f76cd9538241235b71de]
		At first I thought it was a book search terminal, but at the top it says "you choose, I buy".
		There's a place to touch "reader's card."
		There's something about the system that's different from what you might imagine in a "bookstore."
		For more information [you choose, I buy].

	[Alibaba's supermarketsç›’é©¬é²œç”Ÿ]

 [RoboMaster2019 finals].

	Successfully used alipay in Shenzhen for person-to-person money transfer and payment at a convenience store.
		[https://gyazo.com/720815ef9eecfd26fd5516723314599c]
			Lemons dusted with sugar are placed on top of the liquor, which is then roasted on a burner to make the candy.
			I made a personal transfer with this payment.
		Then pay at a convenient store (convenience store)
			[https://gyazo.com/43bdbd9c83a4ec186f87ac6c8723cfcc]
			Bread fermented drink, ingredients include hops.
			I tried it thinking it was a non-alcoholic beer-like drink, but it smelled like cobbler's bread.
			Paying 50 yuan for a bomb at a convenient store, you can feel like you've splurged about 5,000 yen, but it's actually 750 yen, so it's cosy!
	Twitter must have decided that I was not Japanese because I tweeted in simplified Chinese, and for some reason started showing ads in Hangul (lol).
	It's never good to praise something to the detriment of something else.
	People want to go to the pool.
		165 RMB for a swimsuit, 25 RMB for a swimming cap

Day 3 (8/12)
	Note: While tethered on someone else's phone, I was able to receive SMS from a Japanese au, but not from a Chinese company
	Visit to ç¼–ç¨‹çŒ«(CodeMao) for Japan-China exchange
		Hackathon with a group of local students [video https://www.facebook.com/yasulab/videos/10156423463650869/? __tn__=H-R]
		[https://gyazo.com/94377d31f79aa8d389be5da3d2070251][https://gyazo.com/752f71595b388eb9ef76814126bd34c9]
		The IDE of the ç¼–ç¨‹ cat is quite amazing.
			[CodeMaoIDE]
		It was interesting to see the creators play a game with the Chinese students during the ice break where they were told to be in groups of numbers.
			The phenomenon of one person being left out after being told to "pair up in twos" is slowly and incrementally generated.
			Reduce the number of people by a little bit, like "eight" or "five.
			Those who were not selected leave the program after losing, and those who were not selected continue.
			Of course, those who actively form groups win out.
				Bias in favor of positive group formation.
				The management can observe who is not good at group formation.
		Language barriers
			This person is a native speaker of Japanese and speaks some English, and the other person is a native speaker of Chinese and speaks some English.
			Would we be able to form a team and communicate properly in this state? I was worried.
			I was thinking of helping out as a Japanese-English interpreter who can read Chinese if needed.
			When the lid was opened, the students were conversing directly by converting Japanese and Chinese using Baidu Translate.
			It is logged and rather preferable to verbal conversations.
			I expected that there would be clerks and security guards who did not speak English, so I tried to learn some of the local language, but the locals rather used translation hardware or automatic translation on their phones, which made me feel sorry for being so weak-minded.
			ã€€Yesterday at the RoboMaster venue, I pronounced "æ´—æ‰‹é—´"(toilet) with my mouth to the security guard and he didn't get the message, but it was poor thinking not to come up with "let your phone pronounce it" or "write it down and show it to you" there.
				>Jerry Chen Google Translate works fine, but i think is helpful to learn the basics in the local language wherever you go.
				>Nishio Hirokazu ä¸é”™ï¼ŒIt is better, but it is not "must" anymore. I must keep in mind it is not necessary for activity of new age students
			>A team consists of one Chinese and one Japanese person each, so the group that is not good at English can use translation software in real time for the hackathon.
   > It's a great time. Even if you don't have language skills, you can create something together for the same task with almost no loss of time.
	   [src https://twitter.com/kyasbal_1994/status/1160770837546323968]

	Adults are free to go out for lunch because apparently there is no lunch.
		From Gudu to Baoan Center by subway
			[https://gyazo.com/73e913fa1a5a561346aaecc718e06206][https://gyazo.com/e2589f22adbdc66bb5a7c9409f978117]
			Anti-terrorism metal detectors at subway stations.
			3 yuan = 45 yen
		There is a shopping mall in the center of Baoan, where we had lunch.
			Ate plain food (vegetarian food)
			The quality of the soy meat has evolved a lot since I had it five years ago.
		The store map is a giant touch panel that displays the route to the store in 3D when you enter the store.
			Seemingly good but UX is not good for the following reasons
				If one person is using it, others cannot see it.
				In the first place, icons of stores in order of name don't make much sense to me as a foreigner.
			I asked the manned information desk for the location of the DRAG STORE, but they wouldn't tell me.
				By writing "è¯"(medicine) on my iPhone and showing it to them, they told me that there was a supermarket in B1.
			[https://gyazo.com/32c25aad9346ba6eb13b30ef7312704e][https://gyazo.com/a2b09170298c20cffece6e0589805050]
				There are products from many countries, including Japanese products.
			Payment is made by a device that scans your own barcode, which you sometimes see in Japan.
				[https://gyazo.com/782c67e9e9c6f666eeaa9b93c7e95bf6][https://gyazo.com/d0a74c78ecd6343258766aec743ae253]
				It's not that hard.
		I received the news of the bookstore discovery via WeChat from a separate team and joined them.
			[https://gyazo.com/1bc01a7012c029e742bcec473e5f92b7]
				A wide variety of scientific reading materials for children
					There's about three times as much science reading material for kids as there is in this picture.
				There are countless kids in the early grades or kindergarten.
				He's sitting on the floor reading a book.
					I didn't see any Japanese cartoons.
					I was reading some sort of educational comic book or something like that from Gakken.
				Adults also sit and read.
				The same is true of yesterday's Shenzhen Book City.
			I felt the underlying strength of science education.
 			>Keisuke Sogawa: The trend is the same in Shanghai, where the percentage of household budget invested in education is very large.
    >Keisuke Sogawa: Yes, exactly like you said investment, not spending.
    >Nishio Hirokazu It's not about spending or redistribution, it's about "investment"!
		[Barber https://twitter.com/takesako/status/1160818929113038849]
		Robots sort books at the nearby Houan Library.
			>"When I went to the library, I saw a robot used in logistics sorting sorting books. The children with their families were very excited to see it, and I thought that technology is becoming more accessible to them.
				[Twitter with video https://twitter.com/knaohiro1/status/1157512049766912000]
			[Shanghai Library_First robotic sorting system in China at Shenzhen Baoan District Library http://www.library.sh.cn/Web/www/shtsg/2019724/n91353108.html]
			They say if you have a passport, you can get in.
			I wanted to go see this, but unfortunately it's Monday and the library is closed.
			I wanted to see the college bookstore, but they said it would be impossible because they were on summer break.
		Move to Nanshan and go to Shenzhen Book City's Nanshan branch
			[https://gyazo.com/9f39a3b35c6fdb6bd0ee21a177231902]
			Posters I didn't see at other stations.
				[https://gyazo.com/cd83a3ecc25f5238fb39f014749826ac]
				I googled it when I got back home.
					>General Secretary Xi Jinping pointed out the following at a meeting of the Party's activities for education and practical work on the popular line. (omission) The "four evil winds" of formalism, bureaucracy, hedonism, and extravagance are against the character and purpose of the Communist Party of China, and are the problems that the masses resent the most and are most dissatisfied with, and are also the serious root causes of damage to the relationship between the Party and the masses and between the cadres and the masses.
    		[Keywords for reading China: http://japanese.china.org.cn/jp/china_key_words/2019-04/15/content_74645981.htm]
    	Is this what you're talking about?
			When I left the station, there were people selling receipts and motorcycle cabs that carried people around.
 			The receipt clerk will call out "furpiao" (ç™ºç¥¨) while holding out a card-like object.
 				They collect receipts, turn them into furpiao, and then sell them.
			Slightly different from other fashionable stations.
			Walking a bit far from the station.
			On the way we passed by a guarded gate.
				[https://gyazo.com/31f41aa4c724aed957b6b20191cc7bfa]
				[Shenzhené¸¿ç‘žå›­å›­å°åŒº_é¸¿ç‘žèŠ±å›­è¯¦ç»†ä¿¡æ¯|äºŒæ‰‹æˆ¿|ç§Ÿæˆ¿|å°åŒºé¡¾é—®(æ·±åœ³é“¾å®¶) https://sz.lianjia.com/xiaoqu/2411049487692/]
				Maybe a residential area for high income people, gated off to keep low income people out?
			Shenzhen Shoucheng, a serious castle
				[https://gyazo.com/e1b60e23118b6b6eac95054342dd6d9c]
				[https://gyazo.com/42c7364c25511f8387d2d2a6a352fce0]
					I saw at the Central Castle a detailed description of "you choose, I buy".
					simply put
						Authenticate with your library reader card â†’ Select a book
						â†’You take it to the cashier, the library pays for it, and you can read the book for free.
						â†’ Return it to the library's automatic return table within 31 days.
					For more information [you choose, I buy].
				All shelves have 6-7 digit numbers so it's easy to find a book.
					[https://gyazo.com/504330e47a2cc8f6f6b391b0b9c778a5]
				I was passing by the picture book section, and they were introducing Philosophy Enlightenment picture books on the wall.
					[https://gyazo.com/42666e831844e112f4dc781d7a627c32]
			Reviews from people who bought the book
				[takesako https://twitter.com/takesako/status/1160850104783273985?s=21&fbclid=IwAR0q_oRRqrLd5diLZGj3rSENpbzlxOqUYYCJqp2fb3KfVRwTc7Sk1G2DaiI]
					>8 technical books bought at a bookstore in Shenzhen, China. These are maniacal, not-thin and thick books that are hard to find information in Japanese, even at Comiket. As for cutting-edge communication technology and embedded manufacturing systems, Chinese may be a better environment for learning.
				[Tokoroten https://twitter.com/tokoroten/status/1160819158038114304?s=21&fbclid=IwAR1-fV4EJDjKpc08l1ua76rWQbfr9OcDaOHONeR3gQTl9FW7itH13 BEf1Yo]
					>Shenzhen, a bookstore called Nanzan Shoujo's illustration study book, with captured pictures from anime and eroge mixed in, and illustrations of ships ...... This smells like a rather good buy.
				[Tokoroten https://twitter.com/tokoroten/status/1160918079561326593?s=21&fbclid=IwAR15Sv6uWqhH7cCW75QOhGUwPz1nfoxVoVquOlgEblJF6xoebzZJc 4KKJ4w]
					>I'll do a review of a book I bought on how to write that thing comic - 60 yuan, so multiply it by 15 and it's 900 yen.

	Nanzan Museum 10:00-18:00, last admission 17:30
		I didn't have time to go.

	Return to the center of the venue from Nanzan
		Seems to depend on the station whether the metal detector is there before or after you buy your ticket.
		After I got through first, the ticket vending machine had to start over outside.
		Alipay timed out (super hour) at the ticket machine, probably because it was right around the time I was going home.
		The map app was not connected for a while and I had to miss one train while waiting.
	Return to the hotel from the maritime center
		Go to [vivo Lab Concept Store

	I didn't have time to visit the nearby Reform and Open Museum, but according to those who did, it was just a regular museum.
		[The misconception that "the Chinese economy is entirely controlled by the Communist Party" | Diamond Online https://diamond.jp/articles/-/169567]
		[Why Shenzhen's "Reform and Opening Museum" Has Become a Gomazuri for the Powerful | Diamond Online https://diamond.jp/articles/-/187722]
		Ends at 7:00 p.m., last admission at 6:30 p.m.
	dinner
		Mystery dessert
			[https://gyazo.com/f694669342d42868cf5c804bb0bba991]
			Peach sap from peach trees, or "peach oil," was used.
			[https://gyazo.com/b402c2f3f4b4d972e3ad219f310e7113]
				[Amazon https://amzn.to/2Z1Va80]
	QQ sugar, a souvenir requested by my wife, which I couldn't find on my own, but a local man guided me to a private store rather than a beautiful supermarket because it is a kind of candy.
		It was in a store like this.
			[https://gyazo.com/d7496cce9d20330396bb7db2c4ac9fb4][https://gyazo.com/6d48a7e9a96fbd5dcbd103b5257f3a1c]
			They cost 2 yuan, or 30 yen apiece. That's no wonder you can't find them in fashionable supermarkets lined with imported goods.
			You can pay with Alipay at these stores
	Creatives who want to play Switch.
		[https://gyazo.com/c3b6761fc5c0585eaa87ef763aea6dfd]
	ã€€I've noticed a few examples of children saying, "Don't you have to go all the way overseas to do that? I realized that for adults who are already free, overseas is "a place to do things you can't do in Japan", while for children whose freedom is still restricted in Japan, it is "a place to do things you can't do in Japan".
	I told him that it would be better to look at medium-sized modules such as coin identification modules or receipt printer modules instead of small electronic parts or large finished products in an electronics town, and he pointed out that it is not cost-effective for stores to put such small and large products on the shelves, and that it is also not safe for buyers to pay for them after checking their operation in escrow. I was also told that it is easier to find modules on aliexpress than in stores, and that it is safer to pay after confirming the operation through an escrow transaction.
	Of course it is good that larger libraries in urban areas are improved, but for children living in rural areas, they want their local libraries to be improved, right? Libraries are a system where books are collected in one place and moved by humans, and as the logistics system evolves, it will be the books that move, not the humans.
	>The security guard in Shenzhen, with a plastic bottle holder next to his baton or radio, completely integrated with his equipment, so there is an affordance that "the guard drinks water". [src https://twitter.com/tokoroten/status/1160773930933575682]
		In Japan, some elderly people criticize security guards and bus drivers for drinking water, maybe they should put plastic bottle holders on their equipment and on the driver's seat!

Day 4
	[https://gyazo.com/17ec77ba304a84345a80e5b5217270af]
	iflytek's automatic translator is expensive at 2,600 yuan, but it can translate offline in major languages such as Japanese.
		It would be fun to buy that machine in the Electric Town and tour around while using it.
	I said, "I'm a parrot," and he recommended youdao (æœ‰é“) translation app with a parrot's symbol.
		[https://gyazo.com/36ba601af67f4619b8a52625fae0cc3f]
			Can translate by voice input
		[https://gyazo.com/b3f4ec11425dccf86db61f5ddd5289c8]
			A game in which you listen to Chinese pronunciation, imitate it, pronounce it, and clear the game if you can recognize it correctly (not true).
		Images can also be translated.
			[https://gyazo.com/cc1fee0c315e3358881923027cc90fc1][https://gyazo.com/16d275f7bb7e4c42dbad8b457389d786]
			The translation itself is correct, but the simplified characters remain simplified (we, individual, product, etc.), perhaps due to the font.
			ã€€Simplified Chinese literacy" is required to understand the original Chinese characters by looking at simplified characters.
	[https://gyazo.com/b6b51a7cb456bbdbc6798c279d731d15]
	[https://gyazo.com/335a2a04f5268e406d19a54fe1736189]
		Office Glico-like
		You can pay with Alipay.
		I've never really understood the cashless world.
			A digital infrastructure layer is created for the exchange of money.
				â†’Office Glico-like businesses can be started with little investment in technology.
			Unlike cash, the person who paid has evidence of payment.
			No risk of cash theft
		I understood that this was the case.
		Just as the creation of the information communication layer called the Internet has lowered the initial investment costs of the information business and made it easier to start a business, the creation of a cashless layer will create another new business.
		alipay is not a "store payment method" but a unified money distribution layer that says "you can pay stores and transfer money between individuals all the way".
		ã€€I'd like to tell my past self who thought, "Why don't you just use SUICA?" and say, "Tell me when you can use SUICA to pay your allotment or give money to your friends."
		For example, the company cafeteria at Cybozu now has a Suica reader, and each person pays by operating a button on the reader, but if the Suica layer is replaced by Alipay, the device can be a QR code.
		ã€€This means no more rental costs for reading equipment.
		You can create an Alipay app on top of the Alipay layer. When scanned, the app will ask for access rights.
			[https://gyazo.com/9c779d2894152405a2becc756f18ebdd]
		Choose and pay for your products
			[https://gyazo.com/96bf40a43f6e1f9e2405a0aa91d988d6]

	[https://gyazo.com/4cd70018223c4385fc2f31b4ce7b26fe][https://gyazo.com/6e5a22fa3eab0d3757c9ebf0773a487b]
		A person who bought a dried mango from a vending machine said, "The expiration date has expired! but the date of manufacture was imprinted on the mango.
		The term "shelf life: 300 days" means 300 days from the date of manufacture.
	Presentation of creators
		Each team is searching for the best way to speak in different languages.
		I speak in Chinese and then Japanese, I write slides in three languages and present them in English, and so on.
		Creators who use irasutoya w
		I'm 13, but "I'm 3!" is interpreted as a story that I'm simply not good at English and made a mistake.
			Jokes are hard to come by.
	[https://gyazo.com/1e130453ff30b1e7751207cbf3e1b402]
		One giant step forward in civilization!

	Free time for creators
		Adults follow for safety.
		Let's go see the Houan Library for robot sorting! I suggested it, but it was rejected because there was no one in the creators who agreed with me, ORZ.
		View electronics components in huaqiangbei
		It took me quite a long time to get to Huaqianglu from Ganqiu, and it was past 16:00 when I arrived there.
			I'm going to split off from the people who want to buy a weird keyboard and stick with the team (one person) who looks at electronics components.
			I would have liked to see the [phonetic alphabet] keyboard, but oh well, maybe another time.
		[https://gyazo.com/6bf9a8c205320db7c798f04e805a5fdc]
			About 105 Japanese yen
		é”‚ç”µæ±  = Lithium-ion battery
		ç»§ç”µç”µå™¨ = relay
		beeé¸£å™¨ = buzzer
		å¼€å…³=é–‹é–¢=Switch
		æŒ‰é’®å¼€å…³ Pushbutton switch
		[https://gyazo.com/f526108125885d7016487bfb7e02dea2]
			fire-breaking glass
		Optical Couple = å…‰è€¦ = å…‰ç”µè€¦åˆå™¨ = photocoupler
		Crystalline vibration is basically a crystal oscillator, but if a modifier is added, the meaning may change. I wonder if a voice surface crystal oscillator is a type of microphone that uses Rochelle salt crystals to convert voice surface waves into electricity, since voice surface waves are waves that travel over the surface of an object.
			Apparently not. A [voice surface resonator http://www.konuaer.com/lmportCrystal/SAW.html] is a SAW resonator, which generates surface waves by forming comb-shaped electrodes on the surface of a quartz crystal in alternating directions. This makes it possible to create a transmitter with a sharp frequency response and short wavelengths in accordance with the pitch of the comb. The linked R315M datasheet states 315MHz.
		å¯è°ƒç”µé˜»=Variable resistance
		There's a 450V 10000uF capacitor lol.
			[10000uf 450v Capacitors 450v10000uf 75*220mm https://www.alibaba.com/product-detail/10000uf-450V-Capacitors-450V10000UF-75-220MM_60603555539.html]
			He says it's 22 centimeters high.
		There is a Chinese button cell battery that says lithium battery in katakana lol
		é”€å”®=sales
		Import=Import
		 The Chinese word for "import" is the Japanese word for "input".
		YouDao is useful
			How many do you want?" "One red button and three yellow ones, please." and so on.
			Good to be able to instantly translate Chinese statements from someone who only speaks Chinese into Japanese.
			In written communication, the Japanese side must be able to understand the simplified characters handwritten by the other side.
			The other party must be familiar with smartphone text input.
			I was new to YouDao, so I did it myself, but later I wondered if I should have given the app to the creators and told them to do it themselves.
	Seems "chaotic."
		[https://gyazo.com/fcea710b9ab9559350da8fec6ddb2e85]
	 Chaos, no, I'm eating é¦„é¥¨.
	 Yakimugi is shumai, Japanese people think of steaming yakisoba, but here we bake it.
		 The flip side of this is that in Japan we cook gyoza, but when we say "gyoza" in China, dumplings are more commonly called "sui-gyoza".
		 Grilled gyoza is called é”…è´´ã€é‹è²¼ã‚Š in Japan.
	A creator who wanted to eat ramen but chose the stir-fry side and got the soupless ramen.
		I guess it means "mixed noodle" since it's "stir" of stirring.
	return train
		Train Video Memo
			If the elevator stops, pry the door open and go outside, or you'll fall to your death, so press the call button.
			If you do octopus wiring, it will cause a fire. If there is a fire, call the fire department and give them your address.
			We'll inspect you under the Anti-Terrorism Act, and we'll cooperate with you.
			If you see smoke on the train, calmly press the station attendant call button!
			Rewarded for reporting terrorists.
		Train advertising is often absent or dominated by one type
			This means that there is not much demand, and because there is no demand, it is relatively inexpensive, making it easy to buy up all the slots.
		[https://gyazo.com/40961526b4221795a4f23d7d93937f38]
		Advertisement in train, cool design
		Meaning: to
	  Let's maintain quality. Start with the head first.
 	 new hair growth
 	 hair (head)
 	 planting
  This ad is hijacking trains, and I can't imagine what it's like for someone with a hair problem.
	I heard there is a massage chair on the 3rd floor of Shekou station, but I don't have time to go there anymore.
	[https://gyazo.com/2b1894a562b2a3b9d2d7af25f697bf76]
		Give it up."
		I also saw "Chronic" (slow down), but I failed to take a picture of it.
	Drinking with CodeMao people
		[https://gyazo.com/bc0a4ac269e3c21796b7a927479798ce]
		You're going to light another fire, aren't you?
		I was told to put the straw in the fire and drink it all at once, and if I couldn't drink it all at once, the straw caught on fire.
		[https://gyazo.com/926c16358c54fe5291feb1f5bd84599b]
			There was a wine that had a unique taste with a herbal medicine feel to it and I wanted to know more about it, so I asked and got a picture, but I can't really tell what it was just from the picture.
			Apparently it's a German liqueur called JÃ¤germeister.
			After this he said, "Have you ever had a Corona beer? Have you? Then I'll have another one." and what came out was Hugarden. I prefer the local stuff, but I guess what the locals think is good stuff is imported.

5th day
	There is a famous story about how "letter" means "toilet paper" in Chinese, but there are many other words that mean different things.
		[https://gyazo.com/43745fd2d3a95b27a6b28399d42c9de8]
		I ate a piece of germ-fried meat, it was germy good.
	Creators trapped inside automatic doors
		[https://gyazo.com/81d4c2d06d7dc3becdfdb90c5b2b143f]
		If the gate is held more than 10 cm away, the gate will automatically shut down.
		Y: ~and, rule ~shogun: As soon as you do anything
	I had to take the first class ferry on the way back because there were not enough seats due to the trouble at the Hong Kong airport.
		[https://gyazo.com/ff5b92f8d4379ae4c8391a9c3c638ceb]
		The going price was much higher as it was 140RMB, but I was not so happy (I wanted water, but I got hot tea).
		Q: What is RMB? A: Ren Min Bi
	There are a few cancellations, but the plane we are on is fine.
		Were you okay with the demonstrations and such? I'm often asked, but it was peaceful.
	massage chair
		[https://gyazo.com/fe8228c705e5d0044530120865b7ae77]
		I wanted to use it this time, but I could only make WeChat payments...
	Someone is doing karaoke in this short time w
		>Box karaoke in airport. you can use it if you are a WeChat friend and pay with alipay or WeChat Pay. [src https://twitter.com/kyasbal_1994/status/1161512090932301826]
 		[photo https://twitter.com/yasulab/status/1161504529571074052] [photo https://twitter.com/yasulab/status/1161511291833524227]
	ferry
		Wifi on the ferry asks for a phone number, but not a 10 digit number.
	I got 120 HKD back tax free.
	Renminbi is also accepted at Hong Kong Airport.
		[https://gyazo.com/852bb2f51a518170716ea4dd7afeffa6]
	Hong Kong is a traditional Chinese cultural area
		[https://gyazo.com/655d362770c2a853fde638fab99f684f]
		The character "è­²ã‚Œ" is not "è®©" but is more like Japanese Kanji.
		[https://gyazo.com/0dfec3f5c4d643ebcd656c8e3583fb23]
		this handset
		The Japanese kanji for "ä¼" is "ä¼ " in simplified Chinese, so the Japanese kanji is the most simplified in this regard.
	>Hong Kong airport restaurant, if you order an iced coffee, you'll practically die from Max Coffee [src https://twitter.com/tokoroten/status/1161525039948320770].
	>luckin coffee, which is destroying Starbucks in China, you can't even order without the app. There's a function to send coffee to a friend or have it made before you go to the store. Of course, you pay with WeChat Pay or Alipay. [src https://twitter.com/kyasbal_1994/status/1161516412399247360]

On the return flight, there were a large percentage of Japanese people, probably because it was bound for Japan.
	The Japanese guy next door says, "We have tofu, but no soy sauce!" Tofu is sweet!" But that's because it's dessert tofu...
	[https://gyazo.com/fa5c5551bdf727cb99f90c18a6cf8d29]

returning home

> Recorded with @Makeblock's @maming435 and CoderDojo mentor @YukiMihashi at @Makeblock in Shenzhen, where various IT companies and venture businesses are gathered! ðŸŽ§âœ¨ https://coderdojo.jp/podcasts/14
> We talked about University Castle in Shenzhen , payment apps, #Unexplored Junior Shenzhen tour ðŸ‘¥ðŸŽ™âœ¨[src https://twitter.com/yasulab/status/1161837580846948352]

	Install WeChat client for Mac
		I couldn't go back very far in the log.

	8/11 Drone Show [https://wap.peopleapp.com/video/4477835/4352203 video] [https://mp.weixin.qq.com/s/V775Ojykp8FGFqpnOP0qkw video article]
		I couldn't see it.
	8/10
		>On August 10, a large number of citizens reported seeing a large number of military police vehicles being assembled in Shenzhen. Some citizens speculated that the military police gathering was the result of the summer training of the Guangdong Public Security Bureau. The "People's Armed Police Law of the People's Republic of China "è§„å®š:The People's Armed Police Department will participate in the treatment of riot, disturbance, serious violent crime incidents, terror attacks, and other social security incidents. [src https://m.toutiaoimg.com/i6724210491209548296/?app=news_article&timestamp=1565624039&group_id=6724210491209548296]
		Not a few citizens saw a large number of armed police gathered in a fresh area, and one citizen speculated that it might have been a military drill. The Armed Police Law stipulates that the Armed Police Department may participate in the treatment of disturbances."
		You sound like you've got something stuck in your very back teeth, but you're talking about the Hong Kong protests.

>Do you think digital technology will make the world a better place? Japanese people have by far the lowest trust and expectations of technology in their answers to the question "Will digital technology make the world a better place?
	[https://gyazo.com/73b8f40408e5ec37ffc61e4bb6608e0e]
		[src https://twitter.com/gijigae/status/1117935135934926848]
	Japan and China are two extremes.

Articles by other participants
	[Shenzhen,Unexplored Junior Shenzhen Tour,Shenzhen Tourism,Shenzhen Cutting-edge IT Technology | SyuBlog https://syublog.jp/mitoujr-shenzhen/]

sweets
	[small face muscle].
