Alibaba's supermarkets盒马鲜生
from [Unexplored Junior Shenzhen Tour 2019].
Alibaba's supermarkets盒马鲜生
	I'm going to the supermarket.
		[[Alibaba New Retail Strategy in Full: Part 3: 盒馬鲜生 (Pharma Shon Sheng) is a 4 complex O2O supermarket｜Alibaba | GloTech Trends https://glotechtrends.com/alibaba-new-retail-170906 /]
		> In the morning of the second day, we went to the biggest bookstore in Shenzhen. There was a Scratch book by Abe-sensei, and AI and Python were being heavily promoted. For lunch, we went to 盒马鮮生, a supermarket run by Alibaba. I grab some fish and shrimp and have them cooked. Products ordered online are running around the ceiling rails lol [src https://www.facebook.com/ukai.yu/posts/10219356633247274]
		[video https://twitter.com/kyasbal_1994/status/1160395897819164674]
			>You can order online like Uber eats, and once the order is placed, the clerk picks up the items, puts them on rails, and hands them to the delivery person waiting in the back.
			>The cost of delivery is free for purchases over 39 yuan. Here is the strength of holding the sales as well as the delivery.
   > It seems that most of the visitors to the supermarket are there for food. If you want to cook at home, it seems you can order it online.
  [video 2 https://twitter.com/kyasbal_1994/status/1160396880431341568]
   > Most of the fish are alive and few fish are sold filleted.
   >Instead, you can have it gutted or filleted when you buy it.
   >There is also a restaurant on the premises, where you can have your food prepared as you get it.
		[https://gyazo.com/d42e609fe0925acaf9290a2fed5b1e6a][https://gyazo.com/93fb3a1941d33ea1788f4764e34ed8d8]
			Alive.
		[Nishio Hirokazu - fresh shrimp in a fish tank at the supermarket, delivered on a conveyor belt https://www.facebook.com/nishiohirokazu/posts/10218956315035393]
		A conveyor belt near the ceiling carries more and more packages after receiving an order from the Internet.
		Cook and eat freshly purchased creatures at the attached eat-in restaurant.
  To buy things at the store, you need to put in an app.
   [https://gyazo.com/03d6844c14664d5f4e3ecf48f2a88df2][https://gyazo.com/dbd948c8e16b1aa3de711f9bbbe262e4]
		Oi Ocha is packaged for China because at first glance it appears to be a Japanese package, but there is a description in Chinese
			[https://gyazo.com/4718c41b3abdc5d254bc24bfa2a54982][https://gyazo.com/566e357e90ebd506e8bba46fe8942759]
			Anything that doesn't say "unsweetened" is basically sweet, even if it's a green tea drink.
	massaging tool
		[https://gyazo.com/5357c1e87749688d0c788f709e73647e]
			13 yuan (200 yen) for 18 minutes
			8 minutes for 8 yuan, 25 minutes for 18 yuan
			I wish Japanese massage machines could do that much rubbing.
			There was no time to try.
