RoboMaster2019 Finals
from [Unexplored Junior Shenzhen Tour 2019].
RoboMaster2019 Finals
	I'm here for the Kikko-Daishi's general decision! [Facebook https://www.facebook.com/ukai.yu/posts/10219358221966991]
	[https://gyazo.com/041bafc39e2d47080cfd321bbb9eb9b8][https://gyazo.com/c5b0b8b3577100b6fd43a728a06ac5af]
	The team's flag is flying.
		[https://gyazo.com/786ed897c2d76e8535036dbe03bdc1b3]
	The venue looks like this
		[https://gyazo.com/9ddee5a806e5e4923101abf42a4f5270]
		Seat numbers were separated by even and odd numbers, which was confusing.
		 [https://gyazo.com/4e1ed7ea1a403ae394c18e8f99ae90e2]
		For more information on the rules, please refer to [RoboMaster: An Overview of the Tournament and Rules | FUKUOKA NIWAKA http://projectrm.niwakasoft.jp/what-is-robomaster/] for a concise summary.
			FUKUOKA NIWAKA is a team from Japan participating in this contest.
		I even took some videos of the venue, but you can watch them on Nico Nico Douga or Twitch with a beautiful camera.
			[Live Streaming] RoboMaster 2019! Let's support FUKUOKANIWAKA | FUKUOKA NIWAKA http://projectrm.niwakasoft.jp/robomaster2019-live/]
		>I've seen the RoboMaster finals. I was super impressed. The robotics competition was not just "the robot moves and looks awesome" but everything that it should be: the enthusiasm that goes beyond that, the professionalism of the coxswain, the respect for the engineers, the drama with the friends behind the scenes, and the sense of learning that explains the mechanisms without misrepresenting them. [src https://twitter.com/kyasbal_1994/status/1160481612552798209]
			>Explanation against highly stable drones. The launch mechanism was modified to be the deciding factor for the winning team due to its amazing stability.
			>The concept of eSports, like the results screen and the ease of analyzing results, is being used for robotics competitions.
		After returning to Japan, the person I showed this video to said, "Isn't that an overwhelming difference in technology from Japan?" but that's not quite true.
			RoboMaster has been held under approximately the same rules for five years, although the rules have changed slightly from year to year.
				That's why the accumulation of technology is happening.
				There is also a bounty for open sourcing.
					>Open source 1st class is 100,000 yuan (approx. 1.8 million yen) [Reasons for RoboMaster's rapid growth - Analysis from a Japanese roboconist's perspective | Device Plus - Devapla https://deviceplus.jp/events/robomaster2018-04/]
				The shiny design on the exterior looks cool and consistent, but that is a sensor module supplied by the management to determine damage, and its installation is required by regulations.
				On the other hand, there's the problem of everyone being a similar or identical robot.
			In a contest like Japan's Robocon, where the rules are reset every year, the robots are diversified.
				FUKUOKA NIWAKA won three design awards.
 				[https://gyazo.com/c677f6be406a95d69f8539f1b25b3ffc]
 				>The team's engineer robot, infantry robot, and drone won the RoboMaster2019 international frame design awards! (omission) I think it's safe to say that it's an accomplishment for one team to receive three out of five different types of robots.
 					[[RoboMaster2019] FUKUOKA NIWAKA Result Report | FUKUOKA NIWAKA http://projectrm.niwakasoft.jp/2019/08/05/robomaster2019-fukuoka-niwaka/]
				We're seeing these great results in the design direction.
			It is not a matter of which type of game is better: one with strict rules and racing on a one-dimensional evaluation axis, or one with loose rules and exploring a variety of options.
				RoboMaster has a strong racing element, but also offers a variety of evaluation criteria such as design and open source awards.
				The strong tinge of competition appears to create incentives to expand the ecosystem.
					To use an analogy, the Waseda-Keio game is not about "either of you made an original play," but about "win or lose," which creates a feeling of "I don't want to lose to my rival," making it easier to get alumni and others involved.
	MVPs will be awarded for each game.
		[https://gyazo.com/5d9ab81bfd1c84091522766f134e85c6]
		 Operators and R&D representatives (R&D leaders) are featured.
	In the free time between matches, technical commentary is sometimes given.
		[https://gyazo.com/e2f91f681a93d6a026efb6c34434a532]
		This explains that the center of the head is in the center of the four tires and that the weight distribution to the four tires must be consistent for the robot to operate.
			Others were talking about targeting by image processing and a mechanism to eject bullets from a drone with less recoil.
		>I'm giving a lecture on image processing during a break, or talking about design. It's Learn to Win [src https://twitter.com/tokoroten/status/1160457996561874944]
	It's a very good design, with commentary on image processing and mechanical engineering in the time between games, a focus on the MVP at every game, and always shining a light on the engineers as well as the people operating the system when introducing the MVPs.
	Ecosystem Design
		[https://gyazo.com/e0c4bc2c2596659f548d17d1ec2106e8]
		Ecosystem design is clearly stated in the brochure.
  4 school ecosystem, event system, mass education, and cultural propagation.
	[Reasons for RoboMaster's Rapid Growth - An Analysis from a Japanese Roboconist Perspective | Device Plus - Devapla https://deviceplus.jp/events/robomaster2018-04/?fbclid=IwAR13mphTw0h2xYAB1EqQfVy58_ UnggimfM9T73GXAbs8hzJWjTB3TQ9vy0k]
	 > The high prize of 100,000 yuan (about 1.8 million yen) for the open source first prize also suggests that the DJI side is pushing very hard.
		I see, so there is a prize for open source as well as a prize for the winner of the contest.
		>Haruyuki Seki In Germany, the government is offering prize money for open source projects. I would like to do it in Japan as well. https://prototypefund.de/en/
	Q: Why does it spin around? A: There are lights on both sides of the armor module to judge the damage, and if it is stationary, it can easily be auto-targeted by image recognition.
	The first three winners win, and the third-place game was exciting with three consecutive wins in a row after two losses.
	deciding match (in a competition for a cup (pennant))
		Can you win by precision shooting the sensors on top of the fortress without dropping the barriers?
		The drone's targeting capabilities are overwhelmingly technical, interesting.
		I'm curious as to why the drone didn't let him toddle off in the second round, can it be serviced before the third round?
		Injection mechanism commentary videos were interspersed between matches, I want to be able to listen to Chinese.
		It is my understanding that there is an ejection mechanism using friction rollers instead of air, which stabilizes the initial velocity and thus improves aiming accuracy.
		Technological innovation creates overwhelming advantages
			It's like Civilization, where bombers are the most powerful in a world with no air power.
		The red drone flew first and you can't go interfere.
			String attached, because if the drone malfunctions and falls into the audience, people can be injured.
		I'm sure there will be items in there that will interfere with drones next year.
			Proposal to include a rule to destroy helicopter depots.
			Let's introduce a target that reduces the opponent's drone charge.
			Or smoke screen module
				There was just an article on the topic that the Yawata Steel Works burning coal tar to create a smoke screen was the reason why the atomic bomb did not fall on Kitakyushu, I don't know if it's true or not.
	That's a lot of money for the winner, about 7.5 million.
	>There is excessive pressure to make things easier to understand due to TV broadcasts, reducing the players to the framework of "people doing interesting things" instead of "making them heroes.
		>It is important to say that the operator is not a TV station... It has to be one that clearly benefits from the cycle of creating heroes and increasing the population that plays the sport. Otherwise, the only KPI that can be defined is the short-term number of viewers, and it becomes a documentary existence, a program that is easy for everyone to understand.
			>When I saw this story about TV stations optimizing for ratings written by watching this Chinese robocon thing, I thought it was the same structure as the problem of publishers optimizing for circulation by watching Chinese bookstores yesterday.
				[src https://twitter.com/nishio/status/1160576522689794048]

	[RoboMaster]
