Video Equipment
My video equipment notes
	[https://gyazo.com/8db228e103c30196697e93c4fdfc6583]
		[Osmo Action https://amzn.to/32kLtU8]
		The most important thing is to have a preview screen on the lens side
			You can check to see if you are in the picture while taking yourself
		Some regular camcorders have a rotating preview screen, so that was still good.
			In comparison to those things, "smallness" was important.
			[RoboMaster S1] because we felt there was "room for interesting things in the future," such as incorporating it into the
		There is a theory that the in-camera of the iPhone 11 is beautiful enough nowadays.
		Q: I want to do real-time live game play, will the capture board connect?
			I don't think it's connected. I don't know because I am not doing the real-time actual situation myself.
	[https://gyazo.com/dd5a139b0679198384b3e44bc011d262]
		[YAAAM Cold Shoe Extension Aluminum Alloy Camera Frame for OSMO Action https://amzn.to/2HHOuWR]
		For coupling to tripod
	[https://gyazo.com/89b8fdfb0d1e185eebf8db057fd4ed78]
		[Velbon Tabletop Tripod EX-mini 2-Section Lever Lock Leg Diameter 17mm Compact 2-Way Head Aluminum Leg 301727 https://amzn.to/30TJ6aC]
		Relatively low tripod
			Before I had the equipment, I was taking in-camera photos with my iPhone on a smartphone arm, but it was difficult to get it level.
				If you look at the video on a larger screen after shooting, it's a bit skewed.
			With this tripod, if the three legs are placed on a level surface, the video taken is also level.
				Due to the lack of freedom in the roll direction of the camera
	combination
		[https://gyazo.com/846a7167b73c7d7ba4431c42edfd4908]
  [https://gyazo.com/ecc38bc09e4c45e2e1d9060bee790994]
		Here is the beginning of the video I took during this setup
			[https://youtu.be/hITL1cdaXlY?t=383]


	SD card
		[SanDisk ( SanDisk ) 64GB Extreme microSDXC https://amzn.to/2ZzcG7W]
		I am not particularly particular. I'm willing to buy more if the capacity is not enough.
		It was chosen as Amazon's Choice, so I was like, "Okay, I'll take it.
	editing software
		[Adobe Premiere Pro https://www.adobe.com/jp/products/premiere.html]
		I've tried iMovie and Adobe Premiere Rush.
	microphone
		I didn't buy it.
			I find that OSMO mics have a cleaner voice than PC mics.
			If you have an intercom, using it might be cleaner than using a PC microphone.
	lighting
		The conference room space is clean, bright, and has multiple lights in the ceiling.
		In comparison, private homes have poor lighting.
		YouTubers often use ring lighting
			[https://gyazo.com/bc87900f93b57cdfa3e7706a398a8869]
			[Amazon https://amzn.to/2p7J15A]
		I didn't buy it.

[Video Creation]
