Improvement for English version (chapters 6 and 7)
[* Chapter 6]
[Budding Phase]

p.188
>- What constitutes special material depends on the environment you are in and the problem you are solving. However, if you want to solve a problem that is close to you, you are likely to find yourself an effective means of finding problem-specific information. Instead of assuming that the correct answer lies outside of yourself and exploring only outside of yourself, you need to look at yourself, respect yourself as an individual interviewee, and listen to what you think subjectively.
>+ What constitutes a special resource depends on the environment you are in and the problem you are solving. If you are trying to solve a problem that is close to you, you are most likely a useful source of information yourself. We tend to assume that the correct answer lies outside of ourselves. However, this is incorrect. Instead of exploring only outside of yourself, you need to look at yourself. You need to think of yourself as an important interviewee and carefully ask yourself what you subjectively think of yourself.

p.194
>- When we reduce an abstract concept that has no physical form to a physical sense, we often create a metaphor. Since the abstract concept has no form in reality, we compare it to something else that exists in reality. A parable can be taken as a physical sensation or experience that has not yet been verbalized beneath the surface, but is barely verbalized through the uncommon use of words.
rewrite
	Abstract concepts have no physical form. When we bring them closer to concrete physical sensations, they often give rise to parables.
	Why. Abstract concepts cannot be captured by the physical senses because they have no physical form. By trying to capture it with the physical senses, we begin to use objects that have physical form in place of the concept.
	In a parable, words are used to mean something different from their common meaning. Through this uncommon use, your experience, which is not yet in the form of words, barely partially becomes a form of words.

p.195
>- Young also compared the idea creation process to a coral reef. Ideas appear as suddenly as beautiful coral reefs appear suddenly in the blue ocean. However, the coral reef is created by the activity of countless tiny coral worms in the ocean. In the same way, an idea may be the final fruition of activities going on in the subconscious mind.
rewrite
	Young also compared the idea creation process to a coral reef. A beautiful coral reef suddenly appears in a blue ocean. Ideas also appear suddenly. Coral reefs are created by countless tiny coral worms in the ocean. Ideas are also the result of countless small activities going on beneath the surface of our consciousness.

p.195
>- We also found that when analogies were made in distant fields, for example, between industrial products and objects in nature, the novelty of the product was higher
>+ We also found that when analogies were made between, for example, an industrial product and a distant field such as animals, the novelty of the product was higher!
　Corrected because it is unbalanced that one is an "industrial product" while the other is "something that exists in nature".
　Examples include the analogy between the pantograph of a bullet train and the wings of an owl.
　https://www.7midori.org/katsudo/kouhou/kaze/meister/16/index.html

p.195
>-A metaphor is a parable that does not explicitly state that it is strictly metaphorical. Warming up an idea is a metaphor: "An idea is like an egg. However, for the purposes of this chapter, this distinction is not important, so you can think of a metaphor as a parable.
>+A metaphor is a parable that does not explicitly state that it is strictly metaphorical. For example, "warming up an idea" is a metaphor. An idea is like an egg. When it is first produced, it does not move, but by warming it up, it becomes a chick and begins to move on its own. However, this distinction is not important to the story in this chapter, so you can think of it as a metaphor.

p.197
>- Clean Language, created by counseling psychologist David Grove, and its derivative Symbolic Modelling (note 29), is a methodology aimed at eliciting metaphors from the other person (note 30). Although this methodology is directly aimed at other people, there are several concepts that can be used as references. The three categories of "abstract concepts, bodily sensations, and metaphors" in this chapter are based on their arguments.
	Two problems.
	　Helpful" but not clear on "helpful for what?"
	　Not clear who "they" refers to.
>+Clean Language, created by ++counseling psychologist David Grove, and its derivative Symbolic Modelling (note 29), is a method that focuses on the metaphors of the person being spoken to to help them verbalize (note 30). The ideas of this method can also help in one's own verbalization. For example, the three classifications of "abstract concepts, bodily sensations, and metaphors" in this chapter are based on Symbolic Modelling.
　If possible, I would like to clarify "Metaphor in Mind p.4" in a footnote to "Symbolic Modelling was referenced".
　Additional description: [abstract concepts, physical sensations, metaphors].

p.197
>- For example, when the other person says "bird call," you can ask, "What kind of bird call is that? For example, when the other person says "bird's call," you can ask, "What kind of bird's call is that? If the other person says "bird's call," for example, and you ask "what kind of bird's call is that? If you just dig deeper, your field of vision will become narrower and narrower, so you can broaden it by asking, "Is there anything else about the Japanese white pine? If you ask, "What else do you know about this pine tree? The details of the metaphor are completely different between "the sound of a bird" and "the sound of a pine tree that my parents have.
	Particularly important are ❶and❷.
	For example, when the other person says, "A bird's call," you can ask, "What kind of bird is that?" you can ask, "What kind of bird is it?
		If the other party responds, "the call of a Jew's Pine", the abstract concept of "bird call" becomes more concrete.
 And so, as we dig deeper and deeper, our vision becomes narrower and narrower.
	 So you can broaden your horizons by asking, "Is there anything else you can tell us about Juhshimatsu?
	 When the other person replied, "I keep them at home," I was able to get some information about the surrounding area.
 There is a difference in metaphoric detail between "birdcalls" and "the voice of my parents' Jew's Pine."

p.198
>I've heard almost the same thing about ❸ and ❹ ...

 We hear almost the same thing in ❸ and ❹ . This method emphasizes the position of the metaphor.
 This question has the effect of making us think that X is not an abstract entity, but a physical entity that occupies a place. This question encourages abstract concepts to become physical metaphors.
 For example, "creativity" is an abstract concept. Let us ask the question. Where is creativity? Think about it for a moment.
 Some will say it is the head, others will say it is the fingertips. It is a personal metaphor, so it varies from person to person.
 [(6.2.3.1) Try to draw a picture] gave some examples. One designer believed that "creativity is initially in the brain and eventually spreads outside the brain. Another designer thought that "creativity exists among team members.
 Where does creativity reside?" If you answered, "It's in my head," that would imply that "other team members can't see your creativity directly. That implies that the other team members cannot see your creativity directly. If you think it is "in between members," it implies that "the creativity does not match each member's thoughts.
 I too ask, "Where is the creativity?" I ask myself. In my case ~.
 After explaining all this, I realized that there is a second kind of creativity, namely, creativity in the belly. I seem to think that there are two types of creativity: mechanical creativity that rushes through large amounts of information, and vegetative creativity that grows slowly over time. By developing the metaphor, my idea of creativity has been verbalized (Note 32).
	The ❺ is a direct metaphor elicitation question. Metaphors are generated and clarified by these five basic questions. These clarified metaphors are called "symbols" in Symbolic Modelling. Then, by clarifying the changes on the time axis of the symbols and the relationships among them, a "model created using symbols" is created. This model helps us to verbalize our ideas.

We're done here.
　[pIntEn Translation completed up to chapter 6#61f30bdeaff09e0000135f32]

p.200
>- So far, we have delved from abstract concepts to physical sensations and metaphors, comparing what can and cannot be put into words to an iceberg, and approaching the surface of the water. What is the closest thing to the surface of the water? I believe it is discomfort. In this section, I will explain the concept of tacit knowledge and its two sides of the same coin: discomfort.

>+ So far, we have compared what is verbalized and what is not to the part of the iceberg above and below the surface of the water. We have then progressed from abstract concepts near the top of the mountain to physical sensations and metaphors, approaching the surface of the water.
> What is the closest thing to the surface of the water? I believe it is discomfort. In this section, I will explain tacit knowledge and discomfort. Tacit knowledge and discomfort are two sides of the same coin.

p.201
>- Michael Polanyi called the sense of sensing that one is close to solving a problem "tacit knowing. He argues that humans have a nonverbal ability to sense when we are approaching or not approaching a solution to a problem, and that this ability is used to discover linguistic knowledge that has yet to be discovered.

>+ Michael Polanyi believed that humans have a nonverbal ability to sense when they are approaching or not approaching a solution to a problem. He also believed that this ability is used to discover linguistic knowledge that has yet to be discovered. He called this ability "tacit knowing," the "sense of coming close to solving a problem.

>- The philosopher Plato (Plato) wrote in his book "Mennon", note 32, that if you know what you are looking for, there is no problem, and if you do not know what you are looking for, you cannot expect to discover anything. The search for knowledge is not like searching the house for a missing wallet. If you can clearly verbalize what it is that you want to find, then you already have the answer.

>+ The philosopher Plato believed that "if you know what you are looking for, there is no problem, and if you do not know what you are looking for, you cannot expect to discover anything. "*32 The search for knowledge is not like searching the house for a missing wallet. If you can clearly verbalize what it is that you want to find, then you already have the answer *33.

>- I have not found a good word to describe this "feeling of being close to solving a problem"; Polanyi's proposed translation of tacit knowing is "tacit knowledge," but as of 2017 it has two meanings, "a feeling of whether you are close to solving a problem" and "empirical knowledge that has not yet been verbalized." It has two meanings, and many people seem to take it to mean the latter.

>+ I couldn't find a good Japanese word to describe this "feeling of getting closer to solving the problem." A common translation for "tacit knowing" is "tacit knowledge". However, as of 2017, "tacit knowing" has two meanings. One is "a feeling of whether or not one is getting closer to solving a problem," and the other is "experiential knowledge that has not yet been verbalized," with most people using the latter meaning.

p.202
>The subtitle of "Personal Knowledge" was "Toward a De-Critical Philosophy. Since Descartes proposed methodical skepticism in his "Principles of Philosophy "2 in 1644, Western philosophy has emphasized the linguistic process of questioning what we take for granted. The title of Polanyi's book, "Critical Philosophy," refers to this, The term "critical philosophy" in the title of Polanyi's book refers to this.

>+ In 1644, René Descartes (Descartes) proposed the methodical skepticism of "doubting everything but what is certain" in his book "The Principles of Philosophy">+ Note 2.
>From 1781 to 1790, Immanuel Kant (1781-1790), who considered doubt (criticism) to be the most important task of philosophy, published books entitled "Critique of Pure Reason," "Critique of Practical Reason," and "Critique of Judgment" in which he used the term "criticism" to describe the process of linguistic thinking. The term "critical philosophy" in the title of Polanyi's book refers to this.

p.203
>-Ikujiro Nonaka, a management scientist, discussed knowledge creation within organizations in his 1996 book "The Knowledge Creating Company" Note 4. focused on knowledge creation by individuals, but Ikujiro Nonaka's interest is in knowledge creation within organizations.

>+In 1996, management scholar Ikujiro Nonaka developed Polanyi's ideas in his book "The Knowledge Creating Company.
>We divided knowledge into formal knowledge, which is verbalized, and tacit knowledge, which is empirical knowledge that has not yet been verbalized. We then added the dimension of whether knowledge resides in individuals or in organizations. This is to discuss knowledge creation within organizations; Polanyi's interest was in the knowledge creation of individual scientists, whereas Nonaka's interest was in knowledge creation within organizations.

p.204
>- I am sure you have all experienced this kind of "uncomfortable" feeling. However, since the reason is not verbalized, many people may take it as something inferior and disregard it. However, it is rather the opposite, and it is better to see discomfort as an important sign that the reason has not yet been verbalized, and that there is something there that needs to be verbalized.

>+I am sure you have all experienced this kind of "discomfort". Since the reason for the discomfort is not yet put into words, we tend to feel that it is inferior to what has been put into words. Therefore, discomfort is easily disregarded.
>But it is the opposite. Discomfort is a sign that "what is not yet verbalized" is there. It is like the shadow of a fish swimming on the surface of the water. Linguization is to catch it.

p.204
>-TAE is a complex methodology consisting of 14 steps, so we will not describe it in detail here. The philosopher Eugene T. Gendlin et al. who developed this methodology call the "felt sense" the "physical sensation that we have not yet been able to articulate well, but that we feel is important," and we will adopt it in this book because it is useful.

>+ TAE is a complex methodology consisting of 14 steps and will not be described in detail here. The philosopher Eugene T. Gendlin, who developed the method, calls "what has not yet been put into words well" by the name "felt sense. Giving a name to a concept is useful because it can be used as a handle to point to the concept. Therefore, we will adopt the term "felt sense" in this document as well.

	The handle pointing to the concept is discussed on p. 36
	I had written "a physical sensation that I have not yet been able to articulate well, but which I feel is important," but since there is no need to limit it to that, I have rearranged it.
　When I explain it casually in Japanese, I describe it as "moyamoya".

p.204
>What I found particularly interesting was the step of using a dictionary. You look up key words in the dictionary that seem important in the short sentence and compare the dictionary description with what you meant to say. Since the words in the short sentences are words that I have tentatively applied to a felt sense that I cannot express well, there is often some discrepancy when I compare them with the dictionary explanation. I pay attention to that discrepancy, or discomfort.
	What I found particularly interesting about TAE was the step of using a dictionary.
	First, select key words from a short sentence that expresses your sense of what is important.
	Then, look up the keywords in a dictionary.
	Then, compare the dictionary description with what you want to say.
	Words in short sentences temporarily point to a felt sense that you are unable to articulate well.
	So, in many cases, there is some discrepancy with the dictionary description.
	Let us focus on the discrepancy.

[https://gyazo.com/fc0a1ac0899dab0cd596e32675f6748f]

>For example, I have a metaphor that says, "I have a gear in my head that sometimes spins around at high speed. I have a metaphor that if I let other gears work in this state, the teeth will be chipped, so I need to slow down. One day it occurred to me that this "slowing down" might be what the world calls "meditation.
 For example, I have a metaphor.
  I have gears in my head.
  Sometimes its gears do not mesh with other gears.
  In that case, the gears in my head are turning at high speed.
  If that gear were to mesh with another gear, the tooth would be chipped.
  So we need to slow down the rotation of the gears.
 At one point, it occurred to me that this "slowing down the rotation" might be what the world calls "meditation.

>I was strongly disconcerted when I looked up meditation in the dictionary and found that it means "to meditate deeply and quietly with one's eyes closed. The felt sense I was trying to describe with the word "meditation" does not require closing one's eyes. Also, the expression "meditate on a thought" does not fit the image of trying to turn something and slowing down its rotation. The only words that fit me in this description are "deeply" and "quietly".
	However, when I looked up meditation in the dictionary, I found that it is "to close one's eyes and meditate deeply and quietly.
	The dictionary definition of the word "meditation" does not match the felt sense I have tried to express with the word "meditation". There is a discrepancy.
　We focus on this discomfort. What does not feel right?
　The felt sense I have tried to describe by the word "meditation" does not require closing your eyes.
　Also, the expression "thinking about" does not fit the image of trying to rotate something and slowing down the rotation.
　The only words in this dictionary description that fit me well are "deep" and "quiet".

>I think "deep" and "quiet" are words that fit well in describing my felt sense. This would correspond to "slow down". So, the opposite of "deep" and "quiet" should correspond to "spinning at high speed". Will it spin noisily? The opposite of deep, shallow or high would be incongruous. If it is floating or not grounded, it would be acceptable. In this way, by looking up key words in a dictionary and focusing on the discomfort of the explanation, you are making your point clearer.

	In other words, "deep" and "quiet" are important words to describe felt sense. Let's focus on this.
	　The words "deeply" and "quietly" would seem to correspond to "slowing down." Then, conversely, the opposite of "deeply" and "quietly" should correspond to "spinning at high speed.
		Will it spin noisily?"
		What is the opposite of "deep? Shallow or high doesn't feel right. If it is floating or ungrounded, is it acceptable?" the thought develops.
	This is how you make your point clearer by using a dictionary of key words and focusing on the discomfort of the description.

p.205
>Note 41 - There is also a metaphor in Japanese for "quick thinking. I am wondering if this could be interpreted in a bad way.

>+The Japanese language has an idiom "quick-witted" (= clever). This idiom is usually used in a good sense. However, I believe that there are situations where being quick-witted is bad.

>Public and Private Words
Totally rewritten.
	Intent: the terminology of Merleau-Ponty was used verbatim in the text, which made it difficult to understand. The terminology is not important and should be relegated to a footnote.

Public and private language
	There are two types of language: public language and private language.
	Consider two people, Mr. A and Mr. B.
	The definition of the meaning of a word by a dictionary is shared between Mr. A and Mr. B. This "meaning" is in the common domain of Mr. A's and Mr. B's icebergs.
	On the other hand, the "newborn words" spoken by Mr. A in his attempt to verbalize something that has not been verbalized are near the surface of Mr. A's iceberg. Therefore, we do not know if Mr. B, who sees the words, will feel that they "mean what Mr. A intended them to mean.
　Since the "newborn language" is private, one need not worry about whether or not others will understand it. On the other hand, to communicate it to others, we need to refine it into a better expression.
　This is similar to what [(6.1.2.1) Young's Idea Method] says, "[Ideas] do not work very effectively as they are born.
　Whether it is a word or an idea, it has to be nurtured after its budding.
	The method described in [(6.2.5.4) Checking with the Dictionary] is a technique for clarifying what you mean by "newborn words" by comparing what you want to say with the public meaning in the dictionary.
	 This is an example of promoting understanding by comparing similar things ([(1.5.1.1) Focus on the difference between "same" and "different"]).


footnote
	>The term "institutionalization" was used by philosopher Maurice Merleau-Ponty. He argued that the "institutionalization" of "the language being spoken" gives rise to words that are used by several people for a common meaning. Reference: Maurice Merleau-Ponty, "Phenomenology of Language," translated by Shizuo Takiura and Yoshiro Takeuchi, edited and translated by Hajime Kida, Misuzushobo, 2002.
	Philosopher Maurice Merleau-Ponty believed that personal and private "words being spoken" become public "institutionalized words" after they are born. In the process of "institutionalization," words are created that are used to mean something common among several people. We usually communicate with others by using "institutionalized language. However, at the time a word is first produced, it is not institutionalized. Reference: Maurice Merleau-Ponty, "Phenomenology of Language," translated by Shizuo Takiura/Yoshiro Takeuchi, edited and translated by Gen Kida, Misuzu Shobo, 2002.

I've lived here.
[pIntEn Translation completed up to chapter 6#61f30bdeaff09e0000135fe4]
