2019 Musashino City Endowed Lecture "IT and Rules Now and in the Future"
Seikei University 2019-11-14 Lecture
 Student shared page: [/mkk/9. Nov 14 IT changes cause changes in the rules of work].
 January Draft [DRAFT: Changes in the Rules of Work Caused by IT Changes].
 Completed lecture material [Changes in the rules of work caused by advances in information technology].

--- September memo below

	Use Keynote for presentations.
		Recording at hand with presentation recordings.
		It would be good to take a picture of the presentation scene with Osmo Action
	Put presentation materials on Scrapbox in advance, one slide and one image per slide.
		People who can only listen to audio, such as part-time receptionists, can also participate.
	Announcement at the beginning:
		Speakers' speeches are transcribed and later published on Scrapbox.
		So there is no need for you all to work hard at recording what was spoken. The recording equipment will do that for you.
		On the other hand, only you yourself can record what you think and question after listening to the talk.
		Record your thoughts, whether in Scrapbox or in a paper notebook!
		After the presentation, if you have time, search the Scrapbox for "questions" and answer them, so you can write your questions in the Scrapbox.

	After the presentation, have the participants write questions in Scrapbox at [1 minute thinking time].
		Create a "question" zone at the end of the presentation and write questions there during the one-minute period.
		In the meantime, I copy and paste the questions from my presentation into it.
			If you do it in split screen, you don't need to switch screens.

--- main story

	[Population Structure]
		Population is shrinking and time is running short.
	[Wako Model]
		Instead of treating a large number of people uniformly.
		Adapt to individual people

	[Equality]
		People have personalities.
		Diversity.
		Is it a good thing to ignore that and treat them uniformly?


Need to come up with a report assignment for students.
	Find one physical constraint and one policy constraint?
	Find someone's "must" or "should be" statement.
		rule
		Find what is a policy constraint
		Consider how to take action to loosen that constraint.

Notes on [nishio.icon
	[Imitation, Creation and Intellectual Property]
	[HPC and Society]
	[Privacy and Monetization]
	[Cryptocurrency and Blockchain]
	[AI creations and intellectual property rights].
	[The Future of the Body]
