Three-week review
Notes on playing a game called [NishioGames
	[RoboMasterS1 assembly is completed.
	A meta look back at the video editing process
		Assembled and photographed for about 3 hours on the night of 8/23
		I bought Premiere Pro on the evening of 26.
		Three weeks since the final video of the assembly section was uploaded today, 9/14.
			You mean one week per hour of original video.
	It seems to me that taking a long video slows you down because of the "where do I split it up" problem.
		And we can't shoot the outro until we split it up and finalize the content.
		A shorter shot might be more efficient.
		If you put up two videos a week, that means each original video is 30 minutes long.
		I'd prefer a pipeline that takes one pomodoro of the main story and an intro-outro together.

[https://gyazo.com/ada2099113ea4c329e1dede75c762151]
[https://gyazo.com/0bc140cc4ddbdb3efb4138a2a5bde911]
	40% from external sources, 17% from search
		Surprisingly large number of searches
	9% of impressions are recommendations within YouTube
		As this increases, the "segment that reads a lot of YouTube videos" is watching their own content one after another.
		I want to increase
[https://gyazo.com/8f2de2494a71a0ff1433148f92361002]
	I don't know why some segments are not showing impressions figures.
	Browse Features is a segment of the channel's post-subscription page and a bunch of other stuff.
		When you subscribe, you'll see a list of recent videos on the app's home screen, or something like that.
	Right now, I'm making 40% on External.
		Most of them are my Facebook and Twitter posts, so they don't contribute much to the increase in subscriber base.
		We need to create a situation where we can consistently earn IMPRESSIONS with YouTube Search.
	The game's clear condition is "1,000 Subscribers," although the View is a prominent indicator, so attention tends to focus on that.
		Currently 29 people, so progress is about 3%.
		Acquisition of new users is important
			But to do so, we need to increase our exposure on YouTube.
			This is a black box.
	The next tuning point would be the impression click-through rate.
		[https://gyazo.com/9cba9917fdec188b57ed866d9131e058]
		The choice of title and the way the thumbnails are made make a clear difference.
		Getting impressions is meaningless if they are not viewed.
		[The phenomenon of not seeing the chassis version.]
			3, 4, and 5 are all low across the board for assembled videos with a "category + number + content" structure.
			Even if there is a manga that looks interesting at a manga cafe, if there are only three volumes, I won't read it.
		However, as for assembly videos 3, 4, and 5, they are inherently bad.
			To begin with, it is "the 3rd~5th of a 3 hour video divided into 7 pieces".
			Not independent content as a stand-alone video
			Increasing click-through with thumbnails does not lead to customer happiness.
			I prefer it when people see "Let's open the package" and say, "Let's watch the next video."
			I checked and the end screen for episode 3 didn't specify episode 4, probably because there was time left before it was released.

	In the beginning, the number of videos was small, so we were fixed and linked to each other, but as the number of videos increased, we stopped.
		For example, people who started watching this channel with "I played with it", which has the most views.
			It's pointless if you get "played" on the end screen of another video.
		If it is a continuation, it MUST specify the next video
		Still, there are two slots left, and until now I've been tuning this one.
			Trust YouTube's algorithm to change to "recommend the best video for the user".
			The other should be "latest video".
				As the number of videos increases, the system concentrates search inflow access to the latest videos.

	Increased search inflow
 	Thinking about voice input search, open difficult-to-type strings to kana.
 		>RoboMaster S1: https://amzn.to/2ZlPHsF

	What we would like to target in the future
		Submission as in the game
		1: Increased click-through rate: now 7.1
		2: Improvement of impressions via recommendations: 9% now 1.6K
		3: Improve search impressions: aim to increase actual number by 677 (6.2%) in the next 3 weeks.
		If we narrow the range to the most recent 1w.
			Click-through: 4.6
			Recommendation impressions: 9.1
			Search impressions: 14.2
		Only the click-throughs are getting worse.
			[https://gyazo.com/09f50626442b39ba8b67a7e1c33cb02b]
			The "I've played with it" and "I'm going to open it" that were over 10% in the 3W are down considerably.
			In other words, videos, to begin with, "have a high click-through rate when they are first published, and then it goes down."
			Click-throughs in a short period of time are strongly influenced by the timing of the most recent video release and that video, so you probably shouldn't worry too much about it.
			Would it be better if it were limited to search impressions only?
				Theoretically, yes, but we don't have a large enough sample size for the statistics to make sense at present.
