Young Scientists in Information Science 2019
Cancelled by typhoon

-----
Dates: October 12 (Sat.) - 14 (Mon., holiday)
Venue: Karuizawa Training Center (5607 Oaza Nagakura (Ohinata), Karuizawa-cho, Kitasaku-gun, Nagano)
http://www.kato-karuizawa.jp/

http://wakate.org/about/

-----
Speaker:.
Senior Researcher, Cybozu Labs, Inc.

Profile:.
In 2002, he participated in a programming symposium for the first time, and was invited to join the Young Scientists' Group of Information Science from 2005 to 2012. He completed his master's degree in Management of Technology at Tokyo Institute of Technology from 2011-2014 as a working graduate student. Since Cybozu is positive about parallel work, he has served as a board member of Mito, a general incorporated association, since 2015 and as a specified associate professor at Tokyo Institute of Technology since 2018. his book "The Intellectual Production Techniques of Engineers" released in August 2018 ranked 7th in the Junkudo main store's ranking including general books.

Title:.
A Decade of Nishio and Intellectual Productivity

Overview: (in Japanese only)
I was asked to give a lecture this time, and I was very eager to cooperate with the group. By the way, I doubt that 90 minutes of one-sidedly explaining the contents of my book, "The Intellectual Production of Engineers," would really be of value to everyone, since such contents are equally viable in the presence of an unspecified number of people, and the contents of the book have already been written in the book and published. I don't think we can make effective use of the special nature of the "Young Scientists' Group for Information Science". Therefore, I decided to accept questions electronically in advance and in real time during the presentation. If you can verbalize what you want to ask, it will be a fruitful meeting. I will talk about what has happened since Nishio was a member of the Young Scientists' Group, and then I will answer the questions.

Question Submission Site
https://app.sli.do/event/l7gm0xkw/live/questions
If it is difficult to enter the URL, use "http://sli.do" and enter "wakate2019" in the event code field.


---
	[NISHIO Hirokazu http://nhiro.org/face.html]
		Photos from 2008
		[IT Study Groups Gather at Open Source Conference | Nikkei xTECH (Cross Tech) https://tech.nikkeibp.co.jp/it/article/NEWS/20081006/316182/]

	rock, paper, scissors
		>Python's Rock-Paper-Scissors Agent Development Story
  > I'd like to write a Ruby-obsessed story, but Python dominated in the introduction of the development story. He started with a normal implementation of Python and tried to run it (in order), but then he took on the reckless challenge of "making it a one-liner," and finally succeeded. The audience laughed out loud.
  > The resulting giant one-liner projection of less than 2000 characters had the audience laughing out loud. I wonder if they would go this far .......
  > Because of this, we were unable to make any changes, improvements, tune-ups, or even debugging on the day of the event, which is a result that cannot be described without tears.
  [LL Ring : Lightweight Language Ring Spectator Report https://magazine.rubyist.net/articles/0016/0016-LLRingReport.html]

2006 Meeting of Young Scientists in Information Science
	>Implementation of Visualization Engine by Declaration of Physical Laws Yasukazu Nishio (The University of Tokyo)
 >The presentation focused on the beta version of GRINEdit, a graph visualization software that allows users to describe layout methods by declarations, and its future direction. The discussion included issues that arise when visualizing the graph structure in various applications such as speech recognition and mindmap, as well as the UI and usage of GRINEdit.
 	[Report of the 39th Meeting of Young Scientists in Information Science | Young Scientists in Information Science https://wakate.org/2006/09/19/39threport/]
	[Difficult programming language - Wikipedia https://ja.wikipedia.org/wiki/%E9%9B%A3%E8%A7%A3%E3%83%97%E3%83%AD%E3%82%B0%E3%83%A9%E3%83%9F%E3%83%B3%E3%82 %B0%E8%A8%80%E8%AA%9E]
		[KEMURI (Programming language) - Wikipedia https://ja.wikipedia.org/wiki/KEMURI_(%E3%83%97%E3%83%AD%E3%82%B0%E3%83%A9%E3%83%9F%E3%83%B3%E3%82%B0 E8%A8%80%E8%AA%9E)]
		[KEMURI - Obinata☆ https://earth2001y.hatenablog.com/entry/20060919/p1]
			I've left the maintenance of my own blog in a messy state, so what I wrote back then is still in the 404.
		[Grass the grass-planting programming language http://www.blue.sky.or.jp/grass/]
			>2006-09-17: Proposed at 39th IPSJ Jouho-Kagaku Wakate no Kai.



	[Don't take your ideas with a grain of salt - how to get people from all over the world to help you - https://www.slideshare.net/nishio/ss-12725054]
		Talking about the crowdsourcing experience you should have.
	["Even if the remuneration was zero, I was doing double work" - Why Yasukazu Nishio did not quit Cybozu Labs and started working as a technical advisor for machine learning | Cybozu Style https://cybozushiki.cybozu.co.jp/articles/m001358.html]
		A story about learning from the parallel work experience.

	[CodeXP https://www.codexp.org/]
		When I first created the domain, it turned into a porn site.

	[Jython Programming http://nhiro.org/jybook/]
		Struggled to test sample code when version was updated while writing.
			→ "The Technology Behind Coding" wrote a batch test script.
		Within a year of its release, a new version of the book was released and it became an "old book".
			→Next time I'll write a book that won't be obsolete for five years! I've decided to write a book that won't be obsolete for five years!
