Dominion Magic
In Dominion play, some players often use deal shuffling, purporting to "mix it up well".
　In other words, they are allowed to change the type of shuffling depending on the situation.
I've also never heard of any stipulation as to whether the cards you put on the field or the cards in your hand that you didn't put on the field go into the discard pile first.

Then, if we include this in the decision-making process in the game and apply optimization, we should be able to achieve higher performance than a player who does not make such decisions.

The average number of turns to buy 4 coins is 17 when using the big money strategy (buying only coins without buying actions), so we use this as a baseline for the case without shuffle control.
If you shuffle control, you can buy 4 copies of the genus state in 12 turns.
　Buy Sequence: silver-gold-gold-gold-gold-gold metal genus genus genus
　We have explored all patterns of deal shuffling for 3 and 4 piles, but any method is possible as long as the "first dealt pile is picked up first" is satisfied.
　　Initially, I intended to control the order of the deck by changing the shuffling method depending on the situation, but I found that I could beat the baseline even with the more stringent "fixed shuffling method regardless of the situation"

Other Consideration Notes
　Turn 1 and 2 purchases are 6 cards away by rule, so a 3-pile deal shuffle can stack them.
　　On the other hand, if both cards are action cards, etc., they can be divided in a 4-pile deal.

To avoid any discussion about ethics, I've made a demonstration video as a variant of card magic using playing cards, using Dominion cards.
　[Dominion Magic: 7 turns to buy a province]

----
Initial Placement: Yaya Yaya Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper
Shuffle is a 4-pile shuffle
T1: draw copper copper shop, play copper copper copper, buy silver, put shop copper copper copper
T2: draw yaya copper copper copper, silver changes but don't buy put yaya copper copper copper
T3: draw copper copper silver copper, play copper copper silver copper, buy gold, put copper copper copper silver copper
T4: draw house copper shop copper shop, play nothing 0 gold, buy copper, put house copper shop copper shop
T5: draw copper copper silver gold bronze, genus state can buy

-----
8 genus states in 25 turns without buying an action card.

I haven't purchased anything early in the process, but are you sure you want to do this?
Ya Ya Ya Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper
(3, (1, 0, 2))
Copper Copper Shop Copper, play copper, buy $, put copper Copper Copper Shop Copper
copper shop copper shop, play copper copper, buy $, put copper copper shop copper shop
copper copper copper shop copper, play copper copper copper, buy silver, put copper copper copper shop copper
shop copper shop copper copper, play copper copper copper, buy $, put shop copper copper copper
copper shop copper copper, play copper copper copper, buy silver, put copper copper copper shop
shop copper silver copper copper, play silver copper, buy silver, put copper shop copper silver copper
copper silver copper shop copper, play copper copper silver, buy silver, put copper copper silver copper shop
copper silver silver silver copper, play copper silver silver copper, buy gold, put copper silver silver copper
shop copper copper, play copper, buy $, put copper copper shop copper
copper copper silver gold gold silver silver, play silver gold silver copper, buy genus, put silver gold silver copper
silver copper silver shop copper, play copper silver copper silver, buy gold, put shop copper silver copper silver
Silver Copper Copper Gold Copper, play Copper Copper Gold Silver Copper, buy Attributes, put Copper Copper Gold Silver Copper
copper copper shop copper silver, play silver copper, buy silver, put silver copper copper shop
shop copper silver gold silver, play gold copper silver, buy gold, put silver shop gold copper silver
genus shop copper silver copper, play , buy $, put silver shop genus copper copper
silver silver copper gold gold gold, play copper gold gold silver, buy genus, put silver copper gold gold silver
copper silver metal silver, play gold copper silver silver, buy genus, put genus gold copper silver silver
shop copper copper copper, play copper copper copper, buy $, put shop copper copper copper
copper silver gold gold silver copper, play silver copper gold silver, buy genus, put silver copper gold silver copper
copper shop copper shop silver, play , buy $, put copper copper shop silver shop
genus gold silver silver copper silver, play silver gold silver copper, buy genus, put silver gold silver copper
copper shop copper genus gold, play gold copper copper, buy silver, put gold copper copper shop genus
genus genus genus genus copper, play , buy $, put genus genus genus copper
gold shop copper silver silver, play copper silver gold silver, buy genus, put copper silver gold silver shop
shop gold copper silver silver silver, play gold silver silver copper, buy genus, put gold silver silver copper shop

I found a 22-turn pattern when I forced him to buy gold at T3.

Ya Ya Ya Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper Copper
(3, (0, 1, 2))
copper copper copper shop copper, play copper copper copper copper, buy silver, put copper copper copper shop
copper shop copper shop, play copper copper copper, buy silver, put copper copper copper shop
copper silver silver copper silver shop, play silver silver copper copper, buy gold, put silver silver silver copper copper shop
copper copper copper shop copper, play copper copper copper, buy silver, put copper copper copper shop
shop copper copper silver copper, play silver copper copper copper, buy silver, put silver copper copper copper shop
gold copper copper copper silver, play silver copper gold copper copper, buy genus, put silver copper gold copper copper
shop copper shop silver gold, play silver gold copper, buy gold, put shop silver gold copper
genus copper silver silver copper silver, play silver copper silver copper, buy gold, put genus silver silver silver silver copper
copper silver copper shop, play copper copper silver, buy silver, put copper copper silver copper shop
copper silver silver silver copper gold, play silver gold silver copper, buy genus, put silver gold silver copper
silver-gold-copper-copper-silver, play copper-gold-silver-copper-silver, buy genus, put copper-gold-silver-copper-silver
copper, play gold, buy silver, put shop, copper, gold, copper, gold, copper shop
copper silver copper shop genus, play , buy $, put genus silver copper copper shop
silver silver genus, play silver, buy $, put silver silver genus
copper shop copper copper, play , buy $, put copper copper copper shop
silver gold shop silver gold, play silver gold gold, buy genus, put shop silver silver gold
copper-gold-silver-gold, play gold-copper, buy $, put silver-copper-gold
silver silver copper gold, play gold silver copper silver, buy genus, put gold silver copper silver
shop copper, play , buy copper, put shop copper
silver gold silver shop copper, play silver silver copper gold, buy genus, put silver silver silver copper gold shop
genus silver copper gold silver, play silver copper gold silver, buy genus, put silver copper gold silver
yaya silver gold gold, play silver gold gold, buy attribute, put silver gold yaya

23T
copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper
(3, (0, 2, 1))
shop copper copper copper shop, play copper copper copper, buy silver, put copper copper copper shop
copper copper copper copper, play copper copper copper copper, buy silver, put shop copper copper copper copper
copper silver silver copper silver copper, play silver silver copper copper, buy gold, put copper silver silver copper copper
copper shop copper shop, play copper, buy $, put copper copper shop copper
shop copper shop copper silver, play copper silver copper, buy silver, put copper silver copper shop
gold store copper copper silver copper, play silver copper gold, buy gold, put silver copper gold copper store
copper copper copper gold, play copper copper copper gold, buy genus, put copper copper copper gold
copper and silver shop copper shop, play copper and silver, buy silver, put shop copper shop copper shop copper silver
silver copper silver silver shop copper, play copper silver silver copper, buy gold, put copper silver silver copper shop
silver gold store silver copper, play silver silver copper gold, buy genus, put silver silver silver copper gold store
genus silver silver silver copper, play , buy $, put copper genus silver silver silver shop
gold gold copper copper copper, play gold copper copper gold, buy genus, put gold copper copper gold
shop copper copper gold, play copper copper gold, buy genus, put shop copper copper gold
Silver Copper Copper, play Silver Copper, buy Silver, put Copper Copper Silver Copper
genus silver shop silver copper, play , buy $, put silver copper genus silver shop
copper house gold and silver, play copper gold and silver, buy gold, put house copper gold and silver
gold store silver silver copper, play copper gold silver silver, buy genus, put copper gold silver silver store
silver metal copper gold, play silver gold gold, buy genus, put copper genus silver gold gold
Copper genus Copper metal, play , buy $, put Copper genus Copper metal
silver gensya copper silver, play silver copper, buy silver, put gensya silver silver copper
copper copper shop silver genus, play silver, buy $, put silver shop genus copper copper
gold copper silver silver metal, play copper silver gold, buy genus, put copper silver silver metal
genus silver silver copper gold, play copper gold silver silver, buy genus, put copper gold silver silver genus

The consideration that the big money strategy is an average of 17 turns to purchase 4 genus states is circulating, so the conditions are aligned.
13 turns to purchase 4 Genju
A situation where gold coins can always be bought after T5.
copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper
(4, (0, 1, 2, 3))
T1 house copper copper shop copper(3), play copper copper copper, buy silver, put house copper copper copper copper
T2 copper copper copper copper(4), play copper copper copper copper, buy silver, put shop copper copper copper copper copper
T3 copper copper silver copper copper(6), play copper copper silver copper copper, buy gold, put copper copper silver copper copper
T4 house copper/silver/yacopper(4), play silver/copper, buy silver, put house copper/silver/yacopper
T5 house copper copper copper gold(6), play copper copper copper gold, buy gold, put house copper copper copper gold
T6 house copper copper silver silver(6), play silver copper copper silver, buy gold, put house silver copper copper silver
T7 copper copper shop silver silver silver (6), play copper silver silver copper, buy gold, put copper silver silver copper shop
T8 copper-gold-copper-gold shop(8), play gold-gold, buy gold, put gold-gold-copper-gold shop-copper
T9 copper gold copper silver shop (7), play gold silver copper, buy gold, put gold silver copper shop copper
T10 copper shop gold gold copper (8), play copper gold copper gold, buy genus, put copper gold copper gold shop
T11 gilt copper-gold shop (8), play gold copper-gold, buy attributes, put gold copper-gold shop
T12 copper silver shop gold silver(8), play silver copper silver gold, buy genus, put silver copper silver gold shop
T13 copper copper gold gold silver gold(10), play gold gold silver, buy genus, put copper copper gold gold silver

Giving up buying gold coins in T7 to buy 4 genus states in T12.
copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper, copper
(3, (0, 2, 1))
t1 shop copper copper copper shop(3), play copper copper copper, buy silver, put copper copper copper shop
T2 copper copper copper copper(4), play copper copper copper copper, buy silver, put shop copper copper copper copper
T3 copper silver silver copper(7), play copper silver silver copper, buy gold, put copper silver silver copper
T4 copper shop copper shop(3), play copper copper copper, buy silver, put copper copper shop
T5 house copper copper silver silver(6), play copper copper copper silver silver, buy gold, put house copper copper copper silver silver
T6 gold shop copper copper silver(7), play copper copper silver gold, buy gold, put copper copper silver gold shop
T7 house copper-copper-silver(5), play silver-copper, buy silver, put house copper-copper-silver-copper
T8 gold copper gold shop copper(8), play gold copper copper, buy gold, put shop gold copper copper
T9 silver-copper-gold-gold-copper-silver(9), play copper-silver-gold, buy genus, put copper-copper-silver-silver-gold
T10 house gold silver genus gold gold(8), play gold silver gold, buy genus, put gold silver gold store genus
T11 copper silver gold copper copper(8), play silver gold copper copper, buy metals, put silver gold copper copper
T12 gold copper copper silver copper(8), play silver gold copper copper, buy metals, put silver gold copper copper

I can buy a genus state in T8 but I'm buying gold coins. Why can't I buy a province?
→I can't buy the genus in T11, so it looks like I'll have to delay it to T12 after all.

Limit the pattern to silver-silver-gold-gold-gold-gold-gold-gold-gold-gold-gold-gold-gold-gold-gold-gold-gold metal genus genus genus
The deal_pattern is
code::
 Counter({(3, (0, 1, 2)): 4142,
          (3, (0, 2, 1)): 9154,
          (4, (0, 3, 2, 1)): 2090,
          (4, (0, 2, 3, 1)): 1450,
          (4, (0, 1, 2, 3)): 636,
          (4, (0, 2, 1, 3)): 374})
So, if you want to do a deal shuffle and pick up the first pile dealt, any shuffle can be accomplished.
Either initial placement is fine.
>Counter({'yaya yaya copper copper copper copper copper copper copper': 10362, 'copper copper copper copper copper copper copper copper copper copper copper copper copper': 7484})

The first move is also rather unimportant.
code::
 In [349]: Counter(g.log[0] for g in gg3)
 Out[349]: 
 Counter({'copper copper copper shop copper(4), play copper copper copper, buy silver, put shop copper copper copper': 2500,.
          'copper copper copper shop copper(4), play copper copper copper, buy silver, put copper copper shop copper copper copper': 464,.
          'copper copper shop copper(4), play copper copper copper, buy silver, put copper copper copper shop': 264,,
          'copper copper copper shop copper(4), play copper copper copper, buy silver, put copper copper copper shop copper': 460})
The reason for this is that if you buy silver coins at T1 and T2, the rules say that 6 silver coins will leave
Because a 3-pile shuffle would surely overlap with pile 0.
Conversely, when playing to buy two action cards, you must avoid shuffling three piles, or you will certainly get action coverage.

put house copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper copper
code::
 In [352]: Counter(g.log[1] for g in gg4)
 Out[352]: Counter({'copper shop copper shop(3), play copper copper, buy silver, put copper copper shop': 2500})
 
 In [353]: Counter(g.log[2] for g in gg4)
 Out[353]: 
 Counter({'copper-silver-copper-silver-silver shop(6), play silver-copper-silver-copper, buy gold, put silver-copper-silver-copper shop': 994,.
          'copper silver copper silver shop (6), play silver copper copper silver, buy gold, put silver copper copper silver shop': 1290,.
          'copper silver copper silver shop(6), play copper silver copper silver, buy gold, put copper silver copper silver shop': 216})
 
 In [354]: gg5 = [g for g in gg4 if "put silver copper copper silver shop" in g.log[2]]
 
 In [355]: len(gg5)
 Out[355]: 1290
 
 In [356]: Counter(g.log[3] for g in gg5)
 Out[356]: Counter({'copper copper shop copper(3), play copper copper, buy silver, put copper copper shop': 1290})
 
 In [357]: Counter(g.log[4] for g in gg5)
 Out[357]: Counter({'copper copper copper silver copper(6), play silver copper copper copper, buy gold, put silver copper copper copper': 1290})
 
 In [358]: Counter(g.log[5] for g in gg5)
 Out[358]: Counter({'gold shop copper silver silver(8), play copper gold silver, buy gold, put copper gold silver shop silver': 1290})
 
 In [359]: Counter(g.log[6] for g in gg5)
 Out[359]: Counter({'shop copper shop copper silver(4), play silver copper, buy silver, put silver copper shop copper shop': 1290})
 
 In [360]: Counter(g.log[7] for g in gg5)
 Out[360]: Counter({'gold copper gold shop copper(8), play gold gold copper, buy gold, put copper shop gold copper': 1290})
 
 In [361]: Counter(g.log[8] for g in gg5)
 Out[361]: 
 Counter({'copper silver silver silver gold copper(9), play silver gold silver copper, buy attribute, put silver gold silver silver copper copper': 600,.
          'copper-silver-silver-gold-copper(9), play copper-silver-gold, buy Attribute, put copper-copper-silver-gold': 460,.
          'copper-silver-silver-gold-copper(9), play silver-copper-silver-gold, buy attribute, put silver-copper-silver-gold': 200,.
          'copper-silver-silver-gold-copper(9), play silver-gold-copper-silver, buy attribute, put silver-gold-copper-copper-silver': 30})
All of these are dumped so that the second or fifth gold coin comes in.

From here on, the road diverges at once.
Just buy the genus, the rules fix where to put the genus, and the other coins would generally be anywhere.

