KJ method for video
Review your own videos on YouTube after the fact and consider what groups are available.

	Let's put the RoboMaster S1 together and I'll show you how it's done."
 	I shot it and it's 3 hours long, I can't publish this as it is, so I need a short head start video.
 		[I played with RoboMaster S1!]
 	[RoboMasterS1 assembly]
	I need a programming example to put in the description, "I can also program."
		[RoboMaster S1 spinning at high speed!]
	The speed is limited to slow by default, when you unlock it, it's fast, I want to show you this.
		[RoboMaster S1]
		I was rushing it and it broke.
			I want them to know it's okay to break down.
				[RoboMaster S1 broke.]
	As I was tinkering with it, I noticed that the gimbal is dynamically controlled.
		[Check out the gimbal movement on the RoboMaster S1!]
	What I noticed after reviewing the video in the [RoboMasterS1 Assembly] section.
		We were debating something like, "Are two cables connecting the gimbal to the chassis enough?"
		You have not explained what you mean by the task of "setting up an armor address."
		→ What I am explaining in the video is wrong.
			Since it is CAN-BUS, the same signal actually flows through all cables.
			There's a lot of misunderstanding here, and it needs to be explained.
			[What happens when you run the left and right cables of S1 interchangeably?]
			[Quiz! What happens if you pull the cable out of S1's neck?]
	I want others to experience RoboMaster.
		There was a cultural festival, so I took it with me.
		[RoboMaster S1 solo race operation description]
		[Cybozu Nihonbashi office, running RoboMaster S1].
		I thought that if they actually touched it, the first priority would be to have them simply play with it as a remote-controlled robot rather than to explain the rules of solo racing.
			The competition was now a one-shot competition, with the winner taking the time to come around the circle and hit the target at the finish line.
	It would be cool to start RoboMaster in the dark.
		[RoboMaster S1 activated in the dark!]
		It would be interesting to see the afterimage left behind when you run it.
			[RoboMasterS1 dark driving video].
				I'd like to explain how I made this one, because it's also interesting.
				Explaining the operation of a PC screen is also a challenge in itself.
					[How to make afterimage mashimashii video].
					Commentary Video Series

	Dichroic prism interesting.
		[I experimented a lot with dichroic prisms!]
			I'm interested in doing the science experiment series.
			Especially the light experiment is beautiful.
			There are similar elements to running RoboMaster in the dark.
			[Growing Fermat Spiral colored like a rainbow] has similar elements.
			I bought a [black light].
				Interesting to light up a lot of things.
				But I'm not happy with the results.
				Waiting for arrival of [UV bandpass filter

	Homebrew Bodoge Series
		I've been envisioning this YouTube channel since I created it to showcase my homebrew bodge play.
		It's also an experiment, a video where someone other than myself appears.
		[I tried playing against each other in a home-made bodge game! (Commentary)]
			I made a cut version because I talked too much commentary and it was too long before the actual play started.
			[I played against him in a homemade bodge game!]
		[Level2 game against a time limit].
  	I experimented with putting a time limit on it, but it was a slap in the face.
		The acrylic board was too poor for video capture, so I made a prototype on paper.
			[How to make your own card game prototype]
				But the hard sleeve is still reflective, so I ended up using only paper.
		It's hard to explain that while doing something that uses your head.
			→[I solved the puzzle while explaining my thinking!]

	time-lapse photography
		The hotel we stayed at had a nice view, so I thought I'd take a shot.
		It was fun and I'm trying different things.

	dominion
		Mr. Tachikawa, who played with me in my homebrew video on Bodoge, recently got into Dominion, so we played it.
		Deal Shuffle doesn't introduce randomness, so I wondered if controlling the order of the discards would allow me to control the cards I draw from the deck in the future. It got interesting when I came up with the idea.
 		Removing the constraint of versus and adding the constraint that the shuffle is always the same deal shuffle.
 		[Dominion Magic: 7 turns to buy a province]
 		I've already found a pathway to buy 4 genus states in 12 turns, so I'll eventually make an introductory video.
		I thought the ability to remember the cards in the deck was important.
			I tried a method to train my abilities and found it surprisingly easy to increase my abilities, so I introduced it to you.
			[Guess the last of the 13 cards! How to memorize cards]

	[How to explain with video].
		The group implicitly "tries to explain" because they are thinking, "I'll explain," "How can I explain it better?"