6週間振り返り
10/3 in 3 weeks since [3 week review

Written on 9/30
	Running a YouTube channel, currently my brain thinks of it as a game similar to Factorio (yeah).
	Currently, the game is to reach 1,000 channel subscribers.
	The number of subscribers went through the roof in the beginning and then slowed down. This is because there was a segment of "people who found out I started YouTubing and registered for that reason alone," and I had used up that segment.
	In order to increase the number of registrants, it is necessary to reach a different audience.
	This means, inevitably, that we should not be eager for "inflows from Facebook".
	Compared to the third week, impressions via search have increased 2.5 times and impressions via recommendations have increased 3 times, and the recent situation is that an increase in subscribers roughly proportional to the number of video submissions has begun to occur.
		This is what I chose as the third week, saying "this would be the right KPI".
	So, what are the important indicators other than Analytics in advancing this policy?
		It is a throughput of video releases
		If you turn a 3 minute video into a 10 minute video, the editing cost increases faster than O(n) and costs 4 times as much, but the number of subscribers probably does not quadruple, at most it is 1.1 times.
			Dots and surfaces, now is the phase where you should put up surfaces with many videos instead of making one high quality video.
		So the play is to emphasize "smaller batch sizes, compressed work-in-process inventory, and speedy release. In other words, it's Theory of Constraints and Factorio.
	Winterized with only 1 more registrant in 12 days between 9/9 and 9/20
		Past that, the past week has been "100% more subscribers the day we release multiple videos."
		The coefficient between the number of videos published and the number of subscribers is still less than 1, but it is beginning to grow linearly.
		If we continue to build on the current linear growth, we should switch to exponential growth at some point, and although the timing of that switch is unknown, I am beginning to think that it may not be as far away as we think.

10/3
	[https://gyazo.com/ccd5a746c256c4a880cca37244dc1184]
	Impressions approximately tripled

[https://gyazo.com/ed75990e7d96c5d6fd8e071800a032b1]

	>old 40% from external sources, 17% from search
 	45% from external sources, 17% from search
			[https://gyazo.com/13a9fbc1e9016724f69bbf781444693a]
			You're getting more and more via Twitter.
 >old 9% of impressions are recommendations within YouTube
		Percentage of total impressions decreased to 7.3%.
		144 to 386, so the actual number has doubled.
	The decision to have Most Recent on the end screen has worked beneficially.
		[https://gyazo.com/14560fedbc6a6d25ca631407f067e4e7]

	impression click-through rate
		[https://gyazo.com/637826e7a847a78a018f962f6a68a0b8]
		I don't see much clear improvement.
		It has been observed that the click-through rate is decreasing progressively with time since publication
		In fact, it is meaningless as statistical information unless you can provide the "click-through rate in the first week after the video's release" for each video.
		There is value in looking on the wrong side.
			[https://gyazo.com/9dcdadd6c9344f8a5339218ced983249]

View rises moderately
	[https://gyazo.com/2f6bc13ddaceab6a2b9d25c7749ab3c3]

Goals set 3 weeks ago
	1: Increased click-through rate: 7.1% → 4.4
	2: Increased impressions via recommendations: 9% of 1.6K
	3: Improve search impressions: aim to increase actual number by 677 (6.2%) in the next 3 weeks.
実績
	1: Increased click-through rate: 7.1
	2: Increased impressions via recommendations: 9% (144) of 1.6K → 7.3% (386) of 5.3K, almost double
	3: Improvement of search impressions: 677→2217, about 3 times
		[https://gyazo.com/54d1a1297b8c3af30a87bc29f560ca76]
	We want to improve non-search inflows within YouTube.
		Channel Pages、Browse Featureもおよそ3倍
		Suggested Videoは6倍
		Inflows from playlists and playlist pages have increased considerably in percentage terms
			I wasn't taking advantage of the playlist at the three-week mark.

Audience had been stagnant for a long time, but began to grow.
	[https://gyazo.com/b22699b049929b09082c842fcff7608c]
	I stopped using the standard line, "If you enjoyed it, please give us a high rating and subscribe to our channel."
		Please only subscribe to our channel.
		We tried to convey the benefits of subscribing to the channel.
			I plan to upload a sequel, so subscribe if you're interested."
		Maybe it would be better to explain explicitly how to subscribe to a channel, since many people don't seem to know how to do that.
