Cybozu is interesting.
It was interesting that we were talking about "interesting" a year ago, as I had been feeling that it would be beneficial to delve into the feeling of "[interesting]" through articles I wrote in 2018 and through the "[KJ method of "interesting"]" to date in 2019.

[2018-10-04 Facebook https://www.facebook.com/nishiohirokazu/posts/10216482764198168]
	I was approached today for a position that is probably pretty good from a social standpoint.
		I said, "If you can't do [parallel work] with Cybozu, you can't.
		They said, "[Cybozu] is it really that interesting?"
		I've been thinking about it for a while and I think it's still cybozu [interesting].
 It's hard to explain what's so interesting.
 Mr. Aono is the president, so he's easy to spot, but he's not the only one like that.
 	There are five or ten people who are smart like that and have interesting ideas that are not so much confined to existing frameworks.
 	We are discussing the various issues that come up in the operation of a publicly traded company on a daily basis with our heads in the sand.
 	That's open to employees.
 	This and the content are rather interesting, but that doesn't seem to be all.
	It's interesting to see the ongoing destruction of stereotypes about what work is, what work is, and what a company is, and I'd like to see it up close.
	Oh, and in that sense, when they say "parallel work is not allowed," it's hard to expect that organization to change the way they work, so it doesn't look attractive.
		Inability to accept parallel work -> confirmed as "uninteresting" organization
	Hirotaka Yoshioka I guess this is a case of people who have experienced the benefits of parallel work not being able to return. Interesting.
		I feel uncomfortable with that expression as well. It's hard to explain.
	People outside only see "things that have been released outside in the form of something catchy and talked about," but these are all in the past. People inside see the present, when new things are being created, and the expectations for the future that will be created. It is like that.