Properly subjective
2019-10-15
[Facebook https://www.facebook.com/nishiohirokazu/posts/10219482942200743]
	It is interesting that the words "[not properly subjective]" and "[false objectivity]" have emerged in discussions with [Tomoya Tachikawa], based on the baseline of "separating [fact and interpretation]" and "separating [subjectivity and objectivity].
	If you take a step back and observe, this is, in essence, "When you divide something into subjective and objective, there is a bias to think that the objective is the right one, the better one, but in some situations, the subjective is right or better.
	For example, when you're trying to decide what temperature to set for the air conditioning in your office.
		It's a good process to start with a subjective statement, "I'm cold," or "I'm hot," and work out what to do from there.
		Bad process to do "25 degrees is the most productive according to the Whataburger Association."
	Think of some situations where such a thing would be necessary.
		It is unfortunate to judge something like a career, for example, which is greatly influenced by personal subjectivity (what you like, etc.) with a "false objectivity".
		When you are trying to create something new, if you include a "false objective" in your working hypothesis, it becomes a poison that withers the subjective.
		The third is the above pattern.
			Since this is a "resolution of a situation in which several people have differing subjectivities," bringing in a false objective will only serve to suppress the differing people.

	It's strange how they are born in a flash, days after the actual discussion. I guess I kept processing it through unconsciousness.
	The term "false objective" refers to something like, for example, "according to the Whataburger Association."
		He poses as seemingly objective by not talking about his own subjectivity.
		But sometimes they are just bringing statements from others that match what they subjectively want to argue.
		The idea behind this is that the subjective is inferior to the objective.
		That is why he pretends to be objective without speaking of his subjectivity.
		And in response to this, you say, "Let's get it right, let's be subjective" instead of doing that.
	In turn, after a while of talking about the need to be properly subjective, the term was born in the form of "~ is, after all, a false objectivity".

	I think there was a study that said something like, "Rather than building a rocket with LEGO bricks alone, if two people share the role of building the rocket, the percentage of correct answers when asked later what kind of blocks they had was higher."
		Maybe this one [Referential Communication and Category Acquisition].

	It was dropped from my perception (maybe because it is natural for me), but according to Tachikawa's perception
		Mr. Tachikawa.
			Try the KJ method.
			Tried to separate sticky notes by gender axis or something, and was told by Nishio, "That's not the case.
			Create groups according to subjective "might be related" feelings
			This shift in thinking is shocking.
		After a while, after having had the experience of
			If that is the case, why not use the KJ method for "interesting things" that are subjective to begin with? I realize that it is.
			Try it and you'll find this is unexpectedly beneficial.
		This was the process.

	You're "[objectifying]" the [subjective].
		[Objectification of the mind].
		By writing down an opinion, it becomes an object (object) that can be manipulated, detached from the subject who holds that opinion.

	[Jun Harada]: Interesting.
		I have a feeling that the public's use of subjective/objective is quite loose, and that what people have different opinions about = subjective, and what everyone can [tacitly] agree on = objective.
  The temperature of a room that should be there cannot be implicitly agreed upon, so it is subjective.
  The temperature on a thermometer is one fact, but if the opinions of those who interpret it vary, that temperature is subjective. Or maybe the thermometer is broken.
  If everyone can agree that it's hot today, yes, that's objective. However, it is not necessarily true. If you were on the phone in Hokkaido and Okinawa in the middle of summer, two people accepting "it's hot" referring to two different facts, and for the most part, "it's hot" is going to be accepted as objective.

	[Kohei Okubo]:.
	 When I first started playing werewolf, all I did was give [overhead] opinions, and my seniors told me to be more subjective.
		When science people start to play werewolf, they usually start by saying [their overarching viewpoint], but that leaves out a lot of data.
		Objectives and abstractions are similar in some ways, and they are approximately correct, but there are many differences when you look at the details.
			If you stick to a low [resolution] "objective" in a situation where that "detail" is important, you lose data.
		[nishio.icon] Interesting that you connected to the [cognitive resolution] story.

[properly subjective].
