Personal Information and Monetization
[2019 Musashino City Endowed Lecture "IT and Rules Now and in the Future"]
[Personal Information] and [Monetization] [Yasuhiro Ota].
[/mkk/4. Oct 10, Personal Information and Monetization].

Submarines and railroads can't determine at market prices how much is appropriate when a country procures them.
	→Decide by accumulating the cost

monetize
	Originally meant "issuance of currency," "method of turning resources into gold," etc.
	How to make money from free services" is a Japanese-English usage.

	A new [business model] "[subscription]" has emerged.
		Some people say things like, "What I've learned in business school so far is useless."
		But the principles have not changed.
		Applicable conditions have changed.
　　Better to learn the principles first, then how conditions have changed.
　　Conditions will continue to change.

	general principle
		Business Model for Product Sales
		Business Models for Advertising

	[Product sales model]
		Exchange of goods and services for value
		Issue:
 		How do we find sellers/buyers?
 		How do we check and promote quality?

[https://gyazo.com/7ea358b12ffb317a3a9d5f415697a114]
	[Information asymmetry].
		Not good for a difficult translation.
		One knows and the other doesn't."
		Can a stranger be a sucker?
			The unknowing side knows that they don't know.
			take precautions
			hinder the smoothness of business transactions
		[REVERSE SELECTION]
			It attracts different people than you want to attract.
		Used Cars ([Lemon Market])
			Previous owner has information.

[Reducing information asymmetry] is big business.
	The [asymmetry reduction business] is lucrative.
		[nishio.icon]Groupware may also reduce information asymmetry within the company!
			[Groupware reduces internal information asymmetry.]
	One example is advertising

radioactive contamination
	Although the technical cost is low
	High reputational costs
		The cost of making people believe they are safe is higher than the cost of making them safe.
	Majority of the 21 trillion yen cost

advertising model
	physical matching
		near
			→Location is important.
	Online Matching
		search (e.g. for someone using a search engine)
			→SEO is important

[Hub-and-spoke system]
	Fedex Fred Smith Ideas
	Designs that place [mediators] in logistics
	Referring to the settlement of bills.

[platform is mediator].
	[platform] is [mediator].
	A model that creates a place for information to gather and takes a matching fee
		[nishio.icon]I'm creating a kind of "[location]" for myself.

Jeff Bezos, Securities & Investments employee
	Products chosen to create Amazon
	　Low quality uncertainty
　Small and expensive (low percentage of price of transported volume)
　Lots of variety (searchable online stores are more advantageous than physical stores)
	Examples: CDs, etc.

[Counterparty Risk]
	[Counterparty risk - Wikipedia https://ja.wikipedia.org/wiki/%E3%82%AB%E3%82%A6%E3%83%B3%E3%82%BF%E3%83%BC%E3%83%91%E3%83%BC%E3%83%86%E3% 82%A3%E3%83%AA%E3%82%B9%E3%82%AF]

	[Escrow]
	[Comebei's appraisal service].
		[Assessment on line [just take a picture and send it to us]｜KOMEHYO for brand-name goods, jewelry, and watches http://komehyo.jp/kaitori/line/]

Data Monetization
	credit limit
	advertisement

Banks
	Payment Services
	Information on the movement of money can be found
	How can we make use of this information?
	→Financing.

There used to be incidents of bank employees copying passbooks and selling them to registrars.
	Compliance is strict now.
	Cannot sell information for money.
	The "use the information yourself" line.
		The same principle applies to accounts receivable.

[Economy of scope]
	Lower costs of doing disparate businesses together.

Purchase behavior information → alcohol and tobacco purchases → health risks → insurance

If uncertainty is reduced too much, insurance and financing will not be established.

[Market] and [Organization]
	[https://gyazo.com/41405976da24211c26372a400b7dbcdd]
 The market is the sea and the organization is the land.
	The state in which they are all organized is [communism].
		[Planned Economy]
	It's not efficient (?) when it's all in the market.
		Why？
		[Kyocera's [Amoeba Organization] is an approach that does not treat the entire company as one organization, but rather markets smaller units of organization.

planned economy
	Gather all the information and try to make a plan.
	But it is not practical to collect and analyze all the information
		Implicit assumption: because human information-processing capacity is poor
	Difficult to gather local information
		[Hayek] "[Knowledge of specific circumstances of time and place]" difficult to communicate.
		"There's a need in this place at this moment, so if you open a store, you'll make money!" Something like that.
			In a planned economy, it takes too long for that information to get to the command center and for action to come down, and the timing is missed.

	question
		Planned economies have gone awry due to poor human communication skills.
		The development of information technology has enhanced information transfer.
		Would a planned economy be advantageous?
	[nishio.icon]
		I'm not sure about the national level, but I have skin in the game that it's the other way around at the corporate level.
		At Cybozu, where groupware is used to communicate information all over the place
			Movement to "abolish the manager position" rather than strengthen the supervisor's command and control.
				["Don't you need another manager?" We asked the Development Division, which abolished managers, about salary evaluation and transfer mechanisms | Cybozu Style https://cybozushiki.cybozu.co.jp/articles/m005359.html]
				[Cybozu's development headquarters tried to eliminate managers "If you can't do it without them, just make them again" | Cybozu Style https://cybozushiki.cybozu.co.jp/articles/m005343.html]
		As described in [The Teal Organization], the pyramid hierarchy is being dismantled in various companies.
		Why is this?
		Because the bottleneck is not "human information transmission capacity" but "human information processing capacity."
			[https://gyazo.com/8d82de47ee02dc6e0e53d6e28668dd65]
			In an era when means of information transmission were poor, humans were the medium of information transmission.
				The hierarchy is deeper because of the poor ability of humans to communicate information.
				Deeper hierarchies resulted in greater delays.
			Technology such as groupware (and [radio] and television) has made information transfer more efficient.
				In that era, it's easy for a large number of employees to receive the president's thoughts.
				Receiving the president's real voice on a daily basis has facilitated the sharing of vision.
			One hundred employees can hear the voice of one president, but one president cannot hear the voice of one hundred employees.
			 [https://gyazo.com/8d244c287e29e32269b83074162de7fb]
     Notifications bring [information flood].
				It may have been several times more efficient than in the days when information was communicated by voice or paper,
				The volume of information circulating within the company has increased by two to three orders of magnitude as all employees disseminate information.
				Current technology is not yet in a position to handle this.
		How organizations change when decision makers' ability to process information is the bottleneck
			Delegate decision-making
				Process information without centralizing it
				Made possible by sharing the vision and the information needed for decision-making in advance
				Groupware has eliminated information asymmetry between management and employees.
					Facilitating Transactions."
					No labor-management conflict
		summary
			The reason why the planned economy did not work is not because of "human information transmission capacity" but "human information processing capacity"
			Information technology has enhanced the ability to communicate information, but not so much the ability to process it.
			As a result, authority will be transferred to avoid localization of the burden of information processing
			This trend will be reversed when decision-making itself is done by computers.
				That's still a long way off.

division of labor
	Fixed costs to variable costs
		[nishio.icon]Skin feeling that doesn't really fit in the context of parallel work.
			Increase uptime by car sharing cars that are not working while parked in front of the company.
			The "increased occupancy" aspect of the car owner's position that
			The "fixed cost to variable cost" position is on the side of those who use car sharing without owning a car.
			Working in between childcare, for example, is certainly an improvement in utilization, but it doesn't feel right.
