Typhoon Hoax
[https://gyazo.com/cba7158a8c24a8a2bfa99f0e6576db0a]

	Many of us have experienced "A because the teacher says A" and "we give each other our opinions and then we all decide which one to choose."
	Each person's situation" is different with regard to disaster preparedness.
		Therefore, it is necessary to decide on the "action to be taken" by each of them based on their respective situations.
	In other words, communication that leads to improvement of "function f that takes a situation as an argument and returns an action" is beneficial.
	Decision-making process that "I make the decisions, the exchange of knowledge is beneficial but not collegial."
	If you are unfamiliar with this type of decision-making process, you will try to take the second type of process.
		"There is one right answer, and we choose it based on our wisdom."
		The result is a [false two-party] argument about whether X is OK or not, ignoring the situation
	Today's "anyone can disseminate information through social networking sites.
		It adds "an incentive to get more attention if you're the opposite of the majority opinion."
		It will accelerate confusion by flooding social networking sites with "X is good" and "X is not good" opinions.
	I thought that this is the composition of people who would be bothered by posts on social networking sites saying, "You shouldn't put curing tape on window panes! I thought that this is the composition of people who are worried about "Which is it after all?
	These phenomena are familiar to programmers.
		"Is language X better or language Y better?"
		Do you want library A or library B?"
		"Do you prefer implementation policy C or D?"
	The choice of means is influenced by the current situation and what you want to do with it.
		Ignoring that, the "good or bad" argument is futile.
	When people are anxious, they want to be given the right answer.
	This kind of phenomenon has often been observed among novice programmers who are unsure and insecure in their choice of technical methods, but with an unprecedented disaster looming, the number of "insecure people" increased at once, and so it occurred among the general public.
	I think I have something in my Scrapbox that might lead to this.
	It seems to be related to the idea that simply copying the successful methods of other companies will not work, because the current situation of other companies and your company are different to begin with.

I already put it together.
	[The goodness of the means is affected by the present situation and the ends.]
