HPC and Society
[2019 Musashino City Endowed Lecture "IT and Rules Now and in the Future"]
[/mkk/3. Oct. 3 High Performance Computing and Society──High Performance Computing will bring about a society where people's awareness and laws cannot keep up!] [Takeshi Nishikawa]
[HPC] and Society

	Meteorological Services Law

	Fishing weights
		Iron is lighter than lead, so it does not sink as easily
		Sinkable shape with HPC
		But there are no lead restrictions on fishing weights.

2014
	Cannot be used for medical treatment when medical simulations are run on a supercomputer.
		Because medical device certification is required, including supercomputer hardware
	2017
		[Act for Partial Revision of the Pharmaceutical Affairs Law, etc. https://www.mhlw.go.jp/stf/seisakunitsuite/bunya/0000045726.html]
		>A stand-alone program used for diagnosis, etc., shall be subject to manufacturing and marketing approval/certification, etc., as a medical device.

When a municipality does a disaster simulation and even discloses information about surrounding municipalities, that municipality will be angry with you for not going the extra mile.

JMA supercomputer
 2018-05-16
 	>Hitachi, Ltd... (JMA) is pleased to announce that it has built a new supercomputer system for the Japan Meteorological Agency.... and will begin operations on June 5.
 	>... The XC50 model, the latest model in the Cray XC series from Cray Inc. of the U.S., was selected as the supercomputer that plays a central role in the system, and its total theory calculation performance is approximately 21 times higher than that of the previous system, realizing improved accuracy in numerical forecasts.
 		[News release: May 16, 2018: Hitachi http://www.hitachi.co.jp/New/cnews/month/2018/05/0516.html]
 2019-02-05
 	>Meteorological Service's Cray supercomputer down for 3.5 hours, power supply-related work performed during the same period.
 	>The shutdown was of a Cray XC50, manufactured by Cray (U.S.A.) and delivered by Hitachi, Ltd. which the JMA had just started operating in June 2018.
 		[Japan Meteorological Agency's Cray supercomputer down for 3.5 hours, power-related work performed during same period | Nikkei xTECH (Cross Tech) https://tech.nikkeibp.co.jp/atcl/nxt/news/18/04053/]
	Global simulation with 20 km grid
	Switching typhoon forecasts from 2019-05-31

[Weta Digital - Wikipedia https://en.wikipedia.org/wiki/Weta_Digital]
	Company that did VFX for Lord of the Rings, etc.
	Advantage of being located in New Zealand so that the US and Europe can work during the night due to the time difference.

Credit card fraud detection
	Director Takasu was stopped when he charged Pokémon GO with a card that normally settles tens of millions of dollars.
		[Director Takasu's Black Card was stopped!　Reason is "suspicious activity" - grape [grape] https://grapee.jp/242457]
	Mr. Nishikawa.
		I moved from Tokyo to Okinawa to Sapporo in one day and was stopped.

NEC Facial Recognition NeoFace

MNIST⇔Automatic ZIP code recognition

System to detect Fake Face, 10 times more computationally expensive than system to create Face

Driving a car with reinforcement learning -> I learned "if you don't move, you won't crash".

Increasing the rate of earthquake resistance will reduce damage, but buildings are personal property, and the government should pay for them or not.