Communal and intersubjectivity
	[communality] = [intersubjectivity] = [agreement] # intersubjectivity
	[language skills] = [fact sharing] # information sharing # verbalization
https://twitter.com/tokoroten/status/1185026151778902017?s=20 [Shinta Nakayama]

	With the end of the era in which the existence of objective truth was secured by God, a debate arose as to whether "[objectivity] can exist," and the concept of intersubjectivity was born as a replacement for objectivity.
		Why does this have to do with the communal skills?
		Objectivity is based on the idea of deciding "what is right" by an external authority (e.g., God, a book written by a great man in the modern age, etc.), while intersubjectivity is based on the idea of constructing "what is right" (what is considered right) by bringing subjective opinions of the parties concerned and reconciling them with each other.
		The difference between the attitude of "you're wrong, because this is what the textbook says" and "you think so, but I think so, can we compromise?" The difference between the attitude of "You think so, but I think so, can we compromise?
		I feel that the attitude of listening to others and creating intersubjectivity, rather than relying on an outside authority to cut off communication, shows a high level of communication skills.
[Facebook https://www.facebook.com/nishiohirokazu/posts/10219544145050776]

	When we used to discuss the boundaries between fact and interpretation, objective and subjective in the lab.
		(In response to the blatantly ridiculous definition that "something that is clearly recognizable to the five senses is objective," he tsked, "No, we're arguing about whether the color of the dress is blue or white.")
		　[dress color issue]
		We were talking about how the distinction between objective and subjective is not important in practical interests, and that even if it is subjective, if there is agreement, it can be treated as objective, but that was "intersubjective".
	In a situation where we are fighting over subjectivities that don't mesh, the useful thought pattern of "let's talk based on objective facts rather than subjective interpretations" is not that it matters whether they are subjective or objective, but that we should "put aside the subjectivities that are causing discrepancies and look for more agreeable subjectivities to build a common ground". Let's put aside the subjectivity that is causing discrepancies and look for more agreeable subjectivities to build a common ground.
	There is no such thing as a "truly correct objectivity," and a "shared subjectivity" is created through the rubbing of subjectivities among the parties involved, which should be used as a "provisional objectivity" as we proceed. Is this the change from "objective" to "intersubjective"?
[Facebook https://www.facebook.com/nishiohirokazu/posts/10219544449058376]

relevance
	[Factual and action-oriented]
