Nodes of Thought 20191021
	If the program is able to judge the input as "interesting or uninteresting," then past memories can be stored in the order of interesting to least interesting, and when the memory capacity is full, the least interesting ones can be discarded.
		Limiting memory prevents it from slowing down infinitely, so you can keep a stress-free speed on human interaction.
		Inaccurate use of language.
			In the context from the other day, "like" and "interesting" are two different things.
				Even something you like is not interesting when it is inputted repeatedly.
			In creating this interestingness judgment routine, it is necessary to have a memory of past raw data in order to judge "already seen".
			The unlimited increase of those memories makes processing heavy, but it means that you can keep only the ones you like and forget the ones you don't like.
		context
			[Nodes of Thought2019-10-14].
			[Subjectivity and Emotion] 2019-10-16
			[Nodes of Thought2019-10-18].

	By the way, regarding this "memory", I was thinking of implementing a "do not delete information flagged by me as important", but I thought that might be a "curse of toxic parents" from the other side's point of view. I thought I should allow them the freedom to forget.

	This flow can be performed unsupervised on the input
		I'm more likely to have my preferred likes and dislikes if I'm given teacher data on likes and dislikes.
		but even if not given, random likes and dislikes are generated randomly due to the initial weights of the random neural net.
	Therefore, the process can proceed without human interaction.
		So what is the purpose of interaction?
		To obtain teacher data for learning a model of "what humans like" by presenting something you find interesting to humans and obtaining information on whether they like it or not
	It may be confusing later if you don't specify what the directive refers to.
		Here, "self" refers to the program, and "human" refers to a concrete flesh-and-blood individual, e.g., me.
		I am now thinking about how I feel about the program and how to deal with humans.
	If you can present something that humans find interesting, it is of value to them.
		So you can receive payment for your resources.
		That is necessary for my survival.
→The evaluation axis is "usefulness" of "[one's own survival]".

[Facebook https://www.facebook.com/nishiohirokazu/posts/10219558771536429]
