Machine Generated Scrapbox
Work and thought notes for 2019-10-28

	Scrapbox's philosophy that machine generation of content is a garbage dump.
		[trashed].
	In fact, I've poured over Twitter logs and other information in the past and feel that it wasn't good enough.
		[/nishio-twitter]
		[/nishio-twitter-2]
		[/nishio-twitter-3]
		[/test-hatena]
	On the other hand, I'm looking at [/masui]'s [put book scanned PDFs in Scrapbox] approach and think
		Sufficient in fulfilling the "read from front to back" function of paper books.
		I think this is the first step to get a better [form of knowledge representation] than a paper book.
	in other words
		Machine generation and automatic import are not evil.
		After machine generation and automatic import, additional man-hours are needed to make it an organic network
			The knowledge of what to do with these additional man-hours and how much activity to do is still unclear.
			So if a "person unfamiliar with Scrapbox" mechanically creates a page, the subsequent learning curve is too steep and frustrating.
	Need to verbalize what it takes to make knowledge into an organic network
		Now that we've exceeded 5,000 human-powered pages, we should try "machine-generated content" again.
	On the other hand, I'm worried that we're destroying the fun by pouring machine-generated content into this project.
		There should be another project.
		I made it.
			[/nishio-a] Project to import everything available to the public in Nishio
				[nishio-a]
			[/nishio-z] Project to import everything, including the unpublishable in Nishio
	Merging is required
		What happens when additional JSON is imported into an existing project with duplicate titles?
		They think it will be overridden.
			→In that case, you will not be able to import for fear of destroying existing project content
		Merged?
			This makes me feel safe.
		If the current Scrapbox specification is to overwrite rather than merge, then you need to merge on hand and then import the overwrite.
		Confirmed: overwritten
			>Ready to import 2 pages. 2 pages will be overwritten: test, How to use Scrapbox

	work memo
		[Put book scanned PDFs in Scrapbox].
