The Future of the Body
[/mkk/7. October 31, The Future of the Body: How Human Augmentation Technology Will Change Our Mind-Body Relationship and Connection to Society].
[Human extension]

[https://gyazo.com/9adfa3a63d3758a318618e5322b6201b]

	China will be a national leader.
	America is capitalist and corporate-driven.
	Europe is the third pole
		humanity
		I can't imagine a society without AI, but I also question the way China is doing it.
		How do we translate HUMANITY into systems and institutions?

	The UN's [SDGs].
		[Low birthrate and aging population] is not in the theme.
		Important in Japan ⇔ Not yet an issue in the world
		Advanced issue countries Japan
			The "people of the world will figure it out. You can't take the "incorporate that" approach.

	Cyborg 009
		diversity

	jump off a high place
		→ Fracture
		Human beings have limits.
		Working out doesn't always get you power.

	Humans can fly with technology.
		[https://www.youtube.com/watch?v=yt0E-AkoM9U]
		1984
		Airplanes are not free.
		It takes 1 million to fly for 15 seconds.

	Environment and Capability
		Reinventing the square wheel
			Round wheels optimized for flat ground
			The square wheel has an advantage on the catenary
			[https://www.youtube.com/watch?v=FlvjWpWu99A]
		Brokerage wholesalers optimized for Tsukiji, unable to connoisseur on Toyosu
			[Toyosu's lighting does not show tuna, changing the way it is seen and affecting connoisseurs: Jiji.com https://www.jiji.com/jc/v2?id=2018toyosunews_25]
			[https://gyazo.com/5bfaccda00dab931c81c86ccd1b1b654]

	[definition of competence changes as the environment changes].
		the Industrial Revolution
		>Throughout history, technology has changed the way people feel about their bodies. When technological innovations brought about structural changes in society and the economy, such as the agricultural and industrial revolutions, those who could not work in the respective industries or use the new tools were defined as "handicapped.
			[To What Extent Can Technology "Expand" Human Capabilities -- Superhuman Sports Inami and Former Athlete Tamesue Talk (5/5) - ITmedia Enterprise https://www.itmedia.co.jp/ enterprise/articles/1806/28/news029_5.html]
	Ultima Online
		For the deaf, the game world, where they could only communicate by text, was a "world without barriers.
			http://www.hmx-12.net/~virgil7/UO/ppl.htm#equalworld
		I'm just not good at communicating through atmospheric vibrations.
		No barriers to text-based communication
			Related: Groupware also text-based communication

	Senior + VR
		Jomon cedar (Cryptomeria japonica)
			I can't go see it because of my legs, but I can go see it in VR.
			360-degree camera images
		farsightedness
			Ability to adjust focus deteriorates.
			VR has a fixed focus at 1.5m -> even with presbyopia
		VR Goggles
			A system that makes nearby objects appear larger and farther away
			Same mechanism as reading glasses

	Kendama in slow motion
		progress
			It is important to have a moderate mix of failure and success.
			Related: shio teaches touch typing "slowly with 100% success"

	urbanization
	Capability is an interaction between people and people, and between people and their environment # Capability is an interaction between people and their environment
		If a wheelchair that can stagger up and down stairs is invented, even a station full of stairs will be barrier-free.
	Atsushi Iriki
		>The authors used Japanese macaques to demonstrate that somatosensory and visual bimodal >neuronal activity involved in hand movements is extended by tool use in response to the tool's >function. [src https://www.jst.go.jp/pr/announce/19990513/report-chi.html]
		The brain recognizes the end of a rake as a hand.
	corporeality
		sense of ownership
			Always available
		sense of ownership of one's action
		self-position

 Sarah (1998) Time-delayed feedback experiment on tickling
 	Increasing time delay tickles.
 		Because the sense of "I did it" is lost
 		5G low latency = no loss of feeling that you did it.

 cursor camouflage
		Only he knows his own cursor.
		Cryptography uses computational asymmetry, this uses cognitive asymmetry
		I don't even know what I'm doing when I put in the time delay.

	Rubber Hand Experiment
		Transfer of ownership
		Try on or test drive: you'll feel like you own it.
			It's not just the [simple contact effect].

	A game where even if you're not very good at it, you can still play God.
		Edit Agency
		Even if a machine assists, I can feel like I did it.
		Automated ⇔ [Flexible].
			Automate what you don't want to do
			I don't like it when things I want to do are done automatically.
			Good to have the freedom to do what you want to do.

	Cyborg
		outer space
		cyber space
		We are not yet able to operate in outer space, but cyberspace has become more accessible.
			[nishio.icon] I wonder if the participants could relate to the "familiarity".
		How to adapt to the information world and how to strengthen it informatively
			human augmentation engineering

	Traditional Learning Models
		Putting knowledge from society into your own head.
	→Flow-type learning model
		I'll keep you updated.

 Enhanced vision allows for fine work.
 	Robert Hook [Robert Hook - Wikipedia https://ja.wikipedia.org/wiki/%E3%83%AD%E3%83%90%E3%83%BC%E3%83%88%E3%83%BB%E3%83%95%E3%83%83%E3%82%AF]
 		Mcrographia(1665)
 		Recognized telescopes and microscopes as tools of sensory expansion to compensate for human shortcomings
 		As a result of sensory expansion, the cells found

	[Augumented Human]
		Gartner's Hype Curve was written at one time.

	rehabilitation
		I'm happy when I can do something I couldn't do.
		Decline = loss of ability to do things you used to be able to do.
			What was visible becomes invisible.

	sport
		Post-Industrial Revolution
			It used to be used for production in the physical industry.
			→Æ I could afford to use my body for fun on my days off.
			Rules were put in place by the employer to reduce injuries and other problems.
				If you get hurt, it's a loss to the company.
			Lindbergh's Atlantic Crossing
				>The Orteig Prize was awarded to the first Allied aviator to fly non-stop from New York City to Paris and vice versa, and was offered by New York hotelier Raymond Orteig. The prize was $25,000. Many aviators tried, but in May 1927, Charles Lindbergh of the United States won the prize for his non-stop flight across the country from New York to Paris.
				[Ortigue Award - Wikipedia https://ja.wikipedia.org/wiki/%E3%82%AA%E3%83%AB%E3%83%86%E3%82%A3%E3%83%BC%E3%82%B0%E8%B3%9E]
		Kendo has no weight regulations.
			The use of tools absorbs differences in body size.
		[science = objective = other people].
			It's only when you experience it for yourself that it becomes your own thing.
		I'm not good at sports."
			= "I'm not good at existing sports."
			Just make a new one.
