AI creations and intellectual property rights
[2019 Musashino City Endowed Lecture "IT and Rules Now and in the Future"]
[AI creations] and [intellectual property rights]: [/mkk/6. Oct 24 AI creations and intellectual property rights].

Jurisprudence does not progress.
	18th Century "Science Advances."
	More than 2000 years of legal studies
	Using Roman thinking for current issues and phenomena
	Intellectual Property Law
		Newcomers with "only" 150 years of history

	Big Data [A Wonderful New World].
		[A Wonderful New World - Wikipedia https://ja.wikipedia.org/wiki/%E3%81%99%E3%81%B0%E3%82%89%E3%81%97%E3%81%84%E6%96%B0%E4%B8%96%E7%95%8C]
		I thought you might like a beer. I can deliver from the nearest liquor store."
		Business made possible by holding data

	If each person's utility function is clear, they can take it to the edge of their ability to pay.

	What are the rights to copyrighted works uploaded to Google services?
		[Google Terms of Service - Policies and Terms - Google https://policies.google.com/terms?hl=ja]
		>Some of the Services allow users to upload, provide, store, transmit, or receive content. Users continue to retain any intellectual property rights they may have to that content. In other words, what belongs to the user remains the user's property.
  > When you upload, provide, store, transmit, or receive Content on the Services, you grant Google (and third parties working with Google) a worldwide license to use, host, store, reproduce, modify, create derivative works of (for example, translate, transform, or create derivative works resulting from changes Google makes to your Content to make it work better on the Services), (publicly) transmit, publish, perform, screen, (publicly) display and distribute such Content, (public) transmission, publication, performance, showing, (public) display, and distribution. The rights granted to you under this license are limited to the operation, promotion, and improvement of the Service, and the development of new services. This license shall remain in effect even if you stop using the Services (e.g., business listings you have added to Google Maps). Some of the Services may provide a way for you to access and delete content that you have provided to that Service. In addition, some of the Services may have provisions or settings that reduce the extent of Google's use of Content provided to that Service. Please make sure that you have the rights necessary to grant Google this license for any content you provide to the Service.

	Facebook and Amazon have similar strategies to collect data thoroughly
		They have a different collection method than Google.
			In 2006 or so, Google was expected to be the sole winner, but it didn't happen.
		Facebook: Grab information on people's connections
			I'd trust a close friend's story over a search result.
		Amazon: Capturing Information on Purchasing Behavior
			Know what you are actually buying, not how you say it with your mouth.
			I know information that I wouldn't share with others (like purchasing adult content).

	[advertising model]: [two-sided market].
		Same as the commercial model.
		Google has a monopoly on basic resources (=data) for the new era
			⇔China: "We will not hand over our country's resources."
	Zenrin Residential Maps
		You can't beat an OS-level monopoly..."

Google's prospects of dominating the entire world have diminished.
	Rise of Facebook and Amazon
	China's Great Firewall Policy
Who would you rather see your data, China or Google?

European Commission (executive of the EU)
	>The European Union's European Commission on July 18 ordered Google, a subsidiary of U.S.-based Alphabet, to pay a fine of 4.34 billion euros (about 570 billion yen). The Commission found that Google abused its dominant position under EU competition law (antitrust law) by demanding that its search, browsing, and app store software be "bundled" with mobile devices that use its Android operating system (OS).
		[European Commission fines Google a huge sum over "tying" and its impact on Japanese companies - BUSINESS LAWYERS https://business.bengo4.com/articles/454]
	EU Strategy Against Google
		antitrust law
		personal data
			[GDPR]

	Apple and Microsoft
		Strategies that do not take data
	Launching a similar service to Google Maps no longer attracts users.
		Lost to competition.
		→ Go the route of not taking personal data
			Adversarial Competitive Strategies
   	MS "don't take data, don't use it for advertising" appeal.
   		You don't want Google reading your work email, do you?"
	   		It has a [nishio.icon][FUD]-ness to it.
   	Apple Pay "does not store transaction history"

	Incidentally, GAFAM is next in line.
		[Berkshire Hathaway - Wikipedia https://ja.wikipedia.org/wiki/%E3%83%90%E3%83%BC%E3%82%AF%E3%82%B7%E3%83%A3%E3%83%BC%E3%83%BB%E3%83%8F%E3% 82%B5%E3%82%A6%E3%82%A7%E3%82%A4]
		Tencent (Taiwan)
		Alibaba

	Supercomputer 20 years ago, now carried around as a smartphone.
		Human Genome Project Clinton Administration $1 trillion 10-year cooperation to make it happen
		Now 30,000 yen, can be done in 3 hours.

	change of mindset
		Reproduction of brain contents → difficult
		→Conversion -> Outward reaction is all that matters.

	Email Analysis
		Survey of all company mail servers

	facial recognition (the act of)
		Caught shoplifting two years ago at a concert venue.

	What are rights?
		I won't let you do anything you don't want to.
		Applying the discussion of rights developed for tangible objects to intangible objects

The world as a whole is said to have a tangible:intangible ratio of 2:8.
	On the other hand, in Japan, the ratio is 5:5
		Focus is on making things.
		slow to develop

AI can imitate humans, though it doesn't know what's inside.
	Legal Theory, "Are There Any Similar Cases?"
	[Selfie monkie
		[Monkey selfie copyright dispute - Wikipedia https://en.wikipedia.org/wiki/Monkey_selfie_copyright_dispute]
		[Monkey selfie - Wikipedia https://ja.wikipedia.org/wiki/%E3%82%B5%E3%83%AB%E3%81%AE%E8%87%AA%E6%92%AE%E3%82%8A]
	What if the photographer gave the monkey a camera and let him take it?
		Monkey=Mono
		Photographs were taken using objects, monkeys are tools -> copyrighted by the photographer
	A monkey took the camera away from the photographer.
		Photographer has no intention of writing → Photographer has no copyright
		not a chance
	[duality of people and things].
		Objects are subject to rights
		Objects are not the subject of rights.
	Naruto v. Slater Litigation
		Animal rights group sues photographer
		District Court, Court of Appeals "does not allow non-humans to be authors."
		→ Photographer Settles Out of Burden of Lawsuits

	AI Copyright
		We'll think it over carefully first."
		Representation of "not doing" in Kasumigaseki literature

	Who is the subject of the creation?
		Not the owner.
		People who used it
		Example: Cases where the owner and user of the camera are different
		Who just pushes buttons?
			Does the mere press of a button "creatively express a thought or emotion"?
			You can't say that with the push of a button, can you?
	Technological advances change the perception of how much behavior is "creative".
		The required standard changes in order to be considered "creative."
		PCR method
			In the early days, temperature control was manual, and just experimenting was hard work.
				→Papers that experimented and reported their results were evaluated as results.
			Now you push a button and the machine controls the temperature.
				→The degree of experimentation is not an achievement.
			The same thing could happen in other areas.
				Paralegal (assistant to an attorney)
					Twenty years ago, the number of paralegals in the U.S. dwindled.
						The development of telecommunications technology has made outsourcing to India possible.
						Indian paralegals were of inferior quality to American paralegals.
							But the salary level is 1/10
							Because of the time difference, work proceeds during the night.
					Human paralegals in India to be replaced by AI
						If AI becomes low cost, it will inevitably happen.
	Something that doesn't need to be creative in the first place.
		Driving does not have to be creative.

	Self-development of AI
		AI Learning from Experience
		AI that fought against Mr. Hanyu and became stronger.
			Economic Value.
			Whose economic value is it?
			Not a creation of Mr. Hanyu's.
		What is this value? Protected by what rights?
			Is it necessary to legislate new intellectual property rights? No need?
			[nishio.icon]'s thoughts
				Thinking separately about where AI is working
					When AI runs on the server side
						AI's trained models are not publicly available = not openly known
						So it fits the definition of a trade secret under the Unfair Competition Prevention Act.
							>Production methods, sales methods, and other technical or business information useful for business activities that are managed as secrets and are not publicly known.
						It's protected by current law without the need to create another right.
					When AI runs on the client side
						A trained model of AI is installed on the user's computer as part of the software
						In this case, would the information become public knowledge at the time of distribution and cannot be considered a trade secret?
						plan
							AI's trained model data cannot be used by itself, but always in combination with source code describing the model structure
							In other words, model data and model description code are inseparably one and the same, and it's not right to discuss the existence of rights in isolation.
							Hmmm, it just seems to me that this would make it unclear who owns the rights to the "mixed data" when the data is updated by client-side use!

	Who is responsible when a machine supporting a person causes a problem?
		Responsibility of the person who operated it?
		Is it the responsibility of the people who designed it?
			product liability law
				>The purpose of this Act is to protect victims by providing for liability for damages of manufacturers, etc. in cases where a defect in a product causes damage to a person's life, body, or property, and thereby to contribute to the stabilization and improvement of the lives of citizens and the sound development of the national economy.
