Expose it to the public eye, even if it doesn't satisfy you.
The reason why a third-rate expert outperforms a first-rate amateur is because he will shamelessly expose his work to the public eye, even if it is not to his satisfaction."

Some people claim that it was written by [Katsushika Hokusai], but I think it was created in the novel "Dazzle" by Makate Asai, based on [Katsushika Oui], the daughter of Katsushika Hokusai. [Dazzle - Wikipedia https://ja.wikipedia.org/wiki/%E7%9C%A9]
A Google search as of 2019 did not find any articles that referred to "third-rate gentry" in connection with Katsushika Hokusai prior to 2014.

Blog quoting "Dazzle" from the March 2015 issue of Shosetsu Shincho: [Gnash your teeth and expose yourself to the world | Nakamura-do no Hibi | Nakamura-do Co. http://nakadoh.com/?p=1548]
>I would like to ask you to let me redraw it. I ask you."
> "I'm not going to let you do it," he said, clinging to his voice. But the father shakes his head.
> "That's not going to happen. I'll deliver it tomorrow."
> "But, but. If I deliver such a thing, it will be a disgrace to you, Oyaji.
> "That's not your concern.
> "The Japanese Hokusai is ruined!"
> "Yasuke," said the father in a stern voice, lifting his shoulders.
> "Then how many days do you think you have to do it? Do you think you can do it in three days, or thirty days, or three years?
> The voices became louder and louder, and Yasuke and the others nodded in unison.
> "Look, we're not playing around. This is our business. If you don't have the determination to figure out how to paint with the limited time you have ......, go back to being an amateur. It's much easier.
> Then the father looked around at everyone and turned to Oei.
> "But even a third-rate expert can beat a first-rate amateur. Do you know why? Because they are willing to put themselves to shame. Even if you are not satisfied with your work, you grit your teeth and expose it to the world. If you have time to regret what you have done, get on with the next job.
> Oei could hear himself gulping down his own throat.

Examples of associations with Hokusai Katsushika
[https://gyazo.com/febbcaced09331929702cfa98f6c42d9]
https://twitter.com/osakana_work/status/1190927813051731968/photo/3
