Andragogy.
[Andragogy - Wikipedia https://ja.wikipedia.org/wiki/%E3%82%A2%E3%83%B3%E3%83%89%E3%83%A9%E3%82%B4%E3%82%B8%E3%83%BC]
>Andragogy, originally used by the German educator [Alexander Kapp] in 1833, was developed by the American adult education theorist [Malcolm S. Knowles (April 24, 1913 - November 27, 1997) (April 24, 1913-November 27, 1997) as a major concept in [adult education]. Knowles is of the opinion that andragogy, conceived from the Greek word for "adult-education," should be strictly distinguished from pedagogy (pedagogy<, Greek for "child-education"), which refers to ordinary pedagogy.
> 
> Knowles' theory can be stated in four very simple requests.
	> Adults need to be directly involved in the planning and evaluation of what they learn (self-concept and motivation to learn).
	> (Experience (including failure) provides the foundation for learning activities (experience).
	> Adults are most interested in learning about topics that seem directly important to their professions and lives (readiness to learn).
	> Adult learning is problem-centered, not content-centered (orienting to learning).
> Knowles' writings, especially "Contemporary Practice in Adult Education - From Bedagogy to Andragogy" (originally published in 1975, Hou Shobo 2002), have been the subject of various debates. Some say that his proposed approach is already obvious to everyone, while others say that it is merely derivative and applied from existing child-centered theories. The term has also been used by those who say that due consideration should be given to the difference between self-directed and "teachable" education. However, as society becomes more responsive to the changing needs of the younger generation, the differences in educational methods are gradually becoming less and less pronounced between children and adults. Self-directed and self-supervised education is increasingly being used in primary education to encourage children to learn. Learning plans and e-portfolios are becoming important tools for adults to promote their own learning.
	[Contemporary Practices in Adult Education - From Bedagogy to Andragogy]

[CUMOT2019]
