Motivational Observation Memo 20191119
I heard someone say, "Don't try to motivate yourself, just make the task side interesting, and you'll be motivated." I thought, "That's interesting, I'll try that," and I worked on it, and it got done even though I didn't specifically change the task side, you know?

Is it important to be in a state of mind that is "interesting" regardless of the task?

Specific examples:.
	I left out a transfer I had to do.
	Check your email to make it interesting.
	I don't know where to transfer the money.
	be about to lose motivation
	I don't know where to transfer the money! and email me
	get a reply
	discard
	What's that? It's all taken care of.

consideration
	I don't feel motivated to "do the task."
	Neglect has faded his memory.
		Implicit task of "checking task status."
	In this state
		Think, "Let's make this task interesting."
		= Change your point of view
		By doing this, they unconsciously "check the status of the task" without feeling any obstacles!

Specific example 2: The
	Documents that were unmotivated by being told something they didn't understand.
	Check the current situation for now
	I still don't understand.
	I'm not sure! I'm going to write a chat about it.
	Provide explanations to questions asked.
	As I'm explaining, I realize that the parts I don't understand are not important.
	I'm going to put it out there and pretend I don't care.

Example 3: The
	The ones I hadn't yet ordered a transcription for.
	First, move the audio data to Dropbox.
	Place Order
	the end

Example 4: The
	I found something that had been transcribed but had not been shared with the people involved.
	Create a private group in Scrapbox
	stick
	Share via Facebook Messenger
	It didn't take long.

Example 5: The
	The ones that are still left.
 Equipment failure
 Cable needs repair.
 Go to repair site
 Not an option!
 →I got it.

Example 6: The
	Publication of lecture videos
	Let's just publish it unedited for now.
 First of all, I can't get the entire video onto my MacBook...
 Attempt to render directly from SD card
 	Display takes 2 hours to render
 Let's do it while you sleep at night.
