(Minor use, etc. incidental to information processing by computer and provision of the results thereof)
from [copyright restrictions].

> (Minor use, etc. incidental to information processing by computers and provision of the results thereof)
> Article 47-5 Any person who performs any of the following acts which contribute to the promotion of the use of works by creating new knowledge or information through information processing by means of a computer (...) (i) a person who provides or presents to the public (...) a work (...) (i) works for which the following acts have been carried out (...) (...) (1) A person who engages in any of the acts listed in the following items (...) may, to the extent deemed necessary for the purpose of the act listed in the respective items, use (...) a work (...) in connection with the act, regardless of which method is used. (1) The use (...) of a work (...) may be made incidental to the acts listed in the following items to the extent deemed necessary for the purpose of the acts listed in the respective items, regardless of the method used. However, in the event that a work is offered or presented to the public that infringes a copyright (...) However, this shall not apply to the case where the minor use is made knowing that the provision or presentation to the public of the work for public presentation infringes the copyright (...) or where the interests of the copyright holder are unreasonably impaired in light of the type and use of the work for public presentation and the manner of the minor use.
> > (i) by means of a computer, the information sought by the retrieval (...) (ii) to retrieve the title or the name of the author of a work in which the title or the name of the author, the source identification code pertaining to the retrieval information that has been made available for transmission (...) (ii) retrieving other information concerning the identification or whereabouts of the retrieved information, and providing the results of such retrieval.
> > (ii) perform computer analysis of information and provide the results of such analysis.
> (iii) In addition to what is listed in the preceding two items, acts of creating new knowledge or information and providing the results thereof through information processing by computers, which are specified by a Cabinet Order as contributing to the improvement of convenience in the lives of citizens.
> 2 Any person who prepares the acts listed in each item of the preceding paragraph (...) (2) A person who prepares for the acts listed in each item of the preceding paragraph (...) may reproduce or publicly transmit (...) or distribute by reproduction or public transmission (...) a work presented for public consumption, to the extent deemed necessary for the preparation of minor use under the same paragraph. (2) A person (...) may reproduce or publicly transmit (...) or distribute copies of publicly offered works to the extent that such reproduction or public transmission (...) is deemed necessary for the preparation of minor uses under the preceding paragraph. However, this shall not apply where the interests of the copyright holder would be unreasonably impaired in light of the type and intended use of the work presented for public consumption, the number of copies made or distributed, and the mode of reproduction, public transmission or distribution.


> (Minor use, etc. incidental to information processing by computers and provision of the results thereof)
> Article 47-5 Any person who performs any of the acts listed in the following items which contribute to the promotion of the use of works by creating new knowledge or information through information processing by means of a computer (including a person who performs part of said acts, but limited to a person who performs said acts in accordance with the standards specified by Cabinet Order) (i) A person who provides or presents (including making transmittable; hereinafter the same shall apply in this Article) to the public. The same shall apply hereinafter in this Article.) (hereinafter in this Article and paragraph (2), item (ii) of the following Article referred to as "[a work offered or presented to the public]"). (limited to works that have been published or made transmittable) (limited to those which are minor in light of the percentage of the portion of the work offered for public use, the quantity of the portion offered for use, the accuracy of the representation when offered for use, and other factors) in connection with the said acts, regardless of the method used, to the extent deemed necessary for the purpose of the acts listed in each of the said items. (limited to those which are minor in light of the percentage of the portion of the work presented for public use, the amount of the portion used, the accuracy of the representation when used, and other factors). Hereinafter referred to as "[minor use]" in this Article). (hereinafter in this Article referred to as "[Minor Use]"). However, in the case of making the Minor Exploitation while knowing that the offer or presentation to the public of a work for public offer or presentation infringes copyright (in the case of offer or presentation to the public made outside Japan, it would constitute copyright infringement if it had been made in Japan), or in the case of making the Minor Exploitation while knowing that the offer or presentation to the public of a work for public offer or presentation is infringing copyright (in the case of offer or presentation to the public made outside Japan, it would constitute copyright infringement if it had been made in Japan), the type and use of the work and the Minor Exploitation may be made. 
> > (i) information sought by retrieval (hereinafter in this item referred to as "[retrieval information]") by means of a computer (ii) to search for and provide the results of the title or the name of the author of the work in which the information (hereinafter in this item referred to as "[retrieval information]") is recorded, the transmission source identification code (meaning a character, number, symbol or other code to identify the transmission source of automatic public transmission) pertaining to the retrieval information that has been made available for transmission; and (iii) to retrieve other information concerning the identification or location of the retrieved information, and to provide the results of such retrieval.
> > (ii) perform computer analysis of information and provide the results of such analysis.
> (iii) In addition to what is listed in the preceding two items, acts of creating new knowledge or information and providing the results thereof through information processing by computers, which are specified by a Cabinet Order as contributing to the improvement of convenience in the lives of citizens.
> 2 Any person who prepares the acts listed in each item of the preceding paragraph (limited to those who collect, organize and provide information for the preparation of said acts in accordance with the standards specified by Cabinet Order) (2) A person who prepares for an act listed in each item of the preceding paragraph (limited to a person who collects, arranges and provides information for the preparation of said act in accordance with the standards specified by Cabinet Order) may reproduce or publicly transmit (in the case of automatic public transmission, including making transmittable) a work presented for public consumption to the extent deemed necessary for the preparation of minor use under the same paragraph. The same shall apply hereinafter in this paragraph and in paragraph (2), item (ii) of the following Article. (2) A person may reproduce or publicly transmit (including making transmittable in the case of automatic public transmission) or distribute a reproduction of a work for public use to the extent that such reproduction or public transmission is necessary for the preparation of the public use. However, this shall not apply where the interests of the copyright holder would be unjustly impaired in light of the type and intended use of the work presented for public transmission, the number of copies made or distributed, and the manner of said reproduction, public transmission or distribution.
