Thumb Shift Diary
	June 2018
		Try thumb shifting with [shio]'s recommendations.
		Unorganized log of first attempt: [Thumb Shift Diary 201806].
		Try Windows+DvorakJ, stop
 	[Thumb Shift with Ergodox]
 		Ergodox EZ + QMK implemented thumb shift farm
 		Made to behave like the Shift key.
	 	[shio] told me, "This is not a simultaneous push."
	 	It looked better to do it on a Mac, so I decided not to implement the simultaneous push.
	August 2018
		[Diary of Thumb Shift on Mac 201808].
		The structure of overlapping Lacaille and Karabiner-elements is engineeringly weird.
		Karabiner-elements alone can achieve thumb shift.
			But I'm not convinced by the sequence that was provided.
			It's hard for a space to be a line break.
		It's hard to mess with Karabiner's configuration files directly.
		I made a script to generate a configuration file.
			[generate_karabiner_conf]
		But for some reason, the success rate of inputting "ょ" is low. I don't know the cause. I lost my motivation.
	November 22, 2019
		Decide to move to thumb shift over the New Year's vacation.
		I had a medical checkup this time and my vision, which used to be 1.2, was now 0.8.
		Keep the monitor far away and the keyboard under the desk on your lap.
			I was thinking that if you're going to practice under-the-desk input anyway, rather than for the purpose of thumb shifting itself, you might as well take this opportunity to put it all together.
		I thought I'd follow [/shio/4 settings and 1 training for drafting on a new Mac] honestly.
	November 24, 2019
		I observed again the environment of [shio].
			After shifting one square to the right with Karabiner-elements, Lacaille handles simultaneous keystrokes.
			Huh? Wouldn't you rather not need Karabiner-elements and just use Lacaille?
	[Diary of Thumb Shift on Mac 2020-01].
		>Tried for the first time in a year and a half
　2022-01-22 I haven't remembered this page in a while, so I'll report on the current status.
　　Since 2020, Mac key layout has always been thumb shift
　　　Is it OK for typing normal sentences (though slower than Roman input in its heyday)? I guess. about?
　　　I'll be like, "Yeah," or "Where was I?
　　I've been taking minutes, writing out thoughts, etc. using iPhone flick input, and as a result, my flick input is faster.
