fallacy
[human bug].

Wikipedia's [fallacy - Wikipedia https://ja.wikipedia.org/wiki/%E8%AA%A4%E8%AC%AC] is interesting
	formal fallacy
		>Partial Colloquialisms
  > Formally, for two events A and B, the inequality can be written as {\displaystyle \Pr(A\land B)\leq \Pr(A)}{\displaystyle \Pr(A\land B)\leq \Pr(A)} and {\displaystyle \Pr(B)}{\displaystyle \Pr(A\land B)\leq \Pr(B)}. In other words, when presented with the inference A and the inference A & B for a certain premise, they feel that A & B is more plausible, even though A alone is more likely. For example, when a person asks, "When Mr. K speaks in Kansai dialect, which is more likely, that he is from Osaka or that he is from Osaka and is a Hanshin fan?
  > Post hoc affirmation
  > Reasoning of the form "If P, then Q. Q, therefore P." If it is a fish, it has a fin. This is an inference of the form "If a fish has a fin, then it has a fin, therefore it is a fish. Therefore it is a fish." This is a fallacy due to the existence of whales, etc.
  > Denial of previous case
  > Reasoning of the form "If P, then Q. Not P, therefore not Q." If it is human, then it is a vertebrate. This organism is not a human, and therefore not a vertebrate.
  > Election Affirmation
  > Reasoning of the form "It is A or B. It is A, therefore it is not B." Inference of the form "Van Gogh is either a genius or a madman. The form "Van Gogh is a genius, therefore Van Gogh is not a madman" ignores the possibility of being a genius and a madman at the same time.
  > 4-concept fallacy
  > Although three words (not involving logical form) usually appear in a three-stage argument, the introduction of a fourth word or phrase constitutes a fallacy. For example, "Fish have fins. Humans are vertebrates. Fish are vertebrates, therefore humans have fins" is an obvious fallacy. Usually, it is made more sophisticated by a combination of equivocation and equivocation.
  > The Fallacy of Medium Conceptual Non-Peripherality
  > The medium concept is not circumlocutory in the three-stage argument. In the case of "All Z is B. Y is B. Therefore Y is Z.", the medium concept B is not circumlocutory. Therefore, Y is Z." In this case, the medium concept B is not circumlocutory. All fish are vertebrates. Man is a vertebrate. Therefore, man is a fish.
	non-formal fallacy
		>Fair world fallacy
  > He believes that all righteousness will eventually be rewarded and all sins will eventually be punished. They blame the "sins" of the victim or victims rather than the perpetrators or natural disasters, such as, "Heavenly punishment for selfishness," "The reason one gets leprosy is because he/she has reincarnated with karma," "The reason one's caste is low is because one had bad karma in a previous life," etc.
  > Premature generalization
  > Deductive generalization in the absence of sufficient arguments. The following is an example of a generalization: "1, 2, 3, 4, 5, and 6 are all divisors of 120. Therefore, all integers are divisors of 120.
  > False dichotomy
  > To present a number of alternatives and proceed with the argument on the assumption that there are no other options. For example, the multiple debtor's thinking, "I can either continue to live my life being plagued by debt collectors, or I can commit suicide, one of two things." In other words, it excludes the option of bankruptcy.
  > Wrong analogy
  > To make an argument (analogy) based on the similarity of events while ignoring material differences. Drinking alcohol and coffee are similar tastes. Drinking alcohol is regulated by law. Therefore, drinking coffee should be regulated by law.
  > Eradication of Exceptions(en)
  > To develop an argument based on a generalization that ignores exceptions. 'It is a crime to wound someone with a knife. Surgeons hurt people with knives. Therefore, surgeons are criminals."
  > Biased specimens
  > To draw a conclusion from only a biased example (sample) from the population. The following is an example: "(A person living in Japan) is surrounded by only yellow people. Therefore, there are only yellow people in the world".
  > Confusion between correlation and causation (pseudo-correlation)
  > Short-circuiting correlations and treating them as causal. There is a correlation between the number of diseases eradicated and the prevalence of television. Therefore, the more widespread the use of television, the more diseases will be eradicated."
  > Both only progressed independently over time, but numerically a correlation was created between the two, leading to the mistaken belief that there was a causal relationship.
  > Fallacy of immediate cause and effect (Luo: post hoc ergo propter hoc)
  > To take the fact that B occurred after A occurred and then to prematurely assume that A is the cause of B. The conjuration and the healing of disease are not cause and effect, but rather back and forth.
  > Slippery slope argument(en)
  > To assert the danger of some thing by using the "when the wind blows, the bucket shop makes money" type of argument. Domino theory. Not necessarily a fallacy. It may be a fallacy to say that "when the wind blows, the bucket makers make money," but "if the Russians lose World War I in a series of battles, the Caucasian bison will become extinct" is a real situation.
  > Reversal of causality
  > Reverse the causal relationship and make the claim. For example, "Wheelchairs are dangerous. For example, "Wheelchairs are dangerous because people in wheelchairs have been in accidents. (Basketball players are taller. Therefore, basketball players grow taller" (It does not necessarily mean that they grew taller because they played basketball. (It is also possible that the company recruits tall people as players.)
  > Texas Sniper Fallacy
  > Treats as correlated what is inherently uncorrelated. Also called cluster illusion.
  > The name comes from a Texas joke that when a superior officer questioned a sniper about his skill, he was impressed with his skill because he pointed to a hit right in the middle of a target on a distant wall, but in fact he had just drawn the target later on a bullet hole in the wall.
  > Preemption of Issues
  > An argument that explicitly or implicitly uses a conclusion as part of its premises. It is not formally wrong, but it is not true as a whole because the conclusion is part of the premise. 'He's an honest man; he wouldn't tell a lie.
  > Amphibology
  > To make an assertion in a grammatically ambiguous sentence form. In the sentence, "Teens should not be allowed to drive cars. It is very dangerous to allow them to do so." The sentence is ambiguous as to whether it is saying that young people are in danger or that young people endanger others.
  > The equivocation fallacy
  > To construct a three-stage argument using words that have more than one meaning. For example, "You need a license to drive a car (automobile). A bicycle is a vehicle. Therefore, you need a license to drive a bicycle. (See also "Falsehood of Ambiguous Concepts.")
  > False continuity
  > A fallacy in which an ambiguity in the terminology causes a discrepancy with common sense perceptions. Also called "the sandpile paradox" and "the Ship of Theseus." If you take one grain of sand out of a sandpile, it is still a sandpile. If you take another grain out of the sand pile, it is still a sand pile. Therefore, no matter how many grains of sand are taken out of a sand mountain, a sand mountain is still a sand mountain.
  > Multiple Question Fallacy
  > A form of question in which the premise of the question involves an unproven matter, and answering "yes" or "no" is an admission of that premise. The question, "Do you still believe in the heliocentric theory?" is a question that, whether you answer "yes" or "no," you are acknowledging the implicit premise that you have believed in the theory of natural motion in the past.

RELATED.
[What is the guideline for the characteristics of sophistry (Kibenotokucho no guideline) - Niconico Encyclopedia https://dic.nicovideo.jp/a/%E8%A9%AD%E5%BC%81%E3%81%AE%E7%89%B9%E5%BE%B4%E3%81%AE%E3%82 %AC%E3%82%A4%E3%83%89%E3%83%A9%E3%82%A4%E3%83%B3]
[Debunking "Guidelines for the Characteristics of Sophistry" - Togetter https://togetter.com/li/476728]
[Guidelines for casuistry (2018) https://anond.hatelabo.jp/20181201124705]
