Even if you shoot at the same time, what you see is different.
There is a 0.3 second difference in what you see on the iPhone 7 and iPhone 11 when taking pictures at the same time.
	[https://gyazo.com/649afd66e5e2b0ecd249082f8ed15719]
	[https://gyazo.com/052562f18bea360264129fd57359265e]
	[https://gyazo.com/13181e6f1de8c8c30e7451938d5623d9]
	[https://gyazo.com/3a658382cfbc96594b4bc645efdfa2a0]
	iPhone7 shows 50.58, iPhone11 shows 50.27 even though they were taken at the same time
	Video [Facebook https://www.facebook.com/nishiohirokazu/posts/10219958038997866?comment_id=10219958052198196&reply_comment_id= 10219961618567353]

[https://gyazo.com/17972286727b3032c7008337822ff9db]
Summary of Observation Facts
	Both iPhone7 and iPhone11 are usually about 0.14 seconds behind reality on the display.
		Only iPhone 11 starts delaying further after the shutter release is pressed.
		That delay is made up later with a jump.
	The photos taken are
		Time around dark on iPhone7
		Time around the time the shutter was pressed on the iPhone 11

interpretation
	Originally taken at dark on the iPhone 7.
		The darkening.
			Was it "necessary to use the computing resources used for screen rendering for other purposes?"
			Or did they imitate the behavior of SLRs, the type that uses a mirror to switch between the eye and the image sensor?
		I don't know.
	However, this behavior also means that "even if you look at the screen and press the shutter at the best timing, you will see the image 0.3 seconds later.
		It could be argued that this misalignment is undesirable.
	The iPhone 11 now takes a picture at the exact moment the shutter is pressed.
		Save the contents of the display at that time.
			It's not "save the contents of the image sensor at this time."
			For those who shoot without looking at the display, it shows 0.13 seconds before the pressed timing.
			Most users shoot with their eyes on the display, so it is likely that the camera was adapted to their needs.

relevance
	[shutter clicks one beat slower than reality]
		This experiment here is influenced by the reflexes that humans have from the time they see something to the time they press the shutter.
		I did this experiment to try to eliminate that effect.
