Regroup20191202
	Do we need [sticky notes] in the first place?
		In the absence of digital writing materials, the only low-cost way to edit information was to "put it on a piece of paper and move it around"!
			As for writing, the cost of erasing was high because there was no Undo
			A piece of paper can be moved and if it doesn't work, it can be Undo'd instantly.
	The tool that made it possible to "move" in a way that was not a two-dimensional spatial arrangement was [the outline processor].
		Two dimensions: up/down and indentation direction, but the degree of freedom in the indentation direction is implicitly restricted.

-----
	I've been talking about an app that can also take handwritten notes, which I was working on this summer, but judging from Mr. Kurashita's reaction to Mr. Yuki's prototype, I think there may be a need for users with just the handwriting part without the sticky note part.
	I used a whiteboard at a certain place in a hurry, but the pens were lousy and I was far from some people's seats. This feature may work well for sharing handwritten notes without having to install anything.
[Facebook https://www.facebook.com/nishiohirokazu/posts/10219978632232684]
-----
	Forget about sticky notes for once and think about smooth output of information.
	[Handwritten illustration], [keyboard], [flick], [voice input].
	[Don't think about where to put it at first], [think about it after the output].
 Likewise, it's not a good design to make people think "is it a sticky note or not?" from the beginning, long or short, you should be able to [throw it in without thinking] first.
		I guess the default should be [memo tied to the field of view] when you think about it.
	Even when [audio recording while illustrating], it should be tied to that [field of vision].
	When do I want [sticky notes]?
		For example.
			Reading books,
			When you see unorganized but potentially valuable dialogue logs from others or yourself,
			Unorganized idea notes for books, lectures, etc.
		First of all, there is a lot of unorganized information, and when you want to organize it, you want to move each fragment.
		Even with today's handwriting tools, it can be done with two steps: lasso it and move on,
		So when you want to focus more on moving, you want to fix the unit of movement.
		 Sometimes you want to move in batches, so "fix the smallest unit of movement."
 Extracting smaller units from larger units, like underlining or excerpting from a document, is done
	 Scrapbox's new page destroys the original document, but I want a new item linked to the original document.
		Scrapbox's outliner-like behavior is rather good, it would be nice if some of its tree could be extracted without destroying the original.
 For example, if I submit a large file (PDF, video, external link), is that also tied to the view?
	 Is it small enough to string together?
 When an item is dragged on the screen, not only is the location updated, but the field of view when the item is updated may accompany that update.
 If you log not just the movement but also the field of view, you can share the organizing process itself by dragging items.
		The process itself must be shared in order to [bestow karma] #Process sharing
	I don't know what it means because [only the final deliverables are shared] using the KJ method.
 I have a view that I write down like this, and then I convert it to sticky notes and organize it.
 Every item should have an edit linked to it
 In the process of rearranging what you have written, you may want to rewrite it or split it up.
 	That should be one click away.
	Is this post long enough to be broken up by line breaks?
	Line break button is there, but not used.
 No need to limit it, it's good to be able to break lines and indent.
 It is up to the user to use it for [one-dimensional writing sequences
 [User freedom is important], restricting it only makes it harder to use.
 It would be nice to have a share button with field of view information.
 	I hope the QR code comes up full screen on the share button.
 	Screen aspect ratio varies from user to user, should be displayed in a field of view where the entire screen of the sharer is visible
	 	Humans have difficulty noticing off-screen edits
				Better to have a mechanism to make people aware.
			 The maps in the game are well done.
 If all the editing history is kept, there's less need to fear free editing.
	 If we can freeze it on the rare occasion of an editing war, that's all we need.
	 We can also freeze the shares that we don't allow to be edited.
	 In other words, the three categories of "those who can only see", "those who can edit", and "those who can freeze".
 Why I use Facebook instead of Scrapbox for this kind of writing?
	 After writing it, I reprinted it in Scrapbox to organize it.
		Why not write in Scrapbox from the beginning?
 What are [bullet points]?
	 What determines whether to [indent] or not?
	 Some people want the same hierarchy to be parallel, while this is clearly too strong a constraint.
	 Some people think it should be readable if the same hierarchy is readable if the child elements are ignored, another too strong constraint.
	 It can be organized after the fact to have those characteristics, but not at first, of course.
	 So this is a means of expressing "relationships not yet verbalized" similar to the proximity of the KJ method!
	 I'm not sure there's a way to describe a verbalized relationship in bullet points.
			That's just a tree.
			Can't annotate unless it's like an AND/OR tree.


[Regroup]
