Regroup v2 解説
Q: What is this? A: A tool that allows you to use the KJ method with handwritten graphic notes and sticky notes.
[https://gyazo.com/9894b46b9f2da59814a03245e24399ad]
[Manual http://nishio-s3.s3-website-us-west-2.amazonaws.com/#/manual] [Regroup201907 Demo Video]

	It was designed for the iPad, so the iPhone screen will be a little bit messy, but it's a browser implementation, so it will work.
	Edit and save immediately to the cloud without explicit saving
		Cached locally offline and saved when you come back online
		However, it disappears when the tab is closed now (to be improved).
	No user management now.
		A system that allows people who know the link for editing to edit it.
	Open the same link on your PC or iPad and you'll see the same thing.
	Pass draw instead of paint
		Can be selected and moved after drawing.
	Still no eraser, line color, thickness, dotted lines, arrows, etc.
	Drag the background area with the move tool to get as many new sheets of paper as you want, unlimited paper sizes.
		Two-finger gesture to zoom in/out and move paper
	On iPhone, "hide toolbar" will give you more space for editing.

	既知の問題
		FIXED: [Menu icons stick out on narrow screens such as iPhone].

		[https://gyazo.com/3caad9f4f44947f712fc34fc8ec3ca5f]
			The menu bar is hidden when the screen is rotated, for example.
			TODO: Tap on a white area with no canvas to reposition it to the proper position!
				Or Shake
		>When I scroll down the screen and add a new sticky, it is added in a place where it is not visible (at the top) at that position.
			[/rashitamemo/Regroup v2 First Impression#5de65eb79dc7d80000d0b096]
			TODO: This is a bug and will be fixed
				If implemented correctly, sticky additions are always placed in order starting from the upper right corner of the current field of view.
		>When I group stickies, I am prompted to enter the nameplate name, but the text of the previously entered sticky is still there.
			[/rashitamemo/Regroup v2ファーストインプレッション#5de660a49dc7d80000d0b0a4]
			TODO: This is another bug
				I'd prefer a placeholder.
				I'm beginning to think it's not a good idea to force people to name their nameplates.
					Better to have a nameplate, especially when grouping paths, but I was thinking a thumbnail would be fine.
		No way to open the middle heading.
			[/rashitamemo/Regroup v2 First Impression#5de6611c9dc7d80000d0b0a7]
			TODO: hmmm, this is probably a rather difficult bug
		When using iPhone in sticky note input mode, the text area size designed for iPad is too large
			I lose track of the toolbar because of that.

	request memo
		Deleting and Ungrouping
			わかる [pRegroup2020#5d2d4ca4aff09e00005b4e11]

