20161217 中高生向け未踏説明会
20161217 中高生向け未踏説明会
	I'm the man who will be retweeting all the unexplored-related tweets today, from the unexplored information session to the unexplored year-end party at night!
	It's going to be hard to explain "consignment money" and the "Bayh-Dole Act" in materials for middle and high school students while chewing through them in real time.
	Even if you think you're not good enough, you may be surprised how much people appreciate you, so don't assume you're not good enough."
	Noboru's blog is how I came to know about the Unexplored Project.
	I sympathize with you so much." > "I come up with ideas in class."
	 I used to divide my class notes vertically into three sections, with the rightmost column being where I'd write down any ideas that came to mind during class.
	How do I maintain my mentality when I think it's not working?" "I show it to people I've never shown it to before, and as I get used to it, my criteria for judgment changes, so I reset it once and jump into something completely different."
	Questioner, "Do you do anything with regard to the sense of smell?" Mr. Ochiai: "I want to do all the senses, but I give priority to those that can be expressed in waves. I plan to do olfaction and taste in about seven years."
	Questioner, "What has changed significantly since you were doing Unexplored?" Mr. Ochiai: "Machine learning. At the time, I thought it was a dream that would never come true, but after 2011, it changed dramatically."
	Do you want to pursue an unattainable dream? Or do you want to do what you can achieve?" Mr. Ochiai: "At the company, I want to do what I can achieve, but as a media artist, I want to be a pioneer, and I think it's important to have both perspectives.
	When you collaborate with someone, at the very least you go to them to learn their skills, and at the very least you get to be hands-on."
	"Hiding ideas is losing the opportunity to talk to people about them and brush up on them." and "Realize -> Value."
	We never get the first idea to work, so we try it first with the assumption that we'll change course. If users don't respond well, that's just the way it is, and we can brush up on it."
	A place where an uncle at a big company who didn't hone his own technical skills tells elementary school kids a bad story about when he was swept away by the job market.
	I want them to keep trying and failing because it's normal for them to fail."
	However, it is important to support the company's foundation with systems, and looking at overseas examples of MCU, there are many cases where other new businesses are being launched, and engineering capabilities are needed there.
	The more tolerance for failure you have, the more drive you have to go on with your nannies when you fail in the workforce. In that sense, there is no disadvantage in challenging the unexplored (because even if you fail, you will have gained experience in failure)."
	I was deeply moved by the stories of unexplored alumni, which helped me to remember values that I myself had considered important but had almost forgotten a little.
	Doraemon is from the future, but he doesn't say things like, "Hey, there's no Wi-Fi.
	You never know unless you try." "I didn't want to do any of them, I wanted to do them all, so I figured out what the common denominator was and did that."
	The rice cookers of today are all equipped with microcomputers, but they are no longer called "rice cookers with microcomputers. It is because it has become commonplace. Robots are no longer called robots because they have become commonplace (in the same way that Roomba is no longer called a robot vacuum cleaner).
	There is no reason why it can't be for one's own good. Even those who say, 'I'm happy when others are happy,' are happy for themselves, so in a broad sense, they are doing it for themselves.
	I'd like to know, "Can I apply for something that will be useful to others rather than something I want to create? What do you think?" Takeuchi Sensei: "No problem!
	I have a fear that I have to apply for something that will be more useful to others than what I want to make. What do you think?" Takeuchi Sensei: "No problem!
	
