The process of creation deepens understanding.
The story is [that] a test is a means of memory, and creating that test yourself will in itself deepen your understanding and strengthen your memory.

[https://gyazo.com/7da3362d118ec8224a748a79ee9ebbd4]
>"Rule 1: Trying to learn what you don't understand" in [20 Rules for Structuring Knowledge
> As it relates to "Do not do," understand first before you learn.
> is important. Remember the story of [the parable of the pyramid] introduced in Chapter 1.
> Yes. If you just read a book and gather information, it will be laid out flat on the ground and
> We are just there. We need to work on building a pyramid by piling up the information we have gathered.
> Psychologists Crailk and Tulving have shown that memory for words and the
> Experiments were conducted on the relationship between depth of treatmentNote 29,
> I did one of those for each word; the first step, for example, was to use TABLE and
> "Is this capitalized?" for the word ">". Answer the question "Is this capitalized?
> The second step is to use the word crate, which is the same as the words weight and
> "Does it rhyme?" The third step is "sound processing," which answers the question, "Does it rhyme?
> "Classification process" to answer the question "Is this a type of fish? The "classification process" answers the question, "Is this a type of fish?
> > The fourth step is to use "He met a ___ in the street." for the word friend.
> "Does it fit the statement?" This is the "processing of the sentence" that answers the question, "Does it fit the sentence?
> How well do you remember words after asking one of these questions about words
> When tested, only 18% of the words with shape processing were remembered
> 78% of the time for sound processing, 93% of the time for classification, and 96% of the time for sentence processing.
> The results of the study showed that the more advanced the cognitive work was, the more it was retained in memory. In other words, the more cognitively sophisticated the work, the more it stays in memory.
>.
> Read the textbook, find out what you need to memorize, and then sin
> The task of making a pull problem is cognitively advanced. The task of creating a problem is tedious
> I can't download it from somewhere or generate it mechanically.
> You might think, "What is it? But it is a cognitively sophisticated task to
> You are giving up a chance to be remembered.

[An Engineer's Guide to Intellectual Production] p.99 [(3.5.7.1) The process of creating deepens understanding].
