2020-01-17
	[pRegroup2020]
		When a page of a paper is shown and explained, I want to not only write on it with a pen, but also rectangularly select a part of the displayed content and duplicate it in another place (like a mathematical formula).
		I want to summon a blank piece of paper with a handy command, pop it over there, and then add an explanation with a pen.
	 I wonder if it would be possible to write over an image or diagram with a red pen and then erase only the lines you wrote on it, or to write on a hand-drawn diagram and then erase only certain colors.
	 I wonder if there should be a link to the original object (or field of view) for a cropped part of the image.
	 But if the note is being rewritten, is there a possibility that the link to the original vision will rewrite it?
	 Do you need to be able to easily duplicate or take snapshots, or do you need to be able to go back to the original and worry less about breaking it?
	 I would like to have a bird's eye view of the page, with additional dates and times.
	 Would it be nice to have a bird's eye view with a small pre-rendered image?
	Scrapbox
	 When you need to recall b when you see a certain memo a, you need to write the contents of b there in a system without links. If the amount of information is too large, it is difficult to write, so only a short description is written, thinking "I will be able to recall it. Often, they cannot recall, and they end up saying, "I don't remember what this is. If linking is easy, linking will keep the "connection" alive. The computer, rather than an uncertain human being, can be trusted with the memory of the "connection.
 	This is especially noticeable in the memory of the task. If the tasks are not related, there is no point in putting them off, so they will be destroyed individually. Other types of tasks are left to their future selves, leaving them connected. This is often forgotten
 	We cannot put time aside or forget because of the anxiety of forgetting, when it could be better through the test of time.
 	Someday I'll do it" is a task that does not need to be done. Information about why you want to do it is useful. If you forget that, you end up with a task list that you don't know why it was written, and that becomes a burden. You will not want to look back at it. What you want to get out of it should be written properly, and how to solve it is secondary.
 [pKakidashi]
	 An excerpt is useless unless you read it back.
	 If the information about which book it was extracted from is lost, it makes no sense.
	 The trigger for reading back is efficient when you are thinking about something related
	 Reading back and forth just for the sake of reading back is sometimes painful, sterile, and less interesting when the context is lost and the meaning is lost.
	 It does not make much difference whether the data was written by yourself or came in from the outside through books or social networking sites. The difference between internal and external exploration. The latter is just more difficult because there is less consistency or a mismatch in word usage.
	 I'd like to be able to distinguish whether it originated from me or not, and I'd like to be able to search for it.
  I recently started creating a page titled a in Scrapbox. The title can be added later.
	 Writing can be chatty, or have an insert from someone other than yourself.

https://www.facebook.com/nishiohirokazu/posts/10220421591546390
