touch typing
>okapies: forms may be touch typed but actually "seen"
>Non-touch typists look at the keyboard more often than touch typists, but it seems that touch typists do not look at the keyboard at all, either. This is contrary to the common belief that "touch typists do not look at their hands.
https://twitter.com/okapies/status/1217249010471227392?s=21

>shiology: I type with my keyboard on my peach, so the keyboard is under my desk and out of sight. I tell my seminar students to train themselves up to "full touch typing" where they can type letters and even number symbols with a towel over their hands in the home position on the keyboard.
	https://twitter.com/shiology/status/1217460229186547713

Interesting. I was aware that "touch typing = being able to type even with a towel over your hand", but I guess many people don't think so.

After practicing complete touch typing during the year-end and New Year's holidays, I thought that if I could practice complete touch typing, the problem of troublesome text input in VR space would be easily solved, and working in VR space would become quite realistic.

>I have experimented before with taking notes while listening to a 90-minute lecture, with the HHKB placed on my thigh (I call this laptop typing) and the Mac screen almost closed, to see if I could do full touch typing and continue taking notes without looking at the screen at all, along with the Mac's live conversion. I experimented with this.
	https://twitter.com/shiology/status/1217464729804783616
	I would love to reach this state of mind.

Today, I was typing with the edge of my scarf over my hands, making the keyboard invisible, as I was also training for full touch typing, and I recommend it because it is so much warmer. If you can touch type, you can work with your hands in a blanket or something, so it makes you more comfortable in the winter.

It's hard to notice if you're unconsciously glancing at the keyboard or looking at it in your peripheral vision. If you cover the keyboard and your hands with a towel, you can clearly see it. I lost a lot of speed and accuracy. It is interesting that once you slow down and train with the goal of "not making mistakes even if the towel is covered with a towel," you will feel a new circuit forming in your brain.