Cybozu Labs Human Resources System
2020-01-28
Lab-centered description of [Cybozu's human resources system
	Information shared before and after the interview regarding [the survey of factors related to the mobility of innovation personnel by the Cabinet Office].

---

	Transcript of presentation material + talk about the process that led to "100 different ways of working" at Cybozu
		[At Cybozu, 100 people can work in 100 different ways Background of "too diverse work styles" - Log Me Biz https://logmi.jp/business/articles/320484]
		For detailed materials, please refer to [Cybozu's Human Resources System].
		[管理方法 https://cybozushiki.cybozu.co.jp/articles/m005338.html]

 2005/8 Cybozu Labs established
 	Started as a research division subsidiary with a separate legal entity and a separate personnel system
  50% rule: A system where at least 50% of work time can be spent on a theme of your choice.

 2008 Case study of "Reducing work to 3 days a week and parallel work with private business" at the Lab.
 2012 Head office policy changed to allow secondary employment
	 https://cybozushiki.cybozu.co.jp/articles/m001149.html

 2011- [Cybozu Lab Youth http://labs.cybozu.co.jp/youth.html]
  >Cybozu Labo Youth was established on March 31, 2011 with the aim of discovering and fostering young Japanese engineers with world-class skills, and to provide young student creators with research and development opportunities.
  Company support for individual student software research and development projects
   It's not a part-time job or an internship.
   Made with reference to IPA unexplored use
  Cybozu pays incentive up to 1,030,000 yen per year
  Copyright of deliverables belongs to the individual
		It is a form of parallel work since many of them are college students
			There have been cases in which LaboYouth has led to joint research with the adopter's faculty advisor.

	2013- Hackathon
		Cybozu Labo Youth Hackathon https://blog.cybozu.io/entry/5900]" 2013/9/11-9/13
			Lab-sponsored events for students
		We're going to do it ourselves! Let's do it ourselves! https://nishiohirokazu.hatenadiary.org/entry/20131214/1386992255]"
			A hackathon was also held at the headquarters in December.
			It has continued every year since.
			Employees conduct research and development on a spontaneously determined theme for three days and make a presentation.
		A place for [Lean Startup]-like innovation creation


Not many lab-specific systems.
	A culture that values "relentless pursuit
		Relentless pursuit" is required of all employees.
		A system to promote "relentless pursuit" will be introduced at the head office.
		What's beneficial for the lab to do should also be beneficial for headquarters to do."
 2018/9 OSS Policy
 	[Cybozu Open Source Software Policy - Cybozu Inside Out | Cybozu Engineer's Blog https://blog.cybozu.io/entry/oss-policy]
 	 >Software created spontaneously without instructions, even during work hours, belongs to the individual.
 	[Cybozu Inside Out - Cybozu Inside Out - Cybozu Cybozu Engineer Blog - Cybozu Inside Out | Cybozu Engineer's Blog https://blog.cybozu.io/entry/2018/09/13/113000]
 		>For example, if you have an engineer who wants to learn Rust, you can buy a Rust book even if you do not use Rust in your work.


The "knowledge drain" associated with parallel work
	It also has to do with Cybozu's development of web applications in particular.
	It is not a domain that can be fought only with knowledge created in-house.
	Need to adapt to external knowledge systems such as international standardization of browsers and internationally developed OSS
		In other words, the speed at which "information outside the organization" is absorbed is a matter of life and death.
		There is no way that a policy such as "don't participate in outside study groups" can be implemented under these circumstances, for example.
		It is useful for employees to go out and acquire knowledge more and more.
		Parallel work also serves as an important channel for "knowledge inflow".


Will increased mobility of human resources lead to an exodus of talent?
	2012- 育自分休暇制度
 	[Cybozu's Human Resource Strategy: "Self-employment leave system" that allows employees to return to work after 6 years (1/4 page) - SankeiBiz https://www.sankeibiz.jp/econome/news/131106/ecd1311060600003-n1.htm]
  [Diary of a leave of absence for childcare - To Africa, a 4-year employee. Differences in "common sense" noticed after leaving the company | Cybozu style https://cybozushiki.cybozu.co.jp/?p=16624]
	Retiree Conference
		Event for Cybozu retirees to talk to Cybozu employees about their experiences outside the company.
	Don't think of people moving to outside organizations as a "lost" or "negative" thing.
		If the person has a good relationship with Cybozu, it is the growth of the network against society
		I don't put much stock in "whether or not they're employees."
			Someone who is not an employee but shares Cybozu's ideals.
			[Cybozu's "kintone" to expand ecosystem - PC-Webzine Archive | PC-Webzine https://www.pc-webzine.com/entry/2019/11/kintone.html]
	[When we stopped setting salaries based solely on internal evaluations, we were able to achieve a diverse work style | Cybozu Style https://cybozushiki.cybozu.co.jp/articles/m001021.html]
 	>Sideline work is OK, leaving the company once is also OK.
  >I tell new graduates, "First of all, I want you to be able to quit Cybozu. I want to make Cybozu a company where you, who can quit at any time, still want to work at Cybozu.
  >Bosses need to be aware of this and train that person to get out there.
	[Why did Cybozu create an HR system that makes it "easy for employees to leave the company"? | Career Hack https://careerhack.en-japan.com/report/detail/216]

A case study of parallel work resulting in a product."
	Research departments tend to focus on technological seeds, but in business, it is important to match them with customer needs.
	Parallel work is particularly beneficial in discovering customer needs
		When a customer's problem X is solved by means Y,
			The timing of this realization is when someone who knows means Y joins the team.
			Means Y is often not "academic state-of-the-art knowledge"
	So limiting it to "in the research department" doesn't make much sense.
	Case Studies in Technology
		[Sukehiro Kozaki and Satoru Takeuchi appointed as Cybozu's first Technical Advisors | Cybozu K.K. https://topics.cybozu.co.jp/news/2017/09/07-4296.html]
		[Asked by Technical Advisors──Interview with Mr. Toshihiro Kozaki and Mr. Satoru Takeuchi - Cybozu Inside Out | Cybozu Engineer's Blog https://blog.cybozu.io/entry/2017-09-07-tech-expert]
　Regarding technical knowledge
　　Cybozu operates its services in its own cloud and allows customers to use them over the Internet, so its intellectual property strategy of not taking out patents and keeping them secret is effective.
  Inventions in own cloud operations are often tightly coupled to the own cloud situation and are not useful to be isolated as patents or papers
　　Cybozu has long had a positive culture of sharing knowledge with society in the form of open source and technical blogs
  Since there is no quota on the number of papers or patents, and on-demand media is very active, blog posts are often chosen as a form of knowledge sharing to society.

It has nothing to do with the lab, but since it came up in the topic.
	2016/4
		[First in 23 wards! Long-term dispatch training to a private company Ward employees will be dispatched to IT company Cybozu https://www.city.nerima.tokyo.jp/kusei/koho/hodo/h28/2803/280322.files/280322.pdf]


-----

	Cybozu's company-wide culture of "[recognizing] diverse personalities," not just in the lab.
	Not directly aimed at "mobility of human resources."
		Does not preclude participation in diverse "outside projects" (1)
		→Weak ties" (3) are stretched outside the company.
		Mobility" and "open innovation" emerge "after the fact
	[Do not set numerical standards for the evaluation of researchers](2)
		(Hiroshi Maruyama, "To All Aiming to Become Corporate Researchers")

関連記事
	(1) ["Even if the remuneration was zero, I was doing double work" - Why Yasukazu Nishio did not quit Cybozu Labs and started working as a technical advisor for machine learning | Cybozu Style https://cybozushiki.cybozu.co.jp/articles/m001358.html]
	(2) [No need for management, no evaluation by the number of papers - this is how Cybozu Labs became an organization that pursued the ideal of R&D | Cybozu Style https://cybozushiki.cybozu.co.jp/articles/m005323.html]
	(3) [Mark Granovetter - Wikipedia https://ja.wikipedia.org/wiki/%E3%83%9E%E3%83%BC%E3%82%AF%E3%83%BB%E3%82%B0%E3%83%A9%E3%83%8E%E3%83%B4%E 3%82%A7%E3%83%83%E3%82%BF%E3%83%BC]
