Conversion from flow to stock
Try to organize [flow to stock conversion (raw)

	The concepts of [flow] and [stock] are vague.
		It's a word that evokes [flow], [pool].
		But even in Slack, where chats flow, logs are accumulated and subject to search.
		Pages that are not written and maintained and no longer referenced in wikis, which are supposed to be places to store information.
			It's no different than drifting away.
		So I don't think the "[flow ←→accumulate]" cutoff is very appropriate.

	I'm interested in detailed output and assembling it later as a means of increasing personal intellectual productivity.
		This "small stuff" and "later assembled stuff" is a composition similar to flow and stock
		Smaller ones, imagine one line of chat posts, one tweet, etc.
			Writing multi-paragraph sentences on groupware is not part of the "little ones" for me.
		When multiple people are interacting in real time in a chat room, it tends to be a list of small things.
		I understand there is a need to assemble it as a document to be referenced later.
		As for my "small stuff", the only requirement is that the size of the output is small.
			Whether you're interacting with others or not is another matter.
		For example, if you keep a one-line diary, it is a "small one"

	If you are trying to communicate with others to make something "small," it is tricky when they speak in long sentences
		Troublesome, at least for tools that flow one-dimensionally.
		It is tempting to refer to more than one part of a single statement by the other party.
			but because of the scarcity of means to point to a specific position in the sentence.
			Permalinks may be per post or per line.

	Different individuals often use the same word with different meanings
		The implicit assumption that word X would mean Y is often rejected
		Creating a large text with insufficient sharing is like building a tower with bricks that have not been solidified.

	What does that "stock" look like? The question must be asked
		My "stock" is a combination of small outputs that have been combined and enlarged after the fact.
	What is its "combination"?
		Not everything is good.
			For example, just putting them in chronological order would be a "combined big one".
			But I am looking for a better "way to combine".
			Chronological summary is a "better than nothing" summary

	How they should be combined is influenced by what they are combined for.
		think in concrete terms
			Let's say you ask some technical question, we communicate, and the problem is solved.
				To sum this up.
					You can find people who have encountered similar problems.
					The person's problem is solved without having to discuss it again.
				This is [the purpose of summarizing].
			If you're looking for explanatory documentation for a library, you can use
				First, we provide a "tutorial that allows first-time readers to learn what they need to know.
				Then, explanations for various frequent needs
				Then follows an API reference organized hierarchically so that if you want to know more, you can find it
	Creating red links in Scrapbox is a preparation in the hope that they will be connected to other things in the future and create value.
		[Preparing to create value], or
		Preparations to create value for customers and users can only be made after customers and users are clearly identified.
		So, initially it would be "[preparing for my future reuse]."
		Take the time to think about it because it's a topic you value.
			The output of the thought process is important to deepen the thinking on the subject.
		When you [look back in time], you're arguing with your past self.
			Sometimes your future self disagrees with an opinion you thought you had at a certain time.
			If you don't record it, you won't know when your opinion has changed.
			Record and [notice differences], [opportunities for] synthesis
			You're going to think from [multiple perspectives].

	My frustration with the current public Scrapbox is that I can't write anything that can't be published there.
		Everything should go into the same place and connect with each other.
		Book excerpts, discussions on private groupware, etc.
		Everything should be connected.

	What is "connected"?
		Different timing and different sources of the written documents [can be related after the fact].
		[Human memory is so poor that it cannot retain all objects as associations.
			So, we leave retention to electronic systems (and paper).
		You never know in advance what to combine with what.
			So you discover the combination after the fact and gradually grow it into a larger system!

	Why [the system should be nurtured]?
		Even if you don't do [Discover Connections] again, you can follow the connections you've discovered in the past, because it's something you can streamline.
			What efficiency?
				探索？
				[Discovering new connections]?

	[Ideas are new connections between existing ones].
		[It is easier to produce beneficial results when distant things are connected.]
		In other words [increase the probability that useful ideas will be generated].
		Become the mother womb of ideas

	How do we go from having some large text on the groupware to the preferred state?
		We need a mechanism to [chew] big things into small pieces at a time.
			Whether it's done by a human or a machine is beside the point.
		What exactly does it mean to bite off more than you can chew?
			It doesn't look like you can just carve it into sentence units.
			We need to nuke out [a chunk of meaning].
			There are [long-lived masses] and [soon-to-die masses].
				We need to create small chunks of long-lived
			The whole "fair and square" thing is established as a long-lived little blob.
			This too can only be known after the fact.
			After you cut it out, [the test of time] will tell you.
			As a result, only the long-lived ones remain.
			So the lumps should be [reviewed again after a time
				What was left of value in that review will be the subject of another timed review.
				A cycle like this is needed.
