2020-02-04 Regroup+Kanban
[pRegroup2020]
	You might want to [kanban work technique].
	You might want to [kanban workflow with Regroup+Scrapbox for Regroup development].
	I summarized after writing out about the conception that

[https://gyazo.com/b3b603bb5ae9477b09e71efce65cc858]

	Regroup that can move stickies freely
	Scrapbox, which allows you to create pages with easy-to-understand titles and concise descriptions of links
	Isn't it the most powerful, kanban work technique in combination?
	User feedback
	It would be nice to have such a function! What we came up with
	Often not of a high enough quality to be a TODO.
	Not "a list of tasks."
	Using Scrapbox as a "place to write anything
	Hoarding anything that "might be relevant" to the project.
	Bracketing phrases that seem important.
	A set of information naturally begins to have a network structure
	On 2020-02-04, user X sent me a long comment.
	How to handle it
	Just put it in Scrapbox with "2020-02-04 Mr. X's Thoughts" or something like that.
	Bracketing after the fact what you read it and think, "This is an important keyword.
	Tags can be assigned or
 This issue certainly needs to be resolved."
 Thinking of solutions
 I'll also write down what I think the solution should be "this way."
 Sometimes a better solution can be found by reviewing it after some time.
 After concrete crystallization has progressed
 It becomes a task that says, "Let's do this."
 Kanban is to select and execute only one task at a time from a set of tasks
 Move TODO stickies to DOING and execute
 Move to DONE when done.
 Each page in Scrapbox becomes a sticky note on Regroup
 Can kanban naturally by moving stickies
	Keep "things that aren't quite TODOs yet" away from the TODO gathering.
	Keep the "somewhat related" ones together somewhat close together.
 Distance allows for non-verbal expression."
 KJ Legal Benefits
 Regroup's Areas of Focus
 I can put Scrapbox in Regroup and organize it.
 Or back to Scrapbox.
 Only the difference should be put into Regroup when the Scrapbox is updated.
 cannot do
 Scrapboxは
  Put in something that is not yet structured,
  Your future self will follow the link and find the connection.
  A system that promotes
 Regroupは
  Put in short sentences that are not yet structured,
  I find myself relating now by moving it while looking at the whole picture.
  It is a system that promotes
 Kanban work techniques are
 	Assuming that it's already been carved up into units of "tasks",
 	Never mind the "not yet structured stuff."
 	A strong drive mechanism for the tasks that are now structured.
 If you only use kanban, you fall into the trap of "making something efficient and futile is futile".
 I've thought to the point where I'm going to create the functionality needed to do that, and I'm going to actually do it.


raw
	I think the combination of Regroup, which allows you to move stickies freely, and Scrapbox, which allows you to create pages with easy-to-understand titles and concise links, is the best way to do kanban work. I'm starting to get the feeling that this is the best way to work.
	For example, we may get feedback from users, or we may think it would be nice to have a feature like this! The content that comes to mind is often not of a high enough quality to make it a TODO.
	Use Scrapbox as a "place to write anything" rather than a "list of tasks," and store anything that "might be relevant" to the project.
	By bracketing the phrases that seem important, the set of information naturally begins to have a network structure.
	For example, as a concrete example, suppose user X sends us a long comment on 2020-02-04, and we consider the question of how to handle it
	Just put it in Scrapbox as "2020-02-04 Mr. X's Thoughts", and if you read it and think "this is an important keyword", you can bracket and tag it after the fact.
 In the process of doing so, I sometimes think, "This problem certainly needs a solution," and then I think of a solution.
 I'll also write down what I think the solution should be, "This is the way to do it." Sometimes I find a better solution when I review it after some time has passed.
 That way, after concrete crystallization has taken place, the task is to say, "Let's do this.
 From this set of tasks, kanban selects one at a time and executes it.
 Generally, the TODO sticky is moved to DOING, executed, and moved to DONE when finished, and so on.
 Each page of Scrapbox becomes a sticky note on the Regroup, so you can kanban naturally by moving it.
	Keep "things that are not yet TODOs" away from the TODO grouping, and "things that are somewhat related" grouped somewhat close together.
 This area of "non-linguistic expression by distance" is a KJ legal merit, and an area of focus for Regroup.
 When I think along the lines of "I can put Scrapbox in Regroup now and organize it, but the problem is that I can't put it back in Scrapbox or put just the difference into Regroup when Scrapbox is updated.
 Scrapbox is a system that puts in things that are not yet structured and promotes my future self to follow the links and find the connections, while Regroup is a system that puts in short sentences that are not yet structured and promotes my current self to find the connections by moving them around while looking at the whole thing!
 Kanban work methods are based on the assumption that the tasks have already been cut into units of "tasks" and are a powerful mechanism to drive the tasks that are now structured without worrying about the "unstructured ones" yet.
 If you only use kanban, you fall into the trap of "making something efficient and futile is futile".
 I've thought to the point where I'm going to create the functionality needed to do that, and I'm going to actually do it.
