Regroup Release Notes 2020-02-07
[Regroup]
	Ability to import multi-line text with one line per sticky
	　Scrapbox can also be imported.
	Ability to jump from an external link sticky to its destination
　Ability to turn Scrapbox link notations into external link stickies, so you can jump to each page in Scrapbox.
	Faster sticky movement (display a translucent ghost while dragging and don't redraw the whole sticky)
		Netlify made daily releases possible.
	Fixed a bug in text input
		Faster path drawing (while writing, draw on a different canvas and do not redraw the whole canvas)
	Ability to save maps under a different name
	　Now that we can "save the current state and experiment," we can make progress with trial and error.
	Ability to change line color, thickness, and dotted lines
	A nameplate used to be required for groups, but now it is no longer necessary.
　If you fold a group without a nameplate, use the top-leftmost sticky as the nameplate.
　Fold a group that does not contain stickies to show thumbnails.
	Fundamental changes to mouse event-related code
　Bundle state names and variables and constrain by type
　It is now possible to change the location within a group.

February 6, 2012 Slip.
	[If you fold a group without a nameplate, make the top leftmost group the nameplate].
	[Fold a group that does not include stickies to display thumbnails].
	[change location in group].
	[表札の事後的変更]
	[Demonstration of grouping in Regroup]
	[Constrain by type by bundling state names and variables].
	[Remove border from group].

Feb. 5, slip.
	[Simplify text entry]
	[Faster path drawing]
	[Can be saved after the fact].
	[Change line color, thickness, and dotted lines.]

February 4, 2012 Sleuths.
	[Open external link sticky in a new tab.]

February 3, 2012 Sleuths.
	[Ghost Drag]

January 31st Sleuth.
	[Hamburger Menu]
 [each page in Scrapbox is displayed and organized as an item].
-----

Release Notes 2020-01-31
	Image display capability in Regroup and Export tool

January 30, Sleuth.
 Can now read and display images from gyazo
 Now that we support Scrapbox tags, we should be able to specify and import pages with mixed images.
 [Show image on sticky]

[Regroup Release Notes]
