Notes from monorith's Demo Day
[MITOU2019 Demo Day https://www.facebook.com/groups/2933888119990947/permalink/2933947946651631/?refid=18&__tn__=*s*s-R]
	Searching is something I do every day and it's directly related to my efficiency, but I've never had the chance to learn it.
	When I have a lot of things on my mind, I'll look up one thing and forget about the other "things" I'm interested in.
	therefore
		First, write the question
		Break it down into more specific questions
		Then we'll find out.
		Hanging the results of your research on the question.
	What is "[survey]"? One solution to the question
	Remember Source
		Related [sticky should remember source].
		No more anxiety about closing tabs.
	Applications outside of research surveys: Software development in teams
		Processes investigated to achieve something or to solve some problem.
			Now it's gone.
			It is inherently better to be stocked in a form that is easy to refer to later.
			It's going to raise the level of our development capacity as a team.
	>Taylor's 1968 paper (Question-negotiation and information seeking in libraries), which has the effect of raising the required level of human information need.
	>Means of communication through search
	>Assistive tools for structuring knowledge
	[WISDOM X https://www.wisdom-nict.jp/#top]


>Humans have never synchronized their searches. In other words, we have been doing a lot of individual search themes & words with the same purpose, but we may be able to eliminate such overwhelming waste.
	https://twitter.com/taisukeOo/status/1228893270559715328

	Software that supports "the process of acquiring knowledge through repeated searches
		Interesting point about being able to "[jointly search]" with multiple people and seeing the benefits of doing so.
		Similar in composition to the benefits of changing from solitary programming by one person to [mob programming] by multiple people, there may be benefits to "collaborative search" and "[mob survey]" by multiple people.


