2020-02-21 Regroup
What is the next goal?

	For the purpose of drawing a single figure, I've started using my own notebook app instead of the one I normally use.
		[almost no problem https://scrapbox.io/nishio/%E3%83%9F%E3%82%B9%E3%82%B3%E3%83%9F%E3%83%A5%E3%83%8B%E3%82%B1%E3%83%BC%E3%82%B7%E3%83%A7%E3%83 %B3%E3%81%AE%E4%B8%80%E4%BE%8B]
		A little cumbersome, color change menu is text, [copy and paste picture] is not there yet.
		Excellent, dotted lines can be drawn, saved in vector format on the net.

	Can it replace all use cases of notebook use? →Not yet.
		What's the problem?
			In use cases such as taking notes while listening to a lecture, the fear of getting into trouble and disappearing while writing has caused me to use tools that are safe.
			That makes me nervous because taking notes on a lecture is "unrepeatable if what I wrote there is lost."
			If you're listening to an online lecture and taking notes, you're less worried about losing it, so you can try it out, and once you accumulate a track record of it working without problems, you can rest assured.
			Anxiety about preserving what I wrote offline
			I'm worried because the export tool is designed so that what you write offline doesn't disappear, and in fact it hasn't, and Regroup was created without thinking about that and has disappeared several times.
			The next part to solve is this: properly store data that isn't stored in the cloud locally on your own.
			[Turn on the connection status indicator.]
			[Designed to keep what you write offline from disappearing].

	As for synchronization with Scrapbox, the contents of Scrapbox can be poured in.
		I haven't yet developed a process that feels right.
		Right now I'm organizing it by pouring in text, but would it be better to put in the page URL and have the pages linked from there become stickies?
		With the same look and feel as on Scrapbox.
		Someone is printing and cutting.
			[Organize Scrapbox using the KJ method by Reading Monkey].
			It should be the same as me printing and cutting slides at 25up, it should be a hassle.
			Can it [look as good as Scrapbox]?
