Anti-Howling Measures for Zoom
With videoconferencing tools such as [Zoom], feedback can occur when there are multiple users in the same room. The causes and workarounds are described.

The videoconferencing tool records sound with a microphone, sends it to the server, and plays it back from the speakers with a slight delay. Since feedback occurs when the sound from the speaker enters the microphone, the videoconferencing tool internally cancels out the sound it produces so that it is not picked up by the microphone.
[https://gyazo.com/ce65e4d85cea29019c72cb8b79bc306f]

However, if there are multiple users in the same venue, and each of them emits their own sound through the speakers, another user's microphone will pick up that sound, causing feedback.

[https://gyazo.com/403f2161cde8ec8a56613321b005a19d]

There are several easy ways to prevent this.
One is that all users in the same room use earphones. By making sure that only you can hear the sound, another person's microphone will not pick up that sound. It is better to use a headset that also includes a microphone so that you can record with your mouth.

[https://gyazo.com/69441c863eacabdc33296359818cbb07]
This measure may be difficult to take.
For example, if there are more participants in a meeting than PCs connected to the videoconference, especially if the participants are sitting scattered in a classroom, the sound will be turned up loud from the speakers and heard by several people. (1)
[https://gyazo.com/658b283561c2b7b46769f92520c68a74]

If this one unit is used, feedback will not occur, but if the relay PC is a laptop, the built-in microphone is designed for a person sitting in front of the laptop, so it can only pick up sound from the front direction. It is difficult to pick up questions from the entire classroom. It is easy to operate with the questioner coming near the microphone, but here I thought, "If I connect my smartphone to the videoconference, can't I use it as a hand-held microphone?" If you connect your phone to the videoconference microphone, feedback will occur. (2)
[https://gyazo.com/c6f1b43858bd7025803f4e59c763fb12]

In that case, at a minimum, the speaker on the relay machine should be muted. (3) Also, even in that situation, the microphone on the relay machine should be turned off as well, since the remote participants will hear an echoed sound with different delay between the phone and WiFi. (4)

[https://gyazo.com/9756fddecc6f2251f5d481cdbb5f4b49]

It depends on the situation at the site whether the operation where the speaker comes to the microphone or the operation where the speaker and microphone of the relay PC are turned off frequently is better. If a better operation is found, I will add it.
https://www.facebook.com/nishiohirokazu/posts/10220887052902633
