Diary for February 2020
In February 2020, a pandemic of a new coronavirus caused the company to work fully remote and various events to be held online.

(3/11) What I am seeing and hearing now, and what I have experienced in the past few weeks, especially with regard to "the experience of replacing conventional physical assemblages without physically assembling," I felt I had to record my impressions while they are fresh.
	What we are experiencing now will surely influence the shape of society 10 years from now.
　[https://gyazo.com/ae17de56158a06b3343fe05b76dbd528]
　[https://www.facebook.com/tsubasa.yumura/posts/3216717981691343 Tsubasa Yumura] Reprinted with permission
	　Nine years ago today, on 2011-03-11, there was the Great East Japan Earthquake.
	　What happened at this time was the catalyst that pushed companies such as Cybozu strongly toward remote work.
	　What happened this year will cause a similar phenomenon.
		At that time, this record will serve as a resource to look back on the catalyst for change.

Unorganized below
This page is
	First, let's look back at the events to date from my perspective as of 3/11.
	　Timeline.
	　Initially, I was going to leave out the coronavirus story.
	　are intertwined, so I will write them in chronological order without separating them at this time.
	　Only the useful parts can be taken out in the future.
	Then we'll add to it until society returns to normal.
	If the volume becomes too large, divide pages as needed.
Organize with a policy of

---
The new coronavirus was announced as a confirmed human-to-human transmission on January 20
On January 24, I don't particularly care. I go to work via Tokyo Station.

2/14-16
	Attended a welcome party for new employees on February 14
	15, 16 (Saturday and Sunday), participating in the Unexplored Demo Day.
 　I remember feeling a little uncomfortable going to places where people gathered.
 　[Ministry of Health, Labor and Welfare on 2/14 https://www.mhlw.go.jp/stf/newpage_09531.html] Over 1,000 dead in China, 1 dead in Japan, partial disembarkation from cruise ship
 　 At the time, I was thinking, "But I can't afford not to go.
 　 I think it was something like, "The only people with a higher mortality rate are the elderly.
 　A sense of urgency is heightened after hearing many stories at the reception.
 　　Will the March 10 Unexplored Conference be held physically? The question is
 　　Acquisition of the concept of medical collapse
 　　　It doesn't matter how many deaths you have, you have to reduce the opportunities for people to be in concentrated contact with each other.

17-20
	Originally, Monday and Wednesday were off in lieu of working on weekends and holidays, but I thought a lot about it on Monday the 17th and started working from home full time early in the morning on the 18th for now.
	>Tuesday, 2/18/2020 5:56 p.m. I will be working from home on Tuesday, on Wednesday I will be working in lieu of a holiday, and on Thursday I will be working from home.

Friday, 21st
	There are study sessions and regular meetings at the lab, which I physically attend.
	This was my last day at work.

24-27
	The following week, he worked from home all the way through Thursday.
　I had planned to come in on Friday because the lab's study session was my responsibility.
　However, on the evening of Thursday, the 27th, a notice was issued stating that, "In principle, avoid contact within 2 meters and for more than 30 minutes (intense contact).
　　Until then, "telecommuting was encouraged," but from the 28th, "the general manager must deem it necessary to have intensive contact.

The problem here is that the monthly meeting of the Unexplored Association, METI, and IPA was scheduled to be held on March 3 in a conference room at Cybozu
　Definitely falls under the category of "intensive contact".
　Mr. Kawai noticed this before I did and asked me about it, and we started the process of checking with METI and IPA to see if videoconferencing was possible.
	Sakura Group also went to telecommuting in principle at a time when it was not much different. Unable to provide meeting rooms.
　Confirmation results →.
　 With Zoom, it's possible because you can do it with just a web browser.
　 Pre-sharing materials because screen sharing is not possible.
　 No camera
　I didn't think it was a good idea, but surprisingly it turned out OK.
　Nishio will wind up around Zoom due to Mr. Kawai's day off.
　　Originally, the Unexplored Foundation's stand-alone meetings were basically online, with me hosting Zoom.
　　Just two of those, I thought.

Friday, February 28
　Study sessions and regular meetings are held online
　Full Remote Mob Pro
　　The plan was to try mobpro, but the day before the event, we were not sure if it would work or not, but why don't we give it a try? So we decided to give it a try.
　　If I'm giving a lecture, I'm talking one way, but I'm worried about not getting feedback from people who are watching at these meetings.
　　Posting in chat rooms, sharing the screen with the person you're talking to is hard to notice.
　regular meeting
　　I mistakenly thought it was text reporting only, not video conferencing.
　　Therefore, he was in an environment that did not allow for voice.
　　Connect to a video conference without audio
　　I wrote a note saying that I couldn't play audio, but they didn't notice and thought I was leaving the room.
　　Communicate by writing on the shared screen with Zoom's annotation function.
	Unexplored Conference Announced to be Held Without an Audience

2/28→3/2
	([friend only https://www.facebook.com/satoshi.ohshima.7/posts/2992692367440453])
 　In response to a friend's comment about whether the environment is conducive to teleworking in response to reports of tens of thousands of people working remotely in the city center.
 	>I haven't been in the office even a day this week, but at least Cybozu was able to go remote during the disaster, and since then we have solved the various problems we experienced at that time, so things are in place without any major issues. I think the turning point for companies in Tokyo was the earthquake.
 	>"I want to do remote access during the earthquake and tsunami, and I want to use VPNs for simultaneous connections! I want to have voice communication with multiple people! Then, the number of connections was increased, all employees were using Zoom Pro, PCs for home use were distributed, and so on.
 	>I like this kind of know-how, it's easy to imitate when it's all in one place.
 	>But this time, it was a case where the physical infrastructure of society was the cause of the problem, but this time it is people who are the cause of the problem, so there seems to be a challenge for salespeople. In this respect, it is easy for R&D workers like me.
 	>This was somewhat summarized [The "environment" and "scope" required for remote work--a checklist - TechRepublic Japan https://japan.techrepublic.com/article/35144617.htm]
 	As of the 28th of the month I wrote this, I thought "most of the time you can work remotely, except for some types of jobs where you have to go to the site to do it."
 	　Yahoo is planning to work remotely throughout the company for the Olympics, and they've moved it up.
 	I was surprised to see a report on 3/2 that "estimates that 19% of Japanese companies have a telework environment.
 	　Apparently 85% in the U.S.
 	　The new Corona will be a catalyst for teleworking."
 	　　Wasn't the earthquake 9 years ago a trigger?
 	　　I thought the time frame was 9 years off from the majority of the world's population.

March 3
	Monthly meeting of Unexplored Corporation, METI and IPA
	I had a wide schedule so that I could come in early and wait for the meeting, which caused an overlap in the schedule, and I don't know if that was the cause, but it was the first time I, as the host, was unable to "get into the meeting".
	　I made sure that I had the option to join before the host, so I was able to proceed without me, and I went to reboot the machine.
	　At the regular meetings of the MISHOP, Mr. Arakawa, who was not the host, often facilitated the proceedings, so it was decided that he could be entrusted with the job.
　There were some problems with feedback between machines in the same room, and problems with not picking up the voices of people who were far from the microphone, but they were not major problems.

March 4
 Tokyo Tech CUMOT
 	>Today is the final presentation day of the 4th term of the cumot Startup Design Course at Tokyo Institute of Technology. With the rapidly changing situation, we have made it possible to participate online after much thought, discussion, and coordination with various parties. This is the first time in the fourth year that we are holding the final presentation that way. [Facebook https://www.facebook.com/1505859477/posts/10218412887142592?d=n&sfns=mo]
	[Zoom's Anti-Howling Measures]
　　If you just want to relay your presentation, you can use Zoom without installation on a loaned laptop.
　　Microphone only picks up the front direction, so there are problems picking up questions from the audience.
　　When I turn on the phone's microphone to pick it up, I get feedback.
	The Zoom connection in a situation where "sitting in a large venue with spacing" is being done locally, again via a browser without a single laptop installed, picking up the presenter's voice was fine just by keeping the laptop pointed that way, but the problem was the questions in the venue. If you don't at least point the relay machine toward the person speaking, the voice from diagonally behind won't get in at all.
		At this point, an attempt was made to connect to the Zoom from a handheld phone and turn on the microphone, but feedback occurred
		The problem of microphones in large venues is still in the process of finding an inexpensive solution. With Cybozu, for example, there are a number of microphones hanging from the ceiling of the room, but that is expensive and it is most unlikely that a university classroom will be in that situation.
		Putting a 360-degree mic in a conference room is well done, but I haven't tried it to see if it can go as large as a classroom.

March 6
	Cybozu's front-page ad "Ganbaruna, Nippon
		>"Ganbarunna, Nippon," some people might be offended by the literal meaning, but "Why don't we stop forcing people to go to the field by "ganbari" or "air" in cases where it is physically unnecessary to go to the field?" That's what it means [Facebook https://www.facebook.com/1129148772/posts/10220896718024255?d=n&sfns=mo].

Regular Cybozu Labs meetings
　Raccoons become raccoons with FaceRig!
	　I was going to add FaceRig, too, but realized the same day that it didn't work on my Mac.
　FaceRig is good for enhancing facial expressions.
	At a company meeting, I observed people participating in animal avatars with FaceRig. Even if it is not a real face, there is no real harm, and in fact, it is good to emphasize facial expressions. In the world, people use virtual backgrounds or make-up faces even if they are not wearing makeup, but this method transmits neither the background nor the real face, so I thought this would be better for situations other than those where exposure of the real face is required.
	As the conversation got a little crowded in a company meeting, I tried to organize it by writing on the screen from my iPad using Zoom's annotation feature. There is still room for improvement in Zoom's current functionality, but it is definitely better than verbal-only communication.

March 7
 [The world's first academic conference event in a virtual space using cluster will be held tomorrow, March 7 (Yuki Igarashi) - Personal - Yahoo! /?fbclid=IwAR2oLqktdhRPkUIqiAMaJdBkDTI1JPnjlYbPUfd6whUZE0fQTukPNvbq53c]
	Information Processing Society of Japan
	[https://gyazo.com/5f5fcbc88e5b78358fe33fcfdf459ead]
		It's getting to the point where I'm starting to feel like I'm going to have to live without "my avatar".
	[Facebook on the day https://www.facebook.com/1129148772/posts/10220904243092377?d=n&sfns=mo]
 	[https://gyazo.com/132f8b5b9d75544e871cc28b088096e9]
 		Those who have their own bodies and those who don't...
 		I can crack up when I press the clap button, I see. A system that allows people who are listening to give feedback without interrupting the person who is speaking.
 		I like the openness of limiting the range of movement to space instead of walls.
 			[https://gyazo.com/7a50f236b6d61d3723b831cb05c37aa0]
			Communication style: the right to speak is passed on to the person who presses the "surprise" mark on the floor.
			It's interesting that the panelists are starting to experiment, you can survey the audience with psyllium, which is more informative than a regular hand raise.
			I created my account in a random way, so my avatar doesn't even have a face picture, but sometimes I see someone with a familiar icon walking by.
			I'm not sure if I should be able to give negative feedback (when the audience says "I don't know, I want a way to express that I don't know"), and it's not really necessary in use cases where psylliums are used a lot, but I think it would be nice to at least have a hatena for the class. I think we need to be able to change the palette of emoticons depending on the situation.
	[https://gyazo.com/907071f9608d60aeb9def7fb27caeea0][https://gyazo.com/06c10b616da1efcaf65114610a79b3e9]
		Dr. Inami suddenly becomes huge.
		grandiose
	I'm still new to VR and found it hard to recognize non-humanoid objects as human. I didn't realize that triangles were human (even though triangles shouldn't be placed or moving for no reason).

March 10
	Unexplored Conference Night
	[Facebook https://www.facebook.com/1129148772/posts/10220938580950802?d=n&sfns=mo]
		I had a headache from noon, probably due to the low pressure, and headache medicine didn't help, but I was able to watch the Unconference/Night from beginning to end while lying down in the middle of the program, so personally, online participation was easy and helpful.
	 I passed on the Zoom get-together because it was too hard for me, but there seemed to be some rooms that were well matched and had a lot of fun, and others that didn't go so well and were scattered. I wish there was a way to hang around like a physical get-together.
	 I have seen some people say, "I usually can't participate due to time or geographical problems, but I can participate in this event.
		I've observed that when matching on Zoom didn't work (no people here, people here), the exchange of information was happening simultaneously on Mattermost, Slack and Facebook, so I guess that's where the need is.
			Would it have been better to have one channel of chat available without registration?
		(I called him on the Synchronization Slack and heard him talk about getting together with his peers.)
			It's just a replay of the human network that already exists.
			It seems that those who are not well placed in such a network are not able to make it work.
			I think that is one of the functions of a social gathering and I would like to do something about it.
		Fusion of physical and digital
  	I think [the alter ego robot] was well done.
  		It's easy to tell at a glance if someone is inside or not, and who is on site.
  		The neck moves with the camera, making it easy to see where the person inside is gazing.
  		　Locals can easily know if they are being watched.
  		I get a strong sense of "not being able to move my body" when I'm in a computer that's popped up in the hall.
  		　I like to look around when there's nothing in front of me.
  		　This natural desire cannot be fulfilled.

March 11
 [Facebook https://www.facebook.com/1129148772/posts/10220942898218731?d=n&sfns=mo]
 	I felt I had to record my impressions of what I have experienced in the past few weeks, especially with regard to the "experience of replacing conventional physical assemblages without physically assembling" while the impressions are fresh.
 	In 80% of the world, apparently, you can't work remotely, but in the 5 meters around me, it's "a month where we focus our wisdom on using technology to create a better experience, with the basic premise that we don't physically assemble".
 	My own last day of work was February 21, and the company announced on Thursday the 27th to avoid unnecessary and intensive contact, and the majority of people working in the Tokyo office have never come to work since then.
 	All Cybozu employees have a Zoom Pro account, so they often experience the host side in these situations, such as meetings with external parties or live broadcasts of events.
 	Yesterday's unattended conference night was held without an audience, and apparently even those on site were not allowed to applaud.
 	 In a recent public session of the Information Processing Society of Japan held in a VR space, participants were able to press the clap button at any given moment. The latter applause was loud enough not to interfere with the presenter's presentation, and was displayed emoticonically overhead, not just as a mere sound.
 	 The problem of turning off the microphone and making it easy for the listener to become airborne is solved by lowering the feedback threshold for the listener.
 	At yesterday's Unexplored Night, the reception was replaced by the use of multiple Zoom rooms, and this seemed to work well in some rooms and not so well in others. A system had been introduced whereby people were matched according to keywords of interest entered in advance, but the rooms of those who did not enter any keywords were successfully wiped out.
  	In three chat rooms and social networking sites, "There's no one here" and "Where is everyone?" were the types of conversations we observed occurring.
 	 In the real world, information is communicated that "people are there" without words being exchanged, but this operation did not convey this information.
 		I was told that if you have a get-together by videoconference, you can extend it arbitrarily without having to find an after-party venue. But I'm not sure that would require a longer meeting reservation for the get-together.
 	Both "there's someone in that conference room" and "VR applause" mean we need an easy way to share information that isn't through speech.

	March 11 (In response to a friend's call for a physical get-together) (in response to a friend's call for a meeting)
	 Nishio: Well, the physical set is a bit difficult.
  Tachikawa ...... gogogo ...... (Oh? Sounds like the existing definition of "set" is shaky)
  Nishio No, no, no, I know 80% of the world hasn't shaken yet, but 5 meters around me has been shaking for weeks lol.
  Tachikawa: Mr. Nishio's observation range is biased, so w
  	No, no, there is a bias in the scope of all people's observations.
  Nishio: As far as I can observe, the majority is "a month to think about how to create a better experience using technology, based on the basic premise that we cannot physically assemble".

	March 11 CUMOT SUD Final Lecture
		Ask the TA to try the operation "When the audience starts asking questions, point the relay machine toward the person who is speaking.
		I could hear the audience just fine...
		　TAs are too busy when they start speaking alternately with the audience, lecturers, and
		　Naturally, the screen shakes while moving, and there is noise in the audio.
		　I think the right thing to do would have been to fix the slide at an angle of view that would include the venue and the lecturer when the lecturer stopped using it, but I didn't realize it until just before the end and couldn't give him instructions.
		People with muffled speech are hard to hear in a videoconference in the first place.
　https://www.facebook.com/1505859477/posts/10218510036971277?d=n&sfns=mo


March 12
	>If no treatment is found, 60-70% of the entire German population could be infected... He stressed the need to slow the spread of infection to buy time so as not to overburden the medical system. [German Chancellor Merkel: "60-70% of the entire population could be infected" with the new corona (Photo: Reuters) :The Nikkei https://www.nikkei.com/article/DGXMZO56691720S0A310C2000000/]
	When I saw that several other sources suggested that the problem might not be resolved in the short term, I began to think that "suspend activities until it's resolved" was not realistic, and I started looking for ways to avoid intense contact and not suspend activities.

March 13

[March 2020 Diary].




Observation coverage issues

breakout room
https://www.facebook.com/1129148772/posts/10220871131704613?d=n&sfns=mo

Phone bill for ZOOM
https://www.facebook.com/1129148772/posts/10220869950115074?d=n&sfns=mo


