Fend off a zombie virus pandemic!
Simulation game against infectious diseases made using [hack for play https://www.hackforplay.xyz/]
[https://gyazo.com/bd499be1cd60f8ec23d2596d4dc41919]

Original story Simulation of coronavirus infection
　https://www.washingtonpost.com/graphics/2020/world/corona-simulator/

release order
	[Fend off a zombie virus pandemic! https://www.hackforplay.xyz/works/8m1oVEVtwQF9bCoI81L2]
	[Fend off a zombie virus pandemic! (Much harder) https://www.hackforplay.xyz/works/VTwxsucp8fpUEKla24rU]
	[Fend off a zombie virus pandemic! (It's hard to do, but there's money to be made) https://www.hackforplay.xyz/works/6dYsE3IKBNuQLzoK6APp]
	[Fend off a zombie virus pandemic! (fast footed) https://www.hackforplay.xyz/works/8GvjhI017vG0HW2cUqYn]
	[Fend off a zombie virus pandemic! (fast on your feet & no money) https://www.hackforplay.xyz/works/0euxeUGx0m5PB82nqhFX]
	[Fend off a zombie virus pandemic! (coming to you) https://www.hackforplay.xyz/works/O0irEvZAzDsvYoigZX61]
	[Fend off a zombie virus pandemic! (Zombies coming to you) https://www.hackforplay.xyz/works/yVDx6LZzyYKfeDDoJ46v]

Assuming early elementary school students, we made the game so that they would know how to win in two or three times after seeing the game become a pandemic once, but they commented that it was "too easy," so we created "Muzukashii" (difficult). Since it was too difficult, we followed up with "Muzukushi but with money," which loosened the money restriction and was released later.

In order of easiest to hardest
	[Fend off a zombie virus pandemic! https://www.hackforplay.xyz/works/8m1oVEVtwQF9bCoI81L2]
	[Fend off a zombie virus pandemic! (coming to you) https://www.hackforplay.xyz/works/O0irEvZAzDsvYoigZX61]
	[Fend off a zombie virus pandemic! (fast footed) https://www.hackforplay.xyz/works/8GvjhI017vG0HW2cUqYn]
	[Fend off a zombie virus pandemic! (It's hard to do, but there's money to be made) https://www.hackforplay.xyz/works/6dYsE3IKBNuQLzoK6APp]
	[Fend off a zombie virus pandemic! (Zombies coming to you) https://www.hackforplay.xyz/works/yVDx6LZzyYKfeDDoJ46v]
	[Fend off a zombie virus pandemic! (fast on your feet & no money) https://www.hackforplay.xyz/works/0euxeUGx0m5PB82nqhFX]
	[Fend off a zombie virus pandemic! (Much harder) https://www.hackforplay.xyz/works/VTwxsucp8fpUEKla24rU]



Game design (spoiler alert)
	No direct attack power against zombies
		Even with real-life coronaviruses, effective treatments have yet to be invented.
	Attacks from zombies are effective.
		If you get sneezed on three times, game over.
		In real life, medical professionals get infected, and when they get infected, there is a medical collapse and it's game over.
　Zombies heal over time if left alone.
　　Rest and wait for recovery, even in reality.
　No one is immune in this game.
　　So the ping pong infection occurs and no matter how long you wait, the zombies won't be wiped out.
　　Unlike in reality, there are only 10 people in the game, so if you don't do this, the game won't work.
　An effective way to annihilate zombies is to quarantine them.
　　If the zombies don't spread the infection, it will heal completely over time.
　　But this costs coins.
　Coins increase slowly over time (this is fantasy).
	People don't die.
	　With real-life coronavirus, infected people can die, but, well, it's a game, so I made it a fantasy.
 Once placed, the coins cannot be retrieved, but instead do not disappear.
 　Real-life segregation policies consume money over time, so here is a game-like fantasy

Designing for "difficult".
[Fend off a zombie virus pandemic! (Much harder) https://www.hackforplay.xyz/works/VTwxsucp8fpUEKla24rU]
	We doubled the number of people to 20.
		When the number of people doubles, the interaction quadruples.
		It also hinders player movement.
	The initial zombies were now three, and also geographically dispersed.
		I can't just rush in early and contain it with my initial funds.
	Money cannot be saved.
		As before, funds are recovered once every 5 seconds, but the behavior is "if the money is 0, it becomes 1".
		It will not be possible to isolate all at once with money hoarded over time.

[Fend off a zombie virus pandemic! (It's hard to do, but there's money to be made) https://www.hackforplay.xyz/works/6dYsE3IKBNuQLzoK6APp]
It's hard, but I have the money."
	I stopped just saying "money can't be saved."

[Fend off a zombie virus pandemic! (fast footed) https://www.hackforplay.xyz/works/8GvjhI017vG0HW2cUqYn]
　Same 10 as without mark.
	Both zombies and citizens are fast on their feet.
	No attack action, so citizens move faster than zombies.
	　As a result, they come in contact with zombies and become infected.
	　It's so annoying...
	There's enough money to play with, so if you play it calmly, it's not that hard.

[Fend off a zombie virus pandemic! (fast on your feet & no money) https://www.hackforplay.xyz/works/0euxeUGx0m5PB82nqhFX]
	Added "money cannot be saved"
		I made it a little gentler by making it a 3 second recovery.
	Personal just barely level.
	　Once I read the zombie behavior patterns, I managed to...
	　If you manage to stop a citizen who tries to rush at a zombie by bodily contact...
　I still have the hardest time not having money.

[Fend off a zombie virus pandemic! (coming to you) https://www.hackforplay.xyz/works/O0irEvZAzDsvYoigZX61]
	Citizens come by.
	Not difficult.
	Citizens who hang around doctors when they are healthy are disturbing and annoying.

[Fend off a zombie virus pandemic! (Zombies coming to you) https://www.hackforplay.xyz/works/yVDx6LZzyYKfeDDoJ46v]
	Zombies actively pursue nearby citizens.
	　The legs are slow, so they won't catch up, but isolation early on will be more difficult.
	　However, when citizens are safely quarantined, zombies scurry around them.
	　This has its advantages, but it's also a headache to deal with when clusters of zombies form.
	More zombie-like, but not Corona-like.
