The good thing about esa
	Promote [sharing written material].
	Anyone can edit what is shared.
	　Edits are revision-controlled, so you know who made what changes.
	Notification will fly when the finished draft is ready.

The good thing about [esa

This was a factual error.
	[Editorial rights exclusive to the individual].
		Viewers can [suggest modifications

I mentioned in [publish draft] that notifications of drafts don't fly.
今回の差分
　Would you prefer an "edit suggestion" or a "co-edit" for a draft?

---log
	[tokoroten.icon] "Why don't you implement esa at my friend's company?" I was trying to verbalize what esa is good for in order to make a proposal, but when I thought about a world without esa, I realized that even for a single report, the format is so tacit knowledge that a newcomer can't write even if given only WORD [src https:// twitter.com/tokoroten/status/1240124070982823937]
	[nishio.icon] I don't know what you mean by "think of a world without esa, and the format of even a single report becomes tacit knowledge", so I don't think that explanation will get the point across.
 [tokoroten.icon] 
 	If the various reports are scattered across personal desktops and shared folders, the cost of finding them is extremely high.
 	Having the report in an easily viewable location will formalize the report and help the newcomer get up and running faster.
 	Like this? Is it because I used tacit knowledge in a negative sense, as in "only some of the existing employees know about it"?
 [nishio.icon] 
 	It appears to speak to the benefits of "information being shared".
 	It's bad enough that it's "dissipating" and doesn't speak to any esa-specific benefits.
 	For example, if someone I meet for the first time says, "I've been to Cybozu before," I search Garoon by their name to discover their report.
 [tokoroten.icon]
 	I guess the difference between esa and other CMS is that esa can currently publish articles in WIP.
 	The system provides an atmosphere in which it is acceptable to put out something unfinished.
 	The rest is edited by the article owner and PR.
 	With a wiki, it looks like it belongs to the company, and then the wiki police show up to point out the content and choke it off.
 [nishio.icon]
 	in other words
 		The design design promotes the sharing of written material while still attributing it to the individual."
 		Since it's attributed to an individual, unlike a wiki, which is attributed to everyone, others will submit suggestions for revision to the author rather than suddenly rewrite it."
 	You mean...?
 [tokoroten.icon]
  Yes, that is the reason for the recommendation.
  That's in depth, though, and I'm sure the reasons for the recommendation on the surface will help prevent dissipation.
 [nishio.icon]
		If it is just "sharing what you are writing," it can be applied to Scrapbox, etc., but "the editing rights belong exclusively to the individual at the stage of writing" is certainly an interesting point.
  Conversely, a system that notifies others when a draft is published is undesirable because it reinforces the practice of "not publishing a draft and then submitting it after it has been completed.
 [tokoroten.icon]
  Yes, I think it is well done because the notification flies when the finished draft is ready.
	 And then there's Markdown, so it's a hierarchical way of thinking about things,
	 Is it a cost savings in running the workflow in github afterwards?
  I would recommend such things to previous companies.