Need large sticky note
2020-03-24
	Essentially, don't we need "[big sticky note]"? I'm starting to get the feeling that we do.
	I was of the opinion that stickies with a fixed font size that changes size depending on the amount of content should not be allowed.
		So I've stuck with fixed size stickies.
		But it's not "being a fixed size" that's important.
	Sticky notes with a lot of text are unsharpened sticky notes.
		And yet, with fixed font size, those stickies stand out.
			see [what happens when font sizes are aligned].
		Conversely, a concise sticky note does not stand out.
		This is not correct.
		It's not a good idea to prevent eye control over what needs attention.
		This is the essential objective, and "fixing sticky size" is a means to an end.
	The one I made before didn't have the ability to fold groups yet.
		I added a fold function this time, but it doesn't feel right.
			It should be an important function if you think about it logically, but why not?
		That's because "folded stickies" are the same size as "unfolded stickies."
			As a result, it is less noticeable when folded
		It's funny that a group of multiple stickies created in a structured way is more valuable than just a single fragment, yet they are the same size.
		They were not folded, but unfolded and surrounded with a pen or added explanations with a pen.
		This was subconsciously avoiding "folding it up to make it less noticeable."
 What happens if the folded item is as large as it was before it was folded?
 	Zoom out to list its large stickies.
 	Then stickies that are not allowed to be in a group will become smaller and less noticeable.
 	This is correct.
 In addition, the problem of "when folded and unfolded, it covers other things" can be solved by separating "fold" from "make smaller".

→The sticky note enlargement function is more beneficial than expected.

2021-06-23追記
　Sticky note enlargement is useful
　I don't think the folded item you wrote above should be "the same size as it was before it was folded".
　　eat up a lot of space
　　I like "[folded items] get one step bigger."

[pRegroup2020]
