80% have mild disease = 20% have difficulty breathing
Check what the definition of "minor illness" was in the information source for the simple innuendo that "80% of the cases are minor."

>Mild included non-pneumonia and mild pneumonia cases. Severe was characterized by dyspnea, respiratory frequency ≥30/minute, blood oxygen saturation ≤93%, PaO2/FiO2 ratio <300, and/or lung infiltrates >50% within 24–48 hours. Critical cases were those that exhibited respiratory failure, septic shock, and/or multiple organ dysfunction/failure.
	[The Epidemiological Characteristics of an Outbreak of 2019 Novel Coronavirus Diseases (COVID-19) — China, 2020 http://weekly.chinacdc.cn/en/article/id/e53946e2-c6c4-41e9-9a9b-fea8db1a8f51]

The definition of mild disease is "no pneumonia or mild pneumonia symptoms" and this alone is difficult to visualize.
You can look at the definition of what is not a minor illness (severe or serious).
Severely ill (6168/44415, 14%) are
	dyspnea
	Breathing more than 30 times per minute
	Blood oxygen level below 93
	The partial pressure of arterial oxygen relative to inhaled oxygen is less than 300 (what's the unit?)
	Pulmonary infiltration >50% at 24 to 48 hours
Severe (5%) are
	respiratory failure
	septic shock
	Multiple Organ Dysfunction or Multi-Organ Failure

Eighty percent of the patients were mildly ill" meant "20 percent of the patients had difficulty breathing."

---

>Expert: "There is no need to be overly fearful"...Few cases of death, 82% minor illness.
> 2020/02/14 08:53
> Experts call for a calm response to the situation of spreading infection, including the first confirmed death of a patient infected with the new coronavirus in Japan, saying that there is no need to be overly fearful.
> At this time, many people infected with the disease are only mildly ill. According to the World Health Organization (WHO), in an analysis of approximately 17,000 infected persons, 82% were mildly ill, 15% were severely ill, and 3% were seriously ill.
> Fewer cases result in death. The fatality rate in mainland China was 2.29%, based on a report by the Chinese government's National Health and Health Commission on March 13. However, the rate is much lower at 0.49% in areas outside of Hubei Province, where Wuhan City is located. At a press conference on April 4, the committee announced that about 80% of those who have died in China so far were over 60 years old, and about 75% had underlying diseases such as heart disease or diabetes.
	[Expert: "No need to be excessively afraid"...Few cases of death, 82% minor illness : Domestic : News : Yomiuri Shimbun Online https://www.yomiuri.co.jp/national/20200214-OYT1T50068/]
