Diary for April 2020
[https://gyazo.com/420d43432faf79fd1813d0975cf14179]
	https://twitter.com/computerozi/status/1245905241209364483?s=21

>I should probably buy a headset or something.
	https://www.facebook.com/nishiohirokazu/posts/10218453802112884

Virtual Background
　[https://gyazo.com/8c784d2a2aa8a8e2d4486aefcd5605ac]
	https://twitter.com/britishmuseum/status/1245350350485405697
		大英博物館
		Various places started handing out backgrounds.

[Diamond Princess Boarding Memoirs (Diamond) - Kakuyom https://kakuyomu.jp/works/1177354054895024939?fbclid=IwAR2X5rFzcTYl_mzLoe1Izw00jDprAbBoYqzDSgQ6I9 orcPZdkhcn_aCdFd0]

4/3
>The rumor that just using Zoom is enough to steal Windows passwords, a clearly untrue rumor, and not a good one in terms of unnecessarily raising concerns.

[お花見シーズンの上野公園、若者は行動を自粛していた - Rei Frontier Tech Blog https://tech-blog.rei-frontier.jp/entry/2020/04/01/204833?fbclid=IwAR3x4oRND5VywmJh4_DGCjc9xDY0eyWKTaqH01T2O7FXjFLo0NomMWqg6tg]
> When the cumulative time spent in 2019 was set at 100, the cumulative time spent in 2020 decreased the most among those in their 30s (16), while the cumulative time spent increased from last year among those in their 60s (107). The trend is that older visitors are spending more time in the city.

4/5
>NY City of NY tells schools to stop using "Zoom" due to safety concerns.
	I don't want you to be overly fearful of something that is not much of a risk and suddenly take away options that the field can take, because it will exhaust the field... [src https://www.facebook.com/nishiohirokazu/posts/ 10221232129969344]
→ [videoconferencing security].

Article on the relationship between BCG vaccine and COVID-19 (preprint)
	https://twitter.com/tsuyomiyakawa/status/1247100721314455552?s=21
　At this point, I'm reading this with half an eyebrow raised.
　I was 90% spitballing in the early days, but I think I'm getting better.
　The reason for controlling the infection is unclear, but I see what you mean about reducing the progression to pneumonia after infection.
　It has been announced that at this time, there is no surplus, as it is only produced for the vaccination of infants, so adults are not allowed to ask for it.
　　Even if it were likely to be effective, the public shouldn't panic because they'll first hit the medical personnel who can be properly traced & are at high risk of infection.
　Reported that no difference was found between the age group that was eligible for vaccination and the other age groups.
　　https://twitter.com/mixingale/status/1246697890640064512?s=21

Risk of internet outages
	https://www.facebook.com/nishiohirokazu/posts/10221253109333815
	Internet load has increased by about 20%.
	https://eng-blog.iij.ad.jp/archives/5536
	>Wouldn't it be more of a concern that the end of the line would be shredded by a weak IT router running out of gigs or a thermal runaway rather than a fat line to/from a foreign country?
 > While the line is still healthy, we should open another route that is text-based and does not eat bandwidth so that videoconferencing and voice calls will not be impossible.

[For safe online lectures using Zoom].

I started drawing the idea of making a [virtual background video for Zoom].

[About 27,000 people nationwide "continue to have fever" Health Ministry and LINE survey | NHK News https://www3.nhk.or.jp/news/html/20200410/k10012381141000.html]
>The national average percentage of those who reported having a fever of 37.5 degrees Celsius or higher for 4 or more days was 0.11%, or more than 26,900 in number.
>0.23% for groups in occupations where it is difficult to avoid prolonged contact and crowding with people, such as restaurants and outside salespeople.
>0.05% in groups where it is relatively easy to avoid human contact, such as those who stay at home to do housework and raise children.

https://twitter.com/hayano/status/1248737163249737730?s=21

[Apple Watch]

[AutoSleep]

[Withing+]

料理
https://www.facebook.com/nishiohirokazu/posts/10221391910523758

AirPods Pro
https://www.facebook.com/photo.php?fbid=10221439131304248&set=a.1175498944176&type=3

https://twitter.com/okabe_/status/1261114662776565761?s=21
