For safe online lectures using Zoom
Center for Information Infrastructure, The University of Tokyo 2020.4.6 [PDF https://apps.adm.s.u-tokyo.ac.jp/WEB_info/p/pub/5756/Zoom.pdf]
It's a concise summary of what to watch out for when using Zoom.
The second half of the article contains commentary regarding recent falsehoods and misinformation about Zoom.

To further summarize.
	Security issues with Zoom's software, etc.
		All have been addressed.
		Software updates are important.
	How to prevent outsiders from entering lectures
		a) Limited to those who have signed in to Zoom with their university email address using Zoom's authentication feature.
 	b) Ensure that third parties cannot know or easily guess the information necessary to access Zoom meetings.
 	a) is the original measure
 		However, students are not made aware of how to participate in lectures in that way.
 		Choose b) to avoid the possibility of people who should be able to participate not being able to.
 	Specific method of b)
  	Set passwords for meetings
  	Place the meeting URL in a location accessible only to on-campus personnel
  		Not on publicly available lecture websites, etc.
   	Make sure that students do not send out information on social networking sites, etc.
   Change the meeting ID each time if possible

What to do if a third party joins an online lecture
	advance preparation
		Make the assistant a co-host.
		Only the host can share the screen.
		Do not allow "comments (annotations)
		Do not allow file transfers or chats between participants (private chats)
	Operation during meetings
　Deletion," which forces participants to leave
　The participant will not be able to participate in this meeting thereafter.
	 Locking the Meeting
			No new meetings will be allowed thereafter.
			Late students will not be able to participate.
		Stop participants from sharing screens.
	 Stop video transmission for individual participants
	 Mute all participants and make it impossible to unmute them
			If a co-host does, the host is also muted
			The [nishio.icon] host can unmute himself, but if he is in a lecture and concentrating on speaking, he may not notice that he is muted. Maybe co-hosts can specify lecturers and unmute them.
