After the first round of the 2020 Unexplored Junior
2020[Unexplored Junior] After the first screening

This is a 1PM opinion based on my review of the applications. I am not talking about a specific application, but rather about the characteristics I saw in several applications.

	Let's make it PDF
	　What is PDF?
	　　Portable Document Format
	　　A format that is intended to look the same regardless of OS (Windows, Mac, Linux)
	　Unexplored Junior solicitation instructs proposals to be in PDF format.
	　　But there were a few applications that were just Word files with the extension changed to pdf.
	　　This time I converted it back to PDF on my end, so it didn't affect the review process.
	　　But if the format is different from the specification, you can't complain about being ignored.
	　　I'm just pointing out that it would be a shame to be ignored when I apply for other projects in the future in my life.

	The title should be a one-line summary.
	　There were a number of applications with coined product names, something like "FooBarBaz (tentative).
	　The first place the reader sees the proposal is where it says what the reader doesn't understand.
	　Take a look at the titles of [past adopted projects https://jr.mitou.org/projects/]
	　I was thinking that maybe our side should add something to next year's application template, like "please describe your project in one line" or something like that.

	Let's consider making a video.
	　Seeing is believing.
	　Wouldn't images and videos convey the message better than words alone? Let's think about it.
		　Especially when there is a prototype
			　Sending a program or source code is no guarantee that it will work the same way it does at your end.
			　The program alone doesn't tell me what kind of behavior you want me to focus on.
		Modern OSes have a standard screen video capture function.
 	　[Windows 10 standard function "Win" + "G" key to capture video is too convenient! https://omoiji.com/windows10-movie-capture/]
 	　[3, 4, 5! What can macOS Mojave's new Command+Shift+5 command do? | Gizmode Japan https://www.gizmodo.jp/2018/09/command-shift-5.html]
			→[Shooting a demo video of an app with sound on a Mac].
　　YouTube
　　　The URL can be set to be visible only to those who know it (unlisted).
　　Gyazo GIF
　　　If you want to explain a little behavior, this is also easy
　 Dropbox
　 　Good for when you have multiple videos.
　 Just put the video and write the folder sharing link in the proposal.
　 Video can be replaced even after submitting a proposal (not possible with the top two).

	Let's dig into specifics.
	　There is a difference between speaking to people who don't understand technology and speaking to people who do.
	　When explaining what you want to do to someone who understands technology, don't look at articles on the Internet "for people who don't understand technology" and copy them.
	　Those articles don't tell the detailed story of "how it was accomplished." That's because "non-technical readers" don't want that information.
	　Instead, we use words (buzzwords) that even "non-technical readers" know and that have an air of new technology. The most popular word of the past few years has been "artificial intelligence.
	　I saw a proposal that said, "I will solve this problem with artificial intelligence! I saw a proposal that said, "Artificial Intelligence to solve this problem! That's amazing! I don't think, "Wow! I think, "How exactly is it going to do that?" I think, "How exactly is it going to be done?
	　Since you are the one who will do this project, you must be able to explain "what exactly you will do starting tomorrow".
	　Equivalent to Type 1 of [Type Advice to Contest Applicants], a common story.

[Tweet https://twitter.com/nishio/status/1251851917401047041]
	#The first round of the Junior Unexplored Competition is over, and just like last year, the competition is 3-4 times higher for the first round of written submissions and 3-4 times higher for the second round of videoconference submissions. Even those who made it through the first round should not rest easy, but think about what questions they may be asked about their project and how they will answer them. To be continued
	To those who failed the first round, this does not mean that we should not proceed with your project. We can't interview every project we want to support. After this PM will write a message or article on the rejected projects. We hope you will find it helpful and continue down the path you want to go down.
	Article by PM Teramoto
		[Here are the parts of the proposal that I thought were a waste of time. Adoption is, frankly speaking, a matter of luck. ｜Daiki Teramoto｜note https://note.com/teramotodaiki/n/n148d35899016]
	Video of Yaskawa PM
		https://twitter.com/yasulab/status/1251742999404396545
