Remo
[https://gyazo.com/a3ced4a18799178a0a4a9fbdcd99435a]
URL-sharing online conference tool
　Metaphors divided into tables and conversing there.
　　Some functions are suited for purposes such as having people discuss at the table in separate time slots. General announcements during individual discussions, timers, etc.
　Student account creation is required.
　　Looks like we need to prepare in advance so we don't get slammed right before the start.
　　Especially when there are many people with low literacy. There are a lot of messages in English.
　Image and sound quality is poor compared to Zoom

[Remo Comments]

	If you create an event called `nishiotest', the URL will be `https://live.remo.co/e/nishiotest`.
	　GUESS easy, but where to change?
	This is what happens when someone who is given this URL accesses it
　[https://gyazo.com/e2257e4d6a072c2c2ac8b7435ee4002c]
　When you press Join now, it asks for your email address or Google integration.
　[https://gyazo.com/b415033bb8877518e0d982e331527529]
　Enter your e-mail address and you will be prompted to create an account (if you already have an account, you will be asked for a password).
　[https://gyazo.com/e4351e4024566f457d77646a458cc1a7]
　When this is done, they ask if you want to turn on the camera, and if you choose not to, they say, "Really?" If I choose not to, they say, "Are you sure?
　　[https://gyazo.com/0720eabf496e1da63af6224bdb39b17f][https://gyazo.com/c8ece4ed51dec5986f5032d7431b0e09]

　　If you choose to turn on the camera, a dialog will appear asking for permission for the browser to access the camera and microphone
　　[https://gyazo.com/975b611cdfb44b8a938e081a83909f82]

　Once this is done, you can enter the room, but a Welcome Message will be displayed.
		[https://gyazo.com/24c8fc08433f2dcbdc2621ced1d17850]
		Customization is possible.
			[https://gyazo.com/e14fab9f2563a05c81daa4ff53b661d9]

	Seated at a table, able to watch the plenary presentations and talk with others at the same desk
		[https://gyazo.com/a3ced4a18799178a0a4a9fbdcd99435a]
	The host can press the Present button and can choose to start speaking immediately or count down for 30 seconds
	　30 second countdown is a good idea.
	　A 30-second countdown appears on the participant screen, which can be used to time the conversation to end.
		[https://gyazo.com/c9fcadceba6babbf7753957ba2b69a71]
	Here's a screen shot of the participants while the presentation is being given.
	　You cannot turn your own camera or microphone on or off.
	　I was thinking of a "video conferencing tool like Zoom," and when I entered the room as a participant, I was already in presentation mode, so I thought, "What? How are you going to get a picture of my face? I was like, "Can you hear me? I was in a state of "Can you hear me?
		[https://gyazo.com/df7be1301c2b6a5c9be03a178c288660]


It has a [sli.do]-like question poll feature.
	[https://gyazo.com/9f478827ffd7af4fe622fdfa3e9ddbde]
　While listening to the presentation, students can write their questions here or vote on questions written by others.

Whiteboard is Deskle
	https://deskle.com/
　Seems like there is not enough testing on the iPad.
　　Selecting the pen tool in Pencil on iPad, the pen tool is highlighted, but when you try to draw, it becomes a screen drag.
　　　If you choose the Pen tool with your finger and then draw with your finger, you can also draw with Pencil.

　There is a co-host-like function.
　　I couldn't find it easily and thought it wasn't there.

　No free plan
　　I see a lot of people saying that $50/month is expensive.
　　Whether it's expensive or not depends on the situation, but a lot of people seem to be mistaken.
　　Not "per participant."
　　[https://gyazo.com/1a21888d7c0a4f03e596fa29e2b6f191]
  Up to 1 event for up to 50 people at the same time for $50/month, up to 3 events for up to 200 people at the same time for $150/month


7-Steps to Creating Online Events That Rock! - Remo.co Virtual Events and Office space
https://remo.co/7-steps-to-creating-online-events-that-rock/


Zoom Teams Remo LINE 
https://www.facebook.com/groups/146940180042907/permalink/155847312485527/

[Tried Remo Virtual Office instead of Zoom https://www.creationline.com/lab/34198?fbclid=IwAR28HJTEfi_HbICqS-UDJ29FpL8mr62ZuPDidjKCLuOcTGOo0 osJIDhm4fI]
	Virtual Offices and Remo Conference are different

