Test writing things with voice input
2020-04-28 [voice input].
Scrapbox
>This is a test to write things with voice voice input.
> I'm lying down because I have vertigo, but I can enter sentences by voice input without moving my head, so it's much better.
> I have a strange phenomenon that for some reason the first child letter of a sentence is doubled up when typing in the scrapbox
> Also inconvenient because the text I'm typing is not displayed while I'm typing afterwards I wonder if this is because the scrapbox UI is doing something special.
> 

Homemade memo app
>I've tried running my own memo app. It's a system that allows you to type in a note, but entering with voice input doesn't seem to generate any key presses.
I tried running my own memo app. It's a system that allows you to type in a new line, but I got in a voice input. The new line doesn't seem to generate a key press.

Cybozu Office
>I've done a variety of tests using voice input for output.
> This is also written by voice input
> 
> There are many points to improve, but it's difficult to do so because there are only a limited number of changes that can be made to improve from a single user.
>
> When I voice type into the browser, Cybozu Office shows what I'm writing, but Scrapbox does not.
> This is probably due to the fact that the input part of the scrap box is doing something rather special.
> It's good that you're providing an interesting user experience because you're doing something special, but it's not so good to say that you're limiting your output options.
> 
> As for the text to speech recognition of a single person talking in a quiet room, as you can see in this text, it seems to be quite accurate and works well enough for practical use.
> However, it is difficult to understand what is going on without seeing the screen, or to notice that voice input has been interrupted after a certain period of time without looking at the screen.
> I think there are a few things that are still missing when outputting in a situation where you can't lie down and look at the screen.
> 
> It is good that there is feedback with sound when you press the button to start voice input, but there is no feedback with sound when voice input is finished or it is just not there and you can't keep your eyes closed while typing
> 
> I've tried Kintone with the feeling that the rich text editor might possibly get in the way of voice input, but I've found that at least with rich text data in the field, it works fine.
> 
> Maybe you could experience using something more like a screen reader. If I can read it even when I am not feeling well and cannot use my eyes temporarily due to some accident or other, there is a possibility that I don't have to stop working.
> 
> If I can't see completely, I can't press the voice input button, I can't read the posts, and I can't select which post I want to read in the first place, but I can listen and type with my voice when I want to work with my eyes closed because it's hard to keep them open. Wouldn't it be nice to be able to listen and type with voice when I want to work with my eyes closed?
> 
> If we could execute commands by voice in the form of something like (submit command), we could do a lot more things.
> 
