Shuji Hamaguchi's Idea Generation Method
[https://www.youtube.com/watch?v=CkDH3kW4bUM]

https://www.facebook.com/564923216/posts/10158567029288217?d=n&sfns=mo
[Shuji Hamaguchi] [Idea generation method].

　Business Ideas
　　[Technology]
　　[Business Model]
　　[Customer Experience]
　　Hard to break through just one.
　　[BTC]
　　 [SHIFT: The Art of Innovation] Part 2

　without having done any research beforehand
　　This could be misinterpreted to mean the opposite if only this word is used alone.
　　When consulting to a group of experts, the experts already have knowledge and experience that is not available through the Web or books, so researching that type of knowledge in advance does not lead to customer value.
　　Acknowledge and respect that the client is more knowledgeable in the field.

 1: Interacting
  This was also implicitly speaking on the assumption that we had a group of expert clients who were already brainstorming a lot of ideas.
  Do not focus on the ideas that are presented, but look at why the idea was generated, the pattern of thinking, the angle of thinking. That's where preconceptions and biases come in.
  Why is this good? Why not this? elicits patterns of thinking.
 2: Breaking the Bias
 　Try to counter the biases/preconceptions you find
 　　You seem to be assuming "˜but isn't that what you're assuming?' or something like that.
 　　What? is a good reaction.
 　Ideas that break bias are naturally opposed by those around them.
 　　Don't throw away an idea to the extent that 5 people disagree with you, only you can protect it.
 　　Some people are finally convinced when they see the prototype. Abstract concepts are difficult to understand.
 　　Gradually increasing the number of supporters like rolling snowballs.
 　　I tend to get caught up in my own biases and throw them away, so it's good to have enough blind faith that you are "absolutely right" for about half a day!
 　　Look for reasons why your opponent's objections are incorrect.
 　What kind of idea is good, a cut-off point, a bias model? →I don't know, build it and test it.
 　　If there is more than one bias, attempt to structure it
 　　Process Stop Don't bring in the "is this OK?" argument.
 　　　No one has the right answer.
 　　Answer once within the time limit.
 3: The Eye of God
 　When you're in good shape, your perspective goes up, you go beyond the world.


[https://gyazo.com/5d52a38e6813aa6861807d5c18e6e7ea]

[https://gyazo.com/3f9b7a22306008793c9d18beef9ca8b3]

