Japanese is logical.
[https://gyazo.com/b4713c19f1796bff8ff6956194976ea9]
	[Amazon https://amzn.to/2Ag2vKv]
	[Japanese] is [logical
	[Hiroshi Tsukimoto]
 	Born in Tokyo in 1955. Graduated from the Department of Mathematical Engineering, Faculty of Engineering, The University of Tokyo. Completed the master's course at the same university. Currently a professor at the Faculty of Engineering, Tokyo Denki University. Doctor of Engineering.

　Logic is a form of metaphor.
　　Duality of [understanding
　　　[Imaginability] and [symbol manipulability]
　　Symbol manipulability is based on imaginability
　　The linguistic aspect of [image] is [metaphor].
　　　Imagination
　　Abstract expressions lead to images through metaphors.
　　 "The heart is not full" = likening the heart to a container.
　　 He's testing" = time is the container.
　　 [metaphor for space]: container, direction, movement, existence
　　 [Metaphor of mimicry]
　　 Example text: Kant's Critique of Pure Reason
　　 　What corresponds to the senses in a phenomenon, I name the material of the phenomenon.
　　 　The arrangement of the various contents of a phenomenon in terms of certain relations is called the [form] of the phenomenon.
　　 This "organizing" is not human in subject (it is a form) → pseudo-human metaphor.
　　Logic is a form of metaphor.
　　　What is the "form" or "common property" of the container metaphor -> a closed line divides the space into two parts.
　　　　True or false in formal logic is inside or outside a set, so it corresponds to the logic of containers
　　　The form of the simile metaphor is a triad of "subject, object, and action"
　Japanese Logic and English Logic
　　The logic of English is the logic of the subject
　　　Both generative and cognitive grammar are subject logic
　　　In English, inanimate subjects are common.
　　Is "subject-predicate" universal?
　　　Not many subject-mandatory languages
　　　　English, German, French, Dutch...
　　　　Countries that strongly influenced the process of Japan's opening to the world
　　The "subject-commentary" relationship
　　　The predicate is the central element of the sentence
　　　The "carried" is central, and both "who" and "what" are complements and tautologies.
　　　　Omitted if not required.
　　The basis of Japanese logic is container logic
　　　Japanese has many expressions that make people "places".
　　　　English often compares inanimate objects to people; Japanese often compares people to places.
　　　Taro-san has a lot of experience" = "Taro-san has a lot of experience in his container.
　　　Spring is at its most beautiful at dawn.
　　　　Spring is not the dawn of a new year.
　　　　Akebono is the best in the container called spring, he says.
　　one grammar, two logic
　　　I am not claiming that "English is only the logic of the subject, Japanese is only the logic of space."
　　　The logic often used is the logic of the subject in English and the logic of space in Japanese.
　　　The elephant carried the load" is the subject's logic, and the Japanese can understand this.
　　　It's hard to explain "elephants have long noses" using subject logic.
　　　　The logic of space is that "long nose" is valid in the container of "elephant".
　　　Evening has come."
　　　　The Logic of the Entity from Which Evening Comes
　　Case particles as spatial logic
　The basis of Japanese logic is [propositional logic].
　　Propositional logic is a form of [container metaphor
　　　Correspondence between "is/is not X" and "in/out of container
　　The predicate is of the form [pseudo-metaphor].
　　　A predicate here is not a "predicate" of "subject predicate" but a predicate of "predicate logic
　　　>For example, if "Socrates" is represented by the term s, and P is the predicate symbol for "is a human being," then P(s) gives a logical formula with the truth "Socrates is a human being."
　　　>https://www.sist.ac.jp/~kanakubo/research/reasoning_kr/predicate_logic.html
　　　This P(s) is the predicate
　　　　Propositional logic plus predicates is classical logic
　　　A do B" is [subject-object-action], so it is subject logic.
　　　A is B" is a kind of
　　　Dutch also has a corresponding expression for is (be verb) (is for third person singular)
　　　At the time of the opening of the country, Japan did not have a corresponding expression.
　　　Therefore, "de aru" was coined (Ch. Yanagi, "The circumstances of the formation of the translated word") →[History of "de aru"].
　　　A is B" = "In a container called A, B de al."
　　　　I'm not familiar with the term "container," but it means "B holds in a set that satisfies the condition A."
　Japanese is not illogical and Japanese logic is not unique. The difference from Western languages is the ratio of the use of subject logic and spatial logic.

relevance
　[Nishida, Ikutaro] "[Logic of place]"
