僕の審査の仕方
How to judge at my [unexplored junior] 2020
　This article is not so much about the unexplored juniors themselves, but about the technicalities of "how they are dealing with over 100 applications".
　I don't think it's helpful for people on the application side, it's for people who do similar judging.

[https://gyazo.com/0e80032b635ea09b3d98dbb6bca63c85]

書類審査
　All application documents are in PDF format.
　　Unexplored Junior is a PDF application in the first place.
　　There are a few cases of wrong formatting, so we'll align them at this point.
　Put your application documents in one folder in Dropbox.
　　Open on iPad and put the whole folder in offline mode.
　　　It will now be saved locally on the iPad and not have to wait for a download over the network when opening.
　　　Last year I read on the commuter train, so that was another reason to make the network unnecessary.
　　This year I was home for COVID 19, so I was configured to also use a PC as described above.
　　Put a star on the folder.
　　　When you want to see the proposal documents, three taps of "Dropbox Open→Starred→Select Folder" will bring you to the list of proposal documents screen.
　　The proposal documents are sorted by submission ID by name (that's how the file names are supposed to be, I didn't make them), so go from the top to the bottom.
　　　With Dropbox, it's two taps to get a full screen view of the PDF.
　　(2021) I work from home and have Wi-Fi all the time, and I was wondering if I could do it directly from GoogleDrive without putting it in Dropbox, but when I open a document and go back to the list, the list reloads and I have to scroll again to open the PDF at the bottom, which is a pain!
　　　With a PC, it looked like I could take it offline, but I didn't know how to do it with an iPad, so I decided to do it again with Dropbox.
　Open the PRIVATE Scrapbox with Porter on your phone and jot down anything you think of on one page.
　PC
　　Used to view things that would otherwise be difficult to see on a PC.
　　First, open a spreadsheet with all the details of each application.
　　Duplicate the sheet for your own use and keep a percentage indication of the progress of the document review.
　　　If you have N applications, write k/N in each kth cell so you can see the progress at a glance
　It's bad enough if you're pressed for time on the screening deadline and read the later documents in a cursory manner, so read through all of them once first.
　　Then read more about what piqued my interest.
　　You can see in Scrapbox what the application ID number of the one that piqued your interest was.
　　This process selects people to interview by a factor of about 30 (i.e., 3-4).
　　 But this year, Seki interviewed more than 10 people, and I think it would have been better for me to do so.
　　 In that case, it would be like 10 times the number of application screening, 10 times the number of interviews, and so on.

面接
　View Zoom screen and proposal side by side on a PC
　　I have a gallery view so that everyone's face is equally visible.
　面接メモはiPadのNotabilityで手書きする
　　I see, so this story leads here!" or "Is there a gap between these two stories?" It is inconvenient to use a keyboard to record such things in real time.
　　The advantage is that the sound of typing does not enter the videoconference.
　The iPhone is used for doing a little research, for example.
　The person who interviewed you will create a page on Scrapbox and add to that page when you email them feedback afterwards, because it's hard to check the process if it's still in your mailbox.
