Sublime optimal strategy for the entire Homo sapiens species
https://twitter.com/nishio/status/1259584213415690241
"Open and free software is a sublime optimal strategy for the entire homo sapiens species that "it is a human loss to duplicate and recreate code that someone else has already been able to create." Gosh.
Quote Tweet

Jun Rekimoto : Junichi Rekimoto
@rkmt
 - 10 hours
Open software and free software is a noble and optimal strategy for the entire homo sapiens species that "it is a human loss to duplicate and recreate code that someone else has already been able to create", so please don't reduce it to a trivialized story like "I'm cracking up". https://twitter.com/about_hiroppy/status/1259314992777576448
View this thread
5:40 AM - May 11, 2020 - Twitter for iPhone
View tweet activity
3
 retweet
19
 Number of likes
nishio hirokazu
@nishio
路
1 hour
Reply To.
@nishio
three
By the way, in the case of a service that is used by multiple people via the web, the open source source code alone cannot demonstrate its value, and it is necessary to put it on a server and operate it. Since duplicating this operation is a loss to humanity, wouldn't the best strategy be to consolidate the operation into a company that performs the operation and pay the maintenance costs as a sub-subscriber?
nishio hirokazu
@nishio
路
1 hour
If the source code is made public, multiple operators will be created, which is a loss to humanity. Isn't the optimal strategy to keep the source code secret and create a monopoly situation by crushing it with patents so that similar services will not be created? Should the [Anti-Monopoly Law] be abolished because it is a loss to humanity?
nishio hirokazu
@nishio
路
55 min.
Even if "monopolistic firms can become inefficient due to lack of competition," there are better methods of human efficiency than banning monopolies, since "competition is a human loss."
nishio hirokazu
@nishio
路
52 min.
For example, a tax system that promotes spin-outs to facilitate the distribution of knowledge, or nationalizing the facilities of large inefficient companies and leasing them cheaply to start-ups.
