Banning criticism is for people who shrink from criticism.
So if a member is in a relationship that is not atrocious, why not ban criticism?

2019-05-10
	The [No Criticism] rule in [Blenstorming] is based on the premise that users are less likely to come up with ideas due to criticism, but in reality, some users are accelerated by criticism, so I feel the need to update the rule. I wonder if this is related to [psychological safety].
		The word "criticism" is too vague.
		There is some kind of "useful criticism" and "harmful criticism," and as long as the harmful criticism is removed, it is enough.
	妻:
		Local rules may be included when there is a high level of skill, trust, and an equal level of intelligence, but generally that condition does not hold true.
		We tried to make the method usable by any member of the team, and this is what we ended up with.
 	The purpose of brainstorming is to lower the level of discussion so that people who are not used to discussing can speak up.
 		[nishio.icon]I see.
	[Nakayama.]
		I thought that might be the case if [authority gradient] can't be removed.
	[Masafumi Ohtsune]
		Rules to prevent the defense mechanism that limits thinking when under pressure.
			[nishio.icon] "When I receive feedback from others, I feel pressured to do so and my thinking is limited" is an attribute of the receiver
	In order for criticism to be OK
	　There is no authority gradient."
	　There is a trust in [the other person's] reason."
	　There may be conditions such as
	　[equality], so not only do you need to trust the other person's reason, but you need to have confidence that [you are] "as rational as they are"?
	[三廻部 大]
	 Even if the criticism is useful, it will eventually lead to deep discussion of the topic (depth-first search), so I thought it might be reasonable to prohibit criticism if the brainstorming session is to explore a wide range of possibilities (breadth-first search).
		Related: [Is design thinking a depth-first search?]

	[久池井 淳](K)
		Shouldn't criticism be prohibited in order to create a "brainstorming session" with people who are not worth talking to, but criticism should be allowed when having constructive discussions with people who have expertise in the field?
		When I brainstorm with [nishio.icon] you and others, it is obvious that you are OK with criticism, and you seem to have a consensus that being OK with criticism is a good state of affairs, so I wondered why, then, the world is not OK with criticism.
		K: I think it's because there are a lot of people who believe that the reason they can't express their opinions is because they are criticized and the reason they can't get their opinions across is because they are emotionally criticized and "in fact, they behave that way towards others"
			To begin with, experiments have shown that brainstorming among "normal" people is less effective in generating ideas.
				I think [nishio.icon] "Breastfeeding among normal people is less effective" is too crudely summarized. I'd like to know what the actual experiment was like, so if you can point me to a paper, please do so.
				K: Isn't this paper the most famous one about the unproductivity of Brest?
     When "normal people" who care about criticism, hierarchy, etc. do this, productivity goes down.
     [Productivity Loss in Brainstorming Groups: A Meta-Analytic Integration]
    [nishio.icon]I see, "normal people" = "people who care about criticism and hierarchy".
    	I don't disagree with your assertion that it's not beneficial to brainstorm with "people who care about criticism and hierarchy."
    	As for whether "people who care about criticism and hierarchy" is normal, well, I think it's normal when you consider the ratio of people.
    	It's hard to argue when people say, "It's not normal for Cybozu to have a new employee tell the vice president no and the whole company knows it's a good thing." lol

			So, I added a little color to the brainstorming [IDEO] [Design Thinking], but five years at Accenture has proven that it is a kindergarten playground when done by amateurs.
	>I don't disagree with the assertion that it's not beneficial for "people who care about criticism and hierarchy" to brainstorm.
		K: I believe that brainstorming is meaningless unless it is done by people of high intellectual standards, without worrying about criticism or hierarchical relationships. The criteria for high and low intellectual level is debatable, but I don't think there is any disagreement here.
 		[nishio.icon] "Highly intelligent" is unclear. For example, even if someone I don't value intellectually at all, if they have an experience that I don't have and can put it into words, or if they can make inferences based on that experience and explain their reasoning process, then to me it is useful to say "Oh, I see, so there's a point of view. I think it's beneficial.
 			(Maybe you could call that kind of explanation intellectually advanced.)
		K:
   By intellectual level, I do not mean educational background or academic knowledge, but perhaps the presence or absence of expertise in the area of intersection with the subject under discussion.
   For example, it would be beneficial to have a middle school graduate temple carpenter at a brainstorming session on design methods for a high-rise building, but it is highly likely that a pharmacist would not be beneficial.
   Literature PhDs may be able to produce architectural findings from past literature.
			Oh, we're writing about the same thing, this one.
		[nishio.icon] There is a difference in quality between the inefficient brainstorming of "shoot random bullets and you may get a hit" and the brainstorming of "find a higher-order structure from many hit points," and the latter requires a lot of competence.
			Maybe you need the ability to manipulate symbols that allow you to operate against opinions that differ from your own without attributing them to "agreeing or disagreeing".
		K: I know what I'm doing on the job.
			In the case of large Japanese companies, it is often more beneficial to work with sales clerks or call center workers than to brainstorm with white-collar workers at the head office.
			The reason is that the former are ordinary people embedded in the political structure without the expertise of generalists (lol), while the latter are often professionals in their professions.
			Since 99% of the bullets that seem to be generated and randomly struck from a lack of brains have already been predicted and examined in the past, it is pointless to spend time on such a lottery game.
				Acts like using a calculator to do calculations without using Excel.
			I'm not talking about the pointlessness of brainstorms and hackathons.
				It was a waste of time to gather amateurs and have them do that,
				Furthermore, I believe it is a sinful act against humanity for professionals to go along with it.
		[nishio.icon]In other words, value can only be created by a combination of "people who are close to the field with expertise, not generalists" and "people who have the ability to find higher-order structures from a lot of information," and in the majority of cases, that combination is not possible.
		K: I think so.
			+Democratic Consciousness.
				(Not afraid of criticism or hierarchy. Telling people not to criticize is restricting speech and is not democratic.)
			The most effective time for ordinary people to use brainstorming was before the Internet, when it took time for ideas and knowledge to propagate.
		[nishio.icon]What has changed with the Internet?
		K: In the past, the flow of idea generation and validation could not be done without close proximity
			Even when excellent ideas arose, they fizzled out.
			So it was necessary to have the ideas reinvented many times, and brainstorming was effective.
		[nishio.icon] Ah, I see.
			Ideas are reproducible goods, but in the past, when they were managed orally and on paper, the medium discouraged reproduction.
			He said that the creation of digital communication through the Internet has made it easy to duplicate and search.
		[nishio.icon]I read the paper you gave me, and it turns out that it's better to have no interaction, rather than criticism. On the other hand, there are times when I find interaction with others beneficial, so there must be some other requirement.
			From what I've heard so far, it seems that "the other party must have expertise that you don't have" is a necessary condition.
			If the purpose is to randomly dot, it is more efficient to have 100 cases individually written out and collected, instead of gathering them together. And the benefit of random dots is low to begin with, he said.
			Hmmm... I have a feeling there might be something interesting a little further down the road, but I don't know what it is...
			Jumping monkeys, if the banana was in a low place, sometimes you could get it even if you jumped randomly.
				But as it repeats itself, the lowly banana is taken away.
				and the action of "load the box and fly from there" is required.
			[Amateur ideas appear original in presentation but are not feasible].
			The model in the brain that "people with expertise" have acts as a "box."
				On the other hand, we are trying to reach higher,
				It also acts as a bias, narrowing the scope of the search.
			In Shuji Hamaguchi's conception method, after a group of experts hit "many dots," he tried to identify "the thought process or bias from which it emerged.
			This is an approach that encourages the verbalization of "brain models" that have not been verbalized
				[Shuji Hamaguchi's Idea Generation Method].

			People are only aware of some of the "possible options" because of their biases.
				One way to expand the options in this situation is to brainstorm
     [https://twitter.com/nishio/status/1259630661205254144?s=21 nishio hirokazu(@nishio)]
     >@kur Okay, in comparison to Shogi AI, AI has an implicit assumption that all possible options are known, while humans can only recognize a part of "possible options" due to various biases, so we need to expand our options first.
			In other words, there are two kinds of "wide and shallow" and "deep and narrow",
				Shallow ideas are often unfeasible,
				Deep ideas are often caught in bias,
				You need to make this good point.
			How to be specific, and "bring in abstractions of successful patterns from other industries" is one way to do it (give a box to a monkey without a box).
			The other breaks the bias of the expert group (shaking the monkey box that's stacking the boxes).
   Both involve an entity with an outside perspective.
   It is not efficient to get a consultant with an outside perspective involved and have a monkey without a box make random jumps, this is what we have been talking about so far, "brainstorming futility".
			The type of consulting that provides logical thinking to clients who are not capable of logical thinking is a process of loading boxes onto a monkey without a box.

---I summarized it as follows on the day of this discussion, but when I read it again in 2022, I found it difficult to understand the meaning and I thought the title "[Summary of the discussion on the rule against criticism of brainstorming 1]" was not good enough, so I revised it. 2022-03-07
from [rule against criticism of brainstorming].
初出　https://www.facebook.com/1129148772/posts/10218200486980164?d=n&sfns=mo

	The [No Criticism] rule in [Blenstorming
	The term "criticism" is ambiguous.
		There is both beneficial and detrimental feedback.
	[心理的安全性]
	[権威勾配]
	Local rules may be included if there is a high level of skill, trust, and an equal level of intelligence.
		but in general that condition does not hold true.
	Differences in what is assumed by the term "brainstorming."
		Discussing opinions with someone you've never met before
		Do it in-house with your team members.
		Do it with a friend with whom you have a strong relationship of trust.
	Conditions under which criticism is beneficial
		No [authority gradient
		There is [trust in the other person's reason].
		[対等感]
			Not only do you trust the other person's rationality, but you are confident that you are "as rational as they are".
		When you receive feedback from others, do not view it as an attack on your character
			This is what I imagine when I hear the word "[proficiency]."
			Also related to trust in the other's reason
			When this condition is met, one can express critical opinions without worry = [psychological safety].
	Even if it's a useful criticism, you end up going deeper into the discussion of the topic it's about ([depth-first search]).
		If the brainstorming session is a (breadth-first exploratory) brainstorming session where you want to explore a wide range of possibilities, then there is a rationale for the prohibition of criticism.
		
