Nodal Point of Thought 2020-05-11
Contextualizing thoughts about the [no-criticism rule in Brainstorming].

[Parable of the monkey and the box]
	Jumping monkeys, if the banana was in a low place, sometimes you could get it even if you jumped randomly.
	But as it repeats itself, the lowly banana is taken away.
	Then the action of "load the box and fly from there" would be necessary.

Amateur ideas appear original in presentation but are not feasible.
	["Cognitive Approaches to Creative Activity"].
	The brain model that the "experts" have serves as the "box."
	We can reach higher.
	On the flip side, it also acts as a bias, narrowing the scope of the search.

Shuji Hamaguchi's way of thinking
	After a group of experts hit "a lot of dots" they were trying to identify "the thought process, the bias, from which it emerged.
	This is an approach that encourages the verbalization of "brain models" that have not been verbalized
	[Shuji Hamaguchi's Idea Generation Method].

People are only aware of some of the "possible options" because of their biases.
	One way to expand the options in this situation is to brainstorm
	[People are only aware of some of the options available to them.]
		>Are we only aware of some of the "possible options" because of various biases, so we need to broaden our options first?

In other words, "wide and shallow" and "deep and narrow."
	Shallow ideas are often not feasible
	Deep ideas are often mired in bias.
You need to make this good point.

What exactly do we need to do?
	Bringing in abstractions of successful patterns from other industries is one way to do this (giving a box to a monkey without a box).
 The other breaks the bias of the expert group (shaking the monkey box that's stacking the boxes).
Both involve an entity with an outside perspective.
	It is not efficient to get a consultant with an outside perspective involved and have a monkey without a box make random jumps, this is what we have been talking about so far, "brainstorming futility".
The type of consulting that provides logical thinking to clients who are not capable of logical thinking is a process of loading boxes onto a monkey without a box.