Summary of Discussion on Brest's No Criticism Rule 2
from [rule against criticism of brainstorming].
Summary of Discussion on Brest's No Criticism Rule 2
	No criticism is allowed in order to create a "brainstormed" feeling that everyone has thought together with people who are not worth talking to.
	There is criticism when having constructive discussions with people with expertise, etc.
	Obviously criticism is OK when brainstorming with you and others.
		In this neighborhood, everyone seems to have a consensus that being OK with criticism is a good state of affairs.
		Then I wondered why in the world it's not a criticism.
	Criticism and denial are different Denial is illogically possible Denial is prohibited
	I think it's because a lot of people believe that they can't express their opinions because they'll be criticized, and that their opinions won't be heard because they'll be emotionally criticized, and in fact, that's how a lot of people behave towards other people.
	To begin with, though, experiments have shown that brainstorming among "normal people" is less effective in generating ideas.
		The most famous paper on the unproductivity of Brest is this one
		When "normal people" who care about criticism, hierarchy, etc. do this, productivity goes down.
		[Productivity Loss in Brainstorming Groups: A Meta-Analytic Integration]
		And then I added a little color to it, IDEO's design thinking, but five years at Accenture proved that it would be a kindergarten playground if done by an amateur.
	That's funny.
 I see, "normal people" = "people who care about criticism and hierarchy".
		I don't disagree with your assertion that it's not beneficial to brainstorm with "people who care about criticism and hierarchy."
	As for whether that is normal, well, I think it is when you consider the ratio of people.
		It's hard to argue when people say, "It's not normal for Cybozu to have a new employee tell the vice president no and the whole company knows it's a good thing." lol
	I believe that brainstorming is meaningless if it is not done by people of high intellectual standards, without concern for criticism or hierarchy.
	Unclear on "high intellectual standards."
		For example, even if someone I don't value intellectually at all, if they have an experience that I don't have and can put it into words or explain their reasoning process based on that experience, I think it would be beneficial for me to hear, "Oh, I see, there's that perspective, too.
		(Maybe you could call that kind of explanation intellectually advanced.)
	Although the criteria for high and low intellectual standards are debatable, this one will not be disputed either.
		By intellectual level, I do not mean educational background or academic knowledge, but perhaps the presence or absence of expertise in the area of intersection with the subject under discussion.
		For example, a palace carpenter with a middle school degree would be beneficial if he were present at a brainstorming session on design methods for a high-rise building, but a pharmacist is not likely to be beneficial. A doctor of literature might be able to produce architectural insights from past literature.
	 Oh, we're writing about the same thing, this one.
	There is a difference in quality between the inefficient brainstorming of "shoot a bullet randomly and you may get a hit" and the brainstorming of "find a higher-order structure from many hit points," and I think the latter requires a lot of competence.
		Maybe you need the ability to manipulate symbols that allow you to operate against opinions that differ from your own without attributing them to "agreeing or disagreeing".
	I know from my work that in the case of large Japanese companies, it is often more beneficial to work with sales clerks or call center workers than to brainstorm with white-collar workers at the head office.
		The reason is that the former are ordinary people embedded in the political structure without the expertise of generalists (lol), while the latter are often professionals in their professions.
		Since 99% of the bullets that seem to be generated and randomly struck from a lack of brains have already been predicted and reviewed in the past, and are often misguided, it is pointless to spend time playing the lottery.
		Acts like using a calculator to do calculations without using Excel.
		I am not talking about the pointlessness of brainstorms and hackathons, but rather that it is a waste of time to gather amateurs and have them do it, and furthermore, that it is a sinful act against humanity for professionals to go along with it.
	In other words, value can only be created by a combination of "people who are close to the field with expertise, not generalists," and "people who have the ability to find higher-order structures from a lot of information," and in the majority of cases, that combination has not been achieved.
	I agree. +Democratic Consciousness.
		They are not afraid of criticism or hierarchy. Telling people not to criticize is restricting speech and is not democratic.
	The most effective time for ordinary people to use brainstorming was before the Internet, when it took time for ideas and knowledge to propagate.
 What has changed with the Internet?
	In the past, when there was a process of idea generation and validation, it used to be possible only if you were close to the idea, so even if a relatively good idea was generated, it disappeared in a bubble.
		So it was necessary to have the ideas reinvented many times, and brainstorming was effective.
	Ah, I see. Ideas are goods that can be reproduced, but in the past when they were managed orally and on paper, the medium held them back from being reproduced, and now that the Internet has created digital communication, they can be easily reproduced and retrieved.

First published at https://www.facebook.com/1129148772/posts/10218200486980164?d=n&sfns=mo
