Scrapbox Machine Translation Experiment
Japanese: [Writing is not born in order - Yasukazu Nishio's Scrapbox https://scrapbox.io/nishio/%E6%96%87%E7%AB%A0%E3%81%AF%E9%A0%86%E7%B9%B0%E3%82%8A%E3%81%AB %E7%94%9F%E3%81%BE%E3%82%8C%E3%82%8B%E3%81%AE%E3%81%A7%E3%81%AF%E3%81%AA%E3%81%84]

[*** DeepL]
Sentences don't come in sequence.
[https://gyazo.com/67a449ade0d5e911d60b1430b879fb1e]
The finished sentence, the story is sequentially connected.
But that's not how it happens.
1,2: Write out what comes to mind and
3: Afterwards, I'm like, "Oh! That's how this and this is connected! and realized that
4: Finish by dropping the unwanted branches and leaves

[sentence developmental process]
[associative connection]

[*** Google Translate]
Sentences are not born in sequence
[https://gyazo.com/67a449ade0d5e911d60b1430b879fb1e]
Completed sentences are connected in sequence
But that process is not so
1,2: Write down what you have come up with,
3: Later, I realized, "Oh, this is connected to this!",
4: Complete by dropping unnecessary branches and leaves

[Sentence process]
[Associative connection]

[*** GPT-3.5: Translate into English. Keep indent and markup. Put all in Markdown code region.]
The creation of a written piece does not happen sequentially. The finished product may appear to have a smooth flow of ideas, but the process of its creation is not always linear. 

1. First, one writes down whatever comes to mind. 
2. Then, they continue to jot down ideas. 
3. Later, they realize that some of these ideas can be connected. 
4. Finally, they refine the piece by removing unnecessary details. 

This is the process of how a written piece comes to be, utilizing associative connections and removing irrelevant information.

[*** GPT-4: Translate into English. Keep indent and markup. Put all in Markdown code region.]
A sentence is not born in a linear order
[https://gyazo.com/67a449ade0d5e911d60b1430b879fb1e]
A completed sentence has a story that connects in a linear order
However, the process of its creation is not like that,
1,2: Write down the ideas that come to mind,
3: Realize later, "Oh! These two things connect!"
4: Remove unnecessary branches and complete it

[Process of sentence creation]
[Associative connection]
[Trimming branches]
