Prisoner Training 202005
Records for May/June 2020

2020-04-28
	[Jackknife squats] 40 x 3
	Yesterday's minutes [incline push ups] 40 x 3
	The problem of not being able to do horizontal pulls now that the bars have been banned, I'm starting to think that I should go back and do 40×3 vertical pulls on the steps. I can only do 20×3 horizontal pulls at a loose angle, and I'm going to go back and solidify my foundation.
 Jackknife squats felt weak pain in right knee. This may be premature as well.
 	In that case, I'd have to go back to shoulder stand squats, which I'm not very good at...
 	I've been reading up on shoulder stand squats, and it says something about "increasing range of motion...", so maybe people with one knee pain should do this before they hurt their knee...
 	I hated to do a lot of loose exercises because of my short temper, but Mr. Apple Watch told me to exercise for 30 minutes, and if it's a hard and fast exercise, it won't count at all!
 	He's relentless in pointing out the cognitive distortions that make us think we're "exercising" by doing a little bit of the hard stuff when we think of it.
2020-05-11
	Incline push-up 40×3
	Flat knee raise 20×2
	Knees on hips with shoulder stand 30 sec.
	Short bridge hold 30 sec.
 Easy Twist Hold 10 sec.
2020-05-16
	Horizontal pull 40 x 3
 Jackknife squat 40 x 3
 Jackknife squats still seem to be too much for me, as my heart rate was sometimes over 150, but unlike last time, my knees didn't hurt, so I guess I'm making progress.
	The vertical pull is about 120 max and 100 average, so the load is low, but I'm still searching for a good place to grab it in the house. If I use a door frame, I have to put my fingers on the narrow ledge, which is hard on my fingers, and if I use the bar on the front porch, I can get a good grip, but the platform is not flat.

5/18
Incline push-up 40×3
Flat knee raise 20×2
I have muscle soreness in the front of my thigh from squatting last time, peaked yesterday and is getting easier this evening.
Push ups were done 40 times each in between pomodoros.
　But given the weakness of my abdominal muscles, maybe I should do knee raises and knee tucks in between.

5/19
Ring fit for the first time in a long time because it was raining and I couldn't go out.
　Feeling of weak movement of various muscles

5/22
Vertical pull 120
	Using the park's pillars.
	The load is too low because you can do 120 cycles without a break.
Vertical pull rapid 30
	Feet placed on either side of the column at a steeper angle
	I can still do 30 of these, which is a weak load, but, well, next time I'll do 40 x 3 of these.
Jackknife squat 40 x 3
 I feel like my Achilles tendon is becoming more flexible.
 I still can't do full squats without support [in terms of ankle range of motion], but I'm getting much closer.
 It's important to do the breathing right, the hardness is different.
The incline pushups I did at the beginning of the week didn't cause any muscle soreness at all, so maybe I spaced them out too loosely?
　I tried the kneeling pushups in step 3, but they're tough after 5, so I'll have to wait until I can do 120 incline pushups in a row with room to spare.

5/23
As a result of the Horizontal Pull, I'm wondering if there is some muscle soreness in my right hand, like in my second arm.
I have a theory that my lower back muscles are weak, so I do a short bridge hold.
　It seems my feet are too far from my hips, it's easier to do when they're closer together.

Monday Schedule
　Do incline pushups without pauses.
　Flat knee raises are done in detail between pomodoros.

5/26
Monday, closed due to illness.

Walking 47min 3.6km 277kcal
　If you run 100 steps and get a heart rate of 145 or so, then walk until it drops to 120, and then do it again, you'll be able to maintain 135 or so while walking, so you'll run about 5 times.
　I guess as I gain more strength, my heart rate will drop quickly.
　It's not good to force yourself to run, knees, cardiopulmonary capacity, and other concerns.
　[https://gyazo.com/dd7435a6670166956a4535fd6303b017]


Incline push-up 40×3
　Couldn't do it in a row, give or take 40 times.
　If I take a little break and do another 40, I feel like I need to take a short break at 20 and 30.
　Is it better to breathe through the nose?
NITAC 10
Easy twist hold left and right 10 sec.
Half twist hold is not a correct pose.
Straight bridge hold 20 sec.
Bent leg hold 20 sec.
　wobbly
Flat knee raise 20×2
Next Friday
　Horizontal pull rapid 40 x 3
　Jackknife squat 40 x 3

5/30
Horizontal pull rapid 40×3
 I was going to do it if I could do it in a row, but it didn't look like I could, so I broke it up into three sessions.
 not too difficult
 If I move my legs further forward, my range of motion will become narrower, so I think I'll keep the load the same and increase the number of consecutive repetitions.
Jackknife squat 40 x 3
　I feel the strain mainly on the front of my thighs, is my posture not good?
　Because of the stiff ankle joints, they fall backwards when squatting as they are. To prevent this, I apply a lot of forward pulling force in the bottom position.
　Not perfect form, should not proceed
　Need to gain joint flexibility before moving on to the next step.
　I would interpret it as stretching the joints, not the muscles, and move it slowly and with the weight forward.
　If the load on the muscles is not enough, it would be good to do shoulder stand squats as well, or increase the number of repetitions.

Yesterday, Monday, I was sick and down because of the barometric pressure.
Incline push-up 40×3
 It still looks like this is the pace for the time being.
Flat knee raise 20×2
　Correct form, exhale fully during tension, and stop for one second.
　Mystery of groin pain
　Inside the thigh?

Saturday
Horizontal pull express 40 x 3
　Maybe my legs were more forward than last time, the load was higher, and the third 40 was choppy.
　I named it Horizontal Pull Rapid.
　I do less strength training, but I do [slow jogs].
　[https://gyazo.com/96cfb3ca108a1c111f72832637e32f7b]


Jackknife squat 40 x 3
　I did it slowly, checking my form.
　Halfway through the second set, I could squat without holding my hands.
　　The center of gravity tended to move backward, but now it is brought forward.
　　I put the third set back because of the strain.
　Left groin pain.
　Is it a hip range of motion problem rather than a strength problem?

No muscle training on Monday because my muscles were sore from Saturday and I had pain in my spine, not sure if it was from the exercise or if I slept wrong.

Tuesday, 30 minutes left without exercise, so slow jog, thigh-raising exercise to get the heart rate up efficiently.

Wednesday
　Incline push-up 40×3
 Flat knee raise 35×3
 　Left hand groin, or inside hip, or something hurts.
 　Not so good because it's been going on for the last week.
 　https://furukawa-chiro.com/blog/hip-pain-2
 　　>The overwhelming majority of patients complain of pain at the "base" of the leg when bending the "hip joint"... In few cases, the "hip joint" is actually bad, and the pain is caused by damage to the "iliopsoas muscle", a muscle that runs at the hip joint.
 　If you look up [iliopsoas] stretching and training, you'll find leg raises and knee-toe chests.

2020-06-19
	I haven't been very motivated this past week.
		It rains a lot.

[Prisoner Training]
