How to Sell Your Startup
[営業]
How to Sell a Startup (Startup School 2018 `#15`, Tyler Bosmeny)
https://review.foundx.jp/entry/how-to-sell

	[Paul Graham]"Spend every moment of every day doing two things: building products or talking to users."
		Most of what we talk to users about is sales
	Advantages of the founder being a salesperson
		情熱
		専門知識
	Sales is a funnel
	　potential customer
	　conversation
	　closing
	potential customer
	　[chasm theory].
	　Only 2.5% of companies would consider buying a product from a startup
	　You have to talk to a lot of people.
		Three methods of acquisition
			My Network
			Industry conferences: know who's coming and make an appointment
			cold mail
	会話
		Sales is about listening.
		Understand their problems and build rapport
		First understand what their needs are.
			Then consider if you can help them with your solution.
		Examples of questions
			Can you tell us about the problem you are having?"
			How are you resolving this now?"
			Why did you pick up my phone?"
			If you had an ideal solution, what would it look like?"
	follow-up
		沢山必要
		It's not over until they say no.
		We should assume the best case that they are simply too busy to think about anything else.
		No reply -> 5~7 days later, poke around, not rude or pushy.
		Be thoughtful and personal
			Simultaneous emails, no one likes them.
	closing
		I just need one more feature."
			Contract ahead of time
			Delay until other customers request it.
		I want a free trial."
			Sign an annual contract first
			Create a cancellation period
	When you get a no answer in early sales conversations, is it because you are not an [early adopter] or because you don't have [Product/Market Fit]?
		No means no.
	Which to attack first, small or large companies?
		Go to the people who need the product the most and act quickly
	価格
		Patrick McKenzie says most startup founders set their prices too low and need to charge more
		One strategy for pricing: if you can close the deal, double it.
	Products of $50
		I can't high five you.
		The only page that existed was one that described the product. That was enough.
