Dig deeper and see circulation
[https://gyazo.com/224ac0116f24acbb1df9bbcd35684a68]
　We've talked several times about "asking questions in response to [abstract concepts] to make them more concrete.
　　The brain diagram at that time is shown in the upper part of the diagram above.
　　Example: [Type-specific advice for contest entrants].
 Today, I noticed that there is a pattern A that explains the question with my [concrete experience] or concrete example E, and another pattern B that explains it with another abstract concept
 I noticed that Pattern B has two patterns, Pattern B1, where repeated questioning leads to E, and Pattern B2, where X comes up again [see circular].

With respect to this pattern B1
　At first I thought, "This is not properly [understanding] concept X."
	Is that true? I thought.
　[Facebook https://www.facebook.com/nishiohirokazu/posts/10221758399685758] wrote
		>"For a given abstract concept X, what exactly is that X?" and if you ask, "What is that X concretely?", the person who gets a concrete example understands X, the person who gets another abstract concept Y is suspicious, and when you ask the same question further about Y... and repeat, the person who gets X without leading to a concrete example and becomes a circular reference doesn't understand X.
  > I'm not sure if the hypothesis that > this is really true, even though it seems to be correct at first glance.
　There is no objective definition of the concept of understanding that has reached consensus.
 The subjective definition of 'Nishio calls this state of affairs understanding' is not inconsistent with the above definition that can be readily found."
　concrete example
 　Right Concept
 　　How can you say you understand the concept of right when "right is the opposite of left and left is the opposite of right?"
 　　　→I feel I don't understand.
	　　dictionary
	　　Right: one of relative position. When looking east, toward the south; also, when this dictionary is opened and read, the side with the even-numbered pages.
		　　East: One of the directions. The direction or direction from which the sun rises. Left toward south.
			　It's good that you attribute it to the "open this dictionary and read it" experience that people who read paper dictionaries have.
			　The common explanation, "the one who holds the chopsticks," is attributed to the experience of "holding the chopsticks."
			　　For those who have the experience of holding chopsticks with their right hand, it's "attributed to their experience."
			　　You avoided it because some people are left-handed, so you could predict that the readers of the dictionary might not have the experience of holding chopsticks with their right hand.
			　　People from other cultures who don't have chopsticks won't get it, of course.
			　　　'foo is the opposite of bar, the side with the quux.
			　Attributing east, west, south, north, and west to the direction of the rising sun can be attributed to "the experience of many people" in the current situation where most of the subjects live on this planet.
			　　If humans colonize other planets, they won't be able to use it.
　We're trained to think abstractly in our curricula.
　　At first, line up the pieces of the ball and do "two and three, five pieces together.
　　　The teppings are equipped with a body, and they are very [concrete].
　　Then train the students to be able to add without actually manipulating the tuplets.
　　　They're disconnected from specific experiences.
　　　Symbol Manipulation Training
　　　　The number "2" is an abstract concept.
　　　　Training to treat abstract concepts as concepts without connecting them to concrete experience
　　Maybe that's why I have a habit of saying abstract things when asked, "What exactly?" I may have a habit of saying abstract things when asked
　　　I'm just going to do it.
　　　>I thought I'd do a concrete experiment of my own and ask, "What is zero?" I thought to myself, "What is zero?" But when I thought about it, I realized that this was a general answer because I didn't ask, "What exactly is it?" I thought about it and realized that this is a general answer because I did not ask "What is it specifically? What exactly is zero?" If you say, "For example, there are no apples here, but I would describe this as having zero apples," that's OK because it's connected to a concrete example.
　　　>Tomoya Tachikawa: What exactly is an experiment?
   >To actually try it out, like I did this time.
   I sense a bias that makes me want to define it in words.
   	At first I was going to answer, "When there is an assumption, as in this case, that 'if X, then Y,' you actually try an action that would be X to see if it is Y."
	[What is understanding?]
		Meta story, this process itself is a process of delving into the abstract concept of "understanding".

	[Dig deeper]
		[People who memorize things by rote can't dig in].
　[Understanding is a hypothesis.]
　　Experimenting to test a hypothesis is a new "experience" and a process that connects
　[Combining the concrete and the abstract]
