Design Criticism for Everyone
[https://gyazo.com/6c927d183faed5e588d4988eae81d148]

	Design Critique - A Guide to Improve [Collaboration] & [Communication] for Achieving Objectives
　I think many people have a negative nuance to the word [critique], but in this book, "critique" is a positive concept.
　There are three types of feedback: reactive, directive, and critical.
　　Recommend a critique type, pointing out the problems with the first two.
　　The first two feedbacks will be addressed in Chapter 6.

	Reaction type
	　Emotionally driven.
	　Motivated by personal expectations, desires, and values
	　Intuitive
		cope
		　Be more specific.
  　Talk about "why" and "how."
	directed
		Advice, suggestions, "I would do this."
		Specific change orders alone do not tell us why.
		　For what purpose are you making that change?
		　If you could also explain why, I'd know what kind of problem you're trying to tackle.
		[problem solving](negative nuance, counterproductive, out of place).
			→ Chapter 5, "Avoiding Problem Solving" (below)
		cope
			What problem are you trying to solve?
	critical type
	　[Critical thinking
	  Determine if the objectives will be met.
		Keys to Good Critique
			Identifies [specifically] what "aspect or judgment" (X) of the design is being analyzed
			Relates X to "objectives or best practices" (Y)
			Explains whether X supports Y or not and why


Avoid problem solving
　Purpose of critique = analysis of the presented design
　Someone will propose new changes.
　= the person switched from critical thinking to creative thinking.
　= participants' focus on their objectives was impaired
　　[Do not mix hot and cold water.]
　cope
　　For those who make suggestions without explaining their objectives: what is the problem? What is the relationship to the purpose of the design?
　　　If you can relate to the issues the proposer has in mind, we'll hold off for another meeting.
　　When all participants believe the problem needs to be solved.
　　　Defer the critique and do the problem solving.
　　　OK as long as they are not mixed.
