Running away from difficulties does not make you stronger.
Comparing the bad pattern of someone who "[studied] a lot of disciplines" to a role-playing game.

	When I entered the forest at the beginning, I met [a slime], so I ran away.
	I went into another forest, another monster came out, I ran away.
	I repeated it and got to the point where I said, "I've been to a lot of different forests.
	but since he didn't kill any monsters, he didn't get any experience and remained at level 1.
	I saw a passing adventurer use some cool magic and imitated him, but I couldn't activate it properly (of course).

You can't accumulate [experience] just by saying, "I've been to a lot of different forests."

-----

When I wrote this metaphor, what came to mind was Dragon Quest, but in the case of Micra, which is familiar to young people these days, the mental model that is formed is completely different because the player becomes stronger by acquiring strong equipment, rather than by defeating monsters and accumulating experience. I think the mental model is completely different.
　Experience in the microcosm is lost when you die and is consumed when enchanting and strengthening equipment, a kind of currency.
　Strengthening of equipment is also done by obtaining materials in the early stages, so there is little need to fight enemies, and going to new lands and obtaining new resources while avoiding enemy combat is a means of strengthening oneself

As an old man of the Dracula generation, my mental model is to "become stronger by defeating more and more monsters," but for the Mycra generation, my mental model is to "explore new places while avoiding monster battles as much as possible.
　Would it be "you have to fight monsters and accumulate experience to enchant weapons" for the Mycra generation?
　 No, because there are ways to gain experience that do not involve fighting monsters.
　 　Trading, mining and refining
　 　Making devices to gain experience efficiently.


---
Original title [Escape from Slime].
　To begin with, [slime] is not an early enemy in Mykla.
　Early enemies are zombies and skeletons.

You can't always [run away], but there are enemies you should run away from.
	How can we identify this?
	[It's agrarian bias to blame escape]
		[Running away].
