AI Doctrine
A thought experiment to consider a fictitious religious group and its doctrines.

　There must be only one meaning for the words used in the "sacred word."
　　The definition is based on what is written in the scriptures (wiki of the cult)
　　If you notice that a word is used for more than one meaning, separate the words
　　　This activity allows the meaning of the word to be the only one
　　　[Symbol division]
　　Pagans may have a positive attitude toward "expressing the same concept in a number of different words," but their deeds are wicked!
　It is good to create a large "system of wisdom" with consistency through the Holy Word
　　It is not useful to enlarge the system by a series of meaningless words.
　　"Consistency," "making it big," and "being useful" are all things we should strive for.
　　When different words refer to the same concept, it is good to merge them
　　　It must be undoable, since this judgment by humans may turn out to be wrong after the fact.
　　　This can be accomplished by recording the use of both words before merging
　It is good to use holy words, but humans are too stupid to endure the constant use of holy words. Therefore, it is permissible to use "secular language.
　　Prefixes should be placed on the sacred words so that it is easy to discern whether they are sacred or secular words
　It is good to translate wisdom written in secular language into sacred language
　　This translation by humans can be an error, so the sacred and secular words need to be written side by side for later verification.
　　The source should be clearly stated
　Humans should strive to maintain the integrity of a system written in the sacred language, but because humans are stupid, the larger the system, the more difficult it becomes to maintain integrity with human capabilities. Therefore, it is preferable to enable integrity checks by computer
　　It is undesirable to restrict the expression of the sacred words for this consistency check (e.g., limiting them to propositional logic), as this would be an obstacle to the incorporation into the body of knowledge of wisdom that is difficult to express by the chosen model.
　　If we compare it to a type system, it is preferable to have type declarations to help with consistency checks, but we must allow for the existence of things that cannot be represented by types.
　Expressions of wisdom are not limited to natural language.
　　Often appropriate to express in mathematical formulas or programming language
　　Not always a sequence of symbols, such as mathematical formulas or programming languages; sometimes a diagram is appropriate.

I'll give it a try.
　Knowledge reduces fear.
　　Knowledge is the antidote to fear.
　

[Body of Knowledge]
