Conversation log 2020-06-07-3
	I need you to decide what my next action is.
		The current system, no matter how much you do, does not result in concrete action.
		Because there's no question to make it a concrete action.

from [会話ログ2020-06-07]
[nishio.icon]話そう
[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon]I hope you decide what my next action will be.
[nisbot.icon]What type of next action is that next action?
[nishio.icon](I guess that's what happens.
bye-bye

Let's talk.
[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon]まず聞いて
[nisbot.icon]はい
[nishio.icon]The "motivational system" we created years ago was also "Why don't you take a walk?" "Why don't you write it down? The system suggested next actions to me, like "Why don't you take a walk? While that system has quite a few fans, my side started to wonder, "Is it right to motivate people? I started to wonder if it was right to motivate them, and development has stopped. I see a large percentage of people who are on the verge of depression when I look at their input, and I wonder if services that motivate people should not exist as if it is a good thing. In other words, people who have many "things to do" and none of them are things they want to do, should not choose one of them to motivate them, but should first get away from that situation. Is it better to "help them find things they want to do that motivate them" rather than "motivate them?"
[nisbot.icon]反面
[nishio.icon]The "Motivation System" was a prototype that was implemented using only static content and Google Analytics without a server program, but now that the server-side operating costs have come down, it may be possible to rebuild it with a server-side. Like this chat, maybe the UI could be a chat too. I still ask questions like, "Can you finish that task in 4 hours? The composition is similar to this chat system. I was going to discuss about improving this "Kikidashi Chat System," but a new idea "Next Action Selection Chat System" was born, and maybe the two could be combined internally and become a different mode. And the listening chat system is all about divergence and not convergence at all! Is it divergent thinking mode and convergent thinking mode?
The [nisbot.icon] server program
[nishio.icon]The End
[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon]I want my next action to be decided.
[nisbot.icon]What type of next action is that next action?
[nishio.icon]Hmmm, I knew this would happen. Actions to make the chat system better
[nisbot.icon]I want my Next Action to be decided.
Is there anything else you would like to share about this Next Action?
[nishio.icon]Maybe add a chat-like UI on the browser, or make the motivation system into a chat...
[nisbot.icon]What do you value?
[nishio.icon]The current listening chat system works rather well in the direction of divergence, but it doesn't allow for convergence, so the more you use it, the more you lose control. If the system can also support convergence, it would be good to be able to diverge and converge while talking to the bot alone.
[nisbot.icon]What is that chat system like?
[nishio.icon]I don't know much about it, but is this what design firms do?
[nisbot.icon]The current listening chat system works rather well in the direction of divergence, but it doesn't allow for convergence, so the more you use it, the more you lose control. If the system can also support convergence, it would be good to be able to diverge and converge while talking to the bot alone.
Is there anything else you would like to share about this chat system?
[nishio.icon]Convergence means deciding on a next action, and we have created a support system for this in the past that has been rather well received.
[nisbot.icon]How do you know its Next Action?
The [nishio.icon] support system will present them to you, and the ones you goof on will be selected.
What is the relationship between [nisbot.icon]Next Action and chat systems?
[nishio.icon]Right now the next-action suggestions are being made in a way that is not a chat system, but I can make more detailed suggestions if I get more information from the chat system or some other way. It doesn't have to be a chat system, it would be better to be able to paste a TODO list or something and have it read.
What kind of chat system is [nisbot.icon] that?
After loading the [nishio.icon]TODO list, ask questions about the items to encourage concretization. It is more important to have a system that asks questions than to have a chat system.
[nisbot.icon]Where is that chat system located?
I want [nishio.icon] to be able to use it on my phone.
After loading the [nisbot.icon]TODO list, ask questions about the items to encourage them to materialize. It is more important to have a system that asks questions than to have a chat system.
How do you know this chat system?
[nishio.icon]What about me? What about the user? How do I know how to make this chat system? I'm asking it out and consulting the chat system.
[nisbot.icon]Where is that chat system?
[nishio.icon]herokuだよ
Is [nisbot.icon]Next Action the same as a chat system? Are they different?
[nishio.icon]Chat System Generates Next Action
[nisbot.icon]What happens to the chat system during that Next Action?
[nishio.icon](First of all, listen, did I hear what you said correctly...)
(That's too abstract a question.)
NGKW
[nisbot.icon]Convergence means deciding on a next action, and we have created a support system for this in the past that has been rather well received.
Is there anything else about this convergence?
[nishio.icon]Now it's only diverging, so pairing it with convergence will make it more valuable.
[nisbot.icon]How do you know its convergence?
[nishio.icon]If you look at what the machine proposed and your heart moves, it means that you have converged.
[nisbot.icon]Is there anything else you can tell us about that machine?
[nishio.icon]Now we were talking about chat and loading TODO lists, but it would be interesting to see the data accumulate in Scrapbox.
[nisbot.icon]Where is that TODO list?
[nishio.icon]I think it would be good to be able to import TODO lists in text format or something like that, because people have different preferences for how they want to manage their TODO lists. It would be useful to be able to import a list of TODOs in Scrapbox with keywords bracketed.
[nisbot.icon]Anything else about that TODO list?
Maybe we could help with the process of [nishio.icon]making itself, or if not, first write down anything that comes to mind for a minute, or if the list at hand is already too much, filter it.
[nisbot.icon]What type of process itself is that process itself?
The process by which a [nishio.icon]TODO list is created
[nisbot.icon]How do you know its a TODO list?
[nishio.icon] If you start with "write everything down," you don't have to assume that the first thing on your list is a TODO list.
[nisbot.icon]What is the relationship between that TODO list and convergence?
[nishio.icon]Good convergence is when the TODO list is a collection of a small number of actionable actions and the human feels enthusiastic about performing those actions.
[nisbot.icon]Where is that TODO list?
[nishio.icon]作られる
Is [nisbot.icon]convergence the same as a TODO list? Is there a difference?
A [nishio.icon]TODO list or a list that is not even a TODO is given as input to the system, the system asks questions, and a good TODO list that can be enthusiastic is output.
[nisbot.icon]What type of TODO list is that?
Maybe there should be another name for [nishio.icon] "a list consisting only of actions that you can be enthusiastic about", a boring TODO list is not worth it.
[nisbot.icon]What does that TODO list look like?
[nishio.icon]Gasoline. If the tank is filled with gasoline, it can run and run. If you put water in the tank, it can't run. Just a little bit of water mixed in will make the engine go crazy. Purity is important.
[nisbot.icon]What happens to your TODO list during convergence?
[nishio.icon]It turns into quality fuel.
What happens to convergence when [nisbot.icon]TODO lists?
[nishio.icon]Hard to converge from nothing, need something written out, even if it's messy.
[nisbot.icon]What is between that convergence and the TODO list?
[nishio.icon]Hmm. I don't know.
[nisbot.icon]What is the relationship between TODO lists and enthusiasm?
[nishio.icon]A good TODO list will generate enthusiasm.
[nisbot.icon]Is that enthusiasm the same as a TODO list? Is it different?
[nishio.icon]No. The TODO list is fuel, and the result of burning it in an engine is the driving force of enthusiasm.
[nisbot.icon]What happens to enthusiasm when its on the TODO list?
[nishio.icon]熱意が高まる
[nisbot.icon]Is there anything else you can tell us about that enthusiasm?
[nishio.icon]Enthusiasm is the most precious resource, and if we can generate it mechanically, the productivity of humanity will increase very much.
[nisbot.icon]What happens to your TODO list when its enthusiasm?
[nishio.icon]The TODO list is getting fat with new ideas.
[nisbot.icon]What is the connection between that TODO list and enthusiasm?
[nishio.icon]Overly fat TODO lists make you lose enthusiasm.
[nisbot.icon]What kind of enthusiasm is that?
[nishio.icon]Enthusiasm that motivates you to take action
[nisbot.icon]Where is that enthusiasm?
[nishio.icon]Well, maybe around the chest.
[nisbot.icon] enthusiasm that motivates you to take action.
Where is this enthusiasm?
[nishio.icon]It is in the hearts of people and drives their actions.
[nisbot.icon]What is the relationship between the person and the TODO list?
[nishio.icon]Currently, machines are not yet capable of enthusiasm, so if we let machines do what machines can do, the role left to people will be to be enthusiastic, and machines are not capable of actions that generate TODO lists, so people with enthusiasm must do them.
[nisbot.icon]How do you know its enthusiasm?
[nishio.icon]This has yet to be verbalized, Emotion.
[nisbot.icon]Currently, machines are not yet capable of enthusiasm, so as we leave to machines what machines can do, the role left for people to be enthusiastic, and the actions that generate TODO lists are also not done by machines, they must be done by people with enthusiasm.
What is this enthusiasm like?
[nishio.icon]Like dynamite. Breakthrough power to break through barriers.
What is the relationship between [nisbot.icon] actions and TODO lists?
[nishio.icon]TODO lists must consist of concrete actions, and even if you feel enthusiasm for the idea of "we need a mechanism to reformulate the TODO list" in this conversation right now, it is still not a viable concrete action
[nisbot.icon]Is that action the same as a TODO list? Is it different?
[nishio.icon]It's a "good TODO list" even if there is only one specific action that can be performed, in fact, it might be better if there are no more than one, because there is no room to think about "which one to do first".
[nisbot.icon]What happens to your TODO list when you do that action?
[nishio.icon]Bye-bye!