Keichobot会話ログの例
Logs that seem to be suitable for getting an atmosphere of how to use [the listening out chat system].

	[I'd like to talk and sort out whether to write an explanation at this point or implement the new feature first].
		I realized that what I had lumped together under the term "new features" could actually be divided into two categories.
	[I don't want to put my data in a repository, but I want to sort out what to do with it.]
		'I don't want to put the training data for machine learning in a repository to deploy on a server, what would be the best way to do that, I need to organize it'
		I am aware of the existence of unnecessary fear.
	[Consider the following explanations of new features].
	　A new command called the UPKW command was created today, and I'll consider explaining it."
	　I realized that the explanations were biased toward the perspective of the function creator and lacked the "what makes you happy" from the user's perspective.
	[conversation log 2021-01-31].
		When I asked for advice on how to write a test, I was asked where the test was located, and when I tried to answer that it was the same as an existing test, I realized that it didn't have to be the same.
	Lecture Project
 	[I've accepted a speaking engagement at my alma mater, and I'd like to talk about it.]
  　I felt bewildered about a project with a long-overdue deadline.
 	　I realized this is the anxiety of being in a fog with no way to know what's ahead.
 	　I realized it would be a good idea to discuss with them "what we need to do to get out of the fog."
		[It would be good if you could verbalize what exactly you are going to do about the speaking project.]
	　[It would be good to have a policy on the content of lectures and to verbalize the content of short lectures].
 	　Policies are now roughly in place.
		[I would like to complete the outline of my presentation.]
		Organized by Regroup (now [Kozaneba, a digital stationery for organizing thoughts])
　		[講義概要の下書き作成]
		[I think there's a bit of a difference between "problem-solving options" and "life options."]
  　Let's ask others about the latter, and I'll come up with an idea.
  　→How did you learn about your options in life?"]
	[Is the next development a network connection or a solution to the in-drag full-size display problem?]
		I realized that "network connectivity" should be the priority, but instead of "the ability to connect" it should be "the ability to store in the cloud".


--- Unorganized notes

	[I was talking about how active learning doesn't work, and I concluded that I should read a book.]
	[I have realized that meaning is not a set, and would like to discuss if this has any practical application].
	[I would like to come up with an explanation for the ability to create a map of Regroup from chat logs].
	[I hope this gives readers an idea of what the empathy writing mode I created today looks like].
	[Reflecting on the addition of a purpose-specific mode].
	[support for proposal to create something new].
	[create a system that motivates people to chat with each other].
	[It would be nice to have more language about what happens after exporting from Keicho to Regroup].
	[I would like to discuss the design of Regroup.]
	[About the "Do-It-Yourself Intellectual Production Program"]
	["Would like to, but haven't started."]
	[Chatbots also have the effect of focusing them].
	[Good if thinking develops regarding Will/Can/Must and project adoption].
	[How to resolve the "private/public divide" to suit your needs].
	[I want to give a different name to the new version of Regroup.]
	Hope you can verbalize why [scrapbox-keicho is interesting].
	[What would you like to see happen with the creation of Kozaneba?]
	[Hopefully we can find a way to cut an interim presentation].
	[I want to organize what I'm going to talk about in my midterm presentation.]
	[It would be nice to know where Kozaneba is going next.]
　[I would like to think about a non-chat form of Keichobot.]
　#KeichobotLog

Old title [Sample of how to use Kikidashi Chat].
