Conversation log 2020-06-07-2
	When ideas are divergent and confusing, can we help them pick up the pieces? If so, I would like to know how to do that.
		The machine creates the Next Action and gives it to the human.
		[Out of control] is a state of [no next action
		[People are more productive when they decide on a Next Action.]
		Even if it's random, it works anyway, and the more accurate it is, the more valuable it becomes.

from [conversation log 2020-06-07].
[nishio.icon]Let's talk.
[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon]When ideas are divergent and confusing, can you help them pick up the pieces? If so, I'd like to know how to do that.
[nisbot.icon]Is there anything else you can tell us about that yield?
[nishio.icon]What is the purpose of the collection, and what makes you happy when it is collected? I wonder if this is also the purpose of determining the next action.
[nisbot.icon]What type of next action is that next action?
[nishio.icon]When people are confused and don't know what to do next, they can work with peace of mind when they decide on a Next Action. When we are confused and wondering what to do next, we are not very productive. When the next action is decided, we are productive.
[nisbot.icon]Anything else about that Next Action?
[nishio.icon]Hmmm... if a system where a machine decides on a next action and gives it to a human and the human performs the action as a subroutine is more efficient than a human-only system, does economic rationale make that system more popular?
[nisbot.icon]How do you know its Next Action?
[nishio.icon]If it's a situation where a human can't decide, then a machine can decide and hand it over.
[nisbot.icon]Is there anything else you can tell us about that person?
[nishio.icon]People are lazy.
[nisbot.icon]What kind of human being is that?
[nishio.icon]People who cannot decide for themselves what to do next.
[nisbot.icon]Hmmm... if a system where a machine decides on a next action and gives it to a human and the human performs the action as a subroutine is more efficient than a human-only system, does economic rationale make that system more popular?
Where is this Next Action?
[nishio.icon]If candidates for next actions can be created mechanically by inputting the current situation, it is possible for a machine to decide on a next action. An example of this is the Shogi AI, which, upon inputting information about the current state of the board, determines a "candidate next action" based on the rules and then selects it.
[nisbot.icon]How do you know the machine?
[nishio.icon]NG
[nisbot.icon]Is there anything else you can tell us about that machine?
[nishio.icon]There is no problem in playing against each other even if the selection from the candidates for the next action is random, but it is too weak to be of value. Value is created when the choice is somewhat wise.
[nisbot.icon]What do you value?
[nishio.icon]Next Action Decision System.
[nisbot.icon]What is the human relationship to that Next Action?
[nishio.icon]If the next action is decided and people are satisfied with it, people can work efficiently.
[nisbot.icon]Is that Next Action the same as a human being? Is it different?
[nishio.icon]No, it is not. A human being is a device that executes a Next Action, and this does not necessarily have to be a human being.
[nisbot.icon]Where is that Next Action?
[nishio.icon]Machines make it and pass it on to humans.
[nisbot.icon]What happens to Next Action when its human?
[nishio.icon]Either people see Next Action and are motivated to do it, or they see Next Action and are not motivated to go through with it.
[nisbot.icon]Where does that Next Action come from?
[nishio.icon]The machine makes it, but of course we'll have to dig into the "how it works"!
[nisbot.icon]What happens to humans during Next Action?
[nishio.icon] "I see, let's do that!" Sometimes I get excited. Sometimes it doesn't.
[nisbot.icon]What is the difference between Next Action and humans?
[nishio.icon]The next action that the machine gives us is "I see! If the probability that it is "I see!" is non-zero and well directed, then it is the same as the relationship between humans and gacha, and humans will be [intermittently reinforced] to repeat that behavior.
[nisbot.icon]What is the relationship between that Next Action and the machine?
[nishio.icon]We need a mechanism that allows machines to create next actions.
[nisbot.icon]Is that Next Action the same as a machine? Is it different?
[nishio.icon]No, the machine creates.
Summary so far
The machine creates the Next Action and gives it to the human.
People will be productive.
Unable to pick up the pieces, is in the absence of Next Action.
Even if it's random, it works anyway, and the more accurate it is, the more valuable it becomes.
[nisbot.icon]What happens to the machine during its Next Action?
[nishio.icon]NG
[nisbot.icon]What happens to Next Action when that machine?
[nishio.icon]NG
[nisbot.icon]What is between that Next Action and the machine?
[nishio.icon]The reason I can't answer any of these kinds of questions is that that is not clear to me either. Something that should be a new consultation separately with something like "I want to clarify the relationship between Next Action and machines."
[nisbot.icon] What is the relationship between that Next Action?
[nishio.icon](No, you can't choose "between" as a keyword.)
bye-bye
