Conversation log 2020-06-07-4
	I wonder if we could make the conversation with this bot itself the content.
		Collect lots of chat logs.
		A record of the moment when a new idea is born.
		Putting chat logs in Scrapbox
		Scrapbox is a pattern discovery support system
		Unknown beneficial patterns are discovered.

from [conversation log 2020-06-07].
[nishio.icon]Let's talk.
[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon]I'm thinking about the possibility of making the conversation with this bot itself a content.
[nisbot.icon]Is there anything else about that bot?
[nishio.icon]Asking questions brings out content I didn't expect.
[nisbot.icon]
>TODO
>Post this chat log to Scrapbox
>Create a page to come up with a list of questions
What type of chat log is this?
[nishio.icon](Hmm, this has a bug where input prior to the start of the conversation is used.)
Chat logs are logs of conversations with bots.
[nisbot.icon]Is there anything else about that chat log?
[nishio.icon]I'm wondering if a little processing would make it more interesting to read.
[nisbot.icon]Anything else about that reading?
[nishio.icon]The record of the moment when a new idea is born is useful in creating a method for generating ideas, but not much data has been accumulated.
[nisbot.icon]Anything else about that idea?
[nishio.icon]This is the type of idea that is generated by noticing blind spots, and how machines can support that awareness is important when considering intellectual productivity.
[nisbot.icon]What do you value?
[nishio.icon]If patterns of awareness are discovered, it is easier to encourage them, awareness is useful, so the patterns that create it are useful.
[nisbot.icon]What type of pattern is that?
[nishio.icon]For example, "What is the relationship between X and Y?" and by asking "What is the relationship between X and Y?", an unexpected connection is discovered as a result of thinking about the relationship.
[nisbot.icon]If patterns of awareness are discovered, it is easier to encourage them, awareness is useful, so the patterns that create it are useful.
Is there anything else you can tell us about this pattern?
[nishio.icon]For example, it's not built into this chat system, but if you present the results of a dictionary search for a word and ask, "Is this what you wanted to express with the word X?" and then the user is prompted to make a new verbalization, "No, that's not what I meant.
What is the relationship between [nisbot.icon] chat logs and patterns?
When many [nishio.icon] chat logs are collected, unknown and useful patterns are discovered among them.
[nisbot.icon]Where is that chat log?
[nishio.icon]It's rather scattered, but I thought it would be good to put it all together in Scrapbox or something.
Are [nisbot.icon] chat logs the same as patterns? Are they different?
[nishio.icon]Chat logs are concrete phenomena, and abstract concepts extracted from these concrete phenomena are patterns
[nisbot.icon]Where is that chat log?
[nishio.icon]Now they're scattered.
[nisbot.icon] Chat logs are concrete phenomena, and abstract concepts extracted from these concrete phenomena are patterns
How do you know about this chat log?
[nishio.icon]Scrapbox is a strong intellectual production tool for the discovery of unexpected relationships, with relationships being discovered later when they are posted together in Scrapbox and then bracketed or picked up in front of "I see", Scrapbox is a strong intellectual production tool for the discovery of unexpected relationships.
[nisbot.icon]What is the relationship between that Scrapbox and chat logs?
[nishio.icon]Chat logs are not merely accumulated in their original form, but are inscribed on Scrapbox, making it easier to discover relationships across logs.
Is [nisbot.icon] its chat log the same as Scrapbox? Is it different?
Putting chat logs in [nishio.icon]Scrapbox
[nisbot.icon]What are those chat logs like?
[nishio.icon]Raw observation data
What happens in Scrapbox when [nisbot.icon] chat logs?
[nishio.icon]I've been posting some stuff on Scrapbox now with the title "Nodes of Thought", which serves as a connection between various pages by bracketing the keywords in it. The nature of Scrapbox as a network will be improved by adding something similar to this.
What happens in the chat log when [nisbot.icon] its Scrapbox?
The [nishio.icon]Scrapbox's relationship discovery effect will discover connections between chat logs, we've talked about similar things before, etc., and automatically link to them.
[nisbot.icon]What's between that chat log and Scrapbox?
[nishio.icon]Synergy
What happens to the pattern when [nisbot.icon] chat logs?
The [nishio.icon] pattern is found
What happens in the chat log when [nisbot.icon] that pattern?
[nishio.icon]This will lead to improvements in the chat system itself.
What is the difference between [nisbot.icon] chat logs and patterns?
[nishio.icon]Abstract patterns are hard to understand, but when set against concrete logs they have a positive effect
[nisbot.icon]What is the relationship between that pattern and Scrapbox?
[nishio.icon]Scrapbox is a pattern discovery support system.
[nisbot.icon]Is that Scrapbox the same as the pattern? Is it different?
[nishio.icon]Patterns are created after the fact on Scrapbox!
[nisbot.icon]How do you know what the pattern is?
[nishio.icon] It's like, "Whoa, that's a pattern."
[nisbot.icon]What does that pattern look like?
[nishio.icon]Looks like a "blind spot card" that I keep in Scrapbox.
[nisbot.icon]Where is that Scrapbox located?
[nishio.icon]Bye-bye!