Conversation log 2020-06-08-2
	An experiment to see what happens when reading is done while interacting with a bot
		[Social Physics]
		When you think a bot's question is pertinent, if you read on and find something different, you're hesitant to ignore the question and write about it.
			If a question seems appropriate but doesn't have an immediate answer, it's not a useful question at this point and should be ignored.

[nishio.icon]Let's talk.
[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon]Today we're going to do an experiment to see what happens when you do a reading while interacting with a bot.
[nisbot.icon]What type of bot is that?
[nishio.icon]I thought I would be able to think better during the reading because I would be able to listen and ask questions. On the other hand, there is a possibility that the reading will not progress at all. I ignore questions that are not interesting.
[nisbot.icon]Anything else about that reading?
[nishio.icon]Social Physics: The New Science of How Good Ideas Spread
[nisbot.icon]Anything else about that social physics?
[nishio.icon]Sociophysics seems to be the right term, it says in the table of contents that it is a new framework for understanding social evolution with big data.
[nisbot.icon]Is there anything else about that call?
[nishio.icon](ignore)
Part 1, Social Physics, consists of three parts: "Exploration: How to discover good ideas and lead to good decisions," "Flow of ideas: What underlies the collective ground," and "Engagement: Why we can work together."
[nisbot.icon]Is there anything else about that social physics?
[nishio.icon](go read it)
It's a quantitative social science that describes the mathematical relationships between the flow of information and ideas and people's behavior.
[nisbot.icon]What type of relationship is that relationship?
[nishio.icon]For example, by deliberately slowing down the speed at which information is transmitted, it can be controlled so that a one-size-fits-all situation is less likely to occur.
[nisbot.icon]What do you value?
[nishio.icon]I'm still trying to decide if the book is worth it. I think it's true that when you have a lot of people, statistically there is some kind of pattern, but how the outlier people behave may have a big impact on the results, and if that is not controlled for, it disappears from the experimental results, but actually, if you change that behavior and divide the experiment into two groups. There might be a noticeable difference.
[nisbot.icon]Is there anything else about that pattern?
[nishio.icon]We've observed that increasing the speed of information distribution can cause echo chambers and lower performance, that's one pattern. p47
[nisbot.icon]What type of pattern is that?
[nishio.icon](This usage has the problem that when you think the bot's question is an appropriate question, if you read on and find something different, you'll be hesitant to ignore the question and write it. I could write it as a comment, but that would no longer be included in the parsed data, which would be inappropriate).
(If the question seems appropriate but is not answered immediately, it is not a useful question at this time and should be ignored.)
Apparently the most important concepts in social physics are "idea flow" and "social learning."
[nisbot.icon]How do you know its social physics?
[nishio.icon]Engagement means social learning that occurs primarily within groups of peers. It leads to the formation of behavioral norms and the social pressure to enforce them.
Like social pressure to get ideas flowing faster. p34
[nisbot.icon]Is there anything else about that engagement?
[nishio.icon]Bell Starr Research, Starr has an interactive relationship with experts in advance and can get a quick and useful response.
[nisbot.icon]What kind of star is that star?
[nishio.icon]The outstanding researcher of performance.
[nisbot.icon]Is there anything else you can tell us about its performance?
[nishio.icon]When one lacks personal information about oneself, one becomes insecure and relies on social information, which is the confidence-building effect of social learning. We learn by watching what others do. However, this can have harmful effects, such as groupthink.
[nisbot.icon]What type of behavior is that?
[nishio.icon]When a feedback loop is created within a social network, we see many times similar ideas that are slightly different. As a result, we become overly confident and believe in the idea. Confidence amplification effect due to echo chambers.
[nisbot.icon]Is there anything else you can tell us about the results?
[nishio.icon]Interventions that allow isolated people to interact more with others or allow people who are overly exposed to certain people to interact with new people can change the structure of the network.
[nisbot.icon]Is there anything else you can tell us about that other person?
[nishio.icon]If someone is behaving in a way that has nothing to do with social learning, they are likely counteracting the effects of social learning from their unique experiences. They could be both wise and weird. Common opinion among them is useful
[nisbot.icon]What type of impact is that?
[nishio.icon]Homogenizing influences on ideas that are repeated in society.
[nisbot.icon]Is there anything else you can tell us about its impact?
[nishio.icon]Undermines diversity of ideas
[nisbot.icon]What else can you tell us about its diversity?
[nishio.icon]When the speed of the flow of ideas is appropriate, members of the group will be able to make better decisions than if they act in isolation. When habits are shared, the community begins to develop a collective intelligence, which surpasses the intelligence of individual members.
[nisbot.icon]What kind of intelligence is that?
[nishio.icon]Ideas flow more easily when you see them in action than when you hear about them.
[nisbot.icon]Is there anything else you can tell us about that behavior?
[nishio.icon]This sounds like it has something to do with cooporation.
[nisbot.icon]I thought I could think better while reading because it listens and asks questions. On the other hand, there is a possibility that the reading will not progress at all. I ignore questions that are not interesting.
How do you know this reading?
[nishio.icon] "After checking the mathematical model of learning in complex environments, we conclude that the best learning strategy is 90% exploration and 10% should be spent on individual experimentation and reflection." er, I'm not sure I agree with this conclusion without checking the paper.
[nisbot.icon]Is there anything else about that quest?
[nishio.icon](Reference 15 in Chapter 3)
p82 Starr encouraged everyone on the team to be a party to the outcome, rather than thinking of teamwork as fulfilling one's role within the team
[nisbot.icon]Is there anything else you can tell us about that teamwork?
[nishio.icon]Engagement = a state of repeated collaboration, which promotes a cooperative attitude worthy of trust.
[nisbot.icon]How do you know its engagement?
[nishio.icon]Social-type incentives can be created by giving
[nisbot.icon]What type of social type incentive is that?
[nishio.icon]In the case of fitness, for example, the incentive is not given to the target individual for exercising, but to those who are socially connected to the target, when the target exercises, and the act of socially encouraging the target to exercise is promoted. It is not given when the target exercises, but when the exercise actually takes place.
[nisbot.icon]Is there anything else about that person?
[nishio.icon]p99 Engagement requires interaction, cooperation, and building trust
[nisbot.icon]What type of engagement is that engagement?
[nishio.icon]Chapter 5: Collective intelligence, how collective intelligence emerges from patterns of exchange
[nisbot.icon]How do you know what the pattern is?
[nishio.icon]It was most helpful to have equal voice among the participants in the conversation
[nisbot.icon]What is the relationship between reading and engagement?
[nishio.icon]The next most effective was the social intelligence of the members, their ability to read the social signals of their opponents. Social intelligence tends to be higher in women, so the groups that included women did better.
[nisbot.icon]What else can you tell us about its intelligence?
[nishio.icon]Oh, talking about patterns of idea flow p111
Number of ideas
Density of interaction: "likes" and "what? in response to a comment.
Diversity of ideas
[nisbot.icon]Where is that pattern?
[nishio.icon]Are number and diversity two different things?
[nisbot.icon]Where is that diversity?
[nishio.icon]An idea that could simply be implemented, a display where if one person is talking too much in a meeting, the circle moves to that side.
[nisbot.icon]What kind of person is that person?
[nishio.icon]p139 How to evaluate diversity of ideas
[nisbot.icon]What kind of diversity is that?
[nishio.icon]Body type solution, predict what others will say, if the prediction is correct, ignore it because it is already common knowledge.
[nisbot.icon]What is the relationship between the person and the engagement?
[nishio.icon]Wise-guy type solutions, people who can predict the behavior of others but act differently, predictability is evidence of a good understanding of common knowledge, but if they act differently, they have some reason (e.g., information that others do not know).
[nisbot.icon]How do you know what you are doing?
[nishio.icon]Third, people who often hold similar opinions are not considered independent.
[nisbot.icon]What is the relationship between engagement and action?
[nishio.icon]Computer-Assisted Social Intelligence
[nisbot.icon]Is engagement the same as action? Are they different?
[nishio.icon]Practical charismatic, charismatic intermediaries engage through brief conversations with many people, bring equality of expression machines, are interested in the flow of ideas, not just diplomatic
[nisbot.icon]Where is that engagement?
[nishio.icon]p143
[nisbot.icon]What happens to behavior during engagement?
[nishio.icon]Charismatic intermediaries can be created through training, asking questions and gathering ideas, communicating and exchanging ideas with others
[nisbot.icon]How do you know the person?
The case of the [nishio.icon]Red Balloon Challenge, a social incentive to not only attract many people but also to form a functioning organization and to pay for referrals.
[nisbot.icon]Where does that person come from?
[nishio.icon]If we had crowdsourced, we would have been able to bring people together, but we wouldn't have been an organization that works together.
[nisbot.icon]Is that person the same as engaged? Is it different?
[nishio.icon]Market-type thinking, a model that incentivizes uniformed employees to work, overlooks networks among employees, and does not create opportunities to learn from each other because engagement is non-existent.
(It's taken me 2.5 hours to read 162 pages so far.)
