MMT
[I asked Takeshi Nakano, "Isn't MMT crazy?" I asked him. Diamond Online https://diamond.jp/articles/-/230685]

　No country with the right to issue its own currency has ever defaulted on its own currency-denominated bonds.
　The source of funds for banks to buy government bonds is not private-sector deposits.

　commodity currency theory
　　Why is there fiat money in circulation?
　credit theory
　　Book-entry currency was used in Mesopotamia before effects were invented.
　　A coin is a deed of loan.

　By imposing a tax obligation, money is given value as a "means of resolving the tax obligation".
　
[https://gyazo.com/2bc6085b4a0152f7afb5fd02de7268be]
We tend to think of physical cash (A) as "cash deposited by a bank and lent to a factory or something," but it is not.
A bank can create two opposite claims: a "deposit," which is an obligation to give cash at the other party's request, and a "loan," which is an obligation to give cash on the due date.

Banks' lending constraints are not the amount of cash held, but the borrower's ability to repay
　Even if the monetary base is increased, credit creation is not possible without borrowers
	[https://gyazo.com/201d399f6caaa6e487281891dc921e27]
	https://diamond.jp/articles/-/230846?page=3

Government bonds do not siphon off private capital, but on the contrary increase it.

Prices rise because people buy more than they can supply, not because there is more money in circulation.

During deflation, even if saving is a virtue in the private sector, if even the government saves money, we will never get out of deflation.

Taxes are not a means of securing financial resources, but a means of reducing demand
Means of inflation control
The money taken as tax will disappear.

For currency to circulate, the government must have a budget deficit

Income taxes automatically prevent over-inflation because the amount of taxation increases when the economy is booming.
The consumption tax is weak in this function.

The fiscal surplus during the bubble period was because the excessive inflationary trend was absorbed by income taxes.

