Otters Approach
　[Otters]
　　>By not appointing a master brewer, the production method is based on data, and IT is utilized to achieve both delicious taste and mass production.
　　[Otters, the world's best sake - Why we use data to make sake | My Navi News https://news.mynavi.jp/article/20180913-692380/]
　　>Toji is said to be experienced and intuitive, but experience is the accumulation of data, and intuition is the leap of thinking between experience and onsite phenomena. These two things are thoroughly converted into data, which is then looked at by the employees as they make sake.
　　[The Toji and the Brewer are not the makers of Otters! Asahi Shuzo's management turned a pinch into an opportunity (1/2) - MONOist https://monoist.atmarkit.co.jp/mn/articles/1908/27/news026.html]
　　>I have made it so that I, as president, will do the sake analysis and data analysis that has traditionally been done by the toji. However, as president, I could not do it all the time. So, in the third year, I brought in a part-time woman and asked her to analyze the data, and that is when the current form was created.
　　>A person has to make the final decision using the data. We need data to make it easier to make decisions, though.
　　>Others are now able to use [Excel], which is a big part of why otters are going so well.
		[Otters without a master brewer, the secret of insane management | Food Products | Toyo Keizai Online | The New Standard for Economic News https://toyokeizai.net/articles/-/41798?page=2]

　[Industrialization]

For various "human things," "Couldn't we apply the otter approach to this?" for various "things that people do.
	[Industrialization of chit-chat]
	　The chit-chat is made of craftsmanship.
	　Myself and chatbots
	　　[listening chat system].
	　Two people and a bot.
	　　Bots assist communication between two people who have never met before.
 	　[one-on-one before many].
	[Industrialization of the community]
	　Instead of leaving it to the human craftsmen called "community managers" to make the community look good, the machine will do it.
　　I've heard that chatbots [balance the amount of comments].
　　Maybe it's easier to talk about relationship problems with a machine than with [a flesh-and-blood human being].
