open world
What makes open world games so popular?

[tokoroten.icon]
	Because there is redundancy against [physical warfare]. It is easier to deploy soldiers because the battle lines are wider.
		So something like 25 billion yen will be invested.
			[Development and marketing costs for "GTA V" are the highest in gaming history at 26.4 billion yen | Game*Spark - Japanese and international game information site https://www.gamespark.jp/article/2013/09/10/43345.html]
	In STGs, it's like [fighting in a bottleneck], and there's no way to expand the front line, so you're fighting with a limited number of people.
	関連
		[Death Landing is a map structure that shows the development process].
		[Zelda BoW before the physical battle began].

[nishio.icon]
	How can it be economically rational to play a physical game in an open world game? I'm sure it will increase the playing time of the purchaser, but since it's not a sub-subscription, it won't lead to revenue, nor is it likely to lead to increased sales for the next game and the next one.
		If the quality is so bad, it will go down, but in the [Kano model], it's a natural quality.
	Perhaps use it as a training opportunity for employees, gradually assigning people who have grown up on larger projects to smaller projects?

[tokoroten.icon]
	It's a batting average problem - right? If you are trying to increase your batting average, you should be plugging resources into an open world.
	Think in terms of the probability of exceeding the break-even point, not the average return rate.
	In order to eliminate failures, they are going large scale, which is what American game development is all about.
	The model is that the more money you plunk down, the more your batting average and sales both grow.

	Then, when the user base grows enough, it will be DLC.
	With DLC, the profit margin is much better because you can go directly to the platform without going through retailers.
	For in-store sales, it is 40% manufacturer, 10% platform, and 50% retail, with the retailer selling at 30% off. For download sales and DLC, it is 70% for the manufacturer and 30% for the platform.

[nishio.icon]
	Ah, I see...DLC...you're saying that it's important to "never finish playing" in order to maintain the opportunity to charge, and that plunging resources into making the world bigger will lead to higher profit margin DLC sales.
	And DLC itself, unlike the design of the game itself, has less [uncertainty], so it's easier to manage the project.

[tokoroten.icon]
	Yes, DLC is solid with sales potential without challenge, and it can absorb excess manpower until new projects enter the volume game.
	DLC absorbs the human resource bias in game development.