fake X
A person A, who does not have a proper understanding of a certain X, gives an inappropriate education about X, so that person B, who has received that education, has negative feelings about X (rather than toward A) [human bug].

---
>For example, there are two types of criticism of "PDCA" (whatever it is): criticism of "fake PDCA" which is not PDCA in the first place, using the term PDCA, and criticism of the side effects caused by achieving PDCA, and these two are completely different. The two are completely different.
	https://twitter.com/rashita2/status/1274141158692622336

[nishio.icon]
	Someone who clearly does not understand "PDCA" (not only PDCA, but any value can be substituted) pushes "fake PDCA" on the back of authority such as internal training, etc. The person who is forced to do so accumulates hate and criticizes "PDCA," but that person also believes that the "fake PDCA" he was taught is "PDCA," and the situation turns into a totally sterile argument... The composition of the debate is completely sterile...
	Patterns in which the person playing the "teaching role" does not really understand the content of what he or she is teaching.
		Often, for some reason, the criticism is directed at the content, not the person.
	In general, it's a hurdle because you need to know you're getting it right in order to realize that the teacher is teaching you the wrong thing.
		But not so much when it comes to practical skills.
		You wouldn't trust a "programming instructor who hasn't created his own programs" or a "design thinking instructor who hasn't designed his own stuff."
		Practical technical knowledge can be [verified] as to whether the understanding is correct by putting it into practice and whether useful results are obtained. [Verification of understanding].
		Instructors who do not practice do not verify that their understanding is correct, so they teach with the wrong understanding.
	[src https://twitter.com/nishio/status/1274194275081703425?s=21]

relevance
　[Hating what is beneficial because of stupid educators].
