The number of people depends on the phase of the project.
At Mattermost, an unexplored junior, we asked the question, "When developing a game within a company, how many man-hours do you spend on what?" The question was asked by [tokoroten][tokoroten.icon], and he talked about a lot of things. It was a pretty interesting conversation, and it would have been a shame to let it drift away, so I've summarized it here.

[tokoroten.icon]
 [https://gyazo.com/58156aade20a479ff9cf0b97b49c89bc]
	Horizontal is time, vertical is number of people.
	In the first phase, the project is compact, with 1 planner + 1 programmer, or 1 planner + 1 graphic designer, etc., and runs for several months.
		Game companies often have a number of guys making small prototypes behind the scenes.
  When they say, "Let's make the next one," they can bring that kind of project to us.
  	Some cases are continued by individuals without sending them out to the company.
  	Related [lumpy soul] [brave 30] [ACE OF SEAFOOD].

	Once a small number of prototypes and image boards are completed, we will gradually add personnel.
		When the development phase starts, start by modifying the prototype to solidify the gameplay.

	Once the gameplay is solidified, a decision is made to approve continued development (for this demo, we will work super hard).
		Once the decision to continue development is made, a budget is set, and the company moves into the volume phase using surplus in-house personnel and outsourcing.
	 The physical battle to represent the game begins.
		Adding personnel and building assets at once, while combining them with various storylines.
		The number of staff members shown in the staff roll is the number of staff members at the peak during this volume war.

	Continued Development Approval Process (realistically, there are two or three different ways to go around this)
	Once all the assets to represent the game have been created, the personnel for the physical quantity are transferred to another project.
		The original core members remain.
		QA team joins and debugging work
			Often a part-time job for students and freelancers.
		Bug fixes by core members

	Once the bugs are removed, adjust the release date and release (for the consumer version)
		Many times it is like delaying a release by six months in order not to coincide with the release of a major production.

	Game development is subject to large fluctuations in personnel demand.
		One company cannot absorb the wave, so there is a cooperative development company
		After the game is released, the core personnel will be released as well, so to prevent this, DLC will be developed to buy time until the next proto development.
			Related [open world].

[nishio.icon]
	I was blind to the fact that the number of people changes depending on the phase of the project. I only had an image of a quantity war.
	This fits well with the Conquer phase / Divide phase of [Divide After You Conquer].