Adaptation to changing environment
Business organizations need to adapt to changes in the environment.

Specifically, the usefulness of a domain that was useful in the past decreases and the usefulness of another domain increases.
In the past, companies responded to this change with [personnel changes].
[https://gyazo.com/57b27705756cd88615230ace863235e5]
On the left, two people are placed in domain A.
If the usefulness of that domain decreases and the usefulness of the new domain B increases, the firm reassigns one person from A to B. The person just moved is less productive (center).
Productivity will increase as the person learns new areas.

As time has progressed, software has been used to increase productivity. As a result, the learning of those who moved to a new domain alone no longer increased productivity as much as in the original domain.
[https://gyazo.com/3977bb00ed53fa640c29fa7050d22763]
In this situation, adaptation to a newly useful domain requires the development of software for that domain.
When software is ordered outside the organization and made under a contractual agreement, the specifications need to be clarified in advance. However, a person who has just moved to a new domain cannot describe the appropriate specifications. Outsourcing software has a negative impact on the speed of adaptation to change.

To address this problem, software development must occur in parallel with the learning of "those who cannot yet verbalize their requirements specifications" who have just moved into a new domain.
The methodology for development is [agile], and tools that support this approach include kintone. kintone allows non-engineers to create business applications while learning a new domain, without having to verbally communicate domain knowledge to others while learning.

How the story started
	[DX = move to double-loop learning utilizing digital].

relevance
	[System development by non-engineers]

Background of [creating agility through personnel transfers] no longer working very well.
