Culture Fit Specter
summary
　It is difficult to visualize a "culture" that is not easily identifiable, and a growing company will change over time.
　 [Specterized] when they chant the mantra, "Culture fit is important."
　[Culture fit] lowers [communication costs
　but is lowering communication costs a good thing?
　There are other ways to lower communication costs besides culture fit.
　　Decide on a framework for the conversation.
　　Decide how to make decisions.
　　Information Sharing

>[asanokoji https://twitter.com/asanokoji/status/1284280678427721730]: [culture fit] lowers [communication costs]. It takes too long to agree on something if there are different fundamental values when making a decision. If there is empathy for the mission and style, agreement can be reached in a surprisingly short time. Skills are important, of course, but if empathy for the mission and style is not recognized, the person should not be hired.

>[seiya_narita https://twitter.com/seiya_narita/status/1284286485370253312]: I didn't have the perspective that culture fit would lower communication costs in a recruitment and retention position!

>[osamu419 https://twitter.com/osamu419/status/1284392311611207680]: It is true that communication costs can be reduced through "culture fit", I have been doing it for some time now, and I have a real sense of it. On the other hand, I have seen the limits of communication costs that can be reduced by "culture fit". For one thing, it is difficult to visualize "culture," which is a mysterious thing to begin with, and growing companies change subtly. Hiring will continue in this environment. twitter.com/asanokoji/stat...

>[osamu419 https://twitter.com/osamu419/status/1284392622568558594]: the trouble is that diversity is not a bad thing for a team. It's hard to tell if it's the discovery or the culture fit that is lowering communication costs in the first place. Is it bad that communication costs go up but diverse personalities clash, change, and sometimes create something new? I am lost.

>osamu419 https://twitter.com/osamu419/status/1284392939062349825]: Culture is important, but I think two mechanisms are necessary to reduce communication costs. One is a "framework" for conversation. The BI (Before Internet) organization is so called a "reporting line," and the decision-making and communication lines are essentially the same. However, conversations are held in all directions within the company. This is accelerated by IT.

>[osamu419 https://twitter.com/osamu419/status/1284393221624172544]: so communication costs within an organization are likely to occur when it is unclear who makes decisions or the mechanisms for making decisions. " The case isn't happening in the conference room!" (lol), I think most of the internal communication is done "on the spot", not in meetings, and there is a lot of "which is right" discussion.

>osamu419 https://twitter.com/osamu419/status/1284393579440336897]: And then, as they try their best to explain how they are right, more interpretations than facts are made, and the line becomes an air line, and finally, it becomes an emotional line. The worst case scenario is that the situation becomes flammable, and it takes a lot of "communication restoration cost" to get back to the original relationship.... This is the same on the Internet, but it is likely to accelerate as the use of IT in the company progresses.

>[osamu419 https://twitter.com/osamu419/status/1284393874648002561]: So, we are still talking about the first of the two, "Conversation Frameworks" ( I'm still talking about the first of the two "conversational frameworks" (lol). This conversational framework can be divided into two parts. One is the "problem-solving method" in Cybozu terminology. The first is the "problem-solving method" in Cybozu terminology, which is a secret method for sharing what you want to say and solving problems. The other is the organizational mechanism. The other is the organizational mechanism.

>[osamu419 https://twitter.com/osamu419/status/1284394147072192513]: still going on. The problem-solving method is about communicating what you want to say in a way that is easy for people to understand." It reduces conversations like "I don't understand what you mean. Organizational mechanisms clarify how decisions are made, which eliminates arguments where people are trying to mount each other, and reduces flare-ups. This means less time for conversations.

>[osamu419 https://twitter.com/osamu419/status/1284394359706664960]: finally the second one. Information sharing. No need to notify, but discuss while keeping logs accessible. Do not do it behind closed doors. By the way, not only meeting rooms but also e-mail and chat rooms are secret rooms. When you search for information, you will get hits on sharing. In this way, you can use lifelines and audiences in case of conflict, and power and authority are less likely to be used, which is another story.

>[nishio https://twitter.com/nishio/status/1284401482423349249]: this is an important perspective. When we stop thinking in terms of "culture fit is important," we reinforce the power of the unfamiliar "specter" of "culture." The culture monster often prevents organizations from adapting to change. >It is difficult to visualize the "culture," which is not always easy to understand, and growing companies change subtly. Hiring will proceed in this environment.
	>[nishio https://twitter.com/nishio/status/1284402590961156096]: In Cybozu, the phrase "there is no company" conveys the idea that "there is no company as a thinking and decision-making entity, and that each individual in the company is responsible for this. Therefore, we can work for change through dialogue." I feel that they are dismantling the company monster.
		[Maybe this monster of a company is making us unhappy.]
	>[nishio https://twitter.com/nishio/status/1284402964375863297]: i got the same vibe from the culture fit story

[Culture Fit]