It's not reasonable to ask users what features they want.
Why do you say that?


https://www.facebook.com/nishiohirokazu/posts/10222389493982721
	It is not bad to ask. It's bad to make it exactly like it is.
		Not a bad thing to hear.
			Sometimes we even let the user think about the solution. [This is what is called "participatory design.
			I think it's a good idea to ask for some reference. To be honest, you will rarely get a surprising answer, but there may be some functions that you have not thought of.
		It's bad enough to make it exactly like that.
		　It comes down to user incompetence.
		　　Users don't know what they really need.
	 			Few people know what (things) they really need for themselves.
	 			Actually, I don't really want it that badly.
	 				When I suggest a simpler solution, I tend to say, that's good enough.
	 		Users do not understand the technical cost and overall product balance.
	 		 Users do not know what is possible and what is not possible, what costs how much
	 			As a product, it is significantly unbalanced in function when it tries to do what it says it will do.
	 			It can be used as an opportunity to see the big picture of the problem, but it is not a matter of solving it as it is, piece by piece.
	 				Here, an individual request for 'what kind of functionality do you want' may suggest that there is some kind of problem. However, when we look at the problem to be solved from a bird's eye view, whether the function request, or solution, is appropriate, and whether it is really a problem to be solved, is another matter.
	 		Users are not capable of coming up with new solutions.
  			Most users are not inventive.
  			Users talk from the knowledge they know, so there are usually existing solutions out there and you have to go beyond that.
  			Many people are not capable enough to accurately recognize a problem or properly come up with a solution (i.e., a desired function) to that problem.
 		Inappropriate questions distort the answers.
				When asked, "What kind of features do you want?" I would say something lame to answer the question anyway.
			I'm not passionate about it.
				Answers given by others? Advice? Flag bearers are not passionate about things that are
	How to ask questions that elicit more useful information
		Rather than asking directly about "desired features," it would be better to work backwards from "episodes of dislike" and "episodes of happiness" to get closer to the desired features.
		It is better to separate the question from the solution in the first place.
			If the question and the solution are separated, even if the solution is not appropriate, the question remains fixed and only the solution can be modified. If we think of them together, we have to rethink, including from the correctness of the question.

