August 2020 Muscle Training Diary
Diary of 8/7
　I've been skipping exercise for about two months.
　　[Prisoner Training 202005]
　　I'm not sure if the rainy season has reduced my motivation after about three "I went outside and it started raining, so I had to stop" sessions.
　8/6 [Incline push-up]120 reps
　8/7 [Jackknife squats] 120 reps
　　[Flat Knee Raise] 120 times
　Why it was reopened
　　The lighter ones, about 5 times, I've been doing when I thought of them for the past week or so, too light to keep track of.
　　My wife was playing a game called AFK Arena, so I added it myself. This is a game where you start a battle and it becomes an auto-battle and you don't have to control anything in particular.
　　I did some push ups while I was waiting and they were about 5-10.
　　I repeated the cycle of pushing up 5 times, then pressing the "next battle" button, and easily reached 120 times.
　　　It's like you're bored because your brain isn't stimulated enough.
　　Yesterday I went out with my wife for the first time in a while, so that may have been a trigger.
Records of periods of slacking off.
　[https://gyazo.com/e12a5b377938f1f9172c2c4384f56c94]
　　Looking at the weight alone, the graph can be interpreted as "nothing has been done, but it is dropping steadily".
　　But when I look at body fat, it's stopped dropping.
　　Muscle mass is also usually the flip side of body fat.
　　Body fat percentage is increasing at a time when the interval between weigh-ins is growing.
　momentum
　　[https://gyazo.com/bb48f17db801381fa090a552f2bc3679][https://gyazo.com/8e2593dd04dbb8d0f14d9e0bd4389028]

　　　I didn't even do the moves, let alone the exercises.
　　[https://gyazo.com/8b31e48cf506ff4afb02ff8148d55c7f][https://gyazo.com/ce2bec30db019e3ab175c27926e7871f][https://gyazo.com/6da 34473e129fc37ea7f8a29404e0e48]

About AFK Arena Driven Muscle Training
　This game is designed to "accumulate resources while left unattended, which can be used to strengthen the character.
　　In other words, when you wake up in the morning, your character can be stronger and you can go where you couldn't go before.
　→ triggers exercise in the morning.
　 Wake up in the morning, strengthen your character, progress through the map while training your muscles, drink protein, and so on.
　Well, it's only the first day, so I may not be able to talk about it enough to train my muscles like that anytime soon.
　Also, I can do [jackknife squats] and [incline pushups] while looking at my phone, but not so much for the others, I need a twist!

Removed [Prisoner Training] from the title.
　Sometimes my wife does different kinds of things that she finds on YouTube or whatever.
　　Novel stimuli are important because you get bored when you get used to them.
　　That's the kind of thing you should keep track of.
　　It's a new trigger acquisition.
　　　Like doing heel lift exercises to get the calf pump going when the low pressure is uncomfortable.

8/8
　[Short bridge] 120 times
　myalgia
　　It is more appropriate to "feel the presence of the muscle" rather than pain
　I'm exercising by avoiding areas I've used before.
　　But even when I'm doing short bridges, there's still a presence on the inside of my squatting muscle sore thighs.
　　[Adductor muscle?
　Prisoner Training's original beginner program only does muscle training twice a week.
　　They're taking longer to recover.
　　In contrast, I've been doing muscle training every day for the past few days, so I'm on a fast pace.
　　I think we'll eventually have to intersperse stretching, etc. instead of muscle training.
　　　I just tried to do the flat knee raises I did last night to test it out, and I felt like I was going to hurt my back.
　　　I can do the incline push ups I did the day before yesterday, but I don't think I can do the number of repetitions because I don't feel like I've recovered.
　　　So, we'll be in a "no recovering muscles" situation rather soon.
　　Prisoner training opposes passive stretching, but does not deny its effectiveness in stimulating blood circulation and removing waste products after training ([Prisoner Training: Grip & Joints in Superlative Ministry], p. 185).
　　　[Super Joints] mentioned.
　　　　[Center of gravity feedback during squatting].
	stretch
		[hip to forward bend]
  [Illustrated - "Don't get fat" and "don't get tired" when you build muscle in your lower body].
　　Stiff thighs and calves.
　　And the way I quickly imagine it as a thigh and calf stretch is not working effectively due to my stiff hip joints.
　　　You need to bend at the waist, but your back bends.
　　　To begin with, not long ago I couldn't sit up long enough to extend my knees.
　　　　Prisoner training twist hold allows me to do this.

8/9
 Recovery Check
 　incline push-up
 　　It's still present, but I think it's okay, maybe 80% of the time.
 　jackknife squat
 　　Surprisingly recovering, about 70%.
 　flat knee raise
 　　Oh, not at all. I don't think I can get one up.
 　　The problem is not the abdominal muscles, but the lumbar back
 　　Why?
 　　　My wife says, "Because [I'm] warped."
 　　　The load is escaping to the lower back instead of the abdominal muscles.
 　　　They say if the hips float, it puts a strain on the lower back.
 　　　lift one's head
 　　　　look at one's navel
 　　　　To make it harder to slouch
 　　　surrender
 　　　　https://myrevo.jp/fitness/589
 　　　　I'm not sure about this one, but it sure seems to put more stress on the belly than the lower back.
 　　　　Now my back is already hurting, so I'll re-examine it when it's healed.
 　short bridge
 　　It can be done, but the burden is on the front of the thigh, about 30%.
 What else would we do...
  Shoulder stand squat
  　Maybe you can do it without straining your legs?
  vertical pull
  　I haven't done it because I don't have anywhere indoors where I can do it well.
  Wall headstand
  　Seems dangerous to do it with an insecure torso.
  calf raise
  　My legs and back are tired, so I guess I'm screwed.
  Passive stretching around the legs and hips or

8/10
 120 Incline Push-Ups
  I started thinking I was fine because I recovered, but I guess I didn't recover because it got hard after about 80 sessions.
  Be careful, because when it gets hard, you will want to move with vigor.

8/12
 [Jackknife squat]120
  Maybe we can take the next step?

 Supported squat 10
  Skidding.
  It's funny how the jackknife squat supports you mainly by pulling you sideways.
  And because they're compensating for that, they're not getting the full range of motion in the hip joints.
  Therefore, he is not able to support the force of falling backward with his legs when he squats in a supported squat
  When I say keep your back level with the ground, I mean fold your hip joints first.

8/14
 120 Incline Push-Ups
 I think my back hurts from flat knee raises because I don't have the basics, so I'm going back to knee tucks.
 　I avoided Neatac because it was difficult to maintain the starting position and my back would hurt quickly.
 　I decided that flat knee raises hid the instability in the lower back area by lying on the floor, but it wasn't gone, so when I did a lot of them, I would have serious back pain.
 　Do as many as possible just to maintain the starting position of the Neatac.

8/17
 Horizontal pull 120
 I bought [Train Your Core], it's a paper book, waiting for it to arrive.
 https://m.youtube.com/watch?feature=youtu.be&v=kVyQQEiA988
 　My wife suggested I do it, but I haven't.

8/18
 Jackknife squat 120

8/19
 Jackknife squat 40 approx.
 　Do it slowly to check your form and
 　Increase hip and [ankle range of motion
　　[Squat Considerations https://www.facebook.com/1129148772/posts/10222667130923471?d=n&sfns=mo]

8/20
 Incline push-up 150

8/22
 Jackknife squat 20
 　19 days fatigue is gone and it is more observable.
 　Pelvis must be pushed forward in bottom position to move center of gravity forward
 　You'll be pushing your pelvis between your legs, which are shoulder-width apart.
 　That is, movement in the direction of hip widening
 　This is stiff and not done.

8/23
 Incline push-up+ 120
  Lower platform than before (kitchen -> washbasin)
  I could only do 10 at a time after I was over 80.
 Jackknife squat 20
 　Hip joint in bottom position is a problem
　Bottom one leg [cal. fraise] 20 each

8/24
 The problem of back pain with leg raises, [Prisoner Training] read back.
 　I'll take it slow.
 　Exhale as you contract your abdominal muscles.
 　Weak back muscles, squats and bridges.
 it seemed as if ...

8/26
 Supported squat 120
  I couldn't do it at all on the 12th because I was skidding, but now I can do it.
  Have you increased your hip range of motion by practicing enough body forward in jackknife squats?
  The Supported Squat itself has a platform in front of it, so the state can't fall forward.
  Discomfort in left hip, left lower back, and right knee.
  [wall squat].
 　 https://www.instagram.com/p/CDbc-v2DZw6/?igshid=1wzkfqen00wp
 　　consideration
 　　　https://www.facebook.com/1129148772/posts/10222731196965082?d=n&sfns=mo

8/27
 Incline push-up 40×3
  Recently, I was doing 120 or so in small bursts, but it was hard to do 40 in a row at a high pace without taking a break in the middle of the day.
  It's like after 30 times, you lose the short-term energy source in your muscles and you have a hard time exerting yourself.
  120 is strictly written 1 x 120 or

8/31
 Supported squat 10 x 12
  Joint discomfort is gone.
  A bit of a knee-jerk reaction

[September 2020 Muscle Training Diary].
