Cases of procrastination in requests
[https://gyazo.com/57a3da1e665f4ee9544cd4bdabb4adbc]
There is the phenomenon of demotivated action to delegate because the probability that what you might get by delegating to others is what you want to get is perceived as "low" and the action to delegate is demotivated

The option of "why don't you just do it yourself?" is also suppressed under various pretexts such as "I don't have enough time resources" or "I should learn to delegate more work to others," and in the end, both options are postponed without being taken.

The reason I consider the above "pretext" to be a pretext is that the phenomenon of "procrastinating by not doing it" would not occur if there was a chance of achieving it if you did it yourself.
"We don't have enough time resources" also often means "the expectations of what we can get are so low that we can't make decisions that prioritize allocating time resources." A common pattern when the statement "[I don't have enough time]" is observed.
[https://gyazo.com/96b9c00b310625362b20529356bb3477]

This situation is [trapped in thinking] that the two choices are "do it myself" or "ask someone else to do it". [false choice].

As I wrote in the second half of [not expecting others], this can be interpreted as a two-step process. You know best what you want to get, so you are in charge of getting it there. I leave it to others to bring that starting point closer to the goal.
[https://gyazo.com/ed4f869c32afcf31ecc1a2bc950377ff]

補足
　Here we are again [making a false choice] when we think, "Is it better if someone else does it first and I wind up with it later, or is it better if I do it first and leave the rest of the work to them?"
　For example, a realistic three-step solution would be for me to make a rough draft, ask someone else to draft it, and then rework the finished product myself.
　　This "rough draft by yourself" is also a process to delegate, so it's hard to start if you're in an either-or state of mind about whether or not to delegate.
