Social Network Incentives
	[https://gyazo.com/5c164731efd56100550e852918b3670a]
	For example, a case where you want to promote fitness
	　Reward for Exercise" is the left pattern (market-type [incentive] for individuals)
	　Social Network Incentive: "Encourage others to exercise and reward those who do" is a social network incentive.
	experiment
	　market-based incentive
	　　Reward the individual for increased physical activity
	　Social Network Incentives
	　　Assign 2 "buddies" to each person x
	　　x's buddy receives cash for each increase in x's momentum
 　result
 　　Social network incentives were four times more effective than market-based incentives for individuals
  　Four times the amount of behavior change per dollar.

from [social physics#5edf435aaff09e0000cf92f5] p.87
	Aharony, N., Pan, W., Ip, C., Khayal, I. and Pentland, A., 2011. Social fMRI: Investigating and shaping social mechanisms in the real world. Pervasive and Mobile Computing, 7(6), pp.643-659.
		https://www.sciencedirect.com/science/article/abs/pii/S1574119211001246
	Adjodah, D.D., 2013. Understanding social influence using network analysis and machine learning (Doctoral dissertation, Massachusetts Institute of Technology).
		https://dspace.mit.edu/bitstream/handle/1721.1/81111/858279236-MIT.pdf;sequence=2
　Friends and Family Study
　　FunFit
　　Part of a study conducted by the MIT Media Lab in 2010
　　GPS, accelerometers, and Facebook feeds were collected from 130 subjects for over a year.
　　　During two months of that period, there was an intervention on physical activity
　Measuring the amount of motion with an accelerometer see Adjodah 2.3 Measuring behavior change
　Cost per unit of momentum improvement / Average improvement rate
　　control When paying compensation to individuals $83 / 3.2
　　If checked by peer-see buddy $39.5 / 5.5
　　Peer-reward If rewarded for a buddy $12 / 10.4
　Peer-see is a condition that rewards the individual as well as control, and also allows two buddies to see the amount of exercise.
　consideration
	　Buddies become a team with the common goal of "increasing x momentum".
	　Engagement (cooperative behavior) on how to increase x momentum is encouraged.
　Momentum was maintained after incentives were removed.
　Coefficient of determination of correlation between behavior change and number of calls is 0.8, 0.9 for all communication channels
　 In other words, rewarding buddies promotes communication.
