September 2020 Muscle Training Diary
　September Directions
　　incline push-up
　　　I guess I should really practice so that I can do 40 x 3 or something in a row, but I'm afraid boredom will get the better of me, so I'm going to increase the number.
　　supported squat
　　　Continue to aim for 120 times
　　　This is also doing more than the original 30 x 3.
　　　What is important is not quantity but intensity," but more important is continuity.
　　Strengthening the body's core
　　　The muscles that maintain the posture of the trunk are too weak to train the abdominal muscles, and trying to train the abdominal muscles will cause back pain.
 　　Maintain a knee-tuck starting position, short bridge, or straight bridge.
 　　　Is 150 short bridges the immediate goal?
 　　And the supported squat itself contributes to core strength.
 　Stretch when bathing.
 　draw-in
 　　Strengthening the transversus abdominis muscle as part of core training

9/1
 Incline push-up 200
  10 x 6 and 5 x...
  Not much of a load.
  　[https://gyazo.com/a4f8e2bd5e570d159108b10a4cc696f6]
　　　It's lukewarm compared to squats, where you can get a heart rate of 140 or so after 10 squats.
　　　Maybe the order should be reversed, with the guild battle lasting 90 seconds in the second half of the high heartbeat, and the first half being a labyrinth of different worlds with smaller battles going on.
9/2
 I was dizzy from the guerrilla downpour [CalFlaze]50
　　Level 2 Bottom both legs knee extension
　[Short bridge] 70 x 1

9/3
 Short Bridge 150
 Supported squat 120
  20×2、1×80
  When I try to avoid lateral force as much as possible, I feel a pull on the back of the left thigh and near the pelvis in the bottom position
  　What muscle is it? Hamstring? Even though my knee is bent?
  　Has the range of motion in the hips increased and the hamstring finally started to stretch?

9/4
 Disturbing sharp pain in neck shoulder and lower back
 Is the short bridge posture not good enough to take the strain?

9/5
 Incline push-up 30×4
 　The last 30 are tough.
 The AFK Arena is located in
 　Daily 90 second x 2 "Guild Hunt"
 　Every 2 days, about 10 seconds x 25 times "Labyrinth of Other Worlds"
 　Special versions of guild hunts added on an irregular basis.
 as if to say
 　Guild Hunt is equivalent to 30 push ups
 　The labyrinth of the other world 3-5 times

9/6
 Supported squat 60, 60
  Longer bottom position caused pain in left hip, back of left thigh, and front of right thigh in addition to left hip and back of left thigh.
  I did 60 after some time and couldn't get a bottom position because of the pain around the joints, so I did half squats.

9/7 
 Incline push-up 120
  40,30,10,10,10,10,10
  First two sets of guild battles
　Short Bridge 240
　 I was cautious because I had disturbing pain in my neck, shoulders, and lower back on 9/4.
　 This exercise is low-impact and only raises the heart rate to about 100.
　 So last time I tried to give him more load, I pushed his hips up higher.
　 This put a strain on my neck and shoulders.
　 Serious muscle pain in the neck and shoulders is not good because it leads to headaches and reduces work efficiency.
　 As for the lower back, doing the "don't put your back down" thing takes its toll.
　　To avoid this area, I decided to run it without much load.
　　Still, after 240 sessions, the sweat runs.
　　It may be better to extend the time than to increase the number of times.
　　　I meant short bridge hold, not short bridge.
　　　If you are going to do it in the labyrinth of the other world, it might be good to hold for 10 seconds per match.
　　　If it's a hold system, you can do things you've been avoiding because you can't use your hands, like a bent-leg hold.
　torsional plank
　　https://twitter.com/durararox/status/1302427464841404416?s=21
　　The navel is vertical and amazing.
　　I tried, but my spine is too stiff to twist in the first place.
　　I'll start with a regular plank and twist hold.
　plank
　　The problem of not knowing how much to give, just put a yoga block under your waist and just barely release it.
　twist hold
　　The left side, which was so stiff that an easy twist hold was all I could do, was now able to do a half twist hold.
　　Obviously a result of hip stretching from squatting. I've always said I had discomfort in my left hip.
　　My left hip is starting to fold properly.
　　Still more difficult than on the right and should be stretched accordingly.

9/8
 schedule
 　bent-leg hold
 　plank
 　How many consecutive times can you do this during a guild battle (the fewer, the longer the consecutive time, the better).
 　We want to know the actual time of guild battles, so we record the screen -> 70 seconds.
 Bent leg hold 5 times for 70 seconds
 Plank 40 sec 10 sec
 　I can't go on for 70 seconds.
 Short bridge hold 15 times
　I named it "Squat Hold" because the bottom position of the squat increases the range of motion of the hip joints, and I thought that holding the bottom position would be an effective stretch for me.

9/9
 schedule
 　supported squat
　There is a presence in the abdominal muscles from doing planks.
　Supported squat 120
　 Discomfort in right knee

9/10
 Bent leg hold 70 sec.
 　It was too small to do it at the edge of the bathtub, so I did it in the space between two desks.
 　It's pretty tough.
 Short bridge hold 70 sec.
　　This could still be done.

9/11 Schedule Incline Push-Up
　Incline Push-Up 240
  40×2 + 160
  160 repeating 5 or 10.
  I'm doing guild battles at 40 and the otherworldly labyrinth at 160.
  If you can do this many times, the intensity of the exercise is not enough for muscle training, and if you want to build muscle, you should do something more strenuous.
  But for now, the goal is to make it last as long as possible.
　Standing desks, if you have a weak torso like I do, you find yourself in a weird slanting posture, which I think causes back pain.

9/12
 Short bridge hold 70 sec. x 2
 Bent leg hold can't do 70 seconds anyway.
　　10 seconds x 4
　Stiffness in the front of the thighs.
　I tried [wall squats] and got down much deeper.
　　Unlike before, my right hip hurts.
　　Has the left side grown enough that the right side has turned into a bottleneck?

9/13
 Supported squat 121
　 I didn't feel like doing much, so I did the shredded exercise in the labyrinth of the other world first, instead of the 70 seconds of intense exercise in the guild battle.
　　　The Small Start Principle
　　The "can't get bottom position" problem reappeared.
　　　I could do it while ticking away at it less often, it was getting harder.
　　　It might be a good idea to position it as a stretch and do it a few times each day.
　　A hardened heart
　　　Been trying out a standing desk for the past few days.
　　　being somewhat slouchy
　　　　https://www.chounai-kankyou.com/2019/11/11/footbase/
  I was rereading [Prisoner Training 202005] and it talked about hip pain being [the iliopsoas muscle].
  　consideration
　 94 times in the labyrinth of the other world, heart rate 122
　 　[https://gyazo.com/b35add99ff966d92ee9771f782ce44ab]

　After some consideration, it's better to solve the weak rectus abdominis muscles, so we'll do that type of hold.
 　Knee plank 1 minute x 3
 　Bent leg hold 1 min.
 　　What we used to call "70 seconds".
　　I couldn't keep the plank going for a minute, so I kneeled.
　　Bent leg hold pulls on the arms.

9/14
 Short Bridge Hold 1min x 3

9/15
 Incline Push-Up 240
  40,40,160
　Short bridge hold 1 min.
　Knee plank 1 min.
　I could do wall squats!

9/16
 short bridge hold
 knee plank

9/17
 supported squat
 　80 30 20 20 20

9/19
 incline push-up
 　120 40 40

9/21
　supported squat
　　60
 For some reason my hips are stiff and I can't get the bottom position.

9/24
 incline push-up
 　141

I skipped it for a while.
9/28
 I walked more than 10,000 steps.
9/30
 Supported squat 160
 Incline push-up 40
