pLinkSuggest
2022-03-25
 Better to think of it as a [scaffolding network] than to think of it as a [link suggestion


---
2020/9~2021/3
Project note on [link suggestions

	Write explanations for link suggestions (key phrase extraction) that can be used by general users.
 It's publicly available but I don't know how to use it.
  Add some useful features for users
  　cross search
  　Suggested links to existing text
 Create a mechanism to connect the listening chat system and link suggestions to Regroup.


impetus
	[Keyphrase Extraction] → [RAKE].
	→Since we are extracting repeated occurrences, it is better to be given a set of sentences rather than just sentences and extract key phrases from them
	→ should serve as a mechanism for discovering links between sets of sentences
	→Scrapbox dump and given unlinked text, suggest links

	[Scrapbox Keyphrase Suggestions]
	https://link-suggest.netlify.app/
	[Link Suggestions]

	Right now, the code base for the Scrapbox data and the one for the book data are in the same code base, but the book version would be blacked out copyright-wise if released, and the Scrapbox version would be better with Scrapbox-specific information, so separate them as projects, I think it would be better to separate them as a project and release only the Scrapbox version.
　Scrapbox版
　　Search multiple people's Scrapboxes at once.
　　　I'm told it automatically goes once a day to pick up new arrivals.
　　Main use is in the form of link suggestions for text, not search.
　　[機械がScrapboxを読む]
　　A form of [Scrapbox pseudo-multi-person project] that only bundles searches without copying the content.

-----
Future Drafts
	Cross-search of cut and scanned library books
		[蔵書横断検索]
		It's technically possible to jump to a hit page from a search result, but it's not legal to publish it for copyright purposes.
	Search by the content you are currently viewing with the bookmarklet
		For example, you can bring up a "related page" from a Twitter or Facebook thread with a single click.
	Deepen the "Suggest links for new content" part of the name by turning back the "Use Scrapbox's manually-assigned link information" feature, which is now turned off for the moment.
		I got excited because the part that doesn't use link information was faster than expected.
	Listening Chat System
		[pKeicho]と接続
　　The ability to extract verbs as key phrases is an advantage
　Create a "nice" network between the documents you give.
　　What is a good feeling?
　　　No page with a concentration of links
　　　Just follow a few links to get to most pages.
