landing practice
[How can we develop the power to return?
　Try to verbalize where you look at the problem and think about the solution.
　　Recently, I was looking at my notes during the real-time contest and trying to verbalize them as "thoughts" after the fact.
　　But during the contest, the time pressure is so strong that it's not really properly verbalized.
　　So look at past questions and try to approach writing a consideration instead of suddenly writing code.
　　Question selection uses "50% probability of correct answer" by AtCoder Problem
　　Compare with official explanations to check for excesses and deficiencies

Try it.
　[Estimation of calculation volume] Many errors.
　　Cases to estimate more:.
　　 'I don't think we'll be able to do a full search' - correct answer is full search [ABC165C].
　　Cases where you estimate less:.
　　 "You can do the math with DP" -> "DP won't get it done in time, so we had to attribute it to a much lighter problem by transforming the problem [AGC048].
　Many misunderstandings of problem conditions.
　　They probably realize this by looking at sample data or rubbing it in when they are actually solving the problem. Not writing the code, just the text, has made the mistake more noticeable.
	It can be done in the bathtub or while washing dishes because a computer is not necessary.
	It won't be AC, so it won't be crossed off the list.
	When I add a lot of problems (like 30) that I plan to solve together, I get confused because I don't know which ones I haven't solved.
	There are medium difficulty (50% probability of correct answer) and high difficulty (20% probability of correct answer) problems, and the former is easy to solve (10 min/q), but the former is solved by applying "parts of thinking that you already have", so it is difficult to find new parts from the examples you collect.
	　And subjectively, I thought, but when I checked how he actually answered the high-difficulty questions, the "questions left unscrambled" weren't necessarily high-difficulty questions.
	　　For example, even the high difficulty problems [ABC034C](difficulty 1412) and [ARC106D](1989) are easily solved.
	　　　I am better at problems involving mathematical transformations than other participants.
	　　Conversely, I'm not good at problems that require me to realize that I can solve greedily.
	　　　When I read ant books and other books, I went through the greedy method with self-knowledge that I "understand" it, but in reality, "I can implement the greedy method after I am sure that it can be solved by the greedy method" and "I realize that it can be solved by the greedy method, and the proof is weak", so in the cut of the power to be attributed, "I don't understand".
	　　　[Greedy Law Proof Patterns]
　I'm tired of doing it in a bland way in the difficulty zone.
　　It doesn't give you a sense of accomplishment.
　　I've decided to solve the problems linked from the explanatory article.

done
	Exactly the same [ABC146D] [AGC038A] [AGC036A] [ARC083A] [ARC026B] [ARC040C] [ARC024B] [cf17_final_C] [AGC024B] [soundhound2018_summer_qual_C] [ panasonic2020_D] [ARC091B] [ARC040C]
	[Small order from official] [ABC147D] [ABC006C].
	Same policy, with additions [ABC070D] [ABC125C] [AGC014B] [AGC018A] [ABC132D] [ABC014C]
		Careless mistake [aising2019C].
		Problem condition misunderstanding [code_festival_2017_quala_C] [ABC109D].
		Proof [ABC112C] [AGC003B].
	Different policy but same result [ARC062B] [AGC024C].
	The Big Difference
	　You're overcomplicating things.
		　[indeednow_2015_quala_C] [ABC016D]
		There are more order smaller solutions.
			[ABC121D] [ABC147D] [AGC033A]
	incomplete
		[ARC054B] [ARC092A] [ARC052B]
		[ABC080C]
		[tenka1_2017C] [ABC105C] [ABC032C] [ABC054C] [diverta2019_2_C]
		[indeednow_2015_qualc_C] [ABC089D] [ABC157D] [ABC012D] [ABC154E] [ARC032B] [ABC126D] [ARC081B] [ABC138E] [ABC014C]
		[tenka1_2018_C] [AGC024C] [ARC092A] [ARC052B] [ARC024B] [AGC024B] [ARC054B] [nikkei2019_qual_C] [ABC019C] [ABC140D] [ARC042B] [ARC064A] [ARC034B] [ABC124D] [ARC037B]
		[ARC097B] [ARC097A] [ARC036B] [ABC096D] [ABC150D]
[doing]
	[sumitb2019_e]
	[nomura2020C]
	[code_festival_qualB_C]
	[m_solutions2019D]
	[AGC019B]
	[ABC103D]
	[AGC029B]
	[ARC087B]
	[ARC014C]

difficult problem
　[ABC165E]
　[AGC029B]
	[ABC150D]
	[AGC006B]
	[codefestival_2016_final_c]
	[ABC034C]
	[ARC087B]


[AGC031B]
[AGC022B]
[AGC032B]
