November 2020 Muscle Training
[October 2020 Muscle Training].
　健康診断
　　At least 2 days a week of light, sweaty exercise for at least 30 minutes per session for at least 1 year
   It has been suggested that the risk of developing and dying from lifestyle-related diseases is reduced by 12% if people habitually and continuously engage in light, sweaty exercise of 4 METs/week or more (60 minutes or more per week), such as fast walking, gymnastics, jogging, running, swimming, and ball games (activities with an intensity of 3 METs or more).9 ○ To limit the exercise to 3 METs or more (approximately 4 METs), the question was asked by adding the subjective sensation of sweating. The question was designed to include the subjective sensation of sweating in order to limit the question to exercise at an intensity of 3 METs or higher (approximately 4 METs). In order to prevent accidents and injuries due to cardiovascular diseases during exercise, exercise of less than 6 METs and exercise that is not subjectively "hard" are suggested in the initial stage of health guidance.
  11
   At least 1 hour per day of walking or similar physical activity in daily life
   The standard for the quantity of physical activity is 23 METs/week of physical activity at an intensity of 3 METs or higher.9 Specifically, it is equivalent to walking or physical activity of equivalent or higher intensity for a total of 60 minutes or more every day, even if it is in small segments, whether for work, housework, transportation, exercise, or other activities.
  Increasing physical activity by 10 minutes a day can reduce the risk of lifestyle-related diseases by about 3%.
  9 It has been suggested that the
  For those who answered "no" to this question, we will support them in starting with those that can be started after confirming the status of their efforts and risks*9.
  https://www.mhlw.go.jp/seisakunitsuite/bunya/kenkou_iryou/kenkou/seikatsu/dl/hoken-program2_02.pdf
　　Walking, doing light strength training, vacuuming, washing the car, and playing with children (moderate intensity) are about 3 to 3.5 METS; walking at a slight speed, playing a round of golf, riding a bicycle to work, and slowly climbing stairs are about 4 to 4.3 METS; slow jogging is 6 METS; aerobics is 7.3 Running, crawling, swimming, carrying heavy loads, etc.: 8 to 8.3 METS.
　　https://www.e-healthnet.mhlw.go.jp/information/dictionary/exercise/ys-004.html

11/6
 Supported squat 90

11/7
 walking
