pasta logic
[https://gyazo.com/df0bcf7c85549f132ec0340d4a5fcd91]


[https://gyazo.com/3e5db4e43d2289e1327f504cbd4ad165]
Programming-based [board games].
	For non-programmers, the explanation is, "It's full of programmer's jokes!" It is not a "flavor is programming" game, but a serious battle of logical thinking skills. You do not need any programming experience or knowledge to play.
	To explain for programmers, programming is really about implementing code to achieve a goal and then making minimal modifications to that code. However, the modification of the code is self-rewriting at runtime; two players rewrite the code to suit themselves, resulting in a competition for resources, like parallel processing.
	"It is a game in which two threads attack each other's threads while two threads rewrite their programs themselves."[tokoroten https://twitter.com/tokoroten/status/1327436042643771393]

Official website [pastalogic - Pasta Logic | 2-player game https://pastalogic.com/] Download rulebook (PDF), etc.
Mail order [pastalogic - J.C. Creations - BOOTH https://jccreates.booth.pm/items/2529954]



Q&A
	[Advanced pasta logic rule: avoid draws].
	[When MoveFlag is incremented]
	[About Pasta Logic Reverse]

Thoughts on Twitter
>[https://twitter.com/pawwn/status/1381250185414594562?s=20&t=4SrofgCRB0a6JxlyKIvrmg @pawwn]: "Pasta Logic" by J.C. Creations!
>It's so funny!
>I bought it because I heard the explanation at the booth and felt it was new, and I hit the jackpot.
>The rules are simple, but the creative complication of manipulating the process to handle the process was amazing.
>Reasoning!
>[https://pbs.twimg.com/media/EysvuCnVoAMt7fn.jpg]
>It's strange how the combination of cards that come up changes what you think each time.
> It is both like an assembler and
> Emergence through multiple references of simple actions is like a "dangerous monster".
> By the way, after the cards are randomly arranged to determine the first and second attackers, it becomes a zero story definite complete information game. (I doubt if it is finite)
	By Pawn of [Shephy].
