Communication as Knowledge Transfer
When you look at communication from the perspective of [knowledge transfer],
	Person X, who has the knowledge, doesn't know how person Y, who doesn't have the knowledge, would feel about the text.
	Y doesn't know what knowledge is lacking or what questions to ask compared to X
This is the situation.

It is a huge burden for X to speculate and document that "Y may not understand this part.
　Often, it produces a document with a poor outlook that is filled with things that don't need to be written.
　The larger the document, the higher the cost of maintaining it and finding the desired one.
　The larger the document, the greater the burden for the reader. It is difficult for Y to skip over and read only what is necessary.

It is an impossible task for Y to verbalize what he does not know compared to X.
So we need a low-cost way for X to first create a document without worrying about Y, and then when Y reads it and thinks, "[I don't know]", we need a low-cost way to express it.
　This "low cost" is not just about UI design.
　　Not embarrassed by what they don't know [psychological safety].
　　No [reticence], such as, "If I ask a question, will it interfere with my work?
　　Includes such things as

A device that makes it easier for person Y without knowledge to express "I don't know" at a low cost is, for example
	Permanent links in smaller units
		What do you mean by "what are we talking about here?" It is easier to point to the
			Scrapbox Row Permalink
	Comments can be hung anywhere in the text.
		Easy to have discussions about things you don't understand
			Comment function in Google Docs
			Scrapbox solves the problem with a "bulleted co-editing" operation.
	You can easily express "I don't know" by highlighting [unfamiliar words] in the text.
		A type of collaborative editing tool operation such as Google Docs
		In the case of Scrapbox, it expresses the feeling of not understanding by making it a link, but also provides a place to write an explanation.
		[share what you don't know].
	Asynchronous means of communication
	　I can immediately output what's on my mind without thinking, "If I ask a question now, will it interfere with my work?" You can immediately output what you are interested in without thinking about
	　[Shared space type communication].
and others.

relevance
　Just as there is "making something the customer doesn't want" in software, there is "writing something the reader doesn't want" in documentation.
