Textbook of Design Research
[https://gyazo.com/cd0c6c47247b33670de7bae19e506054]
	[Amazon https://amzn.to/2UCfjBH]
	[Books by Mikio Kiura, aka [kur
	　I have studied at CIID (Copenhagen Institute of Interaction Design) and have created a lot of things myself.
	　It's a book about design written by someone who knows how to design properly and has studied design properly."

Reading notes to explain at Cybozu's internal study group
　A story about how design isn't just about looks.
　　[Buchanan's Orders of Design], divided into four phases
　　　The word "design" tends to conjure up images of appearance and industrial product design, but it extends to interaction and ecosystem design.
　　　CIID is the Copenhagen Institute of [* Interaction Design].

　[Human-centered design] has changed the meaning of the word.
　　Related: "[Designing for] Who?"
　　There was a time when ease of production was prioritized over ease of use for the user, and in response, the early days of human-centered design were based on the idea that the design should focus more on the people who use the product.
　　　Useful, Usable, Desirable
　　　Indicators related to the user's inner life
　　How exactly is "designing with a focus on the people who use it" achieved?
　　　What is the ease of use for the people who use it? without the people who use the product...
　　　This is why the [participatory design] method of "welcoming users into the design process" was born.
　　　Related: participatory design was also discussed in "[What features do you want?
　　Looking at kintone from this perspective:.
　　 A system that "allows users to participate in the design process" with regard to the development of business applications.
　　　Users participate in the development process themselves, rather than purchasing something "already made.
　　　Nor do we decide on the specifications and outsource them to a "maker".

　design research
　　This book assumes that the design is based on the results of research
　　　It's not a word that has a clear definition in the world.
　　Need to find issues that are needed, unresolved, and can be solved at a realistic cost
　　　This is called "opportunity."
　　　[Finding Opportunities] Phase 3 of 3 Designer Involvement1 p.40
　　　	Opportunity Scout
　　　	Storytelling
　　　	Execution
　　　This is defined by CIID
　　Half of the opportunity is "what value to provide" and half of the solution is "how to provide it.
　　Verbalize the opportunity first before suddenly thinking about solutions, solutions
　　It has the effect of reducing rework.
　　I think this has the effect of breaking "vague and large processes" into smaller processes, which makes it easier to decide on next actions when things go wrong.
　　To discover opportunities, it is better to increase the number of options and then reduce them
　　We need to expand our options first, because due to various biases, we are only aware of some of [the possible options].
　　Discussed here: [Design thinking is depth-first search?]
　Benefits of Opportunity Language: Transparency of the design process
　　Confidence in "Why are we making this?" and "Do people really want this?"
　　→ Increased commitment to the project
　　Makes it easier for others to share in the project's objectives
　　　A black box makes it hard to get involved until things are finished.
　　Creating an environment in which members can move easily and autonomously

　Design research is not an upstream process
　　Not in front of the development as an independent process.
　　For example, [Lean Startup] type product development
　　　The process itself is an iterative hypothesis testing process
　　　Product development itself can be described as design research.

　Difference between marketing research and design research
　　Easily confused but different objectives.
　　　[I need a fast horse.]
　　　[People don't know what they want.]
　　　→It's not very useful research to ask directly what you want in creating something new.
　　Focus on the individual first
　　　[Don't abstract people easily] [People have individual differences]
　　　Whether findings obtained by focusing on an individual are specific to that individual or applicable to many people can be ascertained after they are obtained
　　　No need to focus on "typical users"; some insights can be gained by focusing on extreme users
　　　　Turning these extreme users into new customers is not the main objective.
　　The Story of the Black Plate
　　　It's like [Abilene's Paradox].
　　　Fast Food and Organic Food
　　　You play on the speculation of how you should be socially, not how you actually are.
　　　Trying to be exemplary in front of others
　　　I want to observe under normal circumstances as much as possible.
　　Do not limit understanding to individual users
　　　This is the same rut that once separated the user from the product and only looked at the product to design it.
　　　The user does not exist independently of the environment
　　　Interact with the surrounding environment and people
　　　How does the user's use of the product affect the surrounding people and environment? Should they? Should it not?
　　　Groupware, such as kintone, is particularly unique in that it is introduced to an organization.
　　　　Not only the ease of use for the individual user, but also how it interacts with those around it when used within the organization.
　　　　For example, for an individual using groupware, you want to make a "everyone" mentions when you want many people to read what you have written, but it generates a notification for everyone around you.

　New business development in companies
　　I say "new," but not basically zero-based.
　　Synergies from leveraging resources that the company already has
　　　Exposure, recognition, and understanding of existing customers, facilities and personnel for development and production, procurement and sales channels, intellectual property, etc.
　　　In the case of Cybozu, it is easier to understand the problems of customers who are already using groupware than zero-based companies, and when a solution is developed, it is easier to make customers aware of it and to create sales channels.

　Products are not just things.
　　Product from the time the purchaser recognizes the product until it dies.
　　　"In some cases, like tombstones, they generate value to those left behind after death.
　　　　From the time the purchaser becomes aware of the product until the user dies?"
　　　　If the purchaser is a corporation to begin with, the person who made the purchase decision may leave the company
　　　　Well, it's not the end of the world when it's time to buy or sell, that's what I'm saying.
　　Organizational and business improvement itself can be a product.
　　Improving the organizational and operational side of the business to fit the thing can also be a product.
　　This is a concept that fits well with the Cybozu way of thinking.
　　It matches with the idea that "the goal is not to sell groupware, but to create and maintain a state of teamwork in the customer's company.

The first two chapters are about 30% of the total, with explanations of specific methods in chapters 3 and beyond.

Considerations after reading this far
　[https://gyazo.com/1ff82956b4b4d4aae31ceeb661a06db6]
　Looking back at my usual behavior, I tend to go for the "gray stuff" because I can or can't do it.
　　Because knowing that "something you don't know if you can do" can be done is an expansion of the scope of what you can do.
　　Unconsciously, they feel and act on the high value of "doing more of what they can do".
　　We're going to move to the difficult side on the technical difficulty axis.
　On the other hand, when we think about exploring opportunities for innovation, this is "unintentionally narrowing the scope of our search"
　　[https://gyazo.com/15d26f4637a37d08751b0e752b026259]
　　I only saw two of the five arrows marked going to the right.
　　Even I would choose the one with the higher customer value if it were one of the two arrows going to the right, but that's not a very appropriate opportunity search.


Chapter 3
　Design Research Procedure
　　design process
　　　[Double Diamond] Talk about adding arrows to the 2019 edition.
　　　d.school and CIID
　　Project Design
　　team building
　　　Variation of [Tuckman model] [DAU model]
　　　　Storm is not in a phase of independence.
　　　Disclose at the outset how you prefer to work, what you hope to gain from this project, etc.
　　　　Align perceptions of the project
　　　Discussion technique: [Four-Player Framework].
　　　 Related: [6 hats].
　　Research Design
　　survey
　　　interview (i.e. television, newspaper, etc.)
　　　　What makes you say it is the best choice?
　　　　It would be nice to be able to objectively define what kind of people to talk to.
　　　　Opinions differ on the optimal number of people.
　　　　　The information gained by adding one more person gradually decreases, so somewhere along the line it becomes not worth the cost.
　　　　　Ideally, "doing the interview" should be a means, not an end, so it should stop even in the middle of the schedule.
　　　　　　Not so easy when it comes to client work.
　　　　　If we don't decide in advance who decides that, we're going to continue to linger.
　　　It's full of very specific information, 60 pages here alone.
　　analysis
　　　Theme Creation
　　　　It appears to be an unbundled light version of the KJ method. [affinity diagram] form.
　　　　Pick one interesting piece and then gather similar pieces close together.
 　　　　When describing the KJ method, I would describe it as "possibly related" instead of "similar."
 　　　　You call it "classification," so maybe this is a process that doesn't include the KJ method's "[don't] classify" philosophy.
　　　　It is a bottom-up process by selecting one interesting piece and attaching it to it. Top-down categorization is avoided because of this procedure.
　　　Extracting Insights
　　　　What is good insight?
　　　　　Read and understand
　　　　　　To make it possible to involve people who do not know the context in the team.
　　　　　Leading to innovation
　　　　　　I can move on to the next action.
　　　　　　Even interesting results are futile if they do not lead to action.
　　　　　Must be new findings
　　　opportunity detection
　　　　How might we
 　　　　How can we do this?"
 　　　　　Target User
 　　　　　constraints
 　　　　　Goals to be achieved
 　　　　10 Examples
 　　　　　Develop strengths/remove weaknesses
　　　　　 Focus on the adjective and vary it.
  　　　　　Thinking backwards (e.g., turning a negative into a positive)
 　　　　　argument from the start
 　　　　　　Eliminate things that are supposed to be there in the first place, etc.
 　　　　　Are there any other resources available?
 　　　　　change one's stance
 　　　　　　We tend to think only from the perspective of the person who is being inconvenienced, but we dare to put ourselves in the shoes of the person who is causing the problem, etc.
 　　　　　Splitting the Problem
 　　　　　I think there are a few more ideas for this one...
 　　　　Do not use negative language
 　　　　Make the question neither too broad nor too narrow.
 　　　　Reconcile perceptions with stakeholders.

Considerations so far
　It looks like I can replace it with a light version of my usual KJ method up to the theme creation part.
　The KJ method is vague after group formation, but in this method, "insight extraction" and "opportunity discovery" follow.
　　It seems easy to proceed without getting lost because "what kind of things are good" for the output at each stage is clearly indicated.
　　When I put KJ method groups into writing, I don't particularly think about whether it will lead to innovation.
　　　Might be interesting to consider.
　　　This is because the KJ method was originally created to create a hypothesis in academia, and even though the "creating a hypothesis" part of the method is the same as the method for designing something, the purpose of the hypothesis is different.

　idea
　　Presto, "Everything on paper." "Ideas not put on paper are worthless."
　　　Great, totally agree.
　　Idea Selection
　　　First, establish an evaluation axis
　　　Don't create a rating scale after looking at ideas, there will be a bias to select certain ideas.
　　　Don't tell presto participants in advance what the evaluation criteria are, it will bias the ideas that come up.
　　　How do you mediate when there is a disagreement?
　　　　KUR: First, I would confirm the goals/objectives of the project. Since the goal setting may be ambiguous, interpreted differently by different people, or subject to different constraints, I would reconcile the assumptions. If we do not agree on the assumptions, it will be difficult to come to a consensus on which ideas are good. Without a consensus, it will be difficult to come to a cohesive solution.
　　　　I see, so there may be differences in interpretation of objectives, understanding of implicit constraints, etc., and that is the first step in resolving them. Once that is resolved, the disagreement over which idea is better often disappears.
　　　　Similar to the idea of [conflict resolution diagram
　　　　KUR: However, it is actually difficult because the "good state" does not always coincide with each other and with the stakeholders. For example, proposal A is better when considering the customer, but proposal B is better when considering the OKRs set for the organization.
　　Concept creation
　　　What is the concept?
　　　　No clear definition.
　　　　Communicate findings to stakeholders
　　　　Make ideas more concrete and verifiable
　　storytelling
　　Prototyping as hypothesis testing
　　　Prototype with low fidelity
　　　　Like paper prototypes.
　Chapter 4: Design Research Operations
　　Design research in ongoing product development
　　organizational structure
　　　Considered a cost center for independent teams
　　　Often overlooks research opportunities
　　product management
