JUXLamp
[https://gyazo.com/06e9b475e58d63a49bf6afe8ed7bc32d][https://gyazo.com/98d76b5f165dd3be4de69e664298931d]

	[Light therapy light]
 	Model No. SAD-DP-04
 	[Amazon https://amzn.to/348Bk0b]

	impetus
  [@kis https://twitter.com/kis/status/1337415857157197828] Tweet
  	>I look at the light therapy light every day to adjust my sleep cycle, and I'm mentally stabilized and enjoying it every day, so I'm thinking that taking in light through my eyes helps my psyche more than I imagined.
  	>Both melatonin for the sleep cycle and serotonin for mental stability are produced by the intake of light from the eyes. Or rather, when we take in light through our eyes, serotonin is produced and we become active during the day, and melatonin is produced from that serotonin at night, which makes us sleepy.
 		>I put it on a timer for 30 minutes and watch it occasionally while eating dinner and watching my computer.
 When I was commuting, I used to walk outside for 30 minutes during the day, but telecommuting with covid19 has eliminated that.
 　Then you can take a walk for that.
 　In theory, yes, but unlike commuting, which is done at a set time and out of necessity, walking stops being done when you're not motivated, because there's no compulsion to do it.
 　I bought it to test it out because my mental health is suffering due to the approaching winter and the reduced brightening hours.

12/13
 It arrived at noon, so I tried it for 30 minutes anyway.
 I feel motivated.
  It may be a placebo, but the idea is that if you are motivated by some ritual, it is a good thing because it is a beneficial ritual, whether it has a scientific basis or not.
  I cleaned out my messy desk.
　I'm going to start using it at breakfast tomorrow.
　Press the power button several times to brighten.
　　500〜12000lux
　　It also says 1500/3000/6000/12000lux.
　　Brightest mode, very bright
　　I tried it in the brightest mode for 30 minutes, but I guess I should have tried it at the second 3000lux from 15 minutes to make sure it didn't cause any malfunctions.
12/20
 I compared the brightness to the winter morning sun coming in and hitting the wall, and it was about 6,000-12,000.


Seasonal Affective Disorder (SAD)
	>The patient has many atypical symptoms that differ from typical depression, such as (1) hypersomnia, (2) overeating, and (3) weight gain. Mentally, the patient mainly shows suppressive symptoms such as "low motivation and inability to think" and "fatigue," and depressive symptoms such as melancholy are not noticeable. The increase in sleep duration is characterized by the simultaneous prolongation of nighttime sleep and increase in daytime sleepiness, and the increase in appetite is characterized by a preference for carbohydrates (so much so that it is called carbohydrate starvation), with a preference for white rice, bread, pasta, and sweets such as chocolate, which increases during the afternoon and evening hours. The preference for carbohydrates is also characteristic of carbohydrate starvation.
	>The first-line treatment is high-intensity phototherapy. This involves irradiating patients with high-intensity light of 2,500 to 10,000 lux for 1 to 2 hours. It has been confirmed that (1) high illumination is effective even if the irradiation time is shortened, and (2) there is a positive correlation between illumination and antidepressant effects. The effects of the treatment can be observed relatively quickly, and improvement is said to occur within a week or so in many cases.
		[Seasonal Affective Disorder (SAD) | Social Welfare Foundation of Japan Saiseikai https://www.saiseikai.or.jp/medical/disease/seasonal_affective_disorder/]

An unexpected and positive side effect is that I look very good during the videoconference.
　[https://gyazo.com/c94cd37be32eebf751be32c0b1cdd58d]

12,000 lux vs. "winter morning sun shining through the window and reflecting off the wall".
　[https://gyazo.com/592d10fa3045f684405deb0dc9cb5d56]
　January 2, 10:10 a.m. Tokyo, clear skies without a cloud
　Morning sun is a little brighter.
　The window faces east, so no sunlight comes in at noon.
　This also opens the lace curtains.
　　January 6, cloudy morning at 10:00 a.m.
　　[https://gyazo.com/1c8cf46c8df167c6de4adbc0f769509f]
　　This is the darkest mode. Cloudy light is even darker than that.
　　

1/5
　I watched the light from the above window for a while at 9:30
 I'm taking my morning walk now, which I said so much that I should do but never got around to doing.
 Mental health improved.


In short, this is what it means.
　Usually starts at 11:00 a.m., leaves home at 10:00 a.m.
　Work from home with new Corona, sleep gradually recedes, waking up just before 11:00 a.m.
　Winter came and with that life cycle came a lack of sunlight.
　The symptoms of seasonal affective disorder-like demotivation and "going for a walk" itself were suppressed, and a vicious cycle began.


1/9
 I've started waking up at a time when there's direct sunlight, so if it's sunny, I open the curtains so there's direct sunlight on the walls, like a big light therapy light.
 I started waking up early and taking a walk before the start of work (like going shopping at a convenience store).
 When it's cloudy or raining and you can't do that kind of thing, use light therapy lights to compensate.
 By the way, even if you wake up at 8:00, that doesn't mean you're going to fall asleep at 12:00.
 　
[Bought]
[Motivation]
