I can't do as much as I thought I could.
[https://gyazo.com/5cdb8e32a3888fc4b7312a5bb7c6e6f7]
　There is often a phenomenon where the amount actually done is less than the amount you thought you could do.
　There are several causes.
　　Lack of experience makes [estimates] of actual quantities possible less accurate.
　　　Frequent in young people, but often occurs even if they are not young
　　Unexpected events take up time
　　　This is similar to the former in that it doesn't include the possibility of irregular events in the estimate.
　　You don't realize that your abilities are declining due to aging, physical condition, etc.
　　　Often occurs, especially with respect to the physical capabilities of middle-aged people.
　　　Participating in a parent's footrace at their child's elementary school athletic meet and injuring themselves by trying to run faster than they can.
　　　Cognitive ability also declines with age, although not as much as physical ability.

At this point, there are two interpretations as to which is correct
[https://gyazo.com/50473f70a13f6a114697e8c44a6e73a2]
　A: "The amount I thought I could do" is correct and what I could not do is incorrect.
  Thinking that you should be able to do it or should be able to do it
  We think the current situation is wrong for failing to follow that path.
  Attribution of Mistakes
  　Self-blame: I am to blame, I should work harder, I made a mistake, I should be more successful but I am not.
  　Other blame: environment was bad, got in the way, dragged down when I could have done better if the environment was better
　B: "I thought I could do it" is an estimation error, but the amount actually done is a fact

This A and B have different sense of accomplishment that can be achieved by subsequent progress.
[https://gyazo.com/452ffcee3e579f2911787d47ac40e06a]
　With A, it will be "I knew it wasn't done" next time.
　　Motivation to continue is undermined.
　In B, "progress was made this time" compared to the previous time
　B is better for your mental health.

concrete example
　I was looking at a tweet about competitive programming, and Mr. A mentioned "how can you be happy with achieving such a low standard" in response to "Mr. B being happy with achieving a certain rank" (I lost the URL of the original tweet, so I recreated it from memory).
　　It is progress because what could not be done before can now be accomplished, and there is nothing wrong for Mr. B to be happy, but why can't Mr. A be happy about this situation... he wondered.
　　Mr. A is in pattern A in the above figure and would not be able to achieve
　　This undermines motivation to learn in the long run.
　　You should always enjoy being able to do new things.

relevance
　[Gap between ideal and reality].
　[Excessive self-esteem]
　[Principle of generation of old people].
　[Middle Crisis]
