Nodal Point of Thought 20201220
[I can't do as much as I thought I could.]

[McClelland's Theory of Needs]
	[Need for achievement, need for power, need for affinity, need for avoidance
　I thought it was about 8:0:0:2 as far as self-perception goes.
　　Fairly radical achievementist.
　　Unconsciously believe that time in life is measured by the "accomplishments" made, whether they are used effectively or not.
　On the other hand, as an observational fact, "significant performance degradation" occurred at the time of the last Great East Japan Earthquake and at the time of the new corona
　　There are people around me who are trying to take action on this emergency situation, so it is natural for me to join the project if I am achievement supreme, but in reality I keep refusing!
　　Why?
　Maybe this is the kind of phenomenon?
　　The situation makes the future less predictable.
　　→ The desire to avoid stress and pain jumps up.
　　→The resources that are the source of desire are eaten up by the other side, and the ratio becomes 2:0:0:8.
　Unaware that their desire composition ratio has changed, they try to do the same things they have always done and measure their achievements by the "amount of achievement" as they have always done.
　　But the desire to achieve is drastically reduced, so the amount of achievement is also reduced.
　　You don't understand the cause, so you get the feeling that [you can't do as much as you thought you could].
　　Why can't I do it? Stress? Problems with the telecommuting environment? I thought it was a mental energy source problem of desire, not a process.
　　I agree with this interpretation.
　　　The question is, "What was the point of creating this program in the first place?", "Is it necessary to save lives in the first place?", "What is the purpose of living in the first place?
　On 11/10, he said, "I've been struggling lately to act on long-term plans," and was told that he was "not the original" [Facebook https://www.facebook.com/1129148772/posts/10223348668641488/?d=n].
　　At this time I was thinking, "I can no longer think of how to improve the program I'm using, or how to develop the research I'm doing, and why is that?
　　This specific action was done before the new Corona.
　　There is a cognitive distortion in interpreting that as "acting on a long-term plan.
　　These specific actions were done through the following process
　　　1: I have something I want to build, something I want to know, a situation I want to achieve.
　　　2: Break it down into a concrete plan to accomplish it
　　　3: Execute that plan to achieve its objectives.
　　If the desire to achieve is drastically reduced without the person being aware of it, this process will naturally "somehow go wrong" as well.
　　　Why do I want to accomplish this in the first place?" and step 1 stops.
　　I thought, "Well, it doesn't sound like stress is preventing him from programming, and his competitive programming rating is growing steadily."
　　　Competition programming works without Step 1 because it is an environment where "concrete problems" are given.
　Mystery solved.
　Future Issues
　　What is the Next Action to change this situation?
　　To begin with, I am achievement-driven [self-driven], so I have a lot of discretion in what I do at work because I produce results without instructions.
　　This is, on the other hand, an environment where "you have to decide for yourself what to do.
　　This environment is hard for avoidance-driven people.
 　　Avoidance-driven people want to do only the bare minimum and play the rest of their lives.
 　　　The image of an uncle playing minesweeper by the window every day.
 　　I want the "to do" to be given to me from the outside, and if it's not there, it's better not to have it.
　　But playing Uncle Minesweeper is a pain for me.
　　　Strong guilt about spending time in ways that do not lead to achievement because the measure of life's worth is achievement.
　　　Huh? Wouldn't it be frustrating if the avoidance desire to avoid stress prevented you from achieving results and that was the stress of guilt?
　　　This is a crossroads situation where achievement-driven behavior is not possible and avoidance-driven behavior does not satisfy the need for avoidance...
　　　When I talked to my wife about it, she told me that if I ate well and slept well, I would get a perfect score, and that I shouldn't worry about my work evaluation because my boss would decide, and since I hadn't been fired, I would be fine.
