Do it right" is a mid-core philosophy.
In cooperative games, there are three patterns of players
　A: No effort
　B: Angry at A, telling him to "make a proper effort.
　C: I don't get angry because I don't expect others to make an effort
　　If asked, they will teach, but they won't do it on their own.

relevance
　[Teamwork]
　[No expectations of others].
　[Advice sin]
　[Midcore]

---
>[https://twitter.com/nishio/status/1405574868091891712?s=21 @nishio]: I think I saw an article in the context of fighting games that said "[it's the middle core that stares at others for lack of effort], while the real [advanced players help those who try to get stronger and don't care about those who don't], I saw an article that said something like "[it's the middle core that stares at others for lack of effort], while the real [advanced players help those who try to get stronger and don't care about those who don't]"... but I can't find it...

>[https://twitter.com/chin_para/status/1341242837346574338 @chin_para]: I want to send Yoshida-san's words from FF14 to all game people.
	(Image omitted.) Source was not specified, so I'll write when I know.

Postscript [FF14 Yoshida P. interview].
Source [[Interview] "Final Fantasy XIV: Red Lotus Liberator" Super-Special Interview - GAME Watch https://game.watch.impress.co.jp/docs/interview/1029728-5.html]
Naoki Yoshida, producer and director of "FFXIV: Red Lotus Liberator
>--Slightly off the raid topic, but I think there are three tiers forming in "FFXIV". There is an in-between layer between the beginners and the core. I would like to see an "Intermediate Hall" to represent this group.
> 
> Mr. Yoshida: It bothers me, it was good until 50, but from there the characteristics of each job became much more advanced, so the follow-up of the middle class is weak to say the least. ......
> 
>--In my opinion as someone who participates in raids, I feel that you have to do your own research there to enjoy the game.
> 
> Mr. Yoshida: I don't think we live in such an era anymore. The people who can do their own research are going up and forming communities around it.
>
>--But the people above them don't teach it, do they? Because they have done so themselves.
> 
> Mr. Yoshida: No. If you are really crazy good, you can ask for advice and they will give you very serious and precise pointers. Without much care. In return, they will teach you thoroughly and carefully. This is because, as long as you play together, if you have time to complain about your friends behind their backs, you should practice together during that time and let your friends get better, because it will be faster for you to clear the game. People at this level [do not compare themselves with people less skilled than themselves]. They don't even take pleasure in it. He is the type of person who finds someone who is better than him and sets his sights on that person. But this kind of person says, "I want you to teach me, point out everything!" They tend not to move on their own unless you say, "I'm not going to do this. They know that if they don't see how serious the other person is, they will hurt them.
> 
> So, "Go check that out!" It is the thought of the [mid-core] person that stops at. I think [you are losing time when you expect others to do it]. The [top tier] doesn't expect anything at all from others, and the support is more generous to the extent that they don't expect it from others. It doesn't matter who is the top person in that team, as long as the team can clear it.
	[The top tier won't tell you unless you ask them to tell you.]
	[The top tier expects absolutely nothing from others].

> I often see people say, "Why do you guys only do that much when I'm making such an effort?" but I think that's because they are strangers, not me. So, at least when we have time together, I think it would be better to think, "Okay, it's a short time, but let's practice together! I think it is better to say, "Okay, let's practice together, even if it's only for a short time! And you can get to know each other better, too.
> 
> --Does it make a difference whether we have a common consciousness as a legion?
> 
> Mr. Yoshida: Hmmm, I think it is enough if a common consciousness exists at a low level. Motivation, when it reaches its limit, is naturally scattered, and I think it is enough if the person who is producing the highest motivation takes care of everyone.
> 
> I think Japanese people are really good at games. If e-Sports were to become a real Olympics, I think Japan would have a good shot at the gold medal in terms of skill alone. However, when it comes to party play and competitions, I feel that the game suddenly falls apart. Maybe it's natural because it hasn't fully become a sport. ...... I feel it's the same with love, but I think it's important not to expect too much from your partner and to always be doing your best in your own way.


>At this level, people don't compare themselves with people who are less skilled than they are. They don't even take pleasure in it. He is the type of person who finds someone who is better than him and sets his sights on that person.
　[Condescension is caused by narrow-mindedness.]
