Belittlement is hubris
>There is an important word in [Buddhism], "[demeaning]. [The word "pride" is "pride" in "boastfulness" and "arrogance" in "pride. Chastity means "pride," which is "pride" in "boastfulness," and "hubris. In Buddhism, "to evaluate oneself as being no good, or to be depressed, is hubris.
https://www.higashihonganji.or.jp/sermon/radio/detail08_02.html Futoshi Takehashi (Deputy Priest of Hoenji Temple, Hokkaido Diocese)

When you [demean yourself] by saying, "I am no good," "I" am split into "Person A," who is the object of being called no good, and "Person B," who evaluates others as no good according to his own standards, and B's behavior is hubris.
Because "evaluating that it is no good" implicitly assumes "my rightness" that I am capable of evaluating others.

---

>Once upon a time, I made a disparaging remark about myself and a member who was less experienced than me got angry and said, "It makes me sad that we are less than you. It was just a comparison with someone stronger in my mind, but I thought it was better not to say too much.
https://twitter.com/eichisanden/status/1392988217469591556?s=21
　If you just think "I'm no good" in your mind, it doesn't affect other people, so it's less of a problem.
　An unfortunate pattern of "hurt others with presumptuous statements."

>[nishio https://twitter.com/nishio/status/1392775724772171779]: If you run a bot that automatically adds people who say "I'm not a big deal" on Twitter to a list of people who are "not a big deal," and the people who get added get angry, you know that the initial "I'm not a big deal" was not meant. If the added person feels anger, it shows that the original "I'm not a big deal" was not the real intention. Let's add the angry person to another list.
	>[nishio https://twitter.com/nishio/status/1393001615175548932]: I'm going to hang this over here as well, since some people may not get the premise from just this tweet. [condescension is hubris].
	>[nishio https://twitter.com/nishio/status/1393003778823970817]: Even though in Buddhism condescension is hubris, there is no problem if you only think it in your mind, because it does not affect other people. However, "thinking in one's mind" and "posting on social networking sites" are two different things, just as, for example, wearing no mask at home is different from wearing no mask in a park used by an unspecified number of people.
	>[nishio https://twitter.com/nishio/status/1393006848211488768]: In a situation like "Mr. A, a senior whom I admire, is more amazing than me, and I'm not a big deal", cutting "Mr. A is more amazing than me" to "I'm not a big deal It is an overgeneralization that focuses on the negative aspects of the situation. In the same situation, you can say, "My senpai is great! I have to learn from them." Some people tweet in a positive way.

relevance
　[I'm not confident" is too confident.]
