Increase in suicides
[CNN.co.jp : Japan's October suicides surpass annual new coronas deaths, women up markedly https://www.cnn.co.jp/world/35163196.html]
	>Government statistics show that the number of suicides in Japan in October exceeded the number of deaths from the new coronas since the beginning of the year. The National Police Agency reported 2,153 suicides in the same month, a sharp increase from the previous month. Meanwhile, the total number of new coronas deaths in Japan, as compiled by the Ministry of Health, Labor and Welfare, stood at 2,087 as of November 27.
	>In October this year, female suicides in Japan increased by about 83% compared to the same month last year. In contrast, male suicides increased by 22% year-on-year.

I looked up the actual values because it smells so bad when it says "spike" but doesn't say how much the overall increase was, when it compares the total number to the new corona deaths instead of the increase, and when it splits the set into two and then gives the percentage increase in the latter half of the set.

[Number of suicides｜National Police Agency Web site https://www.npa.go.jp/publications/statistics/safetylife/jisatsu.html]
	[https://gyazo.com/a150a8879fa374637f94d5a6170e3bd0]
		Suicides in 2048 (PDF)
	[https://gyazo.com/47b40393eb81cef67e9ad6d2178f87b6]
	New Corona Deaths [Open Data｜Ministry of Health, Labour and Welfare https://www.mhlw.go.jp/stf/covid-19/open-data.html]

summary
　Suicides in October 2020 +619 (+40%) y/y
　　Compared to the median of the last 5 years, it's +365 (+20%)
　　A 40% increase divided between men and women would be 83% and 22% in the article.
　　　October 2020: 1306 males and 852 females
　　　October 2019 1073 males and 466 females
　New Corona deaths in October: 196
　 Since the total number is 1577 on 10/1 and 1773 on 11/1.
	　By the way, 2171 on 12/1 and 3513 on 1/1, so 387 dead in November and 1342 in December.
	In October, a normal month-to-month comparison would have said "619 more suicides than 196 more deaths from the new corona."
	　Why don't you just write it in a normal way instead of writing it in a weird way...
	　I wonder about December, since the new corona deaths are just under 7 times the October deaths; I don't know about December suicides, since the values for December suicides are not yet available (as of 1/5).


Year 2022
　I remembered some time after I wrote this article and looked at the data since then.
　[https://gyazo.com/a7e77e32e475faed7836aac76208eb07]
　It is true that the number of female suicides has been increasing since 2020.
　　The article misleadingly made it sound as if there was an 83% increase, but on a year-to-year basis, there hasn't been that much of an increase.
　　　[deviation from average and sample size].
　　　　By making the data monthly, it is more susceptible to noise, and just happened to sensationalize the large values that were reported.
