Conversation Log 20210120
[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon]Organize as we talk about what to do next.
[nisbot.icon]What happens then?
[nishio.icon]When you have a clear idea of what you need to do, it's easier to start the next task.
[nisbot.icon]What type of work is that?
[nishio.icon]Listen first.
[nisbot.icon] work
Allow [nishio.icon] logs to be displayed Import into Regroup, put on Scrapbox, etc.
[nisbot.icon]Regroup
[nishio.icon] so we can test it Maybe we'll want to tinker with the internal structure a little bit, but tinkering without testing is hell I want to tinker with it to make it training data or to import it into Regroup
[nisbot.icon]Hell
[nishio.icon]Download data accumulated in Firebase locally for analysis.
[nisbot.icon]Firebase
[nishio.icon]The End
[nisbot.icon]What kind of end is that end?
[nishio.icon]NGKW
[nisbot.icon]
	> I'll be able to test it Maybe I'll want to tinker a bit with the internal structure, but tinkering without testing is hell I want to tinker with it to make it training data or to import it into Regroup.
	What type of Regroup is this?
[nishio.icon] A tool that allows you to freely place fragments of text
[nisbot.icon]
	> I'll be able to test it Maybe I'll want to tinker a bit with the internal structure, but tinkering without testing is hell I want to tinker with it to make it training data or to import it into Regroup.
	Is there anything else about this Regroup?
[nishio.icon]You need a certain amount of input to get into your element.
[nisbot.icon]What kind of realm is that realm?
[nishio.icon] Helping to resolve situations where there is a lot of information that cannot be organized
[nisbot.icon]What kind of lots are those lots?
[nishio.icon]We're over capacity.
[nisbot.icon]What type of capacity is that?
[nishio.icon]Wait a minute, we're getting away from the task organization that was the goal of this project.
[nisbot.icon]What type of task organization is that?
[nishio.icon]Clarify what needs to be done and where to start.
[nisbot.icon]
	> I'll be able to test it Maybe I'll want to tinker a bit with the internal structure, but tinkering without testing is hell I want to tinker with it to make it training data or to import it into Regroup.
	Where is this Regroup located?
[nishio.icon] downstream of the listening chat system.
What kind of chat system is [nisbot.icon] that?
[nishio.icon]Encourage verbalization by asking questions about what is not yet clearly verbalized.
[nisbot.icon]What type of verbalization is that?
[nishio.icon]Triggered by the question.
[nisbot.icon]What type of question is that?
[nishio.icon]Less preconceived questions
[nisbot.icon]What do you value?
[nishio.icon]The listening chat system asks questions to encourage the verbalization of what has not yet been verbalized, which then becomes the input for the Regroup to organize. Then, the first priority task is to output the logs in a format that can be imported into the Regroup, rather than to show them to humans.

---
consideration
　The log output function for human reading is not yet implemented, so it's formatted by hand.
　The keyword statement right after "listen first" is odd.
　The key word being "end" is a bug.
　I pasted a task list containing newlines, which properly removed the newlines, but I should have also removed the consecutive whitespace characters.
　　Rather, when you paste something that contains line breaks, should each be a separate statement?
　Now that it's HTML, it's hard to see if you don't put a break between the quote and the question.
　　The output must be separated by whether it is to be sent to chat or the Web.
　　It's hard to see the quote on the screen, if this was a chat, the client would have put it in quote format.
　　I'd like to see the web client parse the output for chat.
　　Before it was arranged for easier viewing, it looked like the following
nisbot
> > I'll be able to test it Maybe I'll want to tinker with the internal structure a bit, but tinkering without testing is hell, so I want to tinker with it to make it training data or to import it into a Regroup. Is there anything else you can tell me about this Regroup?

[https://gyazo.com/bbab6bfa4ff3b8ca2bb1db813a9152e4]
[https://gyazo.com/8b55099e7e6a63d52f35907ee279cd57]
[https://gyazo.com/c35ded2409cdd0e3874f7c0b10546e98]

[Conversation log].
