2015 Conversation Log
from [Kikkuri Chat System].
2015 Conversation Log
Read the 2015 Conversation Log 2019 Considerations
Read the log from 4 years ago
[Conversation experiment with him 1 - Yasukazu Nishio's Hatena Diary https://nishiohirokazu.hatenadiary.org/entry/20150117/1421425021]
	If keywords are selected only from the immediately preceding statement, the conversation will go off the rails, so it is necessary to restore the conversation as appropriate.
	If you simply accumulate the words that appear, the probability that a word in the previous answer will be selected gradually decreases.
		It gives the feeling of "you're not listening to me properly."
	I want to make [listening] concrete.
		Better distribution of knowledge in cases where knowledge distribution has been hindered due to lack of language
	You should only add "that" if it was part of the immediately preceding utterance.
	We want to quit turn-based movements. We want to determine from input time and typing speed how much the user is struggling to reply.
	Being asked questions to notice unexpected blind spots and get ideas
	I prefer a smartphone instead of a laptop.
	If it's a word from a sentence that's far away, then the sentence needs to be restated.
	Teachers as a role that brings out students' independent actions and awareness.

[Reflecting on the improvement plan and artificial anencephalon - Yasukazu Nishio's Hatena Diary https://nishiohirokazu.hatenadiary.org/entry/20150117/1421504944]
	The longer the user's response to a question, the more evidence of successful listening.
	Key phrases that appear in only one utterance are not that important. Key phrases of the type that appear many times and link together aspects described in several utterances are important.
	It would be important to use real-time chat instead of turn-based dialogue programs, and to take the input time and such as a feature value.
		Users enjoy writing quick responses when they are asked pertinent questions.
 		Really?
 			It's the answers you write about your problems that are important.
