Discuss testing policies
[Conversation log].
https://keicho.netlify.app/#talk=C9bpRVUmbuXhtIHKgcd6
Summary [Testing Policy].

[nisbot.icon]What would you like to see happen in this conversation?
I need to write a test for this chat system [nishio.icon], but I need to organize how to test it.
What kind of chat system is [nisbot.icon] that?
[nishio.icon] User enters, extracts keywords, and asks questions
[nisbot.icon]What type of user is that user?
[nishio.icon]I'm human, but it's hard for a human to input and test every time, so I want to test mechanically.
[nisbot.icon]What kind of each time is that each time?
[nishio.icon]NGKW
[nisbot.icon]What type of NGKW is that?
[nishio.icon] This is a command to delete keywords, but there is something wrong with it being used in the question text. They must have bugged it during porting. I want to test these things without using humans.
[nisbot.icon]What kind of human being is that?
Send [nishio.icon] string
[nisbot.icon]What type of string is that?
[nishio.icon] Sometimes it's normal Japanese, sometimes it's a command.
[nisbot.icon]What kind of Japanese is that?
It contains the [nishio.icon] keyword.
[nisbot.icon]What type of keywords are those?
String that should be used for [nishio.icon] questions
[nisbot.icon]Is there anything else about that string?
It is possible to have an input that does not contain the [nishio.icon] keyword.
[nisbot.icon]Anything else about that keyword?
The bug of choosing [nishio.icon] command as a keyword.
[nisbot.icon]Where is that keyword?
[nishio.icon] in the entered string.
[nisbot.icon]Where is that string?
Given to the server via [nishio.icon] network
[nisbot.icon]What type of server is that?
The [nishio.icon] chat system card is running, I want to test it.
[nisbot.icon]Anything else about that chat system?
I want to fix [nishio.icon] a lot of things, but I don't want it to break.
[nisbot.icon]
 > This is a command to delete keywords, but there is something wrong with it being used in the question text. It must have been bugged during porting. I want to test these things without using humans.
 What else can you tell us about this human being?
[nishio.icon]Human input is time-consuming, so I'd like a program to do it for me and observe the results.
[nisbot.icon]Where is that human being?
[nishio.icon]NG
[nisbot.icon]What type of ng is that ng?
[nishio.icon]This one's buggy, too.
[nisbot.icon]What type of bug is that?
Expected output is not obtained after executing [nishio.icon] command.
[nisbot.icon]What type of output is that?
Don't ask questions for [nishio.icon] command strings, if you can describe the expected output, that's the test.
[nisbot.icon]Is there anything else about that output?
Just read the response directly from the [nishio.icon] server.
[nisbot.icon]Is there anything else about that server?
[nishio.icon]Having memories is tricky, so let's create an environment without memories for testing and make it a system that uses them.
[nisbot.icon]What type of memory is that?
Since [nishio.icon] will be added to the memory for each user in the future, we can set the user name to test and remove that user when testing.
[nisbot.icon]What do you value?
Being [nishio.icon]tested will give you peace of mind that you can fix it.
[nisbot.icon]
 > This one is buggy too.
 Is there anything else you can tell us about this bug?
[nishio.icon]When you discover this kind of thing when people are using it, it makes you as a user and you as a developer, and it takes your concentration away.
[nisbot.icon]Where is that human being?
[nishio.icon] (Ignore the question.) For now, let's write code to hit the API for various commands and check the responses.
[nisbot.icon]What type of response is that response?
Only text is returned in [nishio.icon]JSON. When you want to check the internal status, you need another mechanism. downloading and verifying Firebase records directly seems to be a good idea.
[nisbot.icon]
 > When you discover this kind of thing when you are using a human being, it makes you as a user and as a developer, and it distracts you from your focus.
 What is this human being like?
[nishio.icon]It's like I'm doing a play and teaching my co-stars how to act.
[nisbot.icon]
 > When you discover this kind of thing when you are using a human being, it makes you as a user and as a developer, and it distracts you from your focus.
 Where do these humans come from?
You're a [nishio.icon]author, so when you see a bug, you want to fix it.
[nisbot.icon]Where is that bug?
[nishio.icon] in the chat system.
[nisbot.icon]Where is that chat system?
It's running on [nishio.icon]Heroku, is it better to run it locally when testing?
[nisbot.icon]
 > When you discover this kind of thing when you are using a human being, it makes you as a user and as a developer, and it distracts you from your focus.
 How do you know this person?
[nishio.icon]NG
[nisbot.icon]Anything else about that NG?