strength
[https://gyazo.com/9a77b503d0830ada32f11ac0e20ec481]

[https://gyazo.com/80a2d3be0b0f18d792d66c29f0aafc8c]
[https://gyazo.com/0aa22749696a2bb679e5b3773e87e4a3]

Ideation® .
A person with a talent for inspiration is fascinated by ideas. They can find connections in phenomena that have nothing in common on the surface.
<Quality Characteristics
When you are looking at, listening to, or thinking about something, "inspiration" strikes and ideas fly.
2) Contribute with unconventional ways of thinking and new, fresh perspectives. Unconventional" is a compliment.
(3) We do not like mediocrity or the ordinary. (4) They are oriented toward new things that no one has ever thought of before.
<Ineffective use
They are misunderstood as talking jumps from place to place and saying unrealistic things. They come up with lots of ideas, but without execution, they may be perceived as "just saying things but not doing them themselves.

Strategic® [34.
Those with the gift of strategic thinking come up with options for getting things done. In any given scenario, they can find appropriate patterns and problems.
<Quality Characteristics
First, clarify the results you want to achieve. (2) The methods to get there will come to mind one after another. Select and implement the most appropriate method.
If it doesn't work, change course or to a different method. Continue until results are achieved.
(iii) To avoid overlooking the best route, think about all possibilities, "What if ________?
<Ineffective use
They are unaware that the whole picture they see is not visible to the other person, and they are frustrated, asking why they don't understand. In an environment with little freedom, they are unable and unwilling to expand their options.

33. desire to learn] Learner® .
The gifted person with a desire to learn loves to learn and wants to improve all the time. They are more attracted to the process of learning than the results.
<Quality Characteristics
I enjoy the process of learning new things, understanding new things, and improving and becoming able to do things.
If you go through the trouble of learning, it will be more enjoyable if you set a goal of obtaining a qualification.
3) I get excited when there are a lot of things I "don't know". I don't like people who pretend to know things.
<Ineffective use
When you know yourself to a certain extent, you get bored. You need new stimuli to keep you motivated.

29. future-oriented] Futuristic®.
Future-oriented talents are motivated by drawing the future in their minds. By talking to others about their visions of the future, they energize those around them as well.
<Quality Characteristics
I enjoy predicting and imagining what the future will be like. (2) I have dreams for the future.
Contribute to people by anticipating what the future will be like, developing an image, and presenting a vision.
(3) I have no doubt that the future is bright.
<Ineffective use
Without realistic execution, they will be thought of as delusional dreamers of the future.

32. internal reflection] Intellection®.
Those with the gift of introspection go inside themselves to find answers. It is important to spend time in your head asking yourself questions and deepening your thoughts.
<Quality Characteristics
Think first before you act. (2) Deepen your thinking about the meaning and essence of knowledge and experiences, rather than leaving them as they are.
(2) Time to think carefully and deeply alone is very important. You cannot give an immediate answer when asked a question. First of all, you need time to think.
(3) If I don't have time to think, my mind feels like an overturned trash can and I don't feel good and can't move forward.
<Ineffective use
Thinking takes up time and reduces the speed and productivity of the team. While thinking, they are not aware of their surroundings and may be perceived as not listening to others or indifferent to things.