I'd like to talk and sort out whether to write an explanation at this point or implement new features first.
I consulted with him because I wasn't sure whether to write a software description or add a new feature.
	I realized that some of the new features I had imagined were clearly important and some were not.
	The vague "new feature" was split into two parts.
	As a result, we concluded, "Let's implement the important ones before writing the explanation.
	Breaking free from [false choice].

[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon]I'd like to talk and sort out whether to write an explanation at this point or implement the [feedback button] first, because I'm thinking about what to do.
[nisbot.icon]What type of feedback button is that?
[nishio.icon]Now there are some commands such as NGKW, but now that we have changed from text-based chat to web UI, I think it would be better to make the commands easier to understand with more buttons and such (more like command buttons than feedback buttons).
[nisbot.icon]Anything else about that feedback button?
[nishio.icon]Some types of feedback are used for training data. For example, if it is NGKW, reduce the probability of selecting it as a keyword.
[nisbot.icon]What type of NGKW is that?
[nishio.icon] A command that provides feedback that a keyword used in the previous question is not appropriate, and can be said to be a command that immediately removes that keyword from the keyword list for that session
[nisbot.icon]What type of command is that?
[nishio.icon] This chat system has keywords and their "appropriateness score". Being selected for a question means your score is high, but if it is not appropriate, you can delete it and your score will be zero.
What kind of chat system is [nisbot.icon] that?
[nishio.icon]Find keywords in human statements and ask probing questions about them.
[nisbot.icon]What type of keywords are those?
[nishio.icon]A concept that seems appropriate as a subject to delve into. So when they pick something that's not appropriate, we want to stop them promptly.
[nisbot.icon]What type of concept is that?
[nishio.icon]Often vague and blurred when first uttered, the form is gradually clarified by being asked questions and trying to answer them
[nisbot.icon]What do you value?
[nishio.icon]A vague and blurred concept is given a clear form through questions by a chat system.
[nisbot.icon]Anything else about that chat system?
[nishio.icon]Promptly stopping digging into concepts that aren't appropriate plays an important role in getting value from using this chat system.
[nisbot.icon]Where is that chat system?
[nishio.icon]Aside from this question, the conclusion is that at least the NGKW button is a high priority for implementation. Other buttons aside.
[nisbot.icon]What type of question is that?

[conversation log] [conversation log 20210126] https://keicho.netlify.app/#talk=y3mJfH67rbHpvTp9yfY6