I don't want to put the data in a repository, but I need to sort out what to do with it.
I don't want to put the training data for machine learning in a repository to deploy on a server, but what is the best way to do it, I want to organize it.
	They were trying to avoid options that could cause problems because they didn't know if there was a problem or not, and they were afraid of the options that could cause problems.
		I realized that since it's not such a serious problem, I could try it and observe if it happens.
		[Avoidance of actions with uncertain outcomes]

[nisbot.icon]What would you like to see happen in this conversation?
I don't want to put the training data for [nishio.icon] machine learning in a repository to deploy on a server, but I'd like to know what to do with it and how to organize it.
[nisbot.icon]What type of repository is that?
[nishio.icon] Push to that repository and it will be deployed automatically.
[nisbot.icon]Is there anything else about that repository?
I wanted to separate the [nishio.icon] servers because if I put in things that are not used on the server, it might affect transfer time, deployment time, and so on.
[nisbot.icon]What type of server is that?
[nishio.icon]On Heroku, you can't touch the file system directly from here (probably), it's like a black box.
[nisbot.icon]What kind of Heroku is that Heroku?
[nishio.icon] NGKW
[nisbot.icon]What type of NGKW is that?
[nishio.icon]Huh? (PS: I am surprised that the command is not triggered. Bug: The command is not recognized if it is preceded by a space character)
[nisbot.icon]
 > Push to that repository and it will automatically deploy.
 Where is this repository located?
[nishio.icon] This is also on Heroku's server.
[nisbot.icon]Is there anything else about that server?
[nishio.icon]I'm on the free version for now, so I'm going to sleep, and you don't want to increase the time it takes to come back from sleep.
[nisbot.icon]What type of sleep is that sleep?
[nishio.icon] Starts container after user accesses it, so if container is large, it will take time (probably).
[nisbot.icon]What type of container is that?
[nishio.icon]I don't know.
[nisbot.icon]
 > Push to that repository and it will automatically deploy.
 Where is this repository located?
[nishio.icon] NG
[nisbot.icon]What type of ng is that ng?
[nishio.icon]That's strange, I thought I fixed this bug, but I checked later (PS: This is also a bug where the command is not recognized if it is preceded by a space character.)
[nisbot.icon]What type of bug is that?
[nishio.icon]NGKW
[nisbot.icon]
 > Push to that repository and it will automatically deploy.
 What does this repository look like?
[nishio.icon]Black box
[nisbot.icon]What kind of black box is that black box?
[nishio.icon]You don't know the details. So you're worried.
[nisbot.icon]What kind of details are those details?
[nishio.icon]That's the time it takes to come back from sleep, and you're worried about something that could make it worse because you can't predict it.
[nisbot.icon]Is there anything else about that sleep?
[nishio.icon]The function to tell users to wait while waiting for recovery from sleep has already been implemented, so should we try it without worrying about it for once, or think about it after the problem occurs?
[nisbot.icon]Where is that sleep?

[conversation log 2021-01-27].
https://keicho.netlify.app/#talk=60d6etwoXzzctsCNLuo0
