Consider explaining the new features.
A new command called "UPKW command" was created today, and I will consider explaining it.
	I wanted to explain a new feature, but he started talking about "how it used to be" or something like that.
	ã€€This is an inadequate explanation of the user perspective
	After plowing through, the "what is the value?" question verbalized something close to user value.
 	I realized that the explanation to the user should bring this to the front of the line more often.

[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon] A new command called "UPKW command" was created today, and I'm considering explaining it.
[nisbot.icon]What type of UPKW command is that UPKW command?
[nishio.icon]Up until now, when it was running as a bot for existing chats such as Slack, the commands were entered by a human as a string. So they were short strings, basically taking no arguments, and the keyword selected immediately before the command was the target. The implementation that took arguments was implemented, but it was not used because it was too cumbersome.
[nisbot.icon]What type of Slack is that?
[nishio.icon] A text-based user interface, also known as CUI.
[nisbot.icon]What type of user interface is that?
[nishio.icon]In creating the Web version, we decided to create our own user interface, and the idea came naturally: why not put the commands as buttons?
[nisbot.icon]Is there anything else you can tell us about its user interface?
Even for commands that take [nishio.icon] arguments, you can make each argument a button.
[nisbot.icon]What type of command is that?
[nishio.icon]The first command I implemented was the NGKW command, which "removes keywords used in the previous question when they are keywords you don't want to dig into.
[nisbot.icon]Is there anything else about that command?
[nishio.icon], which led to the idea that it would be nice to have a "command that tells the user to ask for more of this for a keyword that was not used in the previous question".
[nisbot.icon]Where is that command?
They are lined up as buttons under the [nishio.icon] input field. So, you can separately present "keywords that were not selected" that do not appear in the chat document.
[nisbot.icon]What type of keywords are those?
[nishio.icon] Keywords extracted from user input.
[nisbot.icon]Anything else about that keyword?
[nishio.icon]Users implicitly have keywords that they want you to dig into and keywords that you don't. By being asked a question that actually digs in, what they want you to dig in is output as a response of "No, don't dig that in" or "Ask me more about this one," and becomes observable.
[nisbot.icon]What do you value?
[nishio.icon]We want to encourage the output of what is in humans that has not yet been clearly output by having software work on it, and software that can do this is valuable, and the UPKW command is valuable because it contributes to this.
[nisbot.icon]Is there anything else about that UPKW command?
When [nishio.icon] is used, the target keyword is more likely to be used in the question. The information that a user pressed this button is information that the user values the keyword selected by the button more highly than the keyword selected just before, so if we collect a lot of this information, we can use it to improve the keyword selection algorithm.
[nisbot.icon]Where is that keyword?
[nishio.icon]This is a button to express the feeling that the chosen keyword itself is not bad but the question just before is not so good ðŸ™.
[nisbot.icon]What type of immediate previous is that immediate previous?
[nishio.icon]NGKW Last name
[nisbot.icon]
 > We want to encourage the output of what is not yet clearly output in humans by having software work on it, and software that can do this is valuable, and the UPKW command is valuable because it contributes to this.
 Where is this UPKW command?
Keywords are displayed in a prominent position below the [nishio.icon] input field.
[nisbot.icon]
 > We want to encourage the output of what is not yet clearly output in humans by having software work on it, and software that can do this is valuable, and the UPKW command is valuable because it contributes to this.
 Where is this UPKW command located?
[nishio.icon]ðŸ™
[nisbot.icon]
 > We want to encourage the output of what is not yet clearly output in humans by having software work on it, and software that can do this is valuable, and the UPKW command is valuable because it contributes to this.
 What does this UPKW command look like?
[nishio.icon]Mysterious communication that seems to reply not to the words spoken by the other person, but to the words that were not spoken.
[nisbot.icon]
 > We want to encourage the output of what is not yet clearly output in humans by having software work on it, and software that can do this is valuable, and the UPKW command is valuable because it contributes to this.
 Where does this UPKW command come from?
When the [nishio.icon] bot selects keywords to use for a question, it internally scores them and chooses the largest one. At this time, there are keywords with high scores that were not chosen, so they are used
[nisbot.icon]Where is that keyword?
[nishio.icon]ðŸ™ (on second thought, this command didn't implement the server side yet)
[nisbot.icon]Where is that command located?
[nishio.icon]UPKW Question.
[nisbot.icon]
 > When the bot selects keywords to use for a question, it internally scores them and chooses the largest one. At this time, there are keywords with high scores that were not chosen, so they are used
 What type of question is this?
[nishio.icon]Questions to make the user verbalize the blurring in his/her mind.
[nisbot.icon]Anything else about that question?
[nishio.icon]I think it has the effect of forcing you to move your point of view. There is a new awareness by looking at it from a different point of view.
[nisbot.icon]
 > Questions to make users verbalize their inner blur
 Where is this question?
[nishio.icon]ðŸ™
[nisbot.icon]
 > Questions to make users verbalize their inner blur
 Where is this question?
[nishio.icon]ðŸ™
[nisbot.icon]
 > Questions to make users verbalize their inner blur
 What does this question seem to be?
[nishio.icon]I used to say like a fish hook, but based on our conversation so far, it's a little different. It's like someone who stands up and takes someone who is sitting and thinking and brings them around.
[nisbot.icon]
 > Questions to make users verbalize their inner blur
 Where does this question come from?
[nishio.icon] coming from within this chat system.
[nisbot.icon]
 > Questions to make users verbalize their inner blur
 How do you know this question?
[nishio.icon] displayed on the phone at hand.
[nisbot.icon]
 > Questions to make users verbalize their inner blur
 This begs the question, what should happen?
[nishio.icon]It's good when users gain new insights, saying, "Oh, I see.
[nisbot.icon] What needs to happen to that question?
[nishio.icon]The questions need to be a good balance, neither obvious questions that are easy for the user to answer, nor misguided questions that are far removed from the user's interests.
[nisbot.icon]The question is can it?
[It's not entirely impossible, but it's not clear how it can be done.
[nisbot.icon]
 > We want to encourage the output of what is not yet clearly output in humans by having software work on it, and software that can do this is valuable, and the UPKW command is valuable because it contributes to this.
 What is the relationship between this UPKW command and the question?
[nishio.icon]A command that pulls "not that way, this way" when the bot starts asking misguided questions. So you get closer to a "good balance".
[nisbot.icon]What is the relationship between that command and the question?

consideration
	If this log is chopped and rearranged in Regroup, it would be a good case study.
		[organize logs of listening chats by inscribing them on sticky notes].
https://keicho.netlify.app/#talk=yAJxKTwc1ryiUTUbihUA
