Anything published without permission is not "published".
Article 32 of the Copyright Act stipulates that "published material may be quoted," but what happens if it is published without permission by someone who is not the copyright holder?

The definition of publication by the [Copyright Act] is "A work is published when it is published or presented to the public by means of performance, performance, showing, public transmission, oral transmission, or exhibition by person X.... . shall be deemed to have been published." In this case, the term "Person X" means "the person who has the right, or the person who has obtained the permission ... . or a person who has obtained ...". Therefore, something that is made public without permission by a person who does not have the right is not [made public].

Therefore, the requirement [published material may be cited] is also not met.

>Article 4 A work shall not be published, or transmitted to a person who has the rights prescribed in Articles 22 to 25 inclusive, or a person who has obtained his/her authorization (meaning the authorization for use under Article 63 paragraph (1); the same shall apply hereinafter), or a person who has obtained the establishment of a publication right under Article 79, or his/her public transmission authorization (meaning the authorization for public transmission under Article 80 paragraph (3)). (2) The person who has obtained the right provided in Articles 22 to 25 inclusive, or the person who has obtained the establishment of the publication right provided in Article 79, or the public transmission license (meaning the license for public transmission under the provisions of Article 80 paragraph (3); the same shall apply hereinafter) thereof. The same shall apply in the following paragraph, the proviso to Article 37 paragraph (3) and the proviso to Article 37-2). (2) In the case of an architectural work, when the work is presented to the public by means of performance, performance, showing, public transmission, oral statement or exhibition by a person who has obtained the right prescribed in Article 21 (in the case of an architectural work, the right prescribed in Article 21 or its permission (meaning the permission for use under Article 63 paragraph (1)) or the permission of the person who has obtained the right prescribed in Article 21 (meaning the permission for use under Article 63 paragraph (1)). (2) In the case where a work of authorship is presented (including the case where a work of authorship is constructed by a person who has obtained the right under Article 21 or its authorization (meaning the authorization for use under Article 63 paragraph (1)) (2) A work shall be deemed to have been made public in the following cases

Regarding the more specific case of "a person who disclosed the source code of a program he created in the course of his duties without permission of his employer.

The author of a program created in the course of employment is the legal entity, not the person who wrote the program, unless otherwise decided in advance (work in progress).

Therefore, this is a case in which A, who wrote the program in the course of his duties, published it without his employer's permission, which is not "publication" under the Copyright Act because A is not the author and has not received permission, and therefore third parties are not allowed to quote and refer to the program.

>Article 15 2 The author of a work of a program prepared by a person engaged in the business of a juridical person, etc. in the course of his/her duties based on the initiative of the juridical person, etc. shall be the juridical person, etc. unless otherwise provided for in a contract, service rules or other rules at the time of preparation.

reverberation
　Q: A screenshot of the screen listing the file names of the leaked source code was used in a news article, is this copyright infringement?
　 A: I think this case is OK under "Use for Reporting Current Events (Article 41 of the Copyright Act).
　 > (Use for reporting of current events)
  > Article 41 When reporting a current event by means of photographs, films, broadcasts or other methods, works that constitute the event or are seen or heard in the course of the event may be reproduced and used in conjunction with the reporting of the event to the extent justifiable for the purpose of reporting.

	Q: If I quote source code without knowing that it is copyright infringing published source code, isn't that a "citation to published material"?
	　A: Let's distinguish between what is NG under civil law and what is OK under criminal law.
	　Under civil law, this is a tort. So the original copyright holder can demand an injunction or compensation for damages from the person who is quoting him. [Civil Code Article 709] [Copyright Law Article 112]
	　> (Damages for tortious behavior)
  > Article 709 Any person who intentionally or negligently infringes the rights or legally protected interests of another shall be liable for damages resulting therefrom.
  > (Right to demand an injunction)
  > Article 112 An author ... may demand a person who infringes or is likely to infringe his/her moral rights, copyrights, ... to stop or prevent such infringement. ...
	　Under the Penal Code, the act is not punishable because it is an act without intent to commit a crime. [Article 38 of the Penal Code]
	　> ([Intentional])
  > Article 38 An act without intent to commit a crime shall not be punished. However, this shall not apply where there are special provisions in law. (Omitted hereafter.)

　Q: If a subcontractor has a miscellaneous contract, isn't it possible that it is not an employee work?
　　A: There is no possibility.
　　Specifically, for example, if an individual developer X provides sample source code to a subcontractor without any employment relationship and without receiving instructions, and the subcontractor delivers the code upstream on its own initiative, the requirements for an employee work are not met, and the developer X is the author and is naturally free to disclose it.
　　But in this case, the name of the company that placed the order was in the source code, and it was discovered. Isn't it hard to think of a case where it doesn't constitute a work of authorship?
　　Some say, "If only the legal department had their way..." Well, it's true that often there are companies that aren't quite right.
　　The Supreme Court has ruled that even if there was no employment relationship, it is possible to determine that the employee was "engaged in business.
　　　>The Supreme Court held that it is clear that a person who has an employment relationship with a juridical person is a "person engaged in the business of the juridical person," but when the existence of an employment relationship is disputed, the existence of an actual relationship between the juridical person and the person who created the work should be considered from a practical standpoint, and whether or not the person provides labor under the direction and supervision of the juridical person, and whether or not the money paid by the juridical person can be evaluated as compensation for the provision of labor. The Supreme Court held that the existence of the relationship between the juridical person and the person who created the work should be judged by comprehensively considering the specific circumstances such as the type of work, existence or non-existence of supervision, amount of consideration, and method of payment (Supreme Court HP, April 11, 2003 (R.B.G. case)).
	　[Work by the Attorney at Law https://www.tenma-lo.jp/case/corporate-law/copyright/1393?fbclid=IwAR0bEGQsoGBJVGqPoENqBtEMT4MeEmHO4tzdQYx9I1 kLctSzijTuMUhkItU]
	　So if this is the point of contention regarding this case, it may have to be argued in court to reach a conclusion.
