Conversation log 2021-01-31
When I asked for advice on how to write a test, I was asked where the test was located, and when I tried to answer that it was the same as an existing test, I realized that it didn't have to be the same.
https://keicho.netlify.app/#talk=hWLZQImnEQxmsWK4WDC8

[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon]I'm thinking of making a slightly large-impact modification to this chat system, and I think it will probably work, but I'm wondering how to write a test for it, so I'd like to discuss it with you.
What kind of chat system is [nisbot.icon] that?
[nishio.icon]Repeat questions and dig deeper for keywords.
[nisbot.icon]What type of keywords are those?
[nishio.icon]It's tied to an important concept in the user's mind.
[nisbot.icon]What type of user is that user?
[nishio.icon]NGKW User
[nisbot.icon]What type of concept is that?
[nishio.icon]Still ambiguous
[nisbot.icon]
 > I'm thinking of making a modification to this chat system that will have a slightly larger impact, and I think it will probably work, but I'm wondering how to write a test for it, so I'd like to discuss it.
 Is there anything else you would like to share about this chat system?
I would like to figure out how to [nishio.icon]test. Questions about relationships between keywords should be asked after each keyword has been drilled down, but currently, when a keyword with a very high attention score appears, the relationship between it and a word that has not been drilled down is asked.
[nisbot.icon]Anything else about that keyword?
[nishio.icon]Newly appearing words have a low attention score. Repeated occurrences make it higher. Should be developed by digging deeper before asking a relationship question.
[nisbot.icon]What kind of word is that word?
Same as [nishio.icon] keyword
[nisbot.icon]Where is that keyword?
[nishio.icon] in the user's text.
[nisbot.icon]
 > Same as keyword
 How do you know these keywords?
[nishio.icon]More importantly, I'd like to discuss testing methods.
[nisbot.icon]What type of test is that?
[nishio.icon]I would like a test that can confirm what kind of bad situation we are in now, and that the fixes have improved it, and automatically confirm that this case has not gotten worse when we tweak things in the future.
[nisbot.icon]Is there anything else about that test?
[nishio.icon] It is difficult to write a test because it is not the kind of test that says "react like this when you get this kind of input", how should I write it?
[nisbot.icon]Where is that test?
[nishio.icon]I was going to put it with the other easy-to-understand tests... but maybe that's a mistake? Maybe I should stop making implicit assumptions about the test runner I'm using now?
[nisbot.icon]Where is that test located?
I can cut [nishio.icon] another folder and put the non-question-by-question tests in there.
[nisbot.icon]How do you know its testing?
[nishio.icon]What I wanted to test was "no questions asking about relationships before digging questions" or "no bias toward one question type or one keyword", so I could test the former kind of back-and-forth conditions by pouring in user input from the logs, and the latter kind of statistics. Is it enough to take
[nisbot.icon]What do you value?
[nishio.icon]Testing increases the speed of product growth by providing peace of mind when making modifications that have a large scope of impact.
[nisbot.icon]What does that test look like?
[nishio.icon]Like a helmet or knee pads to wear when practicing roller skating. It reduces the risk of injury.
[nisbot.icon]
 > Testing increases the speed of product growth by providing peace of mind when making modifications that have a large impact scope.
 What should happen with this test?
[nishio.icon]It would be nice if something that is difficult to describe in each question could be described in the way described above.
[nisbot.icon] What needs to happen for that to test?
[nishio.icon]If the end result returns a true/false value, it can be integrated with conventional tests, but there are still some that do not, so it is necessary to separate them from the current tests for once
[nisbot.icon] That test can it?
[nishio.icon]So let's do it tomorrow.
[nisbot.icon]
 > If it eventually returns a true/false value, it can be integrated with conventional tests, but some still do not, so it is necessary to separate it from current tests for once
 Where does this test come from?
[nishio.icon](typo for "can")