Building a Tachikoma with LEGO 1
[https://gyazo.com/8b6041730f2f6b99bdfa078f0ab3b2e4]
I saw tweets on Twitter such as "I made a living creature with movable joints out of LEGO," and I was interested in it, but I didn't know where to start because I didn't have the knowledge.

I happened to find this site: "[Tachikoma http://www2p.biglobe.ne.jp/~s-hf/toy/lego/legooli20.htm]", which has photos from all sides. I took up the challenge.

The result is shown in the photo at the beginning of this page, and although I have fudged the various missing parts, it has taken shape, so I will explain the internal structure for those who are interested.

The back carry area is just 2x4 blocks stacked on top of each other and smoothed with 1x4 tiles.
I had to order a plate shaped like half an octagon because it is used a lot in the main body, but I recognized it as a "plate" and was looking for it, so it was hard to find.
The correct answer is "[wedge plate 3x6]"
[https://gyazo.com/ce10b483ed158f7d2dc29add6f91136f]

Separate the torso into upper and lower sections
[https://gyazo.com/e2a56b4fa1f5c9f801e57de763f33add]

I just noticed that one of the legs is wrong, no wonder one of the legs should be broken in the first picture.
[https://gyazo.com/398c7756fe6fdd92c9df7e3c8ace7a2f]

About the leg joints. The site I referred to was out of stock of the one I was using, so I bought a different one, but it was misordered and didn't fit together, and I managed to find four that connect. The blue one is the "[hinge plate 1 x 2 - lock catch]" that I bought this time.
The gray one is probably "[hinge plate 1x2 lock]"

The tip of the hand is a part I learned about while researching how to build this robot, "[Bar 1.5L - Clip]".
This can be used directly on the hand, as in this case, or it can be used to represent a finger using several fingers.
The wrist is "[cone 1 x 1]"
Tubular blocks are "[block 1x1 round]"
The root of the hand is "[block 1 x 1 - headlight]"
It's called "headlight," but it's also often used as a part to convert the connection direction 90 degrees. 1x1, so it can be rotated if there are no adjacent blocks. That's why Tachikoma's hands are movable.

The block with the hole in the side at the base of the mouth was original. A 90-degree conversion can be made by pointing the gray pipe.
[Technique block 1 x 2 - pin hole 1]
[Technique connector peg]
[https://gyazo.com/c33a4acde1ab60e4e8db51b67d445822]

Peel off from the back in order.
The curved parts are yellow, they simply didn't have the blue ones.
[https://gyazo.com/ddb4b4feff8e42a5f1d5d35646889999]


Use only one protruding 1x2 plate to bring the round to the center.
[Tile 1 x 2 - center stud]

Regarding eyeballs.
This is the first time I have learned about the diagonalizing component.
　see [hinge base - hinge top].
I wanted to get it in blue but the store didn't have it in stock.
The gray one is "[hinge top 1x2]"
The blue one is "[hinge 1x2 base]"
The white round thing is "[block 2x2 dome top]"

[https://gyazo.com/25e08f1993ac6889170f4468b3a7f3ef]

The previous eyeballs use the same slanting tool. The usage is a little different.
[https://gyazo.com/a49ad6781b34d680c8af16d3ec8c40b2]
[https://gyazo.com/4a3b44f97c39c4ba4f36d3c050a677aa]

I use "[block 1 x 1 - headlight]" for forward facing lights. That's exactly what the name says to use.
The 1x1 panel was made in white instead because I didn't have a blue one, surprisingly.
Smooth blocks are also used for "[tile 1 x 4]" feet.
[https://gyazo.com/407a7b17ac8c7aaa83bc295a6664d867]

Next time I'd like to use this as a guide to improve my carry area.
　https://dronjyo.net/wayslabo/?p=1098
　[https://gyazo.com/ad00f56343550cba8efbdda982e41699]
	[3x3 plate belly Tachikoma]

Next [Building a Tachikoma with LEGO 2].

[Tachikoma with LEGO]
[LEGO]
[Hinge Base - Hinge Top]

---
A while back.
2/7 [Twitter https://twitter.com/nishio/status/1358369812271931396]
 >After sorting through the LEGO at home and looking for parts, I found only one leg of the Tachikoma... and I don't know how the all-important body part is made...
[https://gyazo.com/50be96a801f762d3a8a61bd9fb7c0e5e]

After this [LEGO order 20210207], I received it and made it.
