Mentor's personality
I recently took a "StrengthsFinder" training at work. This is a ranking system that shows which of 34 different "thinking patterns" is the strongest when you answer some questions. It was very interesting to compare the results with those of the 20 people who took the training with me, as each person had their own differences, which actually showed up in their behavior and comments during the training.

I was interviewed for an interview at Unexplored Junior before and after, and I talked about how we do not rank the applicants and take them from the top, but match them with each mentor, and I also talked about how Unexplored itself displays different screening criteria for each PM. I thought it would be a good idea to convey the fact that each mentor and PM has a different personality. This is a good opportunity for me to write about the results of my StrengthsFinder.

The strongest part of my thinking pattern is "inspiration. In other words, I am good at coming up with ideas that "could be related to this" or "could be interesting if connected to this. However, as a mentor, I usually try not to say too much.
The reason is that the average 15 year old finds it hard to argue when someone twice his/her age mentions an idea, such as "such an idea is boring, this idea of mine is better".

At the boost meeting (a meeting to discuss what to do in front of many people at the beginning of a project) of the Junior Unexplored, creators receive various opinions from many people, but every time I tell them, "Don't try to do everything" and "Make your own selections.

I try to be modest with my ideas at first, and gradually increase the number of ideas after I have determined if the person is "tolerant" of other people's ideas.
I don't want to create "workers who do as they are told," so if I tell them an idea, I don't want them to follow it. I don't want you to give priority to an adult's idea when your own opinion conflicts with the adult's. I don't want you to be able to defend your own ideas. I want you to be able to defend your own ideas on your own.

From the standpoint of coming up with a lot of ideas, individual ideas are just "one of many," so it is not regrettable to throw them away. We want to have a relationship where we can bounce ideas off each other without worrying about anything, because better ideas are generated by mixing many ideas together. For this to happen, creators need to have confidence in their own ideas.

The next strongest is "strategic thinking," which is a pattern of thinking about what is the best way to achieve one's goals from among many options. I think this is also quite inhibiting. The reason for this is that I believe that I should not take the steering wheel of a project in the first place, and that the creators should decide for themselves what kind of policy they want to pursue.
If a mentor says, "Let's follow this policy," creators may follow it without thinking for themselves. Wondering which policy is best is also an important learning opportunity, and we should not deprive them of this learning opportunity by helping them ahead of time.

I think I am, but in discussions with other mentors, I wonder if I am placing too much emphasis on the spontaneity of the creators.
In other words, my approach could be described as "leaving things to chance" or "throwing everything at them.

The third strongest thought pattern is the "desire to learn," i.e., "I want to know what I don't know," "I want to understand what I don't know," and "I want to experiment. I myself am a mentor for Unexplored Junior because of my own learning.
I use this pattern all the time in mentoring. When someone says, "I want to buy this book because I want to learn this or that," I say, "Keep buying! I answer, "Keep buying! (Is there a negative mentor here? (Is there a negative mentor here?)
On the other hand, in the case of "I'm not sure what's the best way to do it and I'm having a hard time," we tend to choose "experiment and learn from the results," as in "I can't find the answer by worrying, so let's have users use the product and observe it as soon as possible.

The fourth strongest thought pattern is "future-oriented," and the Unexplored Junior project itself is a future-oriented project to nurture future engineers. I think all the creator projects are also future-oriented because they are creating something new, but what do you think? Maybe I'm unconsciously going through something that isn't?
I myself tend to think and act five to ten years into the future. For example, I wrote "The Technology Behind Coatings" thinking, "I will write a technical book that will not become obsolete even after 10 years. But I don't think they expect that much from the creators of Unexplored Junior. It would be a theoretical exercise to think 10 years into the future when they have only 15 years of life experience. Rather, I would like them to aim for a report on the results of their work in six months, and to properly finish and present their work to the world.
When a creator's program is troubled by a bug, we do not tell them the cause of the bug. The emphasis is on helping the creator in the process of identifying the cause of the bug, and thereby helping the creator acquire the ability to identify the cause of the bug.
Even if the mentors help the students to succeed in the results presentation, it will only give them the experience of "succeeding with help," and they will not be able to run on their own after the junior unexplored period ends. The emphasis is on long-term growth, not short-term success in presentation.

The fifth is "introspection," which is a pattern of preferring to think carefully alone. Often in mentoring, I come up with an idea and chat about it after the videoconference is over, rather than right there in the videoconference.

The sixth strongest pattern is "activeness," a pattern of immediately acting on one's thoughts. The sixth strongest is "active," a pattern of taking action as soon as the thought strikes one's mind. I tend to say, "Let's try it! In the "desire to learn" section, there was "Let's experiment and learn from the results," but even in the same study, they tend to try things out because they don't know rather than "I don't know, so let's see if we can find a good book about it. He is the type of person who does not care much about failure.
I think it is also "active" that I am writing this article anyway.

The seventh strongest pattern is the "ego," which prefers to have the spotlight on itself. I had not noticed this until it was pointed out to me, but I certainly tend to prefer writing and publishing under my own name rather than working as an organization. I would like creators to have results that are tied to the individual, "I created it.
This may be one of the reasons why I emphasize the importance of self-determination of the creators in the progress of a project. It is not cool to say, "My mentor told me what to do, so I did it. It should be "my product" that I thought about and decided by myself.
Since I have been involved in many individual activities in my life, on the contrary, I am not very good at managing teams. When someone talks to me in a way that puts the team as the subject, I am tempted to ask, "So, what do you personally think about this?" I am tempted to ask, "So, what do you personally think?

The eighth is "top-oriented," wanting to make good things better. Of course, they want to make software better, but it also seems to be a pattern of focusing on personal strengths and developing them.

Paired with this explanation is "growth promotion.
Surprisingly, "growth promotion" was seventh from the bottom. I asked him for a detailed explanation, and he told me that people with strong "growth promotion" skills teach the same thing three times, and when they make the same mistake, they try to figure out if they did not teach the right way or not. It is true that I do not teach in such a tenacious manner. I select strong people through selection and work to make them stronger.

The ninth is "goal-oriented," a pattern of clarifying objectives and acting toward them. Even in mentoring, the creators themselves confirm what they want to do and how they want to do it.
I can't imagine someone who is not goal oriented moving forward with a project....
In my case, I ask in the interview what the purpose is and what you will do to achieve it, so I wonder if people who can't answer the question are failing.

The tenth is "self-confidence," a pattern in which one has a compass within oneself and decides for oneself which way to go without relying on others.
Looking back on what I have written so far, I see that I want creators to be "people who follow their own beliefs and not be swayed by the opinions of others.

---
StrengthsFinder focuses on commonly used thinking patterns (strengths), but after writing this far, it seems like it's just a matter of course when it comes to mentoring. This is because I, as a mentor, have written about the thinking patterns that I often use in mentoring. So, let's take a look at the "less-often-used thinking patterns.

The lowest is discipline. The pattern is to follow a daily routine, be organized, and follow the plan without hesitation. If you make a plan early on and follow through with it, that's great execution. In my head I think so, but in my heart I think, "Let's challenge ourselves more.

The second is "inclusion," a pattern in which, for example, when you see someone who is alone, you try to talk to them and include them in your group. I haven't done that.
It is very useful in the long run for creatives to network with their peers, so we encourage creatives to get to know each other (future oriented + strategic).
I think so, but I myself have not acted to support it.

The third is "fairness," a pattern of setting rules that are the same for everyone and then trying to strictly adhere to them. I hate that kind of thinking pattern.
The opposing "individualization" ranked in the top 16. Since each individual is in a different situation, they believe that the response should be different for each individual situation.
This is a point of disagreement among the mentors. For example, when a mentor wants to approve an additional budget for a project, I would say, "If the additional budget will make the project better, then we should do it, but we should not hesitate to do it because we are concerned about fairness with other projects.

The fourth is Harmoniousness, a pattern of thinking that favors everyone's agreement. The enemy of innovation. When new things are created, you are always alone at first. If you seek to agree with those around you, new things will not be created.
This thought pattern avoids expressing opinions that conflict with others. It is very bad. It is not good to have the sense that "different opinions" are considered "conflicts. Different opinions are "sharing a different point of view," and things are better understood when they are shared.

Fifth is "desire to achieve" and I honestly don't understand this one. Why am I perceived as low on this?
The detailed explanation seems to be a pattern of making checklists and filling them all in, or persevering and working hard. It is true that my behavior is rather uneven. I am more characterized by a lack of emphasis on following a plan (low discipline) or prioritizing my interests (desire to learn).
I think it's good that creatives have a high desire to achieve. It's like, wow, they can do something I'm not good at.

The sixth is "recovery thinking," a pattern of finding the cause of a problem and solving it. This is another good trait for a creator. It is a good move to find a specific problem and then seek to solve it.

Seventh is "growth promotion," which I wrote about in the "Topmost Orientation" section.

The eighth is "competitiveness," which is enthusiasm for winning by comparing oneself to others. Hmmm, I see. I don't see anything wrong with competing with rivals, as long as you're not overly concerned with winning or losing. It's just that I'm a go-anywhere person who is very "self-confident" and doesn't care what others think.

The ninth is "fate thinking," a pattern of thinking that there is no such thing as coincidence and that all events have meaning.
That's not true, most things are luck. You may make good software and not get noticed, or you may make nothing significant and still get noticed. Those things are luck and you can't control them, so don't worry about them.

Number 10 is "positive"...no, this one should be positive...lol
When I read the detailed explanation, it says, "When someone is negative, I want to be positive," which is certainly not the case with me. When someone is negative, I keep my distance so that the negativity is not contagious to me. I guess I don't mind approaching people with strong positivity because it is not contagious.
