Techniques for Delving into Conversation
	kur: [Twitter https://twitter.com/kur/status/1367329572572688387] 
	 >When I teach an interview to someone, I casually say something like "Why5," but I have recently realized that it may actually take quite a bit of technique to dig into the "why" in a dialogue.
		>The other day I was talking with a researcher from overseas and he said, "I heard that Why5 originated in Japan. Japanese are good at digging into conversations, aren't they?" But I feel like that's probably just a Toyota thing, and a lot of people probably aren't.
			[5Why]
	nishio:
		>There are several reasons for this, such as the question "[why]" being an ambiguous question with about four different meanings to begin with, mistaking the question for a reprimand, creating reasons for past behavior after the fact, and many other inconvenient things.
			[4 kinds of why]
	kur:
		>If you ask "why" as it is, it may be misunderstood as a reprimand, or the intent may not be conveyed, so we change the way we ask in various ways, but I think those who cannot do 5-why on that premise have two problems: they do not know what to ask, and they do not know how to ask. I thought.
	nishio:
		>Is my understanding correct that the "person who cannot do the 5why" is "a person who cannot ask others why questions and encourage them to verbalize the why"? If so, it is necessary to be able to "ask appropriate questions about issues that even the client, who should know more about the system than the person asking the question, is unable to verbalize," and people who can do that are rarer....
	kur:
		>Yeah, is it that difficult...? I think it's like asking a question to a teacher or something, you just listen to what they have to say and you don't really know what you're talking about...
	nishio:
		>I was wondering, if people who can't are normal, and people who can ask questions have some attribute, skill, or knowledge that makes them different from normal people, what exactly is that attribute, skill, or knowledge?
  >(I realized that a crude summary of this question would be "Why can people do it?" )
	kur:
		>And if you don't know what it is that you don't understand, you should just ask about it. They are the experts, so there is no shame in not understanding, and you can just ask, "Can you explain that a little more clearly?" If you don't know what it is, you should just ask them.
	nishio: 
		>If Mr. Kiura, who is "someone who can ask questions well," subjectively feels that he only asks questions about what he doesn't understand, and on the other hand there is "someone who can't ask questions well," X, then I think there must be some factor making an action that is easy for Mr. Kiura difficult for Mr. X.
	kur:
	 >I'm sure there's something there, but I'm not quite sure what it is... I wonder...
	nishio:
 	>For example, if you have low self-esteem, are you more likely to feel pain in expressing that you don't understand what you're talking about?
 		[I'm afraid to say, "I don't know."]
	kur:
	 >I think that may be the case. But as far as I've taught, there is no one at all who can't get by with a lot of practice, so I think it's something that can be worked out with practice.
	harajune:
		>It may be that you tried asking but didn't deepen your knowledge, but it doesn't seem like it's a matter of know-how that you can't ask.
  > I think at least a miscellaneous question like "Why is that?" could be thrown, though.
	kur:
		>Maybe we all think we shouldn't ask the wrong questions. I think that as we get used to it, we become numb to it.
		　[No bad questions.]
	nishio:
		>Is it necessary to gain experience like "I asked the wrong question and had no problem" or "I interpreted something differently than I intended but got something unexpectedly good as a result"?
　　　[I get good things I didn't think I'd get].
