tax return 2021
Two weeks had passed, and all I had to do was pull out my Windows machine and card reader to file the forms..." Then I heard a rumor on Facebook that I could file a tax return using an iPad and iPhone, and I suddenly wanted to give it a try. I suddenly wanted to give it a try.
It's a clear indication of a personality that prefers trying new things rather than doing things the way they're supposed to be done.

I've been doing eTax for more than 5 years now, so I have a procedure manual at hand that says, "If you follow this procedure, you'll be almost OK," but as the procedure manual is developed, the personality trait of "[following the procedure manual is painful]" has strongly emerged, lol.
　PS: My wife saw this tweet and bugged me that she's never seen it done easily, but I think there was at least one year when it was done easily, I just don't remember it because I didn't make a fuss when that happened.

Mynaportal AP on iPhone
	[https://gyazo.com/070c9b5f30b9071825ff14b5a95c70ce]
I see. When the QR code displayed on the side of the iPad is read with the iPhone, the app recognizes the destination of the data and displays it. Then when the card is read contactlessly, the result is automatically sent. The screen on the iPad side reloaded automatically when the card was read, you're doing a great job!
	[https://gyazo.com/8d02bb404cccc0a490b846b8aeb8eccb][https://gyazo.com/b2b666cbd6abaa75ed4ee2b029b01d8c]
		By the way, when I logged in, there was a choice of "log in with user number" or "log in with my number card", and I chose "log in with my number card" thinking that I could use my past user data if I chose the number login, but if it was my number card, I would have to re-install it. But the user data was transferred.

The one I just logged in to, maybe it wasn't the one for making an application... I can't find the menu.
　(Probably went into the screen for sending created data)

Search this page for hits
https://www.keisan.nta.go.jp/h27yokuaru/sousasetumei/setumei/tablet/tabriyou.html
	>Please use a personal computer if you wish to file via e-Tax.
	　At this point I could read it via iPhone.
	>The tablet device does not provide a function to save the entered data itself, unlike when using a PC. When interrupting the preparation of tax returns, please do not close the browser, but suspend the work while it is in sleep mode, and when resuming the work, please start the browser again and resume the preparation.
	　Can be saved at this time.
	>The tablet terminal can be used to prepare income tax returns and special income tax returns for recovery. As shown in the table below, you cannot prepare consumption and local consumption tax returns, gift tax returns, or financial statements.
　　This is why blue financial statements could not be made on the iPad (Foreshadowing A).

From the special tax return page, press "Click here to prepare your tax return" in the upper right corner.
	[https://gyazo.com/00f7f952b87f567d188b86fc55ef95af]
	Before you know it, a chatbot has even been created!
	https://www.nta.go.jp/taxes/shiraberu/shinkoku/tokushu/index.htm


	I tried to read this QR code with mynaportal AP and kept getting an error "Please try again", but this is not a QR code for mynaportal AP, the one that appears on the next screen is for mynaportal AP?
		[https://gyazo.com/e54c45785a6760488ed04530b9f00b6c]

I was able to start preparing tax returns, but what about loading historical data...
	[https://gyazo.com/c4a87a9a042b27d4d5ffeb0b14b88c48]
	Oh, I can do "Location:Dropbox" after selecting browse, that's great, I put all my past data in Dropbox. I wonder if I can put the save directly into Dropbox too.
 I was able to get as far as specifying a file, but CC-E90033 data created on a PC cannot be read. I'll try this feature next year.

I thought it would be a hassle to input data on the iPad, but it's not so bad because all I have to do is open the past tax return data on my MacBook, copy it, and paste it on the iPad by using the paste button on the iPad keyboard.

Will you save the written declaration to iCloud?
	[https://gyazo.com/b4f780e2b2a6cb22824d2974c9e8e139]

I had to make a blue tax return first, and once I saved and went back to the top page, it said "Please use the computer if you want to make a consumption tax or gift tax return, income and expenditure statement or blue financial statement"...(Foreshadowing A Recovery)

I thought the withholding tax was 10%, but there is a strange fraction, I thought it was 10.21% due to the increase in the special income tax for reconstruction.

Oh, I don't know if you can get the XML from the payroll and load it. Maybe there was a way to get it, but I don't have it with me right now.

Paystub PDF, password protected, so "uh, what is it?" If you open it in Mac's standard preview, you can change it to a password-free PDF by going to "Export" and selecting "PDF, unencrypted". I'll unlock it for future use.
　[https://gyazo.com/138b4d93213c1b38b0447061305453ab]

I was able to submit my tax return!

Time taken: 5 hours
I was unmotivated and took a nap for 2 hours.
5 free comic books read

I started to get lazy because I thought I was done, but the tax return is the part where you properly clean up after yourself. First, I put my number card back in its proper place. (Is it time to throw away the Basic Resident Registration Card?)

The tabs for printing the submissions were properly downloaded as PDFs when I threw them from my iPad to my MacBook via AirDrop.
I think I can do it on my iPad alone, but I can AirDrop from "Share".

I'm of the school of thought to summarize what I've learned in a public forum, but when it comes to tax returns, it's hard to summarize because I can't post a scruffy picture of the actual tax return and the procedures each person needs to go through are different!
