2020 Unexplored Corporation: Project Generation Growth Process

[*** ver.2]
2023-03-07
[https://gyazo.com/fa412c5f0177327a0585a62f569c12e3]
	Version updated in fall 2022.
	[Sense of Task and Solvable Tasks]

[*** ver.1]
2021-03-10 / 2022-04-26
Figure posted on the [Unexplored Foundation's website https://www.mitou.org/projects/index.html] in the fall of 2020.
	Captioned, "[The process of] project generation growth."
[https://gyazo.com/d12ea2d842f481fe3be629aa962bd23b]
 >MITOH is an "innovation platform" that builds a "pool of high-level IT human resources" including MITOH creators and creates projects to solve social issues. In order to realize the above, we will build a "pool of advanced IT human resources" to create technology-based solutions and a "collaboration hub" to implement solutions by advanced IT human resources in society. From the pool of advanced IT human resources, those with "strong passion" and "appropriate skills" to solve a specific social issue will create a solution (MVP) to solve that social issue and help it become a product or service that will actually be implemented in society.

My draft before the designer's cleanup.
[https://gyazo.com/90ac7cbb2cbcdea8854922d6c5854296]
　I'll try to verbalize what I think is not being communicated in comparison.
　　Repeatedly meet" cycles alone.
　　Repeated meetings" create budding
　　Cycle of budding
　　　The "issues" here are "moderate sized issues" and "clearly verbalized issues."
　　　Such "good assignments" elicit ideas from others who hear them
　　　Talking about an idea inspires me to implement it ([enthusiasm]).
　　　　Related: [Excellent people talk about ideas].
　　　Why is there an arrow from enthusiasm to the task?
　　　　Often a "vague sense of the issues" is brought in from the outside
　　　　For it to become a clearly isolated and verbalized "issue," there must be at least one person who [sympathizes] and is enthusiastic about that sense of issue
　　　　　[self-personalization].
　　When three things come together - a clear problem, an idea for a solution, and people with enthusiasm for the solution - that is the "budding of a project"!
　　At this point, when multiple "enthusiastic people" are involved, collaboration begins.
　　　This is a form of success
　　　Related: [Gathering is the first step, staying together is progress, working together is success].
　　Connecting resources to a project in a way that accelerates it
　　　What the resources are depends on the project.
　　　There's money, of course, but basically [cash is weak capital].
　　　Knowledge often leads to a state of "if you don't have basic knowledge, you don't know how to get advanced knowledge"
　　　　[The strong get stronger and stronger.]
　　First, we create a prototype and experiment with it [PDCA cycle], then we go through the cycle of actually using it in society, and when it is successfully embedded in society, it becomes an "innovation.
　　It's a little odd that "resources" is connected to "projects" at the beginning of "grow" in the original draft diagram.
　　　Often, creators make prototypes quickly with their own hands and then stumble when it comes to social implementation.
　　　[https://gyazo.com/c301f77b301a8539cd6fc4ec2195fd2a]
　　　effect
　　The "collaborative project" rather than just a "project" is our perspective as a "collaboration hub".
　　　Of course, projects can be created even with a single creator, and can lead to innovation through prototyping and social implementation.
　　　However, basically, all "Unexplored Creators" have their own individual projects, and if we support them simply because their projects exist, we may end up supporting all of them. In addition, there are already a variety of options in society to support individuals, including the "Unexplored" project itself.
　　　The role that unexplored foundations should play is still "connection among unexplored human resources". Therefore, it is necessary to focus on new combinations of multiple people.
　　　　Related: [Unexplored as a network formation system].

　Issues I thought about when I wrote this.
　　The new Corona has made it harder to plan a "physical gathering place".
　　There is a wall between "getting to know each other" and "budding," and what should be done about this?

　2022-08-24Reading back and thinking about the issue
　　It is obvious that the inflow is IPA unexplored.
　　　Unexplored juniors not included.
　　　We want to create a place where interesting people can connect without limiting it to the unexplored in the first place.
　　I think "sow" was added by the designer for balance, but you need a seed to sow. Here it is "cultivate.
　　Connecting" resources and projects has disappeared, so the relationship between the two is no longer clear.
　　Innovation creates economic and social value in parallel.
　　[https://gyazo.com/96af12b787375f9227409ebc2976f12a]

relevance
	[How was the "Unexplored Junior" project made?]
