The Rate of Return to the High/Scope Perry Preschool Program
>Abstract
> This paper estimates the rate of return to the High/Scope Perry Preschool Program, an early intervention program targeted toward disadvantaged African-American youth. Estimates of the rate of return to the Perry program are widely cited to support the claim of substantial economic benefits from preschool education programs. Previous studies of the rate of return to this program ignore the compromises that occurred in the randomization protocol. They do not report standard errors. The rates of return estimated in this paper account for these factors. We conduct an extensive analysis of sensitivity to alternative plausible assumptions. Estimated annual social rates of return generally fall between 7-10 percent, with most estimates substantially lower than those previously reported in the literature. However, returns are generally statistically significantly different from zero for both males and females and are above the historical return on equity. Estimated benefit-to-cost ratios support this conclusion.
https://pubmed.ncbi.nlm.nih.gov/21804653/
　A Cost-Effectiveness Study of Interventions for Disadvantaged African American Preschoolers
　Past studies ignore the compromises that occur with randomization.
　 As for the COMPROMISES, here's a better description [src https://www.researchgate.net/publication/265879754_Compromised_Randomization_and_Uncertainty_of_ Treatment_Assignments_in_Social_Experiments_The_Case_of_the_Perry_Preschool_Program]
		In short, he says that it is difficult to properly randomize in social science experiments, and that past studies have calculated intervention effects by assuming that what was not properly randomized was randomized, which is not the correct value.
	Our analysis showed annual rates of return of 7-10%, significantly lower than previously reported.
	However, it is significantly different from 0 (so worth doing)
	The rate of return on equity is higher (so it is more profitable to use the money to intervene with underprivileged African-American preschoolers than to invest it in equity).


https://twitter.com/doctor_nw/status/1370899368421650434
>In early childhood education, there are cognitive skills that indicate academic achievement and non-cognitive skills that indicate perseverance and motivation. Nobel Prize-winning economist J. Heckman has shown that developing non-cognitive skills in childhood leads to social and economic growth as an adult. The lesson is not what you do, but how you develop non-cognitive skills through it. Surprisingly, many parents misunderstand this point.
>These are the references by J.Heckman that provide the basis.
>The Rate of Return to the High/Scope Perry Preschool Program
　Hmmm, I don't think that is the main topic of this paper, at least not to the extent that the authors mention it at all in the abstract...
