Trash collection of information that is not worth the hassle.
>The act of web clipping, the feeling of having done something even though you are not specifically processing any information, is tremendous, and what it brings about is "trashing" the site.
>If it takes a little effort to create a page, and if you accumulate a mountain of information that "[you] don't feel like taking even a little effort," you are not making any progress at all in terms of [intellectual production], and in fact, you are making it harder and harder to make progress.
https://twitter.com/rashita2/status/1371241337148743683?s=21

There is a similar structure to [Efficiently processing tasks will result in a fast fucking application implementation].
　Mechanical web clipping efficiently creates "[isolated pages]" that have no useful connection to other pages.
　The value of the knowledge network will diminish as more and more isolated pages are added efficiently.

Isn't it wrong to mechanically create isolated pages, but not to spend time connecting those isolated pages?
　You can clip "I'm curious about something" and it can be connected after the fact.
　Because it is not always possible to discover good "[connections]" from the beginning.
　But to "discover the connection after the fact" [read back] is necessary.
　　Is it the same point that "it's pointless to collect information that isn't worth reading again?"
　Even if the connection is not discovered at this time, it is better to pay the effort to keep an [open link] to make it easier to discover.

Possibly a chicken and egg
　When people who have some [knowledge network] in their brains pass information through that "net," they "[get] caught."
　　This is the discovery of "connection
　Discovering connections may be difficult for those with underdeveloped knowledge networks
　What to do in such cases?
　　Once you have gathered enough information to make a list, make sticky notes and move them around while making the list, and move the ones that "seem to be related to this one" closer to the sticky notes.
　　Move it and then ask, "What kind of relationship?" Put the relationship into words by thinking about
　　[list, move, and verbalize relationships after the fact].

suggestion
　It's better not to read "quoted and not retweeted retweets" that you don't feel like taking the time to do a single step.
