How to deal with other people's words pre-writing memo
Here's what we organized and talked about: [how to deal with other people's words].

How to deal with other people's words pre-writing memo

Increased exposure can be useful in moving a project forward.
But as exposure increases, so does the probability of encountering someone who reacts in a harmful way. This is inevitable.
So, we need to develop [the ability to go through] adverse reactions.

There are those who support the project and those who hope it fails.

I don't have time to deal with people who "wish people ill."
　Best to put all your energy into your project and succeed!
　>Those who wish others misfortune are annoyed when they are successful. The most ingenious punishment is to make one's success a poison for one's partner.

Time in life is finite.
　>Do not fight what you have nothing to lose. Even if you defeat your opponent, you cannot get back what you have lost.

[paul graham: 人生は短い https://nahareport.blogspot.com/2016/01/paul-graham.html]
	[Life is short.]
　When attacked, the instinct is to defend.
　Sometimes it's wise not to defend.
　off-point argument
　>When someone contradicts you, they are in a sense attacking you. Sometimes they attack you quite overtly. Your instinct when attacked is to try to defend yourself. But like many instincts, this instinct is not designed for the world today. Paradoxically, it is often better not to protect yourself. Otherwise, these people are literally taking your life.

Discussions are only useful with people whose goal is to better realize the project

[Negative feedback]

[Parable of the summer cicadas]
　>Cicadas are noisy in the summer. This is a [natural phenomenon] that is repeated every year.
 > In the same way, when some [output] attracts [attention], people will say [negative] things about it, a natural phenomenon that has been repeated often.
誘蛾灯
　Light-accelerating property
　Some people have the propensity to look at other people's interesting stories and rub them up the wrong way.
　

[counts other people's treasures]

People who slander others have no interesting stories to tell in their own lives, so they spend their limited time in life destroying other people's stories

[君主道徳と奴隷道徳]
　There are people who think about whether it is useful to achieve something
　On the other hand, there are those who believe that those who have power are evil
　　Such people consider those with power to be "evil."
You decide what is useful and what is not in the various comments and advice.
　There is naturally a big difference in understanding the project between you, who has already thought about it for more than 10 hours, and someone who has only heard 10 minutes of a description of the project
　Often the latter person's advice is misguided because they don't understand the project properly.

[Advice sin]

[Expert advice and layman's opinion].
	>The [advice] of a [layman] is [a] peddling of other people's opinions.
	>I haven't gone through the process of actually doing it myself [verification].

There are those who transmit positive feelings of fun, interesting, and awesome, and those who transmit negative feelings of trivial, uninteresting, and unfair.
　The probability of the latter opinion being beneficial is low.
　[三毒]
　[Anger is poison.]

[権力欲求]
　Some people like to keep others under their control.
 [Assumption that adults are superior to children].
　This type appears to be cooperative at first, but starts to get angry when the other party doesn't do what they want.

Don't leave your oar in the hands of something that's happy to see you go.
　宙船

[Parable of the frightened cat]
	People who make offensive remarks are frightened cats.
	[Mounting is born of insecurity.]
	I'm insecure. I'm stronger than you."

[Balthazar Gracián]

[The opposite of love is not hate but indifference.]
