Preparation for Nada 2021 Lecture
[Nada School Saturday Lecture 2021]
[Nada 2021 Reference Materials]

Held on 6/19

I was asked to give a lecture, but I didn't want to make an unnecessary and urgent trip to the Kansai region because of the new Corona situation. I accepted the offer on the condition that I would go online.

We thought about trying a new format, such as [remote speakers can be recorded] or [Unexplored Junior 2021 Boost Conference], but we decided on a "one-on-one Zoom connection and participants can watch in the classroom" format after considering various administrative burdens, etc.

Questions will be asked [slido style]. Since it is not possible for me to have the participants watch the lecture video in advance (since the week before this is the boost conference of Unexplored Junior), I decided to use the style of providing in advance reference materials and intellectual production techniques of engineers to be used in preparing lecture materials.


3/25
	Keicho: [I have accepted a speaking engagement at my alma mater and would like to talk about it].
	Keicho: [It would be good if you could verbalize what exactly you are going to do about the speaking project].
 	Subjects and Courses of Study for the 2025 Common University Entrance Examination
 	 2025~
 		>In response to the new Courses of Study, the subjects that will be implemented in high schools, etc. from April 2022 will be the following seven subjects from the 2025 Common University Entrance Test, which are common to general education, vocational and general education departments: Japanese, geography and history, civics, mathematics, science, foreign languages, and information. The questions will be taken from the required and elective subjects in each subject area.
 	[The parable of the Tayupinko people].
 	[Population pyramid]
	Keicho: [It would be good to have a policy on the content of speeches and to verbalize the content of short speeches].
  [Design for Learning].
  [Nada School Saturday Lecture 2014]
  	Lecture outline at the time of 2014
  		Designing the way we learn - The process of learning begins with noticing blind spots.
   	Lecturer: Yasukazu Nishio (52nd year, Cybozu Labs)
   	What do you associate with the term "how to learn"? A scene with a teacher and students? A process where you have a book of problems, solve them by yourself, and check your answers? In college classes, there is sometimes an exercise called group work. This is an exercise in which students form groups of several people and discuss and create answers to problems among themselves. It is much different from solving a set of problems alone. Also, research is the process of finding an answer that no one else in the world knows yet. It is very different from a problem collection that already has the "right answer".
   　In middle and high school, the problems to be solved and the correct answers have already been determined. In the real world, on the other hand, the problems and correct answers are not yet known. How can we learn in this situation?
   	The author will conduct a 3-day workshop on this theme at Kyoto University Summer Design School this summer. In the Nada School Saturday Lecture, the content of these three days will be compressed into an hour and a half.
   Seven years have passed since then.
 　[The correctness of decision-making] that I wrote about in [The Art of Intellectual Production of Engineers].
 　Is there anything in Scrapbox about [rolling snowballs]?
 　A story where success is easy to observe.
 　　Big opportunities are not rolling in.
 　[Real Options]
 　[decision-making opportunities are a dime a dozen].
 　[cannot be known in advance].
	[I would like to complete the outline of my presentation.]
	[Try Regroup conversion].
	　Regroup: [ver1 https://regroup.netlify.app/#/key=X45uNGnGXyOiTU2jHs4F&cx=7723&cy=1302&top=-203&left=5032]
		Designing the way we learn - Increasing the number of problem-solving options
 	Lecturer: Yasukazu Nishio (52nd year, Director, Cybozu Labs / Unexplored Corporation / Associate Professor, Tokyo Institute of Technology)
 	What do you associate with the term "how to learn"?
 	In the mathematics examinations in which you excel, the curriculum defines options for how to solve problems. You can use the pre-defined problem-solving options to solve the problems that are presented to you.
 	However, the real world does not specify options for solving problems. There are differences in the options people know about. It may seem unfair, but that is reality.
 	Studies have shown that the quality of decision-making is higher when there are three choices than when there are two choices. The number of choices you make will affect the quality of the decisions you make in the future.
 	The author gave a lecture titled "Designing the Way of Learning - The Learning Process Starts with Noticing Blind Spots" at the Nada School Saturday Lecture in 2014. Part of its content was published in 2018 in the form of a book titled "The Intellectual Production of Engineers". This lecture will build on this and delve into the topic of "selection".
 	(Profile) 52 years old, Nada School, entered the Department of Informatics, Kyoto University in 2000, was accepted to an unexplored project in his second year, and skipped the NAIST Master's Program in his third year. D. at the age of 24 after completing the program twice. After a one-year post-doctoral fellowship at the University of Tokyo, he joined Cybozu Labs in 2007. While working as a company employee, he obtained a Master of Technology Management from Tokyo Institute of Technology (2014); he has also served as a board member of Mittoku General Incorporated Association since 2015, and as a specified associate professor at Tokyo Institute of Technology since 2018. He is the author of several books, including "The Technology Behind Coding" and "The Intellectual Production Techniques of Engineers.

[Overwhelming lack of awareness among high school teachers of the demand for IT in the corporate world].
[Intelligence Trap]
[New President Fujii of the University of Tokyo holds inauguration press conference: Entrepreneurship education to increase the number of companies the university is involved in | Education | NHK News https://www3.nhk.or.jp/news/html/20210517/k10013035311000.html]


	[Output "I do/want to"]
	Keicho: [I think "problem-solving options" and "life options" are a little different].
	[How do you know what your options in life are?]

Regroup: [ver2]

after the lecture
　I cloud-recorded it on Zoom and shared it for those who wanted to watch it back and for those who couldn't attend due to some constraints.
　　The start and end of the back and forth operational interaction could be adjusted by specifying the playback range in Zoom.
　　Looks like Zoom alone can do double speed playback.
　Q&A transcribed by [Rimo Voice].
