Sticky note layout of Regroup map generated from Keicho's logs
Part of [✅Generate Regroup Map from Chat Logs

Version 7
[https://gyazo.com/bf7998748c4920a9136d8997643a5173]
I opened up the lines, but it wouldn't make much sense if I didn't open them up more.

Version 5,6
 [✅Make the selected keywords a sticky].
 [✅Briefly sticky some of the questions].

Version 4
[https://gyazo.com/f2fac48d13c67b1048836c51cb3abe71]
Add a sticky note at the first occurrence of keywords that are footnoted in the score

something that comes to mind
　It would be nice if you could select "spawn" from the menu of a sticky that contains sentences longer than a certain length, and it would open a multi-line import dialog with the contents of the sticky.
　So, if we keep data on what kind of division we've done, we can use it for training data.
It's done.
　[✅Multi-line import dialog with sticky click]

Version 3
[https://gyazo.com/24107e766ebdf37aadfe5c0976440b64]
	Changed to [support for splitting long text into stickies
	This is local feature extraction per utterance
	I still prefer this one.
	Over here, features across the entire dialogue are discarded.
	So why not just take out the high scoring keywords from version 2?
	　Version 2 should be "more than twice" but should be footnoted by score, not number of times.

Version 2
[https://gyazo.com/65e5e8e90d80b682c2cc19df3d74eded]
Limited to only those that appeared at least twice.
　Many fragments are too short because they are the result of keyword extraction

Version 1
[https://gyazo.com/684e05233db02bbf59fb1a0b97cac9c7]
It would be better to limit the list to those keywords that appear more than once.
The "full text of responses" on the far right is naturally more detailed, but on the Regroup, you can zoom in and read it, and by ensuring that "worst-case scenario, this is all the information you need," you will not have to worry about losing information, or go back and forth between the chat log and the Regroup to compare them.
[make full text of chat log a sticky].

Version 0 (move from [✅generate Regroup map from chat logs])
　Questions, answers, engraved responses, and high scoring keywords
　　[https://gyazo.com/8d037f331d5b39178d8a727146b3a8fb]
　　At first, I imagined putting in all the keywords, but when I actually tried it, it looked like garbage, so I decided to just put in the ones with the highest scores.
　　　The same thing is not shown repeatedly.
　　Maybe "place," "relationship," and "time."
