It would be good if you could verbalize what exactly you will do about the speaking project.
[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon]It would be good if you could verbalize what exactly you are going to do about the speaking project.
[nisbot.icon]What kind of "speaking project" is that?
[nishio.icon]I give a talk to middle and high school students at my alma mater. I decide what I'm going to talk about, prepare materials for the lecture, speak on the day, and answer questions.
[nisbot.icon]What kind of "do" is that "do"?
[nishio.icon]To be more specific about giving a talk... if I can impart knowledge in the form of a lecture that will be useful to the audience in their future lives, and if the sum total of the value gained by the audience is greater than the value of the life time I lose in preparing for the lecture, the world will be changed for the better. The world will change for the better.
[nisbot.icon]What kind of "talk" is that "talk"?
[nishio.icon]By conveying knowledge that is useful in life, what exactly is that...I wonder. You don't know what is good to convey, and that's why you can't decide on a topic to talk about.
[nisbot.icon]What "role" is that "role"?
[nishio.icon]The effect is to change life in a direction favorable to the individual.
[nisbot.icon]What kind of "life" is that "life"?
[nishio.icon]The audience is basically those who were in the top handful at the junior high school entrance examination stage, and I wonder if it is safe for them to stay with the same behavioral principles after this. For example, the brand value of Tokyo University will remain for a while, but its effectiveness as a signal of competence is declining because the number of young people is decreasing rapidly, and it is unknown how effective it will be when 15-year-olds start working in 10 years.
[nisbot.icon]What do you value?
[nishio.icon] I hope that the information I share will help my audience to think about their future lives and to grasp better choices from multiple perspectives by offering them perspectives that are a little different from their current perspectives or their parents' perspectives.
[nisbot.icon]Anything else about that "life"?
[nishio.icon]Admitting that there is a bias in my point of view, it is still "impossible to program or not". The reason why this is so comes down to the parable of the Tayupinko people. And since they have above-average logical thinking ability, it is not difficult for them to learn programming as a technical skill if they want to do so. The difficulty lies in the question of "what to make. This is not a technique, there is no right answer, and it is an artistic ability of self-confidence.
[nisbot.icon]
 > I hope that the information I share will help my audience think about their future lives and provide them with a perspective that is a little different from their current perspective or their parents' perspective so that they can think from multiple angles and make better choices.
 Where is this "life"?
[nishio.icon]In front of each person, there are multiple forms of paths. Since each person is in a different situation and has different options to choose from, it is impossible to tell them "this is the right path. Therefore, it is necessary to convey wisdom to help each person make a better choice.
[nisbot.icon]
 > I hope that the information I share will help my audience think about their future lives and provide them with a perspective that is a little different from their current perspective or their parents' perspective so that they can think from multiple angles and make better choices.
 How do you know this "life"?
[nishio.icon]Well, I don't know, I'm here now as a result of the choices I made somewhat at different times.
[nisbot.icon]
 > I hope that the information I share will help my audience think about their future lives and provide them with a perspective that is a little different from their current perspective or their parents' perspective so that they can think from multiple angles and make better choices.
 Where is this "life" located?
[nishio.icon]It was a mistake to say that there is a path, which exists only in a hazy and vague way. In most cases, there is only a faint, faint path-like thing in the haze. So we follow what is barely in front of us.
[nisbot.icon]
 > I hope that the information I share will help my audience think about their future lives and provide them with a perspective that is a little different from their current perspective or their parents' perspective so that they can think from multiple angles and make better choices.
 What kind of "audience" is this "audience"?
[nishio.icon]These are people who are groping their way through such haze, while their parents' values and groupthink lead them to overconfidence in certain options, thinking that there must be a path this way or that this path will lead them to the Peach Blossom.
[nisbot.icon]
 > I hope that the information I share will help my audience think about their future lives and provide them with a perspective that is a little different from their current perspective or their parents' perspective so that they can think from multiple angles and make better choices.
 What is this "life" like?
[nishio.icon]I think it's a dangerous mountain road. If you fall off a cliff, you can get hurt; there is no guarantee that the road will be in the same place it was 30 years ago.
[nisbot.icon]
 > I hope that the information I share will help my audience think about their future lives and provide them with a perspective that is a little different from their current perspective or their parents' perspective so that they can think from multiple angles and make better choices.
 What would you like to see happen regarding this "life"?
[nishio.icon]I hope you can be proactive and make your own decisions and choose your own path.
[nisbot.icon]What needs to happen to "life" for that to happen?
[nishio.icon]Hmmm, I guess I need confidence in my own judgment...
[nisbot.icon]As for "life", can it?
[nishio.icon]It may be quite difficult, after all, I look back and see the past, so I have a bias to think that I made the right choice in the past, and I am full of confidence that I made the right choice, but I am not as confident about the future as I was in the past. It may be a cognitive distortion that I have confidence in the future.
[nisbot.icon]
 > I hope that the information I share will help my audience think about their future lives and provide them with a perspective that is a little different from their current perspective or their parents' perspective so that they can think from multiple angles and make better choices.
 Where does this "life" come from?
[nishio.icon]Created by individual choice
[nisbot.icon]
 > I hope that the information I share will help my audience think about their future lives and provide them with a perspective that is a little different from their current perspective or their parents' perspective so that they can think from multiple angles and make better choices.
 Is there anything else you can tell us about this "audience"?

https://keicho.netlify.app/#talk=9C60vYuYLdE2XiVHLnTn
