unconference format
>Do not set a timetable in advance, but make a blank timetable. On the morning of the day, when the participants gather, they fill in the timetable at their own initiative, and then discuss according to that timetable.... It is easy for the timetable to reflect what we want to discuss... It is easy to participate in and motivate discussions
	[Unconference, a flexible and new way of discussion | Koichiro Eto | Ten Minutes TV https://10mtv.jp/pc/content/detail.php?movie_id=2382]

Roughly speaking, there are two ways to go about it.
　A: The person who wants to talk writes what he/she wants to talk about on a post-it and puts it on the time slot of his/her choice.
　B: People who want to talk write what they want to talk about on post-its and put them up. After gathering, the management will gather similar ones to form a session.

A is less burdensome to operate.
　It can be said that the early bird gets the worm and the worm gets the time slot.
 It is implicitly expected that the person who wrote and pasted it will run that session. (You don't want the person who took the slot to say he/she will speak to you to be absent.)
with respect to B
　If there are more speakers than slots, collect ideas and then group them together, so that topics of high interest are narrow and deep and topics of low interest are broad
　The location of the slots is determined by the management, so participants need to be able to attend any time slot (they don't leave and go to the spa).


>In a sense, the process of the unconference is very simple. Those who wish to propose a session write down the session topic they wish to discuss in the available space on the time table. Participants look at the timetable, decide which session they want to attend from the sessions being held in multiple rooms, and go to the room to discuss it. The person who proposed the session theme becomes the chairperson, and the discussion proceeds. That's it.
	>The format does not guarantee the content. The operation is very simple, but to keep the participants' minds excited and to have a fruitful discussion, we must pay attention to the very smallest details. The timetable must also be appropriately organized to balance the number of participants and the number of rooms. The role of the facilitator is also important to promote fruitful discussions. Although it may seem simple and easy to imitate, it is not that simple.
	[Creating Co-Created Innovation: Through the Activities of Nico Nico Gakkai Beta https://www.jstage.jst.go.jp/article/johokanri/59/10/59_666/_html/-char/ja]
	[https://gyazo.com/ea8940e16210df52d3e74b71d644cfa0]


[I'd like to do an IT Unconference! - IT Warfare https://amachang.hatenablog.com/entry/20091014/1255553340]

