講義概要の下書き作成
Maybe you should have written what you wanted to see happen and then done the "Ask First" (because the first line is the title of the conversation list).

[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon]まず聞いて
[nisbot.icon]はい
[nishio.icon]I've been organizing three chats on Regroup right now, and I'll speak here about the words that came to me.
[nisbot.icon]「Regroup」
[nishio.icon]Problem solving in examinations is limited by a curriculum that specifies and limits the solution options. On the other hand, options in life are not so.
[nisbot.icon] "Curriculum."
[nishio.icon]People who have gone through different paths become a partner who can teach each other.
[nisbot.icon]「相手」
[nishio.icon]Even if there is a choice, if you don't recognize it as a choice, it's as if it isn't there, be careful not to ignore it unconsciously
[nisbot.icon]「選択肢」
[nishio.icon]I don't recommend any particular option. Each person's current situation is different. It is dishonest to promote one option without knowing more about the current situation.
[nisbot.icon]「選択肢」
[nishio.icon]Life is created by individual choices.
[nisbot.icon]「人」
[nishio.icon]When walking on a mountain trail, you have to watch your step carefully. just because a path is on a map drawn 30 years ago does not mean that it is still a safe path today.
[nisbot.icon]「道」
[nishio.icon]Two options are better than one, three options are better than two
[nisbot.icon]「選択肢」
[nishio.icon]おしまい
[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon]I wrote down what I thought for now.
[nisbot.icon]
 > Two choices are better than one, three choices are better than two
 What is this "option"?
[nishio.icon]人生の選択肢とか、意思決定の選択肢
[nisbot.icon]Anything else about that "option"?
The choices are not as explicit as in the [nishio.icon] exam.
[nisbot.icon]What do you value?
[nishio.icon]For now, I'd like to complete the lecture outline for today.
[nisbot.icon]
 > Options are not as explicit as in the examination
 Where is this "choice"?
[nishio.icon]That's the important part, one way is to get it from people on a different path than you, but it's not clear yet.
[nisbot.icon]
 > Options are not as explicit as in the examination
 How do you know what these "options" are?
[nishio.icon]When it comes to studying for an exam, the means used to solve problems are limited to the scope specified in the curriculum. It can be said that we solve problems by choosing from a limited set of explicitly stated options. On the other hand, in real-world problem solving, the choices are often not explicitly stated in advance.
[nisbot.icon]Where does that "choice" come from?
[nishio.icon]I see. [The choices are being created anew every day]. That's why it's impossible to specify all the options in advance.
[nisbot.icon]Where is that "choice"?

https://keicho.netlify.app/#talk=ksgQD3WDdlzSsfl1Qw0i
