In-house recruitment of directors
[Cybozu elects 17 self-appointed directors, including first-year new graduates No change in working hours or job description | Caricone News https://news.careerconnection.jp/?p=114200]

[Yoshihisa Aono/aono@cybozu https://twitter.com/aono/status/1376540043725074438]
>Because the response from outside the company to Cybozu's decision to recruit internally for the board of directors has been greater than expected, I have summarized the background in a NOTE.
	[Thus, directors were recruited from within the company.]

[Kentaro Sakamoto, Overseas SaaS Cybozu https://twitter.com/kentaro_sakamo/status/1376096660535660547]
>Here's some background on this internal call for board members and the 17 that were approved~.
	[Isn't "All directors are directors even though the company is listed on the first section of the Tokyo Stock Exchange" indeed absurd?　I asked the vice president a question | Cybozu Style https://cybozushiki.cybozu.co.jp/articles/m005935.html]
	>Please refer to this area as well!
	["Men and women are one of the labels" Cybozu's Aono's diversity theory：The Asahi Shimbun Digital https://www.asahi.com/articles/ASP3X5GBTP3XULZU008.html]

[Shuichiro Fukazawa @cybozu https://twitter.com/syu_fukasawa/status/1376522426805198849]
> What Cybozu wants to do is to prove that with thorough information sharing using groupware, corporate governance can be effective even without the function of directors.
> 
> And we are working on it because we believe it will make us more productive and our employees happier.

[Consider the response to Cybozu's "internal recruitment of board members"｜Community for Management in the Age of Remote Work｜note https://note.com/teamwork/n/n058466ac4eb6]
 A good organization. He pointed out that the word "director" in the world often means one of the following two things, but not for Cybozu's publicly recruited directors.
 >① Directors as experts in management skills
 >2) Directors as Elders in the Internal Order

Concerns about decision-making delays and bias due to more directors
　In this regard, Cybozu's culture is not "let's quit because it's risky," but "[if you try it and problems become apparent, you can quit]", so they seem to think that they can just quit if there are any problems.
　　Related: [manager discontinuance].
　Personally, I'm of the school of thought that it's a great buzz in the world, but it's not the type of experiment that can do much damage to a business, so it's low risk and why not give it a try?
　　The benefits are not so clear-cut, either.
