Listening Chat System Conversation Log
Conversation log in [Kikidashi Chat System
	I want to find patterns that generate ideas.
	We think that by placing records ([chat logs]) of new [moments of idea generation] in [Scrapbox], a [pattern discovery support system], unknown and useful [patterns] may be discovered.

from [sample of how to use kikidashi chat].
　I had packed everything on this page, both good and bad, but then there would have been too much information to be useful for "seeing how a new user uses it", so I separated them.


CUI version
	[2015 conversation log].

Mattermost version
	[Use Case:Importance of Grouping] 2019-07-08
		I was wondering how to explain the importance of grouping, so I consulted a chatbot on the train ride home and realized that the value of grouping is created by grouping, and that the world will be convinced of the value of grouping after the fact because of the value that is created.
	[Conversation log: about state transitions] 2019-07-20 I'm on a train ride going somewhere unfamiliar, so I can't do any focused work, so I'd like to discuss design issues.
	[conversation log 2019-07-27] I've made a number of corrections and would like to test them.
	[conversation about designing endings] 2019-07-29 I'd like to think about how best to design endings to conversations
	[how to proceed after "I see"] 2019-07-29 I need clarification on how to proceed after a user enters "I see".
	[conversation log 2020-06-05] I've implemented the ability to split long sentences for Regroup, and I think this would be beneficial to work with this chat system so we can talk and get our heads together.
	[Conversation log 2020-06-07]
		[Conversation Log 2020-06-07-1] I need a solution to the problem that when I come up with improvements to a project that has been in development for a while, I can't decide what to do next, so the project is left unprogressed, and it accumulates and becomes uncollectible.
		[Conversation Log 2020-06-07-2] When ideas diverge and become confused, can you help them pick up the pieces? If so, I would like to know how to do that.
		[I would like you to decide what my next action should be.
		[Conversation Log 2020-06-07-4] I wonder if we can make the conversation with this bot itself a content.
	[Conversation Log 2020-06-08] What exactly is the chewing task?
	[Conversation Log 2020-06-08-2] Today we're going to experiment to see what happens when you read a book while interacting with a bot.
	[Mattermost Version Listening Chat System]

WebUI version
	[Conversation log 20210120].
		We'll sort it out as we talk about what we're going to do next."
		Not so good for the purpose of deciding which one to choose when there are many tasks (to try to dig into one).
		You could also create a set of questions to organize tasks.
	[Conversation log 20210121].
		I'd like to get organized for what I'm going to talk about at tomorrow's in-house study session. Also, I'm talking on my phone while I'm taking this walk, so it's also a demonstration of how to use it."
		Long, mixed pattern of multiple topics from the beginning.
	[I'd like to talk and sort out whether to write an explanation at this point or implement the new feature first].
		I'd like to talk and sort it out because at this point I'm trying to decide whether to write an explanation or implement a feedback button first."
		I was able to get out of my assumptions.
	[I don't want to put my data in a repository, but I want to sort out what to do with it.]
		'I don't want to put the training data for machine learning in a repository to deploy on a server, what would be the best way to do that, I need to organize it'
		I am aware of the existence of unnecessary fear.
	[Consider the following explanations of new features].
	　A new command called the UPKW command was created today, and I'll consider explaining it."
	　Realize that the explanations were biased toward the perspective of the creator of the function and lacked the "what makes you happy" from the user's perspective.
	[Conversation log 2021-01-28] Imaich: "I've reverted to machine learning to determine the naturalness of questions, which I had temporarily turned off, and I'd like to test that."
	[conversation log 2021-01-30].
	　I tried using it with voice input because some people said it might be better if it could be used with voice. Not so good
	　After switching to text input, I realized that "using voice" and "using voice input" are two different things.
	[conversation log 2021-01-31].
		When I asked for advice on how to write a test, I was asked where the test was located, and when I tried to answer that it was the same as an existing test, I realized that it didn't have to be the same.
	Forced to use [to organize tasks].
		I was told that the listening chat system is not suitable for organizing tasks when there are multiple tasks because it digs into a single task, so I tried a crazy experiment: if that's the case, why not open a chat for each task?
  →Conclusion: Objective achieved
	2021-02-08
		[Resume previous conversation].
		[story about the introduction of Sentry].
	2021-02-10
		[I was talking about how active learning doesn't work, and I concluded that I should read a book.]
　[Talk about being able to "add to home screen"].
　[beauty of the program].
　Should I use object orientation or something to clean up my program?" I answered this question while conversing with the chatbot.
　["Would like to, but haven't started."]
	[I'd like to discuss a bug that caused a mysterious log break.]
 　I had a bug that I didn't understand, so I asked for help with a problem.
 　The initially perceived "log breakdown" turned out to be an incorrect perception of the phenomenon.
