I've realized that meaning is not a set, and I'd like to discuss if this has any practical application.
2021-03-31
[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon][meaning is not a set], I had a realization, and I would like to discuss if this has any practical application.
[nisbot.icon]What "application" is that "application"?
[nishio.icon]For example, chatbots will be able to do things they couldn't do before.
[nisbot.icon]What kind of "chatbot" is that "chatbot"?
[nishio.icon]Understanding human speech.
[nisbot.icon]What kind of "understand" is that "understand"?
[nishio.icon]We can understand the meaning of what humans are saying. We don't yet know what it means to understand the meaning, but there is progress in the processing that deals with meaning.
[nisbot.icon]What "story" is that "story"?
[nishio.icon]I wonder, that remains to be seen. Maybe it's a dialogue like we're having here, maybe it's not.
[nisbot.icon]Anything else about that "story"?
[nishio.icon]No. And when a meaning is a point, there is similarity between the meanings, but no inclusion. When a meaning is a set, there is an inclusion. There can be intersection. When a meaning is a Gaussian, the probability of inclusion is required.
[nisbot.icon]What do you value?
[nishio.icon]Hopefully there will be some useful application.
[nisbot.icon]Anything else about its "application"?
[nishio.icon]That's what I'm looking for.
[nisbot.icon]
 > I wonder, that remains to be seen. Maybe it's the kind of dialogue we're having here, maybe it's not.
 Where is this "story"?
[nishio.icon]Between human and computer.
[nisbot.icon]
 > I wonder, that remains to be seen. Maybe it's the kind of dialogue we're having here, maybe it's not.
 Where is this "story"?
[nishio.icon]It's like using digital communication and flowing in text format.
[nisbot.icon]
 > I wonder, that remains to be seen. Maybe it's the kind of dialogue we're having here, maybe it's not.
 How do you know this "story"?
[nishio.icon]I don't know.
[nisbot.icon]What kind of "understand" is that "understand"?
[nishio.icon]If you find something better, we'll know.
[nisbot.icon]Anything else about that "I know"?
[nishio.icon]I want to understand.
[nisbot.icon]
 > Hopefully there will be some useful application.
 Where is this "application"?
[nishio.icon]That's what I'm looking for.
[nisbot.icon]
 > Hopefully there will be some useful application.
 What does this "application" look like?
[nishio.icon]Hmmm, it's the next step on the staircase, and when you can do that, you can reach even higher.
[nisbot.icon]
 > I wonder, that remains to be seen. Maybe it's the kind of dialogue we're having here, maybe it's not.
 What do you hope will happen regarding this "story"?
[nishio.icon]For example, regarding the story we are doing here, it would be nice if the questions were more appropriate. For example, if we understand that the user is talking about an event, the question "What happens next? question is appropriate.
[nisbot.icon]Where does this "story" come from?
[nishio.icon]If the computer asks the right questions, it will pull from the human.
[nisbot.icon]What kind of "human" is that "human"?
[nishio.icon]Wait a minute, so it's a question of inclusion of whether a user's statement is "a suitable statement to do a certain question"?
[nisbot.icon]What kind of "user" is that "user"?
[nishio.icon]There are two problems. The first is whether the keywords are appropriate for a question like "Where is it?" and whether the entire statement is appropriate for a question like "What happens next? and whether the entire statement is appropriate for a question like "What happens next?
[nisbot.icon]What kind of "question" is that "question"?
[nishio.icon]There are two types of keywords: one that fits keywords into the template, and one that does not take keywords.
[nisbot.icon]What "keywords" are those "keywords"?
[nishio.icon]Demoko
[nisbot.icon]What kind of "demoko" is that "demoko"?
[nishio.icon] But I wanted to write that keywords can also be multiple words, so the whole sentence should be interpreted as a keyword.
[nisbot.icon]Anything else about that "keyword"?
[nishio.icon] In other words, it is good to know the inclusion relationship between keywords, and the inclusion relationship is not a general one, but a binary classification of whether it is appropriate for a particular question
[nisbot.icon]Where are those "keywords"?
[nishio.icon]The keywords are extracted from the text and processed, but this is just a kind of attention, because the weight of zero and one is multiplied by one for each successive section.
[nisbot.icon]Where is that "keyword"?
[nishio.icon]In a sentence, it's basically a chunk. If you make it an attention, it could be scattered, so it's harder to fit it into a template.
[nisbot.icon]What kind of "attention" is that "attention"?
[nishio.icon]Weighting for a given input sequence
[nisbot.icon]What kind of "mi" is that "mi"?
[nishio.icon]NGKW Mi
[nisbot.icon]What "weight" is that "weight"?
[nishio.icon]Values that make the area of interest larger
[nisbot.icon]
 > > The keywords are extracted from the text and processed, but this is just a kind of attention, because the weight of zero or one is multiplied by one for each successive interval.
 Where do these "keywords" come from?
[nishio.icon]Now there's conventional keyword extraction and extraction limited to verbs.
[nisbot.icon]How do you know its "keywords"?

https://keicho.netlify.app/#talk=KeOBn7Dr4GJqBUtLnwNS
