The difference between vice and evil
[Twitter https://twitter.com/kazuho/status/1375693541758758917]
	> tokoroten: running a company (without scaling up) is a "vice" depending on your point of view.
	Considering that the majority of people in quicksand do not create jobs, but only consume, it would make the majority of people "more evil" if we label those who create at least a few jobs as "evil".
	>kazuho: I think vice and evil have slightly different meanings
	What's the difference?
	>When you say vice, don't you often mean about as good as not good?
	What's the difference between "not good" and "evil?" (I'm not trying to stir the pot, I simply don't know what you're talking about.)
	>Do you know the difference between asocial and antisocial?　When I say vice, I mean that it tends to be used in the former sense as well.
	Do you mean the difference between intentional and unintentional negative impact on society?
		[Asocial behavior - Wikipedia https://ja.wikipedia.org/wiki/%E9%9D%9E%E7%A4%BE%E4%BC%9A%E7%9A%84%E8%A1%8C%E5%8B%95]
			>Nonsocial behavior is unintentional deviation from one's own social position that negatively affects those around him or her.
	>~ I think adding the word "action" would make it a willingness or unwillingness, but I think a better explanation would be that the assumption that basically everything can be categorized as either good or bad does not necessarily hold true in natural language.
	This explanation is extraordinarily confusing. I am not talking about good, nor am I claiming that everything can be classified as either good or evil. Therefore, I do not know why you have come up with this.
 I wonder why you cut off that branch when it was easier to talk about the presence or absence of intent.
 To clarify a bit more about the "intentionality" that was easy for me to understand, I was saying that "if it is bad for society regardless of intentionality, it is bad", while Kazuho seemed to be arguing that "intentionality is bad, unintentionality is vice, and this case is not bad because it is vice", I see.
 >When we use the word "vice" in one character, it often refers to something bad, and I believe that was the case with Mr. Nishio's usage. In contrast, when we say vice, we are talking about cases in which the nuance of bad is not always present. For example, the word "aversion" does not have the same meaning as the word "bad" (*A).
	Hmmm... I think vice is bad and aversion is also bad because it is "when a person receives some input and feels that the input is bad," but at any rate, I understand that Kazuho has limited the meaning of "bad" to a much narrower range than I have. (*B)
	>Usually, without such an explanation, we would understand the character for evil to have multiple meanings, with different meanings depending on the idiom, such as abhorrent (loathsome), ugly (evil-looking), and so on.
	I am not interested in which is more "normal". What is interesting is that Kazuho splits the meaning of "evil" and explains it with "ugly". To me, it seems more natural to explain "ugly" with "evil", as in "ugly" is "bad looking".
		>kuboon: there seems to be a gap between nishio's idea of "evil" and kazuho's idea of "evil"!
  > kazuho's "vice" ≈ nishio's "evil" <<<< kazuho's "evil"
		The meaning of the inequality is ambiguous!
		Here is a diagram of what I wanted to say in (*B)
			[https://gyazo.com/2c6a86956bebdbff95375ee6b59e6426]
		>kazuho: putting aside whether it is common to think that "evil" in a predicate with evil has the meaning of "bad", I understand well that this is so as Nishio's usage. Thank you.
		I may have misled you with the diagram, but I am not claiming that "all idioms containing the character for 'evil' mean 'bad'". It is an assertion that some of the idioms that Kazuho claimed "mean something different from evil" seem to mean "bad" to me.
		>I think the difference is that Nishio-san thinks that kanji or words have a single meaning, while I think that the meaning changes depending on the context. For example, I think that "good and evil" and "good and evil" have different meanings. Do they seem the same to you, Nishio-san?
			I didn't notice this post and went back to the other branch.
	>I'm just giving the explanation that is commonly given in dictionaries. I looked at the lexicon at hand and it is actually structured that way!
	Back to vice, what is the definition of "vice" in that dictionary? I'm curious to know what the definition is, if it is defined without using the word "vice."
	>I checked, and it quoted "爵罔及悪徳惟其賢" from the Book of Changes as "ashiki kodo" (あしき行為). I don't have a definition of "bad act" because this is a Chinese character dictionary. I mean, I don't think it's an act, because this one in Shokei is about "don't give a knighthood to someone with low morals, give it to someone with high morals..."... cf.[国学名句 "官不及私昵,惟其能; 爵罔及恶德,惟其贤 "出处和解释 - 可可诗词网 https://www.kekeshici.com/mingyanmingju/guoxuejuian/130365.html]
	Would you argue that "'ashiki' does not mean 'bad'"?
	> No, I would not say that. I think this dictionary example rather reinforces the original assertion that "vice" is a polysemous word ref. (*A)
	What does it mean other than "bad behavior?" >Polysemous
	>The original word seems to have originated in the Shoki Sutra, as quoted here, but since it means something like "vile in character" in the first place, it is reasonable to assume that the meaning of "bad behavior" is a diversion.
	I see. Kazuho, since you divide the meaning more finely than I do, you see it as "the meaning is changing," while I, who see it in a broader sense, see it as "both meanings are bad.
	>I guess it's something like that. If you are arguing that the meaning of the character for evil is bad, I think we can agree (since bad is a superordinate word). Incidentally, when I looked up "evil" in the Japanese-English dictionary at hand, I came up with evil (wicked); wrong (dishonest); vice (vice). In other words, I think it means that we often choose from words with such detailed meanings depending on the context.
	>I read your word "evil" as "evil", but I think you used it in the sense of "bad", and I think that's where we had a misunderstanding.
	We have reached a common understanding, congratulations!

---
	I missed this tweet, I knew Twitter was not a good place for discussion.
		>I think the difference is that Nishio-san thinks that kanji or words have a single meaning, while I think that the meaning changes depending on the context. For example, I think that "good and evil" and "good and evil" have different meanings. Do they seem the same to you, Nishio-san?
	It seems that "evil of good and evil" (evil) is encompassed by "evil of good and evil" (bad), and that my side was exclusively using the words "evil" and "bad" in the sense of "evil of good and evil" rather than "evil of good and evil".
	If companies that don't expand employment are bad compared to companies that do, doesn't that mean that the majority of the world's job consumers are even worse off?
	I see the pattern that "same or different" was a false dichotomy [related question].
	This is more specious
	 [Two nested concepts in what we thought was one concept].
 Close, but not equal to this case.
 Here's what I mean [both "being X" and "not being X" are compatible].
