Both "is X" and "is not X" are compatible.
2021-10-22
[https://gyazo.com/311050f8ce33a5223b29476669f9a595]

---
[https://gyazo.com/422753c130224e327d8bf5044ded2c07]
The phenomenon that occurred in [the difference between vice and evil].
　What was referred to by the same word X was actually two nested concepts.
　Thereby, a person looking at a narrow X thinks "A is not X", while a person looking at a broad X thinks "A is X".

	This is related to: [relationship question].
	 It's pretty abstract, though.
		>Are X and Y the same thing? Are they different?
  >seems neutral [false dichotomy].
  >[I'm ruling out the possibility of [inclusions] or [overlaps].
			Cut out [same? Different? is a false dichotomy] ([line link is an opportunity to cut out])
	[Two nested concepts in what we thought was one concept].
		This is more specious
		Close, but not equal to this case.
		　This is one person's case study
		[* [https://gyazo.com/c5f266bd20c8e7dacc7eb6fe908796b6]]
　　　I think this is essential.
　　　I think it is wrong to take meaning as a set in the first place.
　　　People recognize the meaning of a word by the representative case in their brain and the similarity to it.
　　　If we determine an appropriate threshold for that similarity, we can create a set, but we do not clearly recognize the threshold.
　　　Therefore, it becomes a "set with blurred boundaries" as shown in the above figure.
　　　The phenomenon of "the concept of X is a nested set" as in this case is simply a difference in threshold values
　　　By comparing meanings among the aptitudes, the difference in thresholds can finally be visualized.
　　　(2023-02-04)
　　　[Meaning not a set]
　　　Meaning not a set with clear boundaries, but [blurred circle] with [blurred boundaries].
　　　An extension of this is the "[non-numerical character] of meaning" as explained in [Study Group 2#61fb7718aff09e00004a7667 on "The Experience Process and the Creation of Meaning"].
			[meaning a vector], but it's just a dot by itself.
			　The operation "A is X" becomes an exact match only.
			　Rather, some representative vectors in the brain and the similarity to them
			　Determining a threshold for this similarity results in a set
			　(2023-02-04) But humans don't have a clear threshold, and they set boundaries somehow.
			　It's like a [self-organizing map] where representative vectors take up space and create boundaries.
			　　We haven't even determined the degree of similarity.
			Ha, Wittgenstein's [familial resemblance] that meaning is not clearly defined as a set but as a group connected by similarity!
				>Ludwig Wittgenstein, in his book "Philosophical Investigations," took the word "game" (German: Spiel) and pointed out that there is no common implication (significance) that characterizes all the extensions (objects) called "games," and that in fact they are only loosely connected as a whole by partially common features such as "winning or losing" and "entertainment value. He pointed out that in reality, the whole is only loosely connected by partially common characteristics, such as "the winning and losing of games" and "entertainment value," and called this a familial resemblance. This idea, together with [prototype theory], is the antithesis of the classical view of categories, which attempts to define words in terms of necessary and sufficient conditions.
				[Familial resemblance - Wikipedia https://ja.wikipedia.org/wiki/%E5%AE%B6%E6%97%8F%E7%9A%84%E9%A1%9E%E4%BC%BC]
				>The idea is that the categories people actually have are not classical categories defined by necessary and sufficient conditions, but are characterized by typical cases and their similarity to them.... For example, the word "bird" evokes small flying animals such as crows and sparrows, while ostriches and penguins are out of the typical case.
				[Prototype theory - Wikipedia https://ja.wikipedia.org/wiki/%E3%83%97%E3%83%AD%E3%83%88%E3%82%BF%E3%82%A4%E3%83%97%E7%90%86%E8%AB%96]
	[I have realized that meaning is not a set, and would like to discuss if this has any practical application].

[Venn diagram]
[narrow and broad]
[blind spot card] 31
