I would like to come up with an explanation of the ability to create a map of Regroup from chat logs.
This feature: [✅Generate Regroup Map from Chat Logs].
 At first, he used the totally unintelligible expression "make a map of Regroup".
 　Expressions that came up in the story
 　　Infinitely wide whiteboard board (Regroup)
　Sticky notes" won't get the message across either.
　　Chat logs are lazy, long, and not reusable. Chop it down to a reasonable length, cut away the shallow parts of meaning, and create parts with concentrated meaning. That is the sticky note.
 The realization that chat is between a person and a whiteboard (Regroup).
 　[https://gyazo.com/91889ac39cebf6893b8355b6d450a3bf]
　　I was writing the diagram at hand before this chat, like BEFORE, no user
　At first I was just thinking about this feature and how to write a description
　　Instead, this feature should be placed in the flow of explaining how to use it as a "support tool for people who are not good at writing".
　　Regroup's explanations are lacking, I've always thought that we need explanations with specific use cases.
　　Instead of trying to explain in words, it is necessary to let people experience it first, like a game tutorial.
 Organize stickies actually made with this function
 　[Regroup: I would like to come up with an explanation of the ability to create a map of a Regroup from chat logs].
　　The story starts with "Some people are not good at writing. But sometimes they just haven't been taught how to make sentences properly. First, you make parts with short sentences, and then you assemble them to make longer sentences. Those of us who are good at writing can just do it in our heads." It seems like a good idea to become a
　　And after that, we will talk about how to make specific parts and how to assemble them.
　　This time, the feature allows for one-click parts after talking to the chatbot.
	This is the functionality we have implemented this time
	　[https://gyazo.com/04c0720b60f1fdc8615243b434819b62]
　Again, "What is the function of this feature?"
　　[the ability to automatically create parts for sentence structure based on conversations with chatbots].

[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon] I'd like to come up with an explanation for the new functionality to create a one-click map of Regroup from chat logs.
[nisbot.icon]What kind of "chat log" is that "chat log"?
[nishio.icon]Text data accumulated by having a conversation like this in this chat
[nisbot.icon]What kind of "chat" is that "chat"?
[nishio.icon]The computer asks questions and humans answer them, so you can catch up in conversation, or as in tennis, you can hit a wall.
[nisbot.icon]What kind of "conversation" is that "conversation"?
[Instead of trying to write a commentary from scratch, declare "this is what I want to write about" and then just go with the flow.
[nisbot.icon]What "place" is that "place"?
[nishio.icon]"A place where there is nothing. People who are not good at writing often groan and groan in front of a blank piece of paper, but in my opinion, it is because their teachers have not taught them how to compose sentences properly. The basic premise is to first make the parts and then reassemble them to create a flow, and those who are good at spinning sentences are able to do this in their brains. You make the parts first in order to make sentences.
[nisbot.icon]Anything else about that "place"?
[nishio.icon]With paper-based instruction, you write on post-its and then rearrange them, but Regroup allows you to do this electronically instead of using physical post-its.
[nisbot.icon]What kind of "Regroup" is that "Regroup"?
[nishio.icon]This tool is an electronic solution to the inconvenience of the KJ method using stickies. Unlike paper, you can zoom in and out, or make important stickies into large stickies.
[nisbot.icon]What do you value?
[nishio.icon]Creating stickies and rearranging them to form sentences is a methodology that I have used many times in books and lectures and has proven its value to me. Now that I can create stickies with a single click from the logs of the listening chat system, the preparation of stickies has become much easier. The process of intellectual production is digitized and assisted by machines, which reduces the amount of time wasted in intellectual production. Intellectual productivity increases.
[nisbot.icon]Anything else about that "chat"?
[nishio.icon]Some people who are not good at verbalization have difficulty in writing long sentences in complete sentences, or they can talk with others but are not good at verbalization by themselves. The process of writing it down in a chat room first and then organizing it is a good way to help them verbalize.
[nisbot.icon]Where is that "chat"?
[nishio.icon]So a chatbot that can be that kind of wallflower is in your smartphone, and you can talk to it whenever and wherever it's convenient for you.
[nisbot.icon]What does that "chat" look like?
[nishio.icon]You're a talker who's dedicated to listening. When you are a [flesh-and-blood] person, the other person may have something to say that they want you to hear, and if you have to listen to them when you want to organize your thoughts, your brain will overflow. In situations where you want to organize your brain by talking, a chatbot that does not start talking about itself and instead focuses on listening is more beneficial than a human being.
[nisbot.icon]What do you hope will happen regarding that "chat"?
In [nishio.icon]chat by itself, it is good if we can notice things in the course of conversation like this. However, with this feature, even if you don't get any insights in the chat, you can simply talk about what you think would be good to write in the manuscript in the chat, and then reorganize it with stickies, so you can simply talk about various things on the chat side. It would be nice to have all the parts for the manuscript, but there is no support function for that, and since it is not clear what kind of manuscript is to be written, it is not clear what is needed either, so it is a chicken-and-egg relationship.
[nisbot.icon]Where is that "chat" located?
[nishio.icon]In terms of this functionality, I imagine that it is between the human and the Regroup, and that it interacts with the Regroup to draw out the stickies, which are then placed on the Regroup and returned to the human.
[nisbot.icon]
 > With chat by itself, it would be good if we can notice things in the course of conversation like this. But with this feature, even if you don't get any insights in the chat, you can simply talk about what you think would be good to write in the manuscript in the chat, and then reorganize it with stickies, so you can simply talk about various things on the chat side. It would be nice to have all the parts for the manuscript, but there is no support function for that, and since it is not clear what kind of manuscript is to be written, it is not clear what is needed either, so it is a chicken-and-egg relationship.
 How do you know about this "chat"?
[nishio.icon]I'm the author and I use it a lot, so I know it, but how to get users who have not used it yet to understand it is a challenge.
[nisbot.icon]
 > With chat by itself, it would be good if we can notice things in the course of conversation like this. But with this feature, even if you don't get any insights in the chat, you can simply talk about what you think would be good to write in the manuscript in the chat, and then reorganize it with stickies, so you can simply talk about various things on the chat side. It would be nice to have all the parts for the manuscript, but there is no support function for that, and since it is not clear what kind of manuscript is to be written, it is not clear what is needed either, so it is a chicken-and-egg relationship.
 Where does this "chat" come from?
[nishio.icon]I wonder if people who happen to know about this chat and use it on social networking sites will experience exporting to Regroup, but I doubt it. Therefore, I think it would be better to say that it is a support tool for people who are not good at writing, and explain the process of chatting and talking first, and then organizing in Regroup in the guide.
[nisbot.icon]Anything else about that "Regroup"?
[nishio.icon]The explanation is not made as well as the listening chat. It seems that users cannot use it if it is given to them without explanation. The explanations are vague because it is a tool that can be used for multiple purposes. It might be better to make it more like a tutorial to support writing.
[nisbot.icon]
 > In the case of this functionality, I imagine that it is between a human and the Regroup, and that it interacts with the Regroup to draw out the information, and then places it on a sticky note and returns it to the Regroup.
 What kind of "sticky note" is this "sticky note"?
[nishio.icon]Chat sentences are chopped to a reasonable length or keywords are extracted.
[nisbot.icon]What kind of "text" is that "text"?
[nishio.icon]Chat text is often long and rambling, and not very reusable as it is. Therefore, we chop them down to a reasonable length and remove the parts with shallow meanings to create parts with concentrated meanings. That is a sticky note.
[nisbot.icon]Anything else about that "sticky"?
[nishio.icon]Componentized from the original text so you can move it around and think about it.
[nisbot.icon]Anything else about that "text"?
[nishio.icon]Chat sentences are shorter than the final sentences we create, but first we need to create parts that are smaller units than the even shorter sentences!
[nisbot.icon]Where is that "text"?
[nishio.icon]Long sentences are only after the parts are assembled. Short sentences have the original idea in the human and are pulled out by the chatbot's questions.
[nisbot.icon]Where does that "text" come from?
[nishio.icon]I imagine that there is something like a lake in human beings that has not yet been verbalized, and when you drop a hook into it, the text is caught and you are fished out.
[nisbot.icon]Where is that "text"?
After being pulled out [nishio.icon], it is in front of you as text data. So you can look at it and think about it further, or do natural language processing electronically.
[nisbot.icon]
 > Chat text is often lazy and long, and not reusable if left as is. So, we chop it down to a reasonable length and remove the shallow parts of the meaning to create parts with concentrated meaning. That is a sticky note.
 Where is this "sticky note"?
[nishio.icon]On Regroup's infinitely wide whiteboard.
[nisbot.icon]How do you know its "Regroup"?
[nishio.icon]Again, I know this well because I am the author, but the challenge is how to let users know about it.
[nisbot.icon]
 > Chat text is often lazy and long, and not reusable if left as is. So, we chop it down to a reasonable length and remove the shallow parts of the meaning to create parts with concentrated meaning. That is a sticky note.
 What do these "stickies" look like?
[nishio.icon]For people who are used to moving and composing stickies, "this digital data is like a sticky note" will get the point across, but for those who aren't, what would you compare it to? Hmmm, if they haven't had a similar experience, they won't understand the analogy, so maybe it's better to have them experience it first by saying, "First, let's try to operate it this way. It's like teaching game controls by metaphor or by actually playing the tutorial.
[nisbot.icon]How do you know its a "sticky"?
[nishio.icon]I myself need to know better what stickies are? To explain it well for users to know?
[nisbot.icon]Where do those "stickies" come from?
[nishio.icon]With the conventional paper-based method, a human had to create the stickies, so at that stage, there was the chicken-and-egg problem of "I need to make the parts with the right granularity to make it easy for later work," and "But I don't know what to do later," but this time I implemented that part and automated it. I implemented and automated that part this time, so the user can start from the state where stickies are created.
[nisbot.icon]What do you hope will happen regarding that "sticky"?
[nishio.icon]It would be good if users can understand the process of creating a gradual story by moving stickies.
[nisbot.icon]Where is that "sticky" located?

https://keicho.netlify.app/#talk=72bK8MugmqvAnbWIDG87