Tutorial for making 🤔 sentences
from [🤔Make 3 explanations of how to use Regroup in specific applications].
Maybe a tutorial on making sentences would be a good idea.
 Examples of using Keicho for making sentences
 　[Consider the following explanations of new features].
 　　What you write in the commentary is first discussed in the chat and then rearranged and composed in Regroup.
 　[I would like to come up with an explanation for the ability to create a map of Regroup from chat logs].
 		Whenever we discuss how to explain a new feature, the perspective always changes dramatically.
   That's probably because when you've finished implementing a new feature and you're thinking, "Well, how do I explain this?" you're in the creator's point of view.
   This time the change of perspective was illustrated. Typical, like the viewpoint before the change is user-absent.
 Ideally, Keicho and Regroup would complete the process, but users are unfamiliar with either tool.
 　A good experience is not possible if the questions are not answered well and the resulting stickies made are not good enough.
 　Seems like a good way to answer the empathy writing question.
 　I tried to imagine speaking in "listen first" mode while looking at the list of questions in [6 Minute Sentence], but I thought Keicho should just ask these questions because it's a pain to go back and forth between the list and Keicho.
 　You can ask in-depth questions about what you've written.
 　　When you say "next," proceed to the next question or add a "next question" button.
 　We are one step closer to realizing [🤔task management chatbot], which is still not very concrete.
　Should I return a question in response to a statement that answers an empathy writing question?
　　Cons
　　　Behavior becomes unpredictable.
　　Pros
　　　If your goal is to experience Keicho, you should experience the questions that come with what you write.
　　 It gives a sense of "they're listening" unlike existing template-filling mechanisms.
　　 Fill in a lot of questions and then ask about them and you'll get a lot of quotes.
　　It would be nice if the "next question" button could be used to move on when it is difficult to answer a question, etc.
　　This means [- 🤔 add commands depending on the state][✅ answer choices are made server side].
　　　I had been thinking "wouldn't it be nice to be able to answer with a button depending on the last minute question", but it seems more versatile and better to control by state
　　　This is [change answer choices depending on 🤔environment].
	[✅Create an empathic lighting mode.]

　Write an explanation of how to use [writing support mode].
　　Regroup needs to be explained.
　　Include modifications to make it easier to use on the part of Regroup.
