harassment via technology
[Unwitting "tech harassment", even subordinates are perpetrators: Nikkei https://www.nikkei.com/article/DGXZQODZ305K20Q1A330C2000000/?n_cid=SNSTW005]
	>Tech harassment (technology harassment), in which a person with a high level of IT knowledge is irreverent or intentionally continues to speak in technical terms. Even new employees of the digital natives generation are at risk of becoming perpetrators.

>[bgnori: https://twitter.com/bgnori/status/1379621403150798851] I can think of a troublesome development where those with social status start saying "tech harassment".

>[foursue: https://twitter.com/foursue/status/1379467488681807872] I want this to be called tech harassment, when people who are too low literate open themselves up to things they don't understand and cause problems for the company.

[nishio: https://twitter.com/nishio/status/1379621038900711426] Let's include forcing a younger person who is technically decent to do something that is not technically decent as harassment.
	Seems to fit the definition of harassment as "causing detriment."
		>Harassment...refers to comments or actions toward another person that, regardless of the person's intentions, make the other person uncomfortable, injure his or her dignity, cause disadvantage, or pose a threat. [Definition of Harassment https://www.osaka-med.ac.jp/deps/jinji/harassment/definition.htm]
	Since it is clear from the decline in the population that the working environment for young people will deteriorate if efficiency through technology is not promoted, preventing efficiency through technology without a valid reason is harassment because it "disadvantages" them
		[If AI doesn't take your job, you'll get three less days off a month].

>[ykmcx: https://twitter.com/ykmcx/status/1379671440866172931] I believe that harassment comes with a set of common sense domain updates. What was safe in the past is now sexual harassment, is easy to understand. I don't feel the examples of tech harassment I see so often are so technologically colored, and I think the only problem is a lack of respect for others. If "updating the common sense of information literacy" is slowed down by this, Japan will finally end.

[If you don't have computer literacy, don't expect respect from your employees] --- Drucker

[nishio: https://twitter.com/nishio/status/1379650482524745731]I think it is harmful to society if the term "tech-harassment" is used only in the direction of hindering the adoption of technology because it is hardened to one side's point of view. I think it would be a good idea to collect and share more and more examples of "tech-harassment"-like cases.
	Example: "'Don't automate with macros, do it by hand' is tekuhara."

	[* Restricting the means of communication of information without just cause is harassment].
  >[nagise: https://twitter.com/nagise/status/1379658987344252930] "Fax it to me, not e-mail it" is a technicality.
   nishio: "Could you fax it to me instead of emailing it?" If it's "send it by fax instead of e-mail," it's okay, but if it's "send it by fax instead of e-mail," it's harassment because it's disadvantageous to you.
   NAGISE: I guess there is room for negotiation at least.
  >[inuro: https://twitter.com/inuro/status/1379655290417606658]"Submit formatted text in Word or Excel, not Markdown."
	  I think it's like this: "It's technological harassment to force people to submit information in Word or Excel when the information can be adequately conveyed in text format.
		The term "technical harassment" is defined as "giving priority to instructions given over the telephone, where no record is kept, over those given by e-mail or groupware, where there is a record of what was communicated, because it unfairly disadvantages the recipient of the instructions.
		> [yumyum0141: https://twitter.com/yumyum0141/status/1379941695177990149] I don't know when I received the email, so I carry the document file directly on a USB stick to the branch office.
		>[create_clock: https://twitter.com/create_clock/status/1379668478181789697] print the pdf, fill it out by hand, seal it, scan it and email it to me, hahaha!
			Tech-harassment because they are causing unjustified disadvantage by making you go through the hassle without a justifiable reason.

	[* Prohibiting telework and videoconferencing is harassment without justification].
		>[arashi1977: https://twitter.com/arashi1977/status/1379653706862325765]"Online meetings are no good because they don't convey our enthusiasm."
			I'm thinking "ordering people to physically assemble in a conference room beyond the degree necessary to do their job is technically harassing."
			Especially now that coming to work increases the risk of infection, it seems to fall under the category of "harming the worker's working environment," which would fall under the MHLW's definition of power harassment if it is based on a superiority relationship.
		>[twi_kiri: https://twitter.com/twi_kiri/status/1379994975258091524]Does "teleworking from home would be sloppy, so I'll come in 2 or 3 times a week" count as tech harassment?
			Ordering someone to come to work without a valid reason for a job that can be done at work or at home is harassment because it increases the risk of infection.

 [* Restricting the type of stationery is harassment].
		>[madpeople_dayo: https://twitter.com/madpeople_dayo/status/1379777255237296138] take notes on your phone because you might be playing a game, so take notes with paper and pen, that's going to be tech-harassing!
			Prohibiting the use of familiar stationery for work without a legitimate business reason causes unjustifiable disadvantage and is therefore technoharassment.
		>[hopopo_169: https://twitter.com/hopopo_169/status/1379705550934450176]"Use a paper notebook, not a tablet, to copy the board" is a technicality.
			>KERO4fx: Don't use a mechanical pencil, use a pencil. is Showa-tekuhara
		>[LePiedDeYako: https://twitter.com/LePiedDeYako/status/1379690614606848005]Don't use vi, use emacs is tekuhara
   >Distr_to_Yonder: don't use nano, use vi is tekuhara
		>[sawat1203: https://twitter.com/sawat1203/status/1379669235727704066?s=21]"It is rude to take notes on a laptop during a meeting. Use a paper notebook."

　[* Asking for proof of correctness of automation and mechanization is harassment].
		>[hydehide555: https://twitter.com/hydehide555/status/1379979769907867648?s=21]This kind of thing is usually just pointless harassment by the boss who doesn't want his subordinates to know that his work is slow and of a low level. I'm not sure if it's a good idea to have a new system or not, but I'm sure it's a good idea to have a new system. I don't know anything about that, tell that to the manufacturers who made the machines.
  　Forcing subordinates to 'prove that they are not wrong' for automation and mechanization that is unlikely to be wrong is power harassment because it is disadvantageous to them without justifiable reason in the course of their work.
  >[ayashirokyusuke: https://twitter.com/ayashirokyusuke/status/1379790454091247621?s=21] Don't trust Excel's SUM! Use a calculator to do the math!　is that tech-harassment?
		>[yamat0nger: https://twitter.com/yamat0nger/status/1379749784936849409?s=21] "When you make a SUMSUM table in Excel with various numbers, you should lightly check the results of the calculation and the original formulas before that to make sure there are no problems at a level that is obvious to anyone. The "when you collect various numbers and make a SUMSUM table in Excel, you should lightly check that there are no problems with the results of the calculations or the original formulas prior to the calculation that are obvious to anyone else.
			This is a legitimate business instruction to devote reasonable checking man-hours because there is a good chance that there is an error in the formula and it will produce incorrect results.

 [* unorganized]
  >[hasegawayosuke: https://twitter.com/hasegawayosuke/status/1379657434625499136] I can't remember how to use git, so you should save your files with sequential numbers in the file names.
  	I think it's like this: "Trying to stop others from using version control systems because you don't know how to use them is technically harassment because it unfairly deprives you of the security and convenience that version control provides, to your detriment.

 	>[sironekotaishow: https://twitter.com/sironekotaishow/status/1379660101150154755] The excel graph paper given by government offices is a technical harassment, as is docomo's tacit approval of mail addresses that start with a dot.
 		Related Topics
 			>[konotarogomame (Taro Kono): https://twitter.com/konotarogomame/status/919847831535415296?s=21] Let's all banish God Excel. I am also the last one to appear.
 		I don't think the latter meets the definition of harassment.

 	>[takuchalle: https://twitter.com/takuchalle/status/1379655276534525957]You can't trust the results of Excel calculations, so use a calculator to check the results. is tech-harassment.

 	>[potikunn: https://twitter.com/potikunn/status/1379820246488416257]When I worked in a restaurant, I didn't know how to cancel a credit card payment, and when I asked for help, you know it when you see it! Don't ask me that! Do it yourself! I was yelled at in front of customers. I later found out that he couldn't use it either, but I guess this is a kind of technology harassment...
 		Harassment because it is difficult to believe that there was a business necessity to yell in front of customers.

 	>[hrjn: https://twitter.com/hrjn/status/1379651307221385216] "Just link kintone and slack with Zapier?" [hrjn: hrjn: 95] is tech-harassment
 		This is a bit out of context.
 		>hrjn: I'm not sure if I'm understanding techhara correctly. I'm not sure if I'm understanding tech-hala wrong, but I'm not sure if I'm understanding tech-hala correctly. But it is difficult to get amateurs to do this because of webhook and other new things that come up. It is harassment to say this as if it were easy.
 		nishio: I'm not sure about this. I think it is not harassment unless you put a few more conditions. If you say something like, "Please finish it by the end of the day," without explaining it thoroughly, it looks like harassment. On the other hand, "If you have any questions, please ask me" seems like a normal job.

 	>[toruhummer: https://twitter.com/toruhummer/status/1379946272476426243] ggrks is a tech hara!
 		Adding the word "cuss" when telling people that they can find it if they search is harassment because it offends their dignity without business necessity. The part where you tell them that they can find it if they search is simply a communication of fact, but in many cases it would be more efficient to directly tell them the URL they should read because search results have been customized in recent years and can vary from person to person.

 	>[kamui_Arisawa: https://twitter.com/kamui_Arisawa/status/1379998799985139713]"Use macros to automate. Don't use your hands except to prepare for automation.
 		If there is a situation where less energy is expended overall if some of the work is done manually, then prohibiting it is unduly disadvantageous and therefore a tekuhara.

 	>[sawa1014: https://twitter.com/sawa1014/status/1379971438501761025]They say it's DXing and force you to use macroed Excel, but it's a shitty UI where cell input is just window input, so forcing you to use it is Tekhara because it's detrimental.
 		This is technoharassment because it is disadvantageous by forcing inefficient technological means (the inefficient means are "newer" ones created later, but that has nothing to do with harassment).

[* Perpetrators of tech-harassment may also be victims of tech-harassment].
 >[yf95: https://twitter.com/yf95/status/1379928333673111558?s=21] "Circulate on paper as well because it's hard to see" something that was circulated electronically is a form of tech-harassment that forces people to do an unfair double job. However, the instructor himself is also a victim of technical harassment from the planning department, which is given only a small laptop computer and forced to look at the application "in a format that is easy to read only when printed on A4 paper" on the computer screen.

[* Possibly it would be better to call it power harassment or other harassment instead of tech harassment].
 >[ikemo: https://twitter.com/ikemo/status/1379922010042630145?s=21] I think it would be more effective to make it a power harassment without getting in their ring.
 	[Add "imposing an inefficient way of doing things" to the types of power harassment by ikemo-san | Digital Reform Idea Box https://ideabox.cio.go.jp/ja/idea/03904/]
 　That's true. I've been looking at the cases I've collected from various people this time, and there were many cases of "that's power harassment regardless of the technology".


>[yasufumi0: https://twitter.com/yasufumi0/status/1379925063848185856?s=21]"Please submit the PDF file in print because it is hard to read. I'm not sure how to do this, but I'm not sure I'd be able to do it.

>[aniwota_humble: https://twitter.com/aniwota_humble/status/1379841779453730817?s=21] Handwritten submission of reports is tekuhara


>[chigiratakemasa: https://twitter.com/chigiratakemasa/status/1379765730497814531?s=21] It's about time to send a zip file with password by email because I want to limit the scope of distribution. I'd like to put it in the tech-hala...


>[cordwainerscat: https://twitter.com/cordwainerscat/status/1379761849474818048?s=21] Isn't it also technical harassment to put a lot of macros in an Excel sheet that only the person using it knows how to use, and then let other people use it, saying "It's useful. And then, if you have to move to another department or leave the company without leaving any manuals, isn't that also technical harassment?
	The issue is how much coercion was involved in the "let others use it if it's convenient" part. If it was coercion from a superior position, it is power harassment, and if it was just a free choice, it is not harassment. The disadvantage caused by the lack of written instructions was management's fault for not giving instructions and time to prepare the instructions.

>[nilnil26: https://twitter.com/nilnil26/status/1379754072950013954?s=21]"Please buy and use secret encryption for the files you exchange with us. If you can't do that, we can't do business with you." This may be a violation of the Subcontract Act, depending on who you're dealing with, rather than technical harassment.
　Power harassment because they use their superior position over subcontractors to limit the means of information communication, and also cause disadvantage by forcing them to buy paid software


>[hayao0819: https://twitter.com/hayao0819/status/1379749168005062657?s=21]Is "don't use Excel functions because you don't know them well" also a technical harassment?
	Harassment because it causes disadvantage by restricting the means of business execution without justifiable reason in the course of business.
	I think it's legitimate scope if it's "tell me because I don't understand it well" or "make an explanatory document."

>[kanikanaa: https://twitter.com/kanikanaa/status/1379669113497284610?s=21]"I'm worried I might not get it if I just send an email. Please call me after you send the email."
	There is good reason to ask for a phone call, especially since the first email may not be delivered due to a wrong address, spam certification, etc.
	I've exchanged a number of emails and never had a non-delivery happen, but asking for a phone call even for a non-urgent email is overkill?


[Definition of harassment]
