Resource efficiency and flow efficiency
[https://gyazo.com/0a767996e1e70b9c8447940ae3533226]
[On Flow Efficiency and Resource Efficiency Itsuki Kuroda https://www.slideshare.net/i2key/xpjug]

	[Efficiency]
	[Resource Efficiency] and [Flow Efficiency]
 Pointing out that there are two different things you're referring to by the word "efficiency."

 I think the diagram is a little confusing.
 What is called resource efficiency here corresponds to the factory machine utilization rate in [Theory of Constraints
  When you think about [batch size], if you think only about resource efficiency when it is cheaper to make a large batch, you will end up saying, "Let's make the largest batch that is the cheapest.
  The larger the batch size, the more time it takes to get the materials into the factory machinery and out of the factory machine where they are made, but that is often overlooked
 Flow efficiency corresponds to shorter lead time
 He explains that both of these two as "what the word efficiency can refer to" can easily be a trade-off.
 In [learning-oriented management], shorter lead times are preferred because they are directly related to an increase in the amount of learning.
 To reduce batch size
 　Do only what you need to do.
 　[Pull from needs].
 　In software, it's called [YAGNI] or something like that.
　[Lean Cycle]
　　Pointing out that the thought process is the opposite of an arrow.
　Tends to make the constraint of a release date a given
　　The result is a change in mindset to one that emphasizes resource efficiency.
　　Make this constraint moveable.
　[The Efficiency Matrix]
　[Methods, practices, and methodologies to improve flow efficiency http://i2key.hateblo.jp/entry/2017/05/15/082655]
　　[Pair programming] reduces flow and increases quality.
　　　The amount of work per unit of time is halved, but the resource efficiency is more than halved because of the increase in quality.
　　　If two people are doing the implementation and code review to maintain quality, the lead time is reduced because it only needs to be done once, and flow efficiency is increased.
　　　As a side effect, knowledge sharing occurs and the frequency of "waiting for processing because the person who can do it is buried" is reduced, which increases both resource efficiency and flow efficiency.
		> If flow efficiency (reducing the amount of flow) is increased, the number of people on the line waiting for tasks to be completed will increase, and people who do nothing will be created. (Resource efficiency deteriorates).
  > Increasing resource efficiency (increasing flow volume) will increase human tasks on the line and lead time will increase. (Flow efficiency deteriorates)

relevance
　[Efficiently handling the task would implement the damn app at high speed].
