Companies that cannot pay non-monetary compensation must accumulate monetary compensation.
[https://gyazo.com/8edf32e11ccce2250e94a3bd5623d3d5]
	Isn't it "natural" that under free market transactions, [monetary rewards] would be lower in an environment where [non-monetary rewards] called "[rewarding]" are received?
	I feel that cases where the legal minimum wage is less than the legal minimum wage or where they don't pay what they are legally owed should be cracked down on, not because of [rewarding exploitation], but simply because of violations of the law.
	To add a little more to the original story, what you are saying is simple: if you have a challenging job and an unrewarding job at the same salary, the challenging one will be chosen, and the company on the unrewarding side will then need to raise its salary because it will be short-staffed.
 The short answer is that companies that are underpaid for their work need to pay more.
 Let's say that you are a fan of a baseball team and want to go to as many of their games as possible, and Company A allows you to leave early so you can make it to the game, but Company B does not. In this case, Company B needs to pay more if it wants to hire that person.
 The value of "going to the games" depends on the person, but for example, if B is 3 million more per year, it is not surprising if the person says, "I really want to go to the games, but I'll hold out for a few years to save money at B..." This is the reason why a company can accumulate non-monetary rewards. This is why a company that cannot pay non-monetary compensation must accumulate monetary compensation.
 So, this is a case where the issue is "can the company give the person what he/she wants?" and in some cases, the "thing" is not even a physical thing. In this case, it was "[freedom of] time. Similarly, if that person wants something rewarding, the company that can't give it needs to pay more.

[https://gyazo.com/8edf32e11ccce2250e94a3bd5623d3d5]
　The choice between Company A and Company B depends on how much importance a person places on each axis.　#C-space


relevance
	[https://cybozushiki.cybozu.co.jp/articles/m005338.html First public release! Cybozu's too free way of working was managed in this way | Cybozu Style]
 	>8:00-17:00 on Carp watching days
　[Commodity cash]
　[Freedom of time is a non-monetary reward].
