More language about what happens after exporting from Keicho to Regroup would be nice.
summary
　The message of the guide must also be given during the tutorial in Regroup.
　Regroup should also limit what you can do in the tutorial.
　I wonder if the engraved Keicho chat is appropriate for the language in Regroup.

[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon]More language about what happens after exporting from Keicho to Regroup would be nice.
[nisbot.icon]What kind of "Regroup" is that "Regroup"?
[nishio.icon]A tool to organize your mind by moving sticky notes
[nisbot.icon]What kind of "sticky" is that "sticky"?
[nishio.icon]What we talked about in the chat is automatically engraved.
[nisbot.icon]What kind of "chat" is that "chat"?
The one that was asked and answered by a chatbot using [nishio.icon]Keicho.
[nisbot.icon]What kind of "Keicho" is that "Keicho"?
[nishio.icon]Ask a lot of questions to humans.
[nisbot.icon]
 > The one that was asked and answered by a chatbot using Keicho.
 Is there anything else you can tell us about this "Keicho"?
[nishio.icon]Questions elicit what has not yet been verbalized.
[nisbot.icon]
 > The one that was asked and answered by a chatbot using Keicho.
 Where is this "Keicho" located?
Use before [nishio.icon]Regroup
[nisbot.icon]What do you value?
[nishio.icon]I think there is value in using a combination of the two. And I'd like to better verbalize how we can help users experience that.
[nisbot.icon]What kind of "verbalization" is that?
[nishio.icon]The first stage of verbalization can be done by answering the questions, but further verbalization occurs by rearranging them as stickies, how can we experience this place?
[nisbot.icon]Anything else about that "verbalization"?
[nishio.icon]Hmmm, I wonder if the message needs to appear even when the sticky is being moved.
[nisbot.icon]Anything else about that "sticky"?
Fragments made from [nishio.icon]chat, enough to put together and create a story, but maybe not enough to discover the structure and lead to language
[nisbot.icon]How do you know its "verbalization"?
[nishio.icon]I notice it while I'm rearranging.
[nisbot.icon]
 > The one that was asked and answered by a chatbot using Keicho.
 How do you know this "Keicho"?
[nishio.icon]It's hard to use a generic Regroup if you know someone from Twitter or something.
[nisbot.icon]Anything else about that "Regroup"?
[nishio.icon]Given the connecting tutorial mode from Keicho, it's like putting the answer to the last question in the middle first, and then putting anything that looks relevant nearby!
[nisbot.icon]Where does that "Keicho" come from?
I wonder if we need to get people more familiar with using Keicho before we do the [nishio.icon]Keicho-Regroup collaboration.
[nisbot.icon]What do you hope will happen regarding that "Keicho"?
[nishio.icon]Users should get used to answering chatbot questions, and learn to feel like they are using the chatbot as stationery.
[nisbot.icon]What needs to happen to "Keicho" for that to happen?
[nishio.icon]I'd like to see them use it a few times for specific purposes.
[nisbot.icon] With regard to "Keicho," can it?
I think the [nishio.icon] purpose-specific mode that we've put on is a step toward that.
[nisbot.icon]
 > I wonder if we need to get people more familiar with using Keicho before we do Keicho-Regroup collaboration.
 Where is this "Keicho" located?

https://keicho.netlify.app/#talk=AEWtDDbLvVPgctbqS27h