2021-04-12-2
>[nishio https://twitter.com/nishio/status/1381430565522481152]: this is a very valuable article to read again.
>[Here are the parts of the proposal that I thought were a waste of time. I think it's a waste of time to read the proposal. ｜Daiki Teramoto｜note https://note.com/teramotodaiki/n/n148d35899016]

>[nishio https://twitter.com/nishio/status/1381431521370808322]: If you see "I just listed all the ideas and didn't prioritize them" and think "eh, I've already written a lot, what should I do?", you should delete it. I think it would be a good idea to add a chapter "Appendix: Other ideas" at the end instead of deleting it. With feedback, they can say, "This idea in the Appendix is interesting, too.

>[nishio https://twitter.com/nishio/status/1381432129817505795]: we are not espers and cannot read what is not written. So it is better to have it written than not written. In addition to that, we also want to know "which you think is the most important", and it is difficult to understand that in a memo that lists all the ideas. So what you have already written should be in an appendix, not erased.

>[nishio https://twitter.com/nishio/status/1381433636742828032]: "It's not a logical argument to say that recent artificial intelligence is great -> this project is great too."
>Certainly. It's not logical to say, "Artificial intelligence is great these days, this project will be solved by artificial intelligence, therefore this proposal is great."
>I feel like this logically crazy thinking is often addicted even to adults.

>[nishio https://twitter.com/nishio/status/1381434439981391875]: Artificial intelligence does not solve problems, you solve problems. You find the means necessary to solve the problem and you implement them. Sometimes that means of solution is called "artificial intelligence" in the world, but that is not the essence of problem solving.
>"What exactly is this 'artificial intelligence' process?" It would be good to answer the question

>[nishio https://twitter.com/nishio/status/1381436031631642625]: The term "artificial intelligence" is vague, but a characteristic common to a relatively large number of methods is that "instead of humans implementing a lot of conditional branches, they collect a lot more The term "artificial intelligence" is ambiguous, but a common feature of many methods is that they collect more data and make conditional decisions based on that data, instead of implementing many conditional branches by humans. is the assumed question, isn't it?

>[nishio https://twitter.com/nishio/status/1381437790756372482]: Also, since many artificial intelligence projects are of the nature that "you don't know if it will work or not until you try it," I am also concerned about how to avoid having to announce at the results briefing that "we tried it, but it didn't work" when it doesn't work out. I am also concerned about how to avoid having to announce at the debriefing session that "we tried it, but it didn't work" if it doesn't work. This is a difficult question, and I don't have the right answer.

>[nishio https://twitter.com/nishio/status/1381438206881660930]: In some situations, "First build something that works on a rule basis, then actually use it to collect data. Sometimes it is effective to "use artificial intelligence not as an essential component, but as an added performance improvement," but not all of the time. Often there are cases where it is difficult to write a rule base.

>[nishio https://twitter.com/nishio/status/1381440506282921991]: Related
> A text for people who want to help creators who want to enter some kind of contest but don't know how to advise them.
>[Type Advice for Contest Entrants - Yasukazu Nishio's Scrapbox https://scrapbox.io/nishio/%E3%82%B3%E3%83%B3%E3%83%86%E3%82%B9%E3%83%88%E5%BF%9C%E5%8B%9F%E8% 80%85%E3%81%B8%E3%81%AE%E3%82%BF%E3%82%A4%E3%83%97%E5%88%A5%E3%81%AE%E3%82%A2%E3%83%89%E3%83%90%E3%82%A4%E3%82%B9]
