Those who avoid IT literacy will have to wait in long lines.
>[nishio https://twitter.com/nishio/status/1381282245462220806]: [population pyramid] shows that the number of elderly people per working population will increase in the next few decades. The amount of work required per person will increase, so some kind of efficiency improvement will take place. One way to do this is to "let those who can do it operate the machines themselves," as private supermarkets and convenience stores are introducing self-checkout systems.

>[nishio https://twitter.com/nishio/status/1381285801447714823]: sushi restaurants are private private businesses, so they can refuse customers who cannot operate the terminals themselves. Such customers criticize the restaurant one way or another and leave. On the other hand, public institutions such as government offices cannot refuse them, so they have to put up a manned counter for such people. Since the number of elderly people per working population will increase, there will naturally be a long queue at those counters.

>[nishio https://twitter.com/nishio/status/1381288134713864194]: While older adults without IT literacy spend their remaining time of life waiting in line, IT literate seniors can operate their tablets in the comfort of their own homes and accomplish their goals in a shorter amount of time. and accomplish their goals in a shorter time. To avoid IT literacy now is to choose the former way of life. Either you continue to run away from IT until you die, or you learn now when you are the youngest.

>[nishio https://twitter.com/nishio/status/1381289870341984257]: Well, I just think that the former are unhappy, but the people who are the former may not be unhappy because they actually die without experiencing the latter way of life. I don't think so. For those who don't like to learn, is learning unhappy in the first place? I guess each person should live the way he or she wants to live. It was not for others to interfere.



A story about how some people are outraged by the increase in self-checkouts.
https://www.facebook.com/707202497/posts/10159453472072498/?d=n
>Look who's back has Hitler going to the supermarket and asking why he has to take the items off the shelves himself! I enjoyed the scene where he gets angry. No one questions the self-service there anymore to begin with.

Who finds McDonald's mobile ordering a hassle and who finds it useful?
https://togetter.com/li/1736298

2021-10-08
I heard that after the earthquake, the trains were stopped and there was a long line of people waiting for cabs to get home, but when I called them with the app, they came right away and I was able to get in.

https://twitter.com/nekogal21/status/1469878595380465668?s=21
A story about people who can't use McDonald's mobile ordering to get in line.
