Is an IT engineer an engineer, or is Wikipedia a wiki?
>[otsune https://twitter.com/otsune/status/1356789325279551489]: "Don't write IT software engineers as engineers for short". It's like "don't write Wikipedia as Wiki".

>[__gfx__ https://twitter.com/__gfx__/status/1356789851996082176]: This is another common objection, but since software engineers are a subset of engineers, but Wikipedia is a software called wiki So, it is logically true that "software engineers are called engineers".

>[otsune https://twitter.com/otsune/status/1356790262442250240]: eh, Wikipedia is a wiki (one of the wikis), right?

>[__gfx__ https://twitter.com/__gfx__/status/1356790705809575936]: I think Mediawiki is definitely a Wiki, but Wikipedia is... an instance of Wiki! I think it is an instance of Wiki, but not an inclusion!

>[otsune https://twitter.com/otsune/status/1356791161021587457]: I didn't quite understand why the "instances but no inclusions" part, what specific metaphor or explanation might that be?

>[kazuho https://twitter.com/kazuho/status/1356792069818179589]: like if you think of Wiki as a word that describes an editing system, then you would conclude that a website built using a Wiki is not a Wiki. I'm not interested in the conclusion.　I'm not interested in the conclusion.

>[__gfx__ https://twitter.com/__gfx__/status/1356792189028732930]: class SoftwareEngineer extends Engineer
> gfx = new SoftwareEngineer() # gfx is SoftwareEngineer and Engineer
> class MediaWiki extends Wiki
> wikipedia = new MediaWiki() # wikipedia is MediaWiki and Wiki
> So "Wikipedia is a Wiki, but its relationship is different from that of SWE and Eng"...?

>[otsune https://twitter.com/otsune/status/1356792838843846656]: "A site that uses Mediawiki as a CMS system, but only you and your authenticated people can update it, so it is not really a wiki. There are a number of examples of this elsewhere, so I can see how you could describe XX as not a Wiki with that. But Wikipedia is not, so is it not a Wiki?

>[otsune https://twitter.com/otsune/status/1356794031787843586]: there is an advantageous difference between "being a wiki site using Mediawiki" and "being a kind of software writing engineer, a who's who". I'm not sure I understand the argument that "it's a kind of engineer who writes software". I never understood the claim that ......

>[kazuho https://twitter.com/kazuho/status/1356794931365306370]: There is a dispute over whether Wiki refers to software (or an editing method) or a website built using Wiki software. If you take the former position, then Wikipedia is a "Wiki site". If you take the former position, then Wikipedia is a "Wiki site", not an implementation of the software "Wiki" en.wikipedia.org/wiki/Wiki#Alte...

>[otsune https://twitter.com/otsune/status/1356795567003758593]: I see. And I thought the word "engineer" has similar multiple meanings. (Back to the issue of not abbreviating "IT software engineer" as "engineer")

>[otsune https://twitter.com/otsune/status/1356796263874719746]: "Wikipedia is a proper noun for a very famous site using Wiki" "Software engineer is not a proper noun, but a name for a detailed genre. I think this is what gfx was trying to say.

>[__gfx__ https://twitter.com/__gfx__/status/1356798852775428096]: it does! I recognize that categories and proper nouns (instances) are two different things. In natural language, they are expressed the same, but in terms of mental models, they are different, so it feels strange to talk about them in the same sentence.

>[kazuho https://twitter.com/kazuho/status/1356799181294211072]: "Are you saying my dog Pochi is not an animal!

>[otsune https://twitter.com/otsune/status/1356799647671488514]: "Don't call USB Memory Stick "USB"" -> Inclusive "USB Memory Stick Samsung something (appropriate) is called USB. USB Memory Stick Samsung something (appropriate)" -> proper noun

>[nishio https://twitter.com/nishio/status/1356803925366644745]: "Categories and proper nouns are not the same thing," "In other words, gfx is not human," (stop it, it's getting complicated!)

>[__gfx__ https://twitter.com/__gfx__/status/1356808637478547457]: It's not good because we discuss in natural language!

>[kazuho https://twitter.com/kazuho/status/1356808861735243776]: if it's a prototype-based object-oriented language, there's no distinction between instances and classes ！！！！！！

>[__gfx__ https://twitter.com/__gfx__/status/1356808993688199170]: seyatta ！！！！