Need support for proposal capacity.
>[momeemt https://twitter.com/momeemt/status/1385210555820953600]: I think that especially in middle and high school students, people who are already good tend to be able to get a good environment where they can further improve their abilities by taking advantage of their environment and abilities. However, I think that the gap in ability becomes huge because there is not enough support for those who need to obtain the necessary [* ability to make proposals] and to run on their own to obtain such an environment.
	>[momeemt https://twitter.com/momeemt/status/1385210557318406145]: In the future, regardless of your current abilities (rather, if you are capable, you can run on your own), we would like to support you financially and technically, focusing on your [enthusiasm]. I'd like to try it. It's just an idea, so it's not feasible at this point. Also, there is no need to focus on manufacturing.
	>[momeemt https://twitter.com/momeemt/status/1385210558941519881]: In other words, I feel that to be accepted to study abroad, SecHack365, Unexplored Junior, and other training programs, you need to be very good at what you do because the competition has become so high. I feel that you need to have a considerable ability to be accepted to study abroad, SecHack365, Unexperienced Junior, and other training programs. It may be necessary to have a support group that does not consider the ability (which includes various things such as making plans, coming up with ideas, simple information technology, etc.).

>[ukkaripon https://twitter.com/ukkaripon/status/1385214491604832257]: I totally agree. I have the impression that the quality of proposal writing (meaning the skill of conveying things to others in writing, regardless of content) is very polarized rather than the quality of the ideas and proposals themselves, and I can easily imagine that it is probably very much influenced by [* having supportive adults, seniors, and friends around you]. I can easily imagine that they are probably very much influenced by [* supportive adults, seniors, friends].

>[ItyuJ https://twitter.com/ItyuJ/status/1385218186237284372]: This is so true. I happened to be blessed with a good environment (mainly people) and was able to participate in the U-22 ProCon when I was in 3rd grade, and since then I have continued to make achievements, acquire resources, and create new achievements. In this sense, it is important to have a broad starting line.
	>[ItyuJ https://twitter.com/ItyuJ/status/1385218856130465797]: I think if you can do something with one shot, then you can effectively use it to do the next thing, and then use it to do more things you want to do... I think I can do what I want to do (I'm doing it right now) (although I can't ignore the fact that some people can't do more even if they get the first shot due to family or health issues, etc.) So anyway, it's hard to get the first shot.
	>[ItyuJ https://twitter.com/ItyuJ/status/1385219753002692608]: Some people talk about the ability to run on one's own, but I think that with the exception of a very limited number of people who really are [* seem to be "running on their own" but are actually coasting or have a running mate I think that many of the strong people around me are like that. Many of the strong people around me are like that, and they are also aware of their good fortune.
	>[ItyuJ https://twitter.com/ItyuJ/status/1385220125184299009]: I know I've expressed my feelings, but if there is anything I can do to help create a starting point, I'd like to be proactive. I would like to be a person who can send such a favor to others.

>[nztm_tw https://twitter.com/nztm_tw/status/1385223484997963779]: I know this... I have a feeling that it's tough without recognition of possibilities and [* the ability to communicate] (writing and dialogue skills). Until my first year of high school, when there were no so-called outstanding kids around me, I didn't even know such an environment existed in the first place. So when I first met such a girl, I was shocked, and I am here today thanks to her.
	>[nztm_tw https://twitter.com/nztm_tw/status/1385223486491095043]: I've been through the selection process for a number of high school and college programs since my sophomore year, and looking back, I'd say [* writing skills] or [* storytelling] kind of thing? I think that if you don't have the ability to put those things into writing, you won't get a chance. Well, I didn't have the ability to tell a story, so I was often dropped in the second round where there was an interview.

>[Nyanyan_Cube https://twitter.com/Nyanyan_Cube/status/1385244355569410050]: With projects that support manufacturing in mind, I feel that [* the ability to make proposals, especially in writing, is more important than the ability at the time of application]. I think it is important. I don't think writing is taught properly in school, and without it, it is impossible to communicate things to others in the first place, so I think it is a very difficult problem to solve!
	>[ukkaripon https://twitter.com/ukkaripon/status/1385244803714076673]: one way is to ask to see the prototype, but that raises some hurdles!
	>[Nyanyan_Cube https://twitter.com/Nyanyan_Cube/status/1385245280749031428]: it takes a lot of technical skills to make a prototype yourself, especially when hardware is involved (even with server costs, etc.)! ...I think interviewing everyone would be the best way, but it seems difficult due to time constraints. I don't know what to do...
	>[nishio https://twitter.com/nishio/status/1385257641652285440]: ai should do the first interview (wait)
	>[Nyanyan_Cube https://twitter.com/Nyanyan_Cube/status/1385257869411454980]: surprisingly thought that maybe it might be realistic!
	>[nishio https://twitter.com/nishio/status/1385261785737961475]: AI(?) I've already made it to the point where the AI(?) accompanies the proposal writing process. If I have to go all the way to the review process, hmmm, I don't know what to do...
	>[nishio https://twitter.com/nishio/status/1385261897310736387]: forgot to post the link [proposal support mode to make].
	>[Nyanyan_Cube https://twitter.com/Nyanyan_Cube/status/1385263124731678723]: this is interesting! I thought such a tool could also help proposers!
		[https://gyazo.com/4ae68b243eac713fd62f0a49f2d16518]
	>[nishio https://twitter.com/nishio/status/1385265268935389187]: You use it easily! I'm impressed! I haven't found a solution yet as to how people who get stuck when asked questions by bots can easily answer them like this.

>[shudo https://twitter.com/shudo/status/1385254820018147334]: As an unexplored 1PM, I think of it this way: 'The applicants are young, under 25, and some of them may be middle or high school students. Therefore, many of them are not skilled in preparing application documents. If the screening process is based solely on the application documents, the skill of the applicant's document preparation will greatly affect the acceptance or rejection of the application. The purpose of the project cannot be fulfilled if this is the case.
	>[nishio https://twitter.com/nishio/status/1385478009868541952]: I guess that's the same conclusion as Seki-san who tripled the auditions last year. I guess that's the only way to go.
 > >Because "that would not serve the purpose of the Unexplored Project," we emphasize auditions in the screening process.... Auditions are open to as many applicants as possible.
		[Audition as many applicants as possible].
　　Unexplored 2018: 178 applications -> 35 auditions

from [Thought Node 2021 Unexplored Junior].
Need support for [ability to propose
[文章力]
[Storytelling]
