Examine different solutions to similar problems.
I was reading the application materials for the 2021 Unexplored Junior.
I thought that in some cases what you wanted us to do was not conveyed correctly because you wrote "research of similar products" on the application form.

I think this text written by mentor Teramoto in 2020 is easy to understand.
 >When researching an existing product or service, one should examine and compare "all the possible avenues a user could take to solve the problem. This is not the same as simply examining "similar products". To take an extreme example, if you are creating an e-signature service, your competing services should also include hanko. Electronic signatures and hanko are two completely different things. However, people who adopt an electronic signature service are people who used to use hanko, so it is necessary to consider how it compares to hanko. In this way, it is important to find and compare the similarity of the 00 of "those who want to use 00".
 	[part of the proposal that I thought was a waste of time].

The diagram depicts it like this. If you are proposing that customer Z will be happy if you solve problem Y using means X, it is not very useful to find a case where something similar to means X solves a different problem A. Instead, find a case where means B solves a similar problem for a similar customer, which is not similar at all. Instead, find a totally dissimilar means B that solves a similar problem for a similar customer.
　[https://gyazo.com/f796ef05ff045dfae1a87ba7288bb547]

Let's consider this with a specific project. https://jr.mitou.org/projects/2020/brush_talk
This is software that solves the "I want to communicate but can't" problem Y for "people who can't speak" Z. So what other means are there to solve this problem?
For example, there is "writing" with pen on paper. This is means B.

Once you have found a "means B" that solves a similar problem, then consider the situations in which it does not work well.
For example, a person who cannot write cannot speak in writing. So an infant or a person who cannot write because his or her hands shake cannot speak in writing. The proposed software can be used by such people because they press the "aiueo" button.

By explaining in this way, you can tell the reader when what you are proposing is better than what is existing.
