Nodal Point of Thought 2021 Unexplored Jr.
A thought piece that came out of reading the application materials for the 2021 [Unexplored Junior

	[When you are unclear about what you want to do]
	[There is more than one type of customer.]
	[Examine different solutions to similar problems].
	　When I wrote this, I implicitly assumed that "problem solving is more important," but maybe I should ask the question, "Which do you consider more important?"
　		[技術と問題解決の図]
　[or a project without a client].
	[It's hard to make something that helps you make it.]
	>[nishio https://twitter.com/nishio/status/1385131810066030592]: whether or not it is senile to comment "that's difficult" in response to "I want to do this or am thinking of doing this"
 	["I don't know an easy way" instead of "it's hard."]
	[I want to send books easily.]
	[proposal capacity support needed].
	[Behavior under COVID 19 becomes a standard job hunting question].

	Discover and edit past articles
		[Goals may be modified].
		[How to conduct a weekly meeting]
		[My way of judging]
		["Would like to, but haven't started."]
		[Type advice for contest entrants].
		　Add pattern 5
		[Conceptual ability is the ability to limit the problem.]
		[Product/User Fit]
　　[Rejection is not a denial of the proposal.]


---未整理時系列

Hypothesis testing
 As I was reviewing the documents, I was thinking that "verification of the hypothesis that there is customer value" and "verification of whether or not it is technically possible" are two different things, even if we say "verification of a hypothesis" in one word.
 	The difference between YZ and XY in "I'm going to use a certain technology X to solve a certain problem Y, and Mr. Z should be happy when I solve it."
 	[https://gyazo.com/0b1417a9472766fcb05ebefc1bc6fd4f]
 　"Can technology X solve problem Y?" and "Will customer Z be happy if we solve problem Y?" There are two questions
 　Many projects solve problems and make customers happy by means that are not so difficult in the public eye. So the XY hypothesis, in the mentor's eyes, is "feasible without problems" or "can this creator achieve this within a six-month development timeframe?" The YZ hypothesis can often only be verified by actually building the product. Therefore, the hypothesis is "Let's test it with a minimal implementation" ([MVP]).
 　On the other hand, there are also types of proposals that challenge difficult technical means.
 　　Ignore whether or not the customer will be reached in the time frame and focus on the problem to be solved.
 　　A proposal that the problem should be solved, but the world has not yet found a solution, so create a new solution.
 　　Most of the time, there is a lack of research (the solution is already there and the proposer is just unaware of it OR there are no customers who would be happy with a solution to a problem that is supposedly a problem to be solved).
 　　But rarely, there is a creator who finds and proposes a genuine problem and solution (or at least can't find a flaw in the proposal to the mentor).
 　I'm not sure I understand where the difficulty lies.
 　　The type of software that is not difficult to create but difficult to attract users.
 　　　But if all you write about is how to create something without considering how to attract users, you don't seem to understand.
 　　The type that needs to be verified if the solution is feasible.
 　　　That's your first priority, and you're trying to do something else...
 　I could be wrong, as "difficult" is subjective.
 　　["I don't know an easy way" instead of "it's hard."]

 I still find it difficult to "research existing products." I wish I could convey something more like what Mr. Teramoto said.
  >When researching an existing product or service, one should examine and compare "all the possible avenues a user could take to solve the problem. This is not the same as simply examining "similar products". To take an extreme example, if you are creating an e-signature service, your competing services should also include hanko. Electronic signatures and hanko are two completely different things. However, people who adopt an electronic signature service are people who used to use hanko, so it is necessary to consider how it compares to hanko. In this way, it is important to find and compare the similarity of the 00 of "those who want to use 00".
  	[part of the proposal that I thought was a waste of time].
		The one that, in proposing "solving problem Y with means X makes customer Z happy", lists "something like means X that solves something like problem Y" as similar, but then goes "there's a totally different major means W that solves problem Y and makes customer Z happy".
　　[https://gyazo.com/f796ef05ff045dfae1a87ba7288bb547]
　Organized: [to examine different solutions to similar problems].


 >[nishio https://twitter.com/nishio/status/1385120897980272642]: > It is important to tell friends and acquaintances that I do/want to do this.
 > 仕事としてOSS開発者をやってきた話 - 覚書 satoru-takeuchi.hatenablog.com/entry/2021/04/…
 	>[nishio https://twitter.com/nishio/status/1385121796706357251]: In my lecture material for junior high and high school students, I was going to say that "not all opportunities are clearly publicized and visible to all, in fact, many are not. I was going to say that "not all opportunities are clearly publicized and visible to all" in my presentation for junior high and high school students, but I couldn't answer "so what should I do?
 	>[nishio https://twitter.com/nishio/status/1385122115548942336]: In order to communicate what you want to do, you need to be able to put into words what you want to do, and in order to communicate what you have done, you need to be able to do something and produce a product. In order to communicate what you have done, you need to be able to do something and produce a product.

You should have a long shelf life output.
 >[nishio https://twitter.com/nishio/status/1385460712865103875]: even if the speed of output per unit time is not much different, Mr. B has a 3 year shelf life in the time Mr. A is doing output that expires in a day. If you do the output, it looks as if Mr. B has about 1000 times more output than you.
 	>[nishio https://twitter.com/nishio/status/1385462012918976514]: People cannot see the inside of others, so no matter how good the inside is, if it is not output, it will not be evaluated [human evaluation and output capability].

 >[nishio https://twitter.com/nishio/status/1385464207907254275]: "Information comes to those who transmit it" probably lacks the conditions
 	>[nishio https://twitter.com/nishio/status/1385464424220135428]: What kind of information should we send out to attract useful information?
 	>[hayamiz https://twitter.com/hayamiz/status/1385469962270117888]: I think one pattern is that youtuber scandals can be publicized in a highly influential way by dropping them to Korekore-san.
 	>[nishio https://twitter.com/nishio/status/1385470560067416065]: that's certainly one pattern I hadn't thought of.
 	>[nishio https://twitter.com/nishio/status/1385470822807076868]: When you gain influence by sending out messages, you attract tipsters who expect that influence.


 >[nishio https://twitter.com/nishio/status/1384814043802705921]: a case study of a middle and high school teacher who was left behind in the information society:.
 		>[https://twitter.com/cyanolupus/status/1384727362051350529 @cyanolupus]: In middle school and high school, I was told, "They won't read your report in college with such dirty handwriting!" but when I got to college, they allowed PDFs for everything. I write in LaTeX.
　　The problem of not knowing if the opinions of the adults around you are sane or not.
　　Whether the opinion has been validated
　　Opinions are interpretations, not facts.

[proposal capacity support needed].
	Related to the discussion about the disparity in the ability to write a proposal, I'm hypothesizing that it would be better to go through the proposal and think about what is being asked there to clarify the questions so that we can think carefully about what we want people to "think about".
	It's not like "think about what you need to think about, then transform and fill in the form," but rather, "filling in the form is thinking about what you need to think about."
	I thought it would be a good idea to gather information such as, "It might be better to add these types of questions," or "It might be better to change the way the questions are asked," or to ask this year's and past adopters which questions they found difficult to answer.

Willingness not to bias the proposer's affiliation with the alma mater, either positively or negatively.

I'm almost done, but if I read it with the mindset of "I'm almost done, so I'll finish it today!" I'll finish the rest tomorrow.
	It's important to keep mental health in check.

I'm wondering if there is a way to support projects that don't cost a lot of money but take a lot of time.
	I felt that if the duration of the project is set at six months, it would not be good to create a bias to choose something that might lead to results in six months.
	Do you want to do Unexplored Junior X, which takes plenty of time to solve social problems separately from Unexplored Junior (just an idea)?
	If there is a mismatch among the applications to the Unexplored Junior Program, but there is something that the Unexplored Foundation could support that would have a positive effect on society, it would be a good idea to start a separate project.
　Project Continuity
 	I would like to support him to use Junior Unexplored as a springboard to gain recognition and donations so that the service can continue to revolve around him and not have to be run by just one person.
 　Basically, projects for middle and high school students are likely to undergo changes in their living environment due to their own higher education or employment within 3 years, and their continuity is often questioned.

[strong/interesting/important/want to cooperate]

[I'm concerned about the consistency of the claims.]

>[nishio https://twitter.com/nishio/status/1386768441353195521]: "If method X solves problem Y and makes customer Z happy," two hypotheses are being embraced: the "customer value hypothesis" for YZ and the "technology hypothesis" for XY.  Which of these two is more important, how do we test it, and what do we do when it is tested and rejected?

>[nishio https://twitter.com/nishio/status/1386775112934780930]: ah, ok, I get it, everything that draws resources from others besides yourself is in exchange for providing customer value. Sometimes there are countless customers, sometimes there is one, sometimes there are many competitors for customers, sometimes there are few, but the composition is an exchange of value.
	Related: [mentors as clients].

[基礎研究は顧客不在]

[Unexplored is not an ideas contest.]

[mentors as clients].

[Should there be a common standard of review?]

As far as whether or not I would rate the team application negatively, I used to think it was negative, but not so much anymore.
However, the perception that team development is a more difficult project than individual development has not changed
。
In terms of consistency with what the team has applied for, I would check "How will each individual team member contribute to this project?", "Is there synergy in what each individual team member wants to do?", and "Is the team leader likely to be able to bring the team together?

[no attempt to write reasons for rejection in rejection feedback].
[Early failure is beneficial.]

[If you talk to someone who's never done it before about what you want to do, they'll tell you why you can't do it].

[Don't admire youth.]

[Don't fix what's wrong, but develop what's good].

[check the most uncertain first].



>[nishio https://twitter.com/nishio/status/1388705480051093505]: #Unexplored Junior Question Box Q: How many people passed the first round? Up until the year before last, there were 3 passes per mentor, but there was a mentor who increased the number of passes last year, and it looked good, so many mentors increased the number of passes this year. This year, there were 45 applications passed, 2.7 times the number of applications passed, and the interview phase will be 3.8 times the number of applications passed!
	Related: [audition as many applicants as possible].


>[teramotodaiki https://twitter.com/teramotodaiki/status/1388720530463760384]: When replying to emails, "reply to all", it's a simple but very important thing. It's not a matter of etiquette, but a must. If you compare it to Twitter, replying to a tweet -> reply to all tweets, DMing the tweeter individually -> reply to all tweets. Normal replies are more special cases, so we try to reply to everyone. twitter.com/mitoujr/status...
	>[teramotodaiki https://twitter.com/teramotodaiki/status/1388722978196578305]: Supplement 1: For those who think "If I reply to everyone, my address will be revealed. You don't have to worry about it at all in e-mail. It is the sender's role to make sure that your address is not revealed. Specifically, use "Bcc".
	>[teramotodaiki https://twitter.com/teramotodaiki/status/1388722979375247364]: Supplement 2: "Won't this cause unnecessary notifications to be sent to others?" For those who think so. You don't have to worry about these social networking gestures at all in emails (especially for important communications). Not being sent is much more problematic than being sent too much. It is futile to skillfully use Cc and Bcc for each statement. In such cases, use Slack.
	>[nishio https://twitter.com/nishio/status/1388734262136872961]: also illustrated [Reply All is required for emails with CC].


>[teramotodaiki https://twitter.com/teramotodaiki/status/1388713022743408642]: it would be good to write a proposal for a user-submitted service, try it with existing tools + existing media and then write a proposal. It takes far less time to get up and running than creating a service, and you can learn a lot if you slip up, and it doesn't cost a lot of money. For example, Notion + Instagram for images Scrapbox + Twitter for text Vimeo + TikTok for videos.

>[nishio https://twitter.com/nishio/status/1388720495244185603]: one way to create a prototype is to introduce... twitter.com/teramotodaiki /...

>[nishio https://twitter.com/nishio/status/1388754394896764930]: I was just thinking about this, but the term "prototyping" is often misunderstood as "writing your own code and building something from scratch", when what you really want to do is "testing a hypothesis". What you really want to do is "to test a hypothesis", and in creating a minimum viable product (MVP) for testing a hypothesis, you can of course "try without implementing".

>[nishio https://twitter.com/nishio/status/1388754622571941888]: for user-submitted services, it would be good to have more language about what hypotheses you want to see tested.

>[nishio https://twitter.com/nishio/status/1388755296185585669]: It's better to have a prototype that you've tried to implement than to have just an idea, "I think it would be nice to have something like this," but the important thing is not "to have a prototype It's not "that there is a prototype", but "that it's not just an idea, but that it's been tested".

>[nishio https://twitter.com/nishio/status/1388755798059208710]: I'm not sure if this ties in with this story from the other day. It doesn't make much sense to create a part of a hypothesis that doesn't lead to testing the hypothesis, but rather an action that will test the hypothesis even if you don't create anything. It's better to do it.
	[hypothesis testing lead time#608d2631aff09e0000bd7aef]

>[nishio https://twitter.com/nishio/status/1388756066662379522]: in that sense, I've seen a few proposals that have surveys, but I'm not sure if it's better to explicitly say "this is good" somewhere.
　You might want to add this to the "what we've done so far" example in the proposal format.

[What hypothesis will be tested in the prototype?]
>[nishio https://twitter.com/nishio/status/1388765282290724865]: making a prototype is a means, the goal is to test a hypothesis. What exactly is the hypothesis? What makes you happy when you test the hypothesis? In a "if we make X, problem Y will be solved and customer Z will be happy" type proposal, "the proposer can make X," "making X will solve problem Y," and "customer Z will be happy when problem Y is solved" are all hypotheses.

>[nishio https://twitter.com/nishio/status/1388765811813220356]: It's a problem when you can't make what you thought you could make, it's a problem when you make it but it doesn't solve the problem, and it's a problem when you solve the problem but no one wants you to solve it in the first place. If you solve the problem but no one wants you to solve the problem in the first place, there is no point in making it. So you need to make sure early on.

>[nishio https://twitter.com/nishio/status/1388770347676168193]: of course this hypothesis does not have to be tested before the proposal, on the contrary, it could still not be fully tested at the time of the results report It is possible that it will not be fully verified even at the time of the results report. But it is beneficial to repeat the verification and make it more certain little by little, and if it is zero step at the time of proposal and one step forward, it is better to be taking a step forward.


Maybe what I want to do is "MOT education for middle and high school students.
Why do we think about customer value, and why should we feel that we are doing something useful in the world if we do something that has customer value?
Are you ready to continue?

[Research also needs to be implemented in society.]

[unexplored junior, 5 tips for creating a proposal that gets the message across https://zenn.dev/reputeless/articles/idea-mitoujr]
