Behavior under COVID19 will be a standard job hunting question.
COVID19 is a major event that all of the subjects have experienced (the area is limited in the case of an earthquake or something like that).
So it's easy for the interviewer to ask that question.
Individuality comes out in how you behave when unexpected events occur.

>nishio https://twitter.com/nishio/status/1385433313591005185]: I think you are right about the difference between those who can [run on their own] and those who can't in this environment. I think this is true, and it will be clearly recognized years later, when people are job-hunting and need to appeal themselves.

>[nishio https://twitter.com/nishio/status/1385434434913005568]: Nowadays, middle and high school students tend to focus on the university entrance exam because it is in front of them, but the university entrance exam is bound by the curriculum and the speed of change is slow, so it is easy to achieve results by "doing things the same way as before" even if society changes drastically. The speed of change in the college admissions process is slow because of the curriculum and other factors, so it is easy to achieve results by doing things the way they have always been done, even if society changes drastically.

>[ukkaripon https://twitter.com/ukkaripon/status/1385436426221719565]: Is it true that job hunting is changing fast? (I did my job hunting a long time ago, so it may have changed, but Japanese companies and foreign companies were looking at the same things at all differently.)

>[nishio https://twitter.com/nishio/status/1385447159919648769]: How exactly were you looking at it differently?

>[nishio https://twitter.com/nishio/status/1385453855803019266]: it's easier to ask questions about "the person's attitude towards things" because of this event. Because it's a major event that all the subjects have experienced (the area is limited by the earthquake or something like that), there are more cases where interviewers will start asking that question, and as long as they ask it, it might influence the hiring decision and thus get closer to a decision on foreign investment.

>[nishio https://twitter.com/nishio/status/1385454209546342407]: Of course I don't deny that there are "big companies that are hard to change" that don't make such changes. It means that such companies are not 100%.

from [Thought Node 2021 Unexplored Junior].
Behavior under COVID19 will be a standard job hunting question.
