General education on how to work
from [tweet]
General education on how to work

>[ama_ch https://twitter.com/ama_ch/status/1385488586422710272]: what we talked about at this year's newcomer training
> ・What is [Agile], Scrum, and Lean?
> ・Maximize outcomes by minimizing outputs!
> ・Maximize [flow efficiency] by reducing lead time!
> ・ [HRT]Daiji
> ・ Avoid multitasking
> ・Pair Mob recommended
> ・Weekly review

>[tnsm0223 https://twitter.com/tnsm0223/status/1385595945425903628]: Isn't it great that all new hires, both engineers and non-engineers, can learn this? And since the recording is available to the entire company, you can watch it afterwards. I'll find time to replay it at double speed to catch up.

>[ama_ch https://twitter.com/ama_ch/status/1385704298743406592]: yes, it's no longer just for engineers, so it's like a general education on how to do your job. It's not just for engineers anymore, so it's like a general education on how to do your job. I am very grateful to be able to speak in such a position. We will brush up the content every year!

>[nishio https://twitter.com/nishio/status/1385768016122576897]: I'm resigned to the fact that it's hard to bridge the gap between those who can learn about these things early on as general knowledge, and those who have adapted to the hierarchical Orange organization, and label them as "nonsense" or "trendy". I'm resigned to the fact that it's hard to bridge the gap between the two.

>[nishio https://twitter.com/nishio/status/1385770060501815296]: this is it [attacking something unfamiliar without looking at it properly].

>[nishio https://twitter.com/nishio/status/1385771764127440898]: no, it's not that you've never seen it, but that you've actually seen it and if anything, experienced it and felt bad about it, and then collectively reject anything with the same label.

>[nishio https://twitter.com/nishio/status/1385773786411147267]: Some strong people made an initial verbalization that "there is a common pattern in what we are doing", and then the early adopters adopted it because it has various good characteristics. Early adopters adopted it, but at this stage, the language was not well-developed, so there were many blank spaces, and there were cases of failure depending on how the blank spaces were filled in.

>[nishio https://twitter.com/nishio/status/1385774161151152130]: from the side of those involved in this failure, based on your own real life experience, you may have the belief that "that was a stupid fad, some idiot who wasn't you adopted it and it failed and It was a terrible mistake, and I'm not stupid, so I'm not going to adopt it" based on their own real-life experiences may not be an option.

>[nishio https://twitter.com/nishio/status/1385789557589692425]: [structure revealed in stages]

>[nishio https://twitter.com/nishio/status/1385789775521538048]: As a rule, things get better and better, so it's [an overgeneralization] to generalize past bad experiences and think they are still bad.
