DX and Agility
>[tokoroten https://twitter.com/tokoroten/status/1385826623451111424]: I think I'm starting to understand why I'm so stuck on the word [DX]. I think the word "digital" does not include the word "[agility]", so I feel that the essence of DX, "gaining agility through software that is easy to change", is not understood by people other than software engineers.

>[nishio https://twitter.com/nishio/status/1385840764366716929]: in low tech companies that can't outsource software, "work hard at [operations]" is more agile than "software updates", so there's no way to get the message across.

>[t_wada https://twitter.com/t_wada/status/1386879871624777736]: .... ...!

>[nishio https://twitter.com/nishio/status/1386896002406240260]: personally, I thought it was "obvious" and I'm surprised the response was unexpected w

>[nishio https://twitter.com/nishio/status/1386898398054215681]: In the world, there are "[companies that cannot outsource software]", "companies where the information system department can tinker with software ([in-house outsourcing])", and "companies where each department can tinker with software There are "companies where each department (even non-engineers) can tinker with the software".
 >[nishio https://twitter.com/nishio/status/1386898496595193856]: "Was this system created by the Information Systems Department?" No, it was created by us, the members of the Personnel and Labor Relations Department.
 	[92% of workers in charge of labor work from home "Business Hacks" from Cybozu's Human Resources and Labor Department - Log Me Biz https://logmi.jp/business/articles/323720]
 >[nishio https://twitter.com/nishio/status/1386899189070667776]: When I see this kind of thing around me, I feel that "companies that can only outsource software changes are slow" is a normal thing, but from the response I've seen on Twitter, it's still not recognized. I'm not sure if it's still recognized by the response on Twitter.

>[tokoroten https://twitter.com/tokoroten/status/1386900020230725638]: That's just because Japanese labor laws are designed on the premise of gaining [agility through personnel transfers], so we have a Japanese-style personnel and labor system, The terrible reality is that you will inevitably be a loser in the use of software, and you will lose just by following the common sense of society.
	[https://gyazo.com/2212ddddfd99ca21a35bf3c5feb2d73d][https://gyazo.com/0cebb3d9368bd19e1b5c034ea602e1c5]
 >[tokoroten https://twitter.com/tokoroten/status/1386901337464393729]: The work rules published by the Ministry of Health, Labor and Welfare are based on the premise of gaining agility through personnel changes
 > Just adopting the "Japanese corporate work style" as envisioned by the Ministry of Health, Labor and Welfare will make you a loser in the use of software.
 	[https://gyazo.com/4fec0e1f74ed0600bd3ab4e5cd42de7d]

>[nishio https://twitter.com/nishio/status/1386901874427580416]: Ah, I see. I wonder if Cybozu's system of "no personnel transfers against the will of the employee" (i.e., supervisors do not have the authority to make transfers) is possible because of the agility provided by the software.
	[Salaries negotiated, bosses have no authority to transfer, too flexible work style at Cybozu｜NIKKEI STYLE https://style.nikkei.com/article/DGXMZO70559580R00C21A4000000/]

>[tokoroten https://twitter.com/tokoroten/status/1386902468089421825]: "IT availability comes and goes" and "there is no place for software talent to move to" was a way of thinking until the 90's. Today, thanks to cloud computing, IT can be deployed anytime and anywhere. Today, thanks to the cloud, it is possible to deploy at any time, IT availability is constant, and software talent can be deployed anywhere.

-----

>[nishio https://twitter.com/nishio/status/1386904354918060033]: it's obvious that companies that outsource software modifications are slow, but I painted a picture of what happens when departments outsource internally to their internal systems departments
	[https://gyazo.com/d2c84209e449d43c9fd7cfa4f4081359]
	>[nishio https://twitter.com/nishio/status/1386905377946488835]: If only 1/N of all employees are capable of updating internal systems, then in a situation where updating needs occur in all departments, the load will naturally be N times as heavy on the information If there are only 1/N people who can update the internal system, then in a situation where the need for updating occurs in all departments, N times the load will naturally be concentrated on the information system. If each department can do this within their own department, the communication costs associated with in-house outsourcing will be reduced.
	>[tokoroten https://twitter.com/tokoroten/status/1386905932756520968]: A true horror story "Why doesn't this system fix so many errors?" I've already made a request to the head office, but the IT department at the head office won't be available until six months from now, so I can't fix it until six months from now.
 >[tokoroten https://twitter.com/tokoroten/status/1386906676767322113]: i would like to talk about domestic violence on a regular basis
 	[NTT's Apr-Sep results show lower sales and profit; docomo and Tozai contribute to profit growth | Nikkei Crosstech (xTECH) https://xtech.nikkei.com/it/atcl/news/16/111103356/]
 	[https://gyazo.com/04316618715446c5a0e2c3428c59b919]
 >[nishio https://twitter.com/nishio/status/1386907251697274886]: too much lol
  > I see... if the group companies are large and there is a rule that you can only use what is within the group, there will be no free competition in the market, so in-house outsourcing will be slower than regular outsourcing.

>[tokoroten https://twitter.com/tokoroten/status/1386909447067369473]: When I hear about Cybozu's HR department building their own system, it reminds me of the story about Facebook hiring programmers for marketing and HR. I don't know how true it is, but it reminds me of the story that Facebook hires programmers for marketing and human resources, otherwise they can't improve their systems.
	[Raion's Lair : Paul Graham, "What Happened to Yahoo" - livedoor Blog (blog) http://blog.livedoor.jp/lionfan/archives/52682119.html]
	[https://gyazo.com/86d8c056de02439920fc124eaf977753]
-----

Regarding "Japanese labor laws are built on the premise of gaining agility through personnel transfers, so simply adopting a Japanese-style personnel and labor system will inevitably make you a loser in the use of software.
>[chachay https://twitter.com/chachay/status/1386916686281027586]: In this arrangement, I think the job system is for people who are particular about the format of documents (but the format is well designed and finely updated with high expertise), and the membership system is for people who have a flexible workflow from a broad perspective (which is covered by the operation). I think it's more like a membership system that allows flexible workflow from a broad perspective (covered by operations)....

>[tokoroten https://twitter.com/tokoroten/status/1386918559545057284]: in a world with extremely strong labor unions, no software, no outsourcing or subsidiaries, I think so!
> The reality is that if you want to get promoted or move into another position, you are expected to go beyond the JD, and if your JD is to create software, you are expected to do all the work involved in that.

>[nishio https://twitter.com/nishio/status/1386924552073060360]: There are two factions: one is the "membership-based employment plus the right to transfer personnel" approach to multi-skilling, and the other is the "job-based employment plus the right to fire" approach to procuring the necessary skills on the market. Cybozu has introduced a membership-based work style with no personnel transfers where there were two factions, and perhaps IT and information sharing are the way to achieve multi-skilling.
	>[nishio https://twitter.com/nishio/status/1386925183471013895]: the HR department is multi-skilled to develop the system. And I'm sure the promotion of voluntary internal transfers and [parallel work] is causing multi-skilling without mandatory HR transfers.
	[Individuals are free to transfer between teams].

>[tokoroten https://twitter.com/tokoroten/status/1386928376762359808]: I've included the fact that Cybozu's HR department is developing their own system by tapping into kintone in my next presentation material for a company's new employee training.


relevance
	[Low speed enterprise]
