Nada School Saturday Lecture 2014 Questions
Questions gathered at the [Nada School Saturday Lecture 2014] that I answered later on my blog. [2014-10-25 blog http://d.hatena.ne.jp/nishiohirokazu/20141025/1414246099]
The service has since moved and ads are now available for free accounts, so I reprinted it here. 2021-04-29

[* Q: Wouldn't it be less enjoyable to read a book if you could easily see the whole novel?]
Yes, I think we need to clarify what the "purpose" of the book reading action is.

When reading a novel, the goal is to enjoy it, right? Therefore, there is no value in reading fast or being able to see the whole picture. On the other hand, if you are reading a technical book, for example, your objective is to "gain knowledge, systematize it in your mind, and apply it. For this purpose, it is valuable to be able to gain knowledge fast and to be able to easily understand and systematize the whole picture.

[* Q: Sure the capitalists benefit, but don't the workers also benefit thanks to the capitalists?"]
Exactly. By using the machine owned by the capitalist, you can produce a lot more value than by working without it, and even if the capitalist takes some of it, you still gain. So workers choose to work that way of their own free will.

There are people in the world who work for a company and say things like, "The company is exploiting me, the company is evil. However, it is strange, because it was you who chose to work for that company of your own free will. Your argument seems to make more sense.

[* Q: If the correctness of a decision is determined by its usefulness, does that mean that the correctness can change later?"]
Yes, that is what I mean.

Correctness in pure mathematics does not change unless the axioms change, so if you have that image, you may be giddy at the idea that correctness can change later. Now let us consider the definition of correctness outside of pure mathematics.

The definition of correctness in natural science also includes "not disproved at this time," so correctness changes when it is disproved. There are many things that were thought to be correct at one time but disappeared when they were determined to be incorrect, such as phlogiston, celestial motion, and the ether. For example, the proposition "noble gas atoms do not form compounds" became incorrect in 1962, when it was discovered that xenon fluoride and xenon fluoride compounded to form xenon fluoroplatinic acid.

Let's consider another example. Let's say you have a deck of 52 playing cards here, and you take one card and lay it down on the desk. You can bet 100 yen that this card is a king. If it is a king, you get $1,500. If not, you forfeit the 100 yen. Now, is it right to bet or not to bet?

Suppose you bet, thinking, "1/13th of a percent, so it's profitable, since it's 15 times better, and you're right to bet." Now, let's turn over one of the remaining cards. Let's say you get a king of hearts. Was it right to bet?

Would you think, "If I have a 3/51 chance of winning 15 times, it's a loss; I made a mistake betting that." Let's turn over the remaining card. Oops, it's the king of hearts again. You said, "Here are 52 playing cards," but you didn't say that they were a deck of cards, one for each card. So, was I right in my bet?

Do you think that since there is no information regarding what and how many cards are in the face-down cards, it is no longer possible to determine by probability calculation whether they are correct or not? Or do you think, "If it were completely random, the probability that the second and third cards happen to match is 1/52, which is very small. Therefore, it is reasonable to assume that it is not random.

Now let's open the face-down card. It was the king of hearts. You have won the bet and now have 1,500 yen. It seems you made the right choice.

If you look closely at the way the word "correctness" is used in this way, you will see that there are many ways of using the word "correctness" that change its correctness when new information becomes available.

[* For emotional value].
	Q: In defining the correctness of a decision, you mentioned "whether or not the decision was beneficial to me". Property and knowledge are easy examples, but even outcomes that leave only emotional pleasure, such as enjoyment or fun, may be beneficial to some people.
	Q: Isn't reason or logical correctness the only factor that determines whether a decision is beneficial or not in terms of correctness? Couldn't emotionalism also determine the rightness of a decision?

This is an astute point. This exploits a weakness in the definition of correctness based on usefulness.

In the lecture, I pointed out the weakness of correctness based on logic and talked about correctness based on disprovability, and then I pointed out the weakness of that correctness and talked about correctness based on usefulness. He then pointed out the weakness of correctness based on usefulness, which he did not mention for the sake of time, but which also has a weakness. The definition of "rightness is determined by usefulness to life" has a weakness in that the definition of "life" is ambiguous. Does it mean that it is advantageous for our survival as a living organism? Does it mean usefulness for social life? Or does it mean that it is useful not only to live, but also to live one's ideal life?

These two points reveal my blind spot. When I gave examples regarding usefulness, there was no mention of emotions because I had not realized their "emotional value". This is a weakness of mine. There have been several times in my life when I neglected my emotions and overloaded myself with tasks to achieve my goals, and eventually my mind would become exhausted and burn out....... I need to be a little more mindful of my emotions.

The next question is also related to the definition of life.

[* Q: Is it not correct that in some cases research is evaluated posthumously because it does not lead to the benefit of the person's life?"]
It is determined by a person's life purpose and the desire to fulfill it.

If he "wants the world to appreciate his research and say, 'Wow, that's great,'" then at the time of his death his choice was not correct. Perhaps he should have chosen a more straightforward topic. Maybe he should have spent a little less time on research and more time on external exposure. Maybe he should have made a sales pitch to a TV station, aiming to appear on a program like "Sekai ichidai uketai jugyo" (The most popular lesson in the world).

If he "wants to know why some things happen," it doesn't matter if the world appreciates the research or not. If he can know, he can die satisfied. If he cannot know, then his choice was not correct. Maybe he should have gone into debt to buy better laboratory equipment. Maybe he should have studied another field to broaden his horizons. Maybe he should have been more open about the information he was researching and sought feedback from others.

If he wants to "solve some problem and make the people around him happy," the people who had the problem will appreciate your research if you succeed in solving the problem. If most of the rest of the world does not appreciate his research, it does not matter to him. His concern is not the evaluation, but whether the people around him are happy. If it didn't work out, perhaps he should have listened to those around him more.

If he wants to "live his life without being bothered by troublesome things and concentrate on his research," it does not matter whether he gets recognition or not. In fact, it would be rather annoying if he is highly evaluated and asked to do an interview. I am not sure how many of these people there are because they are not so conspicuous, but I think that Henry Cavendish and Grigory Perelman are typical examples. If this is Perelman's case, the world appreciated him, but he may see it as a "failure".

Thus, the correctness of the choices he made depends on what kind of desires he has and what his purpose in life is.

[* Q: I can't find a way to use the later completion approach for algebra and other applications, any suggestions?]
I see, this was a blind spot.

Math, especially proof problems, is a test that requires "doing it right without any leaps of logic," so if you get one wrong, the whole thing will be "incorrect," just like a single light bulb in a series that breaks will kill the entire series.

The idea generation is the exact opposite: it is a request to "come up with a variety of ideas, and if any one of them is good, it is good" so that any one of the parallel miniature light bulbs that is out will light up.

So I think it is useful if you are not in the phase of filling in the proofs exactly, but in the phase of finding ideas on how to solve the problem. For example, if you want to find a general solution to something, you could calculate for some specific values and guess what the general solution to the goal would look like.

I know there have been many instances in the history of mathematics where later rigorous theorizing has occurred. A familiar example for high school students would be the Heaviside operator method. When I learned how to solve problems involving calculus in high school physics, I remember thinking, "Why am I allowed to do that?" as I would transform expressions that deviated from the "correct way" that I had learned in mathematics.

The Heaviside operator method was also criticized by mathematicians of the time, who said, "That solution is not mathematically correct at all! He then argued that the correctness of the solution was based on its usefulness.

[* Q: You talk about the importance of "seeing reality without preconceptions" when creating a problem, but isn't it also necessary to check the "ideal"? Is it really worthwhile to bring reality closer to some unjustified ideal?"]
What defines justice or "ethical rightness"? Is it a righteousness shared by others, or is it a righteousness held by each individual? Most people would agree on the simple question, "Is it wrong to kill someone? What about "If I don't kill Mr. A, another 100 people will die"? What if the answer is, "If I don't kill Mr. A, I will die?

Religion may give us a definition of "rightness." However, history shows that many times there have been conflicts between people who believe in different religions. Religion is not a solution.

For example, when you were still young, there was an incident in Country A in which many people died, and the government of Country A, without clear evidence, declared that the culprit was B and asked Country C to extradite B. Country C refused based on their justice, saying, "We will not extradite you without evidence. As a result, Country A started a war against Country C based on their own righteousness, and probably many people died. Which was right?

Country A further claims that "Country D is a country that supports evil" and "Country D has dangerous weapons," and that preventive measures and preemptive strikes are necessary to protect Country A. Based on their own righteousness, they have started a war against Country D. Is this the right thing to do?

In Japan, when I was in junior high school, a religious group caused the death of 13 people in order to stop an "evil that threatened their righteousness". Now, few people would think that this religious group was right. However, there were many highly educated "smart people" in the leadership of this organization. There were at least two Nada alumni, as you can find out by Googling, and both of them must have been smart enough to pass the University of Tokyo's third grade of science in the current school year.

Is there a gap between the fact that these things happened and your understanding of them? If there is, you will need to modify your understanding rather than ignore the facts as exceptions. That was one of the themes of this "how to learn" lecture.

Discussions on justice include a recent class given by Professor Michael Sandel at Harvard University. You might want to take a look at this.

[* Q: Is it also a change of perspective to tweak what people are stating as if it were right?"]
Your tweets have made me aware of many blind spots and accelerated my learning. Thank you very much. It is very profitable to be tsukked.

However, we need to be careful about "tweaking" the information. If we stay in the attitude of "immediately refuting" incoming information, we tend to react with familiar patterns of thinking. You see what the problem with this mentality is, don't you?

The ability to "react quickly to inputs in a fixed pattern" may be useful in center examinations. However, this ability is easily made obsolete by computer automation.

[* Q: Isn't one of the reasons capitalism isn't broken that the capitalists have more social power?"]
Yes, that is one interpretation. That is also an interpretation, that knowledge is capital, and both are difficult to experiment with under different conditions!

There are various approaches as to which interpretation to choose. For example, there is the scientific approach, which says, "Let's make a comparative experiment by examining the differences between different countries. Another approach is the utilitarian approach: "Is it useful for my life? For me, the idea that "knowledge is capital" is useful. The interpretation "capitalists have more power" is not useful to me at the moment, because I can't think of a useful use for it at the moment.

I am concerned that the interpretation that "the capitalists are exploiting the workers and also have the power to prevent a revolution from happening" may have a "negative utility" of decreasing motivation for many people.

[* Q: Isn't there value in knowledge that can be easily obtained through search?]
	Q: With regard to "knowledge that can be easily obtained through search has no value," since it cannot be known without trying to search for it, wouldn't it be valuable to bring it up in conversation so that the listener can obtain that knowledge without having to search for it?
	Q: I think there is value in many ways in being able to immediately speak up and explain knowledge that can be found by searching on Google, in that it is organized in your mind.
	Q: You mentioned that the value of knowledge has decreased because of Google and wikis, but if you can slur out something that is on a wiki, people will think you are great and it will be valuable.

Yes, the value is not zero.

Let's put this in perspective. Let's say you are the owner of a company and you are considering whether to hire more employees. He has a tremendous memory, being able to recite the results of a Google search and the corresponding page on Wikipedia when you talk to him about keywords. But other than that, he is completely incompetent. Would you hire him? If so, how much would you be willing to pay him per month?

That amount is the value to you of the "knowledge easily obtained by search" he has.

[* Q: Isn't there value in the knowledge needed for application?]
	Q: Can't we know the kind of knowledge that can be obtained from a search and then think of something applicable?
	Q: A problem solved by someone else doesn't have much value to society, but it can have value depending on how it's used because it's needed to solve a problem that evolved from it.

That is correct. Sorry, that's what I was trying to convey, but I guess I conveyed it wrong and it was misinterpreted.

What we wanted to convey was "the declining value of 'half-understood knowledge' due to advances in information technology.

Suppose that knowledge P is needed to solve a certain problem X. Mr. A originally knew P in detail, but Mr. B was not familiar with P but knew knowledge R. Mr. C did not even know knowledge R, but after encountering problem X, he searched for it on Google and found the site Q. Mr. C did not even know about knowledge R, but after encountering problem X, he searched for it on Google and found the site Q.

Suppose they could all solve the problem equally well. There is no difference in the value they created. This means that knowing knowledge P and Q is not a differentiator.

Specifically, let's say problem X is "I want to find the shortest path from several branches of a path. This can be solved by using the Dijkstra method, knowledge P. Mr. A can implement the Dijkstra method without looking at anything. Mr. B knew that "Wikipedia, the site Q, has an explanation of the Dijkstra method. This is it. Mr. C doesn't know that either, so he does a Google search for "shortest path algorithm," which doesn't lead directly to Wikipedia, but does find new keywords like "shortest path problem," "Dijkstra," "graph," "routing," and so on. Trial and error with a combination of keywords will lead you to the Wikipedia explanation rather quickly.

What creates value here is not knowledge of the Dijkstra method itself. The source of value here is not the knowledge of the Dijkstra method itself, but the knowledge of how to determine if this problem can be solved by the Dijkstra method, the knowledge of how to read and understand the Wikipedia explanation (and sample code), and the knowledge of the methodology for finding a solution. Value is moving into a more meta domain.

As explained during the lecture, it is not possible to learn only this type of meta knowledge directly, so it is necessary to learn specific knowledge. However, even if we collect a lot of concrete knowledge, it will only be "half-baked knowledge" and its value will be lost rapidly in the future. The goal is not to collect a lot of half-baked knowledge, but to collect enough for abstraction and to gain meta knowledge through abstraction. If we do not aim for this, we will not be able to obtain knowledge that creates value.

[* Q: What is the rationale for "knowledge is capital"?]
It is an observed fact that "there is a salary gap between new graduates and mid-career workers." In other words, new graduates and mid-career workers "have" something different, and this difference leads to a difference in economic output in the form of a "salary gap. What you call this is just a way of labeling it, so if you don't agree with it, you can name it something else yourself. I interpret this as "there is a difference in 'knowledge' between new graduates and mid-career workers, which is 'capital' because it leads to a difference in economic output.

[* Q: I know it is often said that "the leader makes the final decision", but even leaders do not have all the knowledge. I would like to see this happen less."]
I understand the sentiment, but just as "the correctness of the final decision" is a value, so is "time". A council takes more time than a dictatorship. Whether or not it is reasonable to consume "time" to obtain the "correctness of the final decision" depends on one's personal values.

[* Q: Is being "right" in life a good thing? If it's a good thing, wouldn't it contradict the statement that "success stories are an obstacle to changing ideas?"]
In situations where the success experience is an obstacle to changing ideas, we believe that choice X was "right" in the past. In fact, humans have a tendency to "self-justify," to believe that past choices were right. This state of affairs undermines the opportunity to learn something new. If the opportunity loss exceeds the benefit gained from choice X in the past, it would appear to a calm person looking at him that "choice X was not right. So even in that state he still believes that "choice X was right".

If you want to do something about someone who is in such a situation, it is not a good idea to insist that "choice X was not right". It will only create an emotional backlash because the past cannot be changed. In a situation like this, it is better to focus on the actual OR potential future losses and move them toward thinking about what they can do now to avoid them.

In this lecture, too, I did not insist that "it was a mistake for you to enter the Nada School," but rather I made you focus on the possible future losses that could result from this and suggested a different way of learning than the one you are accustomed to in order to avoid them.

[* Q: Is the option of not acting beneficial or futile?]
It depends on the cost of the action and the return obtained. Even if the cost of doing it all is high, you may have the option of doing a little bit to try it out and stop if it doesn't work. In this case, you can try a little first to gain "knowledge" of the level of return, and then decide whether or not to go ahead with the project in earnest. This is an example of the "small and fast PDCA cycle. Considering all these factors, I think there are very few cases where "not taking action" is the best option.

[* Q: You used Shogi as an example of "thinking only in your head", but Shogi is difficult to understand because it involves anticipation only in your head].
Yes, that is true. So it is easy to convince people who are not strong chess players because they are not good at reading only in their minds, while strong players train their ability to think only in their minds and win by doing so. It certainly wasn't an appropriate example.

[* Q: You talked about abstracting and looking at things from a deeper level, and I was wondering if it is possible to deepen the abstraction further to create knowledge (wisdom?) that can be applied across fields. I was wondering if it is possible to further deepen abstraction to create knowledge (wisdom?) that can be applied across fields].
I think that is philosophy. This time it was "What does it mean to be 'right'?" but it is knowledge that is relevant regardless of the field, such as "What is 'knowledge'?

[* Q: I thought that way we could solve the problem without using other people's opinions and be superhuman].
Hmmm, I'm not sure. I think it is beneficial to become a superhuman as a personal discipline, but I feel that between the cost of becoming a superhuman and the cost of interacting with others, the former is more expensive and the strategy of interacting would be more beneficial economically.

[* Q: The part about the dipstick and bottom-up/top-down was interesting and I'll look into it myself].
You didn't mention references. I recommend "Idea Method," "Sequel to Idea Method," and "Exploratory Studies of 'Knowledge'" by Jiro Kawakita.
Or you may want to read the lecture I gave at Kyoto University Summer Design School, which explains the contents of this book, as a first step. http://nhiro.org/kuds2014/

I made note of two related questions to myself, answered on 2021-04-29.

[* Q: Is "the problem is outside of me" correct?]
Inside or outside" is the wrong question because the gap between the "reality" outside of you and the "ideal" inside of you is the "problem.

[* Q: Is it correct that "you should solve it on your own?"]
It is not unconditionally right. Using the power of others is an option. Narrowing the options takes us away from the optimal solution.

Often the "cost of using someone else's help" outweighs the cost of "doing it yourself." In these situations, it is better to do it yourself.
There is a misconception that "sharing the workload reduces the burden on one person." The burden is not necessarily reduced because the cost of communication increases when there is more than one person.
