Unexplored is not an ideas contest.
from [Thought Node 2021 Unexplored Junior].
[Unexplored Junior] is not an [Idea Contest
>[nishio https://twitter.com/nishio/status/1387956750259609602]: It's easy to take for granted that Unexplored Junior is not an idea contest (and neither is Unexplored) because all Unexplored Junior mentors are Unexplored graduates. but it needs to be repeatedly communicated to the world. Proposers need to realize their ideas on their own, and proposals that do not describe how to realize them are very unlikely to be adopted.

>[nishio https://twitter.com/nishio/status/1387957626432937989]: In the world, there are contests called "idea contests" where you are evaluated only on your idea and not on whether or not it can be realized. For example, you can get 100,000 yen just for the idea of "dividing a keyboard into blocks that can be freely recombined" (personal story).

>[nishio https://twitter.com/nishio/status/1387962562638073856]: It was 20 years ago, so it's a bit fuzzy, but as I recall, I got 100,000 yen in book coupons for suggesting that "the blocks have Lego block-like protrusions on the sides, which act as electrodes, and can be reassembled to make any arrangement. I received 100,000 yen worth of book coupons for my proposal. If that application were to come to Junior Unexplored, I would ask, "Have you made a prototype of that mechanism? How big is it? I think he would ask, "How big is it?

>[nishio https://twitter.com/nishio/status/1387964028303994881]: personally, if I had unlimited resources, I'd like to say to the people in the first half, "Great, great, let's go ahead and make it," but only a limited number of people can adopt it. It's a game, so the higher the level of other proposals, the higher the hurdle for everyone. This is not an option, so we have to create a new one, just like we created Unexplored Junior against Unexplored.

>[nishio https://twitter.com/nishio/status/1387980167419625480]: If we apply the "solve problem Y with means X to make customer Z happy" royal road pattern that dimly emerged when looking at 100 applications, this is (2) "lacks the means" pattern. This is unlikely to be adopted. On the other hand, there are cases of adoption of patterns (3) and (4), so I wonder what the difference is.
[https://gyazo.com/49bab0d3ae47051bc0d6e600467cbe19]
