Early failure is beneficial.
>[hiroki_daichi https://twitter.com/hiroki_daichi/status/1388253385065852928]: Principles such as Agile have become difficult to understand when they are explained in terms of "speed and agility" because of the meaning of those words. The key principle in software development is "Fail-Fast", and the principle of static typing, automated testing, chaos engineering, scrum development, and product management is "fail early".

>[nishio https://twitter.com/nishio/status/1388325192997294082]: Per "trying new things may cause you to fail" and "[failure is] an opportunity to learn and is beneficial", "doing things fast that don't fail It is not possible to learn from doing many things that are not new. It's obvious, but it's hard to get this across to people who are convinced that "failure is bad.

>[nishio https://twitter.com/nishio/status/1388326009510850562]: Even if we tell people that "failure is not evil, but rather beneficial" as an obvious fact, they will not be able to adapt to the new interpretation, saying "I'm saying this as a consolation to those who have failed, and of course it is better not to fail. It is better not to fail, right?" and they cannot adapt to the new interpretation. This is the kind of trap we fall into when we take unwritten intentions into our own hands.

>[nishio https://twitter.com/nishio/status/1388326303321915393]: my own learning is hindered by the "intentions" I have created on my own.

Related to [why self-mutilation is a bad idea].
Assumptions that others speak up to take care of their feelings
Image of dialogue

>[hrjn https://twitter.com/hrjn/status/1388431687428632580]: I agree that there are lessons to be learned in failure, but success should provide more valid insights. I think the basics are better if you are doing things fast that don't fail, though I assume you are doing things that are worth doing in the first place. For example, when learning from history. twitter.com/nishio/status/...
	>[hrjn https://twitter.com/hrjn/status/1388433023742349313]: I think we are basically talking about having meaningful achievement goals and how to approach those achievement goals. We think about maximizing returns while reducing risk within a given set of resources, but I was wondering if it's a question of which resources are more expensive: resources lost through failure or resources learned from history.
	>[hrjn https://twitter.com/hrjn/status/1388434862374219776]: I think it is easier to learn from failure as a way of working, because the situation at hand has some unique background, and even if you learn from history, you can't apply it as it is, and it is usually faster to do it. In most cases, it is faster to just do it.
	>[hrjn https://twitter.com/hrjn/status/1388435201362206720]: It is easier to understand history if you do it and then look back at the history after you understand what is in it. If you try to do it exhaustively from the beginning, you will usually end up not understanding it well or missing a lot, so I don't recommend it.
>[nishio https://twitter.com/nishio/status/1388440511002779650]: In the first half, the condition was "If you try something new -" so the conclusion should have been "You can't learn 'about new things' by doing things fast enough that you don't fail. You missed the part where it should have been "You can't learn 'about new things' by doing things fast that don't fail". [Fools learn from experience, wise men learn from history.]
