智能化戦争
[https://gyazo.com/51f4bf4306146044b25e9ea092cee0e6]
	Chinese Military Watch "People Friendly" New War Intelligent Warfare
	[Amazon https://amzn.to/3e7zvGg]
	Introduction: Here is a new Chinese concept of warfare, following "[super limited warfare]".
	Hongliang Hou (Author)
	 He is an associate professor at the National Defense University's School of National Security Studies, a doctor of strategic studies, a major (equivalent to senior colonel), a core member of the 3rd Excellent Chinese Youth Education and Research Program of the National Defense University of China, a member of the Chinese Society for Artificial Intelligence, and a special guest on the TV program "Kouwudou". 2004 published his academic book "The Intelligent War". 15 military projects he has led or participated in. He has published more than 20 papers in important domestic and foreign military publications.
	In the future, wars will not be fought over the strength and performance of weapons, but over algorithms."


　The death of so many people in retaliation for nuclear attacks has deterred wars until now.
　If unmanned weapons become mainstream, people will not die in wars.
　　No combatants are taken prisoner or killed.
　　Political costs of war go down.

　In the past, each soldier was a unit of information processing.
　With the creation of long-distance, real-time information transmission methods, it has changed to a form where information is exchanged closely with the central command center and they work as one.
　Increased amount of information collected due to improved sensors, etc.
　　通信帯域の問題
　　Problems that human processing capacity cannot keep up with even if they are gathered in a centralized location.
　Software will support human information processing
　　The difference in algorithm capability increases the number of drones that can be handled simultaneously by one person and the amount of data that can be used to make decisions.
　　In this era, the "weapons capability gap" will be dominated by the algorithmic capability gap.

era of zero fatalities (injuries)
　In the 1999 Kosovo conflict, there were zero casualties on the U.S. side.
　The idea of zero casualties is gaining traction.
　　[flesh and blood] to fight enemy robots and cause casualties because of the high political cost.
　Wars are waged between opportunities."
　Conquest and occupation are prone to casualties.
　　Is occupation necessary to achieve political objectives?
　　It is less expensive to frustrate the enemy's will directly.
　　　Example: Killing of Bin Laden
　Scenario:[remote assassination].
　　Assassination by drone with no evidence left behind.
　　[public opinion battle]
　　>Remote assassination operations directly address policy formulators, plan executors, and military commanders to quickly achieve strategic objectives and deliver a swift and powerful shock to those involved. While this makes remote assassination operations highly intimidating, the method can also lead to backlash and anger in the target country, potentially leading to further radicalization of domestic policies. In order to avoid this unfavorable situation, it is common for those who carry out such operations to use public opinion campaigns to damage the legitimacy of the current regime's leaders, and only conduct remote assassination operations when the public has come to despise them.

Swarm Operation
　Operations with large numbers of small drones
　　Easy to circumvent conventional defense systems
　　Easier to maintain herds when individuals are destroyed

[nishio.icon]
 It says "human friendly war" where people don't die, but it's the side of the advanced nations with high technology that doesn't die, and the other side is assassinated by drones and dies.
 　It's not so much "people-friendly" as "people-friendly."
 　Well, but is it "head count-wise" kinder to have only important people assassinated than to sacrifice a lot of civilians?
 　Fukushima Mizuho tweets in 2019
			>[https://twitter.com/mizuhofukushima/status/1125325969189789696 @mizuhofukushima]: The House of Councillors' Cabinet Committee is discussing a bill to revise drone regulations. Drones have played a very large role. They have been able to get images of what is happening in Takae and Henoko beyond the fence of the US military bases. This is being made impossible. This is totally ridiculous.
			関連 [重要土地規制法案に対する抗議]

 If the major powers go to war with each other, retaliation with nuclear weapons is still a bad idea, so they will kill each other without being detected, like a remote assassination scenario.
 　The Defense Department's white paper calls it [a gray zone situation].
 　Mentioned in [superfluous warfare].
 　They might not mind doing it against a country like Japan that doesn't have the nuclear retaliation capability.

 It is interesting that there is a name for creating a convenient public opinion on social networking sites: "[public opinion warfare]" (yōronron sen).
　You are assuming that the war is waged by a "state," but if you have the money and technology of, say, Google, you could have the same remote assassination capabilities as a state, so the war could be waged by a corporation.
　　I think they are better at fighting public opinion using social networking sites than the military.

Two years ago I watched a Chinese robotics competition [where the shooting performance of the drone was the deciding factor in winning the robotics competition] and thought it was cool that technological innovation was being recognized, but then I read this book and thought that this technological innovation is directly related to military power.
　[軍民融合]政策
