2020 White Paper on Defense of Japan
[Ministry of Defense and Self-Defense Forces: White Paper on Defense https://www.mod.go.jp/j/publication/wp/]

Characteristics of the Current Security Environment p. 41
 Increased uncertainty over the existing order and the emergence of political, economic, and military competition among nations
		Occurrence of complex responses to "hybrid warfare"
	 Prolonged gray zone situation
 Evolution of technology has a major impact on security
	 Importance of space, cyber, and electromagnetic areas
	 Game-changing technologies (artificial intelligence, hypersonic technology, high-power energy technology, etc.)
 Security issues that are difficult for one country to address alone have emerged.
	 Ensuring the stable use of new domains such as space and cyber, ensuring maritime transportation security, countering the proliferation of weapons of mass destruction, and countering international terrorism
New coronavirus infections are having a variety of effects and restrictions on the military activities of various countries, and it is necessary to pay attention to these effects and restrictions.

United States of America
	Creation of the Space Command as the Unified Combatant Command and the Space Force as the sixth military type within the Air Force Department (the first new military type created in about 70 years since the Air Force was founded).
　　About 15,000 people are expected (p. 54)
	　　>The creation of a Space Force will fundamentally shift space efforts from combat support to the realm of competition and combat.

China
	Continuously increasing defense spending at a high level without transparency, with the goal of making China's military a "world-class military" by the middle of the 21st century. Extensively and rapidly strengthening the quality and quantity of its military power, particularly its nuclear and missile capabilities and maritime and air power. In doing so, emphasis is also placed on strengthening operational capabilities to ensure information superiority, as well as capabilities related to the space, cyber, and electromagnetic domains
 These enhancements will lead to the building of an "A2/AD" (Approach Detention/Area Denial) capability and the ability to conduct operations at greater distances.
 Fully promote a policy of military-civilian fusion that aims to combine military and civilian resources in various fields, and actively promote the development and acquisition of advanced technologies that can be used by the military and the improvement of operational execution capabilities
 Regarding global military trends, the report states that "intelligent warfare is taking shape for the first time," and that the military's use of artificial intelligence and other initiatives

Space domain P.169
 Major countries are upgrading the capabilities and launching various satellites to enhance C4ISR capabilities, etc.
 Countries promote the use of space to maintain their own peace and security in space. In addition, China and Russia have indicated that they are strengthening their ability to interfere with the use of space by the U.S. and its allies
 In response to these threats, countries are reorganizing their military space organizations
Cyber domain P.174
 As militaries become increasingly reliant on information and communications networks, many foreign militaries recognize cyberattacks as an asymmetric means of attack that can disrupt enemy military operations at low cost and are developing offensive capabilities in cyberspace.
 China and Russia indicated that they are strengthening their cyber attack capabilities as militaries to disrupt other countries' networked forces and destroy infrastructure.
 Cyber-attacks against information and communication networks of not only government agencies and military forces but also private companies and academic institutions in other countries are frequent. Critical technology, confidential information, and personal information have been targeted in some cases.
Electromagnetic wave area P.180
 Securing the use of electromagnetic waves is essential for the operation of communications and radar equipment. Major countries recognize that jamming the use of electromagnetic waves (electronic attack) is an asymmetric means of attack that effectively prevents the enemy from demonstrating its capabilities
 China conducts regular training in the form of counter-measures to ensure effective mission execution in complex electromagnetic environments, improving real-world capabilities.
 Russia has been using multiple electronic warfare equipment in eastern Ukraine and Syria to improve its electronic warfare capabilities, including jamming the command and control and radar of its opponents, according to the report.
New coronavirus infection p. 183
 The challenges posed by the new coronavirus infection are not limited to mere sanitation issues, but also affect the overall socioeconomics of each country, including supply chain vulnerabilities and the severe impact on local economies, leading to fears of a prolonged global economic slowdown.
 Each country is making efforts to cope with the disease in their own countries by utilizing their military's sanitary functions and transportation capabilities, as well as contributing to the prevention of the international spread of the disease. On the other hand, the military activities of each country have been affected and restricted in various ways, such as the cancellation or postponement of drills and joint exercises. If the spread of the disease continues for an extended period of time, it could have a variety of effects on the military posture of each country.
China and other countries are actively dispatching medical experts and providing medical supplies to countries where the infection is spreading, and it has been pointed out that they are also engaged in various propaganda efforts, including the spread of false information, triggered by the social unrest and confusion that has accompanied the spread of the infection.

P.41
>National competition is a regular occurrence through a variety of means, including the use of military and law enforcement agencies to threaten the sovereignty of other countries and the use of social networks to manipulate public opinion in other countries.

>What are "[gray zone situations]" and "[hybrid warfare]"?
> The so-called "gray zone situation" is a straightforward description of a wide range of situations that are neither purely peacetime nor contingency.
> For example, a situation in which two nations have conflicting claims to territory, sovereignty, and economic rights and interests, including those of the sea, and at least one party attempts to change the status quo and force acceptance of its own claims and demands by, for example, frequently demonstrating its presence in the area in question using forceful organizations, etc., to the extent that such actions do not constitute armed aggression. This is a situation in which at least one party attempts to change the status quo by using forceful organizations, etc. to demonstrate a frequent presence in the area in question and to force acceptance of its claims and demands.
> So-called "hybrid warfare" is a method of changing the status quo that intentionally blurs the boundary between military and non-military, and such a method forces the other side to deal with complexities that go beyond the military aspect.
> For example, we believe that methods using a combination of influence operations such as operations using unknown units with concealed nationalities, sabotage of communications and critical infrastructure through cyber attacks, and dissemination of false information via the Internet and media fall under the category of "hybrid warfare". It has been pointed out that these methods are intended to delay the military's initial response and make it difficult for the other side to respond, as well as to deny the country's involvement by taking measures that are not clearly recognized as the "use of force" in appearance.
> As part of the emerging competition among nations, gray zone situations tend to persist for a long period of time through various means, including "hybrid warfare".
In particular, Japan has a policy of "exclusive defense" in which the minimum necessary defense force is used only in the event of the "use of force," making it difficult to move against something that is ambiguous as to whether it is the use of force or not.

>The current state of combat combines not only land, sea, and air, but also new domains such as space, cyber, and electromagnetic waves.


P.57
>In the National Defense White Paper "China's National Defense in the New Era" published in July 2037, it is stated that "intelligent warfare (智能化) is appearing for the first time" in terms of global military trends, and the Chinese military's efforts to utilize artificial intelligence (AI) are attracting attention.
[The War on Wisdom]

P.57
>What is "military-civilian fusion"?
> The integration of the military and civilian sectors is an initiative that China has been promoting as a national strategy in recent years. In addition to the conventional defense mobilization system designed for emergency situations, it is said to promote the military use of civilian resources and the conversion of military technology to civilian use on a regular basis, not limited to emergency situations.
> In particular, efforts in what are considered "emerging areas" for China, such as maritime, space, cyber, and artificial intelligence (AI), have been identified as priority areas for military-private sector integration.

>China is believed to emphasize not only physical means but also non-physical means in its military and warfare, with "public opinion warfare," "psychological warfare," and "legal warfare," known as the "three wars," as the military's political maneuvering items.

P.68
>China has stated that "outer space and network space are new strategic competition points for all sides," and it is believed that China recognizes the importance of protecting its own information systems and networks in times of conflict, while neutralizing the information systems and networks of its enemies and gaining information superiority. It is believed that they recognize the importance of protecting their own information systems and networks while neutralizing the enemy's information systems and networks to gain information superiority.

P.166
>The U.S. Air Force acquired a laser-based anti-UAV system in 2037, and in the Persian Gulf in 2002, the U.S. successfully tested the LaWS, a 30 kW class shipborne solid-state laser weapon capable of dealing with small UAVs.... It has successfully neutralized flying UAVs.

P.167
>In addition, in August 2004, China launched the world's first satellite "Sumiko" to experiment with quantum cryptographic communications. In January 2006, the world's first long-distance communication between China and Austria was successfully achieved through quantum cryptography communication using "Sumiko".

P.169
>China, Russia, and others... It is believed that they are developing anti-satellite weapons to take out the functionality of a target satellite by bringing a satellite attack satellite (a so-called "[killer satellite]") close to the target satellite and capturing it with an arm.

P.175
>In December 2006, the United States and other countries announced that APT10, a cyber group associated with China's Ministry of State Security, had conducted cyber attacks targeting intellectual property and other assets in at least 12 countries.
>Widespread APT10 Attacks Confirmed in Japan, Targeting Private Corporations, Academic Institutions, and Other Organizations

P.180
>Activities conducted using the electromagnetic field include electronic warfare and electromagnetic wave management, and the means and methods of electronic warfare are generally classified into three categories: "electronic attack," "electronic protection," and "electronic warfare support.

>In the vicinity of our country, TU-154 intelligence-gathering aircraft and Y-8 electronic warfare aircraft have been confirmed to have flown over the Nansei Islands area and the Sea of Japan.

P.185
>The spread of new coronavirus infections may further manifest the strategic competition among nations to form an international and regional order favorable to themselves and to expand their influence, and therefore must be watched with serious concern as a security issue.
