public opinion poll
One of the missions of the Chinese People's Liberation Army

It reads "Yoron Sen."
	In today's Japanese Kanji, it's "[public opinion warfare]."
	>Public opinion: the reputation of a company in the public eye.
		>"Se-ron" was originally read as "Se-ron, Se-ron" and is a word that differs in origin from "世論", but since "輿" was eliminated from the standard script due to postwar Japanese language reform, the meaning is compatible and "世" becomes "yo" in kun-yomi, so the sound "yoron" is also inherited. [輿論 - Wiktionary Japanese version https://ja.wiktionary.org/wiki/%E8%BC%BF%E8%AB%96]

> Political Work Regulations of the Chinese People's Liberation Army
> On December 5, 2003, it was amended to specify that the Liberation Army be given a "three warfare" mission.
>The "public opinion war" is intended to build public and international support for China's military actions and to influence domestic and international public opinion to ensure that its enemies do not pursue policies seen as contrary to China's interests.
[Political Work Regulations of the Chinese People's Liberation Army - Wikipedia https://ja.wikipedia.org/wiki/%E4%B8%AD%E5%9B%BD%E4%BA%BA%E6%B0%91%E8%A7%A3%E6%94%BE%E8%BB%8D%E6%94%BF%E6% B2%BB%E5%B7%A5%E4%BD%9C%E6%9D%A1%E4%BE%8B]

>Remote assassination operations directly address policy formulators, plan executors, and military commanders to quickly achieve strategic objectives and deliver a swift and powerful shock to those involved. While this makes remote assassination operations highly intimidating, the method can also lead to backlash and anger in the target country, potentially leading to further radicalization of domestic policies. In order to avoid this unfavorable situation, it is common for those who carry out such operations to use public opinion campaigns to damage the legitimacy of the current regime's leaders, and only conduct remote assassination operations when the public has come to despise them.
[The War on Wisdom]

>The Three Fights were adopted in 2003 by the Communist Party of China (hereinafter referred to as the "Communist Party") (2) and the Central Military Commission (hereinafter referred to as the "Central Military Commission") in 2003, and the Ordinance on Political Work of the Chinese People's Liberation Army (3) states that "public opinion warfare, psychological warfare, and legal warfare shall be conducted, and disintegration work (4), anti-psychological and anti-counter-psychological (5) work, military justice and legal service work shall be developed." ("dismantling operations" refers to "organizational disintegration activities," "anti-psychological operations" refers to "countermeasures against psychological attacks," "anti-counter-measures operations" refers to "countermeasures against turncoat operations secretly conducted inside the enemy," and "legal service operations" refers to "work related to law"). The three warfare areas are closely related to each other, and it is impossible to make a clear distinction between them. For example, public opinion warfare provides effective domestic and international arguments for psychological and legal warfare, while legal warfare provides a legal basis for public opinion and psychological warfare. The three battles can be considered part of asymmetric warfare, as they aim to weaken the enemy by using propaganda, which is China's forte. The definitions of each of the three types of warfare are as follows.
> (1) public opinion battle
> Refers to the cultivation of domestic and international opinion with the aim of inspiring a fighting spirit in one's own forces and reducing the enemy's willingness to fight. Media and information resources such as newspapers, books, radio, television, the Internet, and e-mail are used comprehensively. Commonly used tactics include "focused strikes (to influence the decisions of the enemy leadership)" and "information management (to disseminate favorable information while restricting unfavorable information).
Executive School Research Memorandum 3: China's Definition of Three Wars and Other Examples of Three Wars on Air Power Strategic Studies Group [PDF https://www.mod.go.jp/asdf/meguro/center/20_stdy/arpw02/113memo3.pdf]
