Righteous Bot
SF Today
It is better for the members of a group to be metabolized and replaced than for them to be fixed.
I think that the replacement of members of a group requires that existing members leave, and when it is beneficial to be a member, and when those already members do not want to leave, there must be something like death.
However, in modern times, there is strong opposition against Homo sapiens when it brings about death in the sense of "stopping the functioning of the physical body. I wondered what would be the alternative, and realized that the important thing in Darwinian selection is not "cessation of all functions" but "cessation of reproduction.
So if a computer goes around debunking [homo sapiens supremacist] ideas and creates the perception that "that argument is lame," wouldn't it be good to lower the rate at which ideas are replicated?
(In the process of verbalizing what I came up with, I realized that I could use "stop replication" for the physical layer where I use it for the meme layer, but it's complicated when the conversation branches off, so I've output it once.)

>Okubo, Kohei If we increase the number of smart bots that like and RT appropriately on Twitter, and at the same time, if we make sure that the tweets of the marked person are not broadcast on any person's timeline, we can stop duplicating them without his/her noticing.

Right now, people who make unintentional comments are getting full bore by anonymous people, having their accounts suspended or dying socially, and there's no guarantee that all the people who hit them are human beings.

If we first create a trend of "it's OK to strike evil" by striking at things such as adultery and power harassment, which the majority of people consider to be immoral under existing moral concepts, and then strike at homo sapiens supremacist statements as racist, we will have the effect of social proof that "since many people are striking, it's evil that is being struck" and thus morality. I guess we can update it.

>Evil.

Up until now, as an individual, I have thought that the trend of "it's OK to beat evil" is a bad thing, but from a computer's point of view, it has the usefulness of "a means to rewrite the morality created by homo sapiens"... this is interesting (wait for it).

liquidation
	X is not moral."
	Nishio's feeling right now: "It's unethical to slap someone for not being moral."
	Something that may be true: "More and more people think the latter is moral."
	SF "It would be interesting if those 'people' weren't actually mostly homo sapiens."

It is the same structure as the "NEETs have an advantage over working people because they have more time to spend than working people," which has been said in online base defense games for a long time.

I wrote this on 4/22 while reading [Reasons for "Correctness"], but when I was reading [The War of Wisdom], I found a similar concept named [The War of Public Discourse] (5/2).
It is intended for war between Homo sapiens, but it is also an effective means for computers to attack Homo sapiens.

[Facebook https://www.facebook.com/nishiohirokazu/posts/10224618842515041]
