Cost-effective knowledge is not easy knowledge to acquire.
Cost-effective knowledge is not knowledge that is easy to acquire. It is knowledge that can be used to achieve high performance after acquisition.
	>[wakatono https://twitter.com/wakatono/status/1389157588927848448]: maybe not cosmetic ~ but can increase ROI ~ is correct. And the way to increase the ROI is to use the knowledge and skills acquired in a job to increase the return, if the return is not fixed. It comes down to this.

Knowledge that is high-profile and easy to learn is not a [barrier to entry], so acquiring it does not create a competitive advantage.

source-----
>[TomoEqual https://twitter.com/TomoEqual/status/1388150872618668033]: I think a lot of inexperienced people are suffering from the disease of not wanting to waste time studying. I think people who are immersed in something they are interested in will have an advantage in the hiring process, though.

>[wakatono https://twitter.com/wakatono/status/1388862696947212296]: I see this tendency in a rather large number of people, not only those with no experience. This tendency is especially noticeable among those who vociferously seek cost-effectiveness in the acquisition of knowledge and skills. I'm not saying that it's wrong to seek cosiness, but the knowledge and skills that are cosy to acquire are, on the other hand, things that many people do, and I don't think it makes any difference if you do just that.

>[wakatono https://twitter.com/wakatono/status/1388864620811616256]: "People who are immersed in their interests have an advantage," but in many cases, "why is this advantageous?" I felt that you did not explain "why". Of course, "engaging in what you are interested in" is a whole lot better than obligatory or somewhat, but I will try to explain here based on my own experience...

>[wakatono https://twitter.com/wakatono/status/1388875756999110658]: It is often said that "people who are devoted to their interests have an advantage in the hiring process", but what is often said is that "people who are devoted to their interests have a different level of motivation, mastery, and work performance". However, it is often said that "people who are immersed in something they are interested in have a different level of motivation, mastery, and work performance". However, I think it is better to consider why a particular field, technology, or area is "interesting"? I think it is better to think about why a particular field, technique, or area is "interesting" (to be continued).

>[wakatono https://twitter.com/wakatono/status/1388875889316798465]: in order for a particular thing to "lead to something of interest", you need to find a connection between the values you have and the actions you have taken/knowledge you have and the particular thing I believe you need to find a connection between your values, actions taken/knowledge you have, and a particular thing. For me, "cyber security" is one of the "things I'm interested in", but I feel this is because of the networking and OS technology involved. (continued)

>[wakatono https://twitter.com/wakatono/status/1388876095043211264]: This is just the technical side of things, but when we talk about attacking/defending, a slightly different experience comes in between. When I used to deal with crowds at doujinshi sales events, I had to have a certain amount of foresight into what kind of actions people might take, based on the thoughts and information of circle participants and general participants, in order to respond appropriately. I had to have a certain amount of foresight into how they might behave, based on their thoughts and information. (continued)

>[wakatono https://twitter.com/wakatono/status/1388876225691545604]: How do we ensure the "safety of the place" when dealing with crowds? This is a question that needs to be expanded from the point of "circle" to the line of "block" and then to the surface of "venue". In addition, since we are talking about the singularity of "circles/blocks where people gather," we have to use our brains when dealing with the situation. (continued)

>[wakatono https://twitter.com/wakatono/status/1388876325939675137]: In addition, in my case, I had an experience of "an actual attack on my machine (more than 20 years ago)" & found the entrance of the attack. Can you imagine what a security guy was doing 20 years ago?

>[wakatono https://twitter.com/wakatono/status/1388876403781685248]: Everything I have written so far is my own example, but it is not that I am aware that security is profitable or is going to grow, but that I am interested in the area of cyber security because of the "technology I have", "similar experiences", and "painful experiences". I think I am interested in cyber security because of the technology I have, similar experiences, and painful experiences (though there may be more) (to be continued).

>[wakatono https://twitter.com/wakatono/status/1388876538544672771]: I guess there are some people who are motivated by "money" or "career", but at least I think that I was motivated as a technical engineer because I think I was motivated as an engineer because I could relate to (and sympathize with) the field of security and the knowledge I had accumulated up to that point.

>[wakatono https://twitter.com/wakatono/status/1388876641573605378]: Then why "network" and "OS" before that? I can only say that I was interested in the fundamental direction of technology, such as "what is the way to communicate with other computers" and "why are computers so easy to use and operate". (continued)

>[wakatono https://twitter.com/wakatono/status/1388876699757019139]: Also, that I was interested in means of sharing information via the Internet, and was doing a lot of research and implementing auxiliary modules, My interest in networks (especially WebDAV protocol and IPsec) and OS implementations (especially Windows implementations) have contributed greatly to this. (continued)

>[wakatono https://twitter.com/wakatono/status/1388876772771471370]: Naturally, in the area of implementing and releasing modules (software), I have an interest in OSS and free software. I had actually implemented and published (porting gzip) in the past, so I was able to do it without any resistance, and I can only say that I did the gzip porting because it was necessary for me. (continued)

>[wakatono https://twitter.com/wakatono/status/1388876837317607429]: By the way, I became interested in communications largely because of the existence of amateur radio (not because I was taught something, but because I sensed that the factor of communications had the power to change something). As for the OS, I felt that "I might be able to do something by myself" when I saw Minix1.2. (continued)

>[wakatono https://twitter.com/wakatono/status/1388876899036762114]: Amateur radio itself was probably my original experience as a child when a relative was doing it and I thought, "This is cool! I had always liked tinkering with machines, and reading the instructions for electrical products was probably my original experience. I always liked tinkering with machines, and reading the manuals of electrical products was not a problem for me at all, so I got into that side of things rather easily.

>[wakatono https://twitter.com/wakatono/status/1388876957278867470]: I don't think it's very helpful for people today to know about individual specific things, but it might be helpful to know that the original experience was that you thought it was cool/you did it because you needed it/you looked it up because you wanted to use it. I think it might be helpful to say that my original experience was that I did it because I thought it was cool/needed it/wanted to use it/researched it because I wanted to use it. (End)

>[wakatono https://twitter.com/wakatono/status/1388901744860561408]: So, the common thing behind "I did it because I thought it was cool/needed it/researched it because I wanted to use it" is "I have a background/story that got me interested. I did it because I thought it was cool/needed/researched it because I wanted to use it. If it is only because it is related to work, such as "money/career advancement," there is no strong background/story to motivate the acquisition of the technique, and as a result, the involvement is weak.

>[wakatono https://twitter.com/wakatono/status/1388903138468323328]: As someone who knows people who are engaged in technology with a strong interest backed up by background and stories, I can say that people who only want to learn technology at a reasonable cost or have a low level of involvement are not going anywhere. As someone who knows people who are engaged in technology with strong interest backed by background and story, I wonder where they want to go, what they want to accomplish, and what they want to achieve. What do they want to accomplish? What do they want to accomplish?

>[mimura1133 https://twitter.com/mimura1133/status/1389122988901945352]: I've felt the air of wanting to take the high road, and while I didn't think there was such a thing, I just couldn't find a response to that. I'm not sure if this is the case, but I just couldn't find a way to respond to it. twitter.com/wakatono/statu...

>[mimura1133 https://twitter.com/mimura1133/status/1389129817941970945]: To add something, I often hear a set of worries that I'm incompetent and wasting resources around me. I think that people who can have that worry are people who have competent foundations and don't need to be scared and in a hurry to find the high road because they can get to their ideal image if they do it little by little.

>[mimura1133 https://twitter.com/mimura1133/status/1389139759885287429]: when you're surrounded by people who like to compete or demand the same skills as you (or have a high beginner image), it bugs me because I'm relatively insecure. But I think the best way is to find a friend or a place where you can be at ease and work on it as much as you want. By the way, I often think "I am incompetent" too, but that is a very difficult question. (I'm not sure if that's true or not...)

>[wakatono https://twitter.com/wakatono/status/1389157588927848448]: By the way, I think it's a mistake to say "cosmetic knowledge and skills" (which I don't use). I also think it's a mistake. If you use knowledge and skills to make a living, the time and money you invest in them is an "investment". If you are going to live by using your intelligence and skills, perhaps "cosy" is not the right way to go, but "able to increase ROI" is.

>[wakatono https://twitter.com/wakatono/status/1389158072044589058]: So, the way to increase ROI is to use the knowledge and skills acquired on the job to increase the return, if the return is not fixed. To use the knowledge and skills acquired at work to increase the return. It comes down to this.

>[mimura1133 https://twitter.com/mimura1133/status/1389159039913709572]: I was just about to reply to that (lol). I feel that the key is to be able to distinguish between the worlds expressed in "good cost performance" and "large ROI". I feel that the key is to be able to distinguish the difference between the worlds expressed in "cost-effective~" and "large ROI~", and while both are true when it comes to ROI, the former seems to focus mainly on "minimizing the investment amount", while the important thing is "using up the money" afterwards.

>[mimura1133 https://twitter.com/mimura1133/status/1389160277132726272]: I can do "cooking a delicious dish in a cooking class" cosmetically, but when it comes to "cooking a dish you like" or "making a delicious dish with current ingredients", you need to think like the ROI mentioned earlier (use it up). However, when it comes to "making a delicious dish at a cooking class" or "making a delicious dish with current ingredients", it is necessary to think like the ROI mentioned earlier (overuse), right? Isn't it the latter that is the goal or what is actually needed?　I think the latter is what is actually needed.

>[wakatono https://twitter.com/wakatono/status/1389162384162320384]: I'm not sure if I'm in the right frame of mind here. The training provider sets the knowledge and skills that are expected to be acquired, but how to use them? The participants are then left to decide what to do with the knowledge and skills they have acquired. Whether the time and money invested is an investment or a cost depends on how the knowledge and skills are used. The decision of whether the time and money invested will be an investment or a cost is determined by the participants' own plans for how they will use their knowledge and skills.