Hatena2009-10-15
code:hatena
 <body>
 *1255605080* Number of reported cases of influenza
 Is it more than in the past? What do you think? I wondered, so I looked into it.
 
 Data from the National Institute of Infectious Diseases for the past 10 years (http://idsc.nih.go.jp/idwr/kanja/weeklygraph/01flu.html)
 
 <img src="http://gyazo.com/8de98f96e74bdc846aada5f86b99d2da.png">
 
 Not many people infected yet, but the epidemic is starting very early compared to the past 10 years! We are about 3 months ahead of schedule! I didn't know there was such a clear difference. I was surprised.
 
 *1255636108*Leverage memo: innovation dilemma
 <a href="http://www.amazon.co.jp/gp/product/4798100234?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=4798100234">The Innovation Dilemma&#8212;When Innovation Destroys Giant Corporations (Harvard business school press)</a><img src="http://www.assoc-amazon.jp/e/ ir?t=nishiohirokaz-22&l=as2&o=9&a=4798100234" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px ! ;" />
 
 **Preconceptions before reading
 In short, you said, "If you had asked the customer what he wanted, he would have said he wanted a fast horse (instead of a car)."
 
 **Leverage notes & thoughts after reading
 It was totally different from my preconceived notions.
 
 There are cases where the performance of a new product does not overtake that of an existing product, but the market is still taken away from it. See the figure on p. 10 for why this phenomenon occurs. Some people have commented that the figure is incongruous, but <strong>this figure was scanned and quoted from this book, so if this figure contradicts your understanding, then your understanding is wrong. </strong>
 
 <img src="http://gyazo.com/776b40f02a9c45c3fa093dc0fc444c32.png">
 
 A product that has the advantage of low price compared to existing products and the disadvantage of low performance will take over the market for existing products as technological advances lead to a situation where "performance is low, but it is sufficient for my needs".
 
 If the advantage is not limited to "low price", this kind of example would be possible. Scripting languages have the advantage of "ease of use" and the disadvantage of "slow speed" compared to existing C and other languages, and when they first appeared, the slow speed was a problem and not adequate for most needs. However, as computers became faster with the advancement of technology, the market share increased greatly because "this is sufficient for my needs," even though the disadvantage of being "considerably slower than C and other languages" has not changed.
 
 The reason why companies allocate costs for continuous improvement beyond customer needs is that it is easy to make the decision to allocate costs to those needs because they know that there are customer needs. However, if they do this repeatedly, they will become more and more sophisticated in the form of accepting the demands of existing customers, resulting in excessive quality, and then they will be replaced by cheaper, lower quality products.
 
 **Addendum to the above, as I received a tip from a certain MOT member.
 
 It is important to note that "the two arrows in the graph are based on the same technology" in order to call it a disruptive innovation. Because a phenomenon that is not so "a product with disadvantages based on a different technology from existing products came out and took market share by overcoming the disadvantages to the extent that the technological progress could meet the market needs" is simply an innovation. 3.5-inch HDDs had been used in the previous more The same is true of SSDs, which initially had low capacity and were unusable, but technological advances made them usable. However, this is not a disruptive innovation because it is not based on the same technology.
 
 The novelty of Christensen's paper is that "a mere degraded version based on a technology common to the conventional version displaces the performance-enhancing conventional version due to advances in the base technology. Innovation occurs even in the absence of groundbreaking technological innovation.
 
 He said that innovation happens without groundbreaking innovation! I finally understood what the interesting point of this book was.
 
 **addendum
 
 It seems to me that the latter half of Christensen is claiming that this is an example of something that goes against his own definition of "disruptive innovation".... Also, the term innovation was first defined by <a href='http://ja.wikipedia.org/wiki/%E3%82%B7%E3%83%A5%E3%83%B3%E3%83%9A%E3%83%BC%E3%82%BF%E3%83%BC'> Schumpeter</a>, and ever since then innovation has been a much broader concept, not just innovation. I am going to read Schumpeter's book this time before I read Christensen's other book.
 </body>

[Hatena Diary 2009-10-15 https://nishiohirokazu.hatenadiary.org/archive/2009/10/15]