Hatena2009-03-16
code:hatena
 <body>
 *1237206464* AIST: Press Release Successful development of a robot with human-like appearance and motion performance
 http://www.aist.go.jp/aist_j/press_release/pr2009/pr20090316/pr20090316.html
 
 <img src="http://gyazo.com/fe7028d82dc7f3b3f90be83690abed15.png"><img src="http://gyazo.com/712fdbf62f106a4337a01f038eaf92d1.png">
 
 If today were April 1st, I would be convinced that it was April Fool's Day. This is not just a composite of faces.... It's not just a petite girl wearing a robot-like costume.... It seems that the times are moving faster than we can imagine.
 
 When the <a href="http://gyazo.com/b645f9178310ab62b6af8f8bc85ca45f.png">Actroid</a> came out, I thought it looked realistic, but when I saw the real thing, its movements and posture were awkward and unnatural. This one looks very flexible. I'll have to go see the real thing.
 
 *1237215298*Housekeeping
 Boiled 3 liters of beet tea; at 24:00 I have 3 liters (amount of water before boiling) + 1 250cc plastic bottle + a bit of stockpile. Find out how many hours this will be consumed.
 
 <hr>
 Phew. Took out the burnable trash. I didn't get much done today, but it's important to think, "There will be days like that.
 
 
 The repair of the water leak was completed. As it turned out, the base of the faucet was corroded and could not be fixed by replacing the gaskets or other parts. I wondered why there were pieces of metal mixed in with the faucet when I removed the bubble wand. And I thought again that it would be safer to have a water purifier because garbage can get mixed up in such a phenomenon.
 
 
 Also, I constructed a protruding shelf above the washing machine. There is a general lack of storage around the kitchen, and that's because the kitchen is about 1/3 the width of the kitchen and the storage above and below it, if you think about it calmly, so we'll do something about it.
 
 
 I had bought some cotton (momen) tofu that had a 20 yen discount at Lawson's 100 yen store and had an expiration date of today, so I thought I would make a nabe (one-pot dish), but I couldn't because I haven't unearthed a knife in my luggage yet. I looked for it but couldn't find it, so I may have to look for it patiently. Was it a mistake to buy vegetables? I microwaved the tofu and ate it with salmon chazuke source.
 
 
 I found small curry crackers at a 100 yen store, which I used to eat in my unexplored days, and I eat them and tofu. The cost of food is very reasonable: breakfast 110 yen + 30 Ebios tablets, lunch 105 yen for curry crackers, and dinner 30 yen for tofu. I would like to make a nabe to eat a lot of vegetables, but I can't find a knife. I would like to make a pot to eat a lot of vegetables, but I can't find a knife. I think spinach would be OK if I wash it well and tear off the root.
 
 <hr>
 3:12 I drank all the tea left in the plastic bottle, so I have 3 liters left at this point.
 
 What you can't find but need to find
 - Blue timer
 - kitchen knife
 - document binder
 
 *1237228011*My image
 I was told this is what I would express in emoticons -> ・・・・・・・・・((* ・*))
 
 
 What's with the dots on the non-facial parts.... And how do you get the half-width middle black to appear in kotoeri? I can see the .................................. .........((* ‥*)) Yeah, there's not much difference, so I'll just go with this one.
 
 
 I think it is not always possible to convey the message even if it is expressed by letters, since fonts can be different from each other. <img src="http://gyazo.com/5d107680fd9e6d561e6d0911fdec1808.png">
 </body>
 <comments>
 <comment>
 <username>shige-ohoboke</username>
 <body>I read in id:CLOTHO's diary<br>{http://d.hatena.ne.jp/CLOTHO/20090317/}<br>that <br>his face and hands were made by <br>Kokoro Inc.</body>.
 <timestamp>1237280681</timestamp>
 </comment>
 <comment>
 <username>shou</username>
 <body>.........((*‥*) pokey</body>
 <timestamp>1237281084</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I knew it...>Kokoro<br>When I saw the video, I thought it looked like an Actroid from the neck up</body>.
 <timestamp>1237329850</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-03-16 https://nishiohirokazu.hatenadiary.org/archive/2009/03/16]