Hatena2008-02-17
code:hatena
 <body>
 *1203238620* Methods to expose your schedule and push yourself.
 - Next Weekend (2/23): 1000 Speakers Conference
 - Kaihatsu" training camp (3 days/2 nights) where no PCs are allowed to be brought in.
 - End of this month: Deadline to have Jython book manuscript in a publishable form.
 - The following weekend (3/1): Haskell Hackathon
 - The following weekend (3/7-9): Python Developer's Camp (3 days/2 nights)
 - 3/10: Real deadline for the Jython book (supplemental footnotes, etc.)
 
 I really wanted to learn more about type inference and so on, but I guess it would be appropriate to position the Haskell Hackathon as a "break from writing"... I'm not allowed to bring my PC to the "Kaihatsu" camp, but maybe I should print out my manuscript and bring it with me. I'll need to print it out and revise it at some point, anyway... I'm sure I'll say to myself at the Haskell Hackathon, "Yay, I'm done writing! I'm coding! I guess my first goal is to be in the "I've finished writing the manuscript!
 
 Failure to achieve the first goal will turn the entire PyDevCamp into a writing camp.
 
 By the end of this month, I will have 2 holidays and 10 weekdays, 3 of which are development camps and 1 is a 1000 speaker conference. Even if all the work time is eaten up, there will be 7+1 non-event days, and since I am usually in the lab for 11-12 hours, I am routinely working "3-4 hours of overtime on my own". If I put this all into writing, I would have 21 to 28 hours. However, I have been thinking about putting this time into writing for a long time, but have not been able to do so. When I'm coding something, I don't have the energy to stop and start writing. I guess I should do the things that are hard to get motivated to do first.
 
 *1203244496* I think it's time to say a few words about facial images.
 I'm hungry.
 
 
 No, it wasn't. It was about the face image. I made up one of the face images for the purpose of registering it on Facebook or something. I'm not happy with the composition, so I may redo it soon.
 f:id:nishiohirokazu:20080217192631j:image
 
 What should be unnatural about this image is what the hell is the background? What is the difference in color between the right and left sides of the uniformly flat pink object?
 
 Click here to see the original image:
 f:id:nishiohirokazu:20080217192639j:image
 Yes, I took this picture with the reflection in the bathroom mirror. I was careless and put something in the background that I could tell was a bathroom, so I retouched it out, but when I did that, I should have picked up the color of the wall on the left side and erased it, but instead I used the color of the back wall on the right side and painted over it, so there is a difference in color between the left and right sides. I guess that's my complaint. Also, the composition.
 
 It is a very simple technique to make the skin age look years younger. I have a layer with blur on top with a semi-transparent layer. Then, I use the eraser on the top layer only for eyes and other outlines that should be clear. On the other hand, I leave nostrils and moles without erasing them.
 
 This is all you need to do with GIMP, and you can do it for 0 yen. Simple and easy.
 
 *1203245887*Likes more than shortcuts
 >>
 Nishio-san I don't know if this is related, but I have an image that Nishio-san seems to like shortcuts.
 <<
 http://d.hatena.ne.jp/dropdb/20080216/1203121674#c1203142513
 
 No, I like keyboard operation, not so much shortcuts... I can start most things with just 4 or 5 taps on the keyboard, and if I want to open a folder in a deep location, I can use Win+R and then use the completion function to dig into the folder.
 </body>
 <comments>
 <comment>
 <username>dropdb</username>
 <body>Haircut! Hairstyle! The story of the www. Terra Denso www</body>.
 <timestamp>1203251384</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Ah, I'm not really interested in hairstyles. <BR>By the way, I've witnessed a girl who was straight suddenly change her hair to light brown and wavy twice...what kind of change of heart is that~</BODY>?
 <timestamp>1203255111</timestamp>
 </comment>
 <comment>
 <username>jbking</username>
 <body>I have an image that you like unusual things like ponytails and dumplings. </body>
 <timestamp>1203269754</timestamp>
 </comment>
 <comment>
 <username>dropdb</username>
 <body>Mr. Nishio, I don't particularly have that mindset. It means as much as changing the wallpaper according to one's mood. <BR>There are some things that smack of heartbreak, like hair that was long becoming short, but it's an urban legend! It is. </body>
 <timestamp>1203297184</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I like dumplings (the eaters, of course)<br>Is it an urban legend that "I'm short because of a broken heart" -? I see. </body>
 <timestamp>1203300866</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-02-17 https://nishiohirokazu.hatenadiary.org/archive/2008/02/17]