Hatena2009-10-05
code:hatena
 <body>
 *1254731949* Sunshine Ranch Diary
 Recently, I've been growing melons for a long time because "it's a pain in the ass because there's timing to incorporate apples and such twice, plus the rate of increase decreases when I share them," but I finally saved up enough money to grow dandelions with 8 squares, so I changed my job to a dandelion farmer. Dandelions have 50 hours, so if you put fertilizer in twice, it becomes 48 hours, perfect for stabilizing the rhythm of life? The production of dandelions can be increased to 100% in 50 hours, so the number of insects per unit of time is less than other crops with short harvest cycles.
 
 However, I had no money to buy fertilizer because I was barely able to pay for the dandelion seeds. He uses the money from picking and selling other people's crops to buy fertilizer.
 
 *1254755664* English sentences are always mistranslated by Japanese.
 I was browsing in a bookstore and heard someone say, "The only way to know if you understand English correctly is to translate it. It is often said that 'understanding English as it is in English' is the ultimate goal, but if you can't translate a sentence into Japanese correctly, you definitely don't understand it." I bought this book because I was convinced by what it said. <a href="http://www.amazon.co.jp/gp/product/4887596898?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& <a href="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as2&o=9&a=4887596898" target="_blank"><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as2&o=9&a=4887596898" target="_blank"><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as2&o=9&a=4887596898" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" />
 
 The author of this book is a translator of the Da Vinci Code and other books. He has been teaching English for more than a decade and seems to have collected patterns that everyone picks up on, so the book is pretty dense. Also, natural language is highly redundant, so there are many cases where a rough understanding is fine. That's why you don't notice when the foundation is being eaten away by termites. In a book like this, you might think, "Oh, this is how the English sentence is written, isn't it? It is difficult to realize it on your own unless you are told, "No, that is a common mistake.
 
 >>
 I bought the book, which I have not read yet.
 <<
 
 I made this mistake. It's such a seemingly simple sentence. So that's how much of the basics are missing. I said, "I bought the book. I bought the book, which I have not read yet." I translated it as "I bought the book, which I have not read yet. Wrong.
 
 >>
 I bought the book. I have not read the book yet.
 <<
 
 The important point is that the first half of the verb is in the past tense while the second half is in the present perfect tense. The important point is that the first half of the verb is in the past tense, but the second half is in the present perfect tense. Also, the reason why it becomes "I bought the book" instead of "I bought the book" is because it is the book, not a book.
 
 One more thing.
 
 >>
 You should not buy new clothes because they are cheap.
 <<
 
 The literal translation would be "you shouldn't buy new clothes, because they are cheap", but why shouldn't you buy them if they are cheap? So I translated it as "you shouldn't buy new clothes, because they are cheap", but that wasn't the point.
 
 This omits just and only from the original sentence.
 
 >>
 You should not buy new clothes just because they are cheap.
 <<
 
 As far as English is concerned, a sentence is easier to understand if "just" is not omitted. However, as a practical matter, it is not true that all English authors in the world write easy-to-understand sentences. It is obvious if you think about whether Japanese people write easy-to-understand Japanese or not.
 
 There are a lot of problems like this, where the words themselves are simple but difficult to translate, or where the translator thinks he or she can translate the words but is mistaken. I haven't taught for more than ten years. If I write the explanations here, more than half of the book will be reprinted, so I'll stop here.
 
 <hr>
 
 > id:kits "I'm curious about the meaning of the just because statement."
 <img src="http://gyazo.com/ecc820e59aaa706c8251333786f290d2.png">
 You shouldn't buy new clothes just because they're cheap."
 
 <hr>
 
 PS: I'm seeing a lot of statements like, "That was okay!" I have only read through the basics, so please don't misunderstand me, because the examples above are not the hardest problems in the book. It's just a basic chapter.
 
 The first problem in the hard problem section
 >>
 They routinely write checks of ten twenty a hundred thousand dollars.
 <<
 Correct answer rate: 10%. It seems to be an actual quote from a certain novel.
 
 I've bought a lot of English books in the past, and I think this was a pretty good buy.
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=FFFFFF&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=4887596898" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 </body>
 <comments>
 <comment>
 <username>yukichi99</username>
 <body>If you are interested in this type of book, you should look for the book "Mistranslations, Stray Translations, and Defective Translations". <br>http://www.chikumashobo.co.jp/product/9784480082770/</body>
 <timestamp>1254799214</timestamp>
 </comment>
 <comment>
 <username>nkk</username>
 <body>As for the "basic version," I think there are many high school students who can translate it without making mistakes. <BR><BR>I'm sure there are many high school students who can translate the "Basics" without making any mistakes. <br><br>Having said that, I didn't understand the difficult version either.... </body><br><br
 <timestamp>1254820109</timestamp>
 </comment>
 <comment>
 <username>denja</username>
 <body>I got the meaning of the first two on the first look, but the last conundrum... ten twenty a hundred thousand dollers for $10201001000? Please tell me the answer! </body>
 <timestamp>1254834639</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>nkk>As for the "basic version," I think there are many high school students who can translate it without making mistakes. So, I wanted them to be able to say, "I can understand this much! <br><br>No, I think it's not cool to pick up a problem solved in the basic section and write "I know this much". I think it's very uncool to "pick up a basic problem and write 'I know this much'". </body>
 <timestamp>1254838196</timestamp>
 </comment>
 <comment>
 <username>silk</username>
 <body>I wonder if the last one means that they are marking every 10, 20, 100, and 1000 dollars in a streamlined way<br>The atmosphere seems to me to mean that they are counting donations and other small amounts of money as they tally them up, but I'm not sure. </body>
 <timestamp>1254844832</timestamp>
 </comment>
 <comment>
 <username>Tak</username>
 <body>Hmmm, the Japanese translation of the last difficult question is "I write many $10,000 checks every day"? </body>
 <timestamp>1254856017</timestamp>
 </comment>
 <comment>
 <username>the48</username>
 <body>"Ten folded checks for every $100,000"? <br>I only looked up the dictionary for TWENTY. </body>
 <timestamp>1254882919</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <BODY>It seems there are several correct answers if you include the Hatena comments, but the comment section here is wiped out. <BR>Well, that's why I think Japanese people will always mistranslate (at least one) question in this book. </body>
 <timestamp>1254888313</timestamp>
 </comment>
 <comment>
 <username>sirocco634</username>
 <body>Isn't it high school English grammar to explain the first example sentence in terms of the difference between "which" and ",which"? </body>
 <timestamp>1254922556</timestamp>
 </comment>
 <comment>
 <username>gnostikoi</username>
 <body>This entry was very clear that Ms. Nishio's English skills are not up to a practical level. Please study hard and keep up the good work. </body>
 <timestamp>1254922855</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>>Isn't it high school English grammar to explain the first example sentence in terms of the difference between "which" and ",which"? <BR><BR>No, for example, if the second half is "which I had not read yet", it doesn't matter what the comma is, it doesn't have the nuance of "I haven't read it yet". Tense is the key here. <BR><BR>This entry shows very clearly that Nishio-san's English is not up to the practical level. Study, study hard. <BR><BR>Yes, I will do my best. </body>
 <timestamp>1254931154</timestamp>
 </comment>
 <comment>
 <username>keihou_de_yasumida</username>
 <body>I wonder if I can make a check for $10,000, $20,000, or $100,000. I want a comma. <BR>But I thought it would be 10, 20, or even 100 times more beneficial to read a forum I'm interested in than to read these hard-headed books. </body>
 <timestamp>1254953133</timestamp>
 </comment>
 <comment>
 <username>sirocco634</username>
 <body>>> No, for example, if the second half is "which I had not read yet", it doesn't matter what the comma is, it doesn't have the nuance of "I haven't read it yet". The key here is the tense. <BR><BR>If that is what you mean, then you are right. <BR><BR>If I remember correctly, <BR>"descriptive English grammar" (the study of how English is actually used in real life by collecting corpora and such to describe how English is used in real life), <BR>even in this usage (= "I bought a book I haven't read yet") I seem to remember that when this usage (= "I bought a book I haven't read yet") is used, "often precedes which with,". <BR><BR>What I meant by this is that when there is ",which", that in itself tells us that we have not bought a book that we have not read yet. <BR><BR>But grammar is only as good as the grammar you break, and "if the tense is intentionally shifted, you must be able to understand the meaning even if there is no ," right? <br>I learned a lot. </body>
 <timestamp>1254959011</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>>But I thought it would be 10, 20, or even 100 times more beneficial to read a forum I'm interested in than to read these hard-headed books. <BR><BR>I'm very interested in "what kind of English text I misunderstand," but to each his own. </body>
 <timestamp>1254976312</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-10-05 https://nishiohirokazu.hatenadiary.org/archive/2009/10/05]