Hatena2010-05-01
code:hatena
 <body>
 *1272719018*Continuation of Singapore Day 3 Diary
 Darth Vader.
 f:id:nishiohirokazu:20100430131602j:image
 
 I'm having steamed chicken rice for lunch today.
 f:id:nishiohirokazu:20100430133437j:image
 
 This black sauce is important. It was like a sauce for conger eel.
 f:id:nishiohirokazu:20100430133741j:image
 
 Sticky and slightly coconutty.
 f:id:nishiohirokazu:20100430145951j:image
 
 Big Brother's Watching You!
 f:id:nishiohirokazu:20100430154010j:image
 
 Dinner today. The price doesn't matter anymore. It didn't cost five dollars.
 top
 f:id:nishiohirokazu:20100430195827j:image
 
 Mystery creature
 f:id:nishiohirokazu:20100430203726j:image
 
 Peel off the skin of the mysterious creature
 f:id:nishiohirokazu:20100430225745j:image
 
 I didn't like the brain of the mysterious creature.
 
 *1272719910*Diary of Day 4 in Singapore
 Too much information being input and not enough output in time. It is a good trend. It's fun to have a long time like that in your life.
 
 I'm going to go do a little more input, I'll continue later. No one wants to follow me, so I'm alone. I have to be careful not to become "that was the last blog written by Yasukazu Nishio" (lol)
 
 *1272735702*Continuation of Singapore Day 4 Diary
 I just got home. I am tired, tired, tired. I'm super tired from walking today.
 
 Breakfast, $1.50
 f:id:nishiohirokazu:20100501101228j:image
 
 I was thinking of buying an iPad because it was cheap, but I was bothered by the complications: 5% more expensive if you use a credit card, 20% tax, and some money back if you go through the tax exemption procedure. Also, when Chairman Noboru bought an iPad, he was involved in some trouble that it was combined with a software update service without his permission. I had originally wondered why the price was so low, but I guess it's a strategy to make money by bundling services.
 
 I had paper wrapped chicken at Hillman Restaurant. It was delicious.
 
 Japanese anime manga culture can be found here!
 f:id:nishiohirokazu:20100501173920j:image f:id:nishiohirokazu:20100501173320j:image
 
 Chilled tofu and edamame are high quality ingredients that cost 1.6 my breakfast. By the way, there was boteju, but okonomiyaki costs about $10.
 f:id:nishiohirokazu:20100501200537j:image
 
 For dinner, since it is not very artistic to always have Chinese food (the other members of the group were also bored, eating McDonald's or sushi), we went to a Myanmarese food court. Just as the Chinese food court is full of yellow people like me, the Myanmar food code is full of dark-skinned people. I can read "chicken" and "vinegar" written in Chinese, so I can imagine what it means, but I cannot read Burmese.
 
 f:id:nishiohirokazu:20100501214216j:image
 
 $4.00. Soup was sour. The rice was generally good, but there was extra rice.
 
 I had heard that pornography is illegal in Singapore, so I thought Singapore is a strict country regarding pornography, but there are pornographic goods stores open proudly on the ground floor facing the street on a four-lane road where buses run. That's two shops in one block. http://twitpic.com/1jom0f So it's not "porn is not good" for religious reasons. The government even runs a prostitution district. So I went to visit there, and it was interesting to see illegal cigarettes smuggled from Indonesia, many women of various races standing in the dark streets, and a car with "Special Operation Command" written by the Singapore Police. Well, in the end, I could not solve the mystery of why the Singaporean government regulates pornography. Even the government officials said that while there is censorship of Internet access, it is not pornography that they are restricting, but religion. Is the banning of pornography somehow necessary to maintain the system? If pornography is banned, is it inevitable that children will see it? If it is a brothel, children are not allowed to enter.
 
 Overall, I'm sure there must be a reason for this, as I often think the Singaporean government is smart.
 
 Tomorrow we're off to neighboring Malaysia!
 </body>
 <comments>
 <comment>
 <username>j2ee</username>
 <body>Hainanese chicken rice and the mystery fruit is rambutan. </body>
 <timestamp>1273038141</timestamp>
 </comment>
 </comments>

[Hatena Diary 2010-05-01 https://nishiohirokazu.hatenadiary.org/archive/2010/05/01]