Hatena2007-12-01
code:hatena
 <body>
 *1196469665*Okita
 good morning
 
 I guess I should go to Akihabara Daibiru for now.
 
 *1196477663*Memo of Final Debriefing Session for Unexplored Youth (written)
 ** Myocardial fiber modeling
 - Extending the application of a two-dimensional texture to a two-dimensional curved surface naturally results in the application of a three-dimensional texture to a three-dimensional distorted space.
 - It would also be useful for creating textures for ordinary empty models.
 -- The problem is that humans can't directly draw in 3D, so it might be useful to draw a 2D surface and then generate a 3D texture from it to fill in the undrawn areas.
 
 ** RPG created by everyone
 - Everyone can log in and walk around in a 3D virtual world, placing things and editing the map in real time.
 - Scripts are also bagged in real time.
 - Anyone who thinks SecondLife is technically amazing should come to the unexplored youth presentation conference.
 - It would still be hard to make a finished version, but it would be useful for prototyping and brainstorming for games.
 - kameTL
 -- A language with a non-preemptive threading system specifically for game scenarios.
 -- Can show where you are executing when you are doing an operation. Interesting debugging.
 - They don't want it to be closed like Second Life, where you have to enter Second Life to see it.
 - I want people around the world to share the excitement I felt as soon as possible.
 
 ** Whiteboard to support the division of household chores
 - With the increase in women's participation in society, the need for sharing household chores is increasing.
 - Usually, household chores are not tightly divided, and there is an overlap, such as "buy when you can". If information is not shared well, they may both buy carrots on special sale.
 - I'm not saying I don't want to help with the housework, but I don't know what to do.
 -- →Household Suggestions
 - Information sharing and management system for household chores
 -- Read and write anywhere, anytime with your cell phone
 -- They look at the contents of emails sent by cell phones and automatically categorize them!
 -- You can write on a photo taken with your cell phone "like a rakugaki on a purikura". I don't know about Purikura, but you can put hearts and other things on it. Of course, you can also write notes by hand.
 -- AI (Robotan) learns and says, "It's time to ____." and suggestions
 - Incentives for domestic help
 -- The gauge (flower) grows when you help with household chores. If you don't help, the gauge goes down.
 -- Graphical display of who did what and how much
 - They actually had them use it and measure its effectiveness.
 -- Keeping track of household chores helps you visualize how hard you're working. You can see how great your mother is w
 
 That's useful for more than just sharing chores. Everything I was going to say has been said by others. Of course there's the life-logging aspect. But there is also the advantage of concentrating specifically on housework, rather than just vaguely logging, which makes it easier to extract information from the log.
 
 Oh, you've been experimenting with actual families for over a month? That's wonderful.
 Even though many of them are made until the last minute and then thrown together.
 
 ** Really? SEARCH
 - There is a lot of "unreliable information" out there. Existing web search engines are not suitable for checking reliability.
 - Will it automate tasks that are unconsciously repeated by people who are familiar with Google?
 - Specify both natural language phrases and keywords. For example, "natto is effective for weight loss" and "diet."
 -- It seems that one human query throws up a lot of queries behind the scenes.
 -- I can show a graph showing what percentage of sources are 2ch, what percentage are blogs, what percentage are go.jp, and so on.
 -- The time axis shows "what has been said suddenly recently" or "what has been said for a long time".
 - A search like "solution (of|for|to) the problem" would be useful to look up English.
 - http://hontolab.org/product/honto/index.html
 -- <img src="http://www.nishiohirokazu.org/files/honto_search.png">
 -- Wahaha, science majors are weak in English.
 - "What's the World All About?" Search by...
 - "What helps?" I searched for "information is useful."
 - Not having its own index. Push it to existing search engines.
 
 ** Testbed to support development of distributed systems
 That's a tough one, like hooking up a socketcall system call to create a virtual network.
 
 demonstration
 
 Hmmm, I can't see anything because the text is so small in the demo on the terminal.
 
 Next time is the pairing cipher - right? I wonder if it's hard and fastened.
 
 Is it that by hooking the program's access to the outside world (IO and such) rather than creating a VM, it appears to the program that it is running on multiple machines, even though it is running on one machine?
 
 This will test if it works properly on 6000 machines before actually running 6000 machines. 6000 VMs will take up a lot of resources. Can we emulate more machines instead of losing a bit of versatility?
 
 **Ciphertext keyword search using pairing ciphers
 
 - I want to search encrypted data without restoring it.
 - e(aP,bQ) = e(bP, aQ) = e(P, Q)^ab…
 -- http://homepage1.nifty.com/herumi/crypt/crypt01.html
 
 I'm choosing cell phone e-mail as the application target, but I thought there might be more need for targeting business documents and the like.
 
 ** Hairstyle Simulation
 
 I heard that scanning humans with an objective scanner makes them twitch.
 
 ** Shadow Phone
 
 -Smaller and easier to install.
 -Communication is an assumption.
 - "It's not as fully open as Ustream, but it's nice to be semi-exposed."
 -- ...it occurred to me that it would be interesting to create a filter to send shadow pictures to Ustream.
 --- Ah, you're thinking of a blog-part way or something?
 --- I was told that writing a device driver would be the most versatile (though tedious) since I was told about Skype by Pitchfork, but I heard that they are thinking in that direction as well.
 -http://shokai.org/
 -Only the upper body is more interesting. Horizontal length is better. It is interesting to see horizontal movement.
 
 ** Get-together
 -This is about how much the Earth oscillates in the moon's gravity as it favors the sun.
 -Kessler's syndrome
 -If the earth were to start moving out of the solar system, it would gradually cool down, so gradually everyone would go underground and live off geothermal heat.
 -- and if it is captured by Jupiter and becomes a relatively inner planet, it will be heated by tidal forces, so a civilization will develop that has changed its source from solar energy to tidal energy.
 -Mori-san's (plush and super creator) last name has been changed to Igarashi! The story
 --http://www.den.rcast.u-tokyo.ac.jp/~yuki/index-j.html
 ---Heh, heh, heh, heh, heh, heh.
 
 *1196518977* Secondary
 
 Ah, I haven't had alcohol in a while. I've been refraining from it lately.
 
 *1196520719*Sake
 
 What's the worst thing about drinking alcohol is that my legs get sore muscles. Should I seriously consider a foot massage?
 
 *1196522881* Unexplored will be lost.
 I was going to mention something about the rumor, but I can't find the article where the rumor originated in the first place, so it's a pain in the ass, so I'll just leave it at that.
 
 ---
 http://cappuccino.jp/keisuken/logbook/20071203.html#c00
 
 I went to the Unexplored Youth Achievement Reporting Conference and thought that if I wrote "there is a rumor that it will disappear," it would convey the idea that it will not disappear, but it was hard to convey...
 </body>
 <comments>
 <comment>
 <username>earth2001y</username>
 <body>Isn't this the "grant for software development by the Information-Technology Promotion Agency of Japan" at Kore http://mainichi.jp/select/seiji/archive/news/2007/11/29/20071129ddm003010152000c.html<br>? </body>
 <timestamp>1196524965</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Hoa, I didn't know there was such a story</body>.
 <timestamp>1196531408</timestamp>
 </comment>
 <comment>
 <username>keisuke_n</username>
 <body>No, no, no, I didn't misunderstand you...</body>.
 <timestamp>1196751024</timestamp>
 </comment>
 </comments>

[Hatena Diary 2007-12-01 https://nishiohirokazu.hatenadiary.org/archive/2007/12/01]