Hatena2008-03-11
code:hatena
 <body>
 *1205194957*&#8776;&#223;
 I am not used to the position of the keys on my MacBook, so I hold down the Option key and press xs to enter&#8776;&#223;.
 
 &#229;∫&#231;∂´&#402;&#169;&#710;&#8710;&#730;￢&#181;&#732;&#248;π&#339;&#174;&#223;†¨√∑&#8776;\Ω
 
 I'll look at it later in Windows and compare the appearance.
 
 &#305;´&#207;&#733;&#211;&#710;&#212;&#63743;&#210;&#194;&#216;&#8719;&#338;‰&#711;¨&#9674;&#8222;
 
 They are cute&#63743;.
 
 -----
 &#63743; ← apple mark
 
 Except for this one, it looks fine to me. In Hatena's edit box, it's replaced with a numeric character reference.
 
 *1205196309* makes me want to go to the bathroom.
 the inside of a futon is too happy
 
 *1205202410*Summertime
 It's already started.
 
 *1205228718*LinkedIn
 http://www.linkedin.com/profile?viewProfile=&key=22402778&trk=tab_pro
 I made an account because I was invited.
 The company name is complemented, and people from the same company are displayed as potential friends. It's a bit different from ordinary SNS.
 
 
 I guess you have to have an account to see it. Oh well.
 
 -----
 
 I found a Bangladeshi teacher who was an assistant in the same lab when I was at NAIST. A system that allows you to meet unexpected people again.
 
 *1205233931*"To be serious, you can't learn scheme by doing sicp" (by hayamiz)
 http://twitter.com/hayamizu/statuses/769773511
 
 *1205234695*Ustream
 It's interesting to stream a desktop with CamTwist, but there is no sound, so the person watching can't tell if I'm leaving it now and doing something else, or just pausing my work for a moment. I wonder if it would be possible to send a typing sound to Ustream when a key is pressed.
 
 And I thought of amachang's live coding: http://www.ustream.tv/channel/amachang
 And I'm at the convenience store right now.
 
 *1205244648*Gohan
 
 At least I came out to eat dinner. Eating might calm me down a little. But it's a double-edged blade that might make me lose the last train.
 </body>

[Hatena Diary 2008-03-11 https://nishiohirokazu.hatenadiary.org/archive/2008/03/11]