Hatena2010-02-11
code:hatena
 <body>
 *1265865612*About buying silver coins on the first hand in Dominion.
 Even though I didn't realize it when I was in the stage of learning the rules.
 
 -Coin concentration at the start of play is 0.7 at 7 coins out of 10; expected value when 5 coins are drawn is 3.5.
 -0.75 for 9 coins out of 12 if you buy something with silver in the first hand (turns 1 or 2). 3.75 is the expected value when you draw 5 coins.
 -0.58 for 7 coins out of 12 if you buy 2 non-silver coins. 2.92 expected when you pull 5 coins.
 
 This difference is significant.
 
 Suppose you buy a chapel "C" and a silver coin "2" (copper coin "1", mansion "E") on the first move, and on turns 3 and 4
 - C1EEE 4 discarded, nothing bought Coin density 8/8 at 1.0
 - C11EE 4 discarded, nothing bought, coin density 7/8 at 0.88
 - C111E
 -- 4 discarded, nothing bought, coin density 6/8 at 0.75
 -- Abandon the mansion only and buy the silver coins. Coin density: 11/12, 0.81.
 - C1111 Throw away one copper coin and buy a silver coin Coin density 10/12 for 0.83
 
 <del>Oh well, I was buying silver coins at C111E because I didn't feel comfortable throwing away three coins, but since there is no difference as a percentage, I guess I should throw them away to speed up the turnover. </del>
 
 Should I throw away all my copper coins at C1112, buy silver coins, or not throw them away and buy mine?
 - Discard all coppers: 6/9=0.67 (decrease)
 - Shedding 2 copper coins to buy silver: 9/11=0.82
 I don't know how effective the mine will be without a simulation...
 
 **1265866104*How to use Dominion BSW
 I wrote a quick note about BrettspielWelt (BSW), which allows you to play Dominion and other games online. I think the key to improve is to play a lot of online games.
 
 -1: Download and install from http://www.brettspielwelt.de/
 -2: windowsだとC:\Documents and Settings\UserName\Application Data\BSW, Macだとアプリのすぐそばにあるlocalizationのなかのlanguages.txtのdominionって所にjaを書き足して起動して(Windowsだと初回起動時に生成される？)
 -3: Click on the image and log in with the appropriate name and password.
 -4: /language ja to Japanese (sometimes the contents of languages.txt are reverted to the original and not Japanese)
 -5: /ghook usernameで人を見つける
 -6: If you come to the Dominion screen, go to the Game tab and select Join to join. You can also do it by /join.
 -7: Push start. Can also be done with /start.
 -8: If the connection hangs or goes dead while playing, you can get back on by reconnecting the connection and accepting another player.
 -9: To get a table by yourself, select Dominion from Alle Spiele and bring up the Dominion Rooms column, then use freie Tische to select an open table and enter. If you are playing with friends, check "invisible" so that you do not appear on the list and wait for your friends to arrive using ghook.
 
 追記
 - When guarding with a moat, press the check (not the buck).
 </body>
 <comments>
 <comment>
 <username>flag-boy</username>
 <body>If you buy a silver coin at C111E, the price is 0.91 for 11/12. <br>There are still many situations where it would be better to throw it away, though. </body><br
 <timestamp>1265875214</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>That was a great editing error, thanks for pointing it out. >0.75 on 12/12</body>.
 <timestamp>1265944826</timestamp>
 </comment>
 <comment>
 <username>nisedomi</username>
 <body>By the way, for silver and silver coins or silver and militia, the turn 3 concentration is 0.91, which is faster than the chapel. <br>But since the turnover speed of the deck is different, it is difficult to say which will be faster after turn 7. <br>The efficiency is even lower if you get hit by militia when you have a chapel. </body>
 <timestamp>1265992489</timestamp>
 </comment>
 </comments>

[Hatena Diary 2010-02-11 https://nishiohirokazu.hatenadiary.org/archive/2010/02/11]