Hatena2015-04-27
code:hatena
 <body>
 *1430105077*The Flow of Psychology to the Emergence of Orthodox Peripheral Participation Theory
 I'm reprinting it here because it's inconvenient for me to write it on Facebook because I can't find it in a search when I want to look at it again.
 
 ---
 
 This issue of "Organization Science" is a special issue on "Learning in the Field," and it includes an article by Saeki Akira, in which Ilyich's concept of conviviality comes up, concluding that ultimately learning is about creating convivial relationships with others. Interesting.
 
 Organization Science Vol.48 No.2 pp.38-49 Min Saeki "What does it mean to 'learn' in the first place: before and after orthodox peripheral participation theory."
 
 A discussion of the flow of psychology up to the creation of the orthodox peripheral participation theory and its subsequent potential for change.
 
 Psychology entered the heyday of behaviorism after Watson said in 1913 that psychology would be a natural science if it focused only on behavior (conversely, anything else ain't science). The thinking of this era was that if a reward is given immediately after a behavior occurs, the behavior will be reinforced (operant conditioning). However, this has long since broken down.
 
 Krechevsky 1932 Analysis of the learning curve of discrimination learning in rats argues that rats do not learn by having their behaviors reinforced, but have "hypotheses" of what to use as discrimination cues, and that the rate of correct answers increases rapidly by discarding false hypotheses Tolman 1948 Rats Tolman 1948 The behavior of rats learning the shortest path in a maze and then placing obstacles so that the path cannot be followed (i.e., the learned combination of behaviors cannot be reached) suggests that the rats have learned a cognitive map of where the food is, not a set of behaviors (this has now been experimentally shown to be located in the hippocampus, right? In short, the model that "learning is based on stimulus-response associations" is broken with respect to animals.
 
 However, CAI and behavioral therapy based on this model are producing results. Why are they getting results when they are based on the wrong model?
 
 This is where the story gets even more shocking. When a chimpanzee and a human 3-year-old are made to learn to operate a specific procedure in a device where the mechanism is invisible to them to take out sweets by showing them a model behavior, both learn in the same way, but then they can see the mechanism even during and find out "what the heck, most of the procedure is pointless"! Then the chimpanzee skips the pointless procedure, but the human faithfully performs the futile procedure. (Whiten+ 2005)
 
 The major difference between humans and other animals is "culture," the "blind" transmission of what is taught as "supposed to be done this way" with the meaning unclear (Gergely&Csibra 2006).
 
 My interpretation is that a species in which a few intelligent individuals create new rules and the remaining individuals blindly follow the rules without thinking for themselves is more beneficial for survival than a species in which each individual thinks for itself and acts accordingly, and natural selection has selected for that species. This is quite shocking to my value system, which always endorses thinking for oneself.
 
 Now, in the overall story, this story is a side note, and to return to the original path, four landmark studies were published in 1956, when "this is how behaviorism failed and what other paths were being tried": Bruner+'s "Man makes a hypothesis, tests it, and revises it", Milner's "Theorem Proving System. Bruner+'s "Man's short-term memory is 7±2," Milner's "Short-term memory is 7±2," Newell&Simon's theorem proving system, and Chomsky's generative grammar. I didn't know they were all in the same year.
 
 Later, Milner+'s view that the key concept is "plan" and Neisser's cognitive psychology view that humans are trying to generate meaningful coherence from sensory input emerged, the latter becoming mainstream, but Winograd's natural language The latter became the mainstream, but Winograd's understanding of natural language (the famous SHRDLU) led to an increase in research on how to express knowledge and language, and research on identifying bugs and fixing them became popular from the viewpoint that students who make mistakes in math at school do so because there is a bug in their brain programs.
 
 Piaget 1974 suggested that an anthropological perspective was needed, but Suchman 1987 demonstrated the validity of this idea, where Situated communication is communication between tools and people. Lave was so impressed by the term Situated that he proposed the concept of Situated Learning in 1991.
 
 Here, learning is defined as "the formation of a person's identity as a member of a community of practice through participation in that community.
 
 Saeki criticizes this orthodox theory of peripheral participation for not asking the question, "Why do people learn?
 
 He introduces Iliichi's conviviality, which is usually translated as "independent symbiosis," but Furuse uses the term "conviviality," which means enjoying the company of others. He says that in order to create a convivial society, it is necessary to relate to the subject in a second-person way, in which the subject is responsive to our actions and basically likes to have fun, rather than in a third-person observational way. This leads to the conclusion that to learn is to think of others as convivial beings and to try to create convivial relationships with them.
 </body>

[Hatena Diary 2015-04-27 https://nishiohirokazu.hatenadiary.org/archive/2015/04/27]