Hatena2009-10-02
code:hatena
 <body>
 **1254454529*Leverage memo "Effective Time Management"
 <a href="http://www.amazon.co.jp/gp/product/4537256842?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=4537256842">Effective Time Management&#8212;Maximize Work Efficiency The Yashiro 15 Minute Work Method</a><img src="http://www.assoc-amazon.jp/e/ir?t= nishiohirokaz-22&l=as2&o=9&a=4537256842" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" />
 
 It is not because of a weak will that people make plans and fail to realize them. It is because they make reckless plans that can never be realized, and then they fall further and further behind schedule and give up when they can no longer accomplish the task no matter what they think. So, I think we should first set up a period of time to start the process, and then quantitatively measure how many tasks can be done in how much time. Indeed, looking back on my past experiences of failure, I realized that I had made plans without measuring how much I could accomplish.
 
 The other interesting classification is that there are some types of tasks that can be done in small chunks of time and some that can't. It's true that I can't do coding in 15 minutes. I used to play Othello (Morocco) on my iPhone when I had some free time on the train, but I was getting tired of it and thought that I should use this time to gather information or study. I'm wondering if there is an app that streams abst papers on iPhone.
 
 Below is the raw leverage memo
 <hr>
 Work is determined by shredded time.
 I really wanted to title it "The Golden Path to Semi-Retirement in Your 50s," but they objected.
 One cannot pursue efficiency alone.
 Is that "busyness" billable: is it billable work, who are you spending your time for?
 Time approach and volume approach: Tasks that are divided by time and tasks that are divided by volume, such as information gathering, can be finished because "an hour has passed," but for creative work, "the time has come, let's continue later" will worsen productivity. It is necessary to finish all tasks at once until the volume reaches a predetermined level. Do not include volume-approach tasks when there are important tasks behind. Time-approach tasks can be done even in small time slots.
 One way to do this is to put in the smallest amount of time what you are not bothered by spending time on and what you really want to study.
 What would you do if you had 15 minutes: I can't be creative. Gather information, study, etc. If you don't decide, it will be over while you are worrying.
 Planning is necessary to achieve your desires: First, measure your processing capacity as a number.
 Measure the time you are working with a stopwatch (properly excluding looking away or using the restroom).
 Two weeks as a helping period for the plan.
 There are higher ups. There are many people who do a better job in a shorter time. Don't aim for 100% yourself, but show others at 70%. The better you are at it, the faster you will be at it.
 Waste of time "thinking again what you once thought." Think as you write it down on paper.
 I read through five national newspapers, but it is impossible to read all of them. I read only the headlines and then read the articles in small chunks of time.
 People who have their past experiences categorized and organized in their minds are able to divert data and process it faster.
 Top Gear in the Morning: Prepare what you will do tomorrow during the night before
 It is okay to make holes in the plan because it cannot be followed perfectly, but the holes that are made must be properly cleaned up. Do not pretend that it did not happen. Reschedule appointments exactly as you would appointments with other people.
 Many people resolve to do something, but end up overdoing it for three days. Why is that? We did some research on people who have failed. They said, "I didn't have time," or "I got fed up because I didn't make any progress. There are "no plan" and "reckless plan. They are perfectionists and lose motivation as soon as they realize that they can't achieve their goals. They then become depressed and think, "I am a weak-willed person who can't even carry out the plans I made. It is not that you are weak-willed, but that you are making plans that cannot be realized due to a lack of planning ability. First, measure your processing capacity. Quantify. Set your plan a little higher and aim for 70%. Don't suddenly make a long-span plan; give yourself a two-week run-in period. Check the feasibility of the plan and whether you should do it in the first place. It may be tempting to cram too much into the plan, but that's okay during the run-up period. If you can confirm what you can't do because you've packed too much in, or if you can measure how far you've come, the purpose of the run-in period has been fulfilled. Next time, make a plan that looks doable. Let's prepare a time reserve, because there will be tasks that we won't know if we don't try them, and instead of worrying about the 30% that we didn't get done, let's get excited about the 70% that we did get done. Make a plan when your mind is saturated with studying, and don't use your core time to do it.
 Keep a table of tasks and fill them in with markers when completed. Accomplishment.
 Television is a subjective medium. There is much to be gained by simply looking at the headlines in a bookstore. A website where you can view train hanging ads: http://www.zassi.net/latest_ad_list.php
 When you look at a speed-reading expert's gaze, you are moving forward in the center of the book. The threshold for checking is low. Only extract the good parts to read over later.
 Start reading a book as soon as you purchase it. The moment you buy it is when you want to read it the most. If you give it time, it will fade away.
 Unlike paper, digital data is not "thrown away" because it doesn't take up space.
 Make a selection of first army notebooks. Watch the notebooks you make over and over again and memorize them on film.
 
 *1254454950* Quantitative and Planning
 At any rate, both yesterday and today's book was done in the time it took me to "buy it, flip through and mark it on the way to and from the train, read it through in 30 minutes before bed, mark it, read it through in 50 minutes when I got up in the morning, leverage memo transcription & make blog entries".
 
 Next up is a fairly long list of <a href="http://www.amazon.co.jp/gp/product/4569696791?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative= 7399&creativeASIN=4569696791">Study Methods to Make the Most of Your Brain</a><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as2&o=9&a=4569696791" width ="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" />. This is a smaller book, so the same amount of time should be enough. I will read it this evening.
 
 *1254455876*List of leverage memo
 Leverage Memo's Leverage Memo: "80% of the content of a text is in 20% of the text; get 80% in 20% of the time; get 80% in 20% of the time; get 80% in 20% of the time. Make those notes for yourself and throw away the original. Read it over and over again to enrich it."
 
 
 I'll probably forget to update it soon, though, since it's manual maintenance:)
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20100310/1268239885'>Leverage memo: randomness - Soren's game design theory</a>
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20100310/1268243143'>Leverage Memo: My Home Strategy from $2 Million a Year</a>
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20100308/1268032676'>Leverage Memo: Inoko's Love Letter</a>
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20100301/1267431964'>Living with Yourself Leverage Memo</a>
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20100227/1267239281'>The Meaning of Innovation</a>
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20091015/1255636108'>Leverage memo: the innovation dilemma</a>
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20091003/1254547423'>Study Methods to Make the Most of Your Brain Leverage Memo</a>
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20091002/1254454529'>Leverage Memo "Effective Time Management"</a>
 - <a href='http://d.hatena.ne.jp/nishiohirokazu/20091001/1254371616'>Organizing HACKS! Leverage Memo</a>
 - <a href='http://d.hatena.ne.jp/nishiohirokazu/20090526/1243281716'>Leverage Memo "Contemporary Art Business"</a>
 - <a href='http://d.hatena.ne.jp/nishiohirokazu/20090501/1241194824'>Ichiro's Style Leverage Memo</a>
 - <a href='http://d.hatena.ne.jp/nishiohirokazu/20090429/1241008878'>The Complete Ruby Source Code Guide should be read even if you don't use Ruby</a>.
 - <a href='http://d.hatena.ne.jp/nishiohirokazu/20090319/1237445664'>Leverage Memo "Pattern Language of Project Promotion and Its Evaluation"</a>
 - <a href='http://d.hatena.ne.jp/nishiohirokazu/20090319/1237454594'>Leverage memo "Project Pattern 1.1"</a>
 - <a href='http://d.hatena.ne.jp/nishiohirokazu/20090315/1237131997'>"So it's not getting done. And yet I don't have time." Leverage memo (2nd draft)</a>
 - <a href='http://d.hatena.ne.jp/nishiohirokazu/20090311/1236764852'>Leverage Memo</a> with Dramatic One Paper and Growth Strategies from Age 30 and Associate 2007/04 and TIME HACKS! Leverage Reading Leverage Memo
 - <a href='http://d.hatena.ne.jp/nishiohirokazu/20071229/1198911693'>H5N1 virus attack&#8212;Protect your family from new influenza! </a>
 
 But I've been going for 2 years now, I wish I had a tool for maintenance, or me: <a href='http://d.hatena.ne.jp/nishiohirokazu/20071008/1191823148'>leverage memo</a>.
 
 Added on 2010-02-12
 
 *1254463668*ScanSnap arrived.
 Mac version: <a href="http://www.amazon.co.jp/gp/product/B001QXCZ26?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=B001QXCZ26">FUJITSU ScanSnap S1500M FI-S1500M</a><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as2&o=9&a =B001QXCZ26" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" />
 
 At any rate, I tried to grab the Startup Guide out of the blue and couldn't get the iPhone's camera to start in time. Fast. I almost looked up how to change the order of the pages, but that's OK.
 
 Next up...well, I guess I'll have to convert my paper copy of the article from the Library of Congress into a PDF. Aaaaah, the corners are all squashed. I wonder if this will jam.
 
 I got one overlap detected, but I was able to scan it. And the pages are in a different order than I expected. What should I do?
 
 Oh, okay, it reads from the side closest to the scanner, I made the mistake of facing the first page toward me. I've imported about 40 pages of A3 paper that I cut open with scissors, and I've had two overlapping paper detection problems and zero jams. I was disappointed when I used the ADF for the first time in the past, but it seems that the ADF has evolved in recent years.
 
 Here is the quality of what was captured
 <img src="http://gyazo.com/87042b2781e8c3e779b33da3d9e4406d.png">
 <img src="http://gyazo.com/77c061eb1141e1c70a0c21e43f8fa255.png">
 Readable enough; 1.5 MB for a 7-page paper.
 
 What about putting OCR on it so it can be searched. http://scansnap.fujitsu.com/jp/howto/s300-no6.html
 I set it to OCR when scanning and it took 12 seconds for 5 pages. Hmmm. I wish there was a folder where I could put scanned PDFs and it would OCR them while I sleep.
 
 Search by Keyword
 <img src="http://gyazo.com/94ad60d763ab5fc77b32985696a6c76e.png">
 Hmmm. It's working reasonably well, and Spotlight search is working. Now I can find the paper that contains the article I'm looking for. Convenient, convenient.
 <img src="http://gyazo.com/b5e3513c09b424a989fda2d79896a106.png">
 
 <hr>
 
 Oh, I found the perfect thing to scan. There are about 140 sheets of presentation materials from the summer Prosin, of varying paper quality, depending on who you ask. If I throw them away, it will be impossible to get them later, but if I keep them in paper form and don't refer to them, then I won't refer to them. It's just perfect. I tried to put them all together for now, but they were too thick to scan. I tried separating them, but when the slippery paper is at the bottom, it is sucked in all at once and an error occurs. I decided to put the slippery paper at the top, and everything was scanned successfully.
 
 <img src="http://gyazo.com/8fb51390e491ac66b1e69eff2df0cf5b.png">
 
 Yeah, yeah, now I can throw it away without worry. I had a few jams only when there was slippery paper at the bottom, but it was not a problem because the jams were not the same as the old ADF, where the paper would get squishy and non-recursive, but simply because I sent multiple sheets and the "Failed! I've scanned about 140 sheets and only had about 2 failures.
 
 <hr>
 
 I thought the OCR time would be a distraction, but between scanning and OCR, I cut the next paper and so on... and it starts to speed up and doesn't stop. Oh man, this is addictive! I'm chopping papers all over the place without writing the papers that need to be written!
 
 <hr>
 I couldn't resist the desire and since I didn't have a cutter, I giggled with a cutter knife. I read it and made a leverage memo, saying it was a book I was going to throw away and I didn't care if it failed.
 
 f:id:nishiohirokazu:20091002225410j:image
 
 In the beginning, I cut too close to the groove, and in one case, two pages were left attached, so I had to jam it six times. It was a bit of a mess, but when I stretched it out, it read fine. It's evolving. It stopped when it realized it was wrinkled. It's very convenient. And in the second half, I cut with a bit of leeway, so it was nonstop. You can play enough with a cutter knife. Total of 243 pages. It took me less than 5 minutes to OCR the whole pages. 2.4GHz Core2Duo. 28MB file size, surprisingly small?
 
 *12544496393*Tidied up.
 I cleared off my desk to put the ScanSnap on it.
 
 f:id:nishiohirokazu:20091003001223j:image
 
 Equals no place to sleep.
 
 f:id:nishiohirokazu:20091003001322j:image
 
 Wait, isn't the mess bigger than the area cleaned up?
 
 *1254499819* Forcing tension.
 <a href="http://www.amazon.co.jp/gp/product/4569696791?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=4569696791">Study Methods to Make the Most of Your Brain</a><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as2&o=9&a=4569696791" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" />Read in 5 minutes.
 
 16 seconds left, success. This book says that it is important to voluntarily put pressure on yourself and experience success by dividing your time in this way.
 
 <hr>
 
 Next read in 15 minutes.
 
 
 Mwah, I took my time reading it carefully on the way and timed out at P89. In the end, it took me 32 minutes. Well, it took me about 30 minutes last time and the time before that, so I guess it would take me about that long if I didn't read in 5 minutes or something super skimming. Maybe I'll try 25 minutes tomorrow night if I read something.
 
 I'll make a leverage memo tomorrow morning.
 
 <hr>
 
 Well, but it was fun to put pressure on them by dividing the time.
 Tomorrow's top priority TODO is to finish the two documents I didn't end up writing today because I didn't feel like it, but I think I can do that in 60 minutes, so I'll do that in 45 minutes. After that, I will make a leverage memo in 45 minutes.
 </body>
 <comments>
 <comment>
 <username>Okazaki</username>.
 <body>I think the Windows version of ScanSnap Manager can do OCR in batch processing afterwards. <br>In case of Mac, Acrobat Standard/Pro + AppleScript. </body><br><br
 <timestamp>1254492391</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-10-02 https://nishiohirokazu.hatenadiary.org/archive/2009/10/02]