Hatena2011-03-05
code:hatena
 <body>
 *1299329458* e-Tax Diary (Complete)
 Change Safari to 32-bit mode and start over.
 
 <img src="http://gyazo.com/b4e51b3babf8bb13b09ea8cd6cf80cba.png">
 
 Oh, what the heck, if I'm doing it in 32-bit mode, I'll get this dialog instead of keychain access. That way I won't put in the admin password by mistake.
 
 <img src="http://gyazo.com/d6e6c679c206cd83d479d838d604328f.png">
 
 Uboa. The official help page says, "Start the Public Personal Certification User Client Software (JPKI User Software), click on 'My Certificate' and check if it is displayed correctly. I tried it again, thinking that I could see it when I tried it before, but it turned out to be an error.
 
 I'll try the commands to make sure it works. All OK... hmmm?
 
 Okay, let's reboot. If something incomprehensible happens around the device, reboot it most anyway!
 
 <hr>
 
 <img src="http://gyazo.com/77106e469e4383ba5f38a2cdf8b2cedc.png">
 
 Oh, I really rebooted and it worked.
 
 <img src="http://gyazo.com/ec4499059f5217bf23c0119d26d4ed23.png">
 
 What, e-Tax PIN...? What was it...it says something like 8 characters or more, so I guess it's a different password from both the resident registration card and the e-certificate...I mean, did I decide on such a thing? Oh, I remember at the beginning it says, "*Please keep your PIN and tax confirmation number in a safe place." I don't remember that. That's it....
 
 <img src="http://gyazo.com/54b02d89c491b077d68e85974314cf0d.png">
 
 And when I try to get out, here's the keychain again... yes, yes. Put in the password for the card, not the admin password.
 
 A screen comes up to create a tax return form. First, I have payroll income from two places, so I finalize it on form B. I was asked if I wanted to file electronically. I said yes, since I've gone through all this trouble. They asked me if I had received approval to file a blue tax return. I put my date of birth.
 
 (omitted)
 
 I was able to do it. Something about having to pay additional taxes....
 I try to send it. I heard that those who have business income must also attach a journal of income and expenditure. I heard that you can input that information via eTax. I ran out of energy and went to sleep.
 
 (omitted)
 
 I had a hard time understanding where to save the xtx (I had to select "save to load in other accounting software," etc., which eTax itself uses, so why didn't it just say that?) The one line of explanation I had missed said "make a journal entry first", and it seems that if you had made a journal entry first as it says, you could transfer that data over to file your tax return.
 
 The transmission went somewhat too easily and was out of sync. I wonder if I did it right. On the contrary, I am worried.
 </body>

[Hatena Diary 2011-03-05 https://nishiohirokazu.hatenadiary.org/archive/2011/03/05]