Hatena2010-05-04
code:hatena
 <body>
 *1272980193* Putting Wikipedia on your iPhone
 To summarize briefly, you can use <a href='http://itunes.apple.com/app/ebpocket-free/id314082593?mt=8'>EBPocket</a> to read EPWING format dictionaries, so you can get Wikipedia dump data in EPWING to EPWING format via <a href='http://www.ceena.net/view.php?id=329'>BitTorrent</a>, etc., and <a href='http://www.digidna.net/products/diskaid/ download'>DiskAid</a> and put it on your iPhone.
 
 ref. <a href='http://www.iphooone.com/pukiwiki/index.php?iPhone%A4%C7%BC%AD%BD%F1'>Dictionaries on iPhone - iphone wiki</a>
 
 *1272986799*Singapore Summary
 - Singapore is roughly the same size as a ward of Tokyo.
 - Income tax is capped at 20% and local taxes are non-existent. The effective tax rate for someone with an income of about 10 million is less than 10%.
 - The maximum corporate tax rate is 18%. No cap on entertainment expenses. Tuition and school fees for family members of employees can also be expensed as part of the employee benefit package.
 - No inheritance tax (which I think we should have...)
 - There is no gift tax and no tax on gains on stock transfers. There is also no taxation on dividends or interest.
 - An "Entrepreneur Visa" exists. Business is a resource that Singapore, with its small land area, can have in abundance, so it is actively trying to attract them.
 - Private ownership of land is not allowed, so city planning by the state is very easy. It's smart. When developing underground, cities can be designed from scratch on a "new layer" because there is no need to bend over like in Japan. It is wonderful. In a few hundred years, we will have super-efficient underground cities like in science fiction. Less earthquakes.
 - The image of "littering is punishable by a fine" gave the impression that police officers with batons would be watching on street corners, but this is not true. Compared to Japan, there are enough trash cans and ashtrays to deter people from littering by flashing a high fine. That's smart. I hardly saw any policemen.
 - The services provided by local labor are generally inexpensive, probably because there is no minimum wage regulation. 200 yen will get you a fairly decent meal, and the first ride in a cab is 210 yen. 1,200 yen for a 25-kilometer ride. I heard that the monthly rate for hiring a maid is 20,000 yen. On the other hand, things imported from developed countries, such as Western books, Uniqlo, and iPads, are not cheap.
 - The salary of a 40-year-old official is as high as 30 million yen, and a public official who receives a bribe application is illegal unless the donor is arrested. The risk of bribery applications has jumped and is a strong deterrent. That's smart. Furthermore, public officials are required to prove their integrity if they are suspected of bribery (although it may be better to punish those who are suspected of bribery), which is a deterrent to holding meetings where bribery is possible.
 - Escalators are fast. No one wants to walk further on the escalator because it is faster than walking up the stairs. Naturally, the volume of traffic is doubled because one side of the elevator does not need to be opened. Smart.
 - Some universities have six-month to one-year internships for credit. Proper grades are given.
 - Convenience stores are full of 7-Eleven. Beverages are all over Pokka. Stationery stores are full of Kokuyo products.
 - Trains are standardized to be Suica-like. Train fare is 140 yen if you ride from one end to the other. The maximum amount is deducted at the time of entry and returned at the time of exit, so there is no need for a recharging machine at the ticket gate. It's smart.
 - Cars are taxed at higher rates to ease congestion, and the right to own a car is auctioned off. Smart.
 - There is no discrimination based on skin color or race (including preferential legislation for Malays, as neighboring Malaysia does), but there is a wide disparity and poor service for low-income people. There are private cars for executives, cabs for us, buses packed with dark-skinned people, and trucks with 30 dark-skinned people in the back, though I don't know how many because I didn't get in. It is not discrimination based on race, so even Indians can have their own cars if their income is high enough.
 - Pornography is illegal, but prostitution is legal only in government-run stores.
 - There are surveillance cameras everywhere. Even on trains.
 - All personal tax payments are online. The census is also online. It seems that the government offices are thinking, "Let's simplify and digitize the cumbersome paperwork, because we don't want to have to spend a lot of manpower on it. This is wonderful.
 - National health insurance does not exist. Private insurance is available. It is common for companies to insure their employees as part of their benefits package.
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=4822410293" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe><iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=4585104208" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe><iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=4120038882" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe><iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=490664077X" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe><iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=4775940139" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe><iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=4491024391" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 See also id:TOKOROTEN's summary: http://www16.atwiki.jp/tokoroten/pages/1213.html
 </body>
 <comments>
 <comment>
 <username>taka21st</username>
 <body>You can't tell about the health care system, rent, etc. just by sightseeing. </body>
 <timestamp>1273004117</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I didn't go to the hospital so I didn't see for myself, but if you believe Wikipedia, it looks like it's on par with developed countries. Rent doesn't seem to be cheap. </body>
 <timestamp>1273026501</timestamp>
 </comment>
 <comment>
 <username>Fujimoto</username>.
 <body>Mr. Nishio, it's been a while, I'm Fujimoto and I was a member of the Wii Tennis Tournament at dankogai's house. Are you in Singapore to prepare for starting a business? I am also going to Vietnam next month to set up a business office. I have been researching the possibility of setting up an office in Singapore as well, so this was very timely and helpful. I would be happy if more and more talented people like you could compete in Asia. Please do your best as one of the brains representing Japan! </body> </P> </P> <BODY>
 <timestamp>1273044077</timestamp>
 </comment>
 <comment>
 <username>I wish to remain anonymous</username>.
 <body>Well, it has nothing to do with foreigners,<br>but you should learn a little about issues such as the electoral system and freedom of the press. <br>Entrepreneurial preferences are good when business is good, but when business is bad, the flip-flop is extreme. </body>
 <timestamp>1273052408</timestamp>
 </comment>
 <comment>
 <username>b</username>
 <body>Some people seem to have the impression that Singapore is all about public housing, but there are also large mansions. <BR>There are many 7-Eleven stores, and it was easy to use them just like in Japan. <BR>It may cost a lot of money to own a car, but there doesn't seem to be a lot of people with bad driving manners. <br>Taxi fares and traffic charges are also cheap. <BR>The cities are orderly, the towns are clean, and there is certainly not a lot of garbage. <br>When I came back to Japan, I was surprised at the amount of garbage and bad manners. </body>
 <timestamp>1273059444</timestamp>
 </comment>
 <comment>
 <username>A</username>.
 <body>>The escalator is fast. No one wants to walk further on the escalator because it is faster than walking down the stairs. And of course, it doubles the amount of traffic because one side of the elevator doesn't have to be opened. Smart. <BR><BR>Isn't this crazy? <BR><BR>If one side of the escalator is for stay and the other side is for walk, the difference in the amount of transportation is a function of the speed of the escalators in the two countries and the speed of the people who choose to walk. <BR>When I see that old people are scared of the escalators in Japan because they are too fast, I wonder if Singapore is more developed in elevators. </body>
 <timestamp>1273060732</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>The fast escalator and the fact that there were only 6 seconds left when I crossed the street with my foot on the signal made me think that maybe I'm not old enough for the elderly. </body> I was wondering if I am too old to be kind to the elderly or not.
 <timestamp>1273061058</timestamp>
 </comment>
 <comment>
 <username>catch</username>
 <body>I lived there for a couple of years. I even set up a company (although I couldn't get a visa because of the recession)<br>Convenience stores: there was a government-owned one (I think) called "cheers! <br>Escalators: they were often out of order. <br><br>This was around 2003. </body>
 <timestamp>1273069791</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Mr. Fujimoto:<br>It's been a while. This time, I am not planning to start a business in Singapore, but it was just a sightseeing trip for my friend who was going to visit Singapore as one of the options. Thanks to this trip, I was able to learn more than I would have been able to if I had just gone sightseeing. </body>
 <timestamp>1273074603</timestamp>
 </comment>
 <comment>
 <username>Fujimoto</username>.
 <body>Oh, I see. I plan to rent a place in an offshore development company in Hanoi, Vietnam to create my own system development department (right now, all system development is outsourced). I plan to live half in Japan and half in Vietnam. Please come visit me! </body>
 <timestamp>1273076603</timestamp>
 </comment>
 <comment>
 <username>Name</username>.
 <body>If you vote for the opposition, the lifeline stops, right? </body>
 <timestamp>1273127995</timestamp>
 </comment>
 </comments>

[Hatena Diary 2010-05-04 https://nishiohirokazu.hatenadiary.org/archive/2010/05/04]