Hatena2009-02-25
code:hatena
 <body>
 *1235524375* "Human Life is Heavier than the Earth"
 There was a time when I thought to myself, "No, that can't be true."
 
 
 No, it's pointless to compare the importance of human life to the earth in its inhabited state. You have to consider which you would choose under the condition that "saving one person's life would result in the loss of the Earth, but would not interfere at all with the lives of others." So, the off-planet colonies are already developed enough to cover the entire population, and the people remaining on the planet are in a position to migrate easily. It must be so contaminated that an evacuation order has been issued. So, there were people who lived back in the evacuation zone at the time of Chernobyl, and there are people who are stubbornly sticking to that planet as well. Here we have an emergency situation. An asteroid has been discovered that is moving toward the asteroid where the mother computer, a facility that has nothing to do with human life but is very important, is located, and if nothing is done, it will collide with the asteroid in about 300 years. The asteroid is too heavy to destroy. The only way to avoid the impact is to slow down the Earth's rotation a little, so that when the meteorite approaches, it will pass by the Earth and be deflected by gravity, thus avoiding impact. However, if we do that, the earth will fall into the sun. What should we do?
 
 
 I had a dream that In the first place, don't concentrate the mother computer in one place, future man.
 
 *1235528134*夢
 I don't dream much. I thought that's why I don't dream, because I heard other people talk about their dreams and assumed they were dreams. But when I wake up, I sometimes find that bits of my thoughts are still there.
 
 *1235528348*Google App Engine 課金開始
 <img src="http://gyazo.com/54430ab65366e808d6e93401dee8f4aa.png">
 
 This is a great way to get a big break in service at any time (if you have the money).
 
 <img src="http://gyazo.com/79b5c222e3a7f0a4131ba01646fa46bf.png">
 
 So far, though, I don't see any signs of that at all.
 
 *1235531316* GAE Datastore cannot use float when narrowing by inequality sign for IntegerField.
 I'm trying to get "90%-110% of the specified price" right now.
 
 >|python|
     frm = price * 0.9
     to = price * 1.1
 
     for x in (Item().all().filter("crawled", True)
               .filter("price >=", frm)
               .filter("price <=", to)):
 ||<
 
 When I wrote that, I had trouble finding a match for anything.
 
 >||
     frm = int(price * 0.9)
     to = int(price * 1.1)
 ||<
 
 It worked when I turned it to
 
 *1235534947*家事
 Since we could not keep up with the normal consumption, we decided to make a black pot for dinner today, using whatever we had in the freezer and refrigerator.
 
 
 I wondered why the rice was so sticky, but it seems that I probably put all the water in the 500cc cup after adding the rice. Usually, I just pour the water into the 500 cc cup and fill it according to the line of the kettle.
 
 
 I got some kind of postcard for mail forwarding. I heard that I have to send it to a place called "relocation notification management center". And it takes about a week. It's 3 days after I moved out. Well, it looks like the opening of the mail box after I move out is just taped with masking tape, so I guess I'll have to remove it and come back to collect the mail in a week. Anyway, I'll get out of here as soon as possible.
 
 
 By the way, this is the first time I see this change of address form... I wonder what I did when I moved from Chiba to Tokyo before... It was 2 years ago, so I don't care, I don't care.
 
 
 I was able to write it down. I took it out and went to the ward office next. I had to come back because I didn't have a stamp. Next time, I will bring it with me. On the way home, I went to a 100 yen store and bought a rubber band.
 
 
 I forgot my notebook and had to come back after all. I am not sure between National Health Insurance and Social Insurance. Are employees covered by the National Health Insurance? I am also not sure about the National Pension Plan and the Employees' Pension Plan. It seems that those who are enrolled in the Employees' Pension System are also enrolled in the National Pension System as a Category 2 insured person. So, should I just circle both? Or should I just read the situation and put a circle only for the Employees' Pension Plan? Well, if I don't have enough circles, they will make up for it on their own, so I'll choose the one with the fewest circles.
 
 Task serialization completed
 - Setting up mail forwarding
 - □ Go to change your certificate of residence
 - □ Buy rubber straps
 - □ Bring halogen heater, beaded cushion, and blanket to new house
 - □ [2009-02-25 17:00]@ gas open on 17-19 witness
 Do it in order.
 
 
 Residence card done. change of residence card must be done after moving. I was told that since I was not required to prove when I moved out, I should assume that I moved out today, so I did.
 I also bought a rubber band.
 
 Carry cushions and blankets.
 f:id:nishiohirokazu:20090225163623j:image
 
 f:id:nishiohirokazu:20090225165050j:image
 
 f:id:nishiohirokazu:20090225165128j:image
 I have to get some toilet paper.
 
 
 For now, I'm just going to pack my clothes, as I only need them for the remaining two days of the trip.
 
 
 Ahhhh, isn't today Wednesday? It's the day for recyclable garbage! I forgot to take out the magazines that I left under my feet, intending to put them out on the garbage day!
 
 
 I'm in the process of filling out the credit card payment form for the gas bill. I think it would have been easier if I had paid by credit card. I just realized it now.
 I'm done writing and I'm going to get it out.
 
 
 I made a pot and ate it, then I got sleepy.
 
 <hr>
 - Setting up mail forwarding
 - Go to change your certificate of residence
 - Buy rubber straps.
 - ■ Bring beaded cushions and blankets to the new house
 - [2009-02-25 17:00]. Open on gas 17-19 Witnessing
 
 - □ Put what you see in the box anyway
 - □ Transporting items that do not fit in the box by bicycle
 - □ PCs and other fragile items are carried on bicycles in a leisurely and safe manner
 -- □ LCD
 - Toilet paper
 - □ Carry halogen heaters?
 
 - Move 2009-02-27 13:00-18:00 Time will be notified after noon the day before.
 - Prepare 31,500 yen in cash on the day of the event.
 - □ Refrigerator must be emptied and turned off about 3 days in advance
 
 - Gas, electricity, and water service are available.
 -- □ Gas
 --- □ [2009-02-28 9:00]@ close witnessed by Gus 9-12
 --■ 水道
 --□ 電気
 --- □ [2009-02-28]@ electricity service stopped Coming to check meter in the morning of 28th.
 --- □ Turn off the stability breaker
 
 
 
 
 - □ Change of address of license
 - □ Wash the contents of the washing machine before moving
 - □ The notebook is full of old addresses and other information, so I will print it out and replace it in the near future.
 - Checklist so you don't forget to move
 -- □ Replace the water-saving shower head with the original shower head.
 -- □ Remove curtains
 -- □ Toilet paper
 -- □ 照明
 
 *1235555779*Cooking of the Day
 Pot. The water is boiled with kombu as usual.
 
 
 What will be introduced this time
 - Frozen Seafood Mix 170g (2007-02-21)
 - Frozen Broccoli 200g(2007-03-26)
 - Frozen Spinach 300g(2008-05-08)
 - 冷凍7種の和風野菜400g(2007-09-10)
 
 
 I bought them because I was told that it would be useful to stockpile frozen vegetables, but that statement comes with the basic premise that "if you know what's in the refrigerator and have the skills to use them as ingredients for cooking in a flexible manner. In the end, it sat in the freezer for a long time without ever being used.
 
 
 f:id:nishiohirokazu:20090225185952j:image
 </body>

[Hatena Diary 2009-02-25 https://nishiohirokazu.hatenadiary.org/archive/2009/02/25]