Hatena2009-09-22
code:hatena
 <body>
 *1253599402*Diary of holiday doldrums
 Yah, what do I do?
 
 Anyway, it's already 3:00 p.m. and I haven't eaten anything, so I guess I'll go get something to eat.
 
 *1253623994* I understand now.
 RT @nishio: I felt like I was in the position of Osaka (Ayumi Kasuga) in Azumanga. Sequel to
 
 >>
 nishio: 
 Ayumi Kasuga is cute.
 But you can't say "Ayumi Kasuga is my wife."
 Lives will be ruined.
 It's hard enough to get by on your own.
 <<
 
 >>
 xxx:
 Is Osaka something to be appreciated and enjoyed?
 <<
 
 >>
 nishio:
 Mm. Something to look at and nimble.
 damn!
 So I'm popular with married people and not with unmarried people.
 I understand now.
 So they are unreliable as marriage partners but interesting to watch!
 I understand now!
 <<
 
 Understood!
 
 >>
 yyy: Nishio-kun stifled the words "something to be appreciated and enjoyed.　Yes, I held it in.
 <<
 
 I don't have to tell you!
 
 **1253626135* The statement that "I'm not motivated" is not scientific, because it's not a scientific statement.
 Reprinted with additions of thoughts I had while going to lunch today because I was feeling unmotivated:.
 
 >>
 The lack of motivation or how to motivate is a vague argument because motivation isn't quantitatively defined.
 //
 For example, it should be defined using quantitatively measurable features such as "the speed at which tasks on the task list are digested".
 //
 There are at least three patterns to the problem of "slow digestion of tasks on the task list.
 //
 First of all, there are so many tasks that it is hard to decide which one to do. This was discussed last time. If you write not only what you really have to do (MUST TO DO) but also all the things you want to do (WANT TO DO) on the task list, the speed of adding tasks will exceed the speed of processing, and management by task list will collapse.
 //
 Next, the granularity of the task is too large, and the task is actually progressing, but you cannot see it, so you do not feel a sense of accomplishment. This should be broken down. Or, when you feel like you are not making progress, write down what exactly you did. You may be caught up in the feeling that you haven't done anything, but in reality you have completed a variety of tasks.
 //
 The third is a state in which tasks have disappeared as a result of removing all but the must-do tasks from the task list. I know I should just relax since it's my vacation, but I can't do that because of the obsession that I am wasting my time.
 <<
 
 So, my "MUST TO DO" list was empty, but I was having a hard time deciding which tasks to promote on my "WANT TO DO" list. But, well, I took a walk and remembered that tomorrow is garbage day, so I did the tasks of collecting empty cans and washing PET bottles. Now, what should I do?
 
 *1253627385* The fact that you can't pick one means there's not much difference.
 Tasks you want to do
 - Read Organizing HACKS
 - iPhone Apps
 -- Rewrite the one you're about to make so that it doesn't use NSThread
 -- Create a new sound system application.
 - Electronics
 -- Assembling the brainwave sensor
 -- Reassembling an electronic music box with working music
 --- <a href='http://d.hatena.ne.jp/nishiohirokazu/20090713/1247458741'>Electronics Work Study Session (Summary)</a> I made a teetering music box in <a href='http://d.hatena.ne.jp/ nishiohirokazu/20090728/1248796891'>Today's Electronics Workshop 2</a> because I took it apart. I also want to change the song. I wish I could convert from MML or something, since the songs are pretty tedious hard-coding right now.
 - Web application for recording leverage notes
 
 Okay, well, I'll read books when I can't code, like on the train or in transit. I put the book in my bag.
 </body>

[Hatena Diary 2009-09-22 https://nishiohirokazu.hatenadiary.org/archive/2009/09/22]