Hatena2008-03-23
code:hatena
 <body>
 *1206221063*[Mac]GarageBand
 impossible
 
 *1206221953*[1000speakers]3rd 1000 Speakers Conference
 (gradual angle)
 
 Well, this time it was held at Dwango in a hurry because I forgot to secure Cybozu Labs. The biggest drawback of Dwango's venue is that the nearest station is Hamamachi, but somehow I felt like it was Hamamatsucho. But I didn't make a mistake, you know!
 
 Video for now
 - http://www.nicovideo.jp/mylist/5754338#mm_a
 I thought it was in reverse order with the time because my "4th guide" came at the top, but I guess they intentionally put the guide at the top. Understood.
 
 For more information, please click here:
 - http://ja.doukaku.org/wiki/index.php/1000speakers:3
 Perhaps a link to the presentation materials and other information will be posted here.
 
 Well, the keynote speaker was a trio of high school students, and <strong>Japan has begun</strong> (see below).
 Anyway, you should watch the video. It's a live presentation, not a fake or studio shot.
 
 - Behind the Scenes of Presenting at 1000speakers - High School Struggles http://d.hatena.ne.jp/lonlon2007/20080323/1206281934
 
 >>
 '1000Speaker Invited! Do you want to talk? Do you want to just listen?' and id:Tnzk said to me, 'Wow! Wow! I'm busy right now, so I'll just listen! But I'm busy right now, so I'll just listen. I'm busy right now, so I'll just ask. Tnzk said, "Okay, I understand. At that time.
 
 But somehow, Tnzk said something like, "I'll tell you all about it.
 <<
 
 Tnzk good job!
 
 In response to the question about how many people are from technical colleges
 >>
 13:29:01 <mootoh> Cluster of technical colleges
 13:29:01 >nishio< ５人いる
 13:29:05 <youzaka-2> Cluster of technical colleges
 13:29:06 >nishio< 高専＋＋
 13:29:06 <suztomo> 高専多いな。
 13:29:07 <otsune> 高専おおいな
 13:29:14 <trapezoid-1> messenger from the cluster of technical colleges
 13:29:14 <noplans> 高専多いな
 13:29:19 <griffin-stewie> amachang高専なの？
 13:29:20 <yokochie> 東京高専だお
 13:29:21 <suztomo> college students are minor
 13:29:26 <showyou> Cluster of technical colleges vs. unexplored cluster
 <<
 高専++
 One thing I'd like to add is that unexplored attributes and high specialization are not opposites.
 - Kyosuke Inoue, Tsuyama National College of Technology, certified as a super creator!
 -- http://www.computernews.com/scripts/bcn/vb_Bridge3.dll?VBPROG=ShowWeeklyArticle&MEM=1&Title=%91%E648%89%F1%81%40%92%C3%8ER%8D%82%90%EA%81%40%88%E4%8F%E3%8B%B1%95%E3%82%B3%82%F1&File=F:%5Cinetpub%5Cwwwroot%5Cbcn%5CWeekly%5CITJr%5C20070521.htm
 Let's have Inoue-kun give a keynote speech as well (and the method of writing this without his approval at all).
 
 ----
 -1000speakersでの基調講演を終えて - I CAN ’CAUSE I THINK I CAN (Re-again) http://d.hatena.ne.jp/Tnzk/20080323/1206273177
 >>
 The theme of the 1000 Speakers Project is "We want to hear what you have to say now!" The theme of the 1,000 Speakers Project is "We want to hear what you have to say now! I am the person I am today, including my lack of experience, and I am sure there are words I can speak because I am in such a situation.
 <<
 I felt a jolt.
 I suppose some people might interpret the line "high school students are amazing" to mean "high school students (who can do ____) are amazing", but it's "high school students (or whatever) are amazing without that".
 
 -----
 Make a list of things to do to be popular.
 >>
 14:32:15 <griffin-stewie> Oh! You recapitulated my question.
 14:32:26 <suztomo> mootohはモテ
 14:32:56 >nishio< People who can recite the question are mote
 <<
 Therefore.
 
 -People who can recite the question are popular.
 -Presentations with large letters in the demo are mote
 -Large font in the terminal is mote
 -Undaunted Attitude is Popular
 -A person who does not fall behind is a mote
 
 Other items mentioned in the chat
 - Kansai = Motivational
 - Three elements of mote: Kansai dialect, question recitation, and easy-to-read font.
 - People who prepare extensions are mote
 - QIQ = Popularity
 - Extend language with language = popular
 - If you're doing PHP, you'll be popular with planning girls.
 -- I can't have py because it's an obscene name.
 - Tall = popular = popular = sharp face = popular
 - People who can tinker with hard ware in person are popular
 - People with a wide range of interests are popular
 - People who can play the piano are popular
 
 Seriously, I think being able to recite a question for the person on the other end of the ustream even if you are nervous about the presentation, or keeping the text large for the person watching through the ustream, is similar to being attentive on a first date even if you are nervous. I can't do it, so I'm not a good candidate.
 -----
 Oh, mootoh.
 >>
 I've written down some of the things I've noticed that I wish I'd done after talking to you on the 1000speakers wiki. I think it would be good to add to it.
 <<
 http://blog.deadbeaf.org/2008/03/23/1000speakers-3-dokodemo-yubipiano/
 
 After all, "mootoh is mote". Tips page is here: http://ja.doukaku.org/wiki/index.php/1000speakers:tips
 -----
 http://zisakuzien.exblog.jp/7579818/
 >>
 I looked around the hall and saw no women except myself.
 <<
 Could it be: because id:publiclichtml didn't come?
 
 >>
 I'm thinking about whether or not I should apply to be the next person to speak.
 Several people said, "I thought about what I was going to talk about after I decided to talk," so I thought it would be okay if I took the plunge too.
 <<
 
 I think it's good. It doesn't make much sense to say "after you decide what you want to talk about" because the content of what you want to talk about may change as you are working on your presentation materials.
 
 ----
 http://d.hatena.ne.jp/bash0C7/20080323/1206276183
 
 Excel is a great case.
 ----
 
 
 - Third party (hackathon until morning)
 -- id:ykzts was showing some kind of mysterious pinkish, periodically changing image on the wall of the lab. It must be some kind of media art. I don't think he's doing this, do you?
 -- leave the rest to the two young guys (id:nyaxt and id:viver, who make distributed file systems)
 --- I heard that the process of making it is available on Partty. I'll link to it later.
 -- I'm so sleepy.
 -- I tried GarageBand, but failed to do anything interesting. I'll bring Udder next time and connect it.
 
 *1206241273*[1000speakers]SEO
 This is terrible! Search for "1000speakers" and the video that comes to the top is of Nipotan puffing on a condom!
 全力で<a href="http://ja.doukaku.org/wiki/index.php/1000speakers">1000speakers</a>SEOする。
 
 *1206253293*I'm in Minami-Senju
 
 The train is behaving in an unintended way.
 
 *1206294841* Lily!
 >>
 I've also learned that online impressions aren't everything.
 
 Before I actually met id:itkz, I thought I would be stung if I looked into his eyes, but what a kind and nice person he was.
 
 I mean, he's tall and handsome. Really.
 <<
 http://d.hatena.ne.jp/rosylilly/20080323
 
 Oh my gosh, cute Lily has leaked confidential information of Durango Co! My sweet Lily is going to get stabbed by itkz!
 </body>
 <comments>
 <comment>
 <username>earth2001y</username>
 <body>つぎはiMovieで。</body>
 <timestamp>1206221328</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-03-23 https://nishiohirokazu.hatenadiary.org/archive/2008/03/23]