Hatena2009-11-01
code:hatena
 <body>
 *1257028459*卵
 <img src="http://gyazo.com/33209999a9e00213f066067a65e5b266.png">
 
 *1257060058*登場人物紹介
 I'm starting to think it might be surprisingly interesting.
 
 
 f:id:nishiohirokazu:20091101161945j:image
 
 *1257074806* First iPhone app rejected.
 I submitted on October 14 and received a reply on October 29. Here is the translation. I didn't know I would get such a detailed explanation. I was surprised that it took so long to get such a detailed explanation. I was expecting a one-line comment like, "Read the iPhone Application Programming Guide," so I was surprised. If I get such a detailed explanation, I can learn a lot even if I get a rejection.
 ------
 Nishio, thank you for submitting ConicFilm to the AppStore.
 We have reviewed ConicFilm and have determined that this version of your iPhone app cannot be published on the AppStore. The reason is that this app does not follow the document "iPhone Application Programming Guide" as stated in Section 3.3.5 "The app must follow the Human Interface Guidlines and other Apple-provided documentation" of the iPhone Developer Program License Agreement. iPhone Application Programming Guide" in the iPhone Developer Program License Agreement.
 
 It is not possible to take a picture from your app using the camera function on the iPod touch, if ConicFilm is installed on the iPod touch and the user taps the Start button and the button that says "Camera" on the action sheet that appears as a result, The action sheet disappears but nothing happens. I have attached a screenshot for your reference.
 In the "Taking Pictures with the Camera" chapter of the iPhone Application Programming Guide, the procedure for determining whether a device supports a camera using the isSourceTypeAvailable class method is explained. Please take a look at it.
 The interface managed by the UIImagePickerController class may not be available on all devices. Before displaying the camera interface, you must always check if the interface is available by calling the isSourceTypeAvailable class method of the UIImagePickerController class. Be sure to check the return value of this method. If the return value is NO, it means that the device does not have a camera or is currently unavailable for some reason. If the return value is YES, then the camera interface is displayed.
 
 http://developer.apple.com/iphone/library/documentation/iPhone/Conceptual/iPhoneOSProgrammingGuide/iPhoneAppProgrammingGuide.pdf
 
 To reconsider publishing your app in the AppStore, please resolve this issue and upload a new binary to iTunes Connect.
 
 If you need further help resolving this issue, direct one-on-one assistance is available for individual code-level questions at Apple Developer Technical Support. Please remember to include a crash log and screenshot or steps to reproduce the issue when making your request.
 </body>

[Hatena Diary 2009-11-01 https://nishiohirokazu.hatenadiary.org/archive/2009/11/01]