Hatena2008-04-10
code:hatena
 <body>
 *1207788781*電車
 Looking at the fragility of Tokyo's rail network, I wonder if I should live within walking distance of my office in the event of an earthquake or terrorist attack, at the very least.
 
 *1207793450*Cold
 f:id:nishiohirokazu:20080410111050j:image
 
 *1207801479*昼御飯
 
 I was going to go to a vegetarian place called Pita, but I wasn't sure. In the end, I went to a Thai restaurant. I haven't explored the city at all.
 
 *1207810632*Foolish consistency is the hobgoblin of little minds. 
 In number 8 of PEP, the RFC of the Python world, which describes the coding style of Python (http://www.python.org/dev/peps/pep-0008/), the opening sentence is about "Foolish consistency is the hobgoblin of little minds.
 
 I searched alc for the meaning and found that this is a line from a celebrity in its entirety.
 >>
 Foolish consistency is the hobgoblin of little minds.
 Stupid coherence is the product of a narrow mind.
 <<
 
 The coding style is a set of recommendations, but it is not a good idea to follow it as if it were a golden rule. If following the coding style makes it harder to read, then the coding style should be broken, and so on.
 
 *1207819687*Blog with real name
 I just realized something.
 
 <a href="http://cruel.org/freeware/hacker.html">How To Become A Hacker: Japanese</a>
 >>
 Finally, do not
 
 - Don't use boring, exaggerated IDs or handles.
 
 (中略)
 
 　Shall I go into more detail about the problems associated with handle names? Hiding one's identity behind a handle is a childishly stupid behavior characteristic of crackers, warez d00dz and other lower forms of raw. Hackers do not do this. They are proud of what they do and try to engage in it under their real names. So if you have a handle, throw it away. In the hacker culture, it will only mark you as a loser.
 <<
 
 I wonder if this is one reason why so many English-language blogs have real names. In other words, not using one's real name is evidence that one is not proud of one's activities.
 
 *1207820939*yasnippet 0.5.0 released
 http://code.google.com/p/yasnippet/source/browse/trunk/snippets/text-mode/python-mode/class
 
 Oh, it's got my name on it.
 
 *1207839511*Jython本の口癖
 Mr. Takezako read it and pointed out to me that "actually" appears 35 times. Also, "troublesome" appears 40 times, but since laziness is one of the virtues of programmers, I will not correct it. It's troublesome. (Oh!
 
 *1207840190*入稿
 I hear it's early morning on the 14th.
 
 *1207846236* I got the author's introduction written.
 http://subtech.g.hatena.ne.jp/keyword/nishio
 >>
 He has taken the world by storm as a Python one-liner performer. In recent years, he has been spreading protein day and night at Cybozu Labs. A walking moe factor. Sexually unexplored super creator.
 <<
 
 I don't want to buy books by such authors!
 
 *1207846584* Calibration done.
 The rest will be emailed by tomorrow evening with the contents to be included on the CD.
 
 I was told about a manga café near the lab, but my mental and physical strength has been depleted and I am too tired to go to the manga café. I don't think there are beds and futons in manga cafes, and I feel like sleeping in the lab wouldn't make much difference.
 
 *1207847003*Google App EngineのInvitation来た
 >>
 You have 0 app creations remaining.
 <<
 
 Bullying?
 </body>
 <comments>
 <comment>
 <username>TOKOROTEN</username>
 <body>Well, I am a lowly man. </body>
 <timestamp>1207863889</timestamp>
 </comment>
 <comment>
 <username>jj1bdx</username>
 <BODY>In the end, it comes down to whether or not you have an idea of what kind of brand you want to sell yourself under. I have had a web page since 1995, and my name and call sign have been exposed on USENET since 1988, so there is no point in hiding them now. <BR><BR>On the other hand, in Japan, there is a social problem that individuals cannot come forward because of a strong fear of the organization. They are afraid that they will be hung out to dry. Not only do you have to be proud, but you also have to have a contingency plan to find a new life when you get fired, and you have to be careful about what you say. But it's the same all over the world that heads roll quickly. </body>
 <timestamp>1207872571</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-04-10 https://nishiohirokazu.hatenadiary.org/archive/2008/04/10]