Hatena2013-08-18
code:hatena
 <body>
 *1376755948*Re: Why Perl is fading fast in Japan
 As a Python user, I would like to say a few words about <a href='http://anond.hatelabo.jp/20130307004741'>why Perl has faded so quickly in Japan</a>.
 
 >>
 >Finally, it is Python that has put an end to Perl. The scope of defense is, of course, the same as Perl's, and it's a waste of time.
 <<
 
 What, Perl and Python's defenses are so different, how narrow is the author's observation of the "defenses" of each language?
 
 
 Well, let's not poke around in such a heavy-handed way. The concluding sentence (or part of it) is very nice in this entry.
 
 >>
 >Times will change so much in 10 years. Today's main technology will be ours tomorrow.
 >We live in an era of rapid change, and what we need to do is to learn the essentials.
 >We need to learn more information engineering that will not fade away after 10 or 20 years.
 <<
 
 Yes, that's where a book like my book "<a href="http://www.amazon.co.jp/gp/product/477415654X/ref=as_li_ss_tl?ie=UTF8&camp=247&creative=7399&creativeASIN= 477415654X&linkCode=as2&tag=nishiohirokaz-22">techniques supporting coding</a>"! (advertisement)
 
 By the way, I don't use Perl myself, either for work or pleasure, but in this book I use Perl to explain scopes and object systems. Perl is a good language. It is hard to say whether it is an option for creating something now, because it depends on the knowledge of the engineers who actually work on it and the cost of education, but all languages will decline in the long run anyway. If, as the author says, "what we need is to learn the essence of the language," the shortcut is not to dislike or belittle other languages, but to accept the reality that they were created for a reason and spread because of a need, and to think about what that reason or need was.
 
 Therefore, my book "<a href="http://www.amazon.co.jp/gp/product/477415654X/ref=as_li_ss_tl?ie=UTF8&camp=247&creative=7399&creativeASIN=477415654X &linkCode=as2&tag=nishiohirokaz-22">The technology behind coding</a>" (see below).
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=477415654X" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 </body>
 <comments>
 <comment>
 <username>kokokara</username>
 <body>>What, Perl and Python's defenses are so different, how narrow is the author's observation of the "defenses" of each language? <BR><BR>I think this is just a tit-for-tat, or rather, it's just a yadda-yadda-yadda. <br><br>If you think that "Perl has some strengths that Python does not", please give specific names and explain that Perl is good at it for this reason, etc. </body>
 <timestamp>1376841635</timestamp>
 </comment>
 </comments>

[Hatena Diary 2013-08-18 https://nishiohirokazu.hatenadiary.org/archive/2013/08/18]