Hatena2012-07-30
code:hatena
 <body>
 *1343616023* What we want to make: e-book reader for technical books
 A summary of what I tweeted yesterday on Twitter. I wonder if there is already an app like this. If there is, I'd be happy to use it. Please let me know if there is.
 
 ** 技術書と小説の違い
 - The major difference from the novels in technical books is that in many cases, random access is required instead of sequential access.
 -- There is a need for a reading style in which readers do not read from the beginning like a novel, but rather "take a quick look at the book and read only the necessary parts carefully.
 -- How to realize "skim reading" on an e-book viewer?
 -- Reducing a page as an image will only result in a pile of "totally unreadable garbage information" because it's not a comic book. Need to display only chapter titles, or only bold text, figures, etc.
 -- Search and tag cloud (search keyword suggestions) are important for "where did it say that?" assistance after a quick read.
 
 - Vertical writing support is not required.
 
 ** Have high ideals
 - The e-book viewer must be able to bookmark a page with the same amount of effort as it takes to fold a page (one flick), and it must be able to open that page with the same amount of effort as it takes to open a folded page.
 - The e-book viewer must be able to place a marker anywhere in the text with the same amount of effort (two flicks) as taking a sticky note and placing it. It must also be able to open a page with the same amount of effort as opening a page on which a sticky note is posted.
 - E-books must be able to be turned within the same amount of time with the same amount of effort (one flick) as turning a page. It must be possible to view a page with the same or better quality with the same or less overhead as bending and flipping a page.
 - The e-book must be able to highlight at the same cost as drawing a line with a red pen and write on a sticky note at the same cost as writing on a sticky note. It must be able to do the same amount of work with the same amount of effort as turning a page with a red pen in your hand.
 - As for stickies and the red pen, since they must be usable with a single action, it is necessary to have a menu on the screen at all times, or to be able to bring them out with a single gesture. Also, in order to be able to flip pages even when holding the red pen, the range of movement of the red pen needs to be limited, or page flipping needs to be allowed with two fingers, not just one finger.
 - It is a very naive implementation to simply display a reduced image of a single page when an e-book presents information on a single page on a limited screen size, and yes, there are needs that can be met with that, but it is not enough at all. It could at least be done to display only the chapter title or bold text in the space available by squashing out the ground text. In targeting books that need to be read diagonally, it lacks imagination to be okay with displaying a PDF on an iPhone and presenting an unreadable one-page image that is only reduced to a single page when displayed on a single page. Even in that state, it should be possible to somehow see what is written on the page.
 - E-books need to be able to "tighten a certain space in our daily lives to make their presence known and be picked up whenever we feel like it," at a cost comparable to that of a stack of actual books. To achieve this, it is probably not enough to remain as "an application for mobile devices" or "an e-book reader.
 
 ** Writing becomes a positive value instead of a defacing (= negative value)
 - The ability to write, sticky note, redline, and dog-ear on the pages is a given, but rather the ability to insert notes written while reading the book, whiteboard photos of discussions with colleagues, mind maps, etc. into the book is important.
 - With paper books, it is not so easy to cut, paste, and insert, but with digital data, it should be easy to keep the "original" and create a scrapbook derived from it, or insert your own notes to create a more personalized anchovy.
 
 - What eBooks can do. Share the stacked state. Share writing (active meta-information). Share statistics (inactive meta-information) such as which pages were opened and for how long. You can reread the original, untainted version of the book after any writing.
 - There is an assumption that it is wrong to write in a book borrowed from the library, but I once found a book I borrowed from the Kyoto University Library with a meticulously written note in the margin about a mistake in the text, which was very helpful. Paper books with invasive writing have raised the bar for such communication.
 - An e-book viewer can also be a platform for secondary creation. Adding supplementary explanations or sample code to difficult points in a technical book is secondary creation, as is having a fujoshi fantasy in the margins while reading an ordinary novel. In order for this to be sufficient as a platform, it is essential to have a function that separates the place from the rest.
 - Many people have been created who hesitate to write on paper books because of the stain that writing on them cannot restore them to their original state. This is a great loss.
 - What you can do with an e-book: Instead of handing out errata, distribute it as an official write-up for the book. Readers write and post their questions and comments. The author responds, or someone else answers. A community underlining the content.
 
 ** Summary
 - Hmmm, after writing this, I thought, I would most like to have a summary display on a small screen. It seems to be the most difficult. The next thing I want is to flip through the pages, which will also require the device's performance to run smoothly. The rest of the features are not difficult at all, but I don't know.
 
 ** Reactions, etc.
 - @atsuoishimoto: I'd like to see a "frequently viewed pages" feature for technical books.
 - @voluntas: and then there's the social function and it comes up with "others often refer to this page", I get it.
 - @nishio: I should rather write a book review on my blog and say, "You can see how many pages I've opened with this app. Oh, I see...rather, if I open the book review with that app, I can jump from the citation!
 
 - @sir24de3: It is sort of realized in a platform called lindoc.
 
 - @koizuka: I can't see the relevant part of a sticky note until I open it, but it's nice to have the extracted contents listed in an electronic format.
 
 - @lostnumber00: Couldn't the summary display be made up with stats on what was lined? I'm afraid it's going to devolve into a chicken-and-egg argument. w
 
 - @tagomoris: I was wondering if it would be possible to display the summary on a small screen by showing only the headings + reducing the size of the charts. There's usually at least one subheading per spread.
 
 - &#8207;@kyo_ago: I want a book where I can rewrite code on the fly and run it.
 
 - @atsuoishimoto: I want to use a slider or jog dial to flip through pages in an e-book reader. I'd like to have feedback of a click or a click on my finger when a mark is on a page, so that once I get used to it, I can display the page I want without looking at the screen, just by clicking.
 </body>

[Hatena Diary 2012-07-30 https://nishiohirokazu.hatenadiary.org/archive/2012/07/30]