Hatena2009-10-30
code:hatena
 <body>
 *1256877461*急性低音障害型感音難聴
 It is an ear disease of unknown cause (one theory is that it is caused by stress), and there is no clear boundary between it and <a href='http://ja.wikipedia.org/wiki/%E7%AA%81%E7%99%BA%E6%80%A7%E9%9B%A3%E8%81%B4'>sudden hearing loss</a> or <a href=' http://ja.wikipedia.org/wiki/%E3%83%A1%E3%83%8B%E3%82%A8%E3%83%BC%E3%83%AB%E7%97%85'>Ménière's disease</a>. Since it is not a deadly disease, it has not been studied and the causes and mechanisms are not clearly understood. Meniere's and acute bass-impaired sensorineural hearing loss are,
 
 >>
 The damage to the semicircular canal and cochlea caused by endolymphatic edema results in vertigo and recurrent attacks of tinnitus and hearing loss. Endolymphatic edema is thought to be caused by an imbalance between the production of endolymphatic fluid and its absorption in the endolymphatic sac.
 <<
 
 He said. When endolymphatic edema compresses the semicircular canal, it causes dizziness; when it compresses the cochlea, it causes hearing loss.
 
 As stated in the Ménière's symptoms, "hearing loss, especially in the low frequency range," acute bass-impaired sensorineural hearing loss and Ménière's are characterized by poor hearing in the low frequency range. In many cases, it is only in one ear. So, anyway, the results of my hearing test showed that only the bass part of my right ear was about 10 decibels less sensitive. I was not aware of any hearing loss at all. I thought my left ear was bad, but my right ear was bad. Well, it seems that there are many cases where there are no subjective symptoms or the opposite is true.
 
 ** 処方
 
 Travelmin 1 tablet after each meal. http://www.info.pmda.go.jp/go/pack/1339100F1020_1_05/
 >>
 効能又は効果／用法及び用量
 
 Nausea, vomiting, and dizziness associated with the following diseases or conditions
     Upset disease, Meniere's syndrome
 <<
 >>
 1. excitatory sedative action (calms the labyrinthine response)
     Travelmin has demonstrated marked maze-response sedation in experimental maze stimulation in healthy adults and in experimental maze ataxia in house rabbits. It has also been used and shown to be effective in the treatment of otorrheic vertigo (acute paroxysmal vertigo).1)
 
 2. excitotoxic effect (suppresses excitation of the vomiting center)
 <<
 
 One purimperan tablet after each meal. http://www.info.pmda.go.jp/go/pack/2399004F1200_1_02/
 >>
 Abnormal gastrointestinal function (nausea, vomiting, anorexia, bloating) in the following cases
 <<
 >>
 2. 制吐作用5)10)～14)
     Metoclopramide has antiemetic activity for both central and peripheral emesis.
 <<
 </body>
 <comments>
 <comment>
 <username>Ryo</username>
 <body>Are you okay? Please get some nutrition, get lots of sleep, and rest well. </body>
 <timestamp>1257036722</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Well, I expect it will be easily fixed now that I have finished the manuscript and the internship, which was probably the source of the stress...</body>.
 <timestamp>1257069520</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-10-30 https://nishiohirokazu.hatenadiary.org/archive/2009/10/30]