Hatena2010-06-19
code:hatena
 <body>
 *1276967264*Leverage memo: when is that person studying?
 "<a href="http://www.amazon.co.jp/gp/product/4569652441?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& CreativeASIN=4569652441">When does that person study&#8212; "First-class study methods", learn. </a>" leverage memo
 
 ** 神田昌典
 Information that is touched once is not lost, but stored in the subconscious mind.
 There are two types of work. One is a job where "time management" is important, and the other is a job where "ideas and creativity" are important.
 The ability to make the invisible visible and the ability to freely create new things is required of talented people.
 Affirmation (positive self-suggestion) before work: "For 25 minutes I will focus completely on my work."
 ** 池谷裕二
 Free will does not exist. It is impossible to generate ideas.
 Free will does not exist, but it is possible to stop the will from occurring. Ideas cannot be consciously generated. We can only negate ideas that come to mind.
 Stuck for ideas = state of brain unshakable.
 A shaky brain is similar to a distracted brain. Distribute your concentration as much as possible.
 There is a widespread belief that "the brain controls everything." In fact, the opposite is true. The body controls the brain.
 The most efficient way to absorb the hub of knowledge. Trial by time. Long sellers rather than best sellers.
 The utility of having dreams can be explained by the ideomotor phenomenon
 ** 小笹芳央
 Studying without knowing what you're studying for is pointless.
 The worst case is when you don't think about why you need to study or how your studies will help you. If you read a book, you are just being read by a book.
 Study is to solve problems and realize goals
 If you strive to do your best, you will find a gap between you and the ideal you envision. When you decide to do something about it, that's when you can really learn.
 Search for yourself, run away, and you will never find it while you are still in the early stages of your social experience. Because you don't have all the materials you need to make a decision. Self-building comes first.
 Problem-solving skills, interpersonal skills, and self-skills. Problem-solving skills are the ability to collect, organize, and analyze information to help solve problems. Interpersonal skills include the ability to listen, communicate, and motivate others. Self-empowerment is the ability to manage oneself in order to achieve results in difficult situations.
 自責
 I want to spend intense time every day.
 節目を意識
 ** 山崎元
 Learn untouched areas with upper and lower pincers. Read books at the beginner's level to get an overall picture of the subject and to know what you need to concentrate on. Next, read articles written directly by the proponents of the theory that are close to the original.
 To do output in parallel. To confirm that you are able to use the knowledge you have learned. Can you write or talk about it smoothly? If not, you do not understand.
 My company is a business partner. I sell my capabilities. What can I invest in to increase the value of my product?
 ** 五味一男
 Hits are not created by talent, but by calculation and hard work. The trick is to bring yourself to a state of runner's high, as in a marathon.
 I push myself to the limit. The more anxious you are, the more you study and focus on your work to drown it out.
 Self-denial, feeling that you are not good enough as you are now
 Imagine yourself in a bad future and motivate yourself not to be that way.
 ** 近藤淳也
 People doing work they love are not as hard as others think they are."(Hacker and Painter)
 The hardest part was finding a job that I found interesting.
 There is a limit to what we can come up with on our own; release at 50% completion. Consider people as an important source of information.
 Talking helps you organize your thoughts and make it harder to forget.
 Action first" is the rule. Trouble happens, but it is in these times that we have a chance to grow. You will break out of your shell.
 **Kaori Sasaki
 If you stick to your pride or what you have always been, you will get indigestion. Being a know-it-all is more embarrassing than not knowing.
 We don't want faceless opinions. Eye Statement.
 If you don't start talking, you can't have your own opinion. If you don't get out of the crowd, dialogue will not take place. Having your own opinion is necessary to build a win-win relationship.
 **板倉雄一郎
 Study to build a process to reach a conclusion.
 Having confidence in logic is not the same as being stubborn. If the information is modified, the conclusion should also be modified. If the conclusion is the same, then the logic has been changed.
 The best use of time is to avoid repeating the same mistakes. To do this, analyze the past that has already happened and learn from it.
 **大久保幸夫
 Two types of study are necessary. The first is to work with a boss whom you can look up to as a mentor and absorb his/her know-how. You learn how to look at things and how to think by communicating with them every day and observing their every action. The most helpful time is when you ask for advice on a problem. It is more important to know what questions to ask and what criteria to use in making decisions than to draw conclusions.
 Long sellers rather than best sellers. A collection of masterpieces by people who are considered excellent writers.
 Eventually, just a fraction of what you read will be connected. A network is created.
 A cycle of researching, writing, and talking. Knowledge that is not used is not acquired. The repetition of learning and using is the most effective way to improve yourself.
 Facing needs, intensive study, immediate application to work, and results.
 **枝廣淳子
 Repeatedly visualize yourself in every detail of how you want to be.
 What is needed for execution is a system to manage oneself.
 Don't overload it with things to do. A planner is not a list of things you want to do. Estimate the time required for each task and make it a workable plan.
 Barriers to execution, lack of specificity in what to do. Perfectionism. The plan can be wrong. You can revise the plan.
 Set aside time for reflection.
 **Miho Takai
 Unlike recreational reading, the purpose is to organize the content and keep it in your mind.
 Chew empirical knowledge by reading books, and then pass it on to others to deepen it further.
 **臼田琢美
 The process of researching and communicating increases learning efficiency. Research equals absorption, communicating equals organization.
 **河合薫
 Picture yourself two years from now. Will I be happy as a cabin attendant? I quit for good. After that, I was at a loss. I thought there would be something if I quit, but there was nothing. I had no words of my own. You have to have a specialty to come up with something. I realized that after I lost my way.
 It's important to keep studying, even if it's just for ten minutes a day.
 When times are tough, go back to the starting point. Remember the feeling of wanting to know.
 **西山昭彦
 Need a dedicated place to study. If you have to clear your desk to study, it becomes a hassle.
 Technical skills directly related to work, human skills to communicate with and motivate people, and conceptual skills to understand, analyze, and solve problems
 To improve conceptual skills, compare with history, foreign countries
 Thirty-somethings, making connections outside the office without being buried in the company. Valuable information does not appear in the media.
 
 ** Summary
 It is interesting to note that several people say the same thing in manuscripts that were probably written independently. They say that reading many "long sellers, not best sellers" is the key to networking, that it is important to "plan, do, reflect," and that it is important to share what you learn with others and use it in your work. These things are probably the most important hubs within hubs.
 
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=4569652441" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 *1276968503* Is the iPad software keyboard that difficult to use?
 I had heard that the iPad keyboard was terrible, or that you had to connect an external keyboard, and I thought that was true, but <a href='http://d.hatena.ne.jp/nishiohirokazu/20100619/1276967264'>leverage memo:.  When I put it in portrait mode, the keyboard becomes smaller, which is perfect for typing with one hand. A normal sized keyboard would be a long distance to travel when typing with one hand.
 
 It's not informative for someone who has only used a mouse to say that a trackball is hard to use, or that the red pouch on a Thinpad is hard to use. Because they are simply saying that X, which they are not used to, is harder to use than Y, which they are used to. In this case, too, I thought that there might be an element of people who can type faster with both hands in the home position, but can only type that way, and are overly aggressive because their typing speed, which was the basis of their self-esteem, is impaired. Perhaps because I am a programmer, I have always typed many things that are difficult to type with the so-called blind touch method, such as the key next to my right pinky or the function key while pressing two meta keys on the other side of my left pinky, so I don't really mind not having a mark on my home position. I don't mind not having a mark on the home position.
 </body>

[Hatena Diary 2010-06-19 https://nishiohirokazu.hatenadiary.org/archive/2010/06/19]