Hatena2008-10-22
code:hatena
 <body>
 *1224630590* Wikipedia is not to be trusted.
 http://ja.wikipedia.org/wiki/%E6%BA%96%E6%8B%A0
 >>
 Conformity means that something is not in agreement, but is generally in accordance. When things are not in agreement and things proceed as they should, it often causes trouble.
 <<
 
 <a href='http://yowaken.dip.jp/tdiary/20081020.html#p01'> [Memo] Compliant - xe-kdoo (2008-10-20)</a> via. Just yesterday, id:amachang and I were talking about how we are inclined to believe what Wikipedia says. I think, "Of course not," but then I wonder, "Is it possible that the misuse has become common and established in some industries, just because I don't know about it?" I feel uneasy.
 
 At any rate, looking at the history, this page is still in its infancy, and the text in question seems to have been written almost exclusively by one person. It will be interesting to see how things change in the future.
 
 **1224632892*[en]About "quasi
 I've been trying to figure out why "compliant" was taken to mean "not properly based" in the <a href='http://d.hatena.ne.jp/nishiohirokazu/20081022/1224630590'>Wikipedia is unreliable</a> case. I'm sure they took the meaning of the kanji character "quasi" as the side used for "semi", etc.
 
 
 The kun reading of "semi" is "mizumori," "nori," "hagaru," and "nazoraru. Mizumori" is a tool used to measure the level by filling it with water. In today's language, it is called a level. In today's language, it is a level. Nori" means a scale for measuring things. It is a standard, a quasi-standard. And, "hakaru" means to measure with such a standard, and "nazogeru" means to treat things in accordance with the standard or the main thing.
 
 
 Examples used in this last meaning of "trace" are "equivalent to", "semi-equivalent to", and "quasi", but there are many words that are not used in this sense because this meaning came about later. You wouldn't want the "sight" of a gun to be "not exact but similar".
 
 *1224674152*[Mid-term] Third-party AI soon to appear.
 <img src="http://gyazo.com/92f1f449e902713a6ae1dab9e9f717b0.png">
 A bot created by id:yowa was in 9th place!
 We need to be able to play human against human and bot against bot as soon as possible.
 
 http://yowaken.dip.jp/tdiary/20081022.html#p02
 >>
 In the first turn of the early rounds, I give priority to cards that are concentrated in my hand."
 <<
 In the flesh, I have exactly the same strategy. As written, the idea is to play cards that don't reduce your options because they have little impact in the early stages.
 
 *1224684455* Saizeriya is cool.
 Via @t_yano
 >>
 We have all the data on which customers ate which type of pizza at what time and at what time, so we can match it to the date and time the customer says he or she ate it. Well, that makes it easy to tell if the customer requesting a refund is lying or not.
 <<
 http://internews.jp/archives/2008/10/post-37.html
 
 I'm kind of in love.
 
 **1224687979*[middle limit]Number of points gained per round
 I made 100,000 trials to see what the median score for the round would be if three random people played the first round. it could take values from 0 to 13, so it would be a list of 14 numbers.
 
 [11144, 836, 3184, 5577, 7927, 10292, 11847, 12491, 11952, 9947, 7439, 4578, 2286, 500]
 
 And this is hard to understand, so I'll write 1 star for 500 times.
 
 >||
 **********************
 *
 ******
 ***********
 ***************
 ********************
 ***********************
 ************************
 ***********************
 *******************
 **************
 *********
 ****
 *
 ||<
 
 The top of course is 0, and the top of the beautiful distribution below is 7, which is surprising, I thought it would be around 5. By the way, the mean was 6.09 because of the 0's pulling it down.
 
 Later we will bring up the data in <a href='http://saichugen-online.appspot.com/'>Middle Limit Online</a> for comparison.
 
 -----
 
 Sad. I was trying to download data for 150 games on the second day of the open house.
 >>
 HTTP response was too large: 1213017. The limit is: 1048576.
 <<
 I was pissed. Google App Engine was easy to get started, but I didn't realize how inconvenient it would be to not have the data at hand.
 
 -----
 
 Downloadable. Total results for all 1581 rounds x 5 rounds.
 >||
 1581
 [897, 64, 258, 449, 620, 814, 886, 979, 897, 816, 606, 366, 196, 57]
 *****************************
 **
 ********
 **************
 ********************
 ***************************
 *****************************
 ********************************
 *****************************
 ***************************
 ********************
 ************
 ******
 *
 ||<
 Hmmm, no change at all. That's not interesting. By the way, the average is 6.11, not a meaningful difference.
 </body>
 <comments>
 <comment>
 <username>maq</username>
 <body>Is that cool? <BR><BR>After all, you just have the POS-linked information, right? <br>It would have been cool if they had found melamine in the inspection before the sale, though. </body>
 <timestamp>1224685245</timestamp>
 </comment>
 <comment>
 <username>SHNSK</username>
 <body>If you feel that way, then fixing it yourself is WikiPedia quality</body>.
 <timestamp>1224687164</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>But I refuse. </body>
 <timestamp>1224691755</timestamp>
 </comment>
 <comment>
 <username>nowokay</username>
 <body>But, well, this is what happens<br>http://news.livedoor.com/article/detail/3869083/</body>
 <timestamp>1224709856</timestamp>
 </comment>
 <comment>
 <username>nakamura001</username>
 <body>Saizeriya seems to have all the science. <br><body>The "make something that doesn't taste bad" is a pretty interesting approach. <br>http://d.hatena.ne.jp/teruyastar/20080914/1221376683</body>
 <timestamp>1224866978</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-10-22 https://nishiohirokazu.hatenadiary.org/archive/2008/10/22]