Hatena2010-03-16
code:hatena
 <body>
 *1268702007* Reminds me of the Yamanote Line.
 >>
 10:04 nishio: Tokyo, Kanda, Akihabara
 10:05 nishio: Okachimachi, Ueno, Uguisudani, Nippori, Nishi-Nippori
 10:05 nishio: Tabata, Komagome, Sugamo, Otsuka
 10:07 nishio: Ikebukuro, Mejiro, Gotanda, Shin-Okubo, Shinjuku
 10:07 nishio: Yoyogi, Harajuku, Shibuya
 10:07 nishio: Ebisu, Meguro, Takadanobaba, Osaki, Shinagawa
 10:08 nishio: I thought that Osaki was after Shinagawa
 10:08 nishio: Shinagawa, Osaki, Hamamatsucho, Shinbashi, Yurakucho, Tokyo
 10:10 nishio: scoring is in progress
 10:10 nishio: oh, Gotanda and Takadanobaba are reversed again
 10:11 nishio: Osaki should have been in front of Shinagawa?
 10:12 nishio: Where has Tamachi gone?
 <<
 
 *1268705182* Reminds me of the periodic table.
 >||
 H                    He
 Li Be  B  C  N  O  F Ne
 Na Mg Al Si  P  S Cl Ar
 ||<
 So far, sailor Liebe.
 >||
  K Ca Sc Ti  V Cr Mn Fe Co Ni Cu Zn
 ||<
 This is His Excellency Scotch. I don't know where it leads to....
 
 >||
 H                                                  He
 Li Be                                B  C  N  O  F Ne
 Na Mg                               Al Si  P  S Cl Ar
  K Ca Sc Ti  V Cr Mn Fe Co Ni Cu Zn Ga
 ||<
 I think it's "up to B," so it's connected by gallium... I wonder what the rest of the story is...
 
 >||
 H                                                  He
 Li Be                                B  C  N  O  F Ne
 Na Mg                               Al Si  P  S Cl Ar
  K Ca Sc Ti  V Cr Mn Fe Co Ni Cu Zn Ga Sn    Se Br Cr
 Rb                            Ag       Pb    Te  I Xe
 Cs                            Au             Po At Rn
 Fr
 ||<
 
 Hmmm. Where's the mercury, and where's the tin? Where's the lead? Is it mercury under the rim? I wonder if it's rhodium next to gold.
 
 >||
 H                                                  He
 Li Be                                B  C  N  O  F Ne
 Na Mg                               Al Si  P  S Cl Ar
  K Ca Sc Ti  V Cr Mn Fe Co Ni Cu Zn Ga Sn    Se Br Cr
 Rb                         Os Ag Hg    Pb    Te  I Xe
 Cs                         Rd Au             Po At Rn
 Fr
 ||<
 
 I wrote Rd for rhodium, but what about radium?
 
 No, I still think it's strange to have Sn under Si. You have to have eka silicon under silicon.
 
 >||
 H                                                  He
 Li Be                                B  C  N  O  F Ne
 Na Mg                               Al Si  P  S Cl Ar
  K Ca Sc Ti  V Cr Mn Fe Co Ni Cu Zn Ga Ge    Se Br Cr
 Rb                         Os Ag Hg    Sn    Te  I Xe
 Cs                         Rd Au       Pb    Po At Rn
 Fr
 ||<
 
 Hmmm, I can't remember any more. I'm just frustrated that I don't know what's under calcium.
 
 Scoring: 1
 
 Oh, so it's not mercury right under zinc, it's cadmium and then mercury. Pollution. Next to the gold is not rhodium. It's platinum. Rhodium is Rh, under cobalt, and below that is iridium. Cobalt blue, with roses and rainbows. Krypton is Kr.
 
 >||
 H                                                  He
 Li Be                                B  C  N  O  F Ne
 Na Mg                               Al Si  P  S Cl Ar
  K Ca Sc Ti  V Cr Mn Fe Co Ni Cu Zn Ga Ge    Se Br Kr
 Rb                      Rh    Ag Cd    Sn    Te  I Xe
 Cs                      Ir Pt Au Hg    Pb    Po At Rn
 Fr
 ||<
 
 I like the Yamanote Line song, so I'll try to remember it in the same verse.
 >>
 ♪ Sailor Leavey, my ship, my ship, my seven-track ships, my kraal, my gong, my lord, my scotch, my exposure man, my iron cobalt nickel, my copper zinc, my ship, my ship, my ship, my ship, my ship, my ship... ♪
 <<
 
 So far, I learned it as a kid and it was perfect again this time. Here comes the problem.
 
 >>
 Â Garrigel sweat bath Kryptonoo Rubystronwai Zirconium stinky forest, hand wringing Logipala silver square seal tin, seems to be slacking off Keysenon ☆.
 Â back-bound lanthanides half-nium <a href='http://ja.wikipedia.org/wiki/%E3%82%BF%E3%83%B3%E3%82%BF%E3%83%B3 %E3%81%AE%E5%86%92%E9%99%BA%E6%97%85%E8%. A1%8C'>Tantan</a><a href='http://ja.wikipedia.org/wiki/%E3%82%A6%E3%83%A9%E3%82%B8%E3%83%BC %E3%83%9F%E3%83%AB%E3%83%BB%E3%83%AC%E3%83 E3%83%BC%E3%83%8B%E3%83%B3'>Reni</a> Press Iridium Platinum Gold Mercury Turium Namari Bismuth Polo Tomorrow Don
 <<
 
 This is all up to the 6th cycle, aside from the lanthanides. It is starting to become just an enumeration in the middle. I wonder how much I can remember next time I try to recall the periodic table. By the way, I thought the origin of the word "rhenium" was Lenin, so Tintin decided to push Lenin, but in fact Lenin had nothing to do with it. I was disappointed.
 </body>

[Hatena Diary 2010-03-16 https://nishiohirokazu.hatenadiary.org/archive/2010/03/16]