Hatena2011-06-12
code:hatena
 <body>
 *1307848501* Played Streams.
 >>
 I played a new game called Streams at Sugorokuya. When I heard the rules of the game, I thought it was too subtle, with no player interaction and no control over the numbers that appear, but when I actually tried it, it was surprisingly interesting. It makes sense if you think of it as a bingo game where the outcome changes depending on the choices you make. I think it would be popular if used as a bingo game.
 <<
 I had Tweeted yesterday (<a href='http://twitter.com/#! /nishio/status/79433201080217600'>Twitter</a>), the original <a href='http://sgrk.blog53.fc2.com/?no=1893'>Koenji 0-minute Sugoroku and Game Introduction: STREAMS / STREAMS</a> also Bingo" is how they described it. It says "read the stream and fill in the numbers," but when I heard the rules explained, the numbers are just drawn one by one from the shuffled deck and there is no controllability at all, so I thought, what the heck. I thought, "This is just like playing bingo, where you can change the outcome by your own choices. It would be nice to play bingo with a large group of people and yell, "I got 7 cards! I think it would be good to play with a big group of people and yell out "Seven connected! Unlike bingo, the winner doesn't get bored, you can control the time it takes to finish, and you feel like you control the game, whereas bingo is based on the luck of the first card you are dealt. Except for the majority of players who say, "I don't want to think, it's too much work, I'd rather just make a hole.
 
 There is no interaction between users at all, so if you take it as a game, it's not so good. Strangely enough, different people fill in the squares differently, even though the conditions are exactly the same." This is simply due to the fact that the players are not smart enough to read through all the patterns, and since the contents of the deck are known, they can calculate the expected score for each choice if they read through to the end under any circumstances. The search space is roughly calculated to, let's see, the 40th-50th power of 10. By the way, Shogi is said to the 220th power of 10 and Othello to the 60th power of 10, so I guess they are in the relatively easy category. However, even if you put a lot of effort into it, it will not be a must-win because of the strong element of luck, and I expect it won't be very interesting.
 
 *1307885250* English Vocabulary Diary 5
 **Previous Article
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20110607/1307450595'>I started the "After 30, I memorized 3000 words English vocabulary memorization system"</a>.
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20110608/1307535139'>"After 30, I memorized 3,000 words, English vocabulary memorization system" Day 2 Diary</a>.
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20110609/1307630086'>"After 30, I memorized 3,000 words, English vocabulary memorization system" Day 3 Diary</a>.
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20110610/1307715975'>English Vocabulary Diary 4</a>
 
 ** Measurement
 I should have reviewed on the 11th but forgot because it was a holiday. 13 test, 1 min. 12 OK, 1 NG. review on the 12th. 14 test, 1 min. 14 OK. schedule both together for review on the 16th.
 
 **Mistaken word
 The word idio- itself seems to have the meaning of "peculiar, unique". Hmmm... same etymology as idiom. I'm not going to be one pomodoro today because of the interruptions.
 
 **Review and update goals
 - I was going to take the day off, but they said it would be harder if I left two days open, so I did Saturday and Sunday -> I forgot about Saturday, but did Sunday!
 - Read through the English paper, even if it is one pomodoro at a time on Saturdays and Sundays, and pick up words you don't understand. →x
 
 It seems that setting this goal suddenly was too much with no study timetable on Saturdays and Sundays. Also, I have started to feel stuck in the middle after achieving the two previous goals of "emptying the study pile" and "answering all questions correctly in the review phase".
 We need to set appropriate goals, but I don't know what to do.
 
 I counted the cards for review and there were 97, so let's set a goal to make it 100. I can achieve it tomorrow. Let's count the number of cards for each of the review cards separately depending on how many more days we have left to review. It will be easier to make a rounded number goal.
 
 Goals for tomorrow
 - "I'll do it again tomorrow."
 - Increase the number of review cards to 100 or more.
 </body>

[Hatena Diary 2011-06-12 https://nishiohirokazu.hatenadiary.org/archive/2011/06/12]