Hatena2009-05-04
code:hatena
 <body>
 *1241408461*LinCity-NG 2.0 Sustainable Clear
 I just noticed that 2.0 was released in January and I'm playing it. <a href='http://lincity-ng.berlios.de/wiki/index.php/Main_Page'>LincityWiki</a>. I had an assumption that this kind of game should be played in English, but to my surprise, it seems to be translated into Japanese. But I am playing in English because it is too much trouble to find out how to change it to Japanese.
 
 When I played the older version before, I launched a rocket and sent all the inhabitants into space to clear the site, but this time I will try another "quick but difficult" way to clear the site. This time, we are going to try another way of clearing the game, which is to create a sustainable economy.
 
 <img src="http://gyazo.com/a6eba38f0aa900bcd9ac782222ae274c.png">
 
 The rest would be OK if the population were stable. In short, it is a matter of meeting the conditions of "no mining of underground resources," "no trade," "no decrease in funds," "stable population," "stable technology," and "fire department coverage throughout the entire area" to clear the area.
 
 <img src="http://gyazo.com/8ecb259d1dfebef523b18fdee13044f7.png">
 
 It's over. Not so quick... lol.
 
 <img src="http://gyazo.com/71c5c505e4bbac751435a289e0b31309.png">
 
 >||
 Game statistics from LinCity-NG Version 2.0
 Initial loaded scene - Beach
 Economy is sustainable
 Population  16978  of which  4225  are not housed.
 Max population 18153  Number evacuated 0 Total births 632091
 Date 04/2327  Money 128365310   Tech-level 104.2 (109.7)
  Deaths by starvation    4095   History   50.779
 Deaths from pollution  198038   History 21064.303
 Years of unemployment   13054   History  254.234
 Rockets launched  0  Successful launches  0
 
     Residences   59         Markets   40            Farms   43
    Water wells    9
      Monuments    2         Schools   59     Universities    0
  Fire stations    9           Parks    5    Sports fields    5
 Health centres    5            Tips    0         Shanties   68
 
      Windmills   25     Coal powers    0     Solar powers    3
    Substations    8     Power lines   69            Ports    1
         Tracks   39           Roads  908             Rail  136
 
      Potteries   45     Blacksmiths    1            Mills   88
     Light inds    1      Heavy inds    0        Recyclers    7
     Coal mines    0       Ore mines    0         Communes  133
 ||<
 
 *1241413337*LinCity-NG 2.0 Strategy
 Past Diaries
 - <a href='http://d.hatena.ne.jp/nishiohirokazu/20080505/1209987590'>LinCity</a>
 - <a href='http://d.hatena.ne.jp/nishiohirokazu/20080510/1210396076'>LinCity Clear</a>: 1 year old version of Rocket Clear
 - <a href='http://d.hatena.ne.jp/nishiohirokazu/20090504/1241408461'>LinCity-NG 2.0 Sustainable Clear</a>
 
 I think the process of trial and error to figure out how to make it work is a game, but it would be a waste if some people quit before they find it interesting, so I'll give a brief explanation.
 
 - It might be a good idea to start with a city that has grown to some extent in the "good_time" scenario and do various things to get an overview.
 - Once you know some of what you're doing, you might want to start at the BEACH, so there are no rivers or buildings that have been built on their own.
 - Things to build before building a dwelling on an empty lot: a well, a market, a farm.
 -- Without wells, people will die from lack of water. Without farms, people would starve to death.
 -- Without markets, food produced on farms would not reach dwellings.
 - You may want to leave a little space beside the well because in the future you may want to set up a "fire station" with a smaller radius of 2 squares coverage than the well. It would be good to keep the wells away from the market and build a settlement around the market, since you don't need to provide labor for the wells.
 - The market will be connected to the road in the future so that the entire area around it will not be covered by buildings.
 
 <img src="http://gyazo.com/bb1806572bc630ea2985a5116af30fab.png">
 This looks minimalist. By the way, for profound reasons, the well and the market should move one square to the upper left than this lol.
 
 - After a while, more people will become unemployed. Note that the information tab will turn yellow to tell you.
 - If we leave people unemployed, the treasury will lose money because of paying unemployment insurance, so we need to create jobs for them.
 - Let's make monuments first. Before schools could be built, monuments were the only way to improve technical skills.
 
 <img src="http://gyazo.com/d3046e061c1e74381d5cc4f222164ec6.png">
 The school is now ready to build.
 
 - Only monuments consume labor only while they are being made, so when they are done making them, you have to make another job for them.
 - The school consumes a lot of labor (200 Jobs) on an ongoing basis, so it wants to put labor into this. However, the school consumes 75 Goods. Now we don't have Goods, so we have to produce them.
 - If you click on the market or transportation network when you select something other than the bulldozer, you can see how much resources are there. Right now there should be an excess of Food and Jobs and nothing else....we can't do anything with just Food, so let's build a Commune.
 - Commune :: -> Coal 2, Ore 6, Waste -20, Steel 0.2
 - Pottery: Ore 11, Coal 2, Jobs 35 -> Goods 35
 - Although it is not the most efficient way to do it, we currently have to make it in the ratio of two Commune and one Pottery.
 - Oh, I forgot to mention that you can get a lot of ore by creating an ore mine, which is a better way to achieve speedy economic development. However, note that the ore mine will turn into a pond after a certain amount of ore is mined.
 
 <img src="http://gyazo.com/160afeb1ce1f25834ecbf10ffb460430.png">
 Three sets were made.
 
 - Blacksmith is now available (Tech == 0.4)
 - Blacksmith: Coal 1, Steel 1, Jobs 35 -> Goods 50
 - Steel production-wise, it's 1 Blacksmith for every 5 Commune. 1 set up. You can set up another one as you have a little bit left over.
 - By the way, we will also increase the number of houses since we are now in a labor shortage with 0 Jobs.
 
 <img src="http://gyazo.com/7937f60208b2ce4677060214a566534d.png">
 
 - Goods is now at 100% and Pottery has stopped production. Building a school.
 - More people, less food, starvation (tab turns red), so they built a farm.
 
 <img src="http://gyazo.com/61be132ec06b632746e6e4e8bcf1e7d7.png">
 Look at the market. Hmmm, not enough labor, let's build another house.
 
 - The productivity of Farm is 137 if enough labor is provided, and 550 + tech_bonus if more power is supplied. The desert percentage of the land is also reduced from this value.
 - Build a fire station now that it can be built.
 
 <img src="http://gyazo.com/9407874658839d6f8083460ee7bb46a4.png">
 It doesn't look good when reduced in size.
 
 - Mill can now be built Tech == about 2.5
 - Mill: Foods 37, Coal 1, Jobs 35 -> Goods 75
 - Pottery, Blachsmith, Mill are the most efficient in production. I can't wait to see the windmills that Tech == 3.0 will allow us to make.
 - Looking at Market, both Goods and Jobs are big numbers, so build another school.
 - Basically, when the yellow (unemployment alert) comes out, look at the market and if there are enough Goods, build a school; if there are not enough Goods, build a Goods production facility. Of course, resources for producing Goods should be secured through Commune or Ore Mine.
 - Tracks that can be built from the beginning don't have much transport capacity, so we shouldn't be overconfident. If you have been building houses and farms separately as shown in the previous diagram, the market on the side of the farm is depleted of Jobs. The market on the left has 45% of Jobs. I have no choice but to build houses around the farm.
 - We built a windmill and started to have too much food at once. So we built a mill.
 
 - Import/Export is now possible. With this, we can import what we lack and export what we have in excess, so even if the economy is a bit of a mess, we can cover it. But we must not forget that "an economy that cannot stand on its own feet is standing on its own feet through trade. If we want to achieve a sustainable clear, trade is something we have to stop someday.
 - On the other hand, if you are aiming for rocket clearance, trade should be used rather extensively since it is unlimited. You need to make up your mind which way you want to go.
 - Export ports are facilities that require connections to the transportation network. The building is controlled by the upper corner, and the connection to the transportation network is also determined by the presence of a road in the upper right or left square of that upper corner.
 
 - Roads can now be built.
 
 As I write, the development is progressing so fast that I can't keep up. I haven't even put up a port yet. Well, I've already explained so much, "People are all dying before I know what to do first!" That's not going to happen, is it? The technology level is currently 5.2, but if we raise it to 80 or so, we will be able to fly rockets, and if we raise it to 100, rocket launches will no longer fail.
 
 Finally, the current screen. This is about the size of the port and roads that can be built. In terms of time, it took me one and a half hours to play in the fastest mode while writing this text.
 <img src="http://gyazo.com/7dd67e763f0ba0872cebfb5deb4eee69.png">
 
 >||
 Game statistics from LinCity-NG Version 2.0
 Initial loaded scene - Beach
 Population  1055  of which  124  are not housed.
 Max population 1072  Number evacuated 0 Total births 3171
 Date 01/0176  Money  2683393   Tech-level   5.2 (  5.2)
  Deaths by starvation     386   History  145.788
 Deaths from pollution       0   History    0.000
 Years of unemployment     735   History  431.666
 Rockets launched  0  Successful launches  0
 
     Residences    6         Markets    3            Farms    5
    Water wells    1
      Monuments    1         Schools    3     Universities    0
  Fire stations    1           Parks    1    Sports fields    0
 Health centres    0            Tips    0         Shanties    0
 
      Windmills    2     Coal powers    0     Solar powers    0
    Substations    0     Power lines    0            Ports    0
         Tracks    0           Roads   40             Rail    0
 
      Potteries    6     Blacksmiths    2            Mills    8
     Light inds    0      Heavy inds    0        Recyclers    0
     Coal mines    0       Ore mines    0         Communes   14
 ||<
 
 *1241419255*LinCity-NG 2.0 Considerations for doing trade
 I cleared without trade earlier, but I felt like taking a look at trade. First of all, the trade rate is very unbalanced: Foods: 1, Ore: 1, Coal: 50, Goods: 3, Steel: 100.
 
 Data for each production facility
 >||
 commune: -> Coal 2, Ore 6, Waste -20, Steel 0.2 
 pottery: Ore 11, Coal 2, Jobs 35 -> Goods 35
 blacksmith: Coal 1, Steel 1, Jobs 35 -> Goods 50
 mill: Foods 37, Coal 1, Jobs 35 -> Goods 75
 farm: Jobs13 if power is available -> Food 550 * Groundwater percentage
 ||<
 Consider this in terms of import/export prices.
 >||
 commune(+\126): -> Coal \100, Ore \6, Waste -20, Steel \20 
 pottery(-\6): Ore \11, Coal \100, Jobs 35 -> Goods 35(\105)
 blacksmith(+-\0): Coal \50, Steel \100, Jobs 35 -> Goods 50(\150)
 mill(+\138): Foods \37, Coal \50, Jobs 35 -> Goods 75(\225)
 farm(+\550): Jobs13 if power -> Food 550 * Groundwater percentage
 ||<
 So, Pottery and Blacksmith are all eliminated, Steel and Ore are sold, Farm is used to make a lot of food and Mill is used to turn it into Goods, and Coal is used to make as much Coal as needed. If you have enough Goods, you can make a school. If there are enough Goods, build a school. If there is not enough labor, build houses, if there is not enough labor, build mills, if there is not enough food, build farms. If you cut the game down to the bare essentials, there is less to think about, and it becomes a very simple game.
 
 
 Well, you know what? Steel and Coal will be needed a lot if we want to clear rockets, and if we want to clear sustainably, we will have to stop importing and exporting in the future, so maybe a little bit easy at this point is okay.
 
 *1241430327*LinCity-NG 2.0 continued
 I reached Tech level 75, where I can launch a rocket without using up 2 squares of fire area, Money is roughly 30M and population is about 8000. I finally realized after I had enough money and reached Tech 95 or so that I should just import Foods and Goods in the first place. The Goods that the school consumes are 225 per month. how many residences can 200 labor force come from. 500 people would give us enough labor force to run the school for 5 meals and a bit of change. To maintain that, we need to import about 500 Foods, 700 Goods. The school consumes 75 * 5 = 375 Goods, and the remaining 325 is consumed by the residents, 250 and error. This figure is before applying the trade rate, so the import cost is 500 + 700 * 3 = 2600.
 
 I have roughly 240K in revenue right now, but how many days is a unit of this. should I build a research city of 500 people and see the difference?
 
 Before we compare them, let's compare them to Commune, which we know is a revenue per turn, and we know that Commune's revenue is +126 per turn without labor, so if we build 21 Commune and simply sell the resources we get from it, we can maintain 5 schools. So we can maintain 5 schools by simply building 21 Communes and selling the resources obtained from them.
 
 Now that we have a research city of 500 people, let's look at the budget: about 231K. Hmmm, not so clear. To make this kind of value clear, both the numerator and denominator have to be larger. The only way is to make it bigger.
 
 <img src="http://gyazo.com/0a2f4a62b4c434537ebe1bccd73b7543.png">
 
 Very compact city of 4000 people. Food self-sufficiency rate is 0% lol. The amount of schools is not enough with 40 schools, so they decided to increase the number of schools to 45. 45 schools consume 3375 Jobs of labor, which seems like a very large percentage of the working population. One recycling center is not enough to clean up the waste produced by the population, so a second recycling center was set up.
 
 
 So how did this change my revenue...247K laughs
 So the taxes from a population of 4000 people is more than the cost of maintaining it lol. Well, unlike SimCity, the purpose of LinCity is not to clear the population. This huge research city can't be maintained without imports, so it can't be cleared sustainably, and you need 4 extra rockets to clear rockets. Well, now Tech Level is 146 or something. Tech level inflation lol.
 
 <hr>
 
 If we had left it alone, we would have gotten to 220 technical capacity, but before we knew it, we were in the red big time.
 
 *1241437724* redo
 <img src="http://gyazo.com/3909a66136f1345481fb0bc13956ab7d.png">
 The situation is about a half hour away from starting over because it is indeed a bad idea to get too carried away and fill up the school. Can we get to 100% Tech while holding it down to one block of fire plots?
 
 
 I guess the approach of doing research by trade is inadvertently going to get you in debt quickly and irreversibly. I had to close all my schools to pay off the debt and instead, I started exporting Goods by doing my best to set up a mill and finally broke even when I went from 7M in debt to about 9M.
 
 
 Now I think I should have put up more Farms before I closed the school and modern windmills. And a modern windmill. farm supplied with Power is simply 550 productive capacity with or without labor, plus a bonus for being technologically advanced. it was 50%, so it was about 775. Should we have adjusted to become "export food and buy Goods" before we started to go into the red?
 
 <hr>
 We had to start over because it didn't look like we could turn a profit. I guess the time to expand is when technology has advanced and efficient facilities can be built. So it's not a good idea to be stingy with the cost of firefighting equipment and say, "I wonder if we can get to 100% on one parcel. No, maybe not exactly. If they had carefully monitored the economic situation instead of getting carried away and building a bunch of schools, they might have been able to get to 100% even with one lot. But there is not much reason to insist on one lot! The cost of maintaining a school is much higher.
 
 Is Level 3, where Mill and Windmill can be created, a milestone? No, not yet. Maybe the railroad will be the start. First, the invention of the Mill and Windmill paves the way to efficient production, but still, building a large-scale factory or something like that will clog up the Track because of its slow transportation. After that, the invention of Import/Export will happen, so I would raise the level at once with many schools set up in and around the port here, and wait for the invention of the railroad.
 
 If Export is invented and you go around destroying Pottery or Blacksmith and putting schools instead, eventually Road will be invented and the refactoring will go on again. When I designate Food at the port to be both Import and Export, it seems to sell more.
 
 Hospitals, light and heavy industry invented but ignored. Railroads come! Refactoring begins.
 
 Level 45. Replace the windmill with a modern one.
 
 <hr>
 
 <img src="http://gyazo.com/b27537e21bf33c2b8eef43c1a389e466.png">
 I'm getting tired. I'm starting to wonder what I'm doing.
 
 <img src="http://gyazo.com/e58ce4f11ef59175626e01bd81a06175.png">
 They have made the coastal area into a large granary and are trying to build a moat because they can't sell rice in the backcountry with that.
 </body>

[Hatena Diary 2009-05-04 https://nishiohirokazu.hatenadiary.org/archive/2009/05/04]