Hatena2009-07-01
code:hatena
 <body>
 *1246418098* Peace.
 I just tried to put a fan between my legs and I like hot entries and peace. Heartwarming.
 
 *1246419792* Painting of the Day
 I just thought of something, but I think it's too much because lines are drawn as lines, and it would be better to express them by cutting off the gradient just like a circle: "I think it's too much.
 
 <img src="http://www.nishiohirokazu.org/static/drawing/divide_three.png">
 
 Mathematically, a straight line is supposed to have no width, but when written in this way, it does have width, and in fact, lines of different thicknesses appeal to different "thicknesses".
 
 It's a handwritten draft, so it's all off, but here's what it looks like:.
 <img src="http://gyazo.com/10458cd47b4b91cf70ef73f566869fb1.png">
 
 <hr>
 
 <img src="http://gyazo.com/357c008c63c3ab8193ddfd0c9abfe9fb.png">
 
 Hmmm. The line is subtle because two invisible corners have been created.
 
 <img src="http://gyazo.com/267fff237427fb8306fbd3f3ec473306.png">
 
 Hmmm. It's something different. Maybe the circle is too assertive.
 
 <img src="http://gyazo.com/28fd89e6e0cc5687e8605bd412267f16.png">
 
 I thinned the circle drastically and it looks much better.
 
 I have been working with blue for no particular reason, but on second thought I should use green.
 
 *1246420438* Security & Programming Camp Article Published!
 <a href='http://jibun.atmarkit.co.jp/lstudent/special/camp2009/01.html'>"We have prepared the best instructors and environment in the world" &#8212;&#8212;Interview with Hirotaka Yoshioka - @IT Self Strategy Institute</a>.
 
 The deadline for application is July 6, so you can still apply. <a href='http://www.jipdec.or.jp/camp/application/index.html'>Application Guidelines | Security & Programming Camp 2009</a>
 
 *1246422696*Painting by weight
 via id:tgbt <a href='http://www.art-meter.com/'>Painted! It connects want.　| ART-Meter: a site for measuring and selling paintings</a>.
 He felt that selling paintings by weight was an oblique idea, so <a href="http://www.amazon.co.jp/gp/product/4048700022?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247& creative=7399&creativeASIN=4048700022">Contemporary Art Business</a><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as2&o=9&a= 4048700022" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" />Taken from
 
 >>
 Primary price is determined by size and material/// i.e., all 100 paintings produced by the same artist at the same time are the same price.
 <<
 
 So, the weigh-in itself is not as oblique as it sounds. However, I thought the stance of creating a sense of fairness and value for money by bringing it to the forefront was a pretty good idea.
 
 My work is an acrylic board, so I can't sign it on the front, so I can't sell it here, but let's calculate how much it would cost if it were a CG stand-alone, not wrapped in acrylic. The calculation method is clearly stated: <a href='http://www.art-meter.com/guide/customer/detail/'>Buying Guide</a>. A3 is 1247.40 square centimeters, which is 6,250 yen assuming the lowest unit price. The acrylic processing would increase the cost by a little more than 5 times, so the estimated cost would be 31800 yen.
 
 The painter's level is interesting: if two A3 works are sold, the level rises to 8750 yen; if two more are sold, 11250 yen; if four more are sold, 13750 yen; and if four more are sold, the artist enters the blue ceiling zone. Interesting. I think I'll stop sticking to acrylics and put some of my pieces out here.
 
 <hr>
 
 <a href='http://www.kayac.com/renova/'>home => gallery + office Interesting Renovation PROJECT</a>. Wait, Kayak! Small world!
 
 *1246430577*Re: No need for "****" in password input?
 <a href='http://www.itmedia.co.jp/news/articles/0907/01/news033.html'>No need for '****' in password input?　Heated debate among researchers - ITmedia News</a>
 
 Some people think it is good manners to "look away from the keyboard or monitor when the password prompt appears" in situations where you are watching someone else ask a question or work, while most people, at least according to my observations, do not recognize the need to look away. I have observed, at least, that most people do not seem to be aware that they should look away. I think it is obvious which is more costly, typing a password incorrectly and having to type it again, or turning around every time you type a password to check if someone is looking at the monitor, and if someone is watching you work next to you, saying aloud, "Look away, I'm typing the password.
 
 
 For your information, the technology to intercept leaked radio signals and peek at images displayed on monitors has existed long before I was born. see: <a href='http://www2.nict.go.jp/y/y213/tempest.html'>TEMPEST</a>.
 </body>

[Hatena Diary 2009-07-01 https://nishiohirokazu.hatenadiary.org/archive/2009/07/01]