Hatena2009-02-12
code:hatena
 <body>
 *1234387172*If you want to re-throw a caught exception in Python with no processing.
 <a href='http://d.hatena.ne.jp/methane/20080720/1216573691'>Promise code for logging traceback - methane's diary</a>
 
 Oh, just raise...I was scratching my head about doing "raise e" and losing the traceback information.
 
 *1234394679*Get parent frame URL from Google Gadgets (Failed)
 1: http://d.hatena.ne.jp/nitoyon/20070820/javascript_eval_on_hatena_diary
 2: Rewrite to alert(parent) and execute -> OK
 3: Rewrite it to alert(parent.location) and run it.
 4: uncaught exception: Permission denied to get property Window.href
 
 Oh, I thought iframes couldn't take parent URLs?
 
 *1234441457* Read "What to watch out for if you feel somewhat unwell lately.
 <a href='http://anond.hatelabo.jp/20090211000453'>What to watch out for if you feel somewhat unwell lately</a>.
 
 Reference++.
 
 
 > Even if you are sleepy or go to bed twice, open the curtains in the morning and let the sunlight in.
 > At least it happens once.
 
 I see. Even if you sleep twice, do you get up at a certain time and bask in the sunlight at least once?
 
 
 > Decide what you are going to do for now after you wake up.
 > I'll prepare a "wake-up call" or something.
 
 I didn't know about "wake-up" but it seems to be something you eat before breakfast. I am currently taking Soukai Vitamins for breakfast, but I was thinking that I should prepare something harder since I don't move my jaw. I wonder if it would be okay to prepare something like mezashi and eat one when I wake up in the morning.
 
 
 I also have to clean up. I have to move. It was garbage day today and I forgot to take out the trash, but I don't care. I guess I should make a list of things to do and fill it in little by little like I did the other day.
 
 *1234448339* Kinshicho Hackathon
 Nau at McDonald's in Kinshicho
 
 
 Maybe a battery charger would be useful. A general purpose battery charger.
 
 *1234455048*I'm tired.
 Not much has been done. My MacBook had hardware trouble yesterday and today. Is it going to die? What a pain in the ass.
 
 
 and now for something completely different I was going to create a web service but haven't started. Ugh.
 
 
 What we'll do tomorrow
 - □ Get up in the morning
 - Wash dishes
 - □ Wash PET bottles
 - □ Collecting mail that had accumulated in the mailbox
 -- □ Throw away what you don't need
 - □ Write a reply to your email
 - □ Clean up the room
 - Map
 - Headphones
 - □ Summarize how to create a GAE project
 
 
 the others
 - 15 Receive keys to new house
 - 20 Pots
 - 28 Return of keys to current address
 - I'll get a haircut soon (maybe next time I'm in Akihabara).
 
 *1234464678*Re: What should the slides be published for?
 http://www.jmuk.org/diary/2009/02/12/0
 
 
 Correct, but only on the assumption that the term "presentation" means "the kind of presentation that is often given at conferences.
 </body>

[Hatena Diary 2009-02-12 https://nishiohirokazu.hatenadiary.org/archive/2009/02/12]