Hatena2007-11-07
code:hatena
 <body>
 *1194403356* Today.
 I brought the ginger tea that has been on my front porch since Monday. It is a delusion that if you leave it at the door, you will not forget it.
 
 *1194403381*Nullsoft Scriptable Install System
 I was wondering what Nullsoft was, and I see that they make Winamp.
 
 *1194403965* What you hear
 http://jijixi.azito.com/cgi-bin/diary/index.rb?date=20070706
 I tried PINK NOIZE which was introduced in but it was not heard at all by me.
 
 Is it by innate disposition, or is it by what kind of concentration you have had in your life, or both?
 
 In the meantime, I'll put Winamp and Pacemaker on the lab machine as well.
 
 *1194411536* IANA CHARACTER SETS
 http://www.iana.org/assignments/character-sets
 
 IANA: Internet Assigned Numbers Authority (IANA, IANA) is an organization that manages numbers associated with the Internet. (via Wikipedia)
 
 *1194413439* Like the difference between Shift-JIS and ms932.
 http://www.ingrid.org/java/i18n/unicode.html
 
 >|python|
 >>> "(^～^)(∥_∥)('－')"
 "(^\x81`^)(\x81a_\x81a)('\x81|')"
 >>> _.decode("sjis")
 u"(^〜^)(‖_‖)('−')"
 >>> print _
 (^～^)(∥_∥)('－')
 >>> print u"(^～^)(∥_∥)('－')"
 (^～^)(∥_∥)('－')
 ||<
 
 Ho-ho. I knew it was converted when I posted the Hatena Diary, but the emoticons in the last two lines were different faces.
 
 http://www.nishiohirokazu.org/files/sjis_vs_ms932.png
 
 I used to call it sjis without thinking, but I guess that means I need to understand that it is not strictly Shift_JIS.
 If the above code is written as shown below, it will not cause garbled characters.
 
 >|python|
 >>> "(^～^)(∥_∥)('－')"
 "(^\x81`^)(\x81a_\x81a)('\x81|')"
 >>> _.decode("cp932")
 u"(^～^)(∥_∥)('－')"
 >>> print _
 (^～^)(∥_∥)('－')
 ||<
 
 ---
 
 Oh, I just looked at this in the live reader and the parallel lines are normalized to the perpendicular one. Interesting.
 
 *1194414803*Common Filter Interface
 I've been writing a proxy server for the past three days, and I think I can do what I wanted to do with DeleGate better than the way I was trying to do it.
 
 http://i-red.info/docs/Manual.htm#CFIscript
 
 CFI cool.
 
 *1194443300*DeleGate
 I had passed it up because it was an email, but this was a pretty good document. There are many examples.
 
 http://www.delegate.org/delegate/cfi/
 
 *1194443513*DeleGate is very good!
 It's much better than the proxy I spent two days writing! (No wonder!
 
 *1194444895* If you want to learn Python.
 I was told by amachang.
 
 http://d.hatena.ne.jp/dropdb/20071107#c
 >>
 dropdb "Five years ago, when I told a certain company at an interview that I had started studying python, I was told that there was no demand for python in Japan, so I stopped studying. After I joined the company, I was traumatized for a while because they gave me the adana "python". I don't think it will ever catch on because of my curse! HUNGARGHHHHHHHHHHHHHHHHHHHHHHHH!
 <<
 
 There are men (or bosses) who, when a woman (or subordinate) is studying something they don't know, say, "That's meaningless.
 This is how incompetent bosses nip their subordinates in the bud!
 
 By the way, riding this "boom of women who want to be geeks", why don't we recruit women who want to learn Python at Django-ja? I'll teach you! I'll teach you!
 
 ---
 
 Postscript:
 When you write a blog complaining that it didn't work, you can copy and paste the error message, LifeHack!
 
 Real-world examples:
 http://d.hatena.ne.jp/technolize/20071015/1192411866
 and reactions to it
 http://www.lingr.com/room/django-ja/archives/2007/10/15#msg-16377390
 
 It's a life hack that takes advantage of the programmer's habit of wanting to determine the cause when he sees an error message!
 
 *1194445128*Today's Summary
 I didn't end up doing PHP.
 I may throw away PHP already.
 
 - FreeBSD version of lxml does not have Shift_JIS codec and tostring(tree, "Shift_JIS") gives me an error "There is no such codec".
 - I found that http://proxy_server/filter/filter_name/original_pathにアクセスすると指定されたフィルタを適用した結果を返すようにしようとしたけども causes a lot of problems when you POST to a message board, etc. I almost thought I could just use GET But I decided to put the filter information in the cookie. This way we can apply a combination of filters.
 - Even if the filter is changed, the original server returns NotModified for If-Modified-Since, so even if CACHE=no, it will not be updated without Shift+F5. Apply the following file to FTOSV.
 >||
 #!cfi
 Remove/If-Modified-Since:
 Remove/If-None-Match: 
 ||<
 
 The configuration file and all the scripts together may not be more than 100 lines.
 DeleGate is great! I can't believe how easy it is to create a proxy!
 
 Tomorrow, we will be able to create filters outside of Python.
 Maybe add Rhino and do server side JS.
 </body>
 <comments>
 <comment>
 <username>nullpobug</username>
 <BODY>>Would you like to? I'll teach you. <br>Static</body>.
 <timestamp>1194447517</timestamp>
 </comment>
 <comment>
 <username>trshugu</username>
 <body>Static w</body>.
 <timestamp>1194490381</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Static dead weight (><</body>)
 <timestamp>1194495821</timestamp>
 </comment>
 <comment>
 <username>ZIGOROu</username>
 <body>wwwwww</body>
 <timestamp>1194501001</timestamp>
 </comment>
 </comments>

[Hatena Diary 2007-11-07 https://nishiohirokazu.hatenadiary.org/archive/2007/11/07]