Hatena2010-05-11
code:hatena
 <body>
 *1273581599* Productivity Considerations
 When did I work productively? When have I wasted time because I couldn't get my work done? Reprinted from Twitter.
 
 ** 整備不良
 A phenomenon caused by the body not being properly conditioned.
 
 *** Maintain proper blood sugar levels
 Maintain blood sugar levels. If you do not take carbohydrates for a long time, your blood glucose level will drop and you will feel "unmotivated and sluggish.
 
 *** Maintain proper body temperature and body water content
 Maintain an appropriate body temperature. Productivity will decrease if body temperature rises too high and dehydration occurs because air conditioning should be turned on but is not. Drink water frequently.
 I don't know of many cases where problems have occurred due to not realizing that the body temperature has dropped too low. In the case of programmers like me, it may be because a drop in body temperature causes easily recognizable symptoms such as biting fingertips and inability to type on a keyboard.
 
 *** Get proper rest.
 Sleep properly. Around all night/fatigue -> high tension -> shortness of breath, you start to slack off and look at Twitter, unable to do anything productive. You don't realize you are tired and don't feel sleepy. The drugs in your brain have made you insensitive to your own tiredness. Therefore, you can fall asleep as soon as you get into the futon and close your eyes.
 *** Wake up
 Wake up properly. You can't be productive if your brain is still asleep. Shower, rinse your face with water, coffee, eat a jaw-dropping meal that sends blood to the brain, exercise, get some morning sun, follow your usual wake-up protocol, etc. This goes along with blood sugar, but eating breakfast is quite important.
 
 ** "Big wall" issue
 The phenomenon of having "too big tasks" that have not been divided into tasks, and being stalled because you don't know where to start.
 
 We need a list of ways to break the stalemate when it hits.
 -Clearly identify the first step to completing the task. A journey of a thousand miles begins with a single step. It is not necessary to know the entire path to the task from the beginning, and unless the problem is very simple, it is impossible, and pursuing it is a waste of time. But if you don't know the first step, you can't start.
 -Failure to answer the question, "If you were to proceed with this task for five minutes, what would you do?" is evidence that you have lost sight of the first step.
 - One of the reasons for not knowing which direction to go is that you have hit a wall and have not found a way through it. If you don't know what to do after five minutes of thinking about it, you should just walk around.
 - Break down the task. In particular, separate the "things that need to be looked into for execution" from the actual work. In many cases, the reason for this is a lack of preliminary research. The reason for this is often a lack of preliminary research.
 - Identify the issue to be resolved. Put the issues in a different format. Write it in pictures, bullet points, programmatically, or dare to specify important keywords as NG words. Collect case studies. Find commonalities among the cases. Divide the cases into two groups.
 - There are quite a few variations on just how to break through the "stalemate" of being up against a wall. Speak to others in language, translate into English, express yourself without using letters, drink alcohol, sleep, and so on.
 - Change location. Take the train. Turn off the machine and write on paper.
 - Questions that lead to task breakdowns: "What would you do if you only had 5 minutes to do it?", "What do you need to research to perform that task in an environment with no internet (no research)?", "What do you need to tell others to ask them to do it?" What else?
 --Writing in question form like this, or leaving some holes in the text, is a common technique used to generate ideas. If there are holes, you want to fill them in.
 
 ** 情報過多
 -There are times when there is too much information bubbling up in your head and you are too flustered to start anything. When you are in that state, you need to cool down in a place with less noise. Too much caffeine can also cause this. Even though it is legal, it is an addictive drug and should be used in moderation.
 
 -If there are multiple things that need to be done, to avoid the phenomenon of being distracted by the other while trying to do one, I chant "I can only do one thing at a time" and write one on a piece of paper and concentrate on the other.
 -- Anyway, tasks should be written out on paper or in an editor. You can't do them all at once, and when you come up with two, having one in your brain will interfere with the implementation of the other. It is a MUST to kick them out of your brain anyway.
 
 -The next problem encountered when one starts practicing the ironclad rule of task management, "List your tasks anyway," is that the amount of tasks listed is so large that it is difficult to know where to start. Many people give up here and return to primitive task management such as deadline-driven. Systematic disposal is necessary.
 
 >>
 @voluntas: You need to be able to determine if a task is really necessary. You need to be able to execute tasks, but you also need to be able to review them.
 @nisio: hmmm. The least expensive task solution is disposal.
 <<
 
 ** Other unorganized
 - The "why to do it" must be clear. Tasks for which you don't know why you are doing them create so much pain that it becomes torture to dig a hole and fill it.
 - Observe the repetitive tasks carefully and consider whether the areas that are time-consuming and prone to failure can be avoided by improving tools.
 - There are many books explaining task management, but in many cases they are "methods that the author has gradually built up over many years of ingenuity," not realizing that the "gradual building process" is essential to making oneself proficient in the method. Neither the author nor the reader.
 - Tasks done with free will are more productive than tasks that are ordered by others. However, complaining that "productivity is low because it is not free will" will not solve anything. It is necessary to develop the skill to find the fun in a given task.
 - @dwenomo: Another important thing is to coordinate the waiting time with others. So it is important to allocate the process to others before judging it to be impossible, or conversely, not to make others wait. The probability factor is larger than the individual estimate.
 - @dwenomo: I think the PS3 trash can has all those elements, but it's hard to clear.
 - @dwenomo: Basically, parallel processing is difficult, so what can we do to make it serial? And I think it's about eliminating free time. Then it is necessary to rearrange the order of processing first, and to estimate the time for each process.
 - @shibukawa: The reason I recommend translation in the "pinch-to-grab study method" is that it is easy to grasp the big picture of the work that needs to be done, it is easy to feel a sense of accomplishment that you are making progress, it gives you confidence, and it helps others. It is easy to get a sense of accomplishment, confidence, and help others. It is an easy study to measure. http://www.amazon.co.jp/gp/product/477414259X?ie=UTF8&redirect=true&linkCode=shr&camp=1207&creative=8411&tag=shibukawayosh-22
 - @niku_name: I know it's obvious, but I don't see anything about keeping track of productivity... Without the PDCA cycle, it's hard to measure whether the productivity has been improved as a result of the improvements.
 The ironclad rule that "tasks should be written down in something easy to use and non-volatile" is an important element that comes up in many task management methods. Breakdown of tasks is also often mentioned. However, the specific methodology is not often discussed.
 --The granularity of the task varies from book to book: some books say 2 minutes, some say 15 minutes, and some say 2 hours.
 --Considering task breakdown methodology
 - @niku_name: I studied in the SME management of operations, and I heard that the order of "naijuka" works for reviewing the process. Can't we do it in the same way, can't we do it in the same way, can't we change the "jyunban", and can't we do it in the same way?
 -There are some tasks that are resistant to arrival because they have failed many times before or are coupled with unpleasant memories. It's like a food you don't like. Eat a little and immediately praise yourself for taking on the challenge.
 -Do not strive for perfection. Realize that humans are stupid creatures. We put a lot of time into making the perfect plan, but when we start walking away, the landscape changes. What you thought was perfect will fall apart. Lighten your footwork.
 -Overcoming the reverse deadline effect: when you have to go out in 60 minutes, you can't concentrate even though you should be able to work for 50 minutes because you only need 10 minutes to get ready. It is difficult to do anything creative in such a state of mind. You should do tasks that do not cause problems if interrupted in the middle of research, study, etc.
 -Confirm that the task is really the task you want to accomplish. Are there actually benefits to not accomplishing it? Are the benefits of accomplishing the task less than the pain of carrying it out? Weigh the advantages and disadvantages, and if the disadvantages are greater, you should discard the task.
 -Define the goal of the task. When there is a quantitative goal, it is easy to see that you are approaching the goal through your own work, and it is easy to feel a sense of accomplishment.
 
 *1273588496*Leverage memo: agile retrospective
 Retrospective = Reflection
 - Setting the scene: confirming goals and agenda, creating an atmosphere conducive to participation
 - Data collection: sharing both objective and subjective data to create a "common understanding
 - Idea generation: Examine "common understanding
 - TODO Decision: Prioritize ideas and decide what to do
 - End: determine how to execute the TODO. Retrospective Retrospective
 
 
 ** Questions to look back on
 - Where are you?
 - How can we do better?
 - What needs to be resolved to break the regret?
 - Are you becoming the person you want to be?
 - Are you influencing others the way you want to be influenced?
 - What should we do now?
 - Are you using your strengths well?
 
 ** 場の設定
 Each person should be allowed to speak first. To remove the assumption that "you don't have to talk all the time."
 
 Goals. For example, "Kaizen repetitive tasks."
 
 Need to reconcile commitments and values to keep meetings productive.
 
 ** Data collection
 Data that can be objectively quantified is not the only data. Emotions are also important data.
 
 ** Idea generation
 Methodology for generating ideas
 
 ** TODO決定
 We cannot change others. We do not attribute problems to others, but change what we can change.
 
 ** 終了
 Measures to ensure that what is learned stays in the mind.
 
 
 ** Manage group dynamics
 Talk to people who don't talk. Give them a chance to speak. Do not force their opinions. Simply create an opportunity for them to start talking.
 Ask those who talk too much to individually ask them to hold back, set a cue for them to stop when they are talking too much, and say, "Thank you, Fatty, but let's hear other people's opinions, then.
 
 You are what!" I will ask them to rephrase it in the form of "I am what?
 
 ** 創造力を回復する質問
 -What was done before? What happened? What would you like to try doing differently?
 -What would you get if you had it?
 -Have you ever tried doing things differently? What happened?
 
 ** 時間の管理
 If the discussion is still heated at the time when it is scheduled to end, ask, "If we continue, we will not reach the final goal in time, but should we continue the discussion or leave it aside?
 
 ** 雑談
 Is that conversation something we should share with everyone?" I ask.
 </body>

[Hatena Diary 2010-05-11 https://nishiohirokazu.hatenadiary.org/archive/2010/05/11]