Hatena2009-01-19
code:hatena
 <body>
 *1232372449* Flowchart for not starving to death
 Until yesterday, I was in a state of what RPGs call "the state abnormality (hunger, confusion) icon over my head," so I think of ways to avoid it.
 
 first phenomenon
 <ol>
 <LI>Motivation gauge reaches 0 due to poor health.
 <li>I don't have the energy to cook a decent meal, but I also don't have the energy to go out to eat -> cook rice and eat it with furikake and eggs
 <li>*Rice will be depleted*.
 <li>I don't even have the energy to go buy rice.
 <li>"You are confused!"
 <LI>Inability to act for several turns
 <li>"You are awake."
 <LI>I discover "brown sugar karinto" which I bought from the cupboard but had put away because of its very high calorie content when I looked at it closely.
 <li>"You ate a brown sugar karinto. It is delicious! You felt a rush of power!" I could feel the blood flowing roughly when I spoke after holding my wrist to stop the blood, but when I ate the karinto, I found that something in my spirit was filled with "will power" roughly. 2 pieces were enough to feel the effect.
 <li>Your motivation is restored, so you go to buy rice and chicken ramen. You remembered you had frozen fried rice in the freezer."<li>At any rate, you boil water and add an egg to the chicken ramen and eat it.
 </ol>
 
 In other words, <del datetime="2009-01-19T22:40:49+09:00">stockpile a lot of brown sugar karinto</del>, no, I was talking about the need to make a flowchart and put it on the wall because I can't remember if I have frozen food or not.
 
 - If you get hungry...
 -- Cook and eat rice
 -- Make spaghetti
 -- Eat frozen foods from the freezer
 --- I'll replenish it after I eat it.
 -- Going out to eat
 -- If none of these motivate me, I eat a brown sugar karinto from my stockpile.
 
 Maybe it wasn't enough to make a flowchart. But for now, I'll stockpile about three bags of brown sugar karinto. It tastes much better than dried bread and has more calories.
 
 And since there is spaghetti and rice cakes, but I can't remember them, it may have been "some kind of abnormal condition → loss of thinking ability → inability to think of any food other than rice" instead of "running out of rice and consequently starving".
 </body>
 <comments>
 <comment>
 <username>jbking</username>
 <body>Yokan (small portions) are also recommended for their long shelf life</body>.
 <timestamp>1232374572</timestamp>
 </comment>
 <comment>
 <username>shou</username>
 <body>That's dangerous. Mushiro, even if you have a nice girlfriend (ry</body>) here.
 <timestamp>1232417616</timestamp>
 </comment>
 <comment>
 <username>Yoshiori</username>
 <body>Please add "call or email Yoshiori" to the flowchart. <br>Feel free to go out for dinner! </body>
 <timestamp>1232423824</timestamp>
 </comment>
 <comment>
 <username>TOKOROTEN</username>
 <body>I often do this too. <br>I'm not sure if it's a problem for you, but it's a problem for me too. <BR><BR>On weekdays, I have tasks that need to be done, and so I naturally eat meals with those tasks in mind, but on holidays, I stay home to rest, so I have no purpose, so I don't care about eating. <br><br>After writing this, I realized that I am not a workaholic. </body>
 <timestamp>1232437103</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-01-19 https://nishiohirokazu.hatenadiary.org/archive/2009/01/19]