Hatena2011-12-31
code:hatena
 <body>
 *1325298270* Writing Diary
 - When I can't write, I read first. To remember what I was writing.
 - What you want to write should first be output without regard to quality or format. Quality can be improved later.
 - Recording information in the brain on indelible media relieves the pressure to remember.
 - Decide on a time and declare it. For example, "I will work from 10:00 to 11:00 a.m." or "I will concentrate for 25 minutes from now.
 - The long road cannot be traveled all at once. Nor can we suddenly output a finished version of a text. All we can do is step by step toward the goal.
 - If you see "writing" as a big task and shy away from it, you will not get anywhere. If you break it down into smaller tasks and observe how long it took to complete each one, you will have a better idea of how long it will take you to finish.
 - Measurement is essential for improvement and control. Of course, not all tasks can be measured. However, it is necessary to make efforts to find subtasks that can be measured, rather than stopping to think by saying, "This is a task that cannot be measured.
 - Productivity is enhanced by the design of methods.
 - Human capacity is limited. It is futile to plan beyond our capabilities.
 - Human cognitive capacity is limited. If you collect too many written sentences, information notes, etc., you will become confused because you cannot grasp the whole picture. It is as if there is nothing that can't be brought out right away. It needs to be organized and discarded.
 - There is a limit to human cognitive capacity. There is a limit to the amount of information that can be put on the chopping block at one time. If you try to put everything on the board at once and your thinking becomes confused, you should suspect that the amount may be too much. Either change what you put on the board and repeat the process over and over, or discard what you don't need.
 - In many cases, "koto," "mono," and "no" have been substituted without using concrete nouns.
 - I had a table of contents in the index.rst of the project that expanded to the fourth level. That would require scrolling down to the link to the housekeeping page, and moreover, it would be overwhelming. I created another page, detail_toc.rst, where the table of contents is expanded to the fourth level, and index.rst shows only one level, i.e., the title of each chapter.
 - There is psychological resistance to deleting sentences that do not fit the flow of the story but have been lumped together to some degree. I created a "column repository. I made it easy to delete sentences by creating an excuse that I can always go back to them if necessary, or put them in as a column if the situation demands it.
 - The manuscript is managed by git. I git add -p at appropriate times. I can review what I have done and manage the version.
 - What do you mean by "improve your writing?" How can you possibly implement something you don't know what it is? What is the objective you want to achieve? What is the way to achieve it?
 - Too many sticky notes. There is a need for organization. What is organization? Organizing means putting things where they belong. The first thing we should do is to separate what we use for writing, and what we don't use but can't get rid of, and this is the first thing we should do.
 - f:id:nishiohirokazu:20120102204936j:image
 - "I can't do it now because I don't have ~" or "Let's do it where there is ~" are likely to be naive. When we are unmotivated, we unconsciously look for reasons not to do something. Whether there is no paper, no PC, or no reference materials, stopping to think "I can't do it now" without thinking "Is there anything I can do now?" is a form of escapism.
 - The same goes for "I can't do it now because I don't have time" or "I'll take time to do it next time."
 - Aren't the tasks that we know we need to do but have been left unfunded and uninitiated too big? Why don't we start with the most casual touch without being overbearing?
 - The reason you are not confused by organized information and confused by a bunch of unorganized sticky notes is because they are unorganized and the scope is large. Organization means limiting the scope to a small size. While this prevents confusion, it also makes it harder to find knowledge that creates value when combined.
 - It is futile to stop writing when you are caught between the sentence you want to write and the thought that there is no place for that sentence in your current writing, so you need to make a place for the sentence that has no fixed place and vent for now.
 </body>

[Hatena Diary 2011-12-31 https://nishiohirokazu.hatenadiary.org/archive/2011/12/31]