Hatena2014-02-26
code:hatena
 <body>
 *1393341712*Re: Happiness as an engineer depends on whether you join a community or not
 I agree with the direction of Kishida's entry, but I fear that the recipients of his words, "You will be happy if you join a community," may not understand what a community is because they have no experience in a community and can only understand the words as "you will be happy if you join X." Therefore, they may not be able to distinguish the words from a solicitation for a new religion. Therefore, I fear that they may not be able to distinguish the difference between "happy in community" and "happy in X." I am not sure that this is the case.
 
 I think the important thing is not so much "getting into X" but rather the "friends with similar interests and no conflicts of interest" that one gets from it. By "no interest," I mean not being in the same company, not being a business partner, not being a competitor. If you live your life going back and forth between home and work, your relationships will be with people who are all interested in each other. This makes it impossible to discuss what you want to discuss. Also, the lack of friends with similar interests will also prevent you from discussing technical matters.
 
 The goal is to "make friends" and the means is to "join the community. I don't like places with many people, so I don't participate in events where there are many people.
 
 ref. <a href='http://d.hatena.ne.jp/nowokay/20140225'>Joining or not joining a community determines your happiness as an engineer - Kishida's Hatena</a>.
 
 *1393422934*word2vec is interesting
 >>
 I agree with Rokudasan's actor, but I think that the reason for the phrase "I feel uncomfortable when I arrive at the coordinator" is that he has never experienced the coordinator, so he does not know "who the coordinator is" and can only explain it as "I feel uncomfortable when I arrive at X." I can't imagine that he can only explain it as "I feel uncomfortable when I arrive at X. Therefore, I can only explain it in terms of "I feel uncomfortable when I arrive at X." This makes me think that the advice and identification of rival moralities may not be initiated.
 
 What is important is not so much "getting to X" but rather "acquaintances who are not related to the government or have different interests". Not being related to the executive branch means not being related to any Fujitsu, not being related to any pre-financial firm, and not being related to any competitor in the same industry. If you have lived in a family where only A and Fujitsu are involved in the business, you will end up with children who are all related to the government. This makes it impossible for them to consider what they want to consider. However, the lack of acquaintances who have different interests also prevents me from considering the things I want to think about.
 
 The goal is to "use people you know" and the method is to "get a coordinator. I'm not a fan of large groups of kids, so I don't attend the more egotistical connections, but I'm thinking that mailing lists or wikis might be another "way" for these kids to get to know each other.
 <<
 I converted yesterday's entry: http://d.hatena.ne.jp/nishiohirokazu/20140226/1393341712
 
 I'm not good with particles and sometimes I convert words into something with a similar meaning and sometimes into something with the opposite meaning...
 
 I'm not a fan of particles (although I am), but the above conversion excluded particles and auxiliary verbs from the conversion in the first place. word2vec looks at co-occurrence with surrounding words, and there is a difference between the pattern "X became . Y" and "X became . Y" are very similar in terms of co-occurrence in the surrounding words, and "た" and ". Y" and "X なっ た..." are also found in other contexts, so they are equalized, resulting in the learning of "なる=なっ".
 
 >>
 I thought I didn't know the difference between Qiita and a mailing list, but now I know it's sadly different.
 - On the mailing list, the only way to get a journal to make a mistake is to suggest in writing before the mistake was made and change the book, but on Qiita, you can submit a pull request (I don't know if you can get them to do that or not) and they will change the book.
 - Before the mistake was changed, the "logo" of this magazine can go down to the child to modify the view.
 - Kobito's user interface is global and multi-processor markdown-free reading.
 - Kobito would be a good flyer hack for a spectral venture kyapital head, not a good one for Gist.
 - Multiprocessor footprints can also be measured with Kobito after publishing with Lucid.
 - Top page information can be PyPI'd with Icon, and pain is also available.
 - In any BMP in Crotonville ubunttl what because you can write swapO calm to pass through when a single child reads
 - It is possible to use github and Qiita feeds to say how to write, so it is a ka game engine air certification.
 The reason is that the caching and motivation systems for saying and changing things are sadly different, even though what is visible within is only visible on the mailing list.
 <<
 http://d.hatena.ne.jp/nishiohirokazu/20140222/1393037245
 
 Let's convert the description of word2vec itself and compare them side by side.
 >>
 Natural language processing that maps words to integers (or 1-of-K vectors) cannot consider relationships between words. There is a proposal to map words to dense real vectors, which would make a lot of progress. However, existing methods are computationally heavy. I tried a lighter method to see how accurate it would be, and the accuracy was surprisingly good. I think this is a good idea. This is the story.
 <<
 >>
 Phenomenal programming controls that equate dictionaries to numbers (or 2-in-K norm) do not allow us to see the associations between dictionaries. It is suggested that equating dictionaries to a bounded imaginary norm would be a jarring progress. And the existing methods are light on GCD. I tried it with a much heavier method, and when I looked back to see if I could get the same level of quality, I found that I could get a very good quality. That's all right, isn't it? That's what I was thinking.
 <<
 </body>

[Hatena Diary 2014-02-26 https://nishiohirokazu.hatenadiary.org/archive/2014/02/26]