Hatena2008-08-09
code:hatena
 <body>
 *1218229525*@品川
 Google.
 It is said that it takes about 20 minutes to Haneda Airport. I have plenty of time to spare. I heard that there are showers at the Shinagawa bus terminal.
 
 Shinagawa Bus Terminal - Tell us! goo http://oshiete1.goo.ne.jp/qa2986620.html
 
 It looks like there is one at the airport.
 
 Airport Lounge [Central]/Facilities & Shops/Haneda Airport Terminal BIG BIRD http://www.tokyo-airport-bldg.co.jp/tenant/detail/44.html
 
 The bus terminal is cheaper, but there's the uncertainty of getting lost, so let's just head to the airport for now.
 
 *1218229595*Fushigi car
 f:id:nishiohirokazu:20080809060635j:image
 
 *1218233154*@快速特急羽田空港行き
 On the train to Haneda Airport. This is not the level of sound leakage, dude. Is it hearing loss?
 
 The cyborgization of the human body is a common theme in science fiction, but I think that implantable hearing aids may be the first to become widely used for non-medical purposes. I think that implantable hearing aids will be the first to be used for non-medical purposes.
 
 
 
 No, the loudest people are not motivated to become cyborgs because they are not aware of the trouble they are causing in the first place. I guess the first application would be for "non-essential" people for medical purposes. In other words, the application of digital artificial eyes for the blind for people with presbyopia. Oh, I guess that's the same thing as what I'm talking about now, since it's an application of hearing aids.
 
 *1218231670*Happening
 f:id:nishiohirokazu:20080809064110j:image
 
 *1218231866* Date!
 f:id:nishiohirokazu:20080809064425j:image
 Wait, who made the reservation for August 21? (Myself)
 
 -----
 
 I asked at the information center and was told to go to the purchase window, where I am standing in line.
 
 *1218233024* Thank you for your help.
 
 There are seats available on the scheduled flight to Nagasaki!
 
 -----
 
 At the information center, I was told that I had to buy a new ticket and cancel it separately at the domestic.com since I couldn't change the one at the domestic.com, but the lady at the ticket counter seemed to have taken care of the cancellation procedure for me.
 
 *1218233847*Shower
 
 First time using it and it's cleaner than I imagined.
 f:id:nishiohirokazu:20080809071726j:image
 
 Large shower head
 f:id:nishiohirokazu:20080809073334j:image
 
 *1218236179*@Lounge
 Since I went in, I had breakfast with two pieces of free bread and coffee. Bread is limited to 2 pieces, and snacks are paid for. Well, it's nice to have a power supply. But it's already 7:55. It's time to move on to the next aspect. I can't slow down.
 
 *1218236955*搭乗
 
 I got on some kind of bus.
 
 *1218245487*@長崎
 I'm on it.
 
 
 f:id:nishiohirokazu:20080809104554j:image
 
 *1218247474*Good weather
 f:id:nishiohirokazu:20080809110433j:image
 
 *1218249567*会場到着
 f:id:nishiohirokazu:20080809113926j:image
 
 Huis Ten Bosch can be seen on the left.
 
 
 
 I was going to take pictures of the venue's building later, but I completely forgot about it.
 </body>
 <comments>
 <comment>
 <username>coji</username>
 <body>よかったねw@搭乗口</body>
 <timestamp>1218235053</timestamp>
 </comment>
 <comment>
 <username>earth2001y</username>
 <body>A new page has been added to the Nishio legend</body>.
 <timestamp>1218242215</timestamp>
 </comment>
 <comment>
 <username>ひど</username>
 <body>MoPo-san said once upon a time that he wanted one. <br>The type of earphones that embed in the ear. </body>.
 <timestamp>1218247752</timestamp>
 </comment>
 <comment>
 <username>ひど</username>
 <body>Availability in the morning of such a peak day of the rush to return home... that's really good</body>.
 <timestamp>1218247839</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-08-09 https://nishiohirokazu.hatenadiary.org/archive/2008/08/09]