Hatena2008-08-12
code:hatena
 <body>
 *1218520439* Discomfort I feel about "uncomfortable with the study group".
 http://www16.atwiki.jp/tokoroten/pages/904.html
 >>
 1000speakers is different in this respect. With the overwhelmingly valuable Nishio-san and Amachang at the top, people who are equivalent to them are gathered.
 Therefore, those people will benefit greatly because they will be in a situation where there is no benefit to Nishio and Amachang, but to others who are more valuable than they are.
 <<
 
 It is nothing more than a misunderstanding. For example, in this case, you might say, "Wow, I didn't know Curl was such a language. I didn't know it was so widely used. or "I see, OpenCOBOL can do that! That's an eye-opener! and id:amachang seemed to be very interested in the FPGA talk and asked a lot of questions.
 
 
 However, I have become a bit curious as to why these "ideas that are uncomfortable for me" occur.
 
 
 Of course, it is necessary to express things in a simple model for various discussions. However, the idea that "there are superior people and inferior people" is based on the model of a number line, where people are lined up along a certain line, and the further you go to one side, the superior people and the further you go to the opposite side, the inferior people, which I think is not a correct modeling.
 
 First, I would like you to look at this diagram.
 http://en.wikipedia.org/wiki/Image:Hasse_diagram_of_powerset_of_3.svg
 This is a model called a boule bundle, but I don't care what it's called. φ at the bottom of this diagram is a newborn baby who knows nothing. {x} is a person who knows only x. {y} is someone who knows only y, and {x, y} is someone who knows x and y.
 
 A newborn baby who knows nothing is certainly inferior to anyone else in terms of knowledge. But there is no superiority or inferiority between "a 3-year-old who knows some English words but not many Japanese words" {x} and "a 3-year-old who knows some Japanese words but not many English words" {y}. Of course, some Japanese who have studied English as adults may be the equivalent of {x, y}, who knows both words. That person would be superior to either 3-year-old in terms of knowledge.
 
 In this figure, there are only three "information that can be known" (x, y, z), which makes us think that there is a person {x, y, z} who knows all of them. In reality, however, "information that humans can know" is enormous. And unfortunately, the human creature stops functioning within one mega hour of birth. It's not enough to reach the top.
 
 This is my model about people and their knowledge. There is no superiority or inferiority between people who are {a, b, c} and people who are {a, e, g}. And at birth, everyone is an empty φ, and the contents increase with age and the experiences that come with it. Some may think that the person with more contents is superior, but that is simply the same as saying, "Respect your elders. I half agree with that notion. My elders know more than I do, and I respect that. But if there are things I know that my elders don't, I don't think I am unilaterally inferior. Each adult has his/her own experiences, so "someone is better than someone else" is a rare occurrence.
 
 When we narrow down the "knowledge we consider valuable," a superior-subordinate relationship may emerge. For example, let's say my knowledge related to Python is represented by P, {a, b, c, P1, P2, x, y, z}. Let's say there is a person who is the same age as me and works in sales, and let's denote his sales-related knowledge by E and let's say {a, b, c, E1, E2, u, v, w}. There is no superiority between the two, but if we restrict the topic to Python and ignore other knowledge, the two would be {P1, P2} and φ. That makes the former superior. However, if we ignore the other knowledge that is not related to sales, then the two are φ, {E1, E2}, and this time the latter is superior. When we talk about the superiority or inferiority of people in everyday conversation, we implicitly limit the genre to something. Superiority or inferiority is merely a value that expresses how well a person matches that genre, and is greatly influenced by how the genre is chosen.
 
 *1218524023*Check out CMS
 Yesterday, id:snow-bell said "CMS is all about PHP", and I told him that "that can't be true, there are things like Zope and Plone", to which he replied "there are minor things like that (ry)", so I'm going to do some research.
 
 
 First, search for "CMS" on Google.
 
 <img src="http://gyazo.com/9ba3743cdbdc36d385add9705a80c9aa.png">
 I'm not going to investigate the basis of "most used" because it's too much trouble, but anyway, this MovebleType is written in Perl.
 
 
 Next, let's look at Wikipedia. There are a lot of entries in the general-purpose CMS section. At any rate, I was relieved to see that Zope and Plone, which I mentioned, are on the list. If you are interested, you can follow the links and see the explanation of each CMS.
 
 
 The fifth Google search result is <a href='http://www.atmarkit.co.jp/fwcr/rensai/freeauthoring07/freeauthoring07_3.html'> What is a CMS that allows people who don't know HTML to create websites? (3/3) - @IT</a>. (3/3) - @IT</a>. It looks easy, so I'll read this one.
 
 This article describes seven free CMSs.
 The seven are Movable Type, DotNetNuke, XOOPS/XOOPS Cube, WordPress, Zope, Nucleus CMS, and SOY CMS. Each of them has various features, but for now, Movable Type is Perl, DotNetNuke is .NET as the name suggests, Zope is Python, and the rest are PHP+MySQL. There are more PHP+MySQL ones than I expected.
 
 
 Now, I'm not trying to find a CMS that meets snow-bell's needs, I'm just trying to change his opinion that "all PHP & others are minor", so I'll pick up a list of sites using Zope/Plone at random.
 
 -Site using Plone (http://plone.net/sites)
 -- <a href='http://plone.net/sites/shinzo-abe-prime-minister-of-japan'>Shinzo Abe</a>
 -- <a href='http://plone.net/sites/jetro'>JETRO</a>
 -- <a href='http://plone.net/sites/novell-inc'>Novell, Inc.</a>
 -- <a href='http://plone.net/sites/the-free-software-foundation'>The Free Software Foundation</a>
 -- <a href='http://plone.net/sites/yale-university-open-yale-courses'>Yale University - Open Yale Courses</a>
 -- there are so many, it's a pain to find the ones that seem to be well known.
 - Sites using Zope (http://www.zope.org/Resources/ZopePowered/)
 -- NATO
 -- SGI
 
 
 
 And well, here's a light examination.
 
 *1218559894* Tesla Coil
 http://www.gizmodo.jp/2007/11/post_2551.html
 Awesome. I want to play another song!
 </body>
 <comments>
 <comment>
 <username>snow-bell</username>
 <body>Joomla is missing! <br>This is a major CMS overseas.
 <timestamp>1218525456</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I think I saw it on Wikipedia > Joomla</body>.
 <timestamp>1218527176</timestamp>
 </comment>
 <comment>
 <username>nowokay</username>
 <body>For example, if we do a Python study group, there is not much benefit to Mr. Nishio, right? In that study group, only {P1, P2} is discussed. But in the case of 1000speakers, the theme is not limited, so the number of dimensions of the topic increases, and within that space, the number of dimensions that are sparse in one's knowledge increases. So {P1, P2, E1, E2, J1, J2, C1, C2} can be talked about. <br>If you try to have a study group without limiting the theme, it usually becomes a bit of a mess and doesn't go very well. <br>The reason we are able to maintain 1000 speakers is because Nishio-san and amachang are leading the way. <br>I think it is wrong to say that there is no profit for Nishio-san and Amachang, but I think it is true that 1000speakers is different from other study groups. </body>
 <timestamp>1218557840</timestamp>
 </comment>
 <comment>
 <username>Reo</username>.
 <body>In a word, "semi-ordered"</body>.
 <timestamp>1218597316</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-08-12 https://nishiohirokazu.hatenadiary.org/archive/2008/08/12]