Hatena2007-12-09
code:hatena
 <body>
 *1197173837*Overkill is the romance of Han
 From Mac because my Windows machine went bad and I couldn't connect to the internet. I can't get it to convert romance into kanji. I'm a soft bastard > Mac
 
 Finally, I have a sample to use for my interactive source code tinkering story. I went to bed early and woke up around 10:00 a.m. because I got sleepy after having a good dinner for the first time in a while yesterday.
 
 
 I thought about taking a screenshot and uploading it, but it's too much trouble to bring it to the Mac and upload it, so I'll wait until it's all done. I know that rebooting the Winn machine will fix it. I just don't want to reboot while working.
 
 *1197177016*81 bar menu
 http://born1981.g.hatena.ne.jp/kamawada/20071207
 
 menu
 -Wilkinson
 -Root beer
 -Jolt Cola
 -Spam Sandwich
 -Spam, sausage, lettuce and Spam
 -Foie Gras with Sautéed Spam
 
 
 No more, please make a geek bar, 0xcafe, foo := bar, or whatever you want, without limiting it to 81.
 
 Additional menu for 0xCAFE
 - DEAD BEEF
 
 
 Aside from the menu, someone should build a café as a franchise of Cafe Lenoir or something, and make a café where the rental conference room is open to VIP members while no customers are present and a development camp is always being held, or a café that looks like a manga café but has O'Reilly shelves inside for some reason, or some such hole-in-the-wall. Please make such a place.
 
 *1197186828* haha
 
 Ha-ha-ha-ha!
 
 I just came out for dinner. I'm waiting for the Negitama and Tonton Toru and Sarasada Setto, so I'm not busy, so I thought I'd give you an update.
 
 The chaos pattern is now working on video for the story about being able to rewrite the field at run time with gython. Overkill lol.
 
 *1197192266* ginger oil
 
 Today's piece is gingerbread.
 
 
 I don't remember ginger tea being black. The black color is because it is made from humidifier wastewater.
 
 *1197213339*Proposal
 You know, "I'm going to propose to you when I'm done writing my Jython book" is a joke, don't be so starry eyed orz.
 
 *1197215469*Skype
 Since id:yusukebe, disappointed that IRC #1981 has become a cesspool of bots and useless as a communication tool for 1981s, has exposed his Skype ID, we need to make a Skype-enabled bot and put it in CoreRepos as soon as possible. I have to make a bot that works with Skype and put it in CoreRepos as soon as possible.
 
 http://born1981.g.hatena.ne.jp/keyword/Skype
 
 *1197216935* Various Man
 http://www.youtube.com/watch?v=S6e1qetdGU8
 
 
 It was interesting.
 Let's go to bed today.
 
 *1197218160*Rahmen
 http://www.youtube.com/watch?v=ORRGenWpYks&feature=related
 Rahmens at the Piano
 wonderful
 
 - There are many happinesses that money can't buy, for example...
 - If you want money, come to the money department!
 - Teikoku Hotel - Ogya desu de, mamma ga shikkaku
 - ???
 - I'm not dead.
 - The mailbox was scouted. I thought I could be a singer, but they took a picture of me naked!
 
 Fourth what?
 And no Putin and Martin.
 http://www.youtube.com/watch?v=dZuiJAU-ggk
 http://www.youtube.com/watch?v=6OStZxBq4Y8
 I like it a lot.
 
 -----
 
 Oh, I know, I know, I know. It's not "I'm not shin-dee-da-eee." It's "Inu-inu-inu-inu, kowakunai." As I was listening, the phrase "dog" came up and I found it in a search.
 
 So, in summary.
 
 Second half of -gold section (3)
 --http://www.youtube.com/watch?v=pNKK1N1nrHE
 --http://www.youtube.com/watch?v=QHgsNVTQHB4
 --http://www.youtube.com/watch?v=5chzSoPxZrc
 -Teiohkaku Hotel Cheering Song
 --http://www.youtube.com/watch?v=j9DYsLn7iiE
 -The end of the collection (2)
 --http://www.youtube.com/watch?v=iRwh_foRokg
 --http://www.youtube.com/watch?v=2DjhC25KvwA
 --http://www.youtube.com/watch?v=5cvUjvahMpI
 -Chickadee Brothers
 --http://www.youtube.com/watch?v=l7FcmlxfaE4
 </body>
 <comments>
 <comment>
 <username>jbking</username>
 <body>What a group lynching...<br>Everyone is expecting a Jython book, probably, I'm sure. </body>
 <timestamp>1197259363</timestamp>
 </comment>
 <comment>
 <username>earth2001y</username>
 <body>without the spam of it! </body>
 <timestamp>1197282563</timestamp>
 </comment>
 </comments>

[Hatena Diary 2007-12-09 https://nishiohirokazu.hatenadiary.org/archive/2007/12/09]