Hatena2009-03-13
code:hatena
 <body>
 *1236969862*Darudaru
 I can't sleep at this hour, and besides, I'm sluggish with no energy.
 
 
 I decided to drink green tea. It contains both caffeine and theanine, so either wakefulness or sedation would occur.
 
 <hr>
 
 At any rate, "Awakening" seems to have been selected. I should clean up my room. The closet is not being used effectively because of the PC in the closet, and the PC is not being used either. I move the PC to the shelf. But I can't find the power cable.
 
 It fits snugly, but conversely, it cannot be turned backwards when routing cables.
 
 <hr>
 I took a footbath. I usually take a bath with the water at 45 degrees for 12 minutes, but when I took a footbath with the 45 degree water, my feet turned bright red. I guess my body is usually cold and the water is getting colder.
 
 I got a blister when I gouged my sole with a foot roller.
 
 Well, it's almost 6:00. Time for the caffeine phase.
 
 <hr>
 I thought the rice was not cooking, but the plug was not plugged in.
 
 <hr>
 I realized that I have too much stuff when I moved, so I try to consume as much as possible. Today's breakfast was a retort curry with an expiration date of 2008. It was just normal.
 
 <hr>
 We were talking yesterday that rather than aiming to create a taskpaper.el in pure emacs lisp, it would be better to reuse my previous Python <a href="http://bitbucket.org/a2c/todopy/src/f655f21ee208/function. py">parser</a> I wrote in Python before, rather than trying to make taskpaper.el in pure emacs lisp. At least the development cost for me would be lower, and I'd be able to quickly realize my idea of what it should be. At least <a href='http://d.hatena.ne.jp/nishiohirokazu/20090314/1236989566'>leverage notes "So it's not getting done. And yet I don't have time." </a> I was writing and thought the @today tag meaning "to do today" was essential.
 
 <hr>
 I'm starving. I ate breakfast at 8:00 a.m., so it's already been six hours. That's a lot of food. I've mastered the art of freezing rice, so I can eat rice anytime. I thought about eating udon noodles with an expiration date of 2008, but I couldn't find a pot, so I put it on hold.
 
 <hr>
 Hmmm...howm and taskpaper.el are both GPL. Then it's okay to mix them.
 
 <hr>
 I am getting tired of cleaning up my room.
 
 f:id:nishiohirokazu:20090314152124j:image
 
 Woo.
 
 In the meantime, I'll take this wardrobe.
 f:id:nishiohirokazu:20090314161523j:image
 Let's clean up around here.
 f:id:nishiohirokazu:20090314161610j:image
 
 
 Oh, it fits.
 f:id:nishiohirokazu:20090314163107j:image
 Oh yeah, these storage items are designed to fit the closet size.
 
 <hr>
 If you don't have a specific place to put things, you will have a hard time putting them away. Right now, the top drawer of my desk is filled with toys and other things, but I'm thinking of collecting stationery, envelopes, and other such things here. I'm putting them in there for now. I should also put heavy things like documents in the bottom drawer. I'll sort that out later.
 </body>

[Hatena Diary 2009-03-13 https://nishiohirokazu.hatenadiary.org/archive/2009/03/13]