Hatena2011-02-21
code:hatena
 <body>
 *1298255316*Convenience store bag
 
 They wanted to see a picture of where I was using it, so BEFORE:
 
 f:id:nishiohirokazu:20110221112306j:image
 
 After:
 
 f:id:nishiohirokazu:20110221112417j:image
 
 I put it in my bag by mistake and wrinkled it, so I thought about replacing it but haven't done it yet. I have been thinking about replacing it, but haven't done it yet.
 
 *1298298379* mind map diary 5
 Reprinted from Twitter
 
 >>
 Thinking about mind mapping on the train. How can I express "understandability" in pictures?
 <<
 
 >>
 For example, one person wonders how to express "motivation" in a picture, and draws a picture of the gears in his head spinning at high speed and the input and output of the gears are active. Another person might draw a power hump. I can have an "aha" experience and think, "Well, I wasn't thinking about my body," or "Well, I was thinking about the factors that increase the productivity of my brain work. It also broadens my horizons.
 <<
 
 >>
 I'm having trouble putting the caps of the various colored pens on and off when I'm mind mapping, but I wonder how everyone else does it. Today I put a green pen in a black cap and it got messy...
 <<
 
 *1298298453*Pomodoro and PDCA Cycle
 Reprinted from Twitter
 
 >>
 The only case I can't use the Pomodoro properly is when I realize that I haven't turned the timer and the clock is somehow more than an hour ahead. How should I solve this problem?
 <<
 
 >>
 Also, I committed to doing something that I had to do in the four-pomodoro, but I didn't start it at all, and I am doing something else. I guess the estimate itself is wrong, and I should start the task, make a light prototype, and fix the estimate.
 <<
 
 >>
 Ah. With a task list, there's no evaluation cycle because there's no problem with not getting it all done in a day, but Pomodoro's Commitment to Do Today runs the evaluation at the end of the day? It's not that I don't want to do it, so why didn't I start it? It's that it's not urgent, there are other tasks with deadlines,...
 <<
 
 >>
 And then there's the fear that because I've been away from it for a while, the information has slipped my mind and it will cost me to recall it. So how do I get rid of that fear? Documentation?
 <<
 </body>
 <comments>
 <comment>
 <username>Itisango</username>
 <body>I use a four-color ballpoint pen. </body>
 <timestamp>1298441348</timestamp>
 </comment>
 <comment>
 <username>fukken</username>
 <body>asin:B0013NG07U<br>These are colored pencils, not pens, but I recommend these for portability. The drawback is that the number of colors is limited. </body>
 <timestamp>1298467490</timestamp>
 </comment>
 <comment>
 <username>enum</username>
 <body>If you have trouble attaching and removing the cap, how about PILOT's Frixion Nock? <br><br>http://www.pilot.co.jp/products/pen/ballpen/gel_ink/frixionballknock/</body>
 <timestamp>1299651300</timestamp>
 </comment>
 </comments>

[Hatena Diary 2011-02-21 https://nishiohirokazu.hatenadiary.org/archive/2011/02/21]