Hatena2007-12-20
code:hatena
 <body>
 *1198116465*Cold
 
 It's so cold. It's kind of cold from the back today.
 I wondered why, but I didn't take a bath this morning because I didn't have time. Is my body cold?
 
 *1198125589*To mock a mockingbird
 <a href="http://www.amazon.co.jp/gp/product/0192801422?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=1211& creativeASIN=0192801422">To Mock a Mockingbird</a><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as2&o=9&a=0192801422" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" /> received.
 The book is much smaller than I expected, SICP is heavy to carry around but this one is fine.
 A quick glance at the book suggests that there do not seem to be any difficult English words.
 
 *1198133470* Google Quickness
 The "To mock a mockingbird" entry above, which I wrote an hour ago, comes up in fourth place when I search for "To mock a mockingbird".
 
 I was going to write a description of what the book looks like, but I see there's a search inside.
 http://www.amazon.co.jp/gp/reader/0192801422/ref=sib_rdr_ex?ie=UTF8&p=S00F&j=0#reader-page
 The important part where the mockingbird (mimic bird) appears is from Chapter 9.
 
 *1198137228*to mo a mo
 A group to popularize "Tomoamo" in opposition to SICP.
 
 *1198142688* Pen Tablet Anywhere
 <a href="http://exth.net/~togabito/wordpress/2007/12/15/616/">ChronoGate -Togabito's Hibirogu- ver.2 | [weblog]A magical video that turns anything into a whiteboard with a Wii remote ::. I saw a video via Gizmodo Japan (Gizmodo Japan)</a> that shows how to make a pen tablet using the infrared camera of a Wii remote control and thought "wow", but then I realized that it doesn't have to be a Wii remote control at all and a regular USB camera can do the same thing if you put a filter that only lets infrared light through. You could do it inexpensively by taking a picture of the black part of the used camera film. I'm sorry.
 
 Inoue-kun is already making it!
 http://mixi.jp/view_diary.pl?id=659358905&owner_id=1978138
 http://www.nicovideo.jp/watch/sm1819990
 http://jp.youtube.com/watch?v=eAqfhhJ7_9g
 
 Genius... and it's on video...
 
 *1198145906* Remote control
 
 I had about three dozen people in a row, so I was frustrated.
 
 *1198158537* Ah,
 I forgot to apply for a paycheck to go to Tsukuba tomorrow.
 
 *1198158587*Wii Remote Control
 I heard that it is easier than using a camera because of the excellent library.
 
 Of course, we just need an effortless library on the camera side.
 
 *1198158775*Tsukuba Accommodation Guide
 Can you prepare it at 8 pm the night before when they say it's good to have a sleeping bag?
 
 I can do it.
 
 *1198161274* scheduled for tomorrow
 I get up properly in the morning.
 
 Great, if I go to bed now, I will go to bed before the date changes for the first time in quite a while!
 
 If I can get up with enough time tomorrow morning, I'll have time in Akihabara to buy a Wii remote control and an infrared LED.
 </body>
 <comments>
 <comment>
 <username>Kyoro</username>.
 <body>Oh! It's been a long time, Nishio-san! <br>Thank you very much for the introduction...<br>But I'm not a genius or anything like that...<br>The video is 80% hobby as usual. <br>See you again at the Boost Conference! Excuse me~. </body>
 <timestamp>1198180578</timestamp>
 </comment>
 </comments>

[Hatena Diary 2007-12-20 https://nishiohirokazu.hatenadiary.org/archive/2007/12/20]