Hatena2014-08-27
code:hatena
 <body>
 *1409110644* Shadow work and what it means to be a winner.
 Episode 4 of the Continuing How Engineers Learn series: <a href='http://cybozushiki.cybozu.co.jp/articles/m000318.html'>The reason I kept going was because I wasn't enjoying my job</a> has been released.
 
 To put it bluntly, the story this time is that "skipping work played an important role in the process of Mr. Kozaki becoming a great person," and I was afraid that some people would say that "skipping work is unethical," but I was relieved to see many positive reactions.
 
 We will answer questions observed on Twitter and elsewhere.
 
 ** Shadow work
 First of all, doesn't the term "shadow work" refer to "housework by housewives" or something similar? From your question, "What do you mean by "shadow work"?
 
 When <a href='http://ja.wikipedia.org/wiki/%E3%82%A4%E3%83%B4%E3%82%A1%E3%83%B3%E3%83%BB%E3%82%A4%E3%83%AA%E3%82%A4%E3%83%81'>Ivan Ilyich ( Wikipedia)</a> coined the term "shadow work," the focus was certainly on the domestic labor of housewives. It means "work that is necessary to maintain the foundations of life, but for which the person engaged in it does not receive remuneration." References: <a href="http://www.amazon.co.jp/gp/product/4000262459/ref=as_li_ss_tl?ie=UTF8&camp=247&creative=7399&creativeASIN=4000262459& linkCode=as2&tag=nishiohirokaz-22">Shadow Work - Questioning the Way of Life</a>.
 
 Kazuo Ichijo and his colleagues, referring to the concept of iriichi in their book, argue that shadow work is not limited to housework. They argue that "there are tasks in business that are not recognized as 'regular work,' even though they make important contributions to 'keeping the company running,' such as performance and goal attainment. So they call this type of task shadow work as well. References: <a href="http://www.amazon.co.jp/gp/product/4492521631/ref=as_li_ss_tl?ie=UTF8&camp=247&creative=7399&creativeASIN=4492521631& linkCode=as2&tag=nishiohirokaz-22">Shadow Work - Organizational Strategies to Promote Knowledge Creation</a>.
 
 This type of task is called bootlegging, skunkworks, and many other terms. In other words, we are still in a situation where the terminology to refer to this concept has not yet been settled. The development of future research will probably determine what terminology will converge.
 
 ** Nuance of "self-indulgence
 
 Next, isn't the opposite of "do as you please" not "do only what you are told" but "suggest and do as you are told"? This is a question that I would like to ask you.
 
 If you multiply "do without permission" by "NOT," you get "don't do without permission," which is why you say "propose and do. If you multiply "do what is not instructed" by NOT, you get "don't do what is not instructed," so the answer depends on the nuance of the word "self-independent. To make it easier to understand, I think it would be better to add the perspective of "whether or not it is instructed".
 
 It should also be noted that there is a large gap between "don't do it on your own" and "propose and do it. The process of "proposing and doing it (with approval)" requires the actions of multiple people. On the other hand, "do it on your own" can be started by a single person. You mentioned in #2 that "lowering the cost of the mental switch at the start" is important. References: <a href='http://cybozushiki.cybozu.co.jp/articles/m000316.html'>Kernel Hacker, Tomohiro Kozaki's "The Art of Reading Code" | Cybozu Style</a>.
 
 ** About skipping work
 
 The impact of the "skipping work" story is so great that it seems to have taken on a life of its own, but even skipping work to play cannot be justified. It is true that Mr. Kozaki did not do "the work he was instructed to do," but he did "other work" and brought higher value to the company than "the work he was instructed to do. This is clearly different from simply slacking off and playing.
 
 In the gihyo version of <a href='http://gihyo.jp/lifestyle/feature/01/engineer-studying/0001'>How Engineers Learn #1</a>, I mentioned that there are three axes of knowledge, one of which is the "applied object" axis. In Mr. Kozaki's case, he had a good understanding of the application object, and he thought there was a better way to accomplish the purpose of the "directed work" and he did it.
 </body>

[Hatena Diary 2014-08-27 https://nishiohirokazu.hatenadiary.org/archive/2014/08/27]