Hatena2014-10-04
code:hatena
 <body>
 *1412422604*「ネット生活を幸せにする宗教 Virtual Religion」の違和感
 I was wondering why, with regard to <a href='http://ja.virtual-religion.org/'>Virtual Religion</a>, while I could accept what was written (with the exception of the rituals), I had a strong sense of discomfort with the whole thing. I have been thinking about it. In conclusion, I thought this was due to the difference between my view of religion and that of Mr. Suenaga, so I am writing it down here. To avoid any misunderstanding, let me first clarify that this is not a request for doctrinal modification. I am grateful to Suenaga-san for helping me clarify my own religious views by publishing such a document.
 
 Virtual Religion's doctrine consists largely of a list of precepts. Perhaps it is based on Mr. Suenaga's religious view that precepts are the core of religion. I do not deny that view. In reality, most religions have commandments. Moses got the commandments, too. see <a href='http://ja.wikipedia.org/wiki/%E3%83%A2%E3%83%BC%E3%82%BB%E3%81%AE%E5%8D%81%E6%88%92'>Ten Commandments of Moses - Wikipedia</a >
 
 On the other hand, in my view of religion, "understanding of how the world works" (truth) is the core of religion. In early Buddhism, what the Buddha gained was "an understanding of how the world works. To put it very roughly, "suffering is caused by our greed, anger, and ignorance," and "suffering can be eliminated by understanding the process by which suffering is created. See <a href='http://ja.wikipedia.org/wiki/%E7%B8%81%E8%B5%B7'>Endowment - Wikipedia</a>, <a href='http://ja.wikipedia.org/wiki/%E5%9B%9B%E8%AB% A6'>The Four Noble Truths - Wikipedia</a>
 
 In my view of religion, precepts are created after the fact, after "understanding" is gained, for the purpose of maintaining the organization and providing specific policies to the believers. I feel that the doctrine of "Virtual Religion" is all about precepts and lacks a core understanding.
 
 Also noticeable in its precepts is "~ is a pleasant act. ～Do not do ~" is conspicuous. If it is pleasant, it lacks why not to do it. Is it an ascetic religion that believes "everything that feels good, must not be done?" It does not appear to be so. If so, then the reason part of "~ is a pleasant act, but ~ is a source of suffering, therefore we should avoid it" is missing.
 
 -----
 
 So far, I have given much consideration to those who follow a religion with precepts, but from here on, I will be dogmatic about my thoughts, so please avoid me if you don't like that kind of thing.
 
 The environment around an individual will always change. If the precepts are made into a doctrine, a mismatch will occur when the environment changes, causing problems.
 
 The individual's "ability to adapt to change" is very important, and anything that hinders it is harmful. If a precept hinders it, then that precept is also harmful.
 
 If we accept the precepts made by others without chewing them over and making our own choices, we may end up accepting precepts that are harmful to us, and this is dangerous. It is necessary for us to make our own choices rather than just accepting what others have given us. Even if we have accepted a precept once, we need to discard it when circumstances change.
 
 -----
 
 Comment
 
 >id:K-Ono In Buddhism, isn't that the difference between the Lesser Vehicle and the Greater Vehicle?　I dare not write Theravada.
 
 I see. It is true that my first priority is to save myself, and I think that I should not talk about the big subject of saving the world until after I have saved myself, so it is a small square. I see, if you want to save many people, it is more efficient to distribute the precepts in an easy package than to ask people to think for themselves.
 
 -----
 
 The term "understanding of how the world works" is an exaggeration, and some may respond, "That's absurd.
 
 - One's happiness is determined by how fulfilled one's life is at the moment of death.
 - I am a foolish creature, blinded by short-term desires and prone to take actions that do not lead to "my happiness.
 - Additional criticism of bad people who have already been socially sanctioned does not create their own fulfillment.
 
 Instead of accepting the precept, "Don't make additional criticisms about bad people who have already been socially sanctioned," we accept the above understanding of the world, from which we can logically derive a course of action, "So let's not do ~."
 </body>

[Hatena Diary 2014-10-04 https://nishiohirokazu.hatenadiary.org/archive/2014/10/04]