Hatena2008-02-09
code:hatena
 <body>
 *1202551800* First weekend without errands in a long time.
 I thought I'd take a rest since I haven't had anything to do in a while, but my head hurts and I feel like it's not something positive called "taking it easy" but something negative called "wasting time. I feel tired and sluggish.
 
 How can we discipline ourselves and use our time effectively?
 
 *1202553328*家事
 I used to crush empty cans, but I decided not to because the collection box said "Do not crush".
 
 **1202586463*Considerations on Ongoing Tasks
 I signed up for Kzoku, a service that keeps you on a diet. For more details:.
 -Locestar President's Diary: "Kzoku," a social diet site where people can lose weight together
 --http://blog.livedoor.jp/kensuu/archives/50452478.html
 
 You can register a lot of tasks, and since you are asked to register things to do with the goal of earning 10 points a day, I twisted my brain and wrote a lot of things. I wrote many of them because I felt that my lack of continuity and the dirtiness of my room reflected that, rather than my diet. I wrote a lot of things like "put the laundry in the washing machine" and "wash and dry the clothes.
 
 I checked before I went to bed and remembered that I had washed but not dried it.
 
 There are various types of tasks. First, non-repeating tasks. For example, "I'm going to mail ________." I have been thinking mainly about this one, but since it has nothing to do with continuity, I won't consider it this time.
 Think about tasks that seem to occur over and over again. The frequency varies from thing to thing. I think you should check your task list at least once every day. I always forget to do this. But laundry doesn't have to be done every day. (Kzoku should include a task "Open Kzoku page" from the beginning. It should automatically point to it when you open it.)
 I added sit-ups and squats to Kzoku's tasks on a whim, but "do 100 squats" would be too difficult for him to start. I decided on "do 10 squats" because it is important to be able to do it every day without any difficulty, but this way, when you finish 10 squats, you can say, "Ah, I'm done. If the system gives 2 points for 20 squats, I would be motivated to do as many as I can.
 Also, I would like to see a graph for each task. If I had that, something like the above with the number of times would be a "squat count graph" as it is. On the other hand, if the graphs are combined even with appropriate evaluation points, that would motivate me to "do XX as well to increase". So the combined graph is a "heavy lifting graph" in the broad sense of the word.
 A task that says "do ____ every day" is not a good goal setting because it will not be accomplished if you fail to do it for one day for some reason or another. It is good to accumulate points each time you do a task. I think it would be good to have a graph that shows not only the total of all tasks, but also the frequency of each task. Since humans are asymmetrical, the way information is presented should also be asymmetrical. Normally, it would show the percentage of accomplishment, but when the record is broken, it would say "You have been doing this for X days in a row! when the record is being broken. If you continue for 3 more days, you will set a new personal record. Oh, the advantage of displaying "You've been doing this for X number of days! The advantage of displaying "You're on a streak!" is, in essence, that it motivates the user to "do it again today and your streak will be increased by one more day.
 Laundry needs to be done once or twice a week (I often forget and get impatient when I'm about to deplete my underwear mid-week), but it doesn't need to be done every day, and it's annoying when it's navigated to be done more often. It's another kind of task. You say, "This is a task that should be done about once every X days." Oops, if you substitute 1 for X, it becomes a normal task. So, the task "do laundry once every 7 days" should be able to be navigated in the same way, "This is 3 weeks in a row! I should be able to navigate it as "3 weeks in a row!
 
 At any rate, I can't carry out the task of "getting up at 8:00 a.m." if I'm up at this hour, so I go to bed.
 
 -----
 - A "time capsule" message that must be renewed three times to be seen.
 - A system that notifies you by email when rivals update theirs.
 -- I think the reason iKnow doesn't last is because of the lack of email reminders.
 -- If I had received an email notification when my rival amachang surpassed me in score, it probably would have stirred my competitive spirit.
 -- Wii fit takes a day off and says, "Huh? What happened yesterday?" I hear they say.
 - When you have not updated your e-mail address for 7 days, the system will contact the e-mail addresses of others who have registered in advance.
 -- but I have a chill that it won't register.
 -- I wonder if it would be better to default to your own e-mail address, or to "notify your competitors if you don't update for a week" or something.
 - At any rate, it is very important to quantify and graphically make it visible.
 
 - http://diet.kzoku.jp/UserTop.action?userId=1409
 </body>

[Hatena Diary 2008-02-09 https://nishiohirokazu.hatenadiary.org/archive/2008/02/09]