Hatena2010-02-25
code:hatena
 <body>
 *1267116108* How the riffle shuffle doesn't mix
 I've been playing the card game Dominion online recently, and unlike when I play offline, I don't have to shuffle the cards myself, which is nice and easy. By the way, when the computer shuffles the cards, they are randomly shuffled, but not when a human shuffles them, right? How well are they mixed? So I did an experiment.
 
 - 1: Prepare 25 playing cards
 - 2: Record the sequence
 - 3: Shuffle as usual
 - Back to 2.
 
 After shuffling four times, I stopped because I could already see the result.
 >||
 1 2 3 4 5 6 7 8 9 t j q k h1 h2 h3 h4 h5 h6 h7 h8 h9 ht hj hq
 6 3 4 5 7 8 9 1 2 j q t k h1 h3 h4 h5 ht h2 h9 h7 h8 hq h6 hj
 6 3 4 5 8 j q 1 2 9 7 h2 h7 t k h1 h3 h4 h5 ht h9 hj h8 hq h6
 3 4 j q 1 2 9 6 5 8 h5 7 h2 h7 h3 h4 hq h6 ht h9 hj t k h1 h8
 j 3 2 4 6 5 q 1 h7 8 h5 9 7 h2 h9 hj h6 ht h3 h4 hq t k h1 h8
 ||<
 The mixture is surprisingly poor. Incidentally, I did the riffle shuffle twice, but not only was there not much mixing, but the two shuffles were in reverse order, which made it even worse.
 
 To quantify the degree of mixing, we look at the degree to which the pairs that appear when five cards are drawn are preserved after shuffling. If I don't shuffle at all, 100% are preserved, and if I shuffle the cards into five piles and merge them (Wikipedia says it's called deal shuffle), 0% are preserved. If you mix them randomly by computer, you get about 15%, and with my riffle shuffle, you get 37%. What this means is that when I am in a situation where I am thinking, "Oh, I have a mine and a blacksmith, which one should I use? Conversely, there is a 1/3 chance that the throne room and the witch will come together. the throne room and the witch will also come together with a probability of 1/3.
 
 So that's why strong Dominion players sometimes do deal shuffling! I guess it helps to break up bad combinations.
 
 By the way, I thought there was a higher "probability of getting the same pair next time" since there was not much mixing, but 1/3 means the probability of not getting the same pair is higher. But it is only 1/3, so the probability of the same pair not coming is higher. On the other hand, in the case of the draw deck, there is a high concentration of villages and blacksmiths in the first half of the discard deck, and a high concentration of coins and victory points in the last half of the discard deck. In the method of multiplying the riffle shuffle twice, this sequence is roughly preserved, so you can draw a chunk of village blacksmiths on the next draw, and the probability of a successful pull-off may be much higher than in the case of the random shuffle.
 
 <hr>
 
 PS: In terms of how many identical pairs come when five cards are drawn, the riffle shuffle or farrow shuffle, which divides the cards into two piles and alternately meshes them together, preserves 40% of the cards, so it is the least likely to mix them. Well, three of the five cards are still among the five cards after shuffling, so it is natural, but it is surprising because the cards seem to be mixed well at first glance.
 </body>

[Hatena Diary 2010-02-25 https://nishiohirokazu.hatenadiary.org/archive/2010/02/25]