Hatena2009-04-23
code:hatena
 <body>
 *1240483064*Blender 
 I'm installing Blender because I was envious of http://d.hatena.ne.jp/inajob/20090423
 
 
 One thing I can say is that with InkScape, after installing it, I could already start designing cards and such without even looking at it, but with Blender, I don't know what to do first when I start it up.
 
 <img src="http://gyazo.com/a1c90d15579c26bb6703216c100a7602.png">
 
 I was able to add the metaball, but I don't know how to rotate the camera or edit what I've already added.
 
 *1240483193*Sequel to "Sick Back
 Stand up, walk, go to convenience store, feel a little discomfort in the back of my right hip, go home, discomfort gets bigger orz.
 
 
 Should I keep quiet for a while longer or should I go to an orthopedic surgeon and get some kind of supporter thing?
 
 
 In fact, there is a crack in the pipe of the chair, and the crack spreads when I put weight on the back, but the new one has not arrived yet, so I was using it sloppily, and it appears that it was putting a strain on my back. And my back was in bad shape even before I had the hiccup. And then, he had to lift a heavy box up and down to look for a book, and that was the final straw.
 
 
 f:id:nishiohirokazu:20090423202311j:image
 
 The box halfway on top of the pile of books is the one that broke my back. I couldn't bring down what I lifted so I put it on top of the pile.
 
 
 I searched for the nearest plastic surgeon. I'll call tomorrow morning and ask if he's available. The chair arrives tomorrow. Thinking about what to do with the old chair.
 
 
 I bought some ice cream at a convenience store but forgot and it melted. I feel generally sick. I guess that's to be expected since I've been sleeping and eating junk food all day.
 
 *1240499342* sorry
 <a href='http://d.hatena.ne.jp/aureliano/20090423/1240454590'>7 Requirements for New Programmers to Stand Alone as a Professional Programmer - Meet Huckleberry</a>
 >>
 Anyone who has things cluttering up their desk is generally an incompetent programmer.
 <<
 
 I'm sorry. I'm sorry.
 
 **1240507637*Quadratic Functions Solution-like Something Explanatory Edition
 <a href='http://d.hatena.ne.jp/nishiohirokazu/20090422/1240428559'>Something Solution-like for Quadratic Functions - The Hatena Diaries of Yasukazu Nishio</a> Commentary
 <img src="http://gyazo.com/234fb5bc55e5b5e92aba46b58bcf8cdc.png">
 
 :左側の長方形の横幅: x
 : Area of the rectangle on the left: x multiplied by some constant (the height of the rectangle). bx.
 :左側の長方形の中の正方形部分の面積: x^2
 : Area of the gray area in the left rectangle: constant, so c
 
 That is, the area of a rectangle can be expressed in two ways: bx = x^2 + c. Transforming it, x^2 - bx + c = 0.
 
 It's hard to tell, so I'll just redraw the middle one.
 
 <img src="http://gyazo.com/0e95d4be0d7935e11c13840433805e73.png">
 
 One side of the square on the right: b/2 since it is half of b
 :右側の正方形の面積: (b/2) ^ 2 = b^2 / 4
 :灰色の部分: c
 : Area of the square on the right, removing the gray area from the square: b^2 / 4 - c
 :…の一辺の長さ: √(b^2 / 4 - c) = (√(b^2 - 4c)) / 2
 
 You can see that a side of the square on the left is equal to a side of the square on the right that is shifted up and down by (√(b^2 - 4c)) / 2 from a side b/2 of the "big square" on the right. In other words, x = (b ± √(b^2 - 4c)) / 2, which corresponds to the case where a = 1 and b = -b in the "quadratic function solution and coefficient formula" that we were forced to memorize without understanding in middle school.
 </body>

[Hatena Diary 2009-04-23 https://nishiohirokazu.hatenadiary.org/archive/2009/04/23]