Hatena2012-08-05
code:hatena
 <body>
 *1344098195* Advantages and disadvantages of using Facebook for presentations.
 Advantages and disadvantages of using a Facebook public group as a place for people listening to a presentation to communicate during the presentation at a type of event where multiple people are presenting (study groups or conferences).
 
 ** Advantages of Facebook
 - It is friendly to people who read it later because it creates a coherent list for each presenter without the editing cost as much as Togetter. Topics from multiple presentations are not mixed up. No need for an IRC bot for recording.
 - The threads for each presenter have permalinks, so it is easy to mention them on Twitter, blogs, etc. after the presentation. It is also easy for presenters to read and answer questions and discuss after their presentations.
 - Compared to the excitement on Twitter, there are no problems such as forgetting to add hashtags, distorting notations, or missing searches, and communication among the people writing is closer.
 
 ** Disadvantages of Facebook
 - Less power to PUSH presence to unrelated people compared to the excitement on Twitter (can this be done by Tweeting permalinks as appropriate?)
 - People who don't usually use Facebook much often don't turn off notification e-mails, so they are surprised at the large number of notification e-mails in their mailboxes.
 - Usability as a chat is less than IRC.
 - Groups can only be posted to after approval is requested and granted. Anyone can join an event by simply clicking the "Join" button. No approval is required.
 - If someone who is not logged in to Facebook accesses the site, a screen saying "Login required" will appear. If it's an event, you can see the conversation even if you are not logged in.
 - Links to individual event pages are not expanded in the left column, unlike groups (press on an event and then select it from the list).
 
 ** Know-how
 - Mention that you can't write without applying to join (not necessary if it's an event).
 - Allow anyone to approve participation applications. (Not necessary for events.) Make it known that anyone can do so, so that one person does not become the bottleneck.
 - It is easy to get excited when there are one or two people who can provide live coverage.
 - The top post is important because the second post will be collapsed if there are too many comments. Moreover, it seems that the post cannot be edited. It is better for one person to make them all together in the same format.
 - It is okay for anyone to search and age the thread at the start of the presentation; just mention that you need help with the ageing.
 - Create it before you start and set the group's e-mail address. The part of the email address before @ will be used in the URL so that the URL can be easily understood.
 - If you click on the time display of the top post, you will be taken to a page that opens only that thread. There is also a permalink, which is suitable for introducing the topic to others.
 
 ** Invisibility issue for people who are not logged in (not necessary for events)
 - How do we solve the problem of not being able to see people who are not logged in to access the site?
 - It's possible to take a post to a specific group on Facebook via API and transcribe it to your own service... but when someone sees it and wants to write a comment, the flow line is "press the link to the Facebook thread", "log in", "apply to join the group", "wait for approval", "write"... Then, they have to "log in", "apply to join the group", "wait for approval", and "post a comment"...too many hurdles!
 
 
 ** A good idea for Twitter and Facebook.
 - It would be nice if there was a Facebook app that would say posts to one's Facebook public group on one's Twitter account with the thread's permalink. An app similar to that exists, but it tweets status changes rather than posts to the group, so it cannot be used for this purpose. It would not be technically difficult to create an app that suits the purpose of this project.
 - If some users use it, they will hear "discussions on Facebook" leaking onto Twitter. If someone is interested in hearing what is leaked, they can follow the link to see a summary of what was said on Facebook.
 </body>

[Hatena Diary 2012-08-05 https://nishiohirokazu.hatenadiary.org/archive/2012/08/05]