Hatena2007-12-11
code:hatena
 <body>
 *1197332835*spam
 >>
 Here is today's☆report by nishiohirokazu.
 
 81 bar menu
 http://d.hatena.ne.jp/nishiohirokazu/20071209/1197177016
 Yoshiori ☆14 "spam" "spam" "spam" "spam" "spam" "spam" "spam" "spam" "spam" "spam" "spam" "spam" "spam" "spam" "spam" "spam" "spam" "spam
 <<
 It's so annoying!
 
 *1197339416*About amachang's awesomeness
 http://b.hatena.ne.jp/entry/http://d.hatena.ne.jp/amachang/20071210/1197277203
 >>
 I think it's time for id:kmachu amachang to admit that he is awesome. Then you should say, "You can be great like me!" and then say, "You can be as great as me!
 <<
 
 amachang is indeed amazing, but I think that once you think "I'm amazing", your life as an engineer is over. To be like amachang, it is essential to have an attitude of "keep learning what you think you lack (or think you lack)", and that attitude is lost when you think "I am great".
 
 *1197343599*iKnow
 >>
 Additionally, we have two brand new series of courses, TOEIC Basic Series [UK/AUS version] and TOEIC Advanced Series [UK/AUS version]. In these series, you'll find TOEIC-like sentences read by either British or Australian voices. These courses will help you practice listening to non-American pronunciation.
 <<
 
 Oh, can I also practice listening to English with a British accent and an Australian accent? Please help me with my Indian accent as well. I had a traumatic experience when a question at my first overseas presentation was in an Indian accent and I didn't understand it at all...
 
 *1197369155* Tried "one person multi-user".
 I'm talking about using a different user account when you are doing Task A and Task B in Windows. In my case, I am talking about using a different account while editing how to write org and while studying ActionScript.
 
 - I created a new account.
 -- My bookmarks are empty.
 -- URL history is clean.
 -- Expolorer settings (like displaying extensions) are also completely new.
 
 Hopefully we can create a branch of the account from what we have now or something (absurd).
 I wonder if it is possible to overwrite various settings written to the registry from one user to another.
 
 And when I switch between tasks, I can do it by switching users, but I accidentally logged off, orz.
 You can jump directly to the user switching screen with Win+L and should use that.
 
 It might be useful to have bookmarks and bookmarklets so that they can be easily synchronized when switching machines.
 
 *1197373247* Meeting to expose what I did.
 -Conference for those who want to talk. (with an addendum - IT War Diary)
 --http://d.hatena.ne.jp/amachang/20071211/1197350279
 
 Anyone from the unexplored youth community want to come and give a presentation? I heard that you can give a lightning talk for 5 minutes or so if your talk is short, or you can talk for 10-20 minutes. id:sakusan_net? (How about id:sakusan_net?)
 
 Also, especially young people! I think it's quite nice to interact with people outside of your "current community" through these activities! Don't be afraid to come!
 
 -----
 
 Even if the date and time of the first event is not convenient for you, or if the event was already closed when you noticed this article, you should make an appeal to participate in the event, as we will probably do this type of event again and again as the opportunity arises.
 
 -----
 
 I didn't think it would fill up so fast. I was going to leave it for two days," said amachang, but I thought he should be more aware of the magnitude of his influence. For the time being, Cybozu Lab can provide a venue for up to 30 people, but I think he was wondering whether he should rent somewhere else to increase the number of people or keep it at 30 for the first time after about 25 people had gathered. I would have played it safe and closed the event at 30 people.
 
 -----
 
 I also thought about the PEG study session that Cybozu Labs provided the venue for the last time, but I wonder if there is a system that can match information such as "when and how many people can we provide the venue" and "what day and where can we have the study session? I wonder if it would be good to have a system that can match information such as "when and how many people can we provide a venue?
 Also, I did my best to film the PEG study session from the middle, but I would like to distribute it better for those who are unable to attend these events due to inconvenience or remote locations. I also want to make it possible to watch it later. How can we do that?
 
 -----
 
 I heard that there are some companies that say, "If it's a holiday, it's not allowed due to information leakage, but if it's a weekday, it's OK. I wonder if it would be possible to share information about such venue providers in some way. For example, Cybozu Labs allows at least one employee to attend even on holidays as long as the maximum number of people is 30.
 
 -----
 
 I mean, I just realized that 30 people is not enough chairs. 30 people were indeed allowed at the Django study group!
 
 -----
 
 I just thought of something like "After the 2nd meeting, we will announce it on the blog of one of the presenters of the 1st meeting".
 
 -----
 
 I guess it's already closed. Well, there may be another call for applications if we can get a bigger space.
 
 -----
 
 The "1000 Speakers Project"!
 
 It may seem absurd at first glance, but if a presenter were to speak for 20 minutes (including switching & breaks), 10 people a day would be 4 hours. If we hold one meeting every two weeks for four years, we can accomplish this.
 
 When I saw amachang's presentation and thought, "Okay, I'll expose myself too," I didn't really have a chance to do so. Nowadays, I would know about such events, such as, "I can apply for LT at LL events," or "There is a Python Unconference," but only 5 years ago, I probably didn't even know such events existed, and by the time I realized it, it was after the event was over. I think I probably didn't even know such an event existed 5 years ago. And even if I had known about the event, I would have been intimidated by the idea of having to speak in front of an audience of 800 people for five minutes about what I wanted to say. I think the common desire of amachang and I is to give such people a chance to expose themselves.
 
 -----
 
 Now that amachang has expressed his intention to conduct the second and third sessions, it has become easier for us to do so. Let me write about how the second and third sessions should be conducted.
 
 For the time being, since the objective is to increase the number of "opportunities to expose oneself," it was proposed that the second and subsequent sessions should be either "no consecutive presentations" or "in principle, no one who has presented once is allowed to do so. If "those who have presented once are prohibited in principle," it would be a pity that they would not be able to take revenge in case of failure, and if "consecutive presentations are prohibited," there would be people who present every other time.
 
 I think it is better to hold many small events than to hold a large event with a large number of people. There are people who happen to have inconvenient schedules, so it is better to hold many events in order to give such people a chance.
 
 I also think we should maintain "free conferences". When I was a freshman in college, would I have paid to attend a conference where all the participants were strangers organized by people I didn't know? In order not to raise the bar and to avoid risk, we should stick to free of charge. (For the record, this is my personal opinion that I do not agree with amachang, and I was the one who stopped amachang when he started talking about renting a conference room.)
 
 There is another reason why we should stick to free conferences. Even if we increase the number of attendees by making the box bigger, we cannot increase the amount of presentations. Wasn't the purpose of the conference to begin with to create opportunities for presentations?
 
 I couldn't take my eyes off the development and stayed in the lab, but I didn't want to be on the last train, so I wrote the rest of the story on the train.
 
 -----
 
 Continued. Gather the know-how to organize these types of "small conferences".
 
 Having three registration methods (trackback, comment, and hatena bookmark) increases the administrative cost for the organizers. I think there should be only one way to sign up that clearly determines first-come-first-served basis.
 
 Should we make a wiki like java-ja?
 
 Personally, I think people who are not in the metropolitan area should be given a chance. There are some great geeks in Kansai and Shikoku, too. It is difficult to hold events here and there, so for now, I think we will repeat the Tokyo event, but I would like to do something about it in the future.
 
 Since the physical body is highly subject to location and time constraints, I'd like to work out a way to broadcast via Ustream and video with the accuracy that the presentation materials are visible. I've done the former before, so I have a general idea of the atmosphere, but I need to find out how much equipment is needed for the latter.
 
 I was talking with amachang about the need for people to have a blog. It is good to have an "opportunity to expose yourself," but it is difficult for a single presentation alone to lead to subsequent events.
 
 -----
 
 I left. I think one of the reasons why newcomers to conferences hesitate to attend is a sense of "insiderism. They feel that the participants are acquainted with each other, and they wonder if it is safe for them to attend a conference where they do not know anyone. In order to lower the threshold, I think it is important not to be opaque.
 
 When id:shinichitomita couldn't make it just in time, amachang said "I'll lose my slot and make a slot for shinichitomita's presentation instead", but I said that was not a good idea. That's all, there must be a certain number of people who say, "I'm attending because I want to hear amachang's presentation. And although shinichitomita is an acquaintance of ours, he may be a "stranger" to the attendees who signed up to hear amachang's presentation, but somehow amachang's presentation was changed to that of a stranger.... It would be uncertain, wouldn't it? That's what I thought, so I stopped. Please send your criticisms here.
 
 That's why I personally regret that id:sakusan_net couldn't make it, but I won't screw it up, so please do it in the 2nd or 3rd meeting. m(_ _)m
 
 -----
 
 I'm going to look back on my past a bit, even though I haven't written much about it.
 
 Attended a free conference in Osaka at age 19 (because it was free) → attended a reception (for which a fee was charged) → sat (unknowingly) next to an important professor and said "I can't drink alcohol because I'm underage" → dribble, dribble, dribble → before I knew what was going on, I joined an unexplored project I was made to participate in the Unexplored Project before I knew what was going on → I learned Python → I was told to start the Unexplored Youth Program → I got a super creator → I entered Nara Institute of Science and Technology → Masuda-san was in the lab next to me → I dribbled → I dribbled → I dribbled → I ended up talking at some LightweightLanguage Day&Night I was asked to speak at LightweightLanguage Day&Night→I was asked to speak at LL Ring→A panel discussion at LL Spirit
 
 If I hadn't first thought, "It's free and it sounds interesting, so let's go listen to it," I'd be an 8th grader in college in Kyoto right now, not using Python.
 If I had not been pushed by Masuda-san and Shibata-san to accept the LL presentation, I would still be thinking, "Community? It's none of my business. I wouldn't even be presenting at this kind of conference.
 
 It was a free conference that started it all, and the people I met there gave me the push I needed to move forward. So I should give someone else a push to return the favor.
 
 -----
 
 After all that I have written, I thought that what I and amachang should do is to solicit opinions widely on how to continue such a "genre-neutral conference of about 10 presenters".
 
 -----
 
 Postscript (or is this entry too long?)
 
 I wonder if Lingr+Wiki like java-ja is the way to go... Opinions may differ as to whether Lingr or IRC is better.
 </body>
 <comments>
 <comment>
 <username>sakusan_net</username>
 <body>I'm Mr. Sakurai, who was named<br>I'm going to talk if you let me talk! </body>
 <timestamp>1197382597</timestamp>
 </comment>
 <comment>
 <username>shinichitomita</username>
 <BODY>I'm sorry, it seems you were paying a lot of attention to me. I think I could have done the presentation before this one, so I don't mind at all from the point of view of the purpose of the event. If there are more slots available, I thought it would be better to have someone who has not had much opportunity to do so yet do so. </body> </P> </P> <P></P> <BLOCKQUOTE
 <timestamp>1197388240</timestamp>
 </comment>
 <comment>
 <username>everes</username>
 <body>I think it would be good if woopsdez's "Seminar Information Sharing Calendar" and yoichiro's "Komikyusuke" were more widely used. <BR><BR>As for the Django study group registration, I "personally dislike wikis", so I'm trying to make a system where it's first-come, first-served. <BR><BR>There are a lot of issues with the registration page, such as it not being mobile-friendly, but it is easy to manage. <BR><BR>Other than that, we all try to make sure that participants do not leave without talking to anyone. <br><br>We always want to lower the threshold for participation, and I think it is important to have people like Shibata-san who can dig people out, and I would like to have a mechanism to organize knowledge to make such gatherings more exciting.
 <timestamp>1197424541</timestamp>
 </comment>
 <comment>
 <username>Shimizukawa</username>.
 <body>>I wonder if it is possible to overwrite various settings written to the registry from one user to another. <BR><BR>Yes, you can to a certain extent. <BR><BR>My Computer Properties->Advanced Settings->User Profile Settings->Select an account and press the Copy to button->Select a directory for the profile. （<br><br>MyDocument and desktop will be duplicated, so you might want to save large files. </body><br
 <timestamp>1197430030</timestamp>
 </comment>
 <comment>
 <username>freedomcat</username>
 <body>How do you do? My name is shino, and I am a dandist at an event called "WikiBana". I would like to do something to gather the know-how of the organizers of events. I'd like to share information about the venue, and also the problems and confusion of those who have organized an event. <br>The rate of cancellations on the day of the event is close to zero, and the attendance rate is very good (for a group of 20 to 40 people). Do you think that being part of the co-editing team from the time of participation makes people more aware of their participation? I would like to hear from other communities who are using the wiki as a roster. As for the waiting list, it is true that the timing of the "we have a cancellation and are looking for more people" announcement may make the first-come, first-served basis a little less fair, but so far I have not received any complaints about it. I would recommend it. <br>Another good way to ensure continuity is to have two top administrators. I think this is an example of a group with two administrators that is doing well. </body
 <timestamp>1197457238</timestamp>
 </comment>
 <comment>
 <username>hyoshiok</username>
 <body>We are holding a kernel reading group, the next meeting will be the 82nd, and this year will be the 8th. <br>The next meeting will be the 82nd, and this year will mark 8 years since the last one, so our immediate goal is to hold 100 meetings in 10 years. <br>We have know-how in various other areas of management. </body><br><br>We have a lot of other expertise in running such events.
 <timestamp>1197560846</timestamp>
 </comment>
 </comments>

[Hatena Diary 2007-12-11 https://nishiohirokazu.hatenadiary.org/archive/2007/12/11]