Hatena2010-06-09
code:hatena
 <body>
 *1276084976*Python has been applied for trademark registration.
 <a href='http://slashdot.jp/yro/10/06/09/036224.shtml'>Perl trademarked without permission. 'OPENSOURCE', 'RUBY' and 'Apache' Also Filed - Slashdot Japan</a>.
 
 <a href='http://slashdot.jp/yro/comments.pl?sid=497793&cid=1777204'> Comments</a>
 >>
 商願2009-096623 Ｐｙｔｈｏｎ
 <<
 
 <a href='http://sourceforge.jp/magazine/journals/sado/534'>sado's Journal: How to Inform the Patent Office about Undesirable Trademark Applications for the Community - SourceForge.JP Magazine : A lot of open source topics</a>.
 >>
 During the examination period, the applicant can "provide the JPO with information indicating the reasons why the application for registration of that trademark should be refused. If the information is properly compiled, it would be considerably better than taking no action, since it would help the examiner to examine the application. Moreover, since this procedure is free of charge, can be done by anyone, and can be done anonymously, it should be done proactively for undesirable trademark applications.
 <<
 
 <a href='http://www.psn.ne.jp/~bds/kentokyu/tokyocho/kensaku.htm'>Patent Office, Trademark Search Service</a>
 
 >>
 (210)	【出願番号】	商願２００９－９６６２３
 (220)	【出願日】	平成２１年（２００９）１２月９日
         【商標（検索用）】	Ｐｙｔｈｏｎ
 (561) [Name] Python, Python
 (731)	【出願人】	
 　　　Name or Designation] Terra International, Inc.
 　　　	【類似群】	11C01
 　　　	【国際分類版表示】	第９版
 (500)	【区分数】	１
 (511)	(512)	【商品及び役務の区分並びに指定商品又は指定役務】
 	9 Computer software for tracking and recording changes and modifications to software, computer software for managing and operating software development projects, other computer software, computers, other electronic applied machinery and appliances, and parts thereof
 <<
 
 <a href='http://ja.wikipedia.org/wiki/Python'>Python - Wikipedia</a>
 >>
 Python 1.0 was released in January 1994.
 
 2001 - The Python Software Foundation (PSF), a non-profit organization dedicated to the ownership of intellectual property related to Python, is established.
 
  Companies and Institutions that Use Python Python is used by many companies, mainly in Europe and the United States. Among large companies, packaged software companies such as Microsoft and Apple use Python, as do companies such as Google, Yahoo! In addition, cell phone manufacturer Nokia runs Python applications on its S60 series [3]. In research institutions, Python is used by NASA [2] and Japan's High Energy Accelerator Research Organization [4].
 <<
 
 <a href='http://www.python.org/psf/'>Python Software Foundation</a>
 
 <a href='http://www.pycon.org/'>PyCon - Connecting the Python Community</a>
 I was wondering if there was any information on how many years the first PyCon was held and how many people attended, but I couldn't find it.
 
 <a href='http://www.python.org/workshops/1994-11/attendees.html'>Attendees -- Python Workshop</a>
 1994年のPython Workshopの参加者名簿
 
 
 A search for Python in Computer Japanese Books on Amazon.co.jp yields 282 hits. Is this what you mean by "reasons we should reject?"
 </body>

[Hatena Diary 2010-06-09 https://nishiohirokazu.hatenadiary.org/archive/2010/06/09]