Hatena2009-05-24
code:hatena
 <body>
 *1243129164*馬喰横山
 I am waiting for the train bound for Hashimoto at Bakuro-Yokoyama. Yesterday, I made a mistake by taking the train bound for Sasazuka. I can work on the Hashimoto-bound train because it goes directly to Tama Center in 50 minutes.
 
 *1243172753*I'm back.
 While we were underground, a torrential downpour had started and the station was full of refugees.
 
 *1243174419*Make: Tokyo Meeting 03で展示した日記
 I had planned to participate as a spectator, but I was asked by quite a few people, "Aren't you exhibiting anything? I thought it would be more fun to exhibit something, so I came home on Saturday and tried to come up with something I could make by Sunday.
 
 However, there are very limited things a hardware-impaired person without even a printer at home can do in the middle of the night, so I could only use A3 printouts from a convenience store and pull out things I had made in the past. Even if I wanted to pull out the past, there is not much left because I dismantled the binary counter made of Lego bricks and took apart the three dimensional magnet. Formative things are expensive to store.
 
 f:id:nishiohirokazu:20090524231359j:image
 
 The above is a business card with a URL, e-mail address, name, and one riddle in the empty space. It was surprisingly well received, so I guess this is the personal business card that I have been saying I had to make for a while but haven't yet. But I should put my face on it too. I should put it on the back of the card, or I should just say that it's okay since you can see it when you access the URL.
 
 The mysterious pattern spreading below it is the A3 recursive pattern I made this time. I had been thinking of making a photo acrylic, so I couldn't make such a large recursion (due to the limitation of the human eye), but A3 is quite large, so I could do it with this much recursion. Programmatically, I have another recursion that is one step deeper, but Net Print would not accept it because it is about 6 megabytes, even though it is a PDF with no images.
 
 Also, if I ever print again, I'd better make it out of non-wrinkling material, not paper...A3 printing was 20 yen, but when I brought it back, it was in such a state that there was no way I could reuse it anymore. Also, if I say, "Please take a look at the paper cutout," people will misunderstand that it's something they can take home with them. Well, it's okay, since it's only 20 yen at most.
 
 f:id:nishiohirokazu:20090524231527j:image
 
 This is a photo acrylic exhibit and three riddle hangings. The story of why <a href='http://d.hatena.ne.jp/nishiohirokazu/20090417/1239948727'>seven divisions</a> are "seven divisions" and why "seven"? Well, in a nutshell, it depicts the minimum shape that requires seven colors of "seven colors are enough to paint the torus".
 
 I explained it lightly verbally to id:inajob when he asked me about the "but there are still degrees of freedom in placement" question, but the details are all in the blueprint from the link above. 0 is the unit length and 1 is its 1.618 (golden ratio) times the unit length. The other numbers are also powers of the golden ratio. 0 + 1 = 2 is the most basic property of the golden ratio.
 
 f:id:nishiohirokazu:20090524231629j:image
 
 This is a three-dimensional object, because I thought it would be a bad idea to only use printed materials. I talked about making dragonfly balls at JJUG before, and I brought some of my own dragonfly balls with me but did not have a chance to show them, which have a recursive structure. This one is "a sphere wrapped with a triangle of white clay wrapped with a triangle of blue clay wrapped with a triangle of white clay wrapped with a triangle of blue clay" or something like that. Well, it was small and difficult to display.
 
 <hr>
 Oh yes, the solution to this one I mentioned yesterday.
 <img src="http://gyazo.com/9010c43aec268d32a13dde255e0012e1.png">
 id:nyaxt got it right in less than a minute, saying "The only possible structure with a clock is JK-FF. id:kyoro353 got to "which flip-flop" in about the same time, but I got ahead of him and said "Correct! I was so surprised that he could not find the answer on the back side of the puzzle, so if I had not interfered, he would have had a good match with nyaxt.
 
 The reverse side looks like this.
 <img src="http://gyazo.com/5ce35e92b1ab804bcad7fa50016365af.png">
 
 <hr>
 
 The card game Spaghetti Monsters was a real close call when I played a simple Lv1 against someone with good programming skills, although I barely won with three of my opponent's bits stacked on the RemoveBit. It was really a paper-thin game. I wonder if I can reproduce the game record.
 
 *1243178747*[SpaMon]今日のLv1戦の再現
 Bomb(A)(B) Crack(A)(B) AddBit(B)(A) RemoveBit(B)(A) MoveBit(A)(B)
 Maybe the initial state was like this: 6:6 with Bomb triggered by both sides, 4:4 with Crack triggered by both sides.
 Bomb Crack(A)(B) AddBit>(B)(A) RemoveBit(B)(A) MoveBit(A)(B)
 Where did I put B on AddBit? I think I put it on Bomb. On the other hand, A put it on RemoveBit.
 Bomb(B) Crack(A)(B) AddBit(B)(A)> RemoveBit(B)(A)(A) MoveBit(A)(B)
 Why, because after B erased the Bit in RemoveBit, there is no doubt that he erased Bomb with A, which cannot be disabled.
 Bomb Crack(A)(B) AddBit(B)(A) RemoveBit(B)(A)> MoveBit(A)(B)
 So I move (B) on MoveBit, and I've been mercilessly moving B on MoveBit to MoveBit to disable it when dealing with PCs, but that seemed unfair in a situation where I hadn't explained that it was valid, so I wondered where I should move it. I guess I did. I thought I could withstand it in this situation as long as I didn't take extra damage because Crack was triggered faster by me.
 
 But now that I think about it, it would have been better to move AddBit's own color bit to Bomb; B loses if it doesn't move that bit somewhere with MoveBit; it loses if it piles it on Crack; it loses if it piles it on Crack; it loses if it piles it on Crack; it loses if it moves it on Crack.
 
 Now, I moved it to AddBit, so this is what happens.
 Bomb Crack>(A)(B) AddBit(B)(A)(B) RemoveBit(B)(A) MoveBit(A)
 Both players activate Crack, 2:2, and the failure to move to AddBit sparks a fire here. Everyone moves AddBit to RemoveBit.
 Bomb Crack(A)(B) AddBit(B)(A)(B)> RemoveBit(B)(A)(B)(A)(B) MoveBit(A)
 The B bit of RemoveBit erases the A bit.
 Bomb Crack(A)(B) AddBit(B)(A)(B) RemoveBit(B)(B)>(B) MoveBit(A)
 And the last RemoveBit erases (A) in Crack. This is bad. We lose.
 Bomb Crack(B) AddBit(B)(A)(B) RemoveBit(B)(B)(B) MoveBit>(A)
 So, after much agonizing here, I finally invoked "Move AddBit's own color bit to Bomb" which I should have hit earlier.
 Bomb(A) Crack(B) AddBit(B)(B) RemoveBit(B)(B)(B) MoveBit>(A)
 The game was close at one point, but the team barely won.
 
 <hr>
 
 Surprisingly, you can finish the flow later. Most of the moves are inevitable. Also, I thought it was hard to play at Lv1, because there is a card called RemoveBit, which has an advantage for the first move, and the number of bits is 5. I don't know if it will become more difficult as the level goes up and cards with backgammon like Reverse and MoveCard are introduced, but at lvl 1, the first hand definitely has the advantage. Maybe it should be positioned as a handicap game in teaching the rules to those starting out, and then put it in the manual so that as soon as they grasp the rules, they can move on to Lv2.
 </body>
 <comments>
 <comment>
 <username>sgk</username>
 <body>Oh, there you are. You were there? I was selling stuff in the gym. </body>
 <timestamp>1243219986</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-05-24 https://nishiohirokazu.hatenadiary.org/archive/2009/05/24]