Hatena2009-09-15
code:hatena
 <body>
 **1252987111*A discussion of why task management doesn't work.
 Reprinted from a Twitter blurb:.
 
 A discussion of why my task management doesn't work: In addition to the MUST TO DOs, there are many WANT TO DOs that I come up with that I don't have to do, and the rate at which I come up with WANT TO DOs is faster than the rate at which I do them, so my TODO LIST is inevitably overflowing.
 
 If your task list is only MUST TO DO, you will inevitably say "I can't do this because I'm doing something right now" and refuse to do it, or you will finish it as a rush job and not accumulate tasks beyond a certain point. If I accumulate that many MUST TO DOs, I will die. I, on the other hand, have 700 lines of work that are currently being tracked.
 
 >>
  @kazmaro My conclusion today is "WANT TO DO should not be written where you can usually see it. Just looking at a long list of things will discourage you from doing them.
 <<
 
 Maybe it's better to keep the TODOs that are visible empty all the time or something... I felt better when I boldly threw away the old tasks that had accumulated in RTM.
 
 >>
 @ssig33 WANT TO DO and I think it's good to forget everything that can't be done on the spot, if you can remember it later, that's fine, if you can't remember it, you didn't have a connection...
 <<
 
 No, but some of them are "new ideas" and can be useful later.
 
 Ha, this task list that I keep saying it might be useful someday, is the same as the large amount of stuff in this room that I keep saying I might use someday? As for the stuff in the room, I'm beginning to think it's the same as not being able to get it out of the room quickly when I need it.
 
 *1252997189* Rename and set icon for iPhone app
 I wonder how to fix the project name as it appears, and also the icons are tacky as they are white.
 
 <a href='http://cheebow.info/chemt/archives/2008/11/iphone_dev_trouble.html'>Hibinoawa: Where I got stuck in iPhone app development</a>.
 I made a 512x512 jpeg first, made it small with Preview, captured it with Cmd+Shift+4, and made a perfect 57x57 icon with Paintbrush. When I say icon, I always think *.ico, but it seems to be Icon.png.
 
 All you have to do is refer to this: <a href='http://gihyo.jp/dev/serial/01/iphone/0010?page=2'>Go for it! iPhone App Development Expert: Vol. 10 Publish Your App on the App Store｜gihyo.jp ... Gijutsu hyoronsha</a>.
 
 It's done, it's done, it's done.
 <img src="http://gyazo.com/3e7fb988c3fa01ce537348502a83bc29.png">
 
 Paintbrush proved to be somewhat useless.
 
 *1253038020* iPhone gdb screen is very useful
 <img src="http://gyazo.com/cd3238feb8d31da21e692a5191b19bfc.png">
 
 I didn't notice the small __TERMINATED_... I didn't notice that it says "__TERMINATED_..." and was trying to figure out how to proceed with the program. If I press the button next to this message that says gdb, I get to the gdb screen, right?
 
 >>
 2009-09-16 03:01:56.016 Camera[16257:20b] *** Terminating app due to uncaught exception 'NSInvalidArgumentException', reason: '*** -[CameraViewController finish_convert:]: unrecognized selector sent to instance 0xd192a0'
 <<
 
 And the error message is easy to understand.
 
 After all, when calling the -(void)finish_convert method, it should be @selector(finish_convert), and when calling the -(void)convert:(NSDictionary*)info method, it should be @selector(convert:). I forgot the colon or added an extra colon.
 
 *1253040174*[ObjC]error: can not use an object as parameter to a method
 I simply forgot the asterisk.
 >||
 Incorrect: -(void)update_progress_bar:(NSNumber)ratio
 Positive: -(void)update_progress_bar:(NSNumber*)ratio
 ||<
 
 **1253040844*Multi-threading on iPhone
 - Using NSThread
 - Be careful not to forget or add too many colons in selector
 - The autrelease pool must be created for each thread, so don't skimp.
 - Use performSelectorOnMainThread for processing that should be done in the main thread.
 
 References
 <a href='http://blog.andrewpaulsimmons.com/2008/08/simple-iphone-image-loader-class-uses.html'>Andrew Paul Simmons: Blog: Simple iPhone Read and understand the explanation of the image loader class uses NSThread and NSData dataWithContentsOfURL.</a
 Use the <a href='http://kdl.nobugware.com/post/2008/12/22/nsthread-iphone-template/'>NSThread iPhone Template</a> template
 
 **1253041527*[ObjC]How to erase UIAlertView
 When I [alert removeFromSuperview], it became inoperable. The correct answer is [alert dismissWithClickedButtonIndex:0 animated:FALSE].
 
 *1253041882*Mu
 I had the same problem on the actual machine, and I tried the same operation twice, so I don't think it has anything to do with using threads.
 
 When the original image is 300x400, only the R of RGB seems to be converted, and when it is 900x1200, it is a sandstorm.
 I used to export the image to context, but when I added support for zooming and moving, I decided to read directly from the large image, which must not be a good idea. However, when I added support for zooming and movement, it must not be a good idea to read directly from the large image.
 </body>
 <comments>
 <comment>
 <username>shou</username>
 <BODY>If you write down the points that are not quite usable, maybe someone will come along who will make good ones</BODY>.
 <timestamp>1253003627</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-09-15 https://nishiohirokazu.hatenadiary.org/archive/2009/09/15]