Hatena2015-11-25
code:hatena
 <body>
 *1448435121* I've studied the psychology of motivation.
 >>
 How to get motivated, I signed up for an event at the National Institute of Informatics, which is supposed to be an introduction based on scientific evidence! https://eventon.jp/2052/
 <<
 
 I attended yesterday. It was quite interesting.
 
 Personally, what stuck out to me the most was the talk about "teaching others" as a factor that increases intrinsic motivation. Looking back on my actions over the past 10 years, I have been able to maintain a very high level of motivation by "teaching others," and I was convinced that this was what it was all about. I will read the original paper later when the lecture material is shared.
 
 As the Q&A session got underway, such social rewards are called "intrinsic motivation," though I have a sense of what the definition of "intrinsic" is already. When teaching becomes a reward, learning becomes "an activity where you encounter material that is not a sure thing but that you occasionally want to teach others," and this is truly intermittent reinforcement. It's the strongest conditioning.
 
 Conditional planning is a technique that can be used right away, even today. The task-shooting explained in the first half of the book is also a form of planning with conditions, such as "I will do something at this time of the day".
 
 This is the first time I have heard of the Zygalnick effect, which is that unfinished tasks come to mind again and again, but they don't come to mind once a plan is made. I guess that's why we don't have to think about it once we have a detailed plan, such as a task chute.
 
 I often write out tasks in GTD or similar methods, but sometimes I write something like "I will do 1 Pomodoro writing method for the manuscript of ~" and then leave it alone. In the past, I used to write "work on a manuscript" and the common phenomenon occurred that the task was too large and I was reluctant to start it. As a remedy for this, I decided to write the task as "First, do the 1Pomodoro method". This has a high success rate when I am instructed to do it by my motivation system (http://nhiro.org/yaruki/), but when I write it down on my TODO list, it is not executed very often. I never understood why the difference between the two until now, but I guess the former means "do one pomodoro now" and the latter means "do one pomodoro someday". So I guess I should write something like, "I'll do the writing out method on the train when I arrive at work tomorrow.
 
 I had never heard of taskshooting, but it was interesting to hear about it from someone who has practiced it. I heard that there are 140 items on the daily list, so I asked him how to make a list of 140 items. I asked him how to make a list of 140 items for a day, and he said the first step is to log them. I asked him how to make a list of 140 items for each day. He told me that the first step is to keep a log, so that you will know how long each task will take.
 
 This is the same concept as the Pomodoro Technique I practice. The more you know about the subject you are measuring and managing, the better you can plan. The main difference between Pomodoro and taskshooting is granularity. Pomodoro is measured in 25-minute increments, while taskshoot is measured in minutes. Recording in minutes may seem like a lot of work, but I think it would be a good idea to measure tasks (like brushing teeth or taking a bath) that I have been skipping because they don't fit into Pomodoro's units. I'm surprised that I don't know how much time I spend on brushing my teeth.
 
 Of the 140 listings per day, they say that if you keep a proper log of the logs, only about 20 to 30 will change, and it takes about 7 minutes to plan for that.
 
 I doubt that I will use taskshooting itself in the future, but it is interesting as an implementation pattern for conditional planning. For now, I'll just use "<a rel="nofollow" href="http://www.amazon.co.jp/gp/product/4774163562/ref=as_li_ss_tl?ie=UTF8&camp=247&creative=7399& creativeASIN=4774163562&linkCode=as2&tag=nishiohirokaz-22">Why can't work get done on time? ~The special remedy for the "no time disease"! I'm going to read "Task Shoot Time Techniques</a>".
 </body>

[Hatena Diary 2015-11-25 https://nishiohirokazu.hatenadiary.org/archive/2015/11/25]