Hatena2009-04-04
code:hatena
 <body>
 *1238830586* "Exponential" or "Exponential"?
 >>
 id:userjapan As was discussed in Masuda a while ago, the expression "exponentially growing" is still a bit tricky. I think "exponentially" is a good way to describe it, though.
 <<
 I remembered that there was an opinion that the word "exponential" is not a recent phenomenon. I thought, "This is not the first time that the word "exponential" has been translated as "exponential", and there are many textbooks and papers that use such a term," so I checked.
 
 For now, let's look at the <a href="http://www.amazon.co.jp/gp/product/489471163X?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=489471163X">Structure and Interpretation of Computer Programs</a> to look at the index.
 >>
 Exponential increase, 24
 <<
 
 Mm. Just as I remember it.
 
 In addition, I will also search for the extent to which it is used in papers.
 - 473 items: <a href='http://ci.nii.ac.jp/search?q=%22%E6%8C%87%E6%95%B0%E9%96%A2%E6%95%B0%E7%9A%84%22&range=0&count=20&sortorder=1'>CiNii Search - "exponential"</a>.
 - 214 items: <a href='http://ci.nii.ac.jp/search?q=%22%E6%8C%87%E6%95%B0%E7%9A%84%22&range=0&count=20&sortorder=1'>CiNii Search - "exponential"</a>
 
 I don't know what kind of argument was being made in the key Masuda (Hatena Anonymous Diary), but if he was arguing that "the use of 'exponential increase' is wrong," I thought he was being too narrow-minded.
 
 *1238842439*Household
 I used whole tomatoes for the first time.
 f:id:nishiohirokazu:20090404195358j:image
 Whole tomatoes are canned tomato juice pulp.
 
 
 f:id:nishiohirokazu:20090404200913j:image
 
 *1238852429*News Today
 >>
 >A story of a kind old woman who keeps giving bread to a young brother and sister who have lost their parents, but when the brother starts asking for more bread, he blames her and finally beats her to death.
 
 > High school// new first-year students// were required to write a book report on a fictional story about a boy who beats an old woman to death for spring break homework, with some parents protesting that the content was too shocking for their children.
 <<
 <a href='http://www.yomiuri.co.jp/national/news/20090404-OYT1T00784.htm?from =main4'>An old woman was beaten to death, and new students were asked to write their impressions of the story for homework...Toyokawa Private High School, Aichi, Japan : Society : YOMIURI ONLINE (Yomiuri Shimbun) YOMIURI ONLINE(The Yomiuri Shimbun)</a>
 
 Reference:.
 >>
 The number of juvenile arrests for homicide (including those for juvenile delinquents) was 73. The number of juvenile arrests for robbery (including those for juvenile delinquents) was 1,172. The number of juvenile arrests for murder and robbery (including those for arrests of juveniles under the law) was 1,172 and 1,172, respectively.
 　In 2005, the number of juveniles who were arrested for general criminal offenses was 20,519 (an increase of 1.6% over the previous year). The number of juveniles arrested for murder and robbery was 6 and 26, respectively.
 <<
 <a href='http://www.moj.go.jp/HOUSO/2006/hk1_4.html#4-1'>Overview of the 2006 White Paper on Crime <Part 4>Trends in Juvenile Delinquency and Treatment of Juvenile Delinquents</a>.
 
 
 >>
 >The site was called "Furusato Tax Payment ONLINE SHOP" and stated that it was directly operated by the non-existent "General Affairs Agency" and that "Furusato Tax Payment is now available online. If you click on a part of the screen, the words "It was an April Fools' Day project. Sorry" appears.
 
 >The Prefectural Police Cybercrime Support Office was notified of a website that pretended to allow taxpayers to pay hometown taxes via the Internet.
 
 >The site has no function to cheat people out of their donations, and it is believed to be for mischievous purposes, but the prefecture plans to call on each prefecture to take precautions and ask the site administrator to delete the site.
 <<
 <a href='http://www.yomiuri.co.jp/national/news/20090404-OYT1T00752.htm?from =main3'>"Furusato Tax Payment System" Easy...Check it out, lousy fake site : Society :. YOMIURI ONLINE</a>.
 
 
 I thought it was an elementary school book report, but it's high school. I can't believe that a high school student would be offended just for reading a story in which a person is killed. I can't believe that a high school student would be reported to the prefectural police cybercrime support office just for creating a joke website that clearly states that it is April Fool's Day and has no function to cheat people out of their money.
 
 
 If they are raised in a sterile room where even weak poisons are thoroughly eliminated, when they are exposed to a toxin that cannot be eliminated, they are likely to become immune and die.
 </body>
 <comments>
 <comment>
 <username>queue</username>
 <body>That's true. <br>I could understand saying "it's not OK, it's not OK" in elementary and junior high school, but recently I've been more afraid of this kind of adult complacency. </body><br><br>I am afraid of this kind of self-satisfaction of adults these days.
 <timestamp>1238935718</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-04-04 https://nishiohirokazu.hatenadiary.org/archive/2009/04/04]