Hatena2009-02-27
code:hatena
 <body>
 *1235687453*ZumoDrive Sequel
 >||
 $ cd /Volumes/ZumoDrive/
 $ ls
 ls: .: Device not configured
 ||<
 
 Something like /Volume/ZumoDrive1/ has been created. I was surprised when I edited a file in Emacs and tried to overwrite and save it, thinking that the file had disappeared, but I guess the path has just changed.
 I guess I would have preferred Dropbox. I don't use either of them that much.
 
 *1235688406* Moving day!
 8 hours to go!
 
 
 The 31,500 yen for the moving fee was placed in an envelope on a shelf, but it is very likely that the entire fee will be packed in a cardboard box, or moved as it is.
 
 
 If I do laundry, there will be problems with what to do with the wet stuff (I mean, the hangers are in boxes), so I won't do laundry until after the move.
 
 
 Obviously, there are signs that it will not be finished. The top priority is to be able to transport the washing machine, refrigerator, desk, and per
 f:id:nishiohirokazu:20090227080552j:image
 It is necessary to make it possible to pass through the deaf area with luggage.
 f:id:nishiohirokazu:20090227080653j:image
 
 
 f:id:nishiohirokazu:20090227090901j:image
 From the opposite perspective
 f:id:nishiohirokazu:20090227094613j:image
 "It's all over the place. We've got six hours to go..."
 
 
 When I replaced the water-saving shower head, I mistakenly put the original head on without removing the adjuster, and it would neither attach nor detach. I wrapped it with three layers of duct tape to improve the grip and twisted it with a pair of radio pliers, and it worked.
 
 
 I just checked the weather forecast and it turns out to be a very cold 4 degrees Celsius and it won't stop raining. Hmmm...hard to carry by bike, huh?
 
 
 >||
 Uncluttered, Department
 
 　　　　　　ordinal
 　　　　　　three (used in legal documents)
 tale
 ||<
 
 
 Wow, it's snowing!
 
 
 I got three cardboard boxes at the supermarket. This made it a little easier.
 
 
 The desk was dismantled.
 
 
 Seven hours to go.
 f:id:nishiohirokazu:20090227105605j:image
 
 
 Oh my God. Two large cardboard boxes of books came out of the back of the closet.
 f:id:nishiohirokazu:20090227110403j:image
 The three cardboard boxes I went to the trouble of taking were instantly gone. I have to go look for them again.
 
 
 Couldn't find the cardboard. Ummm.
 <img src="http://gyazo.com/9bc5151cc92cab9b62f2e2e22f53116a.png">
 I see. Take out the stuffed book again and string it up.
 
 I'll tie you up. I'll tie you up.
 f:id:nishiohirokazu:20090227132520j:image
 
 
 There was one cardboard box left that the movers gave me!
 
 
 The option of putting the dishes in a basket and carrying them by bicycle tomorrow because of the high time cost of packing them in a box so they don't break.
 
 
 Disassembly, disassembly
 f:id:nishiohirokazu:20090227124153j:image
 
 
 
 electromagnetic cooktop
 f:id:nishiohirokazu:20090227140027j:image
 The moral of this shelf is, "Putting a shelf in front of an electrical outlet makes it very awkward to use."
 f:id:nishiohirokazu:20090227142921j:image
 
 
 Dismantling is complete.
 f:id:nishiohirokazu:20090227143522j:image
 
 
 I found a balsan in a shoebox. I bought it, but it was a hassle to put it away... I already have some stuff in my new house...
 No, it's not too late. There's very little stuff in the kitchen and bathroom, so I guess I can just have my stuff brought into the living room when I bring it in and balsan it today.
 
 
 I just realized that "box as much as possible" doesn't have a quantitatively clear goal. I guess that's why I got discouraged in the middle of the process. Once I decided not to put dishes and bathroom stuff in boxes, it was relatively easy. I did have a problem when an unplanned book appeared in the middle of the process, though.
 
 
 Phew. I could do the dishes, but I'm too tired. I can't wait for the movers to come. I can't start anything when I'm in a state of waiting.
 
 
 Now in the process of moving.
 - Make sure that assembled furniture can be taken out of the room in its assembled state.
 - It's easier to do this if they're all in the same shaped box, so all the books and appliances that are tied together with string are put in a box and go.
 -- Appliances were wrapped in plastic wrap.
 - Keep the washing machine off the water.
 - Plastic cases, including Muji, are fragile.
 
 At the new house
 f:id:nishiohirokazu:20090227181619j:image
 - I hadn't thought about where to put the refrigerator.
 -- but since there is practically only one corner to choose from, the only thing left is which way to put it.
 - The old house had a closet taller than I am, but the new house does not.
 -- I thought I didn't have to think about storage because I have a closet that is about twice the size of a closet divided by half the height of my height, but what about the clothes I have hanging on hangers now? I didn't think about it.
 - It's too bad that I don't know which box I put the drawings I measured and cut out of graph paper in.
 - Cold because you don't know which box the curtains are in.
 
 18:46 I'm done moving.
 
 
 The camera on the cell phone has a narrow angle of view, so it cannot convey the oppressive feeling of a room full of boxes.
 f:id:nishiohirokazu:20090227183701j:image
 The worst was avoided by putting up curtains and setting cushions on the bed and sleeping in the closet.
 
 
 I'm not going to relax. This is no time to relax. There is still another time limit, the handover of the key. There are 21 hours left until the time limit.
 Let's organize the information.
 - new home
 -- There are a lot of things. However, I'm not sure where it is.
 -- No light bulbs in the bathroom
 -- prepared to light up the fire with a balusan (earth red).
 - former residence
 -- Dishes are left behind (to be transported tomorrow)
 -- Cage 1: filled with laptops, etc. Cage 2: empty
 -- Still has hot water. There is also heating. However, there are no curtains. It is cold.
 -- The light in the middle room has not been removed. I am not tall enough to reach it with the tools that are in the room now.
 --- The most reasonable solution is to empty the container case and take some of the contents with you to use as scaffolding.
 --- Why don't you just put the dishes back in that container case?
 -- I have a vacuum cleaner and a mop.
 - me
 -- I am cold because I was in a room with a boarded up door for a total of 3 hours when it was snowing outside. I need to take a bath.
 -- It's cold today and I don't want to make several trips back and forth with my luggage.
 
 Okay, how about this scenario.
 - Place change of clothes and towel in empty container case
 - set fire to a new house with earth red
 - I go to Coco Ichi and eat curry. I'll probably get sleepy, so I'll dust it off. Take a book with you.
 - Go to the old house. Remove the lights. Run hot water, wash dishes and pack containers.
 - Take a bath.
 - Come back to the new house with one container. (Make sure it has been at least 1-2 hours since departure)
 - Set alarm and go to bed (where's the alarm?)
 - Wake up.
 - Transport lighting and remaining dishes.
 
 
 <hr>
 - What I have to do today
 -- ■ Empty the refrigerator
 -- ■ Empty the washing machine
 -- ■ Make sure the desk is ready to carry
 -- ■ Boxed whenever possible
 -- Moving 2009-02-27 16:00-18:00
 -- □ Balsan
 -- □ Put out burnable trash
 -- □ Transporting items that do not fit in the box by bicycle
 - Things you can't go without on the 28th.
 -- Attend electric and gas outages in the morning
 -- □ Tableware transport
 -- Keep your PC in your bag so you don't have to waste time waiting
 -- 4:00 p.m., hand over the key (maybe wait in the new house because it's cold waiting in the old room with the curtains gone).
 -- Uenotan Birthday Party
 
 - Gas, electricity, and water service are available.
 -- □ Gas
 --- □ [2009-02-28 9:00]@ close witnessed by Gus 9-12
 --■ Water supply
 --□ Electricity
 --- □ [2009-02-28]@ electricity service stopped Coming to check meter in the morning of 28th.
 --- □ Turn off the stability breaker
 
 - □ Change of address of license
 - □ The notebook is full of old addresses and other information, so I will print it out and replace it in the near future.
 - Checklist so you don't forget to move
 -- ■ Replace the water-saving shower head with the original shower head.
 -- ■ Remove the curtains
 -- ■ Toilet paper
 -- □ Lighting
 
 *1235718430*Re: prescription for those who suffer from google app engine's handling of unicode
 <a href='http://blog.story-fact.com/?eid=970842'>hikali's Development Journal | [Python Game Training] Prescription for those who have struggled with google app engine's handling of Unicode</a>.
 
 for now
 >|python|
 Python 2.5.2 (r252:60911, Nov 29 2008, 16:55:50) 
 [GCC 4.0.1 (Apple Inc. build 5465)] on darwin
 Type "help", "copyright", "credits" or "license" for more information.
 >>> print "a" + "y"
 dyer's knotweed (Persicaria tinctoria, used to produce indigo dye)
 ||<
 therefore
 >>
 Inside Python, multibyte strings can only be processed in Unicode.
 
 　This, too, is quite a trap if you don't know about it (because you assume you can do it naturally). For example, you can't use "+" to concatenate strings.
 <<
 This is a factual error.
 
 
 and then
 >|python|
 >>> print u "a" + "a" # (1)
 ah
 >>> print u "a" + None # (2)
 Traceback (most recent call last):
   File "<stdin>", line 1, in <module>
 TypeError: coercing to Unicode: need string or buffer, NoneType found
 >>> print u "a" + 1 # (3)
 Traceback (most recent call last):
   File "<stdin>", line 1, in <module>
 TypeError: coercing to Unicode: need string or buffer, int found
 ||<
 
 As in (1), when combining a non-Unicode string with a Unicode string, the non-Unicode side is converted to a Unicode string. So, for example, if something that is not a string or buffer comes in, an error message will appear saying "I tried to convert it to Unicode, but it's not a string, this is not a string. In case (2), the error message says "NoneType came in instead of a string", and in case (3), "Integer came in instead of a string".
 
 
 Since the interactive shell makes it easy to try things out, I thought it would be helpful to break things down into smaller units and check the behavior when something unfamiliar occurs, so that I can better understand.
 
 <hr>
 PS: I was talking with id:voluntas about how I wish the transition to Python3000 would be faster, and I guess I should write about that here too. The code in (1) above converts a byte string to a unicode string using the default encoding before concatenating it, but many people are unaware of what the default encoding is, or whether the conversion is triggered by the + when writing foo + bar in code. This is a breeding ground for bugs. So, since Python3000, (1) has also been changed to become a TypeError. You should get into the habit of explicitly converting and then merging.
 </body>
 <comments>
 <comment>
 <username>For single person moving</username>.
 <body>I was searching the internet and found a very inexpensive and good single person moving company. <body>I was looking online and found a very cheap and good single person moving company called MovingNavi.com (http://www.754navi.com/). They are cheap, but they also provide free cardboard boxes and insurance, and you can ride along with them. </body>
 <timestamp>1236010169</timestamp>
 </comment>
 <comment>
 <username>paison</username>
 <body>I know this is a new comment, but I think it is limited to the google app engine. <br>The problem is that you say "python's", but I think you are talking about an error when concatenating unicode type and str type in "google app engine's python". </body>
 <timestamp>1297258873</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>↑Is it a joke or something to write wrong things in a conversation about the problem of people saying wrong things without checking them carefully? <BR><BR>In Python 2.x, when you concatenate a unicode type and a str type, the str type is converted to unicode using the default encoding before concatenation. If the default encoding is ascii and bytes not in the ascii range are included, a conversion error occurs. That's all. </body>
 <timestamp>1297297226</timestamp>
 </comment>
 <comment>
 <username>SATO</username>.
 <body>I did something like <br>def __unicode__(self):<br> return self.[ForeignField property]<br> in Django and got <br>Caught TypeError while rendering:. coercing to Unicode: need string or buffer, *** found<br> is now resolved. Thank you very much. </body>
 <timestamp>1297837445</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-02-27 https://nishiohirokazu.hatenadiary.org/archive/2009/02/27]