Hatena2007-11-09
code:hatena
 <body>
 *1194585026*ACM/ICPC Asia Regional Contest 2007, Tokyo, Japan
 http://www.logos.ic.i.u-tokyo.ac.jp/icpc2007/
 
 I guess the problem for A in the Asian qualifier is stepchildren. I've saved the PDF of the problem on my laptop, so I'll solve it on the train on my way home.
 
 *1194613318* Summary of the Day
 I was supposed to leave quickly because I was not feeling well, but the conversation got carried away.
 I was not feeling well, but after the progress report meeting was over, I drank ginger tea and started feeling better, or rather, my fever rose (oh).
 No doubt about it, I'm feeling pretty hot w right now.
 
 Proxies: any program can now be added as a filter. wc can be added as a filter and all pages will be w to the number.
 I had a subject posted on how to write org, so I added another subject to the queue to speed up the timing of the submission. If the subject has not been submitted by tomorrow, it is an error in the part I tinkered with today.
 Probably cured the problem of not being able to log in via SSH when the load exceeds a certain level.
 I heard that SimCity will be pre-installed on OLPC.
 http://www.laptopgiving.org/ I'm seriously considering buying one, it looks lighter than a Macbook.
 
 *1194617974* I left.
 I solved the A problem.
 At first, I tried to speed up the process, but my head was getting tangled, so I solved the problem using the naive method, and the naive method was fast enough.
 How to write to the writing org from now on.
 
 *1194621797* How to write org I did it.
 The problems were too interesting to solve seriously.
 
 http://ja.doukaku.org/79/
 
 I posted a very refined algorithm out of the blue.
 This might not be very exciting...
 
 I'll solve the B problem on Monday or so...
 
 # By the way, of course it's possible for the person who solved it first to post it as a topic! And that's why we made it possible for users to post!
 </body>

[Hatena Diary 2007-11-09 https://nishiohirokazu.hatenadiary.org/archive/2007/11/09]