Hatena2008-09-24
code:hatena
 <body>
 *1222201922*How to increase the accuracy of the True Hatena Human Resource Questionnaire.
 -Hatena survey accuracy increases from 6% to 70% depending on how you use it - Web1.0
 --http://d.hatena.ne.jp/web10/20080923/1222175146#c
 >>
 The point is.
 1. do not use the first and last question items (to avoid BOTs and people who select them for no reason)
 2. instead of "If you are a ________ person, please do not answer", guide them to "If you are a ________ person, please choose here".
 3. increase the population
 <<
 
 Excellent. Although id:kajuntk is right in his criticism that the answers to the same questions are now known, I think it is very significant that the know-how on how to conduct a survey is summarized in three points that anyone can put into practice. I think it is very significant that the three points are summarized in a way that anyone can put them into practice.
 
 *1222202578* early bird
 Well, when I came to work yesterday, it was a closed day, and I was frustrated that I had come all the way from home and had to go back so quickly, so I wandered around Shibuya. After walking about 10,000 steps, I got sleepy and woke up at 2:00 a.m. today.
 
 **1222215695*Using Vim on a MacBook
 Take the first step toward becoming a Vim user.
 <a href='http://osksn2.hep.sci.osaka-u.ac.jp/~taku/osx/vimjp.html'>Using Japanese on Vim for Mac OS X</a>
 Set up while looking at the
 >>
 :set fencs=iso-2022-jp,enc-jp,cp932
 <<
 and "enc-jp" in some places, but since it is "euc-jp" above, I decided that one is correct.
 
 I changed the encoding of the terminal, I thought it was UTF-8, but it was actually EUC.
 
 Start the tutorial. vimtutor. wow, it's in Japanese.
 
 I type Japanese. Switch to insert mode, switch to Japanese mode, type, press esc to change to normal mode, and when I try to move, I forget to switch to Japanese mode and get "っっl" or something like that. Oops.
 
 I'm not sure if it's Ctrl-G in Emacs, but I wonder what it is in Vim.
 
 I knew it was undo with u, but I didn't know it was undo with the whole line with U.
 </body>
 <comments>
 <comment>
 <username>kajuntk</username>
 <BODY>I didn't mean to be critical. <BR>I didn't mean to write with such a strong attitude. <BR><BR>I am cynical, as is my habit, so it may have seemed like a criticism, but at the level of 'I don't know if it's more accurate or not'. <br><br>I'm not going to argue with him on this, and of course I have no intention of destroying his methods. <BR><BR>I'm not going to argue about this, and of course I have no intention of destroying his method. <BR><BR>I just think it's better not to say that it's easy to improve accuracy. <BR><BR>If you say it like that, you'll get a lot of complaints about reproducibility, and his proposal, or rather, his achievement in shifting the vector in a constructive direction, will be wasted. <BR><BR>Sorry for the bad language>web10</body>.
 <timestamp>1222220231</timestamp>
 </comment>
 <comment>
 <username>shou</username>
 <body>C-c</body>
 <timestamp>1222222379</timestamp>
 </comment>
 <comment>
 <username>yhara</username>
 <body>> In Emacs it's Ctrl-G, but what is it in Vim? <br>Esc? </body>
 <timestamp>1222406333</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-09-24 https://nishiohirokazu.hatenadiary.org/archive/2008/09/24]