Hatena2012-10-26
code:hatena
 <body>
 *1351230593*Pyspa Diary
 You can predictably say, "Pyspa is until I write a blog," so just join us as you write your diary.
 
 Read this to increase the accuracy of your estimate.
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4839924023" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 TDD The key point is that when it is green, we only test and when it is red, we only tinker with the actual code.
 
 practice directory: Reduce the "where shall I put it?" problem by creating a clear place to put test cases that are not the completed version of the test cases. Test code written in the process of researching libraries can be found there.
 
 Pomodoro and Lean are both measurement. People avoid TDD because they think that TDD must be inefficient because it is R&D or because the specifications are not fixed, but these are "hypotheses," and unless they are verified by measurement, they are just delusions.
 
 Q: What about tasks that are short of 1 pomodoro? A: In the estimation stage, write "less than 1 pomodoro" or "5 minutes" and do them in the 15 minutes of spare time that is not enough for 1 pomodoro, or combine them into 1 pomodoro.
 
 Delphi can also emit binaries for Mac, so you can run it on an actual Mac machine while setting breakpoints in the development environment on Windows.
 
 If the task is assigned to an individual, the psychological hurdle is raised because pairing professionals "forces them to devote other people's time to a task that they should be doing. If the task is assigned to a team, there is no such barrier.
 
 Ruby has no file scope, so it's hard
 
 In agriculture, even at 45 years old, I've only had 25 . A pe.pe who has only done /a.out.
 
 Storytelling is important to connect dots of knowledge and make them into lines.
 
 http://www.badpiggies.com/ Interesting
 
 Panekit and Astro Farmer on PSP
 
 Users who obtain it through that channel when there is a means of obtaining it illegally and free of charge would not pay the regular price to obtain it even if there were no means of obtaining it free of charge.
 
 Is it reasonable to buy garbage bags?
 
 Manga cafes compete with cabs
 
 Control the supply-demand balance to turn the economy around and raise tax revenues.
 
 Gold Auction House (GoldAH) and Real Money Auction House (RMAH). --- <a href='http://ja.wikipedia.org/wiki/%E3%83%87%E3%82%A3%E3%82%A2%E3%83%96%E3%83%AD3'>Diablo 3 - Wikipedia</a>
 
 Sometimes the game setting changes so that people who gave up on the boss and left come back to see if they can win.
 
 If you leave it, you lose rank and can't ride the horse you used to be able to ride. Losing what you gained feels more negative than not having it in the first place.
 
 <a href='http://www.wowwiki.com/Lua'>Lua - WoWWiki - Your guide to the World of Warcraft</a>
 
 Examples in languages I know and in languages I don't know
 
 First give an example that the reader knows and then connect it to a meta-concept.
 
 Sublime Text is very good, but Vim keybindings do not allow rectangular selection
 
 electric box
 
 <a href='http://dic.nicovideo.jp/a/%E3%81%99%E3%81%A8%E3%81%99%E3%81%A6'>What is Stoste (ストストステとは) [Words Article] - Niconico Encyclopedia</a>.
 
 I already have a lot of T-shirts, but T-shirts are consumable, and no, mugs are also consumable because I recently broke one! Then that means everything that will break someday is consumable, right? So life is consumable!
 
 > &#8207;@aohta Chapter 16, Recovering from Mistakes, in Introductory Git is helpful. I recommend reading it again. #pyspa
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4798023809" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 <a href='https://netty.io/'>Netty: Home (Main.WebHome)</a> <a href='http://twitter.github.com/finagle/'>Finagle, from Twitter</a>
 
 The beauty of gemfile.lock: Most package management systems use a "get me the version Y or later of library X that depends on it" type of specification, but if you simply specify "the latest current version," then if you want to reproduce the exact same environment on another machine, you will have to create a dependency file every time you try to reproduce the same environment on another machine. If you want to reproduce the same environment on another machine, you have to check the version of the dependent library and create a file with the dependency information. With gem, information on which version of dependent libraries is automatically stored in gemfile.lock, and you can decide whether to use "the current version" or "the version specified in gemfile.lock" by options. Great.
 
 Emacs Lisp introduces static scope from 24.
 
 Java is very good with the essence of concurrency processing research in util.concurrent
 
 <a href='http://spa-game.com/?cat=31'>Sutoste | Spa Empire</a>
 
 Theravada Buddhism says not to have anger -> Q: Is it anger to be frustrated after losing a game? →A: No. The same technical criticism from a trusted friend has a different probability of generating anger than a comment posted anonymously on a bulletin board. →"I trust" means "there must be no malice" →A: The game itself and the discussion itself are not harmful. It is what happens in your own mind that you find malice from it, such as "this guy is disrespecting me" or "this guy took away the praise I should have gotten" and become emotionally involved.
 
 A programmer's nightmare." I thought about putting it on the distribution channel, then it became a hassle and I ended up leaving it alone. It would be a waste to throw it away as it is, so I'll make it available in PDF format. When I finish the manuscript.
 
 Supplements are taken in the morning
 </body>

[Hatena Diary 2012-10-26 https://nishiohirokazu.hatenadiary.org/archive/2012/10/26]