Hatena2016-10-20
code:hatena
 <body>
 *1476959963*Speaking at the "Special Lecture on Information and Communication" at Tokyo Metropolitan University
 Continuing from last year, I gave a 1.5 hour lecture at Tokyo Metropolitan University's "Special Lecture on Information and Communications". Slides are here: http://www.slideshare.net/nishio/2016-67480959
 
 @overlast pointed out that it might be easier for students to understand if I used as an example the problems I wanted to solve when I was a student, so I thought about it a little and decided that "cooking," which was brought up in the Q&A session, would be the best way to convey the idea.
 
 I recall that the first thing I tried to make was "nikujaga" (meat and potatoes) after buying a "Basic Japanese Cooking" type book, saying, "Okay, I'm going to cook for myself.
 I bought some meat, potatoes, and carrots, and started making the dish, following the recipe, and halfway through, I noticed that it said "add liquor" and thought "I don't have any cooking liquor".
 So, in an attempt to add something like that, I threw in some potato shochu that I happened to have.
 The finished meatballs were kind of stinky, coarse, and tasteless.
 
 Sake" in Japanese cuisine is different from "shochu" when talking about drinks, in that it is not a concept that includes "shochu". If anything, it is said to be a member of "mirin" and "sugar.
 
 Unfortunately, I lost confidence in cooking at that time and stopped doing anything after that, but if I had tried it a second time, the PDCA cycle would have been
 
 - Do (without reading the recipe too much) I made meat and potatoes, and since I didn't have cooking sake, I added potato shochu.
 - Check It was bad when I ate it.
 - Adjust/Plan No cooking wine was a bad idea - I'll get some cooking wine and try again, I think.
 - Do Take the second challenge
 
 I think this is the way to go. Of course, Adjust is not limited to this.
 
 - I should have read the Adjust/Plan recipe properly beforehand to make sure I had everything I needed.
 
 in Tokyo
 
 - Adjust/Plan Japanese food is difficult, so let's try pasta!
 
 So it could have been. In reality, I chose
 
 - Adjust/Plan It's hard to cook for myself, so I'll just have a convenience store onigiri.
 
 So it was.
 
 
 
 As for cooking, I finally started to learn more after I got married and my wife was able to do Plan, Check, Adjust.
 For example, regarding this case, he pointed out, "If you notice a lack of seasoning after you start making a dish, you should choose 'no' instead of adding appropriate items.
 When X is needed but X does not exist, if Y is added instead, it is difficult to distinguish whether the result is a "problem caused by the absence of X" or a "problem caused by the addition of Y." If nothing is added, the result is only "a problem caused by the absence of X. If nothing is added, the result is only "a problem caused by the absence of X," and in many cases, the user learns that "a flavor is missing" or "this is what happens when X is absent.
 I see.
 
 ----
 
 We received feedback from students who attended the course and would like to make some comments.
 
 ** How do you come up with "what to learn"?
 
 The task "Come up with 'what to learn'" is a vague task in terms of how to execute it. So let's start with a small, doable task.
 
 1: Get a piece of paper and a pen 2: Write "What do I want to learn?" 3: Set a timer for 5 minutes on your phone or other device 4: Stare at the paper with the pen until the timer goes off (without doing anything else)
 
 This is a task that can be done in 10 minutes, including preparation, so why not do this first?
 
 There are two patterns of results from doing this: One is that I came up with the idea unexpectedly. The first is "I came up with the idea unexpectedly," meaning that I had never thought about the topic for five minutes in a concentrated manner.
 Another pattern is "I could not think of anything at all for five minutes. This is either because there is a mental hurdle to "learning" or there is not enough material to think about.
 
 For example, if you subconsciously think that learning is like buying a textbook at a university co-op and reading it, and you also think that you do not want to read the textbook, the two will conflict in your mind and you will not be able to come up with ideas. If you are in such a situation, it might be a good idea to take a break from "learning" and think for five minutes about questions such as "What would I be happy to be able to do?
 
 If you do not have enough material to think about, it is effective to experience various things, listen to various lectures, or open various books at the school library. It is a good idea to experience a variety of things in a shallow way, not necessarily in depth. As you look at different things, it will gradually become clear that "I don't like this one so much" or "I like this one better. One of the feedbacks from students was that they would like to find out through internships. This is also a good idea.
 
 ** PDCA cycle
 
 I heard that some of you learned the PDCA cycle in high school. I wrote about my big mistake at the beginning of this article because some people said they understood it well after hearing a concrete experience (example of cooking).
 
 There were also several people who said that they realized that what they had been doing in sports club activities, etc. was the PDCA cycle. By attaching the name "PDCA cycle" to such "patterns of behavior that we were doing without being aware of them," it will be easier for us to execute those patterns consciously in the future. This is one of the examples of "language" in the "Four Elements of Human Potential.
 
 ** LINE
 
 There was a lot of feedback that mentioned LINE, and I thought it would be easy for today's students to understand if I talked about LINE as an example of a group chat. I will refer to this in the future. When I was a freshman in college, ICQ, Yahoo Messenger, and MSN Messenger were used as group chats. Before report deadlines, etc., we would discuss in the group chat at night, "Is this the right answer for assignment 1?" We used to discuss it at night before reports were due.
 
 
 Someone asked me, "Isn't LINE used by companies?" I myself do not use LINE, but there are people out there who use it to do their work, and if you think of "group chat" broadly without limiting it to LINE, Facebook Messenger, Slack, Skype, etc. are often used. I myself have used Facebook Messenger when I was working on a project with a team of five people across four different organizations. I didn't make the choice to use it, though.
 
 
 There are many different forms of organizations and teams in the world, doing many different kinds of work. So there are cases where LINE is suited for some and not for others. For example, my company has about 500 employees. If these 500 people were to enter a single chat room and talk to each other, the conversation would quickly drift away and it would be very difficult. So the tools used in this type of organization must have the ability to divide the group by department.
 
 
 On the other hand, we also need to communicate across departments, so simply separating them is not enough. For example, I recently lost my company entry card key, and in a situation like this, who do I send a message to out of 500 people? I do not have in my mind the correspondence between 500 names and jobs.
 
 
 In addition, the job of "responding to an employee who has lost his/her card key" is actually not assigned to one person, but to a team of several people. The person on that team may be on paid leave or may be on parental leave. Even if you know who is in charge and that person is coming to the office today, it is not appropriate to send a direct message. This is because the rest of the team cannot take over the task when that person is on vacation. How can this situation be resolved? To give an example from my company, we have a system in which "if you search for 'lost card key' in the groupware, you will find a lost property report window, and if you report it there, a person from the team in charge will respond to you, and all members of the team in charge can read the response and report.
 
 
 There are other types of work that are "done once a year" for example, some of the work of a company organization. For those types of things, you want to know "what did we do last year? If this type of work is to be done via chat, I would like to see a search function that allows me to specify a date and time range from the logs. Rather than chatting, I think a tool that can organize and stock information in a way that is easy to understand a year from now would be more suitable.
 
 
 In this way, there are many different organizations/teams to work with, and if the team members say, "Our tasks can be done on LINE," then of course they will use LINE. Since it is only a tool, whether or not the tool is used depends on whether or not the objectives can be achieved with that tool.
 
 ** Fear of receiving negative words from others
 
 Negative words don't mean that one's arm will be cut off or one's life span will be reduced, it is merely "one person's negative thoughts about this matter" or "what is going on in this person's mind". It might be a little easier to think that way.
 
 Nevertheless, if you are constantly and absurdly denied your personality every day, the damage will accumulate in your mind, so it is better to escape from such an environment (while you still have the presence of mind to escape).
 
 ** In today's society, there is so much information that it is difficult to get the information we want quickly. Classification is one possible solution, but it is not a simple one. In the workshop mentioned in the materials, it took 12 hours to classify the information, which made me think that it takes time to seek accuracy.
 
 Hmmm, I guess I didn't convey my message well here because I was too brief. I didn't aim for "accurate classification" in that workshop.
 
 One of the feedbacks from other students was that they had an opportunity to give a long presentation in a seminar, but the presentation was not coherent. I think that a theme that requires a long presentation is usually a theme that cannot be easily divided. For example, "Should the death penalty be abolished?
 
 For such a theme, if you collect the opinions of various people, "classify" them, and then make a presentation, it tends to be something like, "There was opinion A, there was opinion B, and there was also opinion C." If the seminar requires you to present your own opinion, you will be asked, "What is your opinion? If the seminar required students to present their own opinions, they would be asked, "So, what is your opinion? I would be asked, "So, what is your opinion?
 
 Even if you spend a lot of time trying to "categorize accurately," your presentation may end up "lacking coherence," with "there was an opinion A, there were patterns A-1 and A-2, there was an opinion B, there was B' and B'', there was an opinion C that combined A-2 and B''..." etc., etc., etc. The presentation lacked cohesion, and the audience would say, "So, what are you trying to say? And then, "Well, what are you trying to say?
 
 On the other hand, if the purpose is, for example, to "find out what customers think about our company's new product," it is OK to collect and categorize the opinions and present them as "there were opinions A, B, and C." The method differs depending on whether you are looking for "everyone's opinion" or "my own opinion. The method differs depending on whether it is "everyone's opinion" or "my opinion" that is being sought. If the purpose of the task is to "present your own opinion," no amount of classification will do.
 
 Classification" is the process of summarizing information by discarding details, focusing on majority opinions and ignoring minority opinions or lumping them together into "others." On the other hand, "new" is in the minority. New opinions, viewpoints, and ideas, if they are "new," then they are "not the majority. Creating a new opinion is a process of picking up what you think is good from the minority, mixing, multiplying, and refining it. This is incompatible with "classification," in which details are discarded.
 
 This blog post itself is an example. This "categorize accurately" angle is a minority of one of the 44 surveys. By the way, the majority were "I have changed my way of thinking" and "I want to make use of this way of thinking. Instead of focusing on such a majority, I put the spotlight on the minority, mixed and matched it with a cut from another person who said, "The seminar presentation was not coherent," and this triggered a "thought" from within me that led to this sentence I was able to pull out some "thoughts" from within myself, and this is what I came up with.
 
 In "classify accurately," the answer is outside of you. In "presenting your opinion," the answer is inside you. The information gathered from outside may be a hook to pull the answer out of you, or it may be an accompanying tree to logically reinforce what you have pulled out.
 
 ** Absolutely correct reality is impossible to see
 
 That is correct. With that as a premise, how can we make things a little better? One way is to use other people's perspectives as well as your own.
 
 ** It's easy to fix misalignments between people, but not easy to fix misalignments between people and nonpeople.
 
 Hmmm, it is certainly easier when there is a "trusting relationship" between two people that can be exchanged without hesitation, but I thought it might be the other way around if that is not the case.
 
 For example, let's say you write a program, run it, and the message that should have appeared does not appear. You might modify the program and run it again and again, or you might write another program to find out what went wrong.
 
 On the other hand, let's say you send a message on LINE to the opposite sex you are interested in and it is not read. If you revise the message and throw it repeatedly, ...... you might end up putting him in a bad mood. ...... You may not be able to follow the PDCA cycle because you are too concerned about it.
 
 If someone thinks, "If I write a strange program and run it, my computer might explode," they will be afraid to modify the program and run it again. I think the key is whether or not the situation is "it is safe to Do/Check on this subject.
 
 ** I am sure that I will be able to find new things to learn in the areas I am working on through the PDCA cycle. However, you may not be able to find new things to learn in the areas you are not working on.
 
 Encounters are luck. If you are exposed to a wide variety of things, you are more likely to encounter new things, but you are less likely to dig deep. If you concentrate on a narrow field, you will dig deeper faster, but you will encounter fewer new things. You need both, not one or the other.
 
 By the way, even if you think you are working only in a specific field, unexpectedly, topics from neighboring fields may come into the mix, or sometimes something completely different may pop up. Did you expect such topics to come up in the "Special Lecture on Information and Communication"?
 
 What this topic was chosen for, is luck. When Dr. Komachi approached me last year to give a lecture, it happened to be right after I had given a lecture of the same length of time, so I asked, "How about this topic?" I asked him, "How about this topic?" and he said yes, so this topic came up.
 
 My personal feeling is that the probability of encounter is quite high. However, when there is an encounter with something unexpected, many people pass it by. Like, "There was a special lecture on telecommunications with a different flavor," "I wrote an impression survey for credit," "Okay, I'm done with that," "Next, I have to finish my report on linear algebra.
 Time is finite, so we tend to prioritize the things that have been around for a while that we know well over the new, unfamiliar things that have come in. We might as well worry about what passes us by rather than what we don't encounter.
 </body>

[Hatena Diary 2016-10-20 https://nishiohirokazu.hatenadiary.org/archive/2016/10/20]