Hatena2009-02-18
code:hatena
 <body>
 *1234903251*Question
 What is this?
 
 
 
 f:id:nishiohirokazu:20090218054207j:image
 
 
 
 Answer:
 
 
 It is the same kind of garbage bag that I usually keep on the shelf next to the left side of the refrigerator, and when I tried to use it the day before yesterday, I couldn't find it, so I bought a new one yesterday. There are a lot of them in there.
 
 I didn't notice it at all...I thought I couldn't find it, but here it is.... Well, it's a consumable item, so I'm sure I'll use it someday.
 
 *1234908877* tremendously
 [http://www.youtube.com/watch?v=EOpuoDWLXPg:movie]
 
 
 Wahaha. Kids are so freeform!
 
 *1234911023*Household
 I got a lot done yesterday, so my task list is much smaller.
 
 
 Quite a few books come out from under the bed.
 
 
 There is garbage all over the bottom of the separate room, and my motivation is waning. For a moment, I was trying to think of a good use for my notebook, etc. Not a good idea; I have 15 minutes to collect all the burnable trash under my bed.
 
 
 Fifteen minutes elapsed. I've cleaned up a lot, but I'm not done yet. I need to clean up enough to be able to say, "There is nothing under the bed," or I will have to do it twice. I'll do it until there's nothing under the bed in another 15 minutes, and then we'll have dinner.
 
 
 I was going to take pictures of my new house before I move in to see if there are any scratches on the floor or anything, but I can't find my digital camera. Where on earth would I put something like a digital camera?
 
 
 Dawdling over where my digital camera went will only make me sleepy, so I'll go hang the laundry to dry. I just finished the laundry. I'll do it while listening to English so I don't get sleepy. 15 minutes to take the existing laundry in and hang the new laundry out to dry.
 
 
 Ho. It was just 15 minutes. My folded clothes are lined up on the bed, not in the closet, but that's a trivial problem.
 
 
 I am sleepy and need to get some daylight.
 
 
 Is that that itchy nose or hay fever? Explode the pollen! No, no, I don't want it to explode.
 
 
 The soles of my feet are very grubby. Reflexology is expensive. I'll just keep on gurgling by myself.
 
 
 Since it was too much to eat three thin rice porridge in a row, I made chicken ramen and threw the porridge into the soup. I ate everything, even the kelp. 5 pieces. Maybe I ate too much.
 
 
 My back hurts so I applied Ammeltz, but thinking about it calmly, I should have taken a bath to warm it up. No, I'm full after eating, so am I right in my choice not to go in? As a compromise, I'll just put my feet in the hot water. I have a bucket.
 
 
 Buckets of hot water cool down quickly. If you say <a href="http://www.amazon.co.jp/gp/product/B000ANBB8M?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=B000ANBB8M">Leg Warmer Pokapoka Footbath</a><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as2&o=9&a=B000ANBB8M" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" />I was told to buy it. Mm, very tempting, like keeping my feet dry!
 
 <hr>
 
 - □ Classify and process important documents.
 -- □ Put together what you need, especially for this year's tax return. One large envelope it would alloc like that.
 - Eating Porridge
 - You need to drop off your rent or credit card at the post office and have it in by the time your rent or credit card is debited.
 - Write a reply to your e-mail
 - □ Clean up the room
 -- ■ ← Clean under the bed
 - Washing & taking in & drying
 - □ Electricity, gas, and water are installed in the new house.
 - Measure the size of your new house
 - Measure the size of the furniture.
 - Cutting a sheet of paper
 - □ Throw away empty cans
 - □ Throw away plastic bottles
 
 - Map
 - □ Summarize how to create a GAE project
 - □ About Mercurial's bisect
 the others
 - 19 Head Office
 - 20 pots / debit your Rakuten card
 - 28 Return of keys to current address
 - I'll get a haircut soon (maybe next time I'm in Akihabara).
 
 **1234916788*Considering how to effectively use a super-organized notebook.
 Thinking about how to make effective use of my super-organized notebook. I don't use it very effectively, but for the time being, I have a single schedule in my notebook, which is useful for answering questions about my schedule and for having a space where I can take notes anytime I am asked. For notes, I have a bunch of sticky notes that are half the size of my notebook. Oh, and I haven't remembered my address in over a year, so having that written down was helpful. Due to the density of the schedule, the bellows schedule, one of the features of the super-organized notebook, has not helped at all. I have a yearly calendar on the rightmost page and write in there as needed.
 
 
 So let me get this straight.
 - Annual Calendar
 - Memorandum of address and other important information
 - notepad
 So, it only works as a "I don't know what to do. Hmmm. What function should we add?
 
 *1234964876*Corrugated paper
 f:id:nishiohirokazu:20090218224754j:image
 
 I've measured my new house. New house design fun.
 
 
 Hmmm, beds are bigger than I imagined. Also, the protruding corners are a bit of a nuisance.
 The space will be one size smaller than where we live now, so we need to improve the space efficiency. We want to avoid putting things in front of the electrical outlets because they will get in the way. And so on.
 I decided to cover the corner with desks and shelves to create a booth-like work area.
 
 
 Oh, wait, if I pull the wire from the outlet, the drawer will not be able to be opened. If I put Luminous on the outlet side, it would just barely cover the window. I guess this is the final answer.
 </body>

[Hatena Diary 2009-02-18 https://nishiohirokazu.hatenadiary.org/archive/2009/02/18]