Hatena2009-03-10
code:hatena
 <body>
 *1236658208* How not to get burned.
 >>
 Tips for avoiding flames by adding "Paul Graham said..." at the end of a blog post.
 <<
 
 
 OTSUNE said.
 
 <hr>
 
 Postscript:
 
 http://wassr.jp/user/hasegawa/statuses/2XYQGAtdq5
 >>
 When you say something terrible, you can add "とってTAKESAKOさんが言っいた" at the end of the word. Kazuho-san said.
 <<
 
 said hasegawayosuke. Therefore, Paul Graham == TAKESAKO.
 
 *1236664563*My acceptance announcement
 >>
 
 Mother: yes
 Me: Oh, hello, it's me.
 Mom: (Her voice is subdued. This must be a fall...)
 Me: I forgot my examination voucher and don't know my number.
 Mother: (?!!)
 Me: I've memorized a number that looks like that for now, so tell me the number on the examination voucher that's on the altar.
 Mom: XXXX.
 Me: Ah, then you passed. I'm going home now.
 <<
 
 So, I was in a phone booth in Demachiyanagi when I found out that I had passed the exam, so I had nothing to do with a big party.
 
 id:voluntas told me http://twitter.com/voluntas/status/1304164198 so I wrote it.
 
 *1236690717* What can I do about it?
 I made a list of the documents required for my tax return, and then realized that only the relevant documents were missing from the document box. It seems that I had started to prepare for the tax return and then just put it somewhere else.
 
 It only makes me sad when I see withholding tax slips from 2007 or 2003.
 
 *1236704679* I just looked at amazon's CD rankings and was truly stunned!
 >>
 I just looked at the amazon CD rankings and was really stunned.
 
 I assure you, anyone who is moved by the sound of that machine and buys a CD is a fool. I can say this with 100% certainty.
 
 Why do you think that was good? Why do you buy CDs?　I really don't understand. That's a machine. It's the sound of a machine. Anyone can hear it and instantly know it's a machine. You must be really stupid to be moved by it.
 
 If you think that's good, you're crazy, or your brain is degenerated. That's the only explanation. In other words, they can no longer distinguish between live music and machine sounds. So they buy it because they think it's good. This is nothing but stupidity. Is the future of Japan safe?
 <<
 Original story: http://anond.hatelabo.jp/20090308152436
 
 
 Of course, it is an altered story.
 It's not cool to be stingy with other people's values based on your own.
 He also said, "I just borrowed a classical CD from a friend and was stunned. Most of the songs sounded like machines. Everyone can tell that they are machine sounds. We've lost the ability to distinguish between machine sounds and human voices!" But I decided to use the version above, because "It's a machine sound when it's on the CD in the first place. I decided to use the version above because it is a machine sound on the CD in the first place.
 
 *1236706963*Memorandum for moving.
 It will be more than two years before I move again, so I'll record my thoughts on this first move, which included a washing machine and refrigerator. The "□" boxes are for TODO checkboxes.
 
 - Moving should be done as soon as possible.
 -- There are some packages that offer a discount in exchange for letting the vendor choose the date from a list of five consecutive days, but you can't choose at the last minute.
 -- Some companies say, "We can't use the discount package because there are too many moves on these dates.
 --I call the contractor early so that I don't have to rush when they tell me that they can no longer provide a truck for that date.
 -- I don't know if this is true or not, but I was told that the estimate was 12,600 yen, but "if you had called me yesterday, I could have done it for 20,000 yen, but it's too late now, so it's 31,500 yen".
 - □ At least 10 days before the move, get quotes from multiple online moving companies using a service that allows you to get a lump-sum estimate, etc., and call the companies.
 - □ The moving date must be finalized 7 days before the move in order to go.
 - □ Once the moving date is fixed, go to the post office and get a form to apply for mail forwarding, fill it out, and drop it in the mailbox. This takes about 7 days after application.
 - □ Moving of gas, electricity, and water. The contact information is usually given by the real estate agent. If they are the same company, the procedures for both suspension and commencement can be done together.
 
 - □ Take care of the food in the refrigerator and freezer. If you don't mind throwing it out, throw it away. I made a casserole with frozen foods whose expiration date was the year before last, and it was quite tasty. This cleanup work should be done on the day before the garbage collection so that food to be disposed of will not be left for a long period of time.
 - □ Collect cardboard boxes. I told the movers that 10 boxes would be enough, but it was not enough at all. Even a 6-mat 1K like me needs about 20 boxes if I have a lot of books.
 -- You can get cardboard boxes at supermarkets and 100 yen stores, but don't expect to get enough. Everyone who moves out goes to get them. Also, these cardboard boxes are small and of different sizes, so they are very difficult to use.
 -- "mover's cardboard boxes" discarded by those who moved ahead of you on the day of recyclable waste are very useful.
 - □ Keep a photo of the contents of cardboard boxes so you can easily see what's inside without having to open every single box.
 - □ Make a list of cardboard boxes by assigning IDs to them. Because they can be lost: http://d.hatena.ne.jp/shunkoh/20090504/1241449100
 - □ When the movers brought the washing machine, they forgot the part that connects the hose to the faucet. Need to check.
 - □ Furniture that arrives disassembled and assembled by yourself may not be able to be taken out of the entrance as it is. Check and disassemble if necessary.
 - I thought I had packed the rice cooker and other appliances with duct tape to prevent the lids from opening, but the vendor wrapped them in plastic wrap and put them in the box. The vendor wrapped them in plastic wrap and put them in the box. I cut the plastic wrap with a cutter and wrapped it softly, but did not tape it.
 - The movers stopped the cardboard boxes in a crisscross pattern. First, they put it along the cut, and then they fastened it so that it intersected with the cut.
 - Gummed tape is quite pull-resistant, so I used to take out a long piece of tape, stick it on one side, and then pull on the string to tighten it. The opening of a futon bag, for example, is not tightened with the tape as it is, but instead of "pushing it in and then sticking it on," as I used to do, I would "stick it on first, and then pull to tighten it up. I thought, "I see.
 
 - □ Think about where you will put your refrigerator and other large items when you move.
 - □ Remove the light fixture installed by yourself
 - □ Take out the garbage. I had to carry three bags of garbage by bicycle because I had mistaken the date and couldn't take it out.
 - □ The change of residence certificate must be made after moving, but the person at the counter said, "Let's assume you moved today," and it was OK.
 
 - Separate out what you might need immediately after you move in.
 -- □ Cell phone and charging cable □ MP3 player and charging cable □ Hygiene items such as toothbrush, towel, shampoo, body soap, etc. □ Change of clothes for a few days □ Wallet □ Paper with what to put where □ Curtain □ Toilet paper
 -- □ Bedding, pillow, and pajamas if needed
 
 - It is often done to write information about the contents on the top surface of cardboard boxes with a magic marker, but it is quite pointless. This is because the top of the cardboard boxes are stacked by the movers in the proper order, so the top side cannot be seen. If you want to write on the cardboard, write on the four sides.
 - Binding books makes it easier to put them in boxes and bookcases. You can cut the string after you put the whole clump into the bookshelf at the new location.
 - During the move, the door is open because of the moving of goods out of the house. The contractors are warm because they are moving around with their belongings, but I am very cold. In winter, you should dress for two hours of waiting in the windless, but the temperature is the same as the outside air. It was a snowy day and I thought I was going to freeze to death.
 - On moving day, I was very impatient to find two large cardboard boxes full of books in the back of a closet. They were cleaned out by a room-cleaning company, but for those of us who are so untidy that we can't go without calling such a company, "putting them in boxes and putting them in the back of the closet" is a worse solution than throwing them away because "you can never get to them when you need them & you have to carry them when you move out".
 - If you can't see what's ahead, you will get tired. A clear goal should be set, for example, drawing a line in the middle of the room and saying, "Make sure there are no unpacked items beyond this line.
 - Try to group together items that will be needed at the same time. Rice measuring cups should be in the rice bag, and rice cooker power cables should be in the rice cooker. Do not put the cables of the rice cooker and the power cable of the computer together in a box, thinking, "Let's put the cables together with the cables. Rice cannot be cooked unless you find both the rice cooker itself and the cables. If the rice was also with the rice cooker, the rice could be eaten another day earlier. (I had trouble finding the rice cooker.)
 - Put the items you might need after the next move in at the very back of the storage area that is hardest to use. Because that will be the last thing to go when you leave.
 - I put hand soap in the basket thinking that I could just leave it there, and then forgot about it and put something in on top, resulting in hand soap all over the place. I should have taped them up properly.
 
 ** If you carry luggage by bicycle
 - If the load is too narrow, it will not be stable, so spread it out by securing a net sold at a 100 yen store with a binding band.
 - It is easy to load the car by taking two or three rubber straps for the cargo bed and attaching them.
 - Three 1- to 2-meter strings are much easier than one 10-meter string.
 - A basket or cardboard box that just fits on the back of the truck makes loading easier.
 - The rubber straps must not sag when the load is empty, or they will wrap around the rear wheels and cause a big problem.
 </body>
 <comments>
 <comment>
 <username>banwa</username>
 <body>>>Go to the post office and get a form to apply for mail forwarding, fill it out, and drop it in the mailbox<br>You can do this online. You will need a credit card to verify your identity<br>http://welcometown.post.japanpost.jp/etn/<br>Yamato Transport also accepts TA-Q-BIN forwarding. <br>Yamato Transport also accepts TA-Q-BIN forwarding. <br>Sagawa Express could not do it. </body>
 <timestamp>1236771140</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-03-10 https://nishiohirokazu.hatenadiary.org/archive/2009/03/10]