Hatena2011-03-23
code:hatena
 <body>
 *1300865712* iodine water road water diary
 >>
 Radioactive iodine was detected at 210 becquerels per kilogram of water, above the "100 becquerels per kilogram of water."
 <<
 <a href='http://news.tbs.co.jp/newseye/tbs_newseye4681619.html'>'Radioactive iodine above standard for infants at Tokyo water purification plant' News i - TBS's video news site</a>.
 
 >>
 The effective dose of 10,000 becquerels ingested orally would be 0.22 millisieverts.
 <<
 <a href='http://cnic.jp/modules/radioactivity/index.php/11.html'>CNIC - Iodine-131</a>
 
 >>
 The incidence of the disease in children under 5 years old is higher than that in children between 10 and 14 years old.
 The probability decreases by a factor of 5. In addition, people over 20 years of age are exposed to less than 1 Gy of thyroid radiation.
 The probability of thyroid gland or thyroiditis after a
 <<
 
 >>
 The equivalent dose to the thyroid gland is the dose from radioactive iodine accumulated in the thyroid gland due to inhalation of radioiodine released into the environment. The dose coefficients of inhalation of radioactive iodine (Sv/Bq) are the largest for children (1 year olds). Therefore, the value for children is used as an indicator of protective measures.... The value for children is used as an "indicator" of protective measures for the prophylactic use of stable iodine tablets in our country.
 We propose a predicted pediatric equivalent thyroid dose of 100 mSv from radioiodine uniformly for all subjects, regardless of age or gender.
 <<
 <a href="http://www.nsc.go.jp/bousai/page3/houkoku02.pdf">Concept of Preventive Administration of Stabilized Iodine Tablets in the Event of a Nuclear Disaster</a> Nuclear Safety Commission
 
 At 210 Bq per kg of water, the effective dose from an oral intake of 10,000 Bq is 0.22 mSv, and at 100 mSv, the decision is made to err on the safe side (based on data from a one-year-old child, the most sensitive child) and "give him a stabilizing iodine pill". So, let's see, drinking 21.6 tons of water would be the level of stable iodine needed, which can be achieved in a year if you drink 59 liters a day. Oh, but is 100 mSv an index for intake by breathing? Where is the value for drinking as water written? Hmmm. I wonder if the difference between drinking and inhaling can be absorbed there, since the effective dose calculation table for converting becquerels to sieverts includes the cases of inhaling and drinking. According to the <a href='http://researchcompliance.uc.edu/radsafety/isotope/isds-I131.html'>second opinion</a>, this calculation seems to tip it about 1.5 times to the safe side. Using these figures, you would need to drink about 90 liters a day.
 
 If we use the phrase "The probability of thyroid cancer after thyroid exposure of 1 Gy or less is extremely low for people 20 years of age or older", it would be 1000 mSv, which would be "The probability of thyroid cancer is extremely low at an intake of 216 tons or less". If this water is not drunk for 50 years at 12 liters per day, the probability of thyroid cancer is "extremely low. No matter how you calculate it, there is no reason for people without children to buy up all the water, and old men and women over 20 should give it to their children.
 
 I also wondered what about women who might have children in the future, but with a half-life of 8 days, that means it decreases to 3 parts per trillion in one year, so I guess I shouldn't worry about that.
 </body>
 <comments>
 <comment>
 <username>hossu</username>
 According to <body>http://surfphys.tagen.tohoku.ac.jp/archives/457.html<br>, 0 year olds are the most sensitive, and the conversion factor (uSv/Bq) is 0.140, so if you drink 10L of 200Bq water a day for a year<br>0.140*200*10*365=102200<br>, you will exceed 100000uSv=100mSv. 10*365=102200<br>This means that about 100000uSv=100mSv is exceeded. </body>
 <timestamp>1301020772</timestamp>
 </comment>
 <comment>
 <username>Passing by</username
 <body>It looks like you are lumping the equivalent dose to the whole body together with the equivalent dose to the thyroid. <BR>The conversion factor for the thyroid gland is much larger, so I am not sure this calculation would work. <br>You can refer to this per http://www.mhlw.go.jp/stf/houdou/2r9852000001558e-img/2r98520000015cfn.pdf<br>. </body>
 <timestamp>1303339850</timestamp>
 </comment>
 </comments>

[Hatena Diary 2011-03-23 https://nishiohirokazu.hatenadiary.org/archive/2011/03/23]