Hatena2008-10-08
code:hatena
 <body>
 *1223481311*[TopCoder] missed it.
 It is now 0:50 pm after returning home by the last train, and of course I could not participate in this SRM which started at 0:00 pm.
 Generally, at the reception after the lab presentation, I didn't even drink alcohol, but I got sleepy and slept all the way from Tchu, so even if I had remembered, I wouldn't have made it.
 
 The next one is on Sunday the 19th at 1:00 AM. Hmmm. I wonder if there are people who would be interested in a hackathon at a karaoke room somewhere, and after TopCoder, we can sing or have a chat, and then break up at 5:00 am.
 
 **1223489038*About Boring
 Calm down and read to the end.
 
 
 I don't think a new bowling player should be mocked for throwing the ball into the gutter. I was the same way at first.
 Maybe you throw it in the lane next to you and cause trouble for others. But I think every human being makes mistakes. Trying something new is always next to failure. I don't think we should bully those who have failed.
 
 
 But, of course, you shouldn't mock him for throwing into the gutter, but it's good to tell him, "That kind of throw is not stable, so you should throw like this.
 If you make a mistake and cause someone trouble, you might as well apologize sincerely. Unless you don't mind being antagonized. It's important to try not to repeat your mistakes.
 
 
 When a beginner who has never bowled before tries something new and fails, he or she is told, "You suck at bowling! You're so bad at bowling! I don't like you.
 The person who saw him throw it into the gutter and commented that he was not bowling, I don't think that scoring points is the only way to bowl. I think throwing the ball is better than doing nothing. Can't you appreciate the effect of trying your best in your own bad way to make other people think "I should try it too"? Isn't saying "I'd rather not play" to a bad player an act of pouring cold water on those who would otherwise try bowling?
 The person who pointed out the problem with your throw, your action is a very good thing in isolation, but when there are already many people pointing it out, the situation is a little different. Since there is only a limited amount of information that humans can accept, if there are too many pointers, you will want to go through them all together. If you are suddenly presented with dozens of tasks, you would probably want to run away, right? And pointing out problems that others have already pointed out to a person who is full of things is like putting more stones on a person who is staggering with a heavy load.
 And one person in particular, you who said "he doesn't have enough imagination" and "it's no wonder he has Asperger's", why did you think you had enough imagination? Don't you think that a person with no imagination cannot realize that he/she has no imagination, then perhaps you too might be considered "unimaginative" by others? Why throw stones with impunity? Why assume that you have Asperger's? Could you imagine that your comments would be taken to the level of someone (including me) who truly has Asperger's?
 
 
 And I wanted to defend it, mainly because I had a lot to say to the people who were screaming around me.
 
 
 I can't have people saying, "I'm a fast thrower, aren't I? I don't like it when people say, "I'm fast, aren't I? Bowling is not that kind of game.
 Without fixing his throwing style, he said, "I'm cool, I can throw the ball fast! Jetstream Attaac!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!" without fixing the way you throw, it's annoying. It's not cool. In fact, it's not cool.
 It is not good to lie. It is not good to demean others for self-preservation. It is not good to blatantly change your attitude depending on whether the other person is a celebrity or not.
 
 
 Even now, "Don't be afraid to try bowling for the first time!" has not changed. However, I have come to seriously think that I should stop yelling and throwing the ball, and calmly observe the surroundings. To sum it up, I think it would be better to say, "Get down! I wonder if it is. I'm not sure if I'm doing the right thing by saying those words. It's 180 degrees opposite of what I've been doing. But at least I can't cheer for him if he continues to throw the way he has. I was tired of feeling disappointed when I saw him score a point and was happy that he could do it, and then found out it was&#22099; a mistake.
 
 
 Now I hope other inexperienced people don't get the impression that I am afraid of bowling.
 
 **1223490067*[TopCoder]TopCoder Department
 http://generation1986.g.hatena.ne.jp/keyword/TopCoder%E9%83%A8
 
 suztomo is doing great! suztomo++.
 >>
 What kind of problems will I have?
 
 Many problems can be solved by turning a double loop at first.
 
 For Japanese, it is hard to read the questions written in English, but it gives them immunity.
 <<
 I blew it.
 
 It says 86 but I'm 81 and I'm participating so I think at least +/- 5 years is OK.
 
 *1223492726*Continuation of bowling story
 Some say he won't get the message, but I don't think he will. How many dozens of people have tried hard to tell him so far?
 So that was an entry that I wanted to get out what was bothering me and express my hope that people who are just starting out in bowling will not atrophy. I think it would be better to use the effort to help other scared people than to provide him with blog fodder by engaging with someone who would just negatively campaign himself, or even other people and industries by writing an entry as if he had been lynched.
 
 So, even if I don't get involved in the future, I can't help but vent my frustrations, so I used a bowling analogy to get it out.
 
 -----
 
 Quick response:
 http://d.hatena.ne.jp/kajuntk/20081009/1223491599
 >>
 Even a bowling alley has a game called gartering, where the highest score is the Jet Stream Attack.
 (Abbreviation)
 It's funny that he and I say things like that when we don't have a consensus that we're playing the same game by the same rules.
 (Abbreviation)
 I'm simply uncomfortable with people having that kind of fun.
 
 To justify the discomfort in some way, they give ad hoc reasons, such as because of bad form or score modification.
 <<
 
 I see.
 I guess I was extremely offended by the homework.in thing (http://d.hatena.ne.jp/nishiohirokazu/20081005/1223198641).
 
 >>
 I think once he crushes each one, he'll come up with a second or third one, and this time he'll play gliding, where he slides himself into the pins, or doraemoning, where he attaches the ball to both hands.
 
 Isn't it a hassle to crush every single one of those?
 
 I think the world would admire him more if they knew how cool it is to sputter around making strikes next to guys like him who are throwing gutters all over the place.
 <<
 
 That's right. Instead of saying, "Don't just talk about it, show it with your actions." It was a boomerang.
 
 Let's work hard at our own jobs instead of saying four or five things with our mouths.
 </body>
 <comments>
 <comment>
 <username>Kosei</username>
 <body>It's a glue! </body>
 <timestamp>1223515396</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>s/bowling/bowling/g</body>
 <timestamp>1223518005</timestamp>
 </comment>
 <comment>
 <username>Jojoba oil</username>.
 <body>Yes<br>that's right! </body>
 <timestamp>1223541332</timestamp>
 </comment>
 <comment>
 <username>^q^</username>
 <body>I'm having fun digging holes.
 <timestamp>1223560794</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-10-08 https://nishiohirokazu.hatenadiary.org/archive/2008/10/08]