Hatena2013-12-14
code:hatena
 <body>
 *1386992255* Cybozu Hackathon received an award of excellence!
 Last week, I participated in the Cybozu Hackathon Winter 2013 held at Cybozu headquarters, and to my surprise, I received an award of excellence.
 
 Let me explain a little about the background. Cybozu held a hackathon this year as an internship program for students, where they had 3 days to create what they wanted to create. The event will be held again next year, so if you are interested, please check the link at the end of this entry! After running the hackathon, some students said, "This is interesting! Let's do it ourselves! and we got excited about it, so this hackathon was held.
 
 I forget the exact number of people, but there were more than 20, and not only from the Tokyo Development Department, but also from the Matsuyama Development Department. The company provided lunch, so the lunch break was very lively. The themes varied widely, with some people making work-related themes while being teased about their work, while others were more academically oriented. It is good to have diversity.
 
 On the last day, each person gave a 3-minute lightning talk. The audience laughed hysterically when id:TAKESAKO, the top batter, appeared at the venue 7 minutes before and said, "I'm going to make slides now. The laughter was foreshadowed by the fact that he attended to the demonstration collaborators from the audience on the spot. The rest of the presentation was very interesting as well, with the sudden start of a skit and a live thread on <a href='https://kintone.cybozu.com/jp/'>kintone</a> in the company. Many people said they would definitely like to attend the next one, and I wonder if there will be even more next time.
 [f:id:nishiohirokazu:20131214122910p:image]
 
 The Excellence Award was announced at the reception after the presentation. When I participated in the event, I said half-heartedly, "I'm going to participate in a hackathon held by Cybozu engineers at the head office for three days from today! I'm going to join the Cybozu engineers at the headquarters for a three-day hackathon! I was surprised to see that I really got it.
 [f:id:nishiohirokazu:20131214122911p:image]
 
 I'm under a lot of pressure now that I will be in a position to accept the challenge as the first champion at the next hackathon (laughs).
 
 That is how I enjoyed the 3-day hackathon.
 
 ** References
 
 hackathon
 - <a href='http://developer.cybozu.co.jp/tech/?p=6465'>Cybozu Hackathon Held</a>
 - <a href='http://developer.cybozu.co.jp/tech/?p=6502'>Cybozu Hackathon Day 2 Report</a>
 - <a href='http://developer.cybozu.co.jp/tech/?p=6580'>Cybozu Hackathon Final Day Report</a>
 
 intern
 - <a href='http://cybozu.co.jp/company/job/recruitment/intern/'>Internship | Cybozu New Graduate Recruitment</a>
 - <a href='http://developer.cybozu.co.jp/tech/?p=5900'>"Cybozu Labo Youth Hackathon" has started</a>.
 - <a href='http://developer.cybozu.co.jp/tech/?p=6036'>Report on Day 2 of the Cybozu Labo Youth Hackathon</a>
 - <a href='http://developer.cybozu.co.jp/tech/?p=6008'>Results of "Cybozu Labo Youth Hackathon" </a>
 
 *1387027460*I saw the Bitcoin stats.
 - Less than 60,000 transactions made in the past 24 hours (surprisingly few)
 - Total Output Volume is 761,728 BTC, so the average output volume per transaction is 13.1 BTC
 - 1BTC is 916USD, so the average is approximately 12,000USD. Since the Japanese yen is 103 yen to the dollar, the average transaction amount is roughly 1.2 million yen. (This was much larger than expected).
 
 I blogged about it because it was a surprising number. I may add to it later.
 
 [f:id:nishiohirokazu:20131214220840p:image]
 [f:id:nishiohirokazu:20131214220838p:image]
 
 You can see the original data here, but it is automatically updated, so it may have changed by the time you, the reader, see it, so I have included a screenshot. https://blockchain.info/stats
 </body>

[Hatena Diary 2013-12-14 https://nishiohirokazu.hatenadiary.org/archive/2013/12/14]