Hatena2012-06-22
code:hatena
 <body>
 *1340292613* What I want to make: zshrc to visualize the state during rebase
 Since I started using zsh+git to show what branch I'm on, what uncommitted changes I have, and what files are untracked, I've become very comfortable with the current status. However, I have a complaint. One is that it doesn't show me anything when I have a detached head, and the other is that it doesn't visualize whether it is "waiting to resolve conflicts and add" or "waiting to --continue or --abort" in the middle of rebase. It would be more comfortable if these two were also displayed.
 
 *1340293409* What I want to make: a mock of goog.require
 One of the reasons is that goog.provide and goog.require are required to use the Compiler, One of the reasons is that goog.provide and goog.require are required to use the Compiler, and since the implementations are included in the base.js of the Google Closure Library, you may have to check out the entire repository even if you don't end up using the Compiler.
 
 And then, "Even if you separate the files, goog.require will properly load them from the library path. But you have to make deps.js to do that" and all that stuff is a pain in the ass. I use jscc so I can just make -B deps and be done with it, but most people probably spend a lot of time figuring out what to do with the calcdeps.py arguments. In cases where performance is not required, I often just write script tags for the number of JS files I have, but when I try to make a little something like that, when I use my library that has goog.require, I get the following error message I'm getting a lot of problems when I use goog.require in my libraries.
 
 Well, the badly written quickstart.py that is now in jscc's develop was created to solve that.
 
 But when I think about getting other people to use the project I created in that way, the explanation cost is still high. Then I thought, why not just have a googmock that creates empty objects without loading libraries, or a googmock that assumes that libraries are in the same folder? If you want to take advantage of the compiler, you can set up your environment, and if you just want to use the libraries, you can use googmock.
 </body>

[Hatena Diary 2012-06-22 https://nishiohirokazu.hatenadiary.org/archive/2012/06/22]