Hatena2011-06-19
code:hatena
 <body>
 *1308452872*英単語日記8
 ** Activities on 17th
 Day 2 test today, 16 sheets. Duration 1m25. ok 16 sheets. rescheduled to 21st.
 >||
 7/7  1m 29
 6/24 8d 26
 6/22 8d 35
 6/21 4d 16
 6/19 4d 10
 6/18 2d 23
 working 3
 [3, 23, 26, 61, 0, 29, 0, 0, 0, 0]
 total: 142
 score: 545
 ||<
 
 ** Activities on 18th
 Saturday was the first day of vacation, so I played around and realized it was midnight. 25:00 or so I realized I hadn't studied, but I was too sleepy to do so.
 
 **Activities on the 19th
 
 Tried the Day 2 review test for the 18th and the Day 4 review test for the 19th. I answered all the questions correctly. I wonder what I should do if I give an answer that is semantically correct but not exactly the same word. The purpose of the test is to memorize the meaning of the word, so I think I should give the correct answer if I can remember the meaning of the word. To be more specific, if you saw contingency and remembered "I don't know what will happen" and "~ fee is a contingency fee" but couldn't remember the translation "contingency" or "uncertainty", what should you do? Well, I'd rather make a little mistake than get all the answers right. So let's put this back on the card we're studying: 2d tested 23, OK 22 NG 1.
 
 Studying card. anecdotal incorrectly. The dictionary translates anecdotal report as "case report," but according to the OALD, it is used to say "This research is based on anecdote, not fact. In short, it is a "story from the people involved.
 
 **Physical
 The schedule is written like this, painted corners and put in one ring.
 
 f:id:nishiohirokazu:20110619120826j:image
 
 The cards are tested after they are released from the ring. Mr. Beardy used cards about the size of a playing card, much larger than mine, and he said he shuffled them like playing cards so that they would not be "memorized in order". I didn't think anything of it, but I decided to pile the tested cards face down instead of face up. That would put them in reverse order, right? Maybe I can make it a deal shuffle.
 
 I added rings and word cards yesterday. The rings were sold separately at a stationery store in town for about 15 yen each.
 
 ** 目標の確認
 When I calculated my score to find out how close I was to achieving my goal, I realized that if I got 3 more points today, I would have achieved my goal, so I studied and got about 8 points. I don't know what the goal is for if I can't realize that I am close to achieving it.
 
 >||
 7/7  1m 29
 6/27 8d 10
 6/24 8d 26
 6/23 4d 22
 6/22 8d 35
 6/21 4d 16
 working 12
 
 [12, 0, 38, 71, 0, 29, 0, 0, 0, 0]
 total: 150
 score: 584
 ||<
 
 - Current goal: 600+ points by the end of Monday -> 24 more points by the end of Monday
 - Challenge Goal: Score 30 points Friday - 527 → 17 points at 545. Failure.
 - Challenge Goal: Study on Saturday and score at least 32 points. - Failed because I did not study on Saturday itself.
 - Challenge Goal: Study on Sunday and earn at least 34 points. - After calculating my score, I realized I had 3 more points to go, so I did some additional work and achieved it.
 
 To get 24 more points by the end of Monday, I'll just have to answer all 12 of the current cards I'm studying for correctly, and then add another 12 cards I'm studying for... Achieving this "how many points in one day" goal is basically a matter of remembering to solve the test, and then making up the missing points by adding new cards. This is a somewhat far-fetched goal. This is a slightly roundabout way of setting a goal. The problem with my lack of success, the gap between ideal and reality, is that I don't study on Saturdays. If I am not able to do that, it will be no good if I add more tasks like "how many points do I have to get? First of all, you should take seriously the fact that you are not able to do it.
 
 - Challenge: Increase by at least 1 point on Saturday
 
 What kind of activity would be needed to continuously get x points each day: if you add y cards per day, you would get +y points that day, +y points if you answered all the questions correctly the next day, +y points if you answered all the questions correctly two days after that, and so on. Then you would need to add roughly x/2 to x/3 cards per day. In that light, last weekend's design, in which I planned to get more than 30 points every day, was wrong. Well, it was positioned as a challenging goal; I'm about 45 points in 3 days, so that's 15 points per day, and I'd need to add an average of 5-10 words per day to get that. Hmmm, that doesn't sound like a bad goal to set....
 </body>

[Hatena Diary 2011-06-19 https://nishiohirokazu.hatenadiary.org/archive/2011/06/19]