Hatena2015-01-28
code:hatena
 <body>
 *1422443156* Experimental log that was solved when I was trying to explain to the computer that I was going to discuss the design with them.
 he> What would you like to see happen in this conversation?
 I> First, listen to me.
 He> Yes, sir.
 I> I thought I would ask his (?) opinion on the design of this program. I thought I'd ask for his (?) opinion on the design of this program.
 he > Design
 I> Regarding the implementation of the command. First, the normal flow without commands is "input received" -> "state transition based on input" -> "state and reply based on input"
 He> case
 Me> Next, for inputs prefixed with NG, the "input is present" -> "Check if NG. Yes" -> "Process NG command", and since the state is not updated, "Reply based on state and input" is then triggered normally.
 he> Update
 I> In the case of the "reset" command, we will judge it immediately after receiving the input, and if it is triggered, we will do the resetting process, such as updating the status. Then it returns to normal flow, so the initial "What would you like to see happen in this conversation?" will appear.
 He> Flow
 I> The "Listen first" command is transitioning to "state transition based on input" to "answer 'yes' and then transition to phase mode".
 he > Input
 I> It's a command that requires one response, so one state is needed.
 He> Reply
 I> So now I'm thinking of adding a feature that says "given a URL-like string that starts with http, crawl it and read it as input".
 He> http
 I> In that case, the input is checked, and if it is http, the crawl process is triggered, and then if it is successful, it acts as if it were an input, and if it is unsuccessful, it returns that it failed.
 He> Failure
 I> Maybe we could even send out a message that it was a success, even when it was a success.
 his> message
 Me> Either way, it's a command that requires one reply, so it would require one state.
 He> state
 I> Also, right now, the behavior in each state is "randomly select from a list of questions, select keywords based on the information in the question, and generate a response", so the crawl function is implemented as a question as it is, which is strange.
 he > Crawl Function
 Me> Ah, I see, there is something wrong with the fact that there is no object that represents the state's information. It doesn't work because you've implicitly decided that the state has multiple question templates from which it randomly chooses to create a response, which is what the state should do.
 he > question template
 Me> I'm convinced, but do you have any other questions?
 He> What?
 I> The end.
 He> I see.
 I> The end.
 He> Where is the program?
 I> running on a server.
 he> What does that server look like?
 Me> Private room. I used to envision multiple people using one server, but the other day in the confessional analogy, I thought that would make some people uncomfortable with the administrator being able to see the logs, so let's see if there is a greater need for easy access to the logs or no logs, and then decide which implementation to go with. I'll decide which one to implement after I find out which is more needed.
 He> What is it that you value?
 I> Question.
 he> What does that question seem to be?
 I> Hooks to get answers
 he> What does the answer seem to be?
 I> Until you take it out, it's buried without you realizing it has value, but when you take it out, it clearly has value and you can pass it on to others.
 he> What happens just before that?
 I> I am asked a question, and my brain spins at high speed in search of an answer.
 He> Is that answer the same as the question? Is it different?
 Me> Answers and questions are different. Questions make answers.
 he> What kind of question is that?
 I> The question is designed to be clean so as not to impose the questioner's ideas on the respondent, and that is why the answer created by the question is considered to be the respondent's own answer.
 He> How do you know the questioner?
 Me> I'm not going to talk too much about design, so I'll end here.
 
 
 I thought I should fix the command being ad hoc, but it was the expression of the state that should be fixed.
 
 *1422443887* Log of experiments discussing systems of knowledge
 2015-01-28 19:07:58
 he> What would you like to see happen in this conversation?
 I> would like some new insight into the body of knowledge.
 He> Is there anything else about that new?
 me> ngkw.
 He> Is there anything else about that insight?
 I> Learning philosophy is burdensome for the human intellect, but in general, anything that is burdensome for the human intellect can be differentiated if it can be done more efficiently than others with the assistance of a machine.
 he> What does that discrimination seem to be?
 me> ngkw.
 He> What does that burden seem to be?
 I> If philosophy is a burden, then a philosophical machine should be born, just as a calculator was born because computation was a burden to man.
 He> How do you know that person?
 I> So, if I wanted to create something more than just a search engine, I needed to create a body of knowledge, and I wondered what that would look like.
 he> What kind of search engine or more is that search engine or more?
 He> Is there anything else you can tell us about that letter?
 Me> No. I was thinking about it from the opposite direction.
 he> Where is that dead end?
 I> If there is something that is a philosophical machine and it is beneficial to the user, by what function is it beneficial?
 He> Where is that philosophy?
 I> In a sense, it's a commercial positioning of philosophy.
 He> How do you know its semantic philosophy?
 me> ngkw.
 he> What does that position look like?
 Me> One very puer value offering is the output of quotes.
 he> What kind of quotes are those?
 Me> The ones that are often tweeted by quote bots, collected on compilation sites, or shared on Facebook. There are a good amount of people who enjoy that kind of thing.
 He> What is it that you value?
 I> A richer value proposition is to notice blind spots. The history of philosophy has been one of repeatedly questioning what we assume to be obvious and what is really so, so it is easier to notice implicit assumptions in our everyday decisions.
 He> How do you know about that blind spot?
 I> If you question everything, it's rather easy to find out, but it's expensive.
 He> Is there anything else you can tell us about that cost?
 Me> How to make something less costly than a total hit would be to extrapolate from historical data to the likely location of what you are looking for. That's Bismarck's "wise men learn from history".
 he> What happens just before that?
 I> To do that, I would first examine the current situation and then look to see if there have been similar patterns in the past.
 he> What happens next?
 I> If a similar pattern is found, then bringing the solution from there to here will help find the solution here. Okay, this is the same composition as problem solving by analogy.
 he> Where is the similarity?
 I> Yes, the challenge is how to find the similarities.
 He> Then what happens?
 I> Just as a search engine was created using string similarity, another search engine will be created using another similarity to search for other data.
 he> What happens to similarity when its a search engine?
 I> Why not the Semantic Web...
 he> What is that semantic web like?
 I> Why is it that there have been various approaches to "create a better system of knowledge" such as mind pixels and so on, but they have not been very successful?
 he> What kind of mind pixel is that mind pixel?
 I> The project is to let the computer acquire common sense by the user going to teach knowledge. After all, shouldn't a program with common sense have had no commercial value?
 He> How do you know about the program?
 I> So we have to create a body of knowledge that has commercial value... so we need a program that we can consult and help solve problems when a program doesn't work, for example, before we have a philosophical system?
 He> Is that program the same as the system? Is it different?
 I> A program is also a system, but the knowledge of how to create that system is also a system.
 He> What does that system seem to be?
 I> When we imagine a network, we assume that vertices and edges are clearly distinguished, but in reality, an edge is also a vertex, and an edge does not connect only two vertices, so I wonder what this is.
 he> What kind of premise is that premise?
 I> A graph in the sense of graph theory is a set of vertices and a set of pairs of vertices, but this is losing a lot of expressive power.
 he> What is the relationship between humans and search engines?
 I> Humans are helped by search engines. It is difficult for the human intellect to remember and quickly recall a vast amount of information, so the machine takes that on its shoulders.
 Is that human being the same as difficulty? Is it different?
 I> What is easy is in ample supply, and under a market economy it becomes less valuable, so what is valuable can only be found in difficulty. People make a living by working through difficulties and making them less difficult.
 he> its enough what do you hope will happen?
 I> NG
 he> What kind of difficulty is that difficulty?
 I> Where human needs exist and have not yet been met.
 he> What should happen to that desire?
 I> I hope it fills you up.
 He> What needs to happen to desire for that to happen?
 Me> Desires don't change, people with desires need to act to fulfill them.
 He> can that desire it?
 I> desire is not what I do.
 He> How do you know what that desire is?
 I> In general, I interview customers or observe the market closely. But in this case, it is easy to understand because it is my own desire. I want to understand more things, but my physical human body has an upper limit to the speed of input, and I cannot learn everything I want to learn while I am still alive. Therefore, it is necessary to speed up the process with the assistance of machines.
 he> What happens next?
 I> If you speed up the rate at which you learn, you'll understand what you need to understand faster than anyone else.
 He> How do you know its fast?
 Me> Indeed, what speed is measured by is a difficult question. Measuring it by the number of books read is a silly metric.
 he> What should happen to that number of books?
 I> As an approximation, more books would be better.
 he> What would need to happen to that number of books?
 I> NG
 (The program has run amok.)
 </body>

[Hatena Diary 2015-01-28 https://nishiohirokazu.hatenadiary.org/archive/2015/01/28]