Hatena2008-09-06
code:hatena
 <body>
 *1220663961*To Echigo Yuzawa
 
 I have an hour to spare. I avoided the flag of oversleeping and being late. Now it's time to sleep over. I'll make sure my phone vibrates before I arrive.
 
 We arrived at the station safely. We find out what to do from here.
 
 I arrived at the venue without incident. I brought a projector cable for my Mac and a timer for myself. Is this a flag that there will be machine trouble during the presentation?
 
 I had a lot of trouble connecting my Mac to the projector.
 
 *1220679152*End of announcement
 They had to go and make handouts.
 
 To sum up the presentation in one word: condescending Hello, world!
 
 **1220679924* Five Troubleshooting Tips for Presenting in KeyNote
 - The option for the presenter's screen on the presenter's side should be ON by default, but if it's not, then "Presenter's Display" in KeyNote Preferences.
 - If the presenter's screen appears on the projector side, go to "Slide Show" and then "Show Presentation on Sub Display".
 - If nothing appears on the screen to begin with, try setting the resolution to 1024x768 in "Display" in System Preferences.
 - If the screen shows the same screen as the MacBook, uncheck "Clone" under "Display".
 - If the cable adapter does not work when you remove and insert it after it has worked, just remove the cable with the adapter still attached while it is still working.
 
 With this, I managed to make my presentation. It's nice and easy to see the next slide during the presentation.
 
 *1220682043* Prosin Memo
 - Structured Programming with go to Statements [Knuth]
 - Note that "design for whom" may also discourage flexible thinking
 - Processor design requirements are shifting from a focus on speed to a variety of values such as power savings.
 - There was a time when "CPUs were very expensive, so let's use many."
 - As of 2006, Minix 3.1.2 has a core of 4000 lines
 - Not only system calls, but also API calls tend to be regarded as OS function calls, and even the GUI is called an OS in general.
 - Simple code is not always faster.
 - Sketchpad (1963) First GUI to be published in a paper
 - Alto(1973) It had 512KB of memory.
 - It's kinder to enumerate the undignified than to define dignity.
 - William R. Floyd (1978) Turing Award Memorial Lecture
 >||
 # Mistakes beginners often make
 for ...
    x = f(x, y)
    y = g(x, y)
 ||<
 
 >||
 # These things should not be done by humans.
 for ...
    tmp = x
    x = f(x, y)
    y = g(tmp, y)
 ||<
 - Fail-safe C
 -- CCured: syntactically ANSI compliant, but semantics not yet
 - Article 29 of the Patent Law rejects anything that does not use natural phenomena.
 - that software uses the laws of nature by relating them to hardware.
 - Easy to use Selenium for web-related automation
 - Monte Carlo Tree Search
 -- Upper Confidence Bound
 - statistical least cost method
 - http://cl.naist.jp/~mamoru-k/chaime/
 - bill payment date and time, market research to be conducted soon, should have brought it in the first place, hot buns with a crunchy texture
 - Kotoeri is doing surprisingly well.
 - "You can do this level of kana-kanji conversion if you write 200 lines in Python, and the great thing is the corpus of 200 million sentences that Google has collected."
 - [obinata] I didn't think I'd write so many programs, I thought programs just had to work, now I'm copying and pasting.
 - The Advantage of Abstract Example in Learning Math[2008]
 -- Teaching with concrete examples is less applicable than teaching with abstract examples.
 -- Abstract talk after teaching with concrete examples does not make it better than concrete examples alone.
 --- Do you develop strange habits?
 - Modify the code and forget to modify the comments so you can see the date you wrote it.
 - It's not a mistake to say, "If it works, it works." If it really works, that's all that matters. It's not easy to say, "Just move.
 
 - Lv0: I can listen, Lv1: I can't understand after listening, Lv2: I can understand after listening, Lv3: I can understand without listening
 - A code that a lvl 3 person can understand without having to listen to it is a classy code.
 - Using Jeannie is easier than tapping JNI directly
 - SQS : Shared Questionnaire System http://sqs-xml.sourceforge.jp/
 -- It seems very useful for jobs that have a need to tabulate paper questionnaires. It seems to be open source.
 - exorcism ceremony
 -- People who can't talk about bugs in an interesting and to the point way are not qualified to create bugs.
 - Vulnerability in Debian OpenSSL
 -- A variable that had not been initialized was plugged in during initialization. The variable was removed without understanding that it might contain garbage, but if it did, it would be tasty, so we put it in.
 -- #ifndef PURIFY or something like that, that would have meant "PURIFY may give a warning here, but it's intentional," but it didn't get the message.
 - Don't use Mersenne Twister or anything like that in the cipher. It's an incremental formula, so it's easy to figure out.
 - Goal pool representation is parallel oriented
 - I/O is done by guards.
 - Streamlt: A Common Machine Language for Grid Architectures
 </body>
 <comments>
 <comment>
 <username>earth2001y</username>
 <body>Are there any flags up, like wrong train to get on or unknown venue? </body>
 <timestamp>1220667900</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-09-06 https://nishiohirokazu.hatenadiary.org/archive/2008/09/06]