Hatena2007-12-18
code:hatena
 <body>
 *1197942744*woo
 mad
 
 *1197942859* Chill out.
 Not sleeping is not good when you have an event this afternoon...
 
 *1197946760*1000 Speakers The Wiki for the project is now available.
 http://ja.doukaku.org/wiki/index.php/1000speakers
 
 It's obvious from the URL, but I'm borrowing from the org's server to write how.
 
 This is my first time to do anything serious with MediaWiki (I've only done things like correcting wrong commentaries on Wikipedia), but this is a very sophisticated tool. I tried to create a page called 1000speakers:1 by mistake and created 100speakers:1, but when I changed the name, the link to that page was automatically redirected. The refactoring function(?) I guess the refactoring function is so strong that it is hard to make a mess even if a lot of people are messing around with it.
 
 There are still a lot of things I don't understand, but I'm thinking of moving forward slowly.
 
 *1197948076*MediaWiki navigation
 It should be as swell as Wikipedia, perhaps.
 I'll think about it next time because I've been up all night and can't think straight.
 
 *1197948236*Conference Information Accumulation
 >>
 earth2001y 2007/12/18 02:42 Can we make a summary site or a wiki to consolidate information from all over the place?
 <<
 
 Just as the Wiki of the 1000 Speakers Project only uses the namespace 1000speakers on the Wiki, maybe we could create a namespace to collect conference information, such as conferences:.
 
 *1197949955* Eelism
 The doctrine that "no matter how sick you are, eating eels will fix everything."
 
 Also, it's in the vitamin teaching.
 
 *1197951559* offline
 I've been told to come early, so it's time to go.
 
 *1197986735*Dismissed.
 
 I slept for about an hour at the after-party.
 </body>
 <comments>
 <comment>
 <username>nokuno</username>
 <body>Thank you for your time</body>.
 <timestamp>1198086871</timestamp>
 </comment>
 </comments>

[Hatena Diary 2007-12-18 https://nishiohirokazu.hatenadiary.org/archive/2007/12/18]