Hatena2012-06-15
code:hatena
 <body>
 *1339765471* Board Game Barbarossa + Time Trial Debugging Exercise
 I note that I thought it would be interesting to mix Barbarossa and time trial debugging exercises.
 
 Barbarossa is a game like this: <a href='http://www.tk-game-diary.net/barbarossa/barbarossa.html'>Barbarossa - Board Game Review</a>. A game in which everyone makes a clay sculpture and submits a question, and everyone else guesses what it is. The important thing is the score table in the middle of the page.
 
 >>
 Those who answer correctly will receive points.
 1st run 5 points
 Second run 3 points
 
    In addition, the person who made the clay sculpture also gets points. Count the number of arrows stuck in all the clayworks on the board. The number of arrows stuck in each claywork is counted, and the score is either positive or negative depending on the number of arrows stuck in each claywork.
 1st to 2nd run -2 points
 Third run -1 point
 4th run 0 points
 5th-6th 1 point
 7th-8th run 2 points
 9th run 1 point
 10th run 0 point
 11th run -1 point
 12th-13th run -2 points
   In short, if you get hit too early or too late, you will receive a minus point.
 <<
 
 In other words, it's a game where everyone is a questioner and then everyone is a respondent. As a respondent, the faster and more answers you give, the higher your score. Therefore, it has a high affinity with time trials. As for the contestants, they are under pressure to make questions of moderate difficulty, because "if it is too easy or too difficult, points will be deducted.
 
 The time trial debugging exercise is here: <a href='http://d.hatena.ne.jp/nishiohirokazu/20110815/1313395069'>Security & Programming Camp "Find the Bug in Ruby" Problem</a>. I put a bug in Ruby in advance, and the participants have to find where the bug is in a time trial.
 
 This is what happens when you mix the two.
 
 - First, all participants should put a bug in some processing system, either Ruby if all participants are Ruby users, or git if participants are from various languages. At this time, the change should be limited to rewriting only one line.
 - Register the bug in the intermediary system.
 - The time trial competition begins. Everyone downloads the buggy code from the system and looks for their own bugs.
 - Once found, send the file name and line number to the system. The system determines if it is correct and grades it.
 - Scores are added in Barbarossa style, with two types of scores: correct answers up to the first two correct answers for each question, and the contestant's score for questions answered in the middle of the match.
 - The current scores of everyone are displayed graphically on the projector in front of you.
 - At the end of the pre-determined time, the winner will be the top winner at that time.
 - As a feedback game, problems that few people were able to solve are explained by those who were able to solve them. The person who solved the problem will give an explanation, not the person who created the problem.
 - Maybe we can make it a team game.
 
 I think it would be rather interesting.
 </body>

[Hatena Diary 2012-06-15 https://nishiohirokazu.hatenadiary.org/archive/2012/06/15]