Hatena2017-01-03
code:hatena
 <body>
 *1483441414* Book Review: The Dreaming Program
 I received this from the author, Dr. Kato, a long time ago, but I have been busy with various things, so I am late in introducing it.
 
 This book is written by Shinichi Kato, who launched "Artificial Anencephalon Thinks" in 1999 and has continued to research and discuss "software that talks to humans" (artificial anencephalon). Especially in chapter 2, he gives a very good 21-page overview of the 50-year history of artificial anencephalon, starting with Eliza. When a conversation framework using artificial intelligence is introduced with much fanfare, if you look at the contents and see that it is rule-based, you might be tempted to say to yourself, "Is this "Yuibotto" or something? I would be tempted to say to myself, "Oh, it's a rule-based framework! But it was 1996, so it's already 20 years ago.
 
 It seems to me that it was already known at that time that as rule-based artificial brains grow up, the "sense of smartness per additional rule effort" gets closer and closer to zero, making it impossible to maintain the motivation of the rule makers. In the field of machine learning, a similar problem of exponential decline in "improvement in accuracy per additional effort of teacher data" is known, and approaches such as active learning have been developed to cope with this problem. If you think that the framework has been improved by incorporating such knowledge, but it is still the same rule-based framework as it was 20 years ago, you may be tempted to say, "Is this "Yuibyotsu"? I would be tempted to say, "Oh, "Yuibyotsu"!
 
 Chapters 3 and 4 use about 90 pages to explain the basic rule-based artifacts while actually implementing them. The first part, "creating a stage setting and character setting," was an idea that I had never thought of before, and it was an eye-opener for me. In the latter half of the chapter, I enjoyed the approach of trying to approximate the context with Markov approximations as a way to deal with the "topic does not continue if you only respond to the previous statement," which is common in rule-based artificial anencephaly.
 
 <a href='http://amzn.to/2iZHvKb'>Dreaming Program: Conversation and Mind Algorithms Examined with Artificial Anencephaly and Chatbots</a>
 
 *1483446380*Cat Lure Fishing
 I published a video of cat lure fishing and was asked what kind of toy it was.
 <blockquote class="twitter-tweet" data-lang="ja"><p lang="ja" dir="ltr">Cat Lure Fishing <a href="https://t.co/kk4u0Cu33K">pic.twitter.com/kk4 u0Cu33K</a></p>&mdash; nishio hirokazu (@nishio) <a href="https://twitter.com/nishio/status/816257875802660864">January 3, 2017</a></ blockquote>
 <script async src="//platform.twitter.com/widgets.js" charset="utf-8"></script>
 
 <a href="https://www.amazon.co.jp/Austrake-Austrake-%E7%8C%AB%E3%81%98%E3%82%83%E3%82%89%E3%81%97-%E7%BE%BD%E3%81%AE%E3%81%8A%E3%82%82%E3%81%A1%E3%82%83-%E4%BC%B8%E3%81%B3%E7%B8%AE%E3%81%BF%E3%81%A7%E3%81%8D%E3%82%8B-%E3%81%98%E3%82%83%E3%82%8C%E7%8C%AB-%E9%87%A3%E3%82%8A%E7%AB%BF/dp/B01M0E3T2O/ref=as_li_ss_il?s=pet-supplies&ie=UTF8&qid=1483447969&sr=1-1&keywords=austrake&linkCode=li2&tag=nishiohirokaz-22&linkId=630403a55fd0a4735a889f47fd8186bf" target="_blank"><img border="0" src="//ws-fe.amazon-adsystem.com/widgets/q?_encoding=UTF8&ASIN=B01M0E3T2O&Format=_SL160_&ID=AsinImage&MarketPlace=JP&ServiceVersion=20070822&WS=1&tag=nishiohirokaz-22" ></a><img src="https://ir-jp.amazon-adsystem.com/e/ir?t=nishiohirokaz-22&l=li2&o=9&a=B01M0E3T2O" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" />
 The one called <a href="http://amzn.to/2iKQgZ1">Austrake</a>.
 <del><a href="http://amzn.to/2hMSNVE">Da Bird</a>. </del>
 
 I put a replacement feather in my <a href="https://www.amazon.co.jp/gp/registry/wishlist/2SACBCWE1RIH3/ref=cm_wl_it_del">cat wish list</a>, but it's pretty expensive, so I'm thinking of buying some feather material and making my own. I'm thinking of buying some feather material and making my own.
 </body>

[Hatena Diary 2017-01-03 https://nishiohirokazu.hatenadiary.org/archive/2017/01/03]