Hatena2014-08-12
code:hatena
 <body>
 *1407813008* Non-linear Order Interview
 <a href='http://cybozushiki.cybozu.co.jp/articles/m000316.html'>The second episode of the Cybozu-style "How to Learn to be a Continuing Engineer" is now available. </a> We will be interviewing Mr. Ozaki over the next 8 episodes.
 
 By the way, at the current pace of serialization, it seems to take a little time before I can see "what I want to do". So here I would like to explain the blueprint I am drawing.
 
 
 For some time to come, we will be conducting interviews and publishing them as articles, but we do not consider this to be the final output. If we consume the interview articles as content and that is the end of it, what we get for our n efforts is only on the order of O(n).
 
 You explained in <a href='http://gihyo.jp/lifestyle/feature/01/engineer-studying/0003'>How Engineers Learn</a> that "comparison" is a way to understand deeply. What I want to do in this project is to compare different engineers' ways of thinking to understand them deeply. For example, in the first interview with Mr. Kozaki, we are told that a certain method X is better. However, in the second interview, the second interviewee says that method Y is better, and X and Y are in completely opposite directions. What makes the difference? When is X better and when is Y better? This is the kind of new combination we want to create.
 
 As the number of articles increases on the order of O(n), the chances for joins between them increase on the order of O(n^2). Moreover, by publishing the original data for the coupling, the number of readers' eyeballs m comes into play as a coefficient. If we include the coupling with the reader's experience, it will be much larger than the O(n) of the article. Here is my aim.
 
 In fact, after publishing the first episode, I received feedback from a reader about my interest in the project. It hit my blind spot, and after doing a little preliminary research, it looks like it could be quite interesting. As I accumulate more articles in the future, I am sure that opportunities for "unexpected new connections" like this will increase. I am very much looking forward to it.
 
 
 Three-line summary
 - Articles are not the final output, but material for finding new bonds
 - What I want to get out of this project is a new union, and feedback is welcome because it encourages it!
 - This project is a place to <a href='http://markezine.jp/article/detail/20518?p=3'>"communicate" and "listen" at the same time. </a>
 </body>

[Hatena Diary 2014-08-12 https://nishiohirokazu.hatenadiary.org/archive/2014/08/12]