Hatena2007-10-20
code:hatena
 <body>
 *1192848292*Citation Notation Test
 
 >||
 print '>>|\n__a))\n||<'.replace("_", "(")
 ||<
 
 >||
 ((a))
 ||<
 
 >||
 /^(([0-2]*[0-9]+[0-9]+).([0-2]*[0-9]+[0-9]+).([0-2]*[0-9]+[0-9]+).([0-2]*[0-9]+[0-9]+))$/
 ||<
 
 >||
 /^(([0-2]*[0-9]+[0-9]+))$/
 ||<
 
 
 Okay, yesterday's one seemed to have a half-width space after the >||. Fixed.
 
 *1192866966*USB flash drive
 
 When I plugged the USB memory stick into the machine and thought it was not being recognized, I found that it was plugged into the Ethernet cable. No luck there.
 
 *1192868694*Coming to work
 When I arrived at work, the light was on and id:amachang was lying in the refreshment corner, wondering if I had forgotten to turn it off in my haste yesterday.
 
 *1192870054* how to write org bug
 >||
         if code_html and lang:
             lang = models.Lang.objects.get(slug="other")
 ||<
 
 This is terrible. I can only assume he wrote it while dozing off.
 No matter how hard I try, "if code_html and lang:" does not read "if code is written and language is not specified" ORZ
 
 I added the word "not."
 
 **1192871955* Evolutionary Design of Databases
 
 http://www.objectclub.jp/community/XP-jp/xp_relate/evodb-jp
 
 Overview - What you can do with Jiemamy - Jiemamy Wiki @ SF.com
 http://sourceforge.jp/projects/jiemamy/wiki/%E6%A6%82%E7%95%A5%EF%BD%9EJiemamy%E3%81%A7%E4%BD%95%E3%81%8C%E3%81%A7%E3%81%8D%E3%82%8B%E3%81%AE%E3%81%8B
 
 Development Process with Jiemamy - Jiemamy Wiki @ SF.com
 http://sourceforge.jp/projects/jiemamy/wiki/Jiemamy%E3%82%92%E4%BD%BF%E3%81%A3%E3%81%9F%E9%96%8B%E7%99%BA%E3%83%97%E3%83%AD%E3%82%BB%E3%82%B9
 
 *1192879938* Hatsune Miku
 Do those who insist, "Why don't you hire a singer without using Hatsune Miku" think "Why don't you hire a player without using MIDI?
 MIDI has made it possible for individuals to do things that would otherwise require hiring a large number of people, and it has made it possible to easily achieve superb techniques that would be difficult even with the help of a skilled player. The same thing is about to happen to singing.
 To be honest, Hatsune Miku is still in its infancy. I sometimes feel frustrated when I use it and wonder if it would be better if the vowels could be created synthetically instead of just by phoneme selection. But no matter how much money you put into a live person, they cannot smoothly change the gender factor while singing. It wouldn't be surprising if someone could pull off such a "a human can't do this" thing.
 Although the current Hatsune Miku has only a few settings and is still difficult to use, other "technologies that have not seen the light of day" are sure to appear from time to time as they realize the existence of the market thanks to the huge success of Hatsune Miku. It will be interesting to see how the new version of Hatsune Miku will evolve.
 
 *1192885105* Running multiple Django projects with one Apache
 The <a href="http://michilu.com/django/doc-ja/modpython/#apache-django">Running Django with mod_python : Django online documentation in Japanese</a>, "Multiple Installing multiple Django installations on a single Apache" is the correct answer.
 I went through it thinking, "I only need one Django..." but this was the right answer.
 
 Do I have to separate them by virtual host to get there? I thought so, but all I have to do is to specify different values of "PythonInterpreter" within one virtual host.
 
 >||
 NameVirtualHost *
 
 <VirtualHost *>
 ServerName ja.doukaku.org
 
 <Location "/">
     SetHandler python-program
     PythonHandler django.core.handlers.modpython
     SetEnv DJANGO_SETTINGS_MODULE doukaku_proj.settings
     PythonInterpreter doukaku
 </Location>
 
 <Location "/misc/lingrsearch/">
     SetHandler python-program
     PythonHandler django.core.handlers.modpython
     SetEnv DJANGO_SETTINGS_MODULE lingrsearch.settings
     PythonInterpreter lingrsearch
 </Location>
 (hereinafter abbreviated)
 ||<
 
 *1192889005* What should we do about crawler protection?
 I've been getting a huge amount of access (for a short period of time) to the org I write about, the load average has been over 20 for a short period of time, I've been getting error mails that the database is locked, and I've been getting slow response times when working over SSH. I wonder if I should do something before they crawl the site in earnest, such as fumigating IP addresses that throw more than 60 requests per minute.
 
 
 </body>
 <comments>
 <comment>
 <username>ZIGOROu</username>
 <body>First, take measures with robots.txt. </body>
 <timestamp>1192903091</timestamp>
 </comment>
 </comments>

[Hatena Diary 2007-10-20 https://nishiohirokazu.hatenadiary.org/archive/2007/10/20]