Hatena2009-09-20
code:hatena
 <body>
 **1253442887*Infomation Science Young Scientists' Association First Press Freeze and Spew Incident
 http://www.youtube.com/user/nishiohirokazu#play/all/uploads-all/0/GfibbN7R6cY
 
 As it turns out, the taste is extremely intense, even though the texture is completely beer foam. Just like how frozen Pocari Sweat is very strong at first when you drink it mixed with frozen Pocari Sweat, the beer ingredients are concentrated.
 
 Judging from the related videos on Youtube.
 <img src="http://gyazo.com/8c0ed195b9ac44a2159b2a56f2020934.png">
 It's like they just didn't realize it, but now it was contemporary art!
 
 <hr>
 
 PS: I drank the melted beer after this and the top was very thin. Shake it well and drink it. (Yeah.) If you mix it, it tastes like normal beer. The carbonation is gone, though.
 
 **1253446948* Google Group for the Association of Information Science Struggles is now available!
 <img src="http://gyazo.com/efd32f4eb6920149c7f56eb8b579cb9d.png">
 <a href='http://groups.google.co.jp/group/nigate'>Information Science Struggle Group | Google Group</a>
 
 >>
 We've been told that boasting about being bad at something is not productive. We all have things we're not good at! People need to support each other, or less is less!
 <<
 
 **1253448143*Memorandum for Young Scientists in Information Science
 Reprinted from Twitter
 
 >>
 Security is holistic, so it's easy to align interests and easy to protect, but privacy is individualistic and difficult to protect because people vary in 'what they don't like.'"
 <<
 
 >>
 WEP encryption can be broken in an instant, so there is no longer any point in having a password; WPA cannot be used in ad hoc mode; and WPA is not supported on the Nintendo DS, which wants to communicate with other devices. The Nintendo DS, which wants to communicate with other Nintendo DS users, supports only WEP, so it cannot connect to WPA.
 <<
 
 >>
 Current Threats" to Wireless LANs http://pc.nikkeibp.co.jp/article/column/20090820/1017930/
 <<
 
 >>
 The importance of seeking understanding." "I was running ftp.kuis as a volunteer, but it was perceived as a service that I was doing for business."
 <<
 
 >>
 The key to watermarking is that you can't tell which part of the information is the watermark when you look at it, but when multiple people gather together, they can compare and reveal which part of the information is the watermark. Collusion attack. That's where the collusion resistance code comes in.
 <<
 
 >>
 I was running ftp.kuis as a volunteer, but it was perceived as a commercial service, and I had to publicize it to the world.
 <<
 
 >>
 70% of municipalities do not have dedicated information processing staff.
 
 The Basic Resident Ledger servers were originally owned by local governments across the country, but vendors and formats varied so much that it was not possible to consolidate them across the country. Therefore, the data was converted, duplicated on a server called CS, and exchanged. All information is stored on a higher-level server as a backup, so all information is gathered on the "national server.
 
 The Basic Resident Ledger servers themselves were originally located in municipalities throughout Japan, and some of them are in a sloppy state of management, with servers left under desks, for example. The basic resident registry servers themselves were originally located in municipalities across the country, and some of them were sloppily managed, with servers left under desks, for example.
 
 The most used benefit of Juki Net in terms of number of cases is that "you don't have to order your resident card when you reissue your passport."
 <<
 
 **1253448593*Information Science Young Scientists' Group: notes on a talk by a person from Rarirero Corporation.
 Reprinted from Twitter
 >>
 -new task=unsolvable or unsolvable,.
 -Not new task
 --Resulting tasks: one step at a time
 --Tasks that don't appear: a little bit because it breaks your heart if you take it in with all your might.
 --tasks that don't need to be given out: avoid at all costs, do 1 out of 10
 <<
 
 >>
 'Does a task that doesn't require you to produce results mean that you're not being asked to produce results?' No, it's a case where someone who wants results is demanding content that it's not necessary to produce."
 <<
 
 >>
 The project is called "Putorocol."
 <<
 
 >>
 Effects and probabilities are easier to explain if they can be reduced to Japanese yen.
 <<
 
 >>
 When you try to do something great, it's usually a pain in the ass, and if something troublesome shows up, just think of it as a monster showing up.
 <<
 
 >>
 A daily "what I was doing at what time" memo is surprisingly useful. Also, I'm usually the one who runs into the same errors, so I take notes on the errors I run into.
 <<
 
 >>
 If you've been using one site or one interface for a long time, be skeptical. Surely I can create something better than what I have now."
 
 'Think about marriage. You can see a lot of things when you envision being married to someone who doesn't have the capacity to make a living."
 
 I'll try to have more friends outside the organization than inside the organization I'm in.
 
 Find people who are better than you, get to know them, and emulate their good qualities."
 
 When I'm depressed, sitting at Shibuya Crossing for a day gives me the courage to live." mjd!
     
 You should change your lab, your school, oh, and your company."
 
 The analysis of data done by others can be arbitrary. If you look at the actual data and think about it for a minute, the numbers can be interpreted very differently."
 
 If you leave people who don't understand without understanding, it will come back to haunt you later."
 
 'The more internal documents you read that don't seem relevant to you, the better.'
 
 'You get better at what you do in your spare time. If you watch Nico Nico Nico in your spare time, your skill at watching Nico Nico Nico improves."
 <<
 
 **1253448504* "People who are good for humanity but not for those around them"
 I am writing this article because it would be a shame to bury the Twitter conversation at the Young Scientists in Information Science meeting.
 
 >>
 nishio: as a senior in life, I'd like to hear Dr. @tetsutalow's opinion on the current announcement! > I don't know about leaving heartless people, but that's not my opinion.
 <<
 
 >>
 tetsutalow: There's a difference between being heartless and having malicious intent. There are a certain number of people who are good for humanity but not for the people around them // I think we have to support them for the sake of humanity, because only the people around them can support them...
 <<
   
 >>
 nishio:
 @tetsutalow "There are people in the world who have good research skills but lack the ability to take care not to hurt others. We don't need to disassociate ourselves from such people." If that is what you mean, I agree with you 100%.
 
 Good story RT @tetsutalow I think we have to support such "people who are for humanity but not for others" for the sake of humanity because only others can support them...
 <<
 
 Humans tend to assume that other people are "just like us," but in reality, people other than ourselves are never 100% identical in "word meaning," "what we find offensive," or "what we value." There can be "mindless behavior" without malice.
 </body>
 <comments>
 <comment>
 <username>hatizero</username>
 <body>Nice to meet you. <BR><BR>Speaking of spewing, I have heard the same story about putting Mentos in Coke. <BR>If you put Coke in a freezer, it gushes inside the freezer and puts a hole in the door...etc. <br>There are a lot of interesting drinking water around. <BR><BR><BR>By the way, I actually flew over when I heard that you were the person who created the translated text for <BR>did you know 3.0. <BR>Did you know 4.0 seems to be ready. <br>http://www.youtube.com/watch?v=6ILQrUrEWe8<br><br>If you are interested, I would like to ask you to translate again. <br>See you then. </body>
 <timestamp>1253499005</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-09-20 https://nishiohirokazu.hatenadiary.org/archive/2009/09/20]