Hatena2008-09-28
code:hatena
 <body>
 *1222569120*Cold
 
 I arrived 15 minutes before the opening and had to wait outside. I was glad that I had a tissue with me, but it was a problem because my nose was dripping. I had only one pocket tissue, so I had to be careful not to use too many.
 
 *1222603161*Diary with snot
 Nikki with flowers.
 
 Yah, I thought my cough had calmed down around the end of last week, but now I have a runny nose. I feel like I've had a cold-like situation for about two weeks.
 
 Since it is a diary, I write about random things in a rambling manner.
 
 I felt that only books were out of my financial sense. <I finally bought a similarly priced electric kettle from T-fal. I finally bought a similarly priced electric kettle from T-fal, and I am happy with its convenience.
 I wanted to use OProfile, but I got the vibe that it only works with Linux, so I started thinking about getting Linux on my Mac and ended up at <a href=' http://d.hatena.ne.jp/wadap/20080720/1216541500'>Linux Starting on a Mac - My First VMware Fusion (Ubuntu Installation) - Unix-like Thing</a>. Should I still buy VMWare Fusion? If I can run Win, Linux, and Mac on a single laptop, I'll be fine for the time being.
 
 **1222609347*Chinese Extravehicular Activity
 http://d.hatena.ne.jp/sakusan_net/20080928/1222589691
 
 Aside from seeing bubbles floating in the Chinese EVA video and such, here is an image retrieved from NASA's photo library (<a href="http://nix.larc.nasa.gov/home">NIX</a>)
 
 http://images.jsc.nasa.gov/lores/S84-27017.jpg
 http://images.jsc.nasa.gov/lores/STS063-21-011.jpg
 
 What I am trying to say is, "It is natural that the starry sky does not show up in the background of an EVA video. This is because stars are overwhelmingly darker than objects illuminated by lights. If you have ever tried to take a picture of a lit up building at night with a starry sky in the background, you have probably experienced this. It's kind of like the comments on the video have a lot of people saying, "What about the stars?" I thought I'd just poke my head in and see what people are saying.
 
 Other Photos
 http://images.jsc.nasa.gov/lores/STS51A-104-046.jpg
 http://grin.hq.nasa.gov/IMAGES/SMALL/GPN-2000-001420.jpg
 
 Well, I'm not an expert on space, so I won't go into "what are those bubbles" or "how in the world did they get the light to shine so evenly? I don't know much about space, so I don't pursue such questions as "What are those bubbles? Until someone can give me a convincing explanation that this is an image shot in outer space, I will assume that it is an image of the inside of a swimming pool, and that the uniform light is due to the indirect lighting on the wall of the pool.
 
 P.S. Yes, I was searching for extra-vehicular activities in NASA's photo gallery and found many underwater images. So they train underwater? I wonder if they took that video for broadcast in case the actual EVA didn't go well.
 </body>
 <comments>
 <comment>
 <username>kyoheif</username>
 <body>I guess you don't have to buy VMWare Fusion, you can just use VirtualBox (http://www.virtualbox.org/) I have Windows XP in it, no problems. not sure about Linux though. </body>
 <timestamp>1222608011</timestamp>
 </comment>
 <comment>
 <username>jbking</username>
 <body>Q (Qemu for Mac OSX) and VirtualBox, which have already been mentioned, are options, but Fusion has a good reputation because it is a product. </body>
 <timestamp>1222608207</timestamp>
 </comment>
 <comment>
 <username>tgbt</username>
 <body>I think such nishio-san should go to JAXA in Tsukuba next time! </body>
 <timestamp>1222694602</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-09-28 https://nishiohirokazu.hatenadiary.org/archive/2008/09/28]