Hatena2010-02-27
code:hatena
 <body>
 *1267239281* What does innovation mean?
 >>
 Organizations are diverse. Their structures, businesses, personalities, organizations, and philosophies are diverse. However, organizations that innovate share some common characteristics.
 1: Know what innovation means.
 (Abbreviation)
 Meaning of Innovation
 Innovation is value, not science or technology per se. It is the change it brings to the outside world, not within the organization. The measure of innovation is its impact on the outside world. Therefore, innovation must always be market-focused. Product-focused innovation, not market-focused innovation, may produce novel technologies, but the results will be disappointing.
 <<
 Translated by P. F. Drucker, edited by Atsuo Ueda <a href="http://www.amazon.co.jp/gp/product/4478410232?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative= 7399&creativeASIN=4478410232">Management - Fundamentals and Principles [Essential Edition]</a> pp. 266-267
 
 My previous entries: <a href='http://d.hatena.ne.jp/nishiohirokazu/20091015/1255636108'>Leverage Memo: Innovation Dilemma</a>, <a href='http://d.hatena.ne. jp/nishiohirokazu/20100222/1266864838'>An explanation of disruptive innovation in 3 lines</a>, I was thinking that many people misunderstand "innovation = new technological advancement". From the "pursuit of technology without regard for the market," which engineers love to do, new technologies may emerge, but they will not be successful as innovations.
 
 The reason why some people are unable to understand the core of Christensen's "Innovation Dilemma" that "innovation can occur even in the absence of technological progress, with products that are inferior in terms of performance," and rely on inferences from examples, may be because they misunderstand that innovation = new technological progress in the first place. I guess.
 
 >>
 Innovation is not about invention. Nor is it a concept solely about technology. It is about the economy.
 <<
 A more direct explanation is given on p. 18. It also says that developing new products is not essential for innovation, but that, for example, "selling refrigerators to the Inuit for freeze protection" is innovation. I'm not going to transcribe it because it's too tedious. According to Schumpeter's definition, the development of new customers is an innovation, so I guess this would fall under that category, too.
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=FFFFFF&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=4478410232" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe><iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=FFFFFF&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=4478000646" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe><iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=FFFFFF&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=4478300720" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 Personally, I think this "Conditions of a Technologist" would be interesting for a technologist like me, but I'm holding back because reading this from the beginning would be a convenient way to read it.
 
 *1267244189*Re: Few people know how to listen to radio? : Diary of a Locator President
 <a href='http://blog.livedoor.jp/kensuu/archives/51008538.html'>A few people know how to listen to the radio? : Diary of a Locator President</a>.
 
 Recently, I was told that turning on the radio when I wake up stimulates my brain and prevents me from falling asleep a second time, so I got a radio to listen to while I was at it.
 
 I have built germanium radios, and I know that FM is frequency modulation and AM is amplitude modulation. But I don't know which program is on which frequency, and I don't even know if it's FM or AM that I'm listening to right now in the first place. Because I don't feel the need to. I don't think I can turn back the dial that adjusts the receiving frequency, so I haven't tried it. I recognize it as a machine that produces sound when the power switch on the side is turned on.
 </body>

[Hatena Diary 2010-02-27 https://nishiohirokazu.hatenadiary.org/archive/2010/02/27]