Hatena2009-03-05
code:hatena
 <body>
 *1236236269*家事(水漏れ修理)
 I've been thinking about this a lot, and I don't think I can turn it with pliers.
 f:id:nishiohirokazu:20090305155829j:image
 I wonder if I can pinch it from an angle.
 
 >>
 Water pump pliers
     These are pliers with a 30-45° bend in the direction of the opening. As the name implies, these are used for construction work in places where the hand is narrow, such as household water and gas pipes.
 <<
 
 I see. So this is exactly the kind of tool for this kind of situation.
 
 
 I bought water pliers. I tightened them for now. But it still leaks a little. According to the description of the water pliers, this is because the U-shaped packing inside is worn out. Tomorrow, I will tighten the main valve, disassemble it, take out the U-shaped packing, and go buy the replacement parts.
 
 >>
 id:HolyGrail As for the water leak right after you move in, if you report it to the real estate agent, the landlord should be contacted from there and the contractor should be able to fix it, but I wonder if you were able to fix it yourself.
 <<
 
 The fact that leaks do not occur under normal use (water pressure through the water purifier causes leaks) and the engineering mindset of wanting to fix it yourself tickles me (see below).
 
 <hr>
 
 f:id:nishiohirokazu:20090305212245j:image
 
 We need another shelf board.
 
 <hr>
 
 There is some kind of "bum bum bum" sound. Hmmm. I wonder if it's the washing machine.
 
 **1236252726*Start external program from Emacs and pass buffer contents via stdin
 id:Yoshiori asked me about it, and I searched and found what it was that I had done before, so I linked to it to make it easier to find in the future.
 http://www.nishiohirokazu.org/blog/2006/12/grineditmeadow.html
 
 >|lisp|
 (defvar GRINEDITPY "c:\\meadow\\grinedit_modVertex.py"
   "*The command to send query to grinedit")
 
 (defun grinedit ()
   (interactive)
   (call-process-region 
    (point-min)
    (point-max)
    GRINEDITPY))
 
 (define-key global-map "\C-cg" 'grinedit)
 ||<
 >>
 In other words, we are invoking grinedit_modVertex.py and filling the standard input from the beginning of the buffer to the end of the buffer.
 <<
 </body>

[Hatena Diary 2009-03-05 https://nishiohirokazu.hatenadiary.org/archive/2009/03/05]