Hatena2008-05-14
code:hatena
 <body>
 *1210726250*Slimy...
 
 What's with the cold?
 
 *1210730737*"Latest Title"
 I just noticed that the "newest titles" in the sidebar -> are not in order of newest to oldest.
 If this were in the order of newest to oldest, it would solve most of the problems that id:amachang says "it's hard to scroll down to the newest entry to find it".
 
 *1210775848*半蔵門線
 
 The schedule is being disrupted. Oops. If I had known that, I would have gone home via Asakusa. Maybe I should get the news delivered to my cell phone.
 
 *1210779139*東武線
 
 I'm doing some substitute cab transport. It's hard work.
 
 *1210780418*I'm home.
 It's still a dirty room.
 
 *1210783854*If I go to a page with a Java applet in Firefox, it hangs.
 Today I was messing around with an applet for the first time in a while, but for some reason Firefox hung and I had a headache.
 
 As it turns out, it was the symptom described in <a href="http://bugzilla.mozilla.gr.jp/show_bug.cgi?id=6106">Bug 6106 &#8211; hangs when viewing sites using Java applets</a>.
 >>
 I tried with Java 6.0 Update 6 and could not reproduce.
 <<
 Thanks @norahmodel for letting me know!
 
 I ran the automatic update and it said "already up-to-date"... At least in my environment (WinXP), the latest automatic update is Update 5. At least in my environment (WinXP), the latest automatic update is Update 5.
 
 http://java.sun.com/javase/ja/6/download.html
 
 Since I was using GreaseMonkey to add a JavaApplet when I hit this symptom, I mistakenly thought that the problem was that I had added the applet tag dynamically in JavaScript. Oh well.
 
 **1210787348*Emailing operation information.
 >>
 半蔵門線
 The schedule is being disrupted. Oops. If I had known that, I would have gone home via Asakusa. Maybe I should get the news delivered to my cell phone.
 <<
 I searched for it and found it.
 
 <a href="http://ekitan.com/intro/timetableinfo/">Operation Information Mail|Ekitan</a>
 Ah, but for a fee.
 
 
 <a href="http://mag.mobile.yahoo.co.jp/">Yahoo!Mobile - Asayomu Magazine</a>
 This is free. I heard that it contains a lot of information, including operation information. But I wonder if they send the information at a fixed time instead of when it changes.
 
 
 I registered for the station search.
 
 *1210788208* So much to do!
 Ahh.... There are so many things to do and want to do that no matter how much time I have, it's never enough.
 
 The books I want to study keep piling up, but I don't have enough time to read them.
 
 What I've been trying to do a little bit lately is to read a book before bed. I feel that it is less likely to cause insomnia than doing internet before going to bed, and more importantly, "bedtime" comes every day, so I don't have to say, "Oh, I've been so busy that I haven't studied anything for the past month. If I read just 10 pages every day, I can read 300 pages in a month, or 3,650 pages in a year.
 
 I know it's an overused phrase, but "continuity is power.
 
 f:id:nishiohirokazu:20080515025251j:image
 
 We are also exploring note-taking.
 
 *1210792781* I was writing an email and it's late.
 It's already around 4 o'clock...
 
 English honorifics are difficult. It's about how to say, "I'd like to do it if I could, but it seems a bit impossible, so could you please do it for me?" is a story about how to say "I'd like to do it if I could, but it seems a bit impossible.
 
 I wish I could ... But ... so if it is not too much trouble, could you ...? I wrote "I wish I could ... but ... so ...". I don't think I got the "but" and "so" right, but that's okay. I'll have no time to sleep.
 
 At any rate, it's funny that If is capitalized (oh).
 You realize it when you send it, Murphy's Law orz.
 </body>
 <comments>
 <comment>
 <username>amachang</username>
 <body>You're right. The latest title is not the latest. </body>.
 <timestamp>1210736733</timestamp>
 </comment>
 <comment>
 <username>mohri</username>
 <body>I guess if you set the new posts to add in the "up" direction, they would be in the new order. </body>
 <timestamp>1210780839</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Hmmm, I personally want them to be in order of time within a day, but amachang has been saying for a while that he wants the newest ones to be at the top, so I'm wondering what to do. I don't like to have them in reverse order when I write short articles in a row when I attend an event or something... </body>
 <timestamp>1210781702</timestamp>
 </comment>
 <comment>
 <username>hamatsu1974</username>
 <body>Expatriate, here I come (on my lunch break). <br><br>I think I should do this, however, it seems a little bit tough for now. <br><br>I think I should do this, however, it seems a little bit tough for now. So, I'd really appreciated if you helped me. <br><br>I think I should do this, however, it seems a little bit tough for now.
 <timestamp>1210845684</timestamp>
 </comment>
 <comment>
 <username>某借金男</username>
 <body>I'm the guy who borrowed $500 for a drink on New Year's Eve. I just got caught up in this problem today, so thanks for the info, thanks! <br>I thought I was on ...... but I downloaded the JDK by mistake! Is this someone's curse to start Jython? </body>
 <timestamp>1210861464</timestamp>
 </comment>
 <comment>
 <username>しみずかわ</username>
 <body>Disaster prevention@nifty: rescuenow@nifty<br>http://rescuenow.nifty.com/mobile/<br><br>I'm au and my mail is delayed...</body>
 <timestamp>1210867261</timestamp>
 </comment>
 <comment>
 <username>jj1bdx</username>
 <body>I wish I could do it now but I guess I won’t because 理由. Would you mind if I hand it over to you?<br><br>なんてのもありですね．<br><br>appreciate は良い選択で，こういうときにももちろん使えます．<br>howeverは論文とか硬い文章にもよくはまってくれます．</body>
 <timestamp>1210970721</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 I completely forgot about <body>appreciate. I learned it a long time ago... </body>
 <timestamp>1211015338</timestamp>
 </comment>
 <comment>
 <username>arai</username>
 <body>I recommend the book "English Expression Training - Polite English Recommendations (Kodansha Gendai Shinsho)" and the book "English Social Skills". </body>
 <timestamp>1213191047</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-05-14 https://nishiohirokazu.hatenadiary.org/archive/2008/05/14]