Hatena2008-01-06
code:hatena
 <body>
 *1199627112* uwasa
 
 f:id:nishiohirokazu:20080106154104j:image
 
 Fish is "uwo" not "uo".
 
 *1199611646*My fortune this year.
 <a href="http://timino2008.net/"><img src="http://timino2008.net/bar_timi_top.gif" border="0" alt="チミの2008年カード" style="margin:0px;padding:0px;border:none;"></a><br /><a href="http://timino2008.net/%E8%A5%BF%E5%B0%BE%E6%B3%B0%E5%92%8C/"><img src="http://timino2008.net/img/%E8%A5%BF%E5%B0%BE%E6%B3%B0%E5%92%8C/" alt="西尾泰和の2008年カード" border="0" style="margin:0px;padding:0px;"></a><br /><a href="http://www.freem.ne.jp/"><img src="http://timino2008.net/bar_timi_bottom.gif" border="0" alt="by ふりーむ！ 無料ゲーム/フリーゲーム" style="margin:0px;padding:0px;border:none;"></a>
 
 Yeah, yeah, yeah.
 
 *1199626599*1000 Speakers Project
 I thought about it and realized that amachang is IP unreachable during the year-end and New Year holidays.
 
 I edited the Wiki a lot. I removed the first summary from the top page and changed it to the "general policy" shown below instead.
 
 -General policy
 -- Stick to no charge
 --- "People who are not used to conferences" may be hesitant to participate in a paid conference.
 - Keep the size of the presentation to a size that allows for communication between the presenter and the audience.
 - 10 presenters x 10-20 minutes each (average 24 minutes including margins) for 4 hours
 - 1:00 p.m. to 5:00 p.m.
 - After the meeting, we went into a chatting mode (get-together).
 - Reception at a bar from about 18:00 (paid)
 -- Slight discount for students. Maybe even free for high school students and younger.
 - Talks can be about any software-related technology.
 
 I also created a "Detailed Information on the First Conference" page, reflecting the decisions made and other information in the Wiki.
 
 http://ja.doukaku.org/wiki/index.php/1000speakers:1
 
 I've only framed the announcement schedule yet.
 Am I correct in understanding that id:tokuhirom cancelled and id:HolyGrail joined?
 
 ---
 
 Let me note a few thoughts as I clean up the policy.
 
 - I've made a policy that the reception will be paid for (split), but students will get a discount, is that okay?
 -- I'm thinking of copying the last Django study group and adding "free for minors", how about that?
 - To tell the truth, it would be nice to have a "remote area discount", but it seems to be difficult to count. I wish there was a better way to manage it.
 
 - The idea of recruiting participants for the next and subsequent times on different sites had been put on hold due to the risk of not getting enough people, but I thought it would be better to use staggered recruiting since the purpose is to avoid the problem of "recruiting on amachang's blog fills up instantly". Maybe we could do the recruiting somewhere and then do it on the amachang blog after 24 hours. What do you think?
 </body>
 <comments>
 <comment>
 <username>HolyGrail</username>
 <body>Hey! I'm joining! <br>Please do! </body>
 <timestamp>1199626690</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-01-06 https://nishiohirokazu.hatenadiary.org/archive/2008/01/06]