Hatena2009-06-28
code:hatena
 <body>
 *1246133956*early bird
 I was in a hurry because I thought I was going to be alone.
 
 <hr>
 
 Unordered(And(Take(Resource(X)), Choice(2)))
 
 When X = 3, 6 * 4 / 2, 12 ways.
 >||
 (0, 0), (1, 0)
 (0, 0), (1, 1)
 (0, 0), (2, 0)
 (0, 0), (2, 1)
 (0, 1), (1, 0)
 (0, 1), (1, 1)
 (0, 1), (2, 0)
 (0, 1), (2, 1)
 
 (1, 0), (2, 0)
 (1, 0), (2, 1)
 (1, 1), (2, 0)
 (1, 1), (2, 1)
 ||<
 There should be 12 ways of
 
 however
 >||
 @0(0): 1, 1, 0, 0, 12345, 12345, 0, 0, 
 @1(1): 1, 1, 0, 0, 12345, 12345, 0, 1, 
 @2(2): 1, 1, 0, 0, 12345, 12345, 1, 1, 
 @3(3): 0, 0, 12345, 12345, 0, 1, 0, 0, 
 @4(4): 0, 0, 12345, 12345, 0, 1, 0, 1, 
 @5(5): 0, 0, 12345, 12345, 0, 2, 0, 0, 
 @6(6): 0, 0, 12345, 12345, 0, 2, 0, 1, 
 @7(7): 0, 0, 12345, 12345, 0, 3, 0, 0, <= error
 ||<
 
 Mwah. The decoder thinks it's 6 * 5 / 2, while the part that calculates the size is correctly calculated at 6 * 4 / 2. It's easy enough to fix the decoder, but not the encoder.
 
 >||
 if(and0_0 > and0_1) std::swap(and0_0, and0_1);
 unordered0 = 6 * and0_0 - and0_0 * (and0_0 + 1) / 2 + and0_1 - and0_0;
 ||<
 
 Mwah, what are we going to do about this?
 
 To put the problem in perspective, I was told that I have a mapping from [0, 12) to a combination of 4 integers such that 0 <= x1 < x2 < 3 and y1 and y2 are [0, 1], but what about the reverse direction? I had assumed that it was an equi-difference sequence with a tolerance of 1, so I had used the above formula to find it, but in fact, in this case, the tolerance is not 1, so it's no good. In this case, it is required that the tolerance is 2, so I wonder if I should change the formula.
 
 I guess I'll take a morning bath for now.
 
 *1246166812*åˆDXF
 <img src="http://gyazo.com/f5934308c5e6f8182b3d6105a4e2b6c8.png">
 
 The smallest unit is a 32nd note and there are <del>28</del>56 measures. Now, let's find and type in the important music sheet.
 
 <hr>
 
 <img src="http://gyazo.com/4c4377db2917e8a6c384ec359b29c81b.png">
 
 Pachelbel's Canon (in the making)
 
 It's hard to understand. It's not intuitive, like where the red and green overlap the yellow. The color scheme seems buggy because the top of the blue is yellow. Also, I wonder if it's the viewer's fault that it can't rotate smoothly with this level of polygons already in the viewer.
 
 <img src="http://gyazo.com/911f3cda799c51fc012c5a28dba16dcb.png">
 
 Not beautiful.
 </body>
 <comments>
 <comment>
 <username>kaede</username>
 <body>Hello. I'm just passing by. If you don't mind, I'd like you to try it on a two-voice Bach piece. If you try it with Pachelbel's Canon, there are three voices, and there are many places where the melody is harmonized in three different degrees, so if you draw a diagram, the music would be crowded and the melody would be difficult to understand. But I'm just imagining, so I'm sorry if it's not interesting when I actually try it. </body>
 <timestamp>1246307395</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-06-28 https://nishiohirokazu.hatenadiary.org/archive/2009/06/28]