Hatena2008-09-25
code:hatena
 <body>
 *1222334405* Dinner
 <a href="http://d.hatena.ne.jp/nyaxt/">Keishinbo no Ueno-tan</a> said, "Those who did SEO with <a href="http://d.hatena.ne.jp/nyaxt/">Keishinbo no Ueno-tan</a>, buy me yakiniku! I'm going to Kanda to treat you to yakiniku.
 
 Hungry Ueno-tan is really pissed off at Yoshiori for being late.
 
 Extra rice, please.
 I said "extra large" and he didn't go through with it."
 Isn't normal enough?"
 
 f:id:nishiohirokazu:20080925191137j:image
 
 Ueno-tan is dissatisfied because the heat is low and it doesn't burn very well.
 I go to the nearby Gyukaku so much that now, just by going in, people ask me, 'Is it all-you-can-eat?
 
 ------
 
 For some reason, y***s bought an embarrassing DVD called "I'm not embarrassed because I'm not a ****" so we walked to Akihabara. Mr. Ueno desperately opposed some of the guys who were excited about going to Mingtou Izakaya, and we decided to go into a regular coffee shop. It was a wise decision.
 
 Mr. Ueno is caught up in k*****k. He's so young! He was reproducing the typical "serious scientist being played by a philosopher (or a fraud)" phenomenon.
 
 I returned home after hearing that koalas are slow because they are intoxicated by the toxicity of eucalyptus, and that they become agile when fed something other than eucalyptus, and that pandas are also basically bears and sometimes die when attacked by people.
 
 -----
 
 I honestly doubt that the story about the koala being intoxicated is true, as I have not been able to find a source for it other than a copy and paste from 2chan.
 
 >>
 Koalas are not "drunk" or otherwise intoxicated by their leaves.
 <<
 http://koalas.org/koala-info.html
 
 Some sites clearly state that koalas are not intoxicated by eucalyptus toxicity. Well, the source is unknown, so it could go either way.
 
 At least Wikipedia says that eucalyptus leaves are low in nutritional value and thus slow-moving, which is consistent with the 2chan copy and paste story that "researchers bred them with different feed and they became more agile".
 
 It's still eyebrow-raising.
 
 -----
 
 Forgot about SEO.
 <a href="http://d.hatena.ne.jp/nyaxt/">Eating Moe Elements</a> by Ueno Tan.
 
 *1222357562*Beef Beef
 I think "get eight points" is a pretty heavy word.
 </body>
 <comments>
 <comment>
 <username>earth2001y</username>
 <body>Ah, I'm exempt? w</body>.
 <timestamp>1222334959</timestamp>
 </comment>
 <comment>
 <username>hogelog</username>
 <body>"ZOO KEEPER," a zoo cartoon, described how "koalas are slow-moving because they need a lot of energy to break down the toxicity of eucalyptus, and some zoos exhibit koalas that have become more active by rearing them on less toxic eucalyptus leaves. <br><br>I don't remember the details. <br>I forget the details. </body>
 <timestamp>1222359360</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-09-25 https://nishiohirokazu.hatenadiary.org/archive/2008/09/25]