Hatena2008-02-26
code:hatena
 <body>
 *1203983104* Environment without computer
 
 I am going to a 3-day no computer camp starting today. Can you stand it?
 
 *1203983814* Trouble as early as possible.
 
 We were supposed to meet at 7:00 a.m! Did I get left behind?
 
 PS
 
 It started tomorrow. I took a paid holiday from today.
 
 In the meantime, I should go to work and see if I can stagger the paid holidays I've already applied for.
 
 *1203991971* Walking moe factor
 >>
 When moving from the venue to the pub, Nishio-san told us not to forget anything, but when it came time to take the elevator down, an event occurred in which Nishio-san almost forgot a set of laptop computers. Nishio-san has a reputation for being a good wife, but I have come to think that she is actually a walking moe factor >.
 <<
 http://d.hatena.ne.jp/seiunsky/20080225/1203966908
 
 Don't think about it ><
 Hey there, don't casually post links with "walking moe elements"! ><
 
 <img src="http://49.212.123.65/beacon" width=1 height=1>
 
 *1204002396* Java-en is being trolled by Iranians.
 I went to ask a question and came back because there was a weird image on it.
 I wonder if we can do something about it.
 
 *1204003444*test
 I'm listening to a video by t-wada of java-ja right now.
 http://ustream.tv/swf/3/viewer.57.swf?embed=i4n3uKub4,B8EQjupVZ2BN0mgd1Y108G&loc=/&vid=i4n3uKub4,B8EQjupVZ2BN0mgd1Y108G
 
 I heard that there are three types of testing: developer testing, customer testing, and QA testing.
 
 I was relieved when I was told that it is OK to write test names in Japanese. I am also writing in Japanese in my Jython book. My manuscript is also in JUnit 4, so it's very helpful, and the explanation of JUnit by someone who is familiar with JUnit backs it up.
 
 In my code.
 assertEquals("[1, 2, 3, 4, 5]", value.toString());
 I wrote "I'll change it to assertThat".
 
 Oh, there is no org.junit.Assert.assertThat. Why is that?
 
 Tests are done to overcome anxiety. It doesn't make sense if the test might be wrong or something.
 
 Oh wow, I can bring a line up without cut-paste!
 
 Oh, it's JUnit 4.4? My code is JUnit 4.1.... Hmmm, I wonder if I should try it with the latest JUnit. If I had unlimited time, I would do it.
 
 *1204008071* saga
 This is Cybozu Radio!
 Please!"
 amachang usual yay!"
 "Oh, you want to hear my tale of woe!"
 Tell me about that amazing saga!"
 My Legendary Top Ten!
 
 (Omitted ry
 
 *1204019349*Doing whatever it takes to bring down amachang
 - I will attend Asiajin Meeting #1! I declare that I am going to attend Asiajin Meeting #1!
 - "Then me too!" says amachang
 - I was transcribing in my notebook and realized I had double-booked with the camp.
 - "Sorry, we double-booked with the camp! Please let me cancel!" and say to Mr. Akimoto
 - amachang asks, "are you ready yet?" and they find out that I cancelled it.
 - amachang furious
 - Turns out that I was mistaken this morning when I thought I had double-booked in the first place.
 - They usually come to the lab.
 - amachang is preparing to present in English.
 - amachangSorry, really sorry, I didn't mean to do that ← here and now
 
 Please forgive me, I will announce it next time. Sorry, sorry, sorry.
 My heart aches every time amachang cooing in the back seat....orz
 
 -----
 
 Working in the lab. I can see the conference, but the rule is that "Japanese must present to participate", so I feel away from home orz.
 
 *1204041066*Asiajin drinking party attended.
 Only one person just got out ahead of me and returned to the lab.
 Well, let's meet in Akihabara at 6:30 tomorrow.
 I don't feel like I can get up if I go to bed.
 
 *1204041429*Lingr's method to prevent Iranian trolls
 - password (e.g. password)
 - Set it to not appear on the list.
 - Create a user style sheet to hide (or reduce the size of) images pasted on Lingr
 
 Oh no. I feel like how much of a step backward it is to hide images, but if you can't do the above two things, I guess it can't be helped.
 
 *1204043694* saga
 Not much. <a href="http://d.hatena.ne.jp/earth2001y/20080226/SEO">The Walking Moe Element</a>, and you're in SEO, Obinata, you write.
 
 
 
 Â I came to Beppu in Kitakyushu City, but Beppu is located in Oita Prefecture＞ ＜Buyuden Buyuden Buyuden Buyuden Buyuden Buyuden Buyuden Buyuden Buyuden Buyuden Buyuden Buyuden
 
 I think those are the only two cases I can think of. I just usually forget the map of the lab, I didn't know it was on Wikipedia until I came to the lab, and I can't tell which was the winter one, Nagano or Beppu.
 
 Oh, I just thought of one more thing.
 
 Â The salesman came to deliver the car, put him in the passenger seat, and go red, but go, saga saga saga saga saga saga saga saga saga saga saga saga saga saga saga saga saga saga saga saga
 
 Â I made incense sticks with chili peppers and burned them and played with them and it was a big deal!　
 
 Â Peeled off the labels, washed, dried, and put them out together on the day of burnable trash. saga saga saga saga bu yu den den den den den den ♪ (I didn't do it on purpose >>)
 
 
 
 Oh, there are a lot of driving systems.
 
 　Â™
 
 Â I made a left turn without slowing down and I was eye to eye with oncoming traffic. saga saga saga saga saga saga saga saga saga saga saga saga saga saga saga saga saga saga saga saga saga
 
 
 
 
 
 Â Why doesn't the car in front of me start?　They didn't notice the sound of the sirens> ＜Buyuden Buyuden Buyuden Buyuden Buyuden Buyuden Buyuden Buyuden Buyuden Buyuden Buyuden Buyuden
 
 And I thought again that I should not drive anyway.
 
 *1204048799* Like 6:30 a.m. meet at the Daibiru.
 Impossible.
 
 So I thought I would stay awake all the time, but I'm sleepy...
 
 -----
 
 I usually carry a change of clothes in my normal bag for a business trip of two nights and three days, but this time I have toys, so I don't think I can fit them in there. I think I'll use the bag I bought on my business trip to the U.S., which I can pull.
 
 
 f:id:nishiohirokazu:20080227031548j:image
 
 I made a bag that I can pull, but there is no place to put my change of clothes.
 
 -----
 
 What to remember to bring
 - Cell phone (the only communication device)
 - Cell phone power (lifeline!)
 - iPod (the only music playing device)
 - Muffled headphones (I don't think I have them, but I would use them if I had time to write a manuscript)
 
 What I put in while I'm at it
 - nippers
 - spoon
 - all-purpose shears
 - Kuzune-to, eye drops, body warmer, sugar beet extract, Daranisukegan, Neovitamin
 - Slurpees, dried potatoes, black black gum and tablets from the room.
 
 I guess I put in too much at random.
 But, well, I put in everything I needed.
 
 It would be interesting to be able to do Ustream or something on my cell phone.
 
 Oh, I put in a lot of stuff, but I'm very anxious to go three days without a computer without going insane...
 
 -----
 
 I'm sleepy.
 I was going to work, but I couldn't work, so I fired up Freeciv. But I guess an hour and a half is not enough time to settle it.... Agony.
 
 The outcry of initial_tech=30.
 
 This is! We can make both Harbor and Galeon from the beginning! I'm going to make Harbor and increase the waiting list as much as possible.
 
 Sorry, careless mistake, the second city was destroyed by starvation, so I reset.
 
 -----
 
 I built 6 cities on 1/2 Japan map from Mie to around Kamiaso. Is this a trade flag?
 
 f:id:nishiohirokazu:20080227045746p:image
 
 By the way, I sent out a frigate with a pioneer on board, but I wonder if I can find a vacant lot.
 
 -----
 
 I industrialized with the intention of having a leisurely Simcity, but my neighbors won't agree to extend the ceasefire. I have no choice but to take Leadership(Dragoon) and research Communism in the next move. I will have it in two more turns. Then I'll start a revolution.
 
 Factory -> Barracks -> Dragoon in a capital with a crusader attached. The enemy is Archer and Catapult, so you will be able to destroy them.
 
 and they attacked and wiped us out before we could make the dragoon > enemy.
 And all the surrounding countries are at war.
 
 Transition to a communal system. Next study at Espinage.
 
 Finally, the first trade route was established. Not even close.
 
 Yeah, it's a good point, but it's a timeout.
 </body>
 <comments>
 <comment>
 <username>nyaxt</username>
 <body>27 in the morning, I think</body>.
 <timestamp>1203984130</timestamp>
 </comment>
 <comment>
 <username>TAKAO</username>
 <body>I was slightly impatient with the email that came in the morning, wondering if it was today. </body>
 <timestamp>1203994512</timestamp>
 </comment>
 <comment>
 <username>Youchan</username>
 <body>Moe elements</body>.
 <timestamp>1204000474</timestamp>
 </comment>
 <comment>
 <username>SiroKuro</username>
 <body>A good wife indeed</body>.
 <timestamp>1204002021</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>>A good wife indeed<br><br>I don't know what that means</body>.
 <timestamp>1204009881</timestamp>
 </comment>
 <comment>
 <username>Yoshiori</username>
 <body>I looked into LingrAPI to do something about it, but it seems there is no way to delete messages from the API yet><body>I'll take a look at the URL you're flying to and see what I can find><</body>.
 <timestamp>1204029417</timestamp>
 </comment>
 <comment>
 <username>seiunsky</username>
 <body>waffle waffle waffle waffle</body>.
 <timestamp>1204049948</timestamp>
 </comment>
 <comment>
 <username>t-wada</username>
 <body>Thank you for watching the video. If I have a chance, I'd like to pair-pro with nishiohirokazu once. </body>
 <timestamp>1204050753</timestamp>
 </comment>
 <comment>
 <username>se-mi</username>
 <body>waffle waffle waffle waffle</body>.
 <timestamp>1204078207</timestamp>
 </comment>
 <comment>
 <username>Yoshiori</username>
 <body>I'd like to pair-pro with nishiohirokazu too (not in a sexual way</body>)
 <timestamp>1204267890</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-02-26 https://nishiohirokazu.hatenadiary.org/archive/2008/02/26]