Hatena2009-03-03
code:hatena
 <body>
 *1236048877* Bookshelf
 f:id:nishiohirokazu:20090303115436j:image
 
 The <a href="http://pt.afl.rakuten.co.jp/c/02f9ff29.918fb7b7/?url=http%3a%2f%2fitem.rakuten.co.jp%2fesco%2fthon-1%2f">bookcase</a> I ordered arrived. It says to work on it lying down, but I don't have that kind of space. It says to work on it lying down, but I don't have that kind of space. It's just that it's difficult to screw it down while supporting the sliding shelves inside, so it's fine if you can keep it at the proper height with an appropriate object. The structure of the propping up was a mystery to me, but it has a structure of screw -> cup -> spring -> wooden board, and you adjust it by turning the screw. I shook it after attaching it, and it seemed to be stronger than just a piece of stick. The surface in contact with the ceiling is also wide.
 
 
 f:id:nishiohirokazu:20090303160837j:image
 I thought it would be about the depth of a paperback book, but it surprisingly fits in there; an A4 size book would stick out a few centimeters, but if you think about it calmly, many of my books are smaller. I'm not a very meticulous person, so I don't sort my books by size, but it seems like I should just put them on the shelf and put the ones that are sticking out on a different shelf.
 
 *1236062146* Self-proclaimed geek
 >>
 geek DataBase, a database that allows users to register themselves as "geeks
 <<
 http://www.rbbtoday.com/news/20090303/58259.html
 
 
 So if you are registered here, you are despised as a "self-proclaimed geek", I understand. (medullary reflex)
 
 
 Oh, if I read it correctly, there are other recommendations. I don't mind if you do. I misunderstood the title.
 
 *1236065224* Water supply fittings
 >>
 Next, a water supply fitting (one-touch joint) is attached to the water tap.
 Most of the time, the installation fails and the customer cries to the electrician.
 <<
 http://www.cwo.zaq.ne.jp/hiranodk/syuuri/syuuri_5/senntakuki.html
 
 
 I couldn't put it on by myself even after reading the instructions, so I asked a googling doctor.
 
 
 ...Mmmm, all we have is a sleeve? Are we missing parts?
 
 
 Originally, it was a "just fit" type hose with no screw-on parts, but the faucet is deformed by the tightening of the previous occupant's washing machine, so it doesn't fit properly. I guess I will have to buy a hose with a threaded end.
 
 *1236073660*Re: Redevelopment "I want to question public opinion," MIC Minister Hatoyama declares in inspection of current situation.
 <a href='http://www.yomiuri.co.jp/politics/news/20090302-OYT1T01018.htm?from =main4'>Redevelopment "I want to question public opinion," MIC Minister Hatoyama declares in inspection of current situation : Politics : YOMIURI ONLINE ( (Yomiuri Shimbun)</a>
 
 
 <a href='http://www.nikkei.co.jp/sp2/nt47/20090302AS3S0201102032009.html'>NIKKEI NET: Special Feature: Privately Owned Postal Service</a>
 >>
 It is a disgrace to the nation that the former Tokyo Central Bureau has been destroyed in the pursuit of profits in the American way. On April 2, Minister of Internal Affairs and Communications Hatoyama visited the former Tokyo Central Bureau, where demolition work has begun, and raised his voice in front of the press.
 <<
 
 >>
 If the plan is cancelled, huge losses, including compensation to the construction company, are inevitable, and the privatization plan will have to be revised drastically.
 <<
 
 
 <a href='http://mainichi.jp/select/seiji/news/20090303ddm002010077000c.html'> Tokyo Chuo Post Office: "Wait and see" redevelopment, protection of cultural assets...Japan Post, management may take a hit - Mainichi Newspapers )</a>
 >>
 Civic groups and nonpartisan Diet members voiced their opinion that the building has value as an important cultural asset, so Japan Post decided to preserve part of the five-story station building and plan to rebuild it into a 38-story skyscraper by FY11. The redevelopment is expected to generate over 10 billion yen per year in tenant income and other revenues. The post office company is forecasting ordinary income of 58 billion yen for the fiscal year ending March 31, 2009, making it the least profitable of the group. The redevelopment is important to maintain the nationwide post office network.
 
 　However, Minister of Internal Affairs and Communications Hatoyama complained, "If the value is lost due to construction, it will be a national loss.
 <<
 
 
 <a href='http://mainichi.jp/area/tokyo/news/20090207ddlk13040281000c.html'> Tokyo Chuo Post Office: Part of the post office to be preserved and redeveloped, Tokyo Metropolitan Board of Accountancy agrees / Tokyo - Mainichijp (Mainichi Shimbun)</a>(February 7, 2009)
 >>
 A Tokyo Metropolitan Government official explained the process, saying, "We found that there are technical and financial problems in making the building perform well enough to be used over the long term, and as a result of these considerations by the operator, we came to the conclusion that it would be difficult to preserve it in its entirety. Some objected, "Why not protect the people's property?" but the proposal was agreed to by a majority vote.
 <<
 
 
 The plan has been open to the public for a long time, and after much discussion, the majority was in favor of the project, but to show up and complain about it after construction has begun, do you have no idea how much trouble the site is in? Maybe he thinks it's cool to "question public opinion," but to me, he looks like a child who is trying to make a name for himself by single-handedly taking over something that many people have worked so hard to build.
 
 *1236094619*Re: How a geeky programmer learns while dealing well with his wife
 <a href='http://b.hatena.ne.jp/entry/http://d.hatena.ne.jp/snow-bell/20080130/1201710920'> Hatena Bookmark - How a geeky programmer learns while dealing with his wife - The Snow-bell's Diary</a>.
 <img src="http://gyazo.com/27d363ccd2fca263b4db20355738b7d7.png">
 
 
 I feel like I only use Hatena bookmarks for this kind of fun.
 </body>
 <comments>
 <comment>
 <username>lovecall</username>
 <body>Mr. Nishio, nice to meet you. My name is Benijyo and I am the owner of "geekDataBase". <BR>Thank you for the mention. <BR><BR>The geekDB was originally created by me sending out emails to people I called "alpha geeks" asking them to post their profiles, but that method was still limited to people who had some exposure<BR>on the Internet. <br>We added this form of content in the hope that a wider range of people other than famous geeks would participate, and that we would be able to share with the world not only our faces as engineers, but also our unique charms<br>that cannot be seen through code. <BR>We all hope to create a fun and fulfilling website. <BR><BR>I am very sorry for the length of my sudden comment. <BR><BR>I have heard of you in various places and know your name well. <BR><BR>I am very nervous to be mentioned. Thank you very much! </body> <br
 <timestamp>1236076197</timestamp>
 </comment>
 <comment>
 <username>yad-EL</username>
 <body>As expected, the newspaper columns had the same tone</body>.
 <timestamp>1236125001</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-03-03 https://nishiohirokazu.hatenadiary.org/archive/2009/03/03]