Hatena2007-12-26
code:hatena
 <body>
 *1198629540*Social Crack
 If we distinguish malicious hackers by calling them crackers, why not call malicious social hacks social cracks as well?
 
 And blogging about these things is one of the social hacks. It is throwing a patch on society.
 
 *1198637813*1000 Speakers Project
 I've been in a bit of a rush and haven't been able to fully organize everything I've learned... but I'm going to share the information publicly for now...
 
 -coding my life : Watch technical lectures on Nico Nico Nico!
 --http://coji.s9.xrea.com/article.php?id=49
 -Yokohama Linux Users Group Site :: YLUG会合・読書会資料-reading-メインコンテンツ(PukiWiki)
 --http://www.ylug.jp/modules/pukiwiki/index.php?reading
 
 The YLUG video was much cleaner than I had imagined. According to Mr. Yoshioka, this much can be done with ordinary home-use video.
 
 - Information on Nico Nico Douga encoding
 -- http://nicowiki.com/encode.html
 
 Also, Mr. Imamura made a summary page regarding Izakaya presentations.
 
 -Izakaya presentation manual
 --http://www.siprop.org/ja/2.0/index.php?%B3%AB%C8%AF%2F%A5%B3%A5%DF%A5%E5%A5%CB%A5%C6%A5%A3%A1%BC%2F%CA%D9%B6%AF%B2%F1%2F2007%2F12%2F15
 
 It is difficult to use in a 1,000 speaker project because of the severe limitation on the number of people, but it could be used for smaller conferences.
 
 *1198645206*WiimoteLib
 SuperCollider additions from pete moss
 http://petemoss.org/SuperCollider/index.html
 
 *1198652134*Managed Library for Nintendo's Wiimote - Release: WiimoteLib v1.2
 http://www.codeplex.com/WiimoteLib/Release/ProjectReleases.aspx?ReleaseId=7880
 
 The previous entry seems to be for SuperCollider or some other sound-related software, which is not suitable for my purpose.
 
 *1198655462*pywiimote (Wii remote control library for Python)
 pywiimote - Google Code http://code.google.com/p/pywiimote/
 >>
 A library that runs on the big-3 (Windows, Mac and Linux) and lets the developer access all facets of the wii remote via Python. Can easily be interfaced with a GUI of your choice.
 <<
 
 It's helpful (though I probably won't use it).
 
 It looks like you are calling hid.dll (Human Interface Device) using ctypes. hid.dll is a "generic driver"?
 
 I'm not sure if it's a good idea, but it's helpful....I've noticed that when you pass a structure reference in ctypes, you wrap the class inheriting from Structure in a byref before passing it on.
 
 Instructions on how to access the HID are in Chapter 12 of the PDF below.
 http://www.madlabo.com/mad/gid/research/usb/usb_dev.pdf
 It says Confidential, but it's a mystery why it's public.
 
 I heard that LEDs are not internal resistance but drop voltage (I learned this during the last Tsukuba tour).
 A 1.5V battery drops to 1.0V with a drop voltage of 0.5, so it seems that all we need to do is look at the amperage and choose an appropriate resistor.
 I checked the amperage of the LED (I took a picture of it on the box with my phone camera when I bought it) and it was 60mA, so 1.0V / 0.06A = 17 Ohm, is that correct?
 
 *1198666600*秋葉原
 
 I bought a 15 ohm resistor.
 
 The biggest question is whether a soldering iron and solder can be found in the pile of junk in the room.
 
 *1198675338*Rag Room
 I found a soldering iron, but I can't find the all-important solder. There should have been a tester, but I can't find it.
 
 I have all the materials, but I can't assemble it. It's very frustrating.
 I wonder if wrapping it in aluminum foil and crimping it with radio pliers would work well.
 
 *1198677617*Solder and tester
 I go to bed with a glimmer of hope that the dwarf will let me out while I sleep.
 </body>
 <comments>
 <comment>
 <username>MiCHiLU</username>
 <body>It looks like the drop voltage is not a loss proportional to the current. Let's examine it carefully</body>.
 <timestamp>1198708639</timestamp>
 </comment>
 <comment>
 <username>TOKOROTEN</username>
 <body>I personally recommend reading the beginning of How to Create a CPU. <BR><BR>When making an equivalent circuit with LEDs, if you assume forward voltage, you can approximate it with an ideal LED and a voltage source for the drop voltage. <br><br>The resistor standards are as follows. <br>http://www.koaproducts.com/basic/ba4.htm<br>Because of the manufacturing errors of LEDs, I think you can take some randomness, but<br>I suggest you buy a 16 or 18 ohm resistor and look for one that is close to 17 ohms. </body>
 <timestamp>1198709482</timestamp>
 </comment>
 <comment>
 <username>TOKOROTEN</username>
 <body>http://ja.wikipedia.org/wiki/マッドサイエンティスト<br>Fields that have traditionally been largely ignored by mad scientists include. <br>Botany, entomology, geology, social sciences, and education<br><br>Will social crackers be the mad scientists of the social sciences? </body>
 <timestamp>1198744281</timestamp>
 </comment>
 </comments>

[Hatena Diary 2007-12-26 https://nishiohirokazu.hatenadiary.org/archive/2007/12/26]