Hatena2009-07-15
code:hatena
 <body>
 *1247678027*Personal Information
 You see <a href='http://d.hatena.ne.jp/Yamashiro0217/20090715/1247646571'>I got an iPhone 3GS - Diary of Yamashiro0217</a> or <a href='http://d.hatena.ne. I think that when I reveal my phone number, many people immediately respond, "Wow, I'm revealing my personal information! I think that many people react with "Wow, I'm revealing my personal information!
 
 Let's consider information about the nearest train station. Since most people commute to work by train, if a malicious person knows the nearest train station, he or she can follow the target home just by staking out the area for a day. Most people don't watch out for tailgaters, or they don't know they're being followed, and they don't do a good job of it, which means that their home address would be revealed. Sometimes people write things like, "There is an event in the park across the street from my house," or "There is a Matsukiyo at the nearest intersection," or "The building next door has a cram school with noisy kids," etc. If you give such hints, they may be able to identify your address without even following you. If you give them such a clue, they might be able to find your address without following you.
 
 Think about what kind of damage could be done if the phone number is known to someone with bad intentions. For example, would they receive silent calls, or would they receive repeated calls in the middle of the night? And think about what you can do in such a situation. Just change the phone number. Yeah, that's right.
 
 Think about what kind of damage you would suffer if your address were known to someone with bad intentions. Will they put dirt in the mailbox, get ambushed and stabbed, pour gasoline on you, or post slanderous flyers all over the neighborhood? And then think about what to do in the event of such a situation. I'll be on the lookout for disturbing shadows around my house every day, and if something happens, I'll move out. I'll move out if something happens.
 
 I think it is more dangerous to disclose information about the nearest train station, but there is no end to the number of people who ask about the nearest train station to create a topic of conversation. For someone like me, who has no sense of geography, it feels bad not to ask back when asked, and if I don't know the name of the place, there's no way to connect the conversation. It's very difficult for me to make a connection if I don't know the name of the place I'm asking about.
 
 <hr>
 >>
 id:ku__ra__ge Without a public face photo, it's hard to know who to follow from the nearest station, right? But a phone number, by itself, can be accessed to the person in question.
 <<
 
 Oh, I see. I had overlooked it because my real name and face image have been publicly available for years. I guess I can reduce the risk of being followed by someone by making an effort not to associate my face with my name. It is true that there are people who do not want their faces to be seen. Also, I can't harm the person on the phone, can I? It's fundamentally different.
 
 When I think back to my junior high and high school days, I was of the mindset that it was impossible to post on the Internet under one's real name, and at that time, I was active under a handle. I think the direct reason why I stopped using my real name was because I had to use it when writing papers and doing projects such as the Unexplored Software Project. If you make it impossible to connect your real name with your handle, the results you achieved under your real name and the results you achieved under your handle become two different individuals, which is a waste of time and money. So, since it is difficult to write papers under one's handle, let's unify them under one's real name. (Actually, there are some papers written under handles. For example, there are some papers written under handles, such as those by Tohoku Gekijo).
 
 The advantages and disadvantages of disclosing various kinds of information depend on each person's situation. For those who have never shown their faces, there may be a disadvantage to showing their faces, but for someone like me, whose face is already in IPA's brochures and on various news sites, there is no disadvantage to having a few more photos of my face.
 
 http://d.hatena.ne.jp/Yoshiori/20090716/1247726764
 As noted in the "The fact of observation" section, id:Yoshiori and id:Yamashiro0217 have actually continued to expose their phone numbers for several years and have not seen any disadvantages as of now, and there have been advantages. Of course, the fact that there have been no problems so far does not guarantee that there will be no problems in the future.
 >>
 id:tokuhirom In summary, you want me to expose it on 2ch and make a festival out of it?
 <<
 Don't do it! Don't ever do it!
 
 To return to the story, the argument that id:Yoshiori, who has been exposing his phone number until now and the advantages outweigh the disadvantages, is "stupid" to expose that phone number again because he changed his cell phone to an iPhone this time is not well-founded. There may be some people in the world for whom the disadvantages of exposing their phone number outweigh the advantages, but that is irrelevant to this particular case. That being said, the disadvantages outweighed the disadvantages of exposing my real name and acting on it when I was in high school (and when I searched for my real name, I found out what high school I belonged to and so on. The Math Olympiad Foundation had published a list of qualifiers. ), but as the number of activities under my real name increased, the advantages outweighed the disadvantages. It depends on the situation.
 
 <hr>
 
 >>
 id:n_shuyo I see. If you take tailing into account, waiting at the entrance/exit of the company is much more successful than staking out at the nearest station. In other words, it is more dangerous to reveal the name of the company than the phone number or the nearest station. I'll have to make sure not to mention the company name next time.
 <<
 
 You received a lot of suspicious letters at the company, didn't you? That incident made me realize that "there are a few crazy people in the world," and I began to think this way. If a crazy person with energy wants to resort to violence, it is easier to do so in a residential area at night where there are few pedestrians than near a company where there is a lot of publicity. If the disadvantage of withholding the name of the company is less than the risk of being ambushed at the office, it would be reasonable to withhold the name of the company as well. On the other hand, if the advantage of disclosing the nearest station is higher than the risk of being ambushed, it would be reasonable to disclose it. I just don't understand the advantage of disclosing the nearest station.
 </body>
 <comments>
 <comment>
 <username>Passing by</username
 <body>No, it's simply because it's a lot of trouble to identify an address by staking it out or checking it out, but a phone number is an easy prank to pull. <BR>If you can just change your phone number, then you can just move your address. <br>But that would be too large a scale and usually too difficult. <br>While revealing your phone number is less damaging than having your address known, I think the barrier to mischief is lower than revealing the nearest train station or hints of your address on a blog. </body>
 <timestamp>1247706198</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <BODY>>Even the address says you can just move. <BR><BR>Is that what it says, can't you read it? </body>>
 <timestamp>1247711172</timestamp>
 </comment>
 <comment>
 <username>emosei</username>
 <body>I don't think you can be followed in a case where you are on stakeout and your face is not known. </body>
 <timestamp>1247714540</timestamp>
 </comment>
 <comment>
 <username>n_shuyo</username>
 <body>I thought it was "a story about how you are not good at geography and want to avoid talking about the nearest station, but you dared to talk about it in the context of personal information" and went into it like a story. I'm sorry I made you write a serious reply, but I won't do it again. <br><br>If you are in contact with someone who has the ability (and malice?) to follow you, and you have already had the opportunity to talk to them about the nearest train station (they probably already know about your company), it doesn't make sense to consider risks that are finer grained than that. <BR><BR>Then again, risks are universal, but benefits are subjective, so while we can share up to "let's compare", we can't share the results. <BR><BR>That's all from n_shuyo, the side that always asks for the nearest station</body>.
 <timestamp>1247760063</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-07-15 https://nishiohirokazu.hatenadiary.org/archive/2009/07/15]