Hatena2009-10-03
code:hatena
 <body>
 *1254541405* What the heck is __and_ed?
 Twitterで「i.e. if /frame type/ _and_ed with 0x80 returns 0x80」って何だという話になっていた。検索しても問題の文章しか出ないとのことなので僕も検索して<a href='http://tools.ietf.org/html/draft-hixie-thewebsocketprotocol-00'>draft-hixie-thewebsocketprotocol-00 - The Web Socket protocol</a>にたどりつく。
 
 I ran my eyes back and forth, wondering what this sentence says. It says /frame type/, _Length_, and _and_ing. I think this is not the word _and_ed but <em>and</em>ed, and when "and" is used as a verb, it must mean "to take AND". I look at the examples while thinking.
 
 >>
 Let /b_v/ be integer corresponding to the low 7 bits of
 /b/ (the value you would get by _and_ing /b/ with 0x7f).
 <<
 
 So "b_v is the lower 7 bits of b (the value obtained by /b/ and the _and_ing of 0x7f)." Yeah, it's the one that took AND.
 
 So I'll go back to the original statement.
 
 >>
  If the high-order bit of the /frame type/ byte is set (i.e. if /frame type/ _and_ed with 0x80 returns 0x80) Run these steps.
 <<
 
 If the most significant bit of /frame type/ is standing (i.e., /frame type/ is ANDed with 0x80 and returns 0x80), perform the following steps.
 
 Mm. Makes sense. It must be this way.
 
 <hr>
 
 and blogging about it is a life hack that will result in this entry being found if you search for _and_ed in the future. I think this is some kind of markup language including *foo* and /bar/. I'm sure there is a definition somewhere, we just don't know it. Otherwise, it's too unfriendly.
 
 **1254547423*Study Methods for Making the Most of Your Brain Leverage Memo
 <a href="http://www.amazon.co.jp/gp/product/4569696791?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399&creativeASIN=4569696791">脳を活かす勉強法</a><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as2&o=9&a=4569696791" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" />
 
 <hr>
 Pleasing the brain. Dopamine secretion. What makes you secrete dopamine, what pleases your brain the most?" What you are not good at is just not starting to turn the dopamine cycle. The challenge in life is to find what makes you happy. If what makes you happy coincides with what you need to do, you will be happier. On the other hand, you won't make progress in your studies if you think it's boring, and you won't grow in a boring life.
 It is difficult to force the brain to do anything. Spontaneity. You can't get a child to study willingly. Motivation can only come from something positive, such as liking something or being recognized by others. It is important to feel that you are choosing.
 You don't get dopamine by continuing to do what you can. It is important to push through the difficult situations.
 
 Learn to concentrate
 The brain gets stronger every time you accomplish something.
 Reinforcing circuits cannot turn without joy.
 A sense of breakthrough
 Many people are happy to put a load of uncertainty about whether they will succeed and break through it, but are not good at putting the load on. Time pressure: Put a load on each and every action. Set a time limit. Gradually shorten it. (However, time limits enforced by others are counterproductive.
 Do not compare your achievements with others. It is enough if you are making progress.
 Instead of enjoying the pressure, many people are defeated by the pressure of "having to do it.
 Not "busy working" but "busy learning" I am changing and growing.
 Negative thinking of "I have to do ~", not utilizing the brain.
 Crane study method: Don't worry about what others think
 Concentration = speed of work, overwhelming amount of work, immersive experience with no ambient noise
 The repetition of setting a time limit and striving to break through the barrier that you will not be able to go any faster.
 A happy state of being lively and enthusiastic "studious" by Masahiko Sato I feel sorry for you not to experience this.
 Zero distance between self and study Immersed self Flow state Brain likes this state very much
 It is a mistake to think of studying after making a plan, the plan itself is a barrier, a plan that cannot be made is only a hindrance, you should start as soon as you think of it, you should train the skill of speedy concentration. don't say at 17:55 "I will study at 18:00". Start immediately.
 For example, create a fixed routine. Create a habit of doing something first in order to concentrate. It can be a song or a jinx. The important thing is to use every possible means to create a "habit of instantaneous concentration.
 You think you need to set aside a tight time to read a book. It is an illusion that you need a coherent amount of time to concentrate. Train your brain to study even in small chunks of time.
 
 Efficient memory using modalities: reading, writing, listening, and speaking, but if you don't "memorize" in between, it's pointless to do your best. If you write while looking at a book, your memory circuits are not used. Memorize with short-term memory by looking at the book, and write without looking at the book.
 Take advantage of the brain's golden hour. Morning is more efficient than night to maximize brain utilization. Especially creative work is done in the morning. At night, the brain is filled with unorganized memories. It is not flexible. Many scholars and writers testify that morning is suitable.
 Look up anything you don't understand right away.
 The important thing is not what you memorize, but how you use it. It is a waste of time and effort to memorize something that can be easily found on the Internet.
 Those who forget history are doomed to repeat it. 歴史を忘れるものはそれを繰り返すはめになる。
 
 Writing skills are the heart of a studier's work. Train it by reading a lot of books. Reading is the best act to cool down the brain. Brain training promotes brain activation. When you are thinking or thinking about difficult problems or immersed in a virtual space, the active area of your brain becomes narrower. The case in which various thoughts come to mind while reading and interfere with reading: The assumption that you have to read the whole book is a barrier. You pick up on what you quickly open. Based on the findings of brain science, learning does not need to be done in an orderly fashion. It is enough to accumulate fragmentary input. Browsing is fine.
 Even the hardest reading can be overcome if you have a successful experience that you can overcome and be happy.
 If you have the desire to study, there is no need to go to college, there is such a vast amount of knowledge on the Internet. If you think that you are a winner if you get into a good university as in the past, you are actually a loser. From now on, you need to have the feeling that "getting into Tokyo University is not important" in order to shine.
 Study is not about classifying yourself, but about making yourself shine and getting to the next stage.
 One Night in Matsuzaka" Self-contained knowledge has no meaning.
 
 
 Understand your brain characteristics
 You get bored solving only easy problems. You get tired of solving unruly and difficult problems because you can't progress.
 In the flow state, the density of learning is surprisingly increased and pleasant.
 Do you have a grasp on what you don't know? People are highly motivated when they try to overcome their weaknesses with effort. Weaknesses are opportunities. Mistakes are also opportunities. The right way to study is very simple. Can you face up to your own shortcomings and mistakes, and logically pinpoint and correct the causes yourself?
 
 In a world with a well-developed information network such as the Internet, each person should be unique.
 Moment of Awareness.
 The freedom to be an oddball. The freedom to pursue what you love to the fullest. In Japan, there is a silent "peer pressure" to "go along with others. There are two kinds of peer pressure. One is a vector that accelerates sharpness and the other is a vector that tries to drag you down to the mean.
 
 Emotions are the brain's adaptive strategy to uncertainty
 Fun only when predictable and unexpected: contingency:= a mixture of secure and challenging
 It's all about balance.
 Human emotions include the enjoyment of uncertainty and the uneasiness of uncertainty
 Why were you able to overcome your anxiety when you were a child for the first time? Because I had a safe base (home) to escape to when something happened.
 Uncertainty is comfortable for the brain, and the tendency to seek uncertainty has led to repeated trial and error and civilization has advanced.
 <hr>
 
 *1254547843*日記
 I came here with the intention of having lunch at Saizeria, but they weren't selling it, probably because it was Saturday. I made leverage notes on how to study to make the most of my brain. Whew, it was fulfilling and fun, but I'm a little tired.
 
 I think 45 minutes was a bit of a severe time limit, I got to the point where I had a raw draft in 44 minutes, so I put it up, but I really wanted to get to the point where I could re-read and organize my leverage memo again.
 
 I replanted melons at Sunshine Ranch. 17 hours so they will be ready tomorrow morning at 7:00 a.m. I'm thinking it would be nice to have a crop that takes 24 hours or so to motivate me to get up at a certain time every morning. 13 hours of eggplant with a fertilizer set twice a day or 17 hours of melons and Or maybe a combination of 9 hours of corn and fertilizer...
 
 I am sleepy. I think I'll go home, have a cup of coffee, and go to bed.
 
 <hr>
 
 Hmmm, the disease of lack of motivation.
 
 In the end, to summarize, from the "study method to make the most of your brain," you should study even in small time slots and train yourself to focus quickly by measuring your time and making it a time attack on a regular basis. From the perspective of "Effective Time Management," there are tasks that can be done in small time slots and tasks that cannot be done in small time slots, and creative tasks cannot be done in small time slots. Prepare in advance tasks such as information gathering and study that can be done in small time slots.
 
 Maybe iKnow would have been very appropriate when I had access to a PC and the Internet. It gives me time. It has been a long time since I have played iKnow. But when I accessed the site for the first time in a while, I found a French question on the top page, so I tried to play it. It was fun.
 
 I've heard that when you're feeling unmotivated, you clean and feel a sense of accomplishment. iKnow is one way to feel unmotivated. iKnow is still more productive than spending an hour or two playing games, and you're not depressed when you're done.
 
 Cleaning is good when you are unmotivated because the granularity is so small that you can easily feel a sense of accomplishment. The reason why cleaning up a room doesn't give you a sense of accomplishment at all is because the granularity is too large and you can't clean it up even if you clean it up.
 
 If I'm not feeling motivated, can I just clean up my room for 10 minutes or do 10 minutes of iKnow?
 
 I guess it's better to play mostly the words I know than to play the GRE Verb, which is full of words I don't know. It takes me 10 minutes to play the GRE Verb, but 3.5 minutes to play the verb collocation. It's almost like a typing game then. Should I compete in dictation speed?
 </body>
 <comments>
 <comment>
 <username>gears</username>
 <body>I wonder if this is a mail convention, but Thunderbird has a feature that modifies *foo* to bold, /bar/ to italic, and _foo_ to outline</body>.
 <timestamp>1254588558</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>When you look at the usage, /foo/ is code, _bar_ is em, and *baz* is strong</body>.
 <timestamp>1254590865</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-10-03 https://nishiohirokazu.hatenadiary.org/archive/2009/10/03]