Hatena2014-08-20
code:hatena
 <body>
 *1408511498* On black history as a story and real black history
 <a href='http://cybozushiki.cybozu.co.jp/articles/m000317.html'>"Without a deadline, you run toward a very distant goal that you will never reach"---Kernel Hacker, Kosaki Toshihiro (2) | Cybozu Style</a> is published. <a href='_a href=''>"Without deadlines, you run toward a very distant goal that you will never reach.
 
 Before publishing the video, I was going to introduce some other examples regarding the "benefits of setting deadlines," but when I finally published it, surprisingly, I received several responses about Mr. Ozaki calling the study group presentation video "black history.
 
 Think about it. Suppose you are being interviewed and you know that the interview will be the subject of an article. Would you mention the "past that you really don't want people to know about?"
 
 Also, if your "past that you really don't want people to know about" is published as a video, is it conceivable that you would not say "Hey, stop it" to the person who published the video? Is it possible that the organizer of the study group who was told to do so would say, "Oh no, I won't erase it," and continue publishing it?
 
 No, no, it can't be. The video that Mr. Kozaki calls "black history" is not "a past that he really doesn't want people to know about. That was a joke.
 
 In "<a href="http://www.amazon.co.jp/gp/product/4422112570/ref=as_li_ss_tl?ie=UTF8&camp=247&creative=7399&creativeASIN=4422112570& linkCode=as2&tag=nishiohirokaz-22">The Listening Skills of Professional Counselors</a>" said, "Talking about faults and failures is often a way to hide larger faults and failures. By talking about the past, which is not very painful, and saying, "This is black history, but...," you are avoiding talking about further failures.
 
 According to the results of my personal interviews with various people at drinking parties, there are roughly two to three times as many "failures that are not shown" as "achievements that are shown on the surface. And since these "failures" are "failures that can be talked about at the drinking table," I believe that there are probably another 2 to 3 times as many "failures that cannot be told to others" behind the scenes. It is not a bad thing to have failures; on the contrary, it is because we have tried so many challenges that we have our current "outwardly visible achievements".
 
 The reaction to the term "black history" suggests that some people have a stronger fear of "presenting at study groups" than I or Mr. Ozaki assumed, and that the funny story of "My presentation at a study group was recorded on video. (laugh)" is not a funny story but a true black history. What Mr. Kozaki wanted to convey was not "Don't present your presentation at a study group because it will become black history," but "It may be a little embarrassing to have the video left, but it is better to present it. (I confirmed this with him.)
 
 Please note that the purpose of this interview is to explore how engineers learn, not to expose Mr. Ozaki's secrets. If you want to read that kind of gossip, please read the tabloids.
 </body>

[Hatena Diary 2014-08-20 https://nishiohirokazu.hatenadiary.org/archive/2014/08/20]