Hatena2009-03-28
code:hatena
 <body>
 *1238215412*Hacker's Cafe Fes Update
 Video: http://www.stickam.jp/profile/doodoo5963
 So far we've had 7 men and 1 woman in 6 tatami mats, and it hasn't been surprisingly difficult, or there's plenty of room.
 Hack hack hack.
 
 
 Add as needed.
 
 
 f:id:nishiohirokazu:20090328134536j:image
 I got one in the closet so I have more space (oh).
 
 http://www.itoyanagi.co.jp/
 >>
 We offer dishes that incorporate eel, which is also the starting point of Itoyanagi.
 <<
 
 
 itkz attacks yuiseki at QFO
 
 
 I followed akio-san, who wanted to get some air, outside. The burger is delicious. I forgot my jacket, so it is cold. When I returned home, there were 14 men and 3 women. Too many people.
 
 
 f:id:nishiohirokazu:20090328160429j:image
 
 
 I stored AKIO in a closet.
 
 *1238228769*Programmer's Nightmare proposed improvements
 After yesterday's offline versus, I still thought this was too complicated a rule, so I decided to make a simple version.
 First, we go to remove cards that have exceptional processing.
 - OVERSIGHT: "The only command that can be triggered without the bit."
 - PROGRAM_ERROR that the person on the bit without choice will be damaged.
 
 If you remove these two, the rule is "First you distribute the program with a sequence of instructions, alternately placing bits representing ownership and then executing them. When the program counter reaches an instruction that you own, you can decide whether to invoke that instruction or not".
 
 Since there is no longer a "disadvantage card (PROGRAM_ERROR)", there is no need for BIT_MAKER to "create bits of other people's colors" when limited to 2-player matches. (In a 3-player game, it might be more interesting to have BIT_MAKER because the second place player can support the last place player to prolong the game.)
 
 Since there is a BUG that does 1 point of damage to everyone, there should be a DEBUG that heals everyone for 1 point as well.
 
 
 There was a suggestion that the GOTO tip options were too few and difficult to use. The following suggestions are suggested to improve the GOTO: 1: expand the Tobi-Point to +5 to +7 instead of +6. 2: set the Tobi-Point to +6 or -6. 3: set the Tobi-Point to any position further than 6 (i.e. +6 to +8 for two players). 2 and 3 are not good because the REVERSE does not affect the choice of Tobi-Point.
 
 COPY and FUTURE are required; FLOATER needs clarification on behavior; MULTIPLIER is less necessary but should it be kept because of BIT_MOVER; DELETE was renamed to REMOVE_BIT; ERASE was renamed to REMOVE_CARD; BIT_SWAPPER was renamed to INCREMENT; and BIT_SWAPPER was renamed to REMOVE_CARD. SWAPPER was modified so that it can be INCREMENT.
 
 About copying: The contents of the card to be copied are executed as if they were written on the card being copied. If multiple cards are copied, only some of the contents cannot be executed.
 
 Rename SEQUENCE MOD to MOVE CARD; unify INSTRUCTION, CARD, etc. to CARD.
 
 SWAP_INSTRUCTION is also renamed SWAP_CARD. Enhancement of the unwanted child theory. Replace either "two immediately before, two immediately after, or just before and just after".
 Change UPGRADE a card to 1 card.
 
 - ACQUIRE; recover 2 points (3 cards)
 - BIT MOVER; move any one bit to a card adjacent to the card on which that bit is on (2 cards)
 - BIT SWAPPER; Swap any one pair (two bits). However, the bits of a pair must be different colors and on different cards. (1 card)
 - BUG; 1 point of damage to all. (2 cards)
 - COPY; Copies the two most recent instructions. (2 cards)
 - DECREMENT; reduces the Arabic number written on any card by 1. If more than one number is written, you may choose which one to reduce. --expressed by placing a token. (2 cards)
 - DEFEND; Instead of taking 1 point of damage, nullify the damage caused by the two cards executed after this card. Cards not executed do not count. (1 card)
 - REMOVE_BIT; Remove 1 bit from any 1 card. (1 card)
 - REMOVE_CARD; Remove the card immediately before this card. (2 cards)
 - FLOATER; move this card one space forward or backward and copy the next card content in the running order. (2 cards)
 - FUTURE; Copy the two cards immediately following. (2 cards)
 - GOTO; advances the program counter by 6. Once executed, the jump destination is locked to the target card. If the target card is removed, GOTO loses its effect. (3 cards)
 - INCREMENT; Increase the Arabic number written on any card by 1. If more than one number is written, you can choose which one to increase. Expressed by placing a ++ token. (2 cards)
 - MULTIPLIER; All players with bits on this card gain one new bit. The new bit is placed on this card. (1 card)
 - OVERWRITE; Change one bit on a card to a bit of your color. This card disappears once used, and a new card is placed from the deck in its place. The bit on the card remains. (2 cards)
 - POINTER; Redirect the damage you took by the two most recently executed cards to someone else. (1 card)
 - POWER_SURGE; Players who have not placed bits on this card take 3 damage, and users who have placed bits take 1 damage. (2 cards)
 - REPLACE; Draw a card from the deck and replace any one card. The bit placed does not change. ++ and -- tokens disappear. (1 card)
 - REVERSE_PROGRAM; reverses the execution order of the program. (2 cards)
 -- Remarks: If more than one bit is placed, the later player may further reverse the earlier player's decision.
 - SELF_DESTRUCT; deals 4 points of damage to 1 player. This card disappears. (1 card)
 -- Remarks: If more than one bit is on board, they are all lost in the first one explosion.
 - MOVE_CARD; Moves one card to any location in the program. If this card itself is moved, the program counter is moved with it. (1 card)
 - SWAP_CARD; Swaps the two immediately preceding, the two immediately following, or the cards immediately preceding and following.
 -- Remark: if incremented to "3 cards", the order of the 3 cards is arbitrary (1 card)
 - TIME DELAY; obtains a "SKIP" token. This token can be invoked at any time to skip the instruction that currently has a program counter. (1 card)
 - UPGRADE; select a certain position on the program and draw and insert one card there. (1 card)
 - WORM; add one bit of your color to any other card. (1 card)
 - ZAP; 1 point of damage to one other player. (3 cards)
 
 <hr>
 I played two more games with this rule after this one, and it is still important to write the function of the card on the card first. Well, I assumed that and tried to separate each sentence as a short sentence to be written on the card and a captive if there is room. Also, SKIP tokens are strong; maybe we should make it impossible to have more than one SKIP token. Well, for now, I think the next thing to do is to implement the processing system.
 
 *1238245880*Programmer's Nightmare implemented.
 Consider a design that makes it easy to extend and improve the rules.
 
 - The program is several cards. When subroutines are added, this is where things get complicated. At any rate, I think subroutines are bad because they make the rules about three times more complicated, even though their function is simply to add random cards. If you don't consider subroutines, you can simply say "a program is a list of cards. Program :: [Card].
 - A card has a function. A function is a set of "what happens when activated" and "what happens when not activated". Currently, most cards are "nothing happens if not activated," but if you want to incorporate a subroutine-like feature into the rules again, it would be useful to have something like "if not activated, advance the program counter by 3". (if (yes-or-no-p "activate?") then-action else-action). a Card has-a then-action. a Card has-a else-action.
 - A card has "placed bits" Bits :: [Player]. a Card has-a Bits.
 - The then-action and else-action will probably take a context and reference or update it. Values to be referenced include the current program counter, who is the user who executed it, etc.
 -- FUTURE becomes a card with then-action that performs then-action on the card in position PC+1 and PC+2. In this case, the behavior in the case of Card[PC + 1] == GOTO is a little different from the explanation in the game so far: in the case of GOTO and ZAP, the ZAP is not triggered because the PC is moved by GOTO, but the design can cancel the subsequent action when GOTO is performed The implementation is simpler to say "the next instruction is executed because it has already been fetched, regardless of whether the PC is changed by GOTO" than to say "the PC is changed by GOTO".
 - Players have life points. When the life points reach 0, the player dies, but not at the point when they reach 0. In order to determine the phase, it is necessary to run a "game manager" that determines the user's life points after the action is performed, makes a victory decision, and stops the game. The death judgment should be left to the game manager. If it is left to the user object, each user object will need to know the remaining life points of other user objects, which is not good. a Player has-a lifepoint. lifepoint :: Int
 - In order to be INCREMENT or DECREMENT, a card must have zero or more "changeable values" POWER_SURGE has [3, 1]. Each individual card instance must have this value. Cards must have an initial value for this number.
 - The behavior of SKIP is not clearly defined in the rulebook. However, after today's play, I thought that it needs to be weakened to some extent, so I think it would be better to implement "SKIP temporarily rewrites the then-action of a particular card with then-action to 'do nothing'". Well. I guess the exact implementation would be "replace then-action with a function that 'reverts then-action back to the original and PC++'".
 - DEFEND and POINTER are so difficult.
 - In order to be able to POINTER, we need to cache who did how many points of damage in the last two actions.
 - In order to be able to DEFEND, it is necessary to retain "how many actions have elapsed since the DEFEND was triggered".
 - Allow a GameManager to register "Event Handlers to be called after an action is executed" a GameManager has-a EventHandlers. EventHandlers :: [Function].
 - Player's life points are not directly increased or decreased, but must be able to be hooked and nullified before damage by DEFEND
 </body>

[Hatena Diary 2009-03-28 https://nishiohirokazu.hatenadiary.org/archive/2009/03/28]