Hatena2007-12-02
code:hatena
 <body>
 *1196553651*9:00 pm
 I woke up.
 
 Good morning, Makaroni.
 
 *1196557921* at 10
 Not too many people yet.
 
 *1196558712*Unexplored Youth Final Presentation Day 2
 ** Outpost
 -Small machine brought by Mr. Kawai
 --http://www.icop.co.jp/products_detail.asp?ProductID=258
 -- $99
 -I wonder if the biggest problems in carrying a machine like this will be the size, weight, and fragility of the LCD. I wonder if it will be e-paper.
 
 ** It's started.
 - Few alumni who went to the after-party showed up and shrugged their shoulders.
 - While it was taking a long time due to monitor trouble, more people were coming in.
 
 ** CC-Optimizer
 - Accelerate PostgreSQL by considering cache
 - Using Buffering Operator
 - SELECT in SQL ... WHERE ... If one of them is not in the C1 cache, it is a waste of time to repeatedly insert, discard, and insert and discard...?
 - Up to 74% and 6% to 17.5% faster overall.
 
 ** Dripping
 - Communication among users has been lost from the library.
 -- Visualization and suggestion of lending history information, user clustering
 - Social networking through books
 - Borrowed books automatically flow into a private tab (bookshelf) and are made public when you drag and drop them onto your own public "programming" bookshelf, for example.
 - Compared to making a book list on Amazon now, it seems to have the effect of lowering the threshold because a book list can be made simply by "automatically putting borrowed books on a bookshelf and sorting and arranging them on different shelves".
 - An infinite screen with a book smashed on it scrolls languidly on the browser. It would be interesting to be able to zoom out and see the whole thing.
 - Put books found on a friend's bookshelf on your own bookshelf = [read later] tag
 -- I wonder if it would be possible to reserve the book as is, or if it could go into a "stackable" bookshelf.
 - Suggest from the book borrowed by the girl you are interested in → Borrow first → Real "Ears to the ground" support
 - I thought it might be nice to have some kind of "borrow later", "buy later", "buy", or "borrow" tag.
 
 ** <strike>lunch break</strike> mechanism to have the schedule written
 - It's so big when you zoom in!"
 -- That's because it's expanding!
 - A presentation where we all attack DoS and the servers go down.
 
 ** Sequential Graphics
 - Sequential Graphics, the one you've all been waiting for!
 - I wonder if it is possible to create a sense of presence that is only possible on a PC.
 - It was difficult to get the pressure of the tablet in Processing, so I ported it to C++.
 - A menu that can be used without looking at it.
 -- The menu leads naturally to mouse gestures.
 --- apparently it's called the pie menu.
 --- I heard you should read the paper on pen device interaction.
 - Oh, wow, 3D color picker, gurrrrrrrrrrrrrrrrl!
 - Pen substitution with any image
 - great (e.g. of skills)
 -- A Japanese folktale with a good presentation
 - It's a neat new thing. It was pretty amazing from the start, but they didn't just make it faster, they created a new experience. It's amazing.
 - Generate from the surroundings with completion where the mouse moved too fast to pick up.
 - Sound also included. Simple sequencer! This is amazing!
 - Dr. Takeuchi, whose beard expands and contracts w
 - Yamaha's DX7 produced a sound that could not be achieved without it, and that's how techno was born.
 
 **Global illumination considering MPEG compression
 - struggling to understand what is going on in a given situation
 -- Computer Science Makuchupuranku is in the middle of nowhere, so there's nothing there but computers.
 - Toy Story took three years to render alone.
 - Even if you do your best to render it beautifully, errors are introduced in the process of compressing it with MPEG. It is a waste. Then, it is faster to check how many errors are likely to occur and stop rendering at that level of accuracy.
 - It's very cold.
 - Apparently Pixer does not compress the movie to DVD, but changes the parameters separately.
 
 **end
 -Social IME: http://www.social-ime.com/
 -Kawaii Award is missing.
 --I prepared for the Nishio Award thinking that if we were going to give out the Kawai Award...
 --The Nishio Prize, for which no prizes were awarded, went to Mr. Matsubara for his whiteboard. UI is very important when targeting general users. In order to create a good UI, it is important to conduct proper user testing. The fact that they conducted user testing over a long period of time is commendable.
 ---After we were done, I was shown the manual that was created during the user test, and I thought that if they created such a neat manual, it should be more appealing to the public.
 --I think I did not explain myself well enough because I made the presentation materials in a super-rapid fashion. Above all, it was difficult to understand because there was no slide at the last part of the presentation, "Who will receive the award? I was supposed to give the award to the "4-Dimensional Experience Game" because I used to play 4-D Unya Unya, but in fact, I created an artificial brain long before that, so I would like to give the award to the "Brainstorming Engine" with an artificial brain! And more people don't know that I was doing that...
 - I want to save my desktop state when I am working on a project A, and if I am working on a project B, I want to save the environment in which I am about to work on A.
 -- "It's OK to create a user account.
 --- Oh, that's it! Great life hack.
 --- How to write org. myself who makes org. myself who studies ActionScript.
 -circling the circle of acquaintance
 -- We all derived the formula for layer composition. All that's left is to implement it!
 
 *1196596803* done.
 
 Super creepy.
 </body>

[Hatena Diary 2007-12-02 https://nishiohirokazu.hatenadiary.org/archive/2007/12/02]