Hatena2010-04-20
code:hatena
 <body>
 *1271743990*What to use for code reading (summary)
 (Reprinted in summary because it would drift away on Twitter.
 
 >>
 nishio What does everyone use to read source code?
 <<
 
 >>
 I guess around shibukawa grep, a text editor, and a homebrew log output decorator (Python only)? I haven't done much.
 <<
 
 >>
 hmori There are many tools, but another useful one was TextMate (OSX Sureware). Just create a project and throw it in the project folder, and you can see the source code files in a tree and open it with a single click. Well, that's all there is to it.
 <<
 
 >>
 About voluntas vim and ctags.
 <<
 
 >>
 kumarobo less(lv), cat -n, grep, emacs(xyzzy). Sometimes I accidentally start visual studio.
 <<
 
 >>
 jmuk I guess other than text editors, grep, viewsvn, etc., maybe global.
 <<
 
 >>
 I often create a tags file with ug_idol ctags and read it while jumping around in vim!
 <<
 
 >>
 snowclust If it's C, I use vim's srcexpl,taglist,cscopes_maps scripts, and sometimes cflow. Sometimes I use graphviz to make it spit out dot. SourceInsight is also used when it's too much trouble.
 <<
 
 >>
 iakio If it is in C, it is cscope + vim
 <<
 
 >>
 Maki_Daisuke This may be a common thing, but I think Eclipse is the best for Java, and VS is the best for C++ and C#. I still haven't found anything that fits in Perl or JavaScript. Padre might be a good choice if you just want to read.
 <<
 
 >>
 masanobuimai It's IntelliJ, as usual. :-)
 <<
 
 >>
 I use watermint OpenGrok and others, but in the end I use LESS. I think I read (or see) at least 3 million lines with this.
 <<
 
 >>
 bravotan For windows, I'd say xyzzy and Eclipse, for apples and penguins it's emacs and some weird filter command chain.
 <<
 
 >>
 Milly vim -R
 <<
 
 >>
 kituneponyo Hidemaru
 <<
 
 I use "less" to look at Python code and "ack --python" to search Python code. Last year I learned about global(gtags) and thought it was useful, but it is for C. I wondered if there was anything like global for JavaScript or Python.
 
 <hr>
 PS
 >>
 Matthew238 When I read Linux Kernel, it's LXR.
 <<
 
 >>
 monjudoh I mainly use an editor for JavaScript code reading, but I also use Firebug, because FireRainbow allows syntax highlighting, and if I want to see a function, I can put a reference to the function in the console and click on it to jump to the corresponding line. and click on it to jump to the corresponding line.
 <<
 
 From the comments on the web site:.
 >>
 I guess te2u vim + ctags. I often forget /vim -R
 <<
 
 >>
 nobyuki git is also useful. git-svn allows you to read svn repositories using git commands.
 <<
 
 **1271758921*[Kaizen] Put the dishes on the table.
 I understand now. I understand why I couldn't wash my dishes.
 
 In my parents' house, there was a chest for dishes called a mizuya-dansu. The washed dishes were stored there. Now that I live alone, I don't have such a facility. If I put them in the right place, they were covered with dust when I used them.
 
 I wash them to remove dust before using them, so if I wash them right after eating, I have to rewash them anyway. So I don't feel motivated to wash dishes right away. Even if I do my best to wash the dishes occasionally, I am quickly frustrated. In this situation, the reasonable option is to "leave the dishes in the sink and wash them before eating.
 
 And the "leave the dishes to wash before eating" style brings ruin when there are long gaps between meals. White moiré and green clumps will occur. Then they enter the phase of "it is easier to eat out than to wash dishes and cook for themselves.
 
 The correct answer was neither "wash dishes as hard as you can" nor "don't use dishes. What needed to be improved was how to store the dishes; I bought a rag from a 100 yen store and put it over the dishes. This way, dust does not accumulate.
 
 *1271765247* drawing of the day
 It's hard to pass! I was lamenting about it, and he taught me a lot of tricks.
 <img src="http://gyazo.com/19db6cc2bb1f99f7212d77d6f01a3734.png">
 After 1 hour: 1 hour
 <img src="http://gyazo.com/4118c2c06a710d38c87bc84c4752afba.png">
 
 To recap.
 - Don't try to do everything by path, use primitives such as circle, ellipse, etc.
 - When doing boolean operations on paths, it is difficult to handle unless stroke is none.
 - Concentric circles are larger in the foreground because of perspective. The sphere dips slightly downward.
 I guess.
 
 Recently, I have seen many drawing process videos that show the process of painting, but I have never seen a drawing process.
 
 For your information, the process of the sorcerer's hat:.
 <img src="http://gyazo.com/13fda079deb6007d709f46ffe8773209.png">
 The ochre part was made by combining black and red and then shifting them slightly and taking a diff.
 
 *1271784720*[cocos2d]Changed the image of Sprite
 I'm not sure if it's right to use Sprite in that way in the first place. With a Sprite instance self already in place
 >|objc|
 [self initWithFile:@"v1.png"];
 ||<
 The displayed image can be replaced with a new one. However, the position is reset to (0, 0) at that time.
 therefore
 >|objc|
 CGPoint pos = self.position;
 [self initWithFile:@"v1.png"];
 self.position = pos;
 ||<
 I'm OK with this.
 </body>

[Hatena Diary 2010-04-20 https://nishiohirokazu.hatenadiary.org/archive/2010/04/20]