Hatena2011-09-17
code:hatena
 <body>
 *1316221420*GTD Diary 2
 GTD books (<a href="http://www.amazon.co.jp/gp/product/4576082116/ref=as_li_ss_tl?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247& creative=7399&creativeASIN=4576082116">GTD for Beginners Stress-Free Organizing</a> and <a href="http://www.amazon.co.jp/gp/product/4576101714/ref=as_li_ss_ tl?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399&creativeASIN=4576101714">GTD Practice</a>) to refine my task management.
 
 It sounds good to say that I used to manage my TODOs in ~/todo.howm and ~/ituka.howm, but I was not managing my TODOs, because I would just shove whatever came to mind into my TODOs, and when they got full, I would just move them to ituka and review them only rarely. He has been using ituka since 2009-03-07.
 
 Just "writing down everything that's on your mind" won't relieve stress. Regular review is essential. You can only become stress-free when you have a set of "I'll reread what I wrote here every week, so I can forget about what I won't do this week if I write it down here.
 
 I cleaned up todo.howm and ituka.howm and was looking for other scattered files, and lo and behold, ~/pomodoro/activity.howm was there too. I think I created it when I started using the Pomodoro Technique. I put them all in the INBOX. Then, I put the contents of the INBOX into the "ITUKA", throwing away what I don't need, moving what I will do this week into the "ACTIVITY", and formatting the rest of the INBOX. I just put everything away. But in the end, ITUKA has 344 rows.
 
 I found this in the old ituka.howm, but I wonder if I did this task right...
 >||
 - □Fixed amount benefit
 -- □← Copy of bankbook and driver's license
 ||<
 
 
 New File Structure:.
 >||
 - ~/howm
 -- inbox.howm # put whatever comes to mind here anyway, empty it as soon as possible
 -- todo.howm # Today's TODO, don't write the amount you can't do in a day
 -- activity.howm # TODO this week, don't go beyond one screen
 -- ituka.howm # What I want to do someday
 -- waiting.howm # tasks where the ball is in someone else's court
 ||<
 
 Last time, I mentioned that I still don't have a solid understanding of vertical thinking, but when I casually opened my first GTD book, I found this very thing on p. 78.
 
 About 80% of the tasks are simple enough that you can quickly figure out "what to do" with just a little thought. But the rest cannot be organized in the mind alone and need to be thought about while writing. Clarify the purpose of doing it, what is the desired result, and think about what needs to be done to achieve it, and what are the concerns. Write down everything that comes to mind. Then organize them and choose one thing to do next. If you don't feel motivated, try this "planning" process again. When did the purpose of doing it actually become unappealing? Has the original desired result already been achieved or become unattainable, making the rest of the task pointless? Purpose -> Image of the results to be obtained -> How to do it -> Organize and consider what is really important.
 
 The units above tasks are explained from p. 231 as "one more perspective is important. The biggest reason why project thinking is not being used effectively is that "there is no place to collect and manage ideas. Ideas are not necessarily TODOs, so there is no place for them in a task management system. We tend to write unworkable notes on our TODOs and unconsciously avoid thinking about them. So where do we store them?
 
 I just dropped the book, picked it up and opened it to P175, where there is a section on "storing ideas that inspire you about your project". I guess it's just a coincidence, but it's fun to think that maybe it's the effect of photo-reading. Aside from that, the author uses a loose-leaf binder to keep track of his ideas, although there are various ways to store them, including paper and databases. The first page is a list of projects, and the back of the list is the reference information of the projects. Hmmm...
 
 ~/howm/projects.howm should be the list of projects. Don't make a mess here. And put references under ~/howm/ref/. It is confusing because there are many different places to put them. For example, they may be in the root of the repository, or they may be found by keyword search on "howm", etc... It is not necessary to put them all in one place, but it is better if possible, and even if it is not possible to put them all in one place, it should be possible to review them all in one place. projects.howm is the entry point for the project being run, and if you follow the links, you should be able to find what you need. If you can follow the links, you should be able to get to what you need.
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4576082116" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe><iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4576101714" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 </body>

[Hatena Diary 2011-09-17 https://nishiohirokazu.hatenadiary.org/archive/2011/09/17]