Hatena2007-10-27
code:hatena
 <body>
 *1193450703*Python温泉2日目
 
 *1193450704* Notes.
 MOPEMOPE flies by magic.
 Abby on the threshold (in a wizardly way)
 
 ---
 
 追記：
 Abby Abby, a mischievous group of hackers from a magical land
 (<a href="http://www.mahoroba.ne.jp/~gonbe007/hog/shouka/mahoutsukaisarii.html">Sally the Wizard</a>)
 
 *1193451490*Current Climate
 Precipitation 4.0 mm, wind 10 m/s. A perfect day for a barbecue.
 
 *1193452407*Jython
 [Review] BOOK REVIEW - Experiencing the World of Multiple Scripting Languages Merging on Java | Enterprise | My Comi Journal
 http://journal.mycom.co.jp/articles/2007/10/25/java/
 
 I'll read it next time.
 
 *1193461409* Hatena Diaries
 I didn't realize that when you click on the heading, it goes into edit mode.
 
 *1193461596*Fortranの昔話
 It's a loop with do i = 1,10, but I mistakenly wrote do i = 1.10, which was interpreted as doi = 1.1 and the satellite got lost.
 
 ===
 
 I googled it.
 <a href="http://d.hatena.ne.jp/kmori58/20051208/p3">FORTRAN DO statement and fallen rocket folklore - kmori's programming diary as a story</a>.
 <a href="http://d.hatena.ne.jp/minekoa/20071012/1192205577">Automatic Ticket, Rocket and FORTRAN - Minekoa</a>.
 The exact point was a bit different, apparently.
 
 ===
 
 Wikipedia's FORTRAN article also had this.
 
 *1193479093*rename
 Python温泉 => Python台風
 
 *1193484101*嵐
 yoshiori and mopemope are trolling the komaku channel at an epic rate.
 Frankly, I'm crossing the line (in a sexual sense).
 
 *1193484578*報告
 The yoshiori channel is currently broadcasting a live Python spa, and the camera microphone is picking up the sound of yoshiori's intense typing, but it is not coding, it is the sound of him entering the Komaku channel's Halloween broadcast with an IRC client, repeating static and obscene words. It is the sound of copy and paste trolling. I believe you can see five people sitting on a couch operating a machine, all watching Ustream.
 
 <del datetime="2007-10-27T21:49:19+09:00">The theory is that Isoparametric is about 50% perverted compared to us because he is not participating. </del> While yoshiori was away, Isoparametric was writing terrible content under yoshiori's name (that's what we want to say).
 
 I'm working through it, and before I know it, they're saying I'm the main culprit.
 
 *1193489359* Chat
 
 People are creating too many chat rooms, it's impossible to keep up with Skype, Ustream, Lingr, IRC and Twitter at the same time.
 
 *1193489642* Vandalism Target
 
 komaku chat has ended and yoshiori is looking for a new troll target.
 
 If yoshiori relays Lingr's comments to IRC with a bot, everyone can just look at one place, right? I think it's a good idea. Is it a spirit of self-sacrifice to be treated as an aggressor temporarily for the sake of world unity and true peace?
 
 *1193491217*盗撮
 Scared of the danger of being filmed by the mopemope camera, she took a bath while distracted by the IRC.
 
 *1193491975* re: Jython
 CodeZine：Java meets Python - 第0回 Jythonはじめました（前編）（java, Python）
 http://codezine.jp/a/article/aid/1714.aspx
 CodeZine：Java meets Python - 第0回 Jythonはじめました（後編）（java, Python）
 http://codezine.jp/a/article/aid/1727.aspx
 
 You asked me if I wrote it, but I didn't.
 
 ---
 
 Let's see, I'll add a little more to this without getting too DIS-oriented,
 
 >>
 The command jythonc can be used to generate .class files from Jython source code. (omitted) In this way, a merged Java/Python world can be realized.
 <<
 
 This is a huge waste of time. You can run code written in Python at runtime without having to create a .class file. I'm a little worried that my editor will get mad at me later for quoting from a Jython book I'm writing:
 
 >|java|
  1: package org.nhiro.jybook;
  2: 
  3: import org.python.util.PythonInterpreter;
  4: 
  5: /**
  6: * Read Python code from a file and run it.
  7:  */
  8: 
  9: public class HelloJythonScript_1 {
 10:     public static void main(String[] args) {
 11:         PythonInterpreter pyi = new PythonInterpreter();
 12:         pyi.execfile("scripts/HelloJythonScript/init_1.py");
 13:     }
 14: }
 ||<
 
 By the way, the approach "write code in Python, make *.class in jythonc, import it on the Java side, and import it..." would kill the advantage of Jython (the ability to change behavior without compiling). I think it is better to take the approach of "importing and using components written in Java on the Python side. If all frequently changed parameters and logic are exported to the script side, they can be changed without a compile environment.
 
 *1193494925*開発合宿情報集積
 I wish there was a place that had all the information about the development camps...
 
 http://www.kaihachu.com/archives/2007/01/post_16.html
 It is difficult to tell at a glance how many people are in the group.
 When looking for a place to hold a Python spa, the prerequisite is that a room where 20-30 people can gather is available 24 hours a day....
 
 It would be nice if there was a form that could be narrowed down by the various "requirements for a development camp".
 
 As for this development camp, they have been looking around for a meeting room where they can use wireless LAN, but they found it difficult to find one. They are seriously considering the idea of increasing the number of lodges that can be used for development camps.
 
 - Do you have a large meeting room?
 - Is there a hot spring?
 - Bath 24 hours a day?
 - Net connection thickness
 - Is there wireless LAN?
 - Power supply capacity (can everyone use the computer?)
 - Surroundings (convenience stores, supermarkets, restaurants, etc.)
 
 *1193496185*Nuts
 
 1 kilogram of kakipi, 1 kilogram of cashew nuts
 
 
 f:id:nishiohirokazu:20071027234342j:image
 </body>
 <comments>
 <comment>
 <username>jbking</username>
 <body>jreload期待age</body>
 <timestamp>1193494406</timestamp>
 </comment>
 </comments>

[Hatena Diary 2007-10-27 https://nishiohirokazu.hatenadiary.org/archive/2007/10/27]