Hatena2014-06-06
code:hatena
 <body>
 *1401983909* "Natural Language Processing with word2vec" was published.
 O'Reilly Japan has published an e-book titled "<a href='http://www.oreilly.co.jp/books/9784873116839/'>Natural Language Processing with word2vec</a>". It took me a while to introduce it on my blog due to unplanned slapstick, but in the meantime, it was ranked No. 1 in O'Reilly's Ebook Store Sales Ranking.
 
 word2vec is a new technology that was just published in a paper in 2013. Various people have blogged about it and many are interested in it. Here are some links for those who are not familiar with it:
 
 - I played a little with <a href='https://plus.google.com/107334123935896432800/posts/JvXrjzmLVW4'>https://code.google.com/p/word2vec/. With so called deep learning...</a>
 - <a href='http://naoyat.hatenablog.jp/entry/2013/09/05/230947'>Can deep-learning learn latin verb conjugation? Can deep-learning learn latin conjugation? - naoya_t@hatenablog</a>
 - <a href='http://saiyu.cocolog-nifty.com/zug/2014/02/word2vec-1867.html'>How to run word2vec when I know nothing about natural language processing: a maximum likelihood diary</a>.
 - <a href='http://antibayesian.hateblo.jp/entry/2014/03/10/001532'>Try to pull tits from Kaga-san using "word2vec", the latest method of natural language processing - Anchibe! </a>
 - <a href='http://blog.createfield.com/entry/2014/04/07/203125'>Trying word2vec with data from Japanese and US patents - CreateField Blog</a>
 
 The goal of this book is to enable readers to do this kind of thing, starting with the first chapter, which explains how to use various data (corpora) in detail, including the actual source code used, in Chapter 2. Examples are Twitter, Hatena Diary, Facebook, electronic dictionaries (Iwanami's Dictionary of Science and Chemistry and Dictionary of Biology), electronic books (scanned + OCR'd PDFs, originally PDFs), and Wikipedia.
 
 Chapter 3 onward explains why word2vec was created, what it is useful for, and what weaknesses it has.
 
 The appendix also presents a script that visualizes the results of word2vec and explains the advantages and disadvantages of the principal component analysis used in it. With this script, for example, you can create a figure like the one below.
 
 [f:id:nishiohirokazu:20140606005140p:image]
 
 The names of the programming language, the database, and the operating system are mixed together, but you can see that they are roughly divided into three categories. Humans are not told which is the programming language and which is the database, but word2vec judges from the given text that the words have similar meanings and places them close together.
 
 Please do not hesitate to contact us if you have any questions or concerns about any part of this document that you find difficult to understand.
 </body>
 <comments>
 <comment>
 <username>tnal</username>
 <BODY>Report on a point of concern regarding an errata or wording. <br><br>(1) p.61, Chapter 4, paragraph following Figure 4-6, regarding figure reference numbers in parentheses. <br><br>Error: figure 4-6<br>Positive: figure 4-7<br>is that correct? <br><br>(2) p.57, chapter 4, "Neuron Y sums the transmitted signals x1w1 x2w2 x3w3." About. <br>While this is understandable because of Figure 4-2, I felt that the text would be easier to read if it were stated as "x1w1, x2w2, x3w3" or, as an analogy in C, "x1*w1, x2*w2, x3*w3" rather than space-separated. </body>
 <timestamp>1409546171</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Thank you! I will fix it! </body>
 <timestamp>1422782633</timestamp>
 </comment>
 <comment>
 <username>toro</username>
 <body>Won't you sell it in bookstores? </body>
 <timestamp>1424499346</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>We have no plans to do so. </body>
 <timestamp>1425745313</timestamp>
 </comment>
 <comment>
 <username>conb</username>
 <body>I can't access the e-book purchase site...</body>.
 <timestamp>1446110985</timestamp>
 </comment>
 </comments>

[Hatena Diary 2014-06-06 https://nishiohirokazu.hatenadiary.org/archive/2014/06/06]