Hatena2014-02-21
code:hatena
 <body>
 *1392962370* Why I'm glad the big corporate OSS is Apache License 2.0.
 The clause "We grant you a worldwide, non-exclusive, royalty-free, irrevocable patent license for an indefinite period of time" means that if the user thinks "Wow, this is a useful library! The clause says that this prevents the tragedy of the user thinking, "Wow, it's a useful library!
 
 >>
 3. grant of patent licenses
 Subject to the terms of this License, each Contributor grants you a perpetual, worldwide, non-exclusive, royalty-free, irrevocable (except as expressly provided in this section), worldwide, royalty-free, irrevocable (except as expressly provided in this section) license to make, use, sell, offer for sale, import, and otherwise transfer the Work Product A patent license is granted. Such license, however, applies only to patent applications licensable by a Contributor that are necessarily infringed by the use of such Contributor's Contribution alone or in combination with the applicable Work Product. If you file a patent lawsuit, including any cross-claims or counterclaims, against any person for direct or indirect patent infringement of the Deliverables or any Contributions incorporated into the Deliverables, the patent license granted to you under this License shall terminate upon the formal filing of such lawsuit. shall terminate upon the formal filing of such suit.
 <<
 http://sourceforge.jp/projects/opensource/wiki/licenses%2FApache_License_2.0
 
 On the other hand, if you file a patent lawsuit against the provider or others, this free license will be terminated at that time. So it's a deterrent.
 
 With this clause, it is no longer compatible with GPL v2. (This has been corrected after you pointed it out in the comments; it is compatible with GPL v3.)
 </body>
 <comments>
 <comment>
 <username>omasanori</username>
 <body>s/Compatibility with GPL/Compatibility with GPLv2/. (L)GPLv3 and the Apache License 2.0 are compatible. </body>
 <timestamp>1392963838</timestamp>
 </comment>
 <comment>
 <username>piro_or</username>
 <body>The incompatibility is with GPLv2, and GPLv3 is now compatible with the Apache license. https://www.gnu.org/licenses/rms-why-gplv3.ja.html</body>
 <timestamp>1392964232</timestamp>
 </comment>
 <comment>
 <username>None</username>
 <body>http://www.apache.org/licenses/GPL-compatibility.html<br>It is not compatible with GPL v2, but it is compatible with GPL v3. </body>
 <timestamp>1392966268</timestamp>
 </comment>
 <comment>
 <username>shibu_jp</username>
 <body>As you can see from the buzz comments, it is compatible with GPL v3. Because of that(?) but GPL v2 and GPL v3 are not compatible... </body>.
 <timestamp>1392998579</timestamp>
 </comment>
 <comment>
 <username>姉崎</username>
 <BODY>It's time to translate "compatible" as "compatibility" instead of "interchangeability". (Hatta's suggestion)<br>"GPLv3 and Apache License 2.0 are interchangeable (compatible)" does not mean "GPLv3 OSS and Apache License 2.0 OSS can be combined to form a work, but each license is valid (compatible)". Therefore, it is not "GPLv3 OSS and Apache License 2.0 OSS". </body>
 <timestamp>1393853213</timestamp>
 </comment>
 </comments>

[Hatena Diary 2014-02-21 https://nishiohirokazu.hatenadiary.org/archive/2014/02/21]