Hatena2010-04-22
code:hatena
 <body>
 *1271911883*Memo for myself on how to make an iPhone/iPad app.
 To do this, you need to record your steps and revise and refine them over and over again, so record them anyway." Sequel to <a href='http://d.hatena.ne.jp/nishiohirokazu/20100407/1270648462'>my own notes on how to create new apps using Django and Kay</a>. This time an iPhone/iPad app.
 
 ** Keep OS and XCode up to date
 I wrote the code and tried it on my iPad and iPhone, but was disappointed that I couldn't install it on the latest machine with the version I had last installed. I'm not sure what to do. I was disappointed again when I tried to update Xcode, only to be told that it had to be Snow Leopard.
 
 ** 新しい開発用Provisioningを取得
 If the old Provisioning has expired, create a new Provisioning and delete the old one. If you don't do this -> <a href='http://d.hatena.ne.jp/nishiohirokazu/20100421/1271870248'>(Solution)I haven't made an iPhone app in a while and got an Error launching remote program:. Security policy error.</a>
 
 ** Create an icon
 PNGs of 57x57 and 512x512. they will add rounded corners and light effects on their own, so you don't have to make an elaborate design if it's too much trouble.
 
 ** Info.plistを変更
 アイコン、Bundle Display Name(表示名)、Bundle Identifier(他の人と重複しない識別子)
 
 ** Paid Applications contractを結ぶ
 You only need to do it once. If you try to apply for an app without doing it, the process may not be smooth and you may get confused. <a href='http://d.hatena.ne.jp/nishiohirokazu/20091014/1255498505'>Apply to the AppStore</a>
 ** Provide a support page and support email address.
 
 ** Consider a commentary of 4000 English characters or less.
 
 ** Get Provisioning for distribution (if any)
 Provisioning for development expires rather quickly, but not so for distribution.
 間違えて開発用Provisioningで署名すると「The binary you uploaded was invalid. The signature was invalid, or it was not signed with an Apple submission certificate.」と怒られる
 
 ** Change project configuration
 Copy the settings for the Release build to create the settings for Distribution. Change the code signing to a certificate for Distribution. Build with Distribution as the active configuration. Make sure that a folder with a name like "Distribution-iphoneos" is created in the build folder of the project. Zip the application in it.
 
 ** iTunes ConnectのManage Your Applicationを開く
 SKU is a product identification code, so enter a number that does not overlap with other applications as appropriate.
 </body>

[Hatena Diary 2010-04-22 https://nishiohirokazu.hatenadiary.org/archive/2010/04/22]