Hatena2008-04-25
code:hatena
 <body>
 *1209083439*[Python]# -*- coding:utf8 -*-について
 http://d.hatena.ne.jp/hamatsu1974/20080425/1209073114
 >>
 I thought it was a comment line if it started with "#", but I wonder if I shouldn't suddenly feel uncomfortable that I can't use Unicode (UTF-8) without it.　Do "#-*-" and "-*-" play some special role?
 <<
 
 >>
 I guess I should understand that "#-*-" and "-*-" do not have the same role as tags.
 <<
 
 The "-*-" is a kind of tag that tells Emacs, a text editor, the character encoding and so on. The expression "# -*- coding:utf8 -*-" tells both Emacs and Python that the file is utf8. According to the entry below, Gauche uses the same method to tell both Emacs and Gauche the encoding.
 
 http://d.hatena.ne.jp/rui314/20061224/1166918873
 
 -----
 >>
 rubikitch This is also true in Ruby 1.9.
 <<
 What about Perl or something like that?
 
 *1209093272* It's time to write about "I want to learn programming".
 Recently, I have seen several people who said, "I don't have anything in particular I want to build, but I want to learn programming!" I'm not sure what I want to make, but I want to learn how to program! Many people around them make irresponsible recommendations like "Perl is good" or "Python is good," so it's easy to be confused by the number of choices. But if you compare programming languages to handsome men, you are like a girl in love. People around you are always saying, "Mr. A of the soccer team is so cool! No, I like Mr. B of the chemistry club for his intelligence! Glasses! White coat! I want to join in the conversation, but I can't decide whether I prefer Mr. A or Mr. B.
 
 
 It's amazingly ubiquitous! It's heartwarming!
 
 
 In the essay <a href="http://cruel.org/freeware/hacker.html">How To Become A Hacker (How To Become A Hacker)</a>, the following is said.
 >>
 If you know only one language, you are not a hacker or even a programmer. You are not a hacker because you must learn a general way of thinking about programming problems that does not depend on one language. To be a true hacker, you must be able to learn a new language in a matter of days by relating the descriptions in the manual to your previous knowledge. This means that you should learn several completely different languages.
 <<
 
 In other words, "I love you, A!" and you're not even a programmer when you're dazzled by one person. It's a hacker (or geek, as they call it nowadays?) who has two or three jobs, and when he has some purpose, he calls up the most convenient guy (like having a car) and uses him. It is a hacker (or geek, as they call it nowadays?). And by gaining such experience, you need to learn not specific men, but general "insight into the male creature" and "how to play with men. In other words, geeks are bad girls. Some geeks have a specific steady language, but it's not a geek if you've only ever done that specific language. A geek is the one who picks up other men and then says, "I still like ____.
 
 You're so cool!" When people are saying, "B is so cool! But when they say, "B is cool! is just saying, "(I like) B-kun! It does not mean "You should love Mr. B! It doesn't mean "You are the one to love! You have to find out what it means by yourself, not by having someone tell you. And it is rare to have a lifelong relationship with your first love. Worrying about who to choose first is a waste of time. Maybe worrying and ranting is fun in itself.
 
 ------
 
 The people who are ranting and raving around you are irresponsible. The appropriate language depends on what you want to do, and the first question you should ask is, "What do you want to do?" I think the first thing to do is to ask the question, "What do you want to do? JavaScript is not a bad choice, but it is not appropriate if what you want to make is a web service, Python is a good choice, but if what you want to make is a <a Python is also a good choice, but if what you want to do is tinker with <a href="http://www.chumby.com/">chumby</a>, ActionScript2 or <a href="http://nadesi.com/about/loadmap200512.htm">Nadeshiko/Aoi</a> is probably the way to go. After all, everyone is just saying it because it's a chance to say, "I love you, A-kun! I'm just saying this because it's my chance to say "I love A-kun!
 
 ------
 http://d.hatena.ne.jp/asami81/20080424/P1
 >>
 In my case, I think there are some things that I have to learn before I choose a language. I don't know what it is. I don't know what it is.
 <<
 No, it's not! Not at all! First you pick a language, you chew on it, then you pick another language, you chew on it, then you pick another language, you chew on it, then you learn something that says, "You must learn this one thing! You'll learn something that you're not supposed to learn! The order is backwards!
 
 
 ------
 By the way, advertising.
 
 Java and Python have completely opposite personalities, but they are actually <s>dating</s>, or rather, they are actually good friends, and although Java himself is very guarded, he can easily access private places via the frank Python. Python is more frank and easy to be friends with than Java. I mean, Python-kun is terrible, he hid it under the bed so that Java-kun wouldn't see it, but he took it out and scattered it around! (><)
 Java wants to clean up and compile, but Python wants to do whatever it wants to do, including inserting a button into a window at runtime and moving a button to another window! Aah!
 
 This is a BL book about the shared life of two handsome men called <A href="http://www.amazon.co.jp/dp/4839922829?tag=nishiohirokaz-22&camp=243&creative=1615&linkCode=as1&creativeASIN=4839922829& adid=11J78NXZRK5MG4CHWRZ4&">Jython programming</a>. Sorry, it's a lie.
 
 *1209135445*終電
 
 Oh no. I forgot the time. I also forgot to eat the onigiri I made for lunch. I didn't realize how hungry I was. Has it been more than 12 hours since I made it? Ugh.
 
 
 It's crowded, but there are no seats available. Is it because I can't get off the train if I sit down? That's not very efficient.
 
 *1209141900* 1000 Speakers Conference today.
 For more details, please see
 http://d.hatena.ne.jp/amachang/20080425/1209091183
 
 For more information, please see
 http://ja.doukaku.org/wiki/index.php/1000speakers:4
 
 The event will be broadcast live via Ustream, so you can participate online by accessing the URL below. The recording will be uploaded to Nico Nico Douga as soon as possible.
 http://www.ustream.tv/channel/1000speakers
 
 You can chat in the Ustream chat room during the event, or connect with an IRC client.
 The chat log looks like the one below. It is quite lively.
 http://ja.doukaku.org/wiki/index.php/1000speakers:3:irclog
 Questions from those participating via Ustream are welcome. Maybe if you ask a question with @amachang or something like that, amachang will pick it up during the Q&A session (and the method I'll say on my own).
 </body>
 <comments>
 <comment>
 <username>rubikitch</username>
 <body>This is also true for Ruby 1.9. </body>
 <timestamp>1209092832</timestamp>
 </comment>
 <comment>
 <username>asami81</username>
 <body>God found me! <br>There are so many things I want to do,<br>but first I have to ask myself, "Is this possible? Is there something I should do first?" I'm the naive bad girl who thought, "I don't know! <br>I see. I see. <BR><BR>"Geeks are bad girls, aren't they? <BR>"How to play a man's hand"...! <BR><BR>At any rate, this entry was very easy to understand and I am very, very grateful for it. <br>Thank you very much. </body>
 <timestamp>1209098291</timestamp>
 </comment>
 <comment>
 <username>hamatsu1974</username>
 <body>Oh! Thank you for your prompt support. I will add it as soon as possible! </body> <body>
 <timestamp>1209100132</timestamp>
 </comment>
 <comment>
 <username>ujihisa</username>
 <body>> Buy the Jython book<br>I've read this far</body>.
 <timestamp>1209105628</timestamp>
 </comment>
 <comment>
 <username>t_yano</username>
 <body>＞西尾泰和は萌え<br><br>まで読んだ</body>
 <timestamp>1209134144</timestamp>
 </comment>
 <comment>
 <username>faultier</username>
 <body>I read up to ahhh</body>.
 <timestamp>1209139260</timestamp>
 </comment>
 <comment>
 <username>taketake0</username>
 <body>You are good at business! <BR>Thanks for connecting the story to your own book. <br>Amazing! </body>
 <timestamp>1209176513</timestamp>
 </comment>
 <comment>
 <username>ukstudio</username>
 <body>I read up to the rah-rah</body>.
 <timestamp>1209184769</timestamp>
 </comment>
 <comment>
 <username>yad-EL</username>
 <body>Commentary section is ne</body>.
 <timestamp>1209477162</timestamp>
 </comment>
 <comment>
 <username>hrkt0115311</username>
 <body>>This is a BL book about the shared life of two handsome men called <body>. <BR>It was an 801 book!　I saw it in the computer section of the library, so I'll tell the librarian that the author is Kakuro Kakuro Kakuro. It's a lie. </body>
 <timestamp>1219838252</timestamp>
 </comment>
 <comment>
 <username>python久しぶり</username>
 <body>perlの場合は<br><br>use utf8;<br><br>です。</body>
 <timestamp>1382575543</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-04-25 https://nishiohirokazu.hatenadiary.org/archive/2008/04/25]