Hatena2007-10-13
code:hatena
 <body>
 *1192241352* Error message
 Unreadable error messages
 <a href="http://p0t.jp/mt/archives/2006/08/paamayim_nekudo.html">p0t: PAAMAYIM NEKUDOTAYIM</a>
 
 I thought that the fact that the error messages are in English and mixed with technical terms that are not clear even if you look them up in a dictionary might make it difficult for people who are new to programming to program.
 
 *1192265792*I'm not feeling well.
 Hatsune Miku's fault
 
 *1192266992*To Shibuya
 
 Forgot my card.
 
 I'm sorry, sorry, sorry, sorry, sorry, sorry, sorry, sorry, sorry, sorry, sorry, sorry, sorry, sorry, sorry, sorry, sorry, sorry, sorry, sorry, sorry.
 
 I will go tomorrow.
 
 *1192295572* Parallels + Hatsune Miku
 
 <a href="http://twitter.com/tonocchi/statuses/332730622">Twitter / seiji tonouchi: I bought Hatsune Miku on impulse. I also bought Parallels on impulse. No regrets...............................! </a>
 
 Oh, you are a brave man. I also thought that I should buy Paralells and run it on my Mac mini, which is hardly used at home, because it has two cores, which would reduce stress by eliminating sound skipping during playback, etc. Because I bought HHK for mac, I got stuck when I was installing Windows because there was no "Kanji" key. I think I should start by buying a normal keyboard....
 
 *1192295573* Quotes
 
 <a href="http://twitter.com/bulkneets/statuses/332805172">Twitter / mala: If you have extra money, why not give it to someone who needs it? </a>
 
 Few people, even devout Christians, can practice this. It is amazing that mala is able to put it into practice.
 
 *1192296551*I wonder if it is no longer LDRized.
 Is it my understanding that as a result of the Hatena Diary model change, LDRize no longer works properly?
 And with the understanding that if you leave it alone for a while, someone will fix it.
 </body>
 <comments>
 <comment>
 <username>Voluntas</username>
 <body>I would recommend VMware Fusion over paralells. </body>
 <timestamp>1192296611</timestamp>
 </comment>
 </comments>

[Hatena Diary 2007-10-13 https://nishiohirokazu.hatenadiary.org/archive/2007/10/13]