Hatena2011-02-01
code:hatena
 <body>
 *1296570584* The world's most accurate personality test in 5 seconds is very interesting.
 It is the result of years of joint research by foreign scientists and psychologists. They repeated the experiment many times around the world, adjusted the shapes and colors of the patterns, and selected the best ones". Here it is...just choose one from the nine images. You may have already seen it on other sites, but please try again.
 
 f:id:nishiohirokazu:20110201232219p:image
 
 1: Independent, avant-garde, averse to constraints
 Independent by nature, avant-garde in all areas. He pursues freedom and hates to be constrained. He seeks his own living space. Often has a job or hobby related to the arts. He is a free thinker and sometimes does things that surprise people. They are unique in their lifestyle and do not pursue trends, but live by their own style and beliefs.
 
 2: Self-reflective, sensitive, thinker
 He is often self-reflective and a sensitive thinker, with a personality that allows him to control himself and his surroundings better and more thoroughly than others. He dislikes superficiality and shallowness. He prefers to be alone rather than chatting with others, but he can also be deeply involved with friends and is mentally calm. He does not mind being alone for long periods of time.
 
 3: Steady, clear-headed, harmony
 He is solid, calm and intelligent. His normal behavior is natural and he prefers to keep things simple. The solidity and calmness that this type combines makes people feel secure and respected by those around them. They are not interested in vulgar or glamorous things, and prefer practical things to wear. They show no interest in fashion or trends.
 
 4: Professionalism, truth, confidence
 He is professional in everything he does and seeks the truth based on facts. He is also a confident person who believes in his own strength rather than in fate. This type of person solves problems in a practical and easy way, has a realistic view of all things that exist in daily life, and can deal with them freely. People with this type of personality often feel comfortable entrusting their work to those around them. This type of person has a strong will and will continuously work hard until they achieve their goals.
 
 5: Mild, cautious, not aggressive
 He is mild-mannered and cautious about things. He makes friends easily and also values his private time and space. He is not a solitary person, although he sometimes prefers to be away from the group and think quietly on his own. He is content with himself and is able to get along well with society.
 
 6: Analytical skills, leadership, confidence
 He is sensitive to what people tend to miss and likes to discover new things. The culture he has acquired is evident in his daily life; he has a prestigious point of view that he possesses, and he is not distracted by fashion or trends. They prefer to live an elegant and comfortable life, and prefer their interactions with people who are also refined and cultured.
 
 7: Romantic, fanciful, emotional
 He has a strong sensibility. He believes that one must have dreams in life and does not accept people who disregard romanticism or materialism. He puts his rich emotions and sentiments first in everything he does.
 
 8: Active, dynamic, outgoing
 Prefers interesting and pluralistic work. He is the type of person who dislikes the uniformity of work and conventions of the Thousand Psalms and likes to show what he is good at in front of people. He is the type who actively participates in matches and contests and finds excitement in such activities.
 
 9: No worries, rambunctious, happy
 A person who has few worries, is rambunctious and always happy. He likes to live a free and unrestricted life. His motto is "You only live once. I want to enjoy life, even if it is only for a short time. He is curious and open to new things, but dislikes restraints because he likes change. He feels that the environment around him is constantly changing, and he is surprised and delighted by such changes.
 
 >>
 Many people around me said that it was right to a certain extent. And the reactions of those who get angry and deny the diagnosis are quite amusing.
 
 You only have to borrow 5 seconds of your time in front of the monitor, so why don't you take a break and have a lively conversation?
 <<
 <a href='http://topics.jp.msn.com/onna_blog/fortune/article.aspx?articleid=500373'>The world's most accurate personality test in 5 seconds is surprisingly accurate - MSN Topics</a>.
 
 I hear that this is the case. I hear many people say, "It's a good guess." Did you get it right?
 
 
 
 
 ** Reveal the secret
 
 Since the selected images and their explanations are shifted one by one from the original, it is easy to see that people who say "I got it right! It is clear that people who say "I got it right!" on this personality test are the kind of personalities who get that way when they are told that "it's a psychological test that often gets it right," or when they are told something that applies to everyone but they assume that the message applies only to them. References: <a href='http://ja.wikipedia.org/wiki/%E3%83%90%E3%83%BC%E3%83%8A%E3%83%A0%E5%8A%B9%E6%9E%9C'>Barnum Effect - Wikipedia</a>
 
 *1296571793*1000 Feelings about English Speakers
 <a href='http://techwave.jp/archives/51580229.html'>Connecting 1000 English Speakers' Thoughts [Haruyuki Seki] : TechWave</a>
 
 I had been thinking about participating as a presenter since the planning stage, but I decided not to, thinking that I would probably be too busy presenting just before I moved (in fact, I had to stay up all night the day before because of poor arrangements, and I hadn't cancelled the internet at my old house yet! I haven't cancelled the internet at my old house yet!)
 
 The challenge that id:amachang and I took on to "create a chance for 1,000 people to present at a conference of about 30 people once a month for 7 to 8 years" was so reckless that it was dropped along the way, but what we aimed for was shared by many people, and it was deeply moving to see it being passed on in this way, in different forms, in different locations, and with different organizers. I was deeply moved by the fact that what I set out to do was shared by many people and taken over in this way, in different forms, in different places, by different organizers. I am supporting this event!
 
 *1296576795* You can't just stop "apprenticeship".
 <a href='http://headlines.yahoo.co.jp/hl?a=20110131-00000629-san-soci'> Report of the Middle Council of Education on Doctoral Programs for Graduate Schools calls for abolition of "apprenticeship" and master's thesis (Sankei Shimbun) - News</a> (Yahoo! News)
 
 I think it would be better to allow individual universities to decide on such things so that there is more variation and more options for students, rather than having the higher-ups decide and do it all at the same time nationwide. I agree with you. However, I think that the "primary advisor" should be determined because we need to avoid a situation where multiple instructors think to each other, "That one will teach" and the student is not guided in the end.
 
 Why not second place?" I think many scientists may have reacted to the politician's comment, "Why can't I be second? If this is the case, the only way to survive in the industry is to either be the best with overwhelming ability and effort, or to quickly find a niche between multiple fields that no one has started yet and occupy that niche. The saying, "The best way to be a leader is to be the best way to be a cow. I think having multiple perspectives should be supported.
 
 By the way, I wonder about the expression "PhD graduates tend to be shunned in the private sector", as if they are shunned because they took a doctoral course. It just means that those who have invested a limited amount of time in science in their lives and still could only become a cowpoke have a low value when measured by the scale of the business world.
 </body>

[Hatena Diary 2011-02-01 https://nishiohirokazu.hatenadiary.org/archive/2011/02/01]