Hatena2009-02-28
code:hatena
 <body>
 *1235779971*Household Diary
 I made a mistake last night at 10:00 p.m.: I thought today was the collection day for burnable trash, but it was yesterday. The day before yesterday, I thought "I'll put it out tomorrow night" and put it away, so I have three garbage bags.
 
 Well, we have 8 hours to go before the time limit. I can afford it. But the electricity will be cut off in 4 hours, so I have to clean up before then.
 
 What is the difference between transport and conveyance? If you ask me if it is transportation or hauling, it is hauling, so I wonder if it is correct to use transport in this case.
 I'm beginning to feel that "carrying" is the most correct word.
 
 Well, we have seven hours until the time limit. It's time to go clean up.
 
 
 Electricity and gas shutdown completed. 4 hours to go until the time limit.
 Happening
 f:id:nishiohirokazu:20090228115747j:image
 The rubber got tangled. Since it was rubber, it was stretched once and then broken and shrunk, so I couldn't tell where the end was. The end was cut off in tears.
 f:id:nishiohirokazu:20090228120711j:image
 
 
 By the way, would it be falling off the horse that the happening hapens?
 
 
 I can't find my cell phone charger. Mwah. Also, I was relieved to note what was in the top of the shelves, but I was wrong. When they are stacked, you can't tell what's inside until you move the top field luggage out of the way. And if you remove the top luggage, it's quicker to open it.
 
 
 The cell phone charger was at the old house. I had left it there because I needed it.
 
 
 1pm. Three hours to go.
 f:id:nishiohirokazu:20090228130907j:image
 
 
 Carry lighting as well.
 f:id:nishiohirokazu:20090228133006j:image
 
 
 If you put cardboard, you can put in a lot more in the height direction.
 f:id:nishiohirokazu:20090228142312j:image
 
 
 Overloaded. Loaded dose as much as it can be loaded.
 f:id:nishiohirokazu:20090228145333j:image
 
 
 New house. Ah. I already have no place to step.
 f:id:nishiohirokazu:20090228153712j:image
 
 
 That's how it ended at 3:30pm. By the way, conversation around 2:45pm.
 >>
 A: Pimpon, I'm here to pick up the keys.
 N: What, weren't you talking about 4pm to 6pm?
 A: No, at 15:00.
 N: I still have my luggage, what should I do?
 A: Is it in large quantities?
 N: I can carry it if I have a couple more round trips.
 A: Then I will go ahead to Edogawa-ku. I can't promise when I will be back.
 <<
 So, I was frantically trying to clean up the mess, but not sure when I would be able to pick it up. Oh well, as a result, we are now in the "finished cleaning up and waiting warmly in the new house phase" as planned. I just couldn't read if it would be done by 4pm or not.
 
 
 16:30. It's over. I also handed over the key. Everything is finished. Oh, dear.
 
 
 Friction marks from placing an IKEA folding bed against a wall for two years.
 f:id:nishiohirokazu:20090228163650j:image
 13,000 yen for reapplying the entire wall from ceiling to floor. Let's put the cardboard between them in the new house.
 
 <hr>
 - What I have to do today
 -- □ Brief cleaning
 -- □ Place dishes in a box
 -- □ Bring in dishes
 -- □ Bring in burnable trash
 -- Attend electric and gas outages in the morning
 -- Keep your PC in your bag so you don't have to waste time waiting
 -- 4:00 p.m., hand over the key (maybe wait in the new house because it's cold waiting in the old room with the curtains gone).
 -- Uenotan Birthday Party
 
 - Gas, electricity, and water service are available.
 -- ■ Gas
 --- ■ CLOSE Witness to gas 9-12
 --■ Water supply
 --■ Electricity
 --- ■ Suspension of electricity use Coming to check the meter on the morning of the 28th.
 --- □ Turn off the stability breaker
 
 - □ Change of address of license
 - □ The notebook is full of old addresses and other information, so I will print it out and replace it in the near future.
 </body>

[Hatena Diary 2009-02-28 https://nishiohirokazu.hatenadiary.org/archive/2009/02/28]