Hatena2011-03-09
code:hatena
 <body>
 *1299598527* To stop slash-and-burn agriculture --- New Graduate Preparation Calendar Spring 2011
 <a href="http://www.flickr.com/photos/liorshapira/266934358/" title="Brush Fire by lior shapira, on Flickr"><img src="http://farm1.static.flickr.com/108/266934358_aeeb8a74fd.jpg" width="500" height="333" alt="Brush Fire" /></a>
 <small>by Lior Shapira under CC BY-NC-ND 2.0</small>
 
 This entry was written for a project called <a href='http://atnd.org/events/13324'>New Graduate Preparation Calendar Spring 2011</a>, in which everyone writes an entry about what they think about work.
 
 It was supposed to be a meeting to listen to <a href='http://blog.shibu.jp/article/43614202.html'>Mr. Shibukawa</a>, but somehow before I knew it, he had added his name to the "<a href='http://atnd.org/events/13324'>Preparing for New Graduates Calendar Spring 2011 : ATND</a>" was made, so I'm going to talk about agriculture without airing my story!
 
 ** Who are you?
 
 My name is Yasukazu Nishio. I work for Cybozu Labs, a research subsidiary of a groupware company called Cybozu. My most recent output is the "<a href='http://www.amazon.co.jp/dp/4774144606?tag=nishiohirokaz-22& camp=1027&creative=7407&linkCode= as4& creativeASIN=4774144606&adid=07SZ8TF0G5A7WH8CQFX4&'> Amazon.co.jp: WEB+DB PRESS Vol. 60</a>" I guess I wrote a feature called "Fundamentals of Language Design. Yes, I updated the Japanese version just recently because I met someone who mistakenly thought the 3-year-old Japanese version was the latest version when I had only updated the English version of my profile page for about 3 years. For more information, click here -> <a href='http://www.nishiohirokazu.org/ja.html'>Yasukazu Nishio</a>.
 
 ** What is slash-and-burn agriculture?
 
 Have you ever heard of slash-and-burn agriculture?
 
 <a href='http://ja.wikipedia.org/wiki/%E7%84%BC%E7%95%91%E8%BE%B2%E6%A5%AD'>Swidden agriculture - Wikipedia</a>
 
 Well, to put it simply, it is a style of agriculture where forests are burned, the ashes are used as fertilizer and soil conditioner, and when the ashes are no longer effective, the land is abandoned and another forest is burned. Once upon a time, when there were fewer people, the first forest would probably recover while other forests were being burned. Now that the number of humans has increased, the forests are being eaten up and desertification is progressing. It would take a little thought to realize that there is no future for us if we continue to do this, but I guess all we can see is immediate profit. How foolish.
 
 ** About a Tweet I saw recently
 
 I don't remember the details of the text, but it goes something like this: "I'm sorry, I don't remember the details of the text, but it goes something like this
 
 >>
 In a company that pursues cost-effectiveness, employees begin to think about "their own cost-effectiveness. Then employees start pushing their work onto others in order to do as little of their own work as possible, resulting in customer dissatisfaction and other problems that can lead to a loss of customer satisfaction and other problems that can lead to the company's neck being tied up.
 <<
 
 What, you're saying that it would be more "cost-effective" if you got paid the same salary and pushed your work to others? Oh, I guess you could say that if you only think about the very short term, immediate future.... However, if you keep doing that, your company's productivity will only decline. Whether it is being eaten up by competitors, customers fleeing the company, or yourself being restructured as a result of deteriorating business performance, it should be obvious to anyone who thinks about it that there is no future for you if you continue to do such things, but you can only see immediate profits. How foolish.
 
 ** What is a company?
 
 Why are you employed by a company? According to the <a href='http://www.stat.go.jp/data/roudou/sokuhou/tsuki/index.htm'>Labor Force Survey</a> by the Statistics Bureau of the Ministry of Internal Affairs and Communications, only 88% of all employed people are employed. One out of every eight workers earns money to survive by working in a way other than being employed by a company. Why are you employed by a company?
 
 Well, to put it harshly, someone who couldn't figure out "how to earn a living" on their own, could not say to the company, "I can provide value, I can provide value, I can provide value! So please give me money!" and then they paid in advance for the product, even though they don't know what it will produce yet. The company is very generous. They pay just because they think they can create value.
 
 In addition to the salary they pay you, there are various other costs involved in maintaining the company, such as rent for your desk and office space. Roughly speaking, they say that by hiring you, the company is paying twice your salary. This means that if you cannot create value at least twice as much as your salary, the field called "company" will become more and more deserted. A field must be plowed, watered, and enriched. If you keep plucking crops without watering them, they will become desolate.
 
 ** What is value?
 
 What is value? It is not something that is clearly defined, but it is something that a company needs in order to get money. For example, a sales person negotiates and gets a contract worth tens of millions of yen as a result. This "desire to buy created by negotiation" is necessary for the company to make money, and the sales person provides it to the company and receives a salary in exchange. This is expressed as "providing value to the company and getting paid for it. Sales is very easy to understand, because the result of the activity is immediate money. But some jobs do not directly result in money. For example, just because a support person politely answers a customer's phone call does not mean that he or she gets paid directly for that action. The value here is "customer satisfaction created by courteous support.
 
 The company is buying value, not time. Because it is difficult to evaluate value, the company buys "thousands of yen per hour of work" or "millions of yen per year," but in reality, the company wants to pay the appropriate price for value. If you have Mr. B, who worked 8 hours and created 4 units of value, and Mr. C, who worked only 3 hours and created 30 units of value, you really want to pay him in the ratio of 1:4:30. We can't do that because if we do that, Mr. A's wage would fall below the legal minimum wage, Mr. B's motivation would drop, and the value would not be accurately measured as "how many units" in the first place.
 
 ** How to increase value?
 
 There is no room for ingenuity if you think that what you are offering to the company is "time". Because it doesn't scale. You can increase it a little by working overtime, but it won't last long if you work 10 hours and then double it to 20 hours.
 
 But the rate of value production can be increased. For example, increase the success rate by learning how to fail. Buy a faster machine. Increase productivity by learning how to use more efficient tools. Buy a keyboard that is easier to type on. If the speed of value production is increased by 1.5 times in this way, the number of hours worked will increase from 8 hours to 12 hours. In other words, without increasing working hours, 4 units of value can be produced per day. This "method of increasing production speed" itself is also a meta-value.
 
 ** Alchemical place called study group
 
 There are two main ways to speed up production: tools and knowledge. Tools and Knowledge. Knowledge is a very special resource. Unlike other resources, knowledge can be replicated. Unlike other resources, which decrease in value when given to others, knowledge does not decrease in value. In other words, the more you give, the more the sum of its value increases.
 
 Since this project itself was originally started by the community, there are probably many other people who have written entries recommending communities and study groups. But I don't think there is a lot of language about what these places are for. Of course, there are some differences among people.
 
 I know of a study group where the conversation goes something like this: "Oh, you use Eclipse and you don't know how to Ctrl+1? Why are you using Django if you don't need an admin panel? In other words, it is an exchange of knowledge. The IT industry is a sector where knowledge is extremely effective in increasing productivity. It would be a waste not to know about this alchemy.
 
 Are you feeling like participating? Then I dare to say something negative. "Okay, I'll join the study group and learn a lot from you!" So you say? So why don't you realize that that is slash-and-burn farming? Why do you only think about taking? You said, "We improve each other through exchange! If you just take what you want, it won't be an exchange, will it?
 
 ** To avoid slash-and-burn agriculture
 
 The land is plowed, fertilized, watered, and then seeded and harvested. The same is true for communities. People who just take without thinking about how to enrich the community are called free riders and are hated. Of course, the value of the community does not increase even if that person exists. In fact, the value of resources that cannot be copied, such as time, will rather decrease.
 
 Give & Take starts with Give. We need to keep this in mind.
 
 The next question then becomes, "What can I give?" The next question is, "What can I give? Basically, non-copyable values such as time and labor tend to be in short supply because of their limited quantity, but I don't think I need to go into that kind of talk, so I will limit it to knowledge here.
 
 ** Pursuit of excellence
 
 Knowledge is a value that can be copied. This means that you must have the excellence of "being the most knowledgeable person in the field" to be able to give. If there is someone else who knows better, you can ask him or her.
 
 Do you think, "Don't be so easy, there are only a handful of people like that. But it is not so. The idea that there are only a handful of people is like a line of people from "great" to "not so great" on a single evaluation axis of "greatness," as shown in the figure below. But this is not an exchange of knowledge, is it? It just flows in one direction, from the "great" to the "not so great. This model is incorrect because it fails to account for the reality that there actually exists a place for knowledge exchange.
 
 <img src="http://gyazo.com/cc838961fbeb2142d980165c2bbc2182.png">
 
 In fact, there are innumerable axes of evaluation. If one person is good at one field and another person is good at another field, an exchange of knowledge can be established between these two people. (left figure) The sum of the knowledge of these two people does not even have to be balanced (right figure).
 
 <img src="http://gyazo.com/051d302a8ff8257e5aaa63ce9e940a52.png"><img src="http://gyazo.com/2384e08cacf15af6e80c950e6bf2ce3c.png">
 
 It is not difficult to create a "I am the best in this field in this community" kind of excellence as long as you limit yourself in this way. excellence in some area.
 
 So let's all strive for excellence. If you are the type of person who gets into things, "selection and concentration" is perfect for you. The deeper you delve into an area of interest, the more you will discover things that others don't know. For those whose interests tend to shift easily, there is also the technique of "crossing multiple fields. This is a way to actively use the fact that "there are a good number of people who know X and a good number of people who know Y, but not many who know both. The other way is to belong to multiple communities: go to a community where there are people who know X and teach you X, then go to a community where there are people who know Y but no one knows X. Then go to a community where there are people who know Y but no one knows X, and you are preeminent with respect to X. And if you go back to the X community after being taught Y, then you are excellent at Y. You have enriched both communities and yourself by being an information trader.
 
 What do you think? Doesn't sound too difficult, does it?
 
 ** Finally
 I haven't written many "summaries" on my own blog, but looking at other people's entries, it seems that it is a template to summarize in 3 lines:)
 
 - Slash-and-burn agriculture causes desertification.
 -- Give, and it shall be given unto you.
 - Knowledge is a value that can be copied
 -- Study groups are a place of alchemy
 - Pursuit of Excellence
 -- For Give of Give & Take
 
 It was six lines.
 
 I spent <a href="http://www.amazon.co.jp/gp/product/4048689525?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=4048689525">10 pomodoros</a> and used roughly 5 hours. Some of the 30 entries may have been memorable and may have improved your life. If so, you received value. It's not a loan scam, so I'm not going to say, "You received it, so you have to pay it back with interest. I just wish that even 10% of the recipients would think about how they can farm not by slash-and-burn agriculture, but by farming in a way that enriches the land while also enriching themselves. Any method is fine. You just do what you think will make the people around you happy in your own way.
 
 <a href="http://www.flickr.com/photos/34053291@N05/4583047938/" title="TemStock - Green Forest by Temari 09, on Flickr"><img src="http://farm5.static.flickr.com/4059/4583047938_76cf4f13cf.jpg" width="367" height="500" alt="TemStock - Green Forest" /></a>
 <small>By Temari 09 under CC BY-NC 2.0</small>
 
 ** References
 <a href='http://d.hatena.ne.jp/nishiohirokazu/20100616/1276704066'>"What is Knowledge?" a reading and discussion of Drucker's Post-Capitalist Society</a>
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&asins=447800210X" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 <a href='http://d.hatena.ne.jp/nishiohirokazu/20100508/1273286553'>Drucker, The Technologist's Condition, Part 1: Leverage Memo</a>
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&asins=4478300720" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 ** Next time
 
 @t2y, thank you for your time!
 
 ** Postscript
 >>
 id:shimizukawa "What can you Give yourself?" I hope beginners can give, expressing what they don't know and asking questions.
 <<
 
 >>
 id:monjudoh Supplementary information about excellence with a concrete example→"If you happen to be the most knowledgeable among the members of the study group about the library you are currently using and digging into, you should be able to become that knowledgeable in no time. Not everyone has that much time on their hands.
 <<
 
 Nice follow-up!
 
 >>
 That is something Nishio-san can do because he is macho. What we want to know is how he could be so aggressive.
 <<
 
 This is the chicken and the egg. "The highest priority for one's own growth is the pursuit of excellence. From there comes fulfillment and confidence." by Drucker
 
 >>
 id:sabro Buying good tools and figuring out the methodology will only increase the value tenfold at best, but thinking about what value to create can increase the effectiveness a hundredfold. The ability to decide what to do is most important.
 <<
 
 Great insight. There is such great value in knowledge to decide what to do and what not to do.
 
 >>
 id:nowokay You write "traditional slash-and-burn agriculture is sustainable", rather like a necessary farming method for the region.
 The problem is slash-and-burn agriculture without a fallow season, and I have a feeling that any farming method that does not allow the land to fully rest is a bad idea.
 <<
 
 There have been about six "slash-and-burn farming with sufficient recovery periods in between is not generally a bad thing" kind of points made so far, including this one. Putting this back into the work context, I guess you could say that "it is okay to unilaterally take (exploit) from a hard worker as long as the intervals are long enough that he does not die from overwork or quit due to depression. Well, it is theoretically correct...but I wonder what it would be like as a person. I wouldn't want to work with someone who does that.
 </body>

[Hatena Diary 2011-03-09 https://nishiohirokazu.hatenadiary.org/archive/2011/03/09]