Hatena2008-07-31
code:hatena
 <body>
 *1217506920*[TopCoder]SRM412 Div2
 I have the impression that this time's problems were large in specification and those who were not familiar with English were at a disadvantage. Compared to the last time I participated in this contest, which was on my way back from Ushiku Daibutsu (Great Buddha), it was not so difficult in terms of algorithm. I also thought that I might be dropped in the test case if I did not pay attention to whether or not to include the boundary. (Come to think of it, I haven't done it yet to get revenge for the problem I almost solved that time.)
 
 I think it would be easier to drop them if I poke at those boundary conditions since I'm in the Challenge Phase, but I'm tired of it now.
 
 
 1000 point question. You are given a tablature (e.g. guitar) and asked to convert it to a tablature of another instrument. The question was to convert it to a tablature of another instrument. I ran it because my time was up halfway through, and it passed 3 out of 6 tests. I fixed it a little and got 4.
 >||
 Test Case #0...PASSED
 Test Case #1...PASSED
 Test Case #2...PASSED
 Test Case #3...FAILED
 	Expected: { "xxx-27-xx-049-999x--7777-777x-","xxx----xx-------5x---------Cx-","xxx3---xx0-----99x--------CCx-", }
 	Received: { "xxx-27-xx-049-9400--7777-7777-","xxx----xx---------------------","xxx3---xx0-------0------------", }
 Test Case #4...PASSED
 Test Case #5...FAILED
 	Expected: { "222222222222","------------","555555555555", }
 	Received: { "000000000000","------------","------------", }
 ||<
 Of the rules that tell what to do when a chord is drawn, the rule "you can't draw the same string on different notes at the same time" has not yet been implemented.
 
 
 The test passed for now during the challenge phase. I'll submit in practice mode later.
 
 -----
 
 Challenge phase is over. Tentative 1st place. I wonder if I will be promoted to Div 1 next time if I don't get dropped in the system test.
 <img src="http://gyazo.com/954f73bf43fadc5e3a19efa0dd14b56c.png">
 Well, I'm going to have dinner and go home. I'm sure the ratings will be updated by the time I get home.
 
 -----
 
 My rating went up about 130 and I successfully became a Blue Coder.
 
 -----
 
 The 1000 point problem is that I failed the system test because I forgot one line "When 'unplayable' (x on all strings) appears on a note in the middle of a chord, break to not try the other notes of the chord".
 I guess it's important not to make careless mistakes like this in Div 1 from here on out. It's difficult.
 </body>

[Hatena Diary 2008-07-31 https://nishiohirokazu.hatenadiary.org/archive/2008/07/31]