Hatena2013-08-06
code:hatena
 <body>
 *1375756637* Kyoto University Summer Design School 2013 Call for Participants!
 <a href='http://www.design.kyoto-u.ac.jp/summer-school2013/ja/index.html'>Kyoto University Summer Design School 2013</a> is a design workshop held over three days from September 25-27.
 
 From Cybozu, Takezako and I will conduct a workshop titled "<a href='http://www.design.kyoto-u.ac.jp/summer-school2013/ja/01_takesako.html'>Designing Teamwork</a>". The theme of the workshop is "How can people with different knowledge and values share their individual knowledge and work together to achieve good results?
 
 In this workshop, the final product will be a plan proposal that you can implement in your own laboratory or club. By creating a proposal as a team, you will be able to learn through practice the theme of the workshop, which is "to share individual knowledge and to link it to good results in a team consisting of several people with different knowledge and values.
 
 The exercise is based on the KJ method, which I used when writing my book "<a href="http://www.amazon.co.jp/gp/product/477415654X/ref=as_li_ss_tl?ie=UTF8&camp=247&creative=7399&creativeASIN= 477415654X&linkCode=as2&tag=nishiohirokaz-22">Techniques to Support Coding</a>", which I also used when writing the book. We will also make some arrangements to practice as a team, and use the "<a href="http://www.amazon.co.jp/gp/product/4873115051/ref=as_li_ss_tl?ie=UTF8&camp=247&creative=7399& creativeASIN=4873115051&linkCode=as2&tag=nishiohirokaz-22">Game Storming</a>". I am sure you will enjoy it.
 
 My book has been <a href='http://blog.livedoor.jp/dankogai/archives/51864510.html'>"translinguistic and transhistorical"</a> in the words of a reviewer, and that's what I'm aiming for with this workshop. I am also trying to achieve the same thing in this workshop. I want to create a "<b>cross-disciplinary and longitudinal</b>" lecture material in the areas of idea generation and teamwork design.
 
 For more information on eligibility and application deadlines, <a href='http://www.design.kyoto-u.ac.jp/summer-school2013/ja/register.php'>here</a>. Unlike the events I have taught at so far, this one is open to working people. I think it would be more interesting to have a mix of working people rather than all participants being students, as it would give a diversity of backgrounds. Please consider this. In addition to the Cybozu workshops, <a href='http://www.design.kyoto-u.ac.jp/summer-school2013/ja/theme.html'>other workshops on various themes will be held</a>. We would appreciate it if you could tell people you know who might be interested in this event.
 </body>

[Hatena Diary 2013-08-06 https://nishiohirokazu.hatenadiary.org/archive/2013/08/06]