Hatena2012-11-18
code:hatena
 <body>
 *1353244629* Checklist for when you're feeling "meh" and "unmotivated".
 There are various patterns of "bothersome" and "unmotivated. We have created a checklist of questions that, when answered, will lead you to a solution.
 
 PS: Based on this entry, I created an <a href='http://www.nhiro.org/yaruki/#'>artificial intelligence</a> that gives advice tailored to your situation by answering an average of 10 questions. Recommendation.
 
 ** Q1: Is it today that you are not motivated?
 
 Have you been unmotivated for several days? Or is it just today?
 
 After today -> Q2
 Lasts for several days → Q8
 
 ** Q2: Has any new information come to light recently?
 
 For example, did facts come to light that you did not know during the planning phase, making the work you have done useless? Has any information recently come to light?
 
 Yes -> If circumstances have changed, it is not necessarily necessary to carry out the plan as planned. Should the plan be changed or cancelled to accommodate changing circumstances? Consult with stakeholders.
 
 No → Q3
 
 ** Q3: Do you spend a lot of time awake?
 
 Has it been more than 16 hours since you woke up?
 
 Yes -> You must be tired. It might be more efficient to go to bed and wake up and work on it.
 
 No → Q4
 
 ** Q4: How long has it been since your last meal?
 
 Has it been more than 6 hours since your last meal?
 
 Yes -> Blood glucose level must be dropping?
 
 No → Q5
 
 ** Q5: Has it been a long time since you last left the room or sat down?
 
 Has it been more than 3 hours since you last left the room? Has it been more than 3 hours since you last left your seat and walked around? Is the room well ventilated? Is the room closed even though it is a small room?
 
 Yes -> You may not be motivated due to low oxygen levels. Why don't you go outside and take a walk?
 
 No → Q6
 
 ** Q6: Are you experiencing worsening cold or stiff shoulders? Do you see flashes of light when you cover your eyes with your hands and darken them?
 
 Yes -> Are you getting headaches due to stiff shoulders and neck or eye strain? If you are at home, why don't you consider taking a bath?
 
 No → Q7
 
 ** Q7: Are you thirsty?
 
 Especially in the summer, do you find yourself mildly dehydrated, unaware that the temperature should be cooler?
 
 Yes → Stay hydrated.
 
 No → Q7.5
 
 ** Q7.5: Do you frequently consume nicotine, caffeine, alcohol, etc. or are you PMS?
 
 Do you often consume stimulant drugs such as nicotine or caffeine? Also, do you have a hangover from drinking too much alcohol last night? If you are a woman, are you going through a period of mood swings?
 
 Yes -> That may be the cause. But unfortunately we do not know how to solve it.
 
 No → Q7.6
 
 ** Q7.6: Have you already worked intensively for more than 4 hours today?
 
 Do you know how many hours a day you can usually focus on your work? Do you still have time left over for activities? How much you can concentrate varies from person to person. If you are still young and full of energy, you may be able to work for long hours straight without losing productivity. For someone who is not usually very focused, two hours may be the limit. <a href="http://www.amazon.co.jp/gp/product/4048689525/ref=as_li_ss_tl?ie=UTF8&camp=247&creative=7399&creativeASIN=4048689525& linkCode=as2&tag=yaruki_checklist-22">Agile Time Management: Introduction to the Pomodoro Technique</a>" claims that 25 minutes of concentration eight times at most is a realistic line.
 
 Yes -> You may have reached your limit today. Take a break until you feel motivated. You may also want to do a task that doesn't require you to use your head (cleaning up your desk, wiping down, etc.).
 
 No→Did you just lose motivation in the face of the remaining "unmotivated tasks" because you had to get rid of the "motivating tasks" and the "unmotivating tasks" themselves have been unmotivating for many days? Yes→Q8 No→Please give us more information in the comments section.
 
 ** Q8: You don't have a clear language for what you are trying to do?
 
 What is it that you are trying to do now? Is it clear? Do you have only a vague idea in your mind of what you are trying to do?
 
 Yes -> Instead of keeping it in your mind in a vague form, please clarify and verbalize it by explaining it to someone or writing it down on paper. If you don't know what you are trying to do, there is no way to get motivated to do it.
 
 No → Q8.1
 
 ** Q8.1: Is there more than one thing you are trying to do?
 
 Has your task list grown so large that you don't even want to look at it? Are you panicking when you are faced with multiple tasks with looming deadlines?
 
 Yes → Only one task can be done at a time. Please select the most important task. Is your task list so huge that you can't even pick one? Such a task list has no reason to exist, so please go for a walk and make a new short list with whatever comes to your mind. In the future, please be careful to keep your list short.
 
 No → Q9
 
 ** Q9: Do I need to hold my breath to explain what I am trying to do?
 
 Is the purpose of what you are trying to do clear? Is it concise enough that you can explain it in one breath without holding your breath?
 
 Yes -> Does the "to do" description go into the details of the specific procedure? Isn't it not the detailed procedure that you need to figure out first, but the "what you will get by doing it" that you need to clarify?
 
 No → Q10
 
 ** Q10: You don't have a grasp of how long it will take to do what you are trying to do?
 
 Can you finish what you are trying to do in 4 hours or less? If you cannot answer "yes" to this, then there is a concern that the task is too granular.
 Perhaps you don't have a concrete idea of how long it will take?
 Or maybe you've already put in quite a bit of time on the task, don't have any particular idea of what you've accomplished, and haven't completed it yet.
 
 Yes → Q11
 
 No → Q12
 
 ** Q11: Aren't the completion conditions or tasks for what you are trying to do ambiguous?
 
 Are you using "tasks" with ambiguous completion conditions, such as "learn to speak English" or "understand the C language?"
 You may have a "task" that is clear but not necessarily achievable by doing something, such as "scoring 800 on the TOEIC."
 
 Yes -> You have not been able to clarify "what exactly you are going to do", haven't you? Yes→Do you not have a clear idea of "what exactly you are going to do"? Or maybe you have done something so far, but you are losing motivation because you cannot see how much closer you are to your goal by doing it. What you think of as a task is a different layer than a task. What you need to do is to cross it off your TODO list and instead write specific, doable actions on your TODO list. For example, "transcribe example sentences from an English grammar textbook for 30 minutes" is a task that can certainly be completed in 30 minutes and give you a sense of accomplishment. Rather than worrying about it and doing nothing, it is better to first execute it for 30 minutes and then consider whether to continue it or change it to something else.
 
 No → Q12
 
 ** Q12: "If you were to perform that task for 30 minutes from now, what would you do?" You can't answer the question "What would you do if you had 30 minutes from now to perform that task?
 
 Are you still salivating over the idea of "doing it when I have more time"?
 
 Yes -> The granularity of the task is so large that we have lost sight of what we need to do as a first step. That is the reason why you are unable to take the first step. You should break up the task. You may think that you cannot make a detailed plan in advance because there are too many uncertainties. Knowledge is needed to reduce uncertainty. Shouldn't we first divide the task of research to reduce uncertainty and the other tasks and do the research first? If we take a step forward, our perspective will change, we will see new things, and we will see the path to our goal more clearly.
 
 No → Q13
 
 ** Q13: Is it something you "have to" do that people order you to do?
 
 Coming to this question means that you are clear on what you will do in the next 30 minutes and what you will get out of it, right?
 Then the reason you are not motivated in that state is probably that what you get out of doing it is not actually worth it to you, or that there are bad feelings associated with doing it.
 Perhaps it is something that someone told you that you have to do? Are you expressing the purpose of doing this task as something you are not the subject of, such as "because I was told to do it"?
 
 Yes → What do you gain by doing it? What do you lose by not doing it? You gain nothing by being told to do it. What do you lose by not doing it? This is your job, and you get paid for doing this? Do you want to avoid being angry and feeling bad? First, please clarify such "your purpose for doing this". Then, think about whether there is any other option other than this "unpleasant task" to achieve that purpose, or whether it can be achieved in any other way.
 
 No → Q14
 
 ** Q14: Are you trying to make something very good? Are you trying to make something perfect?
 
 Are you stuck with various ideals in your mind?
 
 Yes -> You may be able to achieve that ideal if you are the superman self in your fantasy. However, especially if you have a deadline, you may be aiming higher than the goal you can achieve in the limited time you have in reality. If your hands are moving, it is beneficial to have high ideals, but if you have your ideals too high and your hands are stuck worrying about how to achieve them, then those ideals are harmful. Drop it. You can only accomplish so much with your maximum effort.
 
 No → Q15
 
 ** Q15: Is it tedious, repetitive work that has already been done many times?
 
 Have you succeeded in that task so many times that you have already "taken it for granted" that you will succeed? Do you think you are bored because you cannot gain new perspectives?
 
 Yes -> Set the bar higher for yourself. For example, why don't you first measure how long it takes you to do the task on average, and then try to "do it faster than your average time"? This way, you will fail and succeed, and you will be able to try and figure out how to do it faster. It will be less tedious than it is now.
 
 No → Q16
 
 ** Q16: Do you have any bad memories in the past of what you are trying to do?
 
 Isn't doing it in itself something you "don't want to do" connected with bad memories from the past?
 For example, when I look at an English sentence, the face of an English teacher I hated in high school comes to mind, or when I try to do a certain task, I remember that I had failed at that task before and was laughed at.
 
 Yes -> We have to do it little by little and overwrite it with memories of success and joy.
 
 No -> Sorry, I don't know. If you could give us more details about your situation in the comments section or elsewhere, it might help us improve this checklist.
 
 ** Still to be sorted out, addendum
 
 I'm wondering where to put the two phenomena of "not being motivated to do anything independent of the task in the first place" and "not taking action for fear of risk."
 
 The response was, "I don't even feel like reading this list." Yes, I should have expected it, since there have been many such responses in the past. Q0: I don't even feel like reading this list.
 
 I was told that there are cases of "I drank too much yesterday" even though I didn't realize it because I don't drink much. In that case, what should I do as a "next step" action? I can't do "let's not drink too much" even if it is said after drinking too much....
 
 Unorganized cases: "A case in which the person does not want to do a certain thing, but there is uncertainty in escaping from it, and the person is caught between the feeling of not wanting to do it and the feeling of fear of uncertainty. "A case in which you know in your head that it is better to ask someone else to do it than to do it yourself, but you are caught between the pain of damaging your self-esteem and the idea that you shouldn't do it yourself.
 
 ** Finally
 
 This article has been written by <a href='http://d.hatena.ne.jp/nishiohirokazu/20110610/1307638587'>Psychology of the Unmotivated Leverage Memo</a>, <a href='http://d.hatena.ne.jp/ nishiohirokazu/20090721/1248191853'>Motivation Engineering</a>, and <a href='http://d.hatena.ne.jp/nishiohirokazu/20091011/1255227148'>Stimulus Malnutrition</a>. I've tried refactoring them into a Q&A format, since they are so huge and tend to discourage people from reading them. It's still far from perfect, but I've organized and published it as best I can now so as not to fall into the Q14 trap. If you have any comments or suggestions, or if you have examples of "lack of motivation" phenomena other than those listed here, I would be happy to hear from you. It may help us to improve the checklist!
 </body>
 <comments>
 <comment>
 <username>Nana</username>.
 <body>Women can be swamped by menstruation! </body>
 <timestamp>1353343803</timestamp>
 </comment>
 <comment>
 <username>arafo</username>
 <BODY>How do you do? <br>It was interesting! <BR>Lately, I am not able to get rid of the fatigue of work in a day and I really wish I could go back to my younger days(-_-;)</body>.
 <timestamp>1353464315</timestamp>
 </comment>
 <comment>
 <username>Kobe Roman</username>.
 <body>I remember reading an article that said the cause of alcohol hangovers is that the liver uses up glucose to break down the alcohol and the brain does not have enough to function properly. <br>Unfortunately, I don't even remember the name of the website where the article was published, but I do remember that the article said that rummies in the form of bottles were a good and easy way to consume glucose. </body>.
 <timestamp>1423704020</timestamp>
 </comment>
 <comment>
 <username>Ici</username>.
 <body>Born in 1970<br>- I have been thinking about this every day for almost 30 years now. <BR>- But little by little, I am beginning to feel that it is becoming the way I want it to be. <BR>- I think that if I keep doing this for another 20 years or so, I will be free - able to move myself and those around me as I see fit. <br>・I think that when that happens, I will be able to really make the most of myself. <br>/ By that time, I hope to have a goal for the rest of my life. <br>・I will try to live a long life. <br>Thank you for putting it all together like this. </body>
 <timestamp>1498255435</timestamp>
 </comment>
 </comments>

[Hatena Diary 2012-11-18 https://nishiohirokazu.hatenadiary.org/archive/2012/11/18]