Hatena2010-12-23
code:hatena
 <body>
 *1293114848* "Fundamentals of Language Design" available today!
 The <a href="http://www.amazon.co.jp/gp/product/4774144606?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247 &creative=7399&creativeASIN=4774144606">WEB+DB PRESS Vol. 60</a>, which contains my feature article "Fundamentals of Language Design," is available today.
 
 It was piled up flat in bookstores!
 f:id:nishiohirokazu:20101223183611j:image
 
 ** What kind of feature?
 
 Chapter 1 is an introduction written by Matsumoto, and I wrote the remaining chapters 2-6. To give you a rough idea of the keywords:.
 
 - Chapter 1: A New World Seen from the Language Designer's Perspective (Mr. Matsumoto)
 - Chapter 2: History of Programming What are Programming Languages for? Programming languages were created by humans.
 - Chapter 3: Grammar Development What's the Grammar for? FORTH Lisp Structured Programming Functions
 - Chapter 4: History of Variables and Scope What are Variables for? Name Conflicts Separate Valid Scopes Dynamic Scope Static Scope Nested Functions Single Assignment Closure
 - Chapter 5: History of Object Oriented Objects What are Objects for? ALGOL Module Perl's OOP hash JavaScript's OOP class C++'s OOP Smalltalk's OOP class has three roles
 - Chapter 6: Three Approaches to Inheritance Multiple Inheritance Again, Collision (Rhombic Inheritance) Single Inheritance C3 Serialization Mix-in-Trait
 - Outside Columns Programming Language Version of the Innovation Dilemma (Why C Lost Market Share), etc.
 
 This is a 37-page feature on p. 17-54.
 
 ** Errata
 I must have been careful not to include mistakes, but there were still mistakes. Here is an explanation of how we got it wrong.
 
 *** P.33 Explanation of dynamic scope
 On p. 33, you wrote "The local declaration in (1) is powerless in this case," but this was a mistake. When I originally wrote the explanation for this chapter, the line (1) was not in the code, but I added the line (1) later and forgot to check the operation. So I think it would be easier to read the explanation with this line commented out.
 
 Now, what has changed with the addition of the line (1)? If you actually run the code, you will get the error "Use of uninitialized value in concatenation (.) or string at dynamic.pl line 14. or string at dynamic.pl line 14. The error message is that you tried to concatenate an uninitialized $x with another string.
 
 Perl's local $x; not only creates a new correspondence table, but also associates $x with undef (undefined value). However, the author mistakenly thought that it simply creates a new correspondence table, so the behavior of the version without local $x (shown below) and the
 f:id:nishiohirokazu:20101223233006p:image
 
 I thought the behavior of the version with local $x added (the "wrong" version below) was the same. In fact, as shown in the "correct" figure below, undef is set so that the value seen when referring to it is also undef.
 
 f:id:nishiohirokazu:20101223233007p:image
 
 Thanks to id:gfx for pointing this out.
 <hr>
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=4774144606" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe><iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=4873114713" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 <hr>
 ** Reaction Summary
 <a href='http://tsk134.blogspot.com/2011/01/webdb-press-vol60.html'>Thinking Doors: WEB+DB PRESS Vol. 60 - What Programmers Need to Know About Language Design Basics</a>.
 <a href='http://www.artonx.org/diary/20101225.html'>L'eclat des jours(2010-12-25)</a>
 <a href='http://d.hatena.ne.jp/tototoshi/20110104/1294134484'>Basics of Language Design Every Programmer Should Know - Diary of tototoshi</a>
 
 *** Twitter
 <a href='http://twitter.com/#! /yukihiro_matz/status/16670732377399296'>Twitter / @Yukihiro Matsumoto: web+db press. The feature article on the fundamentals of language design is by Nishio ... </a>
 <a href='http://twitter.com/#! /__gfx__/status/17954158673924096'>Twitter / @Fuji, Goro: A good read. It's a clear statement of what we usually casually go through .... </a>
 <a href='http://twitter.com/#! /a_matsuda/status/18226213411618816'>Twitter / @Matsuda Akira: This month's issue of WEB+DB features 1 by @nishio ... </a>
 <a href='http://twitter.com/#! /taise_515/status/29529424730787840'>Twitter / @taise: Interesting basic knowledge of WEB+DB language design. A book of ... </a>
 
 *1293119501*Diary of Kibago as Ononokus.
 Well, I've finished the manuscript and I'm happily playing Pokemon White, the first Pokemon in my life. Well, I've cleared it and I can now do enough to lose to the sixth person every day at the Bourgeoir House, so now that I get 250,000 yen a day in spending money and inflation has occurred, I'd like to clear a single train next time to get more battle points.
 But when I chose Warbial + Lobsin + Dredia from our main members, all of them are weak against insects. When I thought I couldn't beat Mebuki deer, it was an insect-attributed attack. You wouldn't think a deer would attack with insects.... Anyway, I replaced Doredia with Kenhoro.
 
 I found out that if I showed them to the judge, he could tell me how they were doing in terms of individual values and so on, so I asked him to look at the main members, and they weren't all very strong.
 
 I was thinking of replacing Lobusin, who was in charge of the wall, with Metagross, and also thinking of evolving Meguroko, which I had caught at random and which had a very high individual value, into Warbial to replace it as the mainstay of the team. However, a friend of mine told me that he had received a Kibago with the highest speed from a gift campaign via wifi! Wouldn't it be very easy to evolve Kibago to Ononokus and have the highest speed? I see, so I can fight a single train with it! I'll get that too!
 
 ...What I got was a Mamebat with the best attack.... So we only get "the best Pokémon"? My friend is very lucky...
 
 So I checked the Kibago I had and found that it had the best special defense. I decided to raise him as a starting pitcher.
 
 Anyway, I looked it up on http://xn--rckteqa2e6038anjua.com/poke_bw/kotai2.html and here's the individual values
 >||
 　 HP Attacks, defense, special features, special features, speed
 Individuals 27-29 14-16 15-17 3-5 30-31 27-31
 ||<
 The high HP, special defense, and quickness are pretty nice features. However, according to http://xn--rckteqa2e6038anjua.com/pokemon_bw_battle1.html, the contribution of individual value is about 1/2 of the race value. Ononox's race value is 76,147,90,60,70,97, with an emphasis on attack distribution, so even if you add up the individual values, it is 90,154,98,62,85,111. you have to make a decision whether to focus on attack or increase the suicide attack to produce dragon attacks. According to <a href='http://www18.atwiki.jp/dppokekousatsu/pages/555.html'>Wiki - Data Collection/Damage Formula</a>, the correction for type match is 1.5x. I'm not sure which is correct, but it seems that it is unprofitable to increase the attack of Suicide Attack, which is weaker than the attack with a 2x difference at the moment. Besides, if you use "Ryu no Mai", <a href='http://wiki.xn--rckteqa2e.com/wiki/%E3%83%A9%E3%83%B3%E3%82%AF%E8%A3%9C%E6%AD%A3'>rank compensation - Pokémon Wiki</a>, the attack will be 1.5 times. <a href='_blankquote'>Rank Compensation - Pokémon Wiki</a>. Hmmm, so let's ditch the suicide attack.
 
 Huh? According to <a href='http://bw.yakkun.com/zukan/n612.htm'>Ononokus - Pokémon Pictorial Book BW - Pokémon In-Depth</a>, it's a physical attack with Dragon Claw or Dragon attribute, but I wonder if the attack value or the suicide attack value is used for this. <a href='http://www18.atwiki.jp/dppokekousatsu/pages/555.html'>Pokemon Matchup Discussion Summary Wiki - Data Collection/Damage Calculation Formula</a> says "For physical attacks, the attacker's attack is the attacker's attack and the attacked's defense is the attacker's defense," but <a The <a href='http://yakkun.com/data/aisyou.htm'>Type Compatibility Chart - Pokémon in-Depth</a> says that Dragon is a special attack... Oh, and it also says, "In Diamond, Pearl, and Platinum, each "move" is classified into "Battling" and "Special", so the "Battling" and "Special" are classified into "Battling" and "Special". The classification by "type" is irrelevant, as each "move" has its own classification of "Busshi" and "Tokushu"." It says, "The classification by 'type' is irrelevant. So, if I want to use physical attacks with Dragon Technique, I can focus on the attack effort value.
 
 For now, I'll choose Dragon Claw (Dragon) power 80/100, but I need to add one of Fighting, Ground, or Flame to counter the Steel type which is less effective. Can we put in Earthquake (Ground) 100/100?
 
 Now, the total effort value is 510, and each slot has an upper limit of 255, so let's think about how much to assign to each. We are aiming for the first move and a one-hit kill, but there are still enemies with characteristics such as "toughness" that will not die from a single hit, no matter how strong our attack is, so it is important not to die from a counterattack. In other words, first of all, let's adjust HP, defense, and special defense. If you increase the effort value by 8, the HP, defense, and special defense will increase by 1 each. The values before effort were 90, 154, 98, 62, 85, and 111, so HP = 90 + 60 + x, defense = 98 + 5 + y, and special defense = 85 + 5 + z. Dividing 510 by 8 gives 63, so the question is where to allocate this 63. The balance between HP = 150 + x and Defense = 103 + y is how to make it so that HP * Defense is large enough to kill the opponent. Ignoring the constant term, HP * Defense = x * y + 103 * x + 150 * y, with the constraint x + y + y = 50. I tried to maximize [{x * y + 103 * x + 150 * y, x + 2 y = 50, x >= 0, y>= 0} in Wolfram alpha, and it told me to put everything in x. I was told to swing all of it to x. Is it actually a mistake to swing the special protection to the same degree as the defense? Let's do the math with HP and special defense: maximize[{(150 + x) * (90 + y), x + y = 63, x >= 0, y >= 0}]→y = 1.5. After all, it means you should swing everything to HP, right?
 
 The distribution of HP, attack, and speed depends on the distribution of opponents, so it is difficult to decide. I don't want to bother with counting the number of fights when leveling up, so I'll just dope up HP, attack, and speed to 100 for now, and then focus on raising HP by using power something or other.
 
 <a href='http://wiki.gamerp.jp/pokemon/data/453.html#id14352'>Shopping Mall - [Pokemon BW] Pokemon Black White Strategy wiki [game recipe]</a>. Doping items cost about 10,000 yen, so if you use cheap power, you can buy about 50 items with your daily income, which is enough.
 
 
 The most enjoyable time is while thinking about such things as the following.
 </body>

[Hatena Diary 2010-12-23 https://nishiohirokazu.hatenadiary.org/archive/2010/12/23]