Hatena2009-06-19
code:hatena
 <body>
 *1245377926* logistic mapping
 Well, when it comes to drawing graphics in C++, this is the way to go. At any rate, I made this for practice.
 
 f:id:nishiohirokazu:20090619111707p:image
 
 I don't feel like posting it on my blog because the code is so long in C++.
 
 <hr>
 
 If you cut corners and blur only horizontally, it would still look weird.
 <img src="http://gyazo.com/e9b73b71d7f3a6418e7509be65221719.png">
 
 <hr>
 Fixed. I have to go out soon.
 <img src="http://gyazo.com/5f0027222d0d76105249f93d1b371ab4.png">
 
 I made it in the size I was going to make it, took less than 3 minutes.
 <img src="http://gyazo.com/f9ab6281dfb8bfc1baaaa0dfb345eb1f.png">
 I see strangely evenly spaced lines!" That's the point.
 
 Link directly to the image because it doesn't fit on the screen: <a href="http://gyazo.com/f9ab6281dfb8bfc1baaaa0dfb345eb1f.png">here</a>.
 
 *1245407202*展示作業中
 
 f:id:nishiohirokazu:20090619192635j:image
 This is the first time to display something like this on the wall.
 
 <hr>
 
 The exhibit was ready for display!
 f:id:nishiohirokazu:20090619194057j:image
 
 <hr>
 
 Oh, it's already this late. Unlike what you see on the web, the presence of the salamanders, especially in 3D, is quite impressive. There were various amazing things, some interesting. The XP wallpaper blew me away.
 
 <hr>
 
 I write again, "<a href='http://d.hatena.ne.jp/nishiohirokazu/20090611/1244714716'>I won an Honorable Mention in the TAGBOAT SUMMER AWARD 2009! - The Hatena Diary of Yasukazu Nishio</a>" So tomorrow and the day after tomorrow I will be at the <a href='http://www.tagboat.com/ngs/award/summer/2009/exhibition.html'>TAGBOAT SUMMER AWARD 2009 ( TAGBOAT SUMMER AWARD 2009</a>. I wonder how many people will be there. I don't know what to prepare...
 
 <hr>
 
 Oh yeah, and the hiragana was interesting. I had no idea what it was when I saw it on the web. The "hi" is good, but I really like the "mo".
 
 I also enjoyed the wagashi with anko (red bean paste) coming out of the faucet and plaster statues in place of mochi in zenzai, which were in the portfolio of a man with a regent's hair. What was the other one? There are so many interesting things that I can't remember.
 
 *1245415214*大手町新幹線
 When I got off at Otemachi, I saw a sign for the Shinkansen and wondered if there was such a Shinkansen, but I just got off at the next Tokyo station.
 
 *1245422272*Gumowski-Mila 写像
 <img src="http://gyazo.com/6d064cbf3e787ecb46712ff1cdf4e204.png">
 
 Cute. I wonder if the morning logistic mapping or this Gumowski-Mila mapping is a basic training for those who paint with cords, equivalent to "drawing for those who paint with their hands". I'll say something like that. Plaster casts in the art room are not new motifs, but you draw them for practice, don't you? When I was in high school, I was made to draw a Coke bottle.
 
 <hr>
 Oh, they laid eggs!
 <img src="http://gyazo.com/9e16c8c3a8a4dbcfd098e40ced9113c7.png">
 In a classic chaotic image like this, the path taken by the iterative application of the function is drawn as a 1/0 value, but in such cases where the result of the calculation converges to a specific value, there may be hundreds of samples with that value but only a single small pixel on the screen. It is a very small pixel on the screen. Well, you can think of it as a "filter that does not allow strong light to pass through," but it is not the only filter. So this morning I was implementing a model that "when light comes in too strong to be represented, it spreads the energy to the surrounding pixels. Thanks to this model, the convergence point at the tip of the seaweed is represented by an egg-like glow. Incidentally, this kind of processing is called <a href='http://en.wikipedia.org/wiki/Bloom_(shader_effect)'>Bloom (shader effect)</a> in the industry, apparently.
 </body>

[Hatena Diary 2009-06-19 https://nishiohirokazu.hatenadiary.org/archive/2009/06/19]