Hatena2009-11-18
code:hatena
 <body>
 *1258511073* Continued: New Twitter spam targeting Japanese?
 Yesterday's <a href='http://d.hatena.ne.jp/nishiohirokazu/20091117/1258466344'>New Twitter Spam Targeting the Japanese? </a>, we received several comments saying "That's not spam.
 
 Well, since I'm not interested in talking about spam or not spam, or what the definition of spam is, let's focus on the phenomenon. As I mentioned yesterday:.
 
 - From people you don't normally exchange direct messages with.
 - I am a personalized letter that can be sent to an unspecified number of people and does not contain personalized information.
 - It has a URL and tries to get you to click on it.
 
 I received "multiple" direct messages yesterday from a service that I did not sign up for. And in the past
 
 - Hundreds of DMs were sent with messages such as "Mafia family" and "140 King of Pop.
 - On a high day, I'd get a dozen or so a day, and it was very disruptive to my DMing with other people.
 
 I have seen such annoying spam, so I thought, "I would hate to see the same thing happen. Regardless of the method used, receiving many direct messages with the same text is "annoying" to me, and the service that sends them is "an annoying service. I decided to write about it on my blog so that it would not spread because it was annoying to me.
 
 By the way, this service is paid for and seems to cost at least 48 yen per letter. <a href='http://webpo.jp/html/faq/webpo.html'>Webpo - Frequently Asked Questions (FAQ)｜About Webpo in general</a>. Then it looks like my thought "I don't want to get a large number of messages" is unfounded.
 
 Hmmm, as soon as I heard that there is a fee, I felt sorry for the person who sent the message. I'm paying at least 48 yen.... I don't feel like entering my address to receive a piece of paper that doesn't have any important information on it, so of course I don't send it, but it doesn't seem to return the money to the person who sent it. Hmmm, I feel sorry for them. Please don't send this kind of thing to me, I think it would make both of us happier.
 
 <hr>
 I ended up clicking on the link for some reason, and even introduced the service. It's disconcerting to think that someone is now giving consulting advice with a face like, "Advertising on Twitter has a good click-through rate for links.
 
 **1258551479*Dumping bulky waste
 I'm looking into getting rid of old chair legs because I want to get rid of them.
 
 They apply online and put a paid sticker on it and leave it in front of the house. A disassembled chair costs the same as a chair that has not been disassembled. 300 yen. I heard that you can buy the stickers at convenience stores.
 
 I bought it. Sign up online.
 
 The closest collection day was the 25th, so that's what I did. They said I could put it out in front of my house.
 
 I had to keep the stickers until the 25th, so I put them in the top drawer... and then I realized. I thought I should just put it on the bag now.
 
 I put it up. All that remains is to remember to table it on the morning of the 25th. Can we put this in the RTM?
 
 After writing my name, I looked at the application email and it said I could use my application number instead of my name. Well, it's not embarrassing bulky trash (what the heck is that?), so it's fine.
 
 **1258552327*Draw-in to make a tummy tuck.
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=FFFFFF&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=4471143077" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 I'm talking about the tummy tuck, which strengthens the muscles around the abdomen. Even if you don't like sports, you can do it anytime without having to go to the gym or change clothes like other sports. The basic idea is simply to tuck your tummy in, but it is important to set up a back stretch, pull your shoulders back, and put some pressure on your buttocks.
 
 The classification was based on how much I could dent, and I could dent from 84cm to 78cm at normal times, so I guess I was actually a rather dent person. It said that I should aim for a higher level by exercising and so on while making a dent.
 
 By the way, I just measured my abdominal circumference and was surprised to find that it is surprisingly large. According to some standards, I'm a metabolic syndrome from 85cm. Oh no, no, no.
 
 *1258556520*Re: 3.5 billion yen worth of horse tickets purchased = former Gentosha bureau chief arrested - totaling 900 million yen, Tokyo Metropolitan Police Department on embezzlement charges
 <a href='http://www.jiji.com/jc/c?g=soc_30&k=2009111800547'>Jiji.com: 3.5 billion yen worth of horse tickets purchased = Gentosha ex-bureau chief arrested - 900 million yen in total, Tokyo Metropolitan Police Department on embezzlement charges</a>.
 
 Let's do the math. First there is 9.0 billion yen, and the beak is returned at the rate of 0.75, let's see, about 30 times.
 
 >||
 >>> sum = cur = 9.0
 >>> for i in range(30):
 ...     cur *= 0.75
 ...     sum += cur
 ...     print sum, cur
 ... 
 15.75 6.75
 20.8125 5.0625
 24.609375 3.796875
 27.45703125 2.84765625
 29.5927734375 2.1357421875
 31.1945800781 1.60180664062
 32.3959350586 1.20135498047
 33.2969512939 0.901016235352
 33.9727134705 0.675762176514
 34.4795351028 0.506821632385
 34.8596513271 0.380116224289
 35.1447384953 0.285087168217
 35.3585538715 0.213815376163
 35.5189154036 0.160361532122
 35.6391865527 0.120271149091
 35.7293899145 0.0902033618186
 35.7970424359 0.0676525213639
 35.8477818269 0.0507393910229
 35.8858363702 0.0380545432672
 35.9143772776 0.0285409074504
 35.9357829582 0.0214056805878
 35.9518372187 0.0160542604409
 35.963877914 0.0120406953306
 35.9729084355 0.00903052149798
 35.9796813266 0.00677289112349
 35.984760995 0.00507966834261
 35.9885707462 0.00380975125696
 35.9914280597 0.00285731344272
 35.9935710448 0.00214298508204
 35.9951782836 0.00160723881153
 ||<
 
 Oh, 3.5 billion is pretty reasonable. The sum of a sequence of equal ratios with an initial term of 9.0 and a fair ratio of 0.75, so if we play infinitely, we'll converge to 36.0.
 
 **1258562945*[Kaizen] Change cutter knives.
 The cutter knife I had was not designed to cut with much force, and the blade would retract when I applied force, so I had to hold it from the side and apply force to keep it from retracting, making it difficult to cut the magazine.
 
 I bought one at a 100 yen store that has a firm grip and a screw-on blade for cutting cardboard and the like. It is easy to cut.
 
 However, I was thinking that I could use another magazine to cut the magazine, but this time it was an A4 magazine, so I couldn't lay it down properly and it was hard to cut. Maybe a cutting mat or something like that would be good. Also, when I tried to cut the magazine I was going to scan, the cutter blade went deeper than before, so it cut right through to the table of contents, which was a mistake. I guess I should use a cutting mat.
 
 *1258564961*Sad
 <img src="http://gyazo.com/ae265c897029a359927ee6fe5b32ff45.png">
 </body>

[Hatena Diary 2009-11-18 https://nishiohirokazu.hatenadiary.org/archive/2009/11/18]