Hatena2013-01-28
code:hatena
 <body>
 *1359342122*Diary of an Agricola for two with my wife.
 Agricola was under the impression that it was a "time-consuming farm management board game for a large group of players," but the two-player <a href="http://www.amazon.co.jp/gp/product/B009KY3PTU/ref=as_li_ss_tl?ie=UTF8&camp= 247&creative=7399&creativeASIN=B009KY3PTU&linkCode=as2&tag=nishioyome-22">Agricola: Farm Animals Japanese Version</a> was apparently released last October.
 
 So I immediately played with my wife. Neither of us had any experience with Agricola, so we were a little confused, "When do we start building buildings and fences?" But when we found out, it was very easy. The same goes for fences.
 
 The "what to do" choices are made three times per round, for a total of eight rounds, so 24 rounds in all; the two players together always finish the game in 48 moves, there is no element of luck, the initial placement is one way, and the information is public, so it's kind of like Othello. It is much easier than the original.
 
 The first time I played, I didn't really understand the score calculation, so my wife (at the back of the screen) said "I don't want cows and horses because they are not cute" and "I want to use all the space and line them up exactly like this.
 [f:id:nishiohirokazu:20130122212349j:image]
 
 As you can see from the scoring calculations, my wife's play is disadvantageous because she gets -3 points if she has only 3 or less animals of a certain type. The first time, I won by about 50 points vs. 30.
 
 2nd round.
 At this point, I was thinking, "It would be more fun to make it bigger," while my wife was thinking, "You have to have four different kinds of animals to win, and it is hard without 'farm expansion' to make room for four different kinds of animals. If two people want the farm expansion at the same time, they will compete with each other".
 
 As a result, I said, "I'll take timber (let's expand the farm and put up a fence on the next turn)" and my wife said, "Well, I'll take farm expansion" and I said, "What, I was going to take it next! And the fence is the first thing that is given out. And the fences are only replenished one by one per round, except for the first fence that was given out, and the person who takes the farm expansion gets the replenishment. Oh, no! I got a lot of wood, but I didn't have a fence, which is the most important thing!
 
 After that, my wife steadily increased the number of animals while I was suffering from the dilemma of "I can't build a place for animals unless I get a fence," but "I need to expand the farm to get a fence," and "I can get more fences later," but "I can't keep animals if I don't build a fence quickly.
 
 My wife's farm, which was tightly packed, and my farm, which tried to make do with the lack of fences with building walls.
 [f:id:nishiohirokazu:20130123230444j:image]
 [f:id:nishiohirokazu:20130123230418j:image]
 
 In the end, my wife scored 64 points and I lost by 57 points. Hmmm, fences are a valuable resource. I was upset that they took my fence, but maybe I should have built more stables instead of running to expand the farm.
 
 There are many different resources in this game, fences, wood, stone, reeds, etc., but the most valuable resource is turns. My wife said, "If you try to get at least 4 cows and horses and both, you need at least 4 turns (since it takes 2 turns to catch 2 animals each, even if you use the effect of more animals that are at least 2). Four turns out of a total of only 24 turns is quite costly. He says, "You could cut off one of them. That's true.
 
 They are thinking about Agricola's strategy while washing dishes, so I may not win for the time being.
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishioyome-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=B009KY3PTU" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 </body>

[Hatena Diary 2013-01-28 https://nishiohirokazu.hatenadiary.org/archive/2013/01/28]