Hatena2009-01-14
code:hatena
 <body>
 *1231904902* Prosin Diary Day 2
 JAKLD
 
 
 Wiring (programming language)
 
 
 I thought it would be interesting to improve the "bot that plays the sound of one more Mario machine when it enters IRC and says something containing +++" that I made at the 86 camp in the past, and make it so that it says "heh" when you say "heh" in a study session. I wonder if it is in CodeRepos. I wonder if it was in CodeRepos, I completely forgot.
 
 
 From stardust to earth.
 Observational astronomy, theoretical astronomy, experimental astronomy (simulation astronomy)
 Gravity Many-body Problem Calculator←Sounds like a special technique
 Four Dimensional Digital Universe Project 4d2u Astronomical Data Visualization 3D Viewing http://4d2u.nao.ac.jp/
 Satellites are not yet defined (Pluto is no longer a planet because of the last definition of planet.) The joint center of gravity of the earth and moon is within the earth.
 Rocky planets, gas planets (Jupiter, Saturn), ice planets. Voyager went and studied the density structure and found that the surface is the same gas as Jupiter but there is a mantle of water and methane underneath, so it is no longer called a gas planet.
 The solar system formation scenario is a Japan-originated theory known as the "Kyoto Model.
 There is also a snow line in the dust that orbits the sun.
 Gravity Anxiety Theory.
 In many cases, it is said that about two Earth-size planets can be formed by repeating the simulation many times.
 More than 300 Jupiters have been found. 2009 Kepler mission (to observe stellar eclipses by planets) → If found, interferometry will be used to determine if there is oxygen or not. Normally, there is no excess of oxygen by itself. Oxygen on Earth is produced by plants. If the interferometer finds oxygen alone, it can be assumed that plants are present. There is another paper that says, for example, that if a single-lived radioactive element is found, it indicates the existence of a civilization capable of nuclear war.
 
 <a href="http://www.amazon.co.jp/gp/product/4000065718?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=4000065718">100 Million Earths&#8212;Birth from Stardust (Iwanami Science Library (71))</a><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as 2&o=9&a=4000065718" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" />
 <a href="http://www.amazon.co.jp/gp/product/4005004776?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=4005004776">The Origin of the Universe and Life&#8212;From the Big Bang to the Birth of Mankind (Iwanami Junior Shinsho)</a><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l= as2&o=9&a=4005004776" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" />
 
 
 
 Notes. If white, black, blue, etc. appear normally but light gray and pink disappear, the brightness of the projector is too high and should be lowered.
 
 
 >WG membership. They have virtually no veto power. (earth2001y)
 And I wasn't sure what WG was supposed to do, so I went through it and they urged me to do it. It seems that it is impossible to go through.
 
 http://www.fun-motion.com/physics-games/plasma-pong/
 Fluid Mechanics PONG
 
 
 I was going to say how many plays there have been on the most recent online, so I did something like Game.all().count() and it showed 1000. It says it right in the reference.
 >>
 count() returns a maximum of 1000.
 <<
 Wow, I don't know how many there are over 1000.
 >|python|
     num_games = 0
     for u in Player.all():
         num_games += Game.all().filter("player0", u).filter("is_finished", True).count()
 ||<
 There were 4233 cases. Of course, this code will not return the correct value if the number of users exceeds 1000...
 
 
 <a href='http://ja.wikipedia.org/wiki/%E3%81%94%E3%81%84%E3%81%9F'>Goita - Wikipedia</a>
 </body>

[Hatena Diary 2009-01-14 https://nishiohirokazu.hatenadiary.org/archive/2009/01/14]