Hatena2009-08-12
code:hatena
 <body>
 *1250032397* Programming Camp Diary
 The one I wrote yesterday about "Knuth's Surreal Number" is apparently Conway's idea and Knuth's novel: <a href='http://en.wikipedia.org/wiki/Surreal_number'>Surreal number</a>.
 I mean, don't look that up, go out to eat.
 
 <hr>
 
 The lecturers were small in the seats around us because we were doing common lectures with 62 participants, but I was sad because I didn't have LAN crawling & I couldn't get a signal. Now it's finally online. @25:07
 
 <hr>
 - Ruby is object-dominated and method-subordinate; Python is a "callable object" rather than a method subordinate to an object
 - Ruby: x.a_method(arg1, arg2)はx.send(:a_method, arg1, arg2)
 -- :a_methodは"a_method"でもOK
 -- The idea that a method call is a message sent to an object
 - Python: x.a_method(arg1, arg2)はgetattr(x, "a_method")(arg1, arg2)
 -- the idea that a method call is a call to a functional object that is an attribute of the object
 -- By the way, the functional object call func(arg) is func.__call__(arg) Chicken first or egg first? Ouroboros!
 - How about having an address guessing contest with someone you trust (and don't mind if they know your address)?
 - Questions are very important. It has the ability to make unstated answers explicit.
 
 - 超現実数
 -- SurrealNumber := pair<set<SurrealNumber>, set<SurrealNumber> >
 -- 0 := {|} // make_pair(set(), set())
 -- 1 := {0|}
 -- -1 := {|0}
 -- 2 := {1|}
 -- -2 := {|-1}
 -- 1/2 := {1|0}
 
 - 音
 -- Trying to play sound on the machine used by the participant -> /dev/dsp and not /lib/modules/..! There is no alsa in /lib/modules/... I tried to play sound on the machine used by a participant! So I dropped the source of alsa-driver.
 -- 紆余曲折は中略。結論から言うとaptitude installでalsa-base, alsa-utils, alsa-tools, alsa-source, alsa-ossを入れた
 -- I alsaconfed and did echo "zazazaza" > /dev/dsp and sound came out. I'm so happy.
 -- When you install something, you think, "Well, it's port, it's aptitude, it's easy to get in, right?" I drop the source and do . /configure" is a bad habit.
 </body>

[Hatena Diary 2009-08-12 https://nishiohirokazu.hatenadiary.org/archive/2009/08/12]