Hatena2009-04-24
code:hatena
 <body>
 *1240547867* Talk about a messy room.
 It is interpreted as some kind of antithetical joke, but it is an indisputable fact that we are wasting our precious finite resource "time" in search of various things...
 
 *1240554900* I got a chair.
 f:id:nishiohirokazu:20090424153457j:image
 
 I'd like to open it right up, but I'd rather go to the orthopedist first. Also, I need to clean up where I'm going to assemble it. It's bad for my back.
 
 
 f:id:nishiohirokazu:20090424165135j:image f:id:nishiohirokazu:20090424165652j:image f:id:nishiohirokazu:20090424170745j:image
 
 I assembled it. I had expected it to sway back and forth as I shifted my weight, but it also deformed as I shifted my weight from side to side and twisted my hips. It is more than I imagined. Incidentally, <a href="http://pt.afl.rakuten.co.jp/c/02f9ff29.918fb7b7/?url=http%3a%2f%2fitem.rakuten.co.jp%2fcommunication%2fc%2f0000001241% 2f" target="_blank">here</a> was on sale until May 7 and it was cheap, so I bought it from here.
 
 
 When I sit on it for a long time, I sometimes want to change it to an upright position, but this one is good in many ways. The previous balance chair broke when I put all my weight on the fixed seat when I sat on my legs or sat in an "L" position.
 </body>
 <comments>
 <comment>
 <username>夏原　一彰</username>
 <body>It's been a while. <br>I was on a leave of absence due to depression for some reason or other, but now that my leave of absence has expired, I am back at NAIST (although I still have to go to the hospital once a month). <br>I am now an M5 student. <br>I wanted to review python again when I returned to school, so I looked for Nishio's programming course on comparative genomics, but is it no longer available? <br>Please give me even a piece of it if there is any left (eagerly awaiting). Thank you in advance. <br><br>PS <br>I'm going to the Rahmens' Kyoto show tomorrow, and I got the HOME DVD, so if you want it, please contact me. </body>
 <timestamp>1240562043</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-04-24 https://nishiohirokazu.hatenadiary.org/archive/2009/04/24]