Hatena2009-06-07
code:hatena
 <body>
 *12444353190*Ueno Now
 
 f:id:nishiohirokazu:20090607143946j:image
 
 There were a lot more than I imagined: about 200.
 
 <a href='http://ja.wikipedia.org/wiki/%E3%83%9E%E3%83%83%E3%82%AF%E3%82%B9 %E3%83%BB%E3%82%A8%E3%83%AB%E3%83%B3%E3%82%B9%E3%83%88'> Max Ernst - Wikipedia</a>'s <a href='http://ja.wikipedia.org/wiki/%E3%83%87%E3%82%AB%E3%83%AB%E3%82%B3 %E3%83%9E%E3%83%8B%E3%83%BC'> Decalcomania - Wikipedia</a>, and it was interesting to see how it could be made this way. <a href='http://ja.wikipedia.org/wiki/%E3%82%B8%E3%83%A3%E3%82%AF%E3%82%BD %E3%83%B3%E3%83%BB%E3%83%9D%E3%83%AD%E3%83%83%E3%82%AF'> Jackson Pollock - Wikipedia</a>, although some of the work was made by dripping. For that matter, <a href='http://ja.wikipedia.org/wiki/%E3%82%A4%E3%83%B4%E3%83%BB%E3%82%AF %E3%83%A9%E3%82%A4%E3%83%B3'>Yves Klein - Wikipedia</a> There was a human body measurement ANT66 in the "Measuring Human Body", which is a huge canvas with a human being on it, spray painted on it like a stencil. I just checked Wikipedia and found out that the paint itself was developed and patented by myself.
 
 <a href='http://ja.wikipedia.org/wiki/%E3%83%AB%E3%83%BC%E3%83%81%E3%83%A7 %E3%83%BB%E3%83%95%E3%82%A9%E3%83%B3%E3%82%BF%E3%83%8A'> Lucio Fontana - Wikipedia</a>'s "spatial concept" had holes in the thick pink paint.
 
 Also, <a href='http://ja.wikipedia.org/wiki/%E6%9D%B1%E9%83%B7%E9%9D%92%E5%85%90'>Seiji Togo - Wikipedia</a> reminds me of that unique painting of a woman with eyes (if you don't know what I'm talking about. I was searching for an image to introduce it, and I found an entry that mentions exactly the same thing with an image: <a href='http://ameblo.jp/ artony/entry-10262268516.html'>Masterpieces of Japanese Art Museums｜Art Teller Toni~'s [Only Here in the Art Room]</a>. Knowing this, when I look at other works, there are several examples of mysterious paintings that are not in the form of concrete objects in the background or something like that. Like this one: <a href='http://atelier-de-paris.jp/SHOP/togo_L085.html'>'Woman in Red Scarf' by Seiji Togo - Atelier de Paris</a>.
 
 And as for three-dimensional objects, Masakazu Horiuchi's "Mr. D's Boneless Dice" was interesting, but the photo <a href='http://www.moma.pref.kanagawa.jp/museum/collection_sculpture.html'>pickup collection Sculpture: The Museum of Modern Art, Kanagawa</a>, it's not so interesting to see. This is a metal work in which he tried to take out the "bones" of the dice, assuming that the eyes of the dice were actually connected inside.
 
 
 There were other exhibits such as calligraphy and bird carving, but I was too tired to go there. The Tokyo Metropolitan Art Museum is surprisingly spacious and well organized.
 
 f:id:nishiohirokazu:20090607162222j:image
 It is interesting to see the children's excitement when they see this sphere.
 
 
 was taking it easy, but then I remembered the ladder schedule.
 
 
 I'm doing this in Ueno Park as well:)
 f:id:nishiohirokazu:20090607163733j:image
 
 Mixed media is not a specific technique, but rather a general term for a variety of different techniques that are not existing. The work in which the deer is covered with a transparent ball is also mixed media. Hmmm. For example, my work with photo-acrylics of mathematical patterns is "technique: photo-acrylic," but of course, since it is acrylic, it can be cut, heated, and bent, so if I cut, bend, glue, make holes, and thread chains, it would be "mixed media"?
 
 I realized that I don't really like creepy-type pictures and video works that I can't watch at my own pace.
 
 *1244364739*[ja]Yakko
 
 f:id:nishiohirokazu:20090607175212j:image
 
 *1244365234*[en]rock gold
 
 f:id:nishiohirokazu:20090607180028j:image
 
 *1244365373*[ja]Sanjo
 
 f:id:nishiohirokazu:20090607180253j:image
 
 *1244365983*[en]Kappo Dragonfly
 
 f:id:nishiohirokazu:20090607181258j:image
 </body>

[Hatena Diary 2009-06-07 https://nishiohirokazu.hatenadiary.org/archive/2009/06/07]