Hatena2008-02-12
code:hatena
 <body>
 *1202760771* I don't think you should be looking for a beginner language, you should be writing code.
 -What beginners think of "Languages for beginners are - from far, far away.
 --http://d.hatena.ne.jp/tek_koc/20080205/1202185452
 I saw this and thought I had to write a follow-up, but forgot.
 
 -The "Beginner's Language" Festival was Surprisingly Exciting - Obinata's Hatena Diary
 --http://d.hatena.ne.jp/earth2001y/20080205/p2
 Then Obinata-kun wrote about it first.
 
 What I was going to write is almost redundant, but I'll write it down anyway.
 
 >>
 I'm glad that all the advanced users are discussing "this one is better" and "that one is better", but I feel it's all a bit noisy. Sorry.
 <<
 
 It's not just a little bit, it's mostly noise. It sounds like it was all very exciting, but how many of those people actually have experience teaching that language to multiple people with no programming experience? Also, there's no "discussion" going on, everyone is just saying what they want to say.
 
 I think you can write code without worrying about it, and I think PHP is fine, too. No, it doesn't. Language is a tool, not a language. Languages are tools, and what you create with them is the most important thing.
 
 Of course, it might have been easier to create Wikipedia using Python or Ruby, but on the other hand, Django or Ruby on Rails would have consumed a lot more memory than PHP, and the project might have been abandoned because the server cost would have been too much. There are advantages and disadvantages to everything. There are pros and cons to everything, and you never know until you try it.
 
 That is why the important thing is to "actually do it" anyway. Just make it. And if there is something you want to make, why don't you just use the most suitable language for it? If you want to draw beautiful geometric patterns, you should use AS3 or Processing, if you want to make a novel game, you should use NScripter or Kirikiri, if you want to make MIDI, you should use MML or Sakura, etc. MML is not an object-oriented language, but it would be easier to write in object MML is not an object-oriented language, but that doesn't mean it is easy to write in Java, which is an object-oriented language. If you have a clear objective, it doesn't really matter how powerful the language itself is. Just use the easiest language to achieve your goal.
 
 And by "use the appropriate language for what you want to do," we mean that if what you want to do changes, you should naturally learn a new language appropriate for it. It is perfectly fine to start out in any language, but don't expect to be able to do everything you want to do in that one language by the end.
 
 -----
 P.S. If you don't have anything you want to do, you should try Brainf*ck as a puzzle for now. Also, Scheme should be the 0th language that all programmers should learn. If you want to manipulate something more concrete, you can use Python for now, and you can do everything from web apps to facial recognition for USB cameras to Wii remote control operation.
 
 *1202761103* stupid.
 I'm a fool, a helpless fool. If you have time to write the above entry, write a manuscript for your Jython book, you idiot! I hope you die once! I want to chop you up into little pieces and burn you in an incinerator!
 
 The editor told me that it was time to set a date for delivery of the manuscript, not an effort goal.
 
 At the writing camp, I was happy to have written 300 lines, but it turned out that calling Jython from JUnit4 killed the JVM and I could no longer proceed with the story I had planned. I just had a half-finished draft of a half-written manuscript and more trouble than I had to deal with. I told myself to clean up the existing sections and make a finished version instead of writing new sections. Aaahhhh. I want to burn it all.
 
 *1202772712*This morning
 I ring the alarm at 7:00.
 At 7:15, start filling the bath with hot water.
 I get up at 7:30 and take a bath.
 I'll be up at 8:00.
 8:30. It's time to leave.
 
 I can go to Kinshicho Fire Department at 9:20 a.m., so if I leave now, it will be enough time for me to get there. I'll leave my computer at home, since I'm told they get angry if I do any inside work. By the way, I wonder what I'm going to do for lunch if I'm going to be there from 9:00 to 5:00.
 
 *1202774087*Train is delayed.
 
 sweat
 
 *1202780561* fire protection
 
 It is a room that can hold about 300 people.
 f:id:nishiohirokazu:20080212104237j:image
 
 *1202792360*Break time
 
 Dr. Pepper was on sale.
 
 *1202799960*Hoo
 
 Now I only have the exam left. I'm not sure I can answer it.
 
 *1202802928*Ended
 
 I was allowed if I could get 10 out of 15 questions right, and I easily got all of them right. I heard that those who didn't get it were only required to take a make-up class. There were about a dozen people who took a make-up class.
 f:id:nishiohirokazu:20080212165522j:image
 
 *1202816230* Class B Fire Prevention Manager
 That's how I became a Class B fire prevention manager.
 Otsukanbouka-teki shikaninsha.
 
 >>
 If a fire prevention manager fails to perform proper fire prevention management duties and causes deaths or injuries due to fire, he or she may be held liable as the person responsible for management. In fact, in the 2001 Kabukicho building fire, a fire manager was arrested for professional negligence resulting in the deaths of two people because he neglected his duties to manage and inspect firefighting equipment and to evacuate customers.
 <<
 <a href="http://ja.wikipedia.org/wiki/%E9%98%B2%E7%81%AB%E7%AE%A1%E7%90%86%E8%80%85">Fire protection manager - Wikipedia</a>
 
 Wow, scary.
 
 -----
 <a href="http://detail.chiebukuro.yahoo.co.jp/qa/question_detail/q118412221"> Please tell me about the fire prevention manager. It seems that there are two types, Class A and Class B. Is it... - Yahoo! Wisdom Browser</a>.
 Respondent, that's a Class B Hazardous Materials Operator.... I'm worried about the future of the questioner who was told a lie, took it to heart and left.
 
 *1202818706*id:ringod is spam?
 I don't think it's spam either. It's human-powered, and I'm not trying to put ads on my blog.
 
 I don't think it's right to complain just because someone posted a link to your entry while you published it. If trackbacks are bothering you, you should either set your site to not accept trackbacks, or ask Hatena to allow you to set your site to not accept trackbacks from certain sites. I think it's very high-handed to say "your scrapping is annoying, so stop it" about other people's scrapping, and I think that's where you should say "can you please turn off automatic trackbacks?
 
 Well, I think id:ringod should use tumblr if he doesn't want to get involved with these people. It's easy to scrap with quotes just by selecting the part you want to quote and pressing the bookmarklet. I use tumblr too.
 
 ------
 
 I see what you mean with the hatchet comment, I know what is causing our differences.
 >>
 # 2008-02-13 id:hatayasan hatenad, trackback, SPAM I wonder around how much meaning you find in telling the person in the middle to "read" a mere list of articles.
 # 02/13/2008 id:hejihogu Blogs I have no problem with links, but trackbacks bother me. If the travails start flying in the sense of links, the travails of major blogs will become useless.
 # 2008-02-13 id:julajp I guess you can do whatever you want with the link, but when you get a traveller, it probably means "please check it out", and the feeling of being betrayed is because the situation overlaps with a traveller from a splog or spam.
 <<
 
 Around here. For those who interpret a trackback to mean "please check it out," it is true that they may feel, "You asked me to come and check it out, and now there is no mention of it, you son of a bitch! I was told to come and check it out, but you didn't mention it! By the way, there is no set rule that says "a trackback means 'please check it out,'" but Hatena Diary is set to automatically send a trackback when you write a link, right? So, a trackback from Hatena Diary does not mean "Please check it out" or "Please read it" but "You are linked to us". It was Hatena Corporation, not id:ringod, that made Hatena Diary's PageRank high thanks to the trackbacks and keyword links that Hatena Diary sends to other blogs. Hatena Diary's overall PageRank is high. In other words, Hatena Diary as a whole is a sprog. Hatena Diary users have no right to complain because their blogs are benefiting from Hatena Diary, and non-Hatena users should complain to Hatena. Hatena won't stop, though. I'm sure Hatena won't stop, but I'm sure their ad revenue will drop if they do.
 
 *1202819554* sleepy
 Ah,
 It was early in the morning.
 I think I'll go to bed.
 You go to bed and wake up early tomorrow to evolve into an early riser.
 
 I've been mentally shaken up a lot lately, but it's all my own fault when it comes down to it. Well, let's hope that tomorrow will be a better day and go to bed.
 </body>
 <comments>
 <comment>
 <username>m.w</username>
 <body>I'm looking forward to it in its own way...but I'm not holding my breath for its completion...lol. <BR>Because I have a feeling that even if it is not published, it will be published somewhere. <BR>Is this encouragement? Pressure? <br>Please erase it if you don't like it! </body>
 <timestamp>1202817472</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-02-12 https://nishiohirokazu.hatenadiary.org/archive/2008/02/12]