Hatena2010-03-10
code:hatena
 <body>
 *1268209929* Went to a workshop on "Seeing Electricity".
 <a href='http://atnd.org/events/3378'>Workshop for Electricity at Shinjuku Kogakuin University : ATND</a>
 
 It's hard to tell from the photo. The real thing glows a little more clearly. This is a large breadboard that can be wired by touching the touch panel, and the LEDs light up in different colors depending on the voltage. Of course, you can plug in any components normally sold in Akihabara.
 
 f:id:nishiohirokazu:20100309135520j:image
 
 I had it darkened because it didn't show up well in the picture. The light became easier to see, but I can't see the parts stuck on the top.
 
 f:id:nishiohirokazu:20100309143913j:image
 
 This is a demonstration in which a variable resistor is placed between the power supply and ground, and when the knob is turned, the voltage changes and the color of the light changes! Demonstration
 
 f:id:nishiohirokazu:20100309143905j:image
 
 It was interesting to see how the voltage on the circuit was different when it was glowing red than when it was glowing other colors because the voltage drop was low only for the red LED, and how the electricity accumulated in the capacitor gradually flowed out and the glowing color of the circuit changed. It was so interesting that I failed to take a picture. The photo above was taken after the workshop was over.
 
 *1268239885*Leverage memo: randomness - Soren's game design theory
 <a href='http://strategystation.blog111.fc2.com/blog-entry-59.html'>ランダム性 - Sorenのゲームデザイン論　Strategy Station研究室</a>
 
 via id:TOKOROTEN
 
 原文: http://www.designer-notes.com/?p=171 2010/3/3 Soren Johnson(2009年10月にGame Developer誌に掲載された物の再掲)
 >>
 In a game with a strong element of luck, beginners can believe in their chances of winning. Most people don't try to challenge a chess grandmaster.
 Many players dislike having their strategies interfered with by random events, but still, plan breakdowns are necessary to keep the game alive. Bad luck provides an excuse when a player loses. When they win, it gives them the satisfaction of having bounced back from bad luck.
 It takes an element of luck to attract people who are not suited to serious one-on-one competition.
 When randomness is just noise, it hinders the player's understanding.
 Bad luck is not considered unfair if there is an intervening period before the game ends and time is given to deal with it. In many classic card games, only the initial hand dealing = environment generation is random
 Dealing with unexpected behavioral outcomes is a core element of game design, but at the same time the speed at which the game itself progresses is an important factor.
 Untuned randomness can destroy game balance.
 <<
 
 *1268243143*Leverage memo: My home strategy from 2 million yen per year
 <a href="http://www.amazon.co.jp/gp/product/4872904222?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=4872904222">My Home Strategy from 2 million yen a year</a>. I was kind of browsing through it at a bookstore, but it was interesting because there was a lot of frank talk, so I leveraged notes.
 >>
 Condominiums with fitness rooms, etc.: In 5 years the equipment will be outdated. Will the management meeting approve the cost of updating equipment that only a few people will use?
 35 year loan with no down payment: can't move from there for another 35 years unless I have extra income.
 Prices are twice as different between new construction and 10 year old used construction. The repayment period is three times different.
 Japan has 1.5 times the population of the U.S. in terms of new homes built per year.
 Until the bubble burst in 1990, land was an asset that would rise in value if changed. Everyone rushed to buy. Popular condominiums were sold by lottery.
 Why is my home just barely affordable? Five times your annual income. The loan guideline is that the repayment amount should be within 30% of your annual income. When real estate prices are high or low, the price of a new home does not change much. The gross profit margin on new condominium sales is 20%; selling 100 units at 40 million yen is a profit of 800 million yen; building a condominium at 19 million yen will only reduce the profit, but the cost of sales will not change. Since discounting does not increase demand, it is more advantageous as a business to make expensive condominiums.
 Compare 35 million for new construction and 25 million for renovation of 25 million old house. 10 million allows you to choose solid wood flooring, natural materials for walls and ceilings, fixtures, plumbing, kitchen, and so on.
 Public housing has a solid foundation and frame.
 The real estate agent who was requested to mediate by the seller must register property information with the designated distribution system "Raines" within one week.
 The commission for real estate brokerage is 3% of the contracted amount plus 60,000 yen, which both the selling brokerage and the buying brokerage take. As a vendor, I want to mediate both sale and purchase. It is because the income is doubled without much change in labor. Therefore, they do not want to share good properties with other agents. The only way to get information on good properties is to get on a real estate agent's client list. You go to the agent and tell them your requirements and your financial situation.
 The listed price is the seller's asking price. If the seller is in a hurry to sell, you may offer half price, or even if not, you may offer 30% off the asking price.
 How to know the market price: Seller's asking price can be found by searching Yahoo Real Estate by area, Raines: http://www.contract.reins.or.jp/ Sold Price, Land Comprehensive Information System http://www.land.mlit.go.jp/webland/
 You can ask for a copy of the Important Information Statement and the contract a few days before signing. If they refuse, you can ask the Ministry of Land, Infrastructure, Transport and Tourism or the prefectural government department that has issued the license to the builder.
 Condominium preview/ Best Support, Inc.: http://www.best-sup.com/ 40,000 for contract check, 150,000 for property value survey.
 Gifts of housing funds from parents are tax exempt up to 6 million, and municipal loans have relatively low interest rates. Flat 35.
 It is nonsense to say, "Let's start with a low interest rate variable and switch to a fixed when the interest rate is about to rise. It is impossible to determine when "interest rates are about to rise.
 At financial institutions, loan approval or disapproval is settled at headquarters, and branches do not have the authority to make decisions. However, screening documents are prepared by the branch, and the head office only examines the documents. The composition of the person in charge is important.
 Demolition and wall finishing is easy, so just doing that yourself will lower the renovation cost by about 400,000.
 <<
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=FFFFFF&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=4872904222" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 *1268243619*Books everywhere
 I'm thinking I need to get rid of books and clear my room, but I bought four books from Amazon and one from a bookstore. I'm a fool.
 </body>

[Hatena Diary 2010-03-10 https://nishiohirokazu.hatenadiary.org/archive/2010/03/10]