Hatena2009-03-04
code:hatena
 <body>
 **1236133162*Laptop with handles
 
 f:id:nishiohirokazu:20090304111921j:image
 
 *1236163159*Housekeeping
 - I thought I would have to buy a new hose for the washing machine, but I did not have to buy it because I had properly stored the "parts to tighten with screws" that I did not use when I installed the washing machine two years ago (I had stored them with the unused parts of the water purifier).
 -- I googled how to install it. It wasn't on the paper that came with it. I'm sure it was in the instructions, but I don't know where.
 - There are so many different parts to a water purifier that I didn't know what to do, but I did some Googling.
 
 The reason these two parts were found in the current cluttered room is because they were the first things I stuck in the back of the storage room when I moved out two years ago. Things that are stuck in the back of a closet come out last.
 
 
 The rice cooker was found to cook rice. The measuring cup for the rice was inside the bag of rice and the power cable for the rice cooker was inside the rice cooker. Unfortunately, a measuring cup for water could not be found, so we filled it directly from the tap.
 
 
 And it turns out that when I put the water in purification mode, the water spurts out from the base of the tap. orz The packing is damaged and can't withstand the pressure of passing the hollow fiber membrane, I guess. I wonder if I need to call a plumber. I wonder if I can fix it by tightening it a little myself.
 
 
 <a href='http://oshiete1.goo.ne.jp/qa1288142.html'>Water leaking from faucet base of faucet post - Tell us!
 <a href='http://www.vivahome.co.jp/mamechishiki/diy_know_how/diy/mizumore04.htm'> Water leak from faucet base|I want to know more! Water Leakage｜Home Center Viva Home</a>.
 Hoho. I wonder if I should go to Tokyu Hands in Kitasenju after checking whether it is the sealing tape or the packing after tightening the main valve. Since I don't care how it looks, I could just buy some silicon putty and paint everything, including the gaps where insects might get in.
 
 **1236166758*Autism Spectrum: A Success Guide for Adolescents and Adults
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?t=ikunoz-22&o=9&p=8&l=as1&asins=4902244632&md=1X69VDGQCMF7Z30FM082&fc1=000000&IS2=1&lt1=_blank&m=amazon&lc1=0000FF&bc1=000000&bg1=AAFFAA&f=ifr" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 Although it is called a success guide, it was mainly about how people on the autism spectrum live and feel, rather than about "how to be successful". Like married couples.
 </body>

[Hatena Diary 2009-03-04 https://nishiohirokazu.hatenadiary.org/archive/2009/03/04]