Hatena2008-12-26
code:hatena
 <body>
 *1230278320* Shyness
 The term "shyness" is a curious one when you think about it. If we are afraid of strangers because we see and know people, does the lack of shyness mean that we do not see people or that we cannot perceive them even if we do?
 
 There was a paper that said it had to do with the type of gene for the protein that transports serotonin: http://www.ncbi.nlm.nih.gov/pubmed/12668354
 
 *1230282516*Font Book
 I tried to launch Firefox and mistyped it and launched something called Font Book. It's quite interesting.
 
 <img src="http://gyazo.com/8f9e440ae38ec3f7bdf41702a1043e86.png">
 Magical. <a href='http://ja.wikipedia.org/wiki/%E3%83%81%E3%82%A7%E3%83%AD%E3%82%AD%E3%83%BC'>Cherokee - Wikipedia</a>
 
 
 <img src="http://gyazo.com/929dc698f313671c2bf39e8f9b364bcb.png">
 It looks like science fiction. <a href='http://en.wikipedia.org/wiki/Unified_Canadian_Aboriginal_Syllabics'>Canadian Aboriginal syllabics - Wikipedia, the free encyclopedia</a>.
 
 <img src="http://gyazo.com/55946a9b4a2500755621e37bb7cb7137.png">
 Cool. I don't know what language it is, but it looks Tibetan.
 But all the characters in <a href='http://en.wikipedia.org/wiki/Tibetan_script'>Tibetan script - Wikipedia, the free encyclopedia</a> are converted to Hatena.
 
 *1230309509*TopHatenar
 I was wondering why my TopHatenar results are so skewed to the subscriber side, with 0.06% in the top 0.06% of subscribers but 0.23% in the number of buzzers,
 <a href="http://tophatenar.com/view/nishiohirokazu"><img src="http://tophatenar.com/chart/correlation_small/nishiohirokazu" width="160" height="120"></a>
 
 Today I happened to find someone who is in the opposite pattern. Mr. id:aureliano of <a href='http://d.hatena.ne.jp/aureliano/'>Meet Huckleberry</a>.
 <a href="http://tophatenar.com/view/aureliano"><img src="http://tophatenar.com/chart/correlation_small/aureliano" width="160" height="120"></a>
 
 I see, one or two entries a day consistently get double or triple digit buzzes. On the other hand, RSS is a summary feed, so subscribing to it is not interesting at all. I see.
 What would happen if RSS was made full-text feed? Would the number of buzzers decrease? Probably not. Page views might decrease a little, though. I can't experiment with this because it's not my blog.
 
 Article circa April: http://d.hatena.ne.jp/aureliano/200804
 The concept of the article has not changed, but the number of buzzers is low. This means that increased exposure is probably the main reason for the increase in the number of buzzers. I wonder if the full-text RSS feeds will attract a new audience. I have my own delusion.
 
 *1230314685* Affiliation: Imperial Palace
 <a href='http://www.sciencedirect.com/science?_ob=ArticleURL&_udi=B6T39-423RGKS-2&_user=10&_rdoc=1&_fmt=&_orig=search&_sort=d&view=c&_acct=C000050221&_version=1&_urlVersion=0&_userid=10&md5=60fad2f230ee2fa83984b0cedff084b2'>ScienceDirect - Gene : Evolutionary aspects of gobioid fishes based upon a phylogenetic analysis of mitochondrial cytochrome b genes</a>
 First Author: Akihito
 Affiliation: The Imperial Residence, 1-1 Chiyoda Chiyoda-ku, Tokyo 100-0001, Japan
 
 I see, so that's how it's written. It is true that "Εmperor" is a title, not a name. Just like you don't write "what a university professor" in the name section of a paper. And since there is no last name, it is only a first name.
 
 *1230317034*Considering moving.
 <a href='http://d.hatena.ne.jp/Yamashiro0217/20081226/1230306202'>Self-serving advice for those looking for rental housing in Tokyo - Diary of Yamashiro0217</a>
 Reference++.
 
 This kind of thing is very helpful because I live 8 minutes from the station at about 80,000 yen and I'm being told "that's too expensive". Incidentally, the place I lived before was 90,000 yen for 15 minutes from the station, so I had no awareness that I was living in an expensive place.
 
 For now, the most important condition is that there is no GKBR.
 </body>

[Hatena Diary 2008-12-26 https://nishiohirokazu.hatenadiary.org/archive/2008/12/26]