Hatena2009-03-15
code:hatena
 <body>
 *1237100892* Sunday Diary
 I slept for 10 hours. I enjoyed sleeping twice.
 
 
 I need to buy some Evios soon. I bought the last bottle at the beginning of December, so I'm consuming one bottle every 3 months. 2000 tablets, so 3 months * 30 days * 30 tablets = 2700. There are days I haven't taken it for a long time.
 
 <hr>
 Today's Tasks
 
 
 Today:
 - Call Able and tell them about the leaking water supply.
 - Order shelves
 - ■ Publish "So it's Uncluttered" leverage memo.
 - Reboot with a software update.
 - Write a story about CortYuming's substitute commit.
 - Boil tea
 - Cooking rice
 - Try microwaving Hokke
 - Wash the beverage container in the closet and put it in the refrigerator.
 
 <hr>
 
 I couldn't sleep so I went for a walk. I went into the Lawson 100-yen store, which has been built here and there recently, and found tofu for 30 yen. I also found frozen seafood, frozen vegetables, vegetables for chikuzen-ni (chicken and vegetables stew), and vegetables for pork miso soup, all in 100-yen portions. Of course, it would probably be cheaper to buy larger units at the supermarket, but living alone, I can't afford it. Since it was created after Shop 99 went bankrupt, if there is a business opportunity, it would be to cut costs by being able to use the delivery network that was built for convenience stores. I was happy to buy Pirkle, which I thought sold for 115 yen at the convenience store, because it was 105 yen. I also bought a six-pack of Kaki Peas for 105 yen. I didn't buy any this time, but there was a good selection of canned mackerel. This is a great store for "one-person households that are not picky about taste, but cook for themselves.
 
 
 Kinako mochi ice cream was not so good. The ice cream was too much.
 
 
 And when I looked in my wallet to pay, I was very impatient because I only had 700 yen in my wallet. Just barely.
 
 *1237104111*A geek café could be built.
 http://ghp.g.hatena.ne.jp/keyword/%e9%98%bf%e4%bd%90%e3%83%b6%e8%b0%b7%e3%82%ae%e3%83%bc%e3%82%af%e3%82%ab%e3%83%95%e3%82%a7%e8%a8%88%e7%94%bb
 
 Oh, something interesting is happening!
 
 *1237119103*committed on behalf of taskpaper.el
 I wanted to read id:CortYuming's code as soon as possible, so I made a proxy commit to coderepos.
 - <a href='http://d.hatena.ne.jp/CortYuming/20090306/p1'>I improved taskpaper.el to my liking. - Tile Language Memorandum</a>.
 - <a href='http://d.hatena.ne.jp/CortYuming/20090315/p1'>@That per tags - Tile Language Memorandum</a>
 
 Since the behavior is different from id:antipop's original, I decided to cut a branch and put it there, just like mine. Specifically
 - svn cp trunk branches/CortYuming/ then svn ci
 -- I copied the original so you can see the changes from the original.
 - Overwrite what I got in the mail and svn ci
 -- http://coderepos.org/share/changeset/31248/lang/elisp/taskpaper
 - I forgot to log the story of the changes mentioned in the body of the email, so I put it in the ChangeLog.
 -- http://coderepos.org/share/browser/lang/elisp/taskpaper/branches/CortYuming/ChangeLog?rev=31249
 This is the flow of the project.
 
 *1237120076* Difference between GAE real environment and local environment
 Since it was traversed.
 
 >>
 Is there a summary of the differences between the development server and the actual environment somewhere?
 <<
 <a href='http://d.hatena.ne.jp/hamatsu1974/20090315/1237089009'>GAE: Addicted to the difference between the development server and the real environment. - Crypto, math, sometimes programming</a>.
 
 I'd like to read it too if it's all in one place... I was trying it locally and thought that keys returned strings, but in the real environment it was a key object, or there was a difference in unicode (I think the local server implementation is buggy), or urlfetch was very fast in the real environment, but there are too many details... I didn't write it in my entry.
 
 There's a bit on http://omake.accense.com/wiki/GAE.
 
 I personally concluded, "Oh, the local environment is just to simplify testing for simple mistakes, and since Google's infrastructure doesn't work locally, the final testing has to be done in the real environment, so we can use version or something. I'd love to read if there is a summary of the differences between the two. I wonder if there is one.
 
 <hr>
 By the way, I haven't read the source, but as for the no matching index found, I don't know if you updated index.yaml and made sure it was serving on the dashboard or not, I thought I couldn't read it from the text you wrote. I thought the error message said what to do.
 
 *1237123380*Jaiku
 <a href='http://code.google.com/p/jaikuengine/'>jaikuengine - Google Code</a>
 Ohhhh, Jaiku! This is all you need to know about how to create something Twitter-like using Django on top of Google App Engine!
 
 *1237127202*Confession in HTML
 http://newsteam.blog95.fc2.com/blog-entry-260.html
 >||
 nakai:
   http://newsteam.blog95.fc2.com/blog-entry-260.html
 nishio:
   <lovers>
   And how do you answer yes?
   Proof that you are not thinking about the other person.
 nakai:
   There it is.
   I feel like I should have said 403 back.
   Or 401
 nishio:
   I thought it was 200.
 nakai:
   Ah, I see. 200.
   All I could think about was refusing. w
 nishio:
   402 Payment Required
 ||<
 
 *1237131997*"So it's not getting done. And yet I don't have time." Leverage memo (2nd draft)
 I had intended to complete it today, but the volume was too large to digest in one sitting. Well, I read through it thoroughly from beginning to end this time, so I guess I can read this text itself and digest it after a while.
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?t=ikunoz-22&o=9&p=8&l=as1&asins=4478732868&md=1X69VDGQCMF7Z30FM082&fc1=000000&IS2=1&lt1=_blank&m=amazon&lc1=0000FF&bc1=000000&bg1=AAFFAA&f=ifr" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 <hr>
 
 Washing dishes, throwing things away, cleaning up. This is training. Training will gradually change the way you think about behavior. Always put the keys back where you found them, always clean up your desk at night, and never take cheap shots. After these efforts, a full and happy life awaits us.
 
 - What is the purpose of life?
 - What is the problem with being sloppy? What do you want to get by being neat?
 
 Sundays were spent cleaning up and still not getting organized. Sloppiness was ruining my Sunday, my peace of mind, my self-esteem.
 
 Make a list of people you admire and write down their good qualities.
 
 Write down what you want to fix. Then write what you want to see happen.
 
 What is life's greatest obsession? What do you want your life to be like? What is your ideal life?
 
 He views himself objectively in the setting that he is an alien, observing humans on a video screen from a UFO.
 
 Peer Coaching. Tell them, "I'm going to do something in the next 20 minutes, and I'll debrief you in 20 minutes." You can also revise your schedule.
 
 Make time to clean up at the end of the day.
 
 Systematize organization.
 
 Write down everything that needs to be done on a list → the list becomes very long → bad example: you get tired of looking at the list and lose motivation, good example: break it down into specific items. For shopping, make a separate "shopping list" and write "go buy the items on the shopping list" on the task list. Tasks that have a large overhead unless they are executed together, such as tasks that are physically located far from each other, are candidates to be grouped together. The same goes for items that take time to prepare.
 
 Writing unreadable notes is a waste of time. Writing notes that are difficult to read wastes your time later.
 
 Sometimes you have to give up even the most important things. By doing so, we do "even more important things.
 
 Instead of doing something for 2 hours, do 6 "do 15 minutes and rest 5 minutes".
 
 It's hard to succeed with a "let's do something for an hour a day" plan. Let's just try "Let's do 5 minutes a day" for a week. It is more important to be continuous than to be long.
 
 Boost confidence by remembering what you have already accomplished and what is already a habit.
 
 How to praise yourself: "If you lose 30 pounds, it's not enough. It's no good if you lose one kilogram. When you move the plate of food aside, immediately praise yourself for a job well done.
 
 What am I gaining from the "habits I want to stop" that I am currently doing? There is always something. And what am I losing by this habit?
 
 Just because you stumble doesn't mean it's the end of the world. It is natural to have waves of success and failure. You can do it again. Each time you do it, you will get closer to the goal step by step.
 
 The "I don't like this part of other people" point tells me the dark side of myself that I am turning away from. When I think that people should be punished, I think that I am also escaping punishment.
 
 The feelings one receives from the actions of others do not match the intentions of the actor. Emotions are subjective.
 
 About the Team 1: Have a common vision and a single "purpose". 2: Clarify "who", "what", and "why" is doing what they are doing. 3: Seek accountability with an attitude of trying to learn, rather than blaming others for their failures. Instead of looking for culprits, look for reasons why the system did not work well. Where there is blame, there is no learning." Blame is an incentive to hide mistakes and concerns.
 
 Amnesty Day: a day for all employees to clean out the crap of the past in order to lighten up and focus on the next job
 
 If you have to do it anyway, you might as well do it while it's easy.
 
 I know you don't like routine work. However, routine work cannot be eliminated in life. Rather than spending time on routine work that cannot be eliminated, wouldn't it be more beneficial to make it routine so that you can do it without thinking about it?
 
 The amount of money for things you wanted to buy but held back because you didn't need them is set aside as "savings from not buying useless things" and used for things you really need.
 
 If you feel like slacking off, set a timer. For example, I start organizing my books with a 20-minute timer. Even if I accidentally read too much, the timer stops after 20 minutes.
 
 There is a difference between "rushing" and "doing it quickly."
 
 Create gaps between tasks.
 
 False perfectionism: not starting because you are not confident of completing the task completely.
 
 When you keep putting off a task 1: Am I missing the point? 2: Why is it important to do it? 3: What's the problem if you don't do it? 4: Use the timer and start anyway 5: If you get stuck, think about why
 
 Most people who are sloppy just have an unconscious aversion to "being neat".
 
 Contrary to their beliefs, creativity was enhanced by eliminating sloppiness.
 
 Unconscious rebellion against parents who tell them to "tidy up." The coupling of "tidying up" and "pain.
 
 Since you are the cause of the confusion, you are the only one who can change it.
 
 What kind of person do you want to be? The more specific you can envision, the closer you are to realization.
 The reason things are so hard to get rid of is because I feel at one with myself.
 People who can't get rid of things can't get rid of their plans either. Are those "things to do" really things to do?
 Postponing decisions is like throwing garbage into the future.
 Don't buy something that doesn't have a specific place to put it.
 Sloppiness becomes a talent when concentration is added.
 You can't do several at once. Set priorities and focus on one.
 TODOs are recorded on the list as soon as they come to mind. Motivation is an absolute prerequisite for the list. The trick is to break it down into smaller tasks.
 You can get a head start by choosing three "top priorities for the day."
 Set a time limit and set a timer.
 It's not that we don't have time. It's just that we don't have the courage to put the most important things first.
 
 A small step actually taken rather than a big step that did not materialize.
 You can't "change everything." You just need to decide on one place to start.
 
 When you clarify your objectives, you feel like you can achieve them. I can move by my own will, not by orders. I can see how far I have achieved.
 If you set a goal based on "how it should be," it is hard because you feel obligated to do so. You should decide by thinking, "What would make me happy?
 If you are not clear on what you want to get, think about what you don't like and aim to eliminate it.
 
 The "bifurcation effect": when you start cleaning up one area, you start worrying about other areas. Concentrate on the first place you decide to start and feel a sense of accomplishment when you complete it. You can't do everything at once.
 If you can do it for 21 consecutive days, the behavior becomes a habit.
 Don't be pessimistic by focusing only on what you "can't do. There are many things you can do.
 According to Conquering Chaos at Work, Disney CEOs devote 75% of their working hours to maintenance work. At first glance, maintenance may seem tedious, but without maintenance, creative work is impossible.
 1: Does it give you energy when you see it? 2: Do you like it no matter what anyone says? 3: Is it useful and do you actually use it? If no to all, you don't need it.
 
 Complete the task completely until you don't have to remember it later. Or put it in your TODO list so you don't have to remember it in your head.
 
 Estimating less than the actual time it will take is a major cause of remaining halfway through a task. It should be based on actual measurements, not assumptions.
 Even if you say, "This work will take a whole day, so you can do it when you have time," you will never have a whole day to work on it.
 When doing something new, consider the possibility that it will take twice as long as estimated; if you think you can do it in two days, it will take four.
 
 A 10 minute "transition time" is needed between tasks. You can't switch your mind right away.
 
 Sloppy people tend to be curious and easily distracted.
 
 Limit your list to the tasks you will perform that day. If you put them all on the list, it will be overwhelming and it will be difficult to see what needs to be done.
 It's counterproductive to fill in a list with every task you can think of, and every time you look at it, it depresses you. You can have a main list with a lot written on it, but you also need a list of just the tasks for the day.
 Do not save words on your task list. More time is lost by not being able to remember it or not being able to pin it down when you see it later than is lost by saving words.
 Rarely do people decide to change their lives and then immediately make it happen. Only those who fail and try again and again succeed.
 Custom is the Greek word "ethos," which at the same time means "character.
 </body>
 <comments>
 <comment>
 <username>hamatsu1974</username>
 <body>Oh. Thanks for your comment. I tested the query on the development server, and I thought that the development server automatically writes the query in the index.yaml file! I was so upset by this unexpected event, but I was surely blindsided by the fact that I could just edit it by hand. I was so surprised. </body> (Japanese only)
 <timestamp>1237156552</timestamp>
 </comment>
 <comment>
 <username>CortYuming</username>
 <body>Thank you for all your help. Thank you m(__)m</body>.
 <timestamp>1237163458</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-03-15 https://nishiohirokazu.hatenadiary.org/archive/2009/03/15]