Hatena2008-10-12
code:hatena
 <body>
 *1223796001*[Mid-term] Diary of a game server creation
 I'm getting tired of it.
 
 This is because the certification of Google App Engine has not yet been completed and there is still no way to publish it to the server.
 
 I thought it would be False or 0.
 
 -----
 
 player = Player.get_or_insert(user.email(), play_count=0, score=0, sq_score=0)
 I can create an object with the user's email as the key, but I get an error when I try to retrieve it.
 >>
 Invalid string key test@example.com. Details: Incorrect padding
 Request Method: 	
 <<
 But the object appears to be in place in the admin panel.
 Oh well.
 
 -----
 
 TextProperty doesn't pick up if I specify = in filter and have the same content. I see, I changed it to StringProperty.
 
 -----
 
 Player scores are now recorded.
 
 -----
 
 I want to split views.py because it is getting to be 300 lines long and it's getting hard. I want to split up views.py because it's getting to be too much work. I'd rather have 100% Japanese if not 100% English, since only Japanese people are likely to use it anyway.
 
 -----
 
 When I published to the production server, I got an error that datetime.datetime could not be Pickle.
 Also, I get an error when I log out. I wonder if I can use Django's tests.
 
 -----
 
 <img src="http://gyazo.com/c2359d3857337815c75d62d7f07134e3.png">
 This is a great game.
 It's like striking out a batter.
 
 -----
 
 Ah. That's tricky. Pickle fails because the key is a string on the local development server, but when I upload it, it changes to a Key object. I thought maybe I should just give up and make it a field, since I didn't want to create 3 fields "player0, player1, player2" after all, so I'm supposed to put it in a list and pickle it.
 
 -----
 
 <img src="http://gyazo.com/897cf9835a981f51df1ae110de0fbb01.png">
 Geez, at the last minute....
 
 This is running on a Google server. I may release it to the public once I fix the hard to understand messages and so on. After all, I haven't done any work on the API.
 
 -----
 
 It is still unclear how much of the project will be completed before it is released to the public. The time line message, in the end, was decided not to show the time because it was annoying to show the time. Hmmm. What's the point of recording the time anymore?
 
 -----
 
 <img src="http://gyazo.com/7d1d1d2655dd4d62247f18f6d898edbe.png">
 This is the result of writing the URL to 86 IRC. Still plenty of room.
 
 -----
 
 Ahhh, I get 500 when I type Japanese into chat. If I don't explicitly convert values that may contain Japanese to unicode, it assumes it is ASCII and tries to process it, but it contains non-ASCII characters and causes an error.
 
 -----
 
 It's 3:00, so I'll just quietly publish it here.
 I played it while writing things in the chat room.
 http://saichugen-online.appspot.com/game/210/
 </body>

[Hatena Diary 2008-10-12 https://nishiohirokazu.hatenadiary.org/archive/2008/10/12]