Hatena2009-10-29
code:hatena
 <body>
 *1256823848*Diary of Vertigo
 Dizziness.
 
 At first I thought I was simply having trouble sleeping and wobbling when I got up, but then I thought I was standing up straight in the bathroom and I was leaning and bumped into a wall and I thought, "Huh?" I think.
 
 I sometimes get dizzy even when sitting.Twit "I feel dizzy whether I'm standing or sitting. What the heck is this?"
 
 Dehydration or low blood sugar? I wasn't very hungry but bought some bread and tea at a convenience store and ate and drank. Hmmm. I don't think I have a fever.
 
 Search by "vertigo". <a href='http://www.memai-navi.com/chishiki/syoujo.htm'>Symptoms of vertigo this and that - "Vertigo Navi" - an information site for symptoms of vertigo, lightheadedness, nausea, headache, tinnitus, etc</a>. I was told that it could be caused by my ears, and I started to think so.Twit: "Considering the symptoms, I strongly suspect otitis media. If it continues after tomorrow, I may have to go to an ENT."
 
 But isn't otitis media supposed to hurt? It doesn't hurt at all. Twit "Well, I think otitis media is an exaggeration. It says that vertigo develops when otitis media worsens and the inner ear becomes inflamed, but I've never had an earache to begin with.
 
 I had discomfort behind my left ear when I yawned this morning. I have a feeling of discomfort in my left ear when I yawn, dizziness when I put my left ear down, and sometimes I feel like I'm going to fall over to the left when I stand up... @mkaneda Do you get dizziness worse when you turn to either side?　If you feel like that, go to an ENT and get some medicine and you'll be fine in no time. I guess it's the ears.
 
 I've been sleeping all night because the world is wobbling and I'm unmotivated, but I'm pretty sure it's my ears. When I'm asleep and I put my left ear down and then my right ear down, the world spins violently.Twit "I've been sleeping all night and I'm becoming aware of an inflammation in my left ear. Too many things come to mind."
 
 I have been feeling itchy in my left ear for a while now, and when I took a bath I couldn't get rid of the water that got into it, but I wonder if there were any signs from that time. When I sleep, I feel a little feverish behind my left ear, and a dull pain in my back tooth, which I thought might be a cavity, turns out to be my upper left back tooth.... There are too many things that come to mind.
 
 I'll try to come up with an explanation that makes sense within my understanding. The severe pain of acute otitis media is caused by pressure on the eardrum from swellings in the middle ear, so if the eardrum is damaged due to ear-pulling or something, it is likely to become exudative otitis media without going through acute otitis media. Exudative otitis media is painless. It is reasonable to assume that the recent itching in my left ear was caused by exudative otitis media, and that the inflammation was aggravated and spread to the inner ear because I did not notice the inflammation and left it unattended or got water in my bathtub.
 
 >>
 In some cases, inner-ear inflammation is a disease/// in which suppurative inflammation such as chronic otitis media has spread to the inner ear, but the symptoms are mild and left untreated without consultation by a physician or other appropriate medical institution, resulting in conversion to inner-ear inflammation. When the disease progresses from otitis media to endophthalmitis, not only tinnitus and hearing loss but also dizziness, vomiting, and nausea may occur. Thus, most cases of inner ear infections originate from middle ear infections.
 <<
 <a href='http://www.dizzy-buzzing.com/symptom/labyrinthitis.html'>Endophthalmitis</a>, a more frightening sequelae of hearing loss than tinnitus or vertigo.
 
 Hmmm. I'm going to see an ENT tomorrow. And if the cause is inflammation, I'll take some aspirin. I don't want to be in trouble if the dizziness gets worse tomorrow and I can't walk.
 </body>

[Hatena Diary 2009-10-29 https://nishiohirokazu.hatenadiary.org/archive/2009/10/29]