Hatena2015-03-03
code:hatena
 <body>
 *1425384203*Action for "SCARD_E_TIMEOUT(0x8010000a)" error in e-Tax
 This time, in the "pre-check" section of e-Tax to check the deed before preparing the tax return, the following error occurred.
 >||
 SCardGetStatusChange NG
 return :SCARD_E_TIMEOUT(0x8010000a)
 ||<
 
 A search turned up several solutions.
 
 ** 1: Change the location of the card reader
 
 There are reports that sometimes it is no good if there is metal in the vicinity and OK if it is separated from the metal. I wonder if it has to do with radio waves in the case of non-contact reading. The ward office also said, "We stick it on a rubber mat at our place.
 
 ref. <a href='http://pikoro.xsrv.jp/ty/blg/2012/03/scardgetstatuschange-ng.html'>SCardGetStatusChange NG - Doukan Yamada's Blog</a>, <a href='http:// blog.canpan.info/hofu_nanboku/archive/206'>'SCardGetStatusChange NG', 'SCardConnect NG' - Spring Haze</a>.
 
 ** 2: Polish the terminal part of the card reader
 
 There are reports that polishing the gold-colored terminal part of the resident card with a cloth makes it OK. In the case of contact-type readers that insert the card, poor contact of the terminals may be a problem.
 
 ref. <a href='http://fujii.weblogs.jp/masato/2010/03/etax%E7%94%B3%E8%AB%8B3%E5%B9%B4%E7%9B%AE.html'>@masatofujii: e-Tax application, 3rd year</a>.
 
 ** 3: Built-in card reader
 
 I was having trouble resolving the problem after trying the above solutions, but when I thought about it, the laptop I was using had a built-in card reader. I forgot about it and connected the card reader I had been using for e-Tax until last year to a USB port and pointed my resident card to it.
 
 I removed the external card reader and inserted the resident card into the internal card reader and it worked OK.
 
 ** Summary
 
 I made the common mistake of connecting the card even more when there was a built-in card reader, and I also inadvertently went to the ward office mistakenly thinking, "The certificate has expired!" and went to the ward office mistakenly thinking, "The certificate has not expired," which annoyed the staff. Based on the solution, I assume that this is an error indicating that the card reader could not find the card within a certain period of time while trying to read it. This error cannot be resolved at the ward office because it is a problem with the card reader at hand.
 </body>

[Hatena Diary 2015-03-03 https://nishiohirokazu.hatenadiary.org/archive/2015/03/03]