Hatena2014-07-22
code:hatena
 <body>
 *140606033821*[cat]Why I got a cat.
 When I tell people that I have started owning cats, I am often asked the question, "Why?" question.
 
 I myself have never kept animals. If I have, my only pet-keeping experience was when I went camping in elementary school and caught translucent plankton in the river water, brought it home in an empty Ju-C container, left it with the lid closed, and the next day it was all white and floating.
 
 My wife, on the other hand, has experience with birds, turtles, hamsters, and many other things. And it is also my wife who wants to keep a cat. I have no experience of keeping pets, so I was a little anxious about keeping a cat, but I am the type of person who, when faced with a choice between "acting despite my anxiety" and "avoiding my anxiety and not acting and not changing anything," sometimes chooses the former.
 
 So the decision to have a cat itself had been in the works for some time, and last February we decided to move to a house where we could keep a cat. (It was my wife who searched for the house. I will write about the difficulties in this area in another entry.)
 
 I started getting a cat in June, but why did it take me so long? It was because we were waiting to meet the cat. A friend of my wife's volunteers to shelter abandoned dogs, and because of her influence, my wife had a policy of taking in shelter cats instead of buying them from pet stores.
 
 My wife told me that she found a foster home near our house by looking at the foster home information on <a href='http://www.satoya-boshu.net/'>Dogs, Cats, and Foster Homes "Always Wanted" - Before Going to a Pet Shop Health Center</a>. She chose the one near her house because it is less burdensome to transport the cat.
 
 My wife is a stay-at-home mom, so we had agreed that she would first look around on her own, and if she found a good candidate, she would take me with her. However, it was difficult to decide on a candidate by myself, so I said, "Well, let's go look together this weekend," and to my surprise, a foster parent meeting was held quite close to my house! That's where I met Thomas.
 
 If you feel uncomfortable going to a cat café when it is unclear whether or not you will take in a cat, you should go to a cat café that is looking for foster parents. You can simply enjoy the café as a cat café without the hurdle of feeling that you have to take in a cat or decide whether or not to take in a cat.
 
 He also said that it is important to talk to people at various foster groups to find a good fit. There are people in the world who take in kittens and abuse them, so the foster groups are wary of such people. So we try to verify their identity, but "send us a picture every month," "we will visit your home unannounced," "tell us your annual income," and so on. The ideology of what to demand is different for each association.
 
 The foster home where we got our cat was like, "send us a picture every once in a while," "neuter the cat at about 6 months and let us know when it's done," and "feel free to call us, even in the middle of the night, if you have any problems.
 
 In the U.S., the major practice is to neuter dogs at 3 months before handing them over, but in Japan, there are some teachers who say you have to wait a year before neutering, while others say 3 months is fine. In the case of this foster parents' group, the policy was to castrate the animals as early as possible. This was acceptable to us.
 
 Also, even though it didn't matter in our case, the policy was that if you are working together, you are not allowed to keep a small kitten by itself. They said that it is very stressful to leave a kitten alone at a time when it is normal for it to be rolling around with its siblings.
 
 Well, each foster parent association has various policies like that, so it would be a good idea to start by casually going to visit them and listen to what they think.
 </body>

[Hatena Diary 2014-07-22 https://nishiohirokazu.hatenadiary.org/archive/2014/07/22]