Hatena2010-07-07
code:hatena
 <body>
 *1278509600* What is a "good worker"?
 If your organization says, "We need skill X for future work, so please learn skill X. So please acquire skill X." If the organization decides, "We need skill X for our future work," then a "person who can do the job" is not a person who
 
 -1 I've already mastered skill X for this kind of thing.
 -2 Don't have skill X now, but will learn it soon
 -3 Decides that the cost of acquiring Skill X is not for him and immediately moves to an organization where Skill X is not required
 -4 Propose and persuade more efficient forms and methods of work rather than acquiring skill X to change organizational decisions (PS: thanks Ern)
 I think it's one of those things. The idea that we are debating whether or not the organization's decision is the right one is ridiculous. If you don't agree with the organization's decision, then quickly choose 3 or 4. if you don't have the courage or skills necessary to choose 3 or 4, and you can't even learn skill X by choosing 2, you can call yourself someone who can't do the job.
 
 By the way, I'm talking about Rakuten's decision to make English the official language.
 </body>
 <comments>
 <comment>
 <username>showyou</username>
 <body>Whether you can do the job or not, changing jobs is a "result", and I think the polarization of <br><br>"If you can change jobs, the work environment will improve<br><br>"If you can't change jobs, the work environment will get worse and worse<br><br>"If you can't change jobs, the work environment will get worse and worse<br>" will increase. <br><br>"If you couldn't change jobs, you should just meekly follow" will lead to more Kato's in the Akihabara massacre case. </body>
 <timestamp>1278535866</timestamp>
 </comment>
 <comment>
 <username>Eruen</username>.
 <body>What bothers me every time I see such arguments is that <br>they propose and implement forms and methods of work that are more efficient than acquiring skill X, without acquiring skill X. <br>They are not only the most efficient way to do the job, they are also the most efficient way to do it. <br>I wonder if "work" here means doing assignments according to the rules given to you by the government?　<br>That means that a venture business owner or planner who chooses his own genre, thinks up his own methods, negotiates, and works in his own way, for example, will never be recognized as someone who can do the job. <br>Is that what "work" means? </body>
 <timestamp>1278540767</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Independent entrepreneurship is included in option 3. <BR>It is indeed possible to persuade the organization to change its decision, I added. Thank you. </body>
 <timestamp>1278559022</timestamp>
 </comment>
 <comment>
 <username>soda</username>
 <body>If the definition of "skilled person" is "a person who can do everything adequately", it is true (and it is not hard to understand that such an ability is necessary for the executive level), but in reality, there are cases where "a person has skills in field A but not in field B" that cannot be ignored. In reality, however, there are cases in which a person has skills in field A but not in field B. (Or, rather, such cases are more common, and this type of person is/are useful enough in the actual workforce. If this is the case, wouldn't it be a mistake to take measures that make people who "excel in skill A, which is indispensable in the company's sphere of activity, but are inferior in skill X, job change skills, and persuasion skills" into people who cannot do their jobs (= excessive emphasis on skill X, which is not necessarily indispensable)? Well, job changing skills aside, persuasion skills are important in most businesses, but there are cases where you can't persuade someone if they are an idiot, no matter how good your persuasion skills are. In the case of Rakuten, I think it would be appropriate if English was only required for upper level meetings such as board meetings and executive meetings. However, if (I don't know much about it, but if) English is mandatory even for lower level meetings that are completely closed within Japan, I think it would be strange. </body> </P> </P> <P></P> <BLOCKQUOTE
 <timestamp>1278662943</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Interesting comment</body>.
 <timestamp>1278663507</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>showyou><br>I wasn't sure, so I let it sleep for a day, but I didn't quite get the "career change is a result" thing. </body>
 <timestamp>1278663558</timestamp>
 </comment>
 </comments>

[Hatena Diary 2010-07-07 https://nishiohirokazu.hatenadiary.org/archive/2010/07/07]