Hatena2008-02-15
code:hatena
 <body>
 *1203033701* Considerations on fatigue
 Efficiency loss due to fatigue comes before the subjective symptoms of fatigue.
 
 *1203040292* Spring.
 
 The wind is still cold, but the sun is much warmer now.
 
 *1203048486* It's time to say a few words about LUNARR.
 In Wikipedia, for example, there is a "Notes" page on the back of every page, where editorial discussions can take place. The front page is Wiki and the back page is also Wiki; the back page is public on the front and public on the back because it is a single page that is shared by everyone.
 For example, Hatena Bookmark allows users to add a back page to any page with a permalink that includes a "list of bookmark comments added by everyone" and other information. The purpose of adding a back page is not in itself to add a back page, but there is an aspect of "a service that adds a back page to all pages. Originally, it may have been a place where the person on the back page could see everyone's comments, but now third parties exchange their opinions through bookmarked comments, so it is fair to say that the back page is a "one-line bulletin board. Both the front and back pages are PUBLIC.
 Back pages can also be added in LUNARR. The back page is the equivalent of a GMail thread. The back page is the equivalent of a GMail thread, and the email exchanges are attached to the back page. This is not public because it is shared only among the people who exchanged e-mails.
 This is a bit technical, but making a page private means that "even on a page with the same permalink, the communication between Mr. A and Mr. B and between Mr. C and Mr. D must not interfere with each other," so it is inevitable that the LUNARR side must assign IDs to the contents. This means, conversely, that as long as LUNARR assigns IDs, there is no need for the table page to be public. For example, it is possible to upload an Excel or Word file and "add a back page" without making it public to a third party.
 
 
 And well, that's the kind of service we provide.
 
 *1203048593* For now.
 Since I received an iPod nano and it would be bad if I didn't write anything, I briefly summarized the service.
 
 *1203048678*1 year
 I made a document of what I did during the year (9 and a half months to be exact, since it started in April). Looking back at it, it is very informative.
 I'd like to go back and organize this Hatena Diary as well. Oh, and I just remembered that my original blog (http://www.nishiohirokazu.org/blog/), which I neglected because the database went haywire, ended up settling at Hatena, so I don't need to go back and fix it. I'll have to do something with that one too.
 
 I can just put a script under H1 that says something like "This page is an archive, click here for the latest blog". I should just write a script to put something like "This page is an archive, click here to see the latest blog" under H1.
 
 *1203050925* English Blog Day 3
 <a href="http://nishiohirokazu.blogspot.com/2008/02/pythondraw-fractal-patternjulia-set.html">NISHIO Hirokazu's blog: [Python]Draw a fractal pattern(Julia set)</a>
 
 This is an English translation of an article I wrote three years ago.
 
 I have established a flow of reddit -> Digg (think of summary text) -> del.icio.us (add summary text) -> reddit comments (add summary text) -> hatebu. I was able to do it rather efficiently.
 
 Oh, 2digg already. It's interesting that the response is more than I expected.
 
 *1203058021*Prolog
 Now that I'm done with work, I'm looking at Prolog as I did yesterday: I understand Prolog up to the three stages, but not the cuts yet. I'm not sure if yesterday's <a href="http://www.okisoft.co.jp/esc/prolog/in-python.html#5">Tiny Prolog in Python</a> is really a good implementation or not, because I don't understand the cuts first. I think it's rather oddly written from the eyes of a Pythonista who doesn't know Prolog.
 For now, read <a href="http://bach.istc.kobe-u.ac.jp/prolog/intro/">Introduction to Prolog (in Japanese)</a>.
 
 -----
 Prolog to get mother(X, Y) :- female(X), child(Y, X). and father(X, Y) :- male(X), child(Y, X). I think X in the first rule must be different from X in the second rule if there are two rules <a href="http://www.okisoft.co.jp/esc/prolog/in-python.html#5">Tiny Prolog in Python </a> implementation, I feel that a human has to make a decision every time and create another Var instance.
 
 *1203068091*about id:TKSK
 I want to join id:TKSK! the members of the id:TKSK steering committee will go around to interview you and tell you that if you guess the password, they will let you in. I want to pretend to be Mr. Takezako and write something terrible! (yeah!
 
 -----
 
 Well, it's neither dankogai nor kogaidan. I don't know.
 </body>

[Hatena Diary 2008-02-15 https://nishiohirokazu.hatenadiary.org/archive/2008/02/15]