Hatena2008-09-02
code:hatena
 <body>
 *1220352695* T-fal or not that is the question.
 <a href="http://d.hatena.ne.jp/nishiohirokazu/20080901/1220218772">Electric Kettle - The Hatena Diary of Yasukazu Nishio</a>
 >>
 id:setomits
 At my last job.
 http://amazon.co.jp/o/ASIN/B000CQ73MA
 I used to use this one, but it costs less than $3,000.
 It boiled fast enough and was convenient.
 <<
 
 >>
 id:HolyGrail T-fal electric kettle is magically recommended. The thing will change your life.
 <<
 
 I wonder if any electric kettle will do, or if T-fal is even better!
 
 *1220362658*[Housework] Cooked rice
 I want to cook rice.
 http://homepage3.nifty.com/emimama/takikomigohan.html
 f:id:nishiohirokazu:20080902223920j:image
 f:id:nishiohirokazu:20080902224635j:image
 
 When I added the mushrooms, it was a huge amount, so I decided not to add the maitake mushrooms.
 I was not sure about the amount of water, so I added about 200 cc of 3 times concentrated sauce and 200 cc of water for 2 cups. If I remember correctly, there is about 250 cc of water per 1 pot, and 400 cc is reasonable for 2 pots after subtracting the amount of water from the vegetables.
 </body>
 <comments>
 <comment>
 <username>atushi</username>
 <body>Nice to meet you. <br>We also use a T-fal electric kettle, and as it says, "It takes only 48 seconds to boil a cup of coffee (140cc) in a French 1450W electric kettle (switch off is 62 seconds). I have not compared it with other new manufacturers.) <br><br>For reference<br>http://www.amazon.co.jp/T-fal-%E9%9B%BB%E6%B0%97%E3%82%B1%E3%83%88%E3%83%AB-%E3%83%8B%E3%83%A5%E3%83%BC%E3%83%B4%E3% 82%A3%E3%83%86%E3%82%B9%E3%82%A8%E3%82%AF%E3%82%B9%E3%83%97%E3%83%AC%E3%82%B9-1L-BF202022/dp/B000BD83ZU</body
 <timestamp>1220355864</timestamp>
 </comment>
 <comment>
 <username>HolyGrail</username>
 <body>A year or so ago<br>http://d.holy-grail.jp/?p=65<br>I wrote this entry! <BR><BR>I've never used any other electric kettle, so I don't know, but I think I'm at the point where I can say, at least with T-fal, it's not a problem. </body>
 <timestamp>1220358023</timestamp>
 </comment>
 <comment>
 <username>asami81</username>
 <body>I saw id:HolyGrail's entry and bought a stainless steel T-fal without hesitation! <br>I think it was a little more expensive than the others, but I'm glad I went with stainless steel if I'm going to use it for a long time. <br>The T-fal at my parents' house is white plastic, but I think it's a little too hygienic. <br>And also the appearance! <br>Maybe T-fal or not, as HolyGrail said, it's just "safe" or not. </body>
 <timestamp>1220410230</timestamp>
 </comment>
 <comment>
 <username>tgbt</username>
 <BODY>I bought a coffee maker to drink coffee and it was also useful for boiling water normally. Thanks to this, I don't use electric kettles or warming pots (?) anymore. <br>If you want to make barley tea or oolong tea, you should use a coffee maker. <BR><BR>By the way, when I want to make barley tea or oolong tea in bulk, I hang a medicine can on the stove. <br><br>I am sure there are many others like me! </body>
 <timestamp>1220464836</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-09-02 https://nishiohirokazu.hatenadiary.org/archive/2008/09/02]