Hatena2008-01-14
code:hatena
 <body>
 *1200269421*Adult Day
 Right? Right? I'm off work, right?
 
 *1200276761*出社
 I wasn't sure whether to come to work or not, but I won't. If I come to work, there's no doubt in my mind.
 - try out the infrared pen
 - Test 1000speakers with the projector screen out.
 I thought I would be doing something other than writing, such as
 
 *1200278252*dropdb
 http://d.hatena.ne.jp/dropdb/20080114/1200243658
 I guess people have a tendency to assume that the information they see is all there is to the subject. I must be careful.
 At the very least, I don't think it's a good idea to think I "know" someone I only know on the web. And even more so, to extend it to "people around me" whom I don't even know on the web.
 Be careful, even if it's just yourself.
 If we can gradually reduce the number of "expansions" in this way, perhaps the world will become a more blog-friendly place.
 
 ----
 
 http://d.hatena.ne.jp/dropdb/20080114/1200283877
 Sequel. As an outsider, it is interesting to know more about it, but I think it would have been better to let it slide without getting too involved with the "enemy". Well, at any rate, it's a neat story.
 
 ----
 
 I wonder if people say things like, "I heard he's a pervert, so you shouldn't go out with him" without my knowledge.
 I can tolerate it when people say it to me, but I don't like it when people around me get involved.
 
 *1200278842* Where does GoogleMap get its store information from?
 Where does GoogleMap get its store information from?
 He gave me a nearby bicycle shop for "oshiage bicycle shop," so I searched for a whatsapp store near my parents' house to try it out, and my grandfather's store came up! I wonder where he got the address and phone number from. I searched the Yahoo phone book with the address and phone number that came up, but the name of the store is different.
 Do you hire a lot of part-timers to type?
 How are they going to keep up with the changes, even though I'm sure store information changes all the time?
 
 Once I searched for the location of a movie theater on goo and found that it was registered at two different stations, so I'm a little worried...
 
 *1200282115* Neodymium is cute, Neodymium.
 
 f:id:nishiohirokazu:20080114122219j:image
 
 
 f:id:nishiohirokazu:20080114123203j:image
 
 
 f:id:nishiohirokazu:20080114124019j:image
 
 The geomag was fun, but the unadorned metallic shine made me moan. I'll go buy more.
 
 Incidentally, a regular pentagonal pyramid consisting of 3 equilateral triangles on each side has 4, 5, and 5 spikes growing on it, totaling exactly 100 spikes (30 on the pentagonal pyramid and 14 on each of the 5 spikes, for a total of 70). (There are 30 in the pentagonal pyramid and 14 in each of the 5 cones, for a total of 70).
 
 *1200297968* I went shopping.
 f:id:nishiohirokazu:20080114170559j:image
 
 150 more neodymiums are added.
 I didn't buy it all! I left a little bit of it behind!
 
 I made the mistake of buying the disk-shaped one. I thought they were silver all the way to the back, but they were just covered with a subtle metal cap that was not smoothed on the edges.
 
 *1200300058*shopping
 I wanted to buy a bike but the store was closed. I guess I will have to leave early on Friday.
 
 *1200301376* The non-magazine gainer.
 -Gainer Review (TORIGOE DESIGN. doc)
 --http://doppelganger.jp/doc/archives/gainer/000058.html
 -trick7.com blog: Gainer 雑感
 --http://www.trick7.com/blog/2007/06/06-232711.php
 I see. So this is what it is. And you can make something like this?
 LCD plan for the -Lanterns- -Saku-san's Diary
 --http://d.hatena.ne.jp/sakusan_net/20080112/1200157946
 Looks interesting.
 But for now, I think I will take a break from hardware activities for a while after I finish the operation test of the infrared LED.
 
 *1200305325* mashup lol
 http://blog.livedoor.jp/dankogai/archives/50985072.html
 Unbeknownst to me, I was mashed up with Mr. Taizo Nishio (lol).
 I'm Nishio, the guy who makes function calculators that allow you to define functions in Jython, write one-liners in Python, and how to write orgs. I'm Nishio, the one who makes the function calculator that can define functions in Jython, and the one-liner in Python and the how-to write org.
 
 And since this is not enough:
 >>
 If bullying occurs, it is only the bully who is at fault.
 <<
 
 This is certainly a good argument. But while it is obviously wrong for a car to run a red light at an intersection, even with a green light, I look both ways before crossing. Whether the other car is obviously bad or not, if you get run over and die, you have nothing to lose.
 
 By the same token, whether it is my fault or not, if I suffer some damage by continuing to blog, there is nothing wrong with avoiding it. It is subjective as to whether you consider the heartache and other damage you suffer by continuing to blog or the various effects you lose by stopping to blog to be greater. I and Dan-san continue to blog because we estimate that the benefits of exposing ourselves are greater, but these values are not something that can be imposed on others.
 
 Considering how much heartache he must have gone through to make the decision to leave the blogosphere, and the state of mind he is in now that he has announced such a conclusion, it would be too cruel to confront him with the correct answer now. I thought it would be ideal to have someone in a position of a major figure in the blogosphere who is well acquainted with him smile and say, "You can come back anytime you want. I didn't say it because I didn't think I was in a position to say it.
 
 But reality doesn't work the way you expect it to!
 
 *1200307710* Ustreamed comparison video of slides for each font size
 coji made it!
 http://ustream.tv/channel/1000speakers
 Easy to understand!
 
 追記：
 -coding my life : Test of 1000 Speakers Project presentation delivery
 --http://coji.s9.xrea.com/article.php?id=53
 </body>
 <comments>
 <comment>
 <username>dropdb</username>
 <body>I see! I'm not going to get involved anymore. </body>
 <timestamp>1200302245</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-01-14 https://nishiohirokazu.hatenadiary.org/archive/2008/01/14]