Hatena2012-11-16
code:hatena
 <body>
 *1353063824* Lean Canvas: leverage memo
 Leverage memo on Lean Canvas
 
 ** ■Lean Canvas for business model hypothesis testing
 
 I think in terms of WHAT, WHO, and HOW when formulating hypotheses.
 
 - 1: What: Problem
 -- What is the problem you are trying to solve?
 - 2: WHO: Customer
 -- Who has the problem?
 - 3: HOW: Products/Markets
 -- how to solve that problem.
 -- How big is the market (how big)
 -- How are you going to reach your customers?
 -- How do we stir up demand?
 -- How to make money
 
 The order of writing on the lean canvas (the author's favorite)
 
 - 1: Problem: Top 3 problems you are trying to solve
 - 2: Customer Segment: Customer: Who is the customer? Can you break it down into smaller segments? If you have multiple segments, I recommend creating a canvas for each one.
 - 3: Unique Value Proposition: What is the catchphrase that makes the customer say, "Oh, that's nice, I'll buy it.
 - 4: Solution: What is the MVP in demonstrating Solution: 3.
 - 5: Key Activity ((later changed to Key Metrics)): What is being measured: What is the most important action a user takes that leads to revenue or a return visit? For example, if your business is a blogging platform, blog posts can be a key activity.
 - 6: Channels: public relations and sales channels: paid and free channels that can be used to reach customers
 - 7: Cost Structure: Expenses: Write down all fixed and variable costs.
 - 8: Revenue Stream: Revenue: Clarify how you get your revenue. Subscriptions? Advertising? Freemium? Then outline the customer lifetime value, gross margin, and break-even point.
 - 9: Unfair Advantage: Barrier to Entry: The point at which others in this business cannot imitate you. This is difficult to fill, so it may be left blank at first, but businesses without it will eventually suffer as imitators enter the market. Make efforts to fill this gap.
 
 <hr>
 
 So a business without barriers to entry, even if it succeeds, will become a red ocean and not profitable.
 
 ** ■Why is the Lean Canvas better?
 
 We tried Business Model Canvas and fixed what we didn't like about it, which is Lean Canvas.
 
 The purpose of creating a lean canvas is to figure out what is most uncertain.
 
 Four were replaced from the original Business Model Canvas.
 
 ** Added (problem, solution, measurement target, barriers to entry)
 
 Problem: Understanding the problem is important. Most startups don't fail because they can't make what they set out to make. They fail because they waste time and money making the wrong thing.
 
 SOLUTION: Understand the problem, then come up with a solution. I purposely and intentionally kept the box small because it is easy to get too passionate about a solution or fall in love with the first idea. Practical minimum.
 
 What to measure: Startups tend to drown in a sea of numbers, trying to somehow make sense of uncertainty. Startups can only focus on one number. So they have to decide what to ignore.
 
 Barriers to Entry: few startups have this from day one. So leave it blank. Make an effort to create/find it. Once a startup is successful, it is inevitable that there will be imitators.
 
 ** Removed (Key Activities, Key Resources, Customer Relationships, Key Partners)
 
 KA/KR: This is an outside perspective.
 
 KA: KA is derived from the "solution" if we verify the minimum practical product.
 
 KR: Unlike in the past, the bottleneck in product creation is not physical resources; KR is a barrier to entry, but barriers to entry are not always KR.
 
 CR: Included in Channels (public relations and sales channels)
 
 KP: This was the most difficult one to remove. Of course there are some industries where partners are important. But most are not. It's a waste of time for an unknown startup with an unproven product to start looking for partners from day one.
 
 ** Q&A
 
 Q: What is the difference between "problem" and "value"?
 
 A: "Problem" is the issue facing the customer. Value is a marketing promise. Value comes from the intersection of "problem" and "solution.
 For job seekers, the problem is "getting noticed by good companies," the solution is "cool resume templates," and the value is "get your dream job in 60 days!
 
 
 Q: Is there any "competition"?
 
 A: I am not interested in defining so-called competition. A true competitor is not what you consider a competitor, but what your customers consider a competitor. (This reminds me of "The competition for cabs was not trains, but comic cafes. Manga cafes are competing with cabs for customers as a solution to the problem of missing the last train.)
 
 
 Q: What is the difference between "value" and "barriers to entry"?
 
 A: Value is to attract customers' attention. Barriers to entry are to prevent imitation.
 
 
 Other
 A: It's important to have it all on one page.
 A: It's important to understand the problem.
 
 <hr>
 
 I omitted the last part because I no longer feel like translating the question side.
 
 ** References
 
 Why Lean Canvas?
 http://www.ashmaurya.com/2012/02/why-lean-canvas/
 Lean Startup Canvas for Business Model Hypotheses Validation
 http://www.ashmaurya.com/2010/08/businessmodelcanvas/
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=1449305172" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe><iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4798122971" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 </body>

[Hatena Diary 2012-11-16 https://nishiohirokazu.hatenadiary.org/archive/2012/11/16]