Hatena2008-06-27
code:hatena
 <body>
 *1214549334*[pyspa]This Way
 I don't know what will happen if I go down this road.
 f:id:nishiohirokazu:20080627154851j:image
 If you step out, that one step can be fatal.
 
 
 
 The ryokan at Python Hot Springs was not this way.
 
 *1214550581*[pyspa]Pytho Hot Springs Day 1
 He said it's 8:30 in the morning tomorrow and no sleeping in!
 
 -----
 
 Is it a private party? They say the hot springs are open 24 hours a day!
 
 -----
 
 Mr. YMASUDA is perplexed because there is no distinction between men's and women's baths.
 
 -----
 
 id:jbking taught me a lot.
 
 -Takemaru / Kai - Amazon's Dynamo communicating with memcache protocol
 --http://teahut.sakura.ne.jp/b/2008-05-13-1.html
 
 Recommended path to study Erlang: read the Prolog part of OnLisp -> understand Prolog pattern matching -> study Erlang
 
 -On Lisp --- Prolog
 --http://user.ecc.u-tokyo.ac.jp/~tt076524/onlispjhtml/prolog.html
 -Erlang Distributed Systems Study Group Document Summary - Twisted Mind
 --http://d.hatena.ne.jp/Voluntas/20080618/1213766105
 
 -----
 
 -Overview &#8212; Sphinx v0.4 documentation
 --http://sphinx.pocoo.org/
 
 I heard that Python 2.6 or so already includes it. The search of documents is done with JavaScript, and the index file is in JSON format in a file called searchindex.json, so you can search without having to contact the server. It's amazing. The display of search results is cool, too.
 
 -----
 
 I heard that Summer Lion's source code is clean and very good for learning Obj-C.
 
 -----
 cooked rice
 
 f:id:nishiohirokazu:20080627182417j:image
 
 I suddenly won a rock-paper-scissors tournament courtesy of <a href='http://accense.com/'>Axens Technology</a>! They had green and black, but I didn't have a choice of colors, so I got red. They said I looked like a pizza delivery guy.
 
 f:id:nishiohirokazu:20080627185729j:image
 
 <a href='http://omake.accense.com/wiki/Recruit'>Hackers (and applicants) wanted</a>
 
 -----
 
 Chumby seems to have some functions that are dead due to bugs in the device driver.
 
 -----
 
 I wrote this code to explain that multiple assignments in Python are different from multiple assignments in C in terms of the order in which assignments occur.
 
 >|python|
 >>> class Foo(object):
 ...     def __init__(self, name):
 ...             self.name = name
 ...     def __del__(self):
 ...             print self.name, "deleted"
 ... 
 >>> x = Foo("x")
 >>> y = Foo("y")
 >>> x = y = 1
 x deleted
 y deleted
 ||<
 
 -----
 
 If you write Ruby in NetBeans, when you write 5.u, not only 5.upto appears in the completion candidates, but even sample code appears! It seems to be good for studying Ruby. Methods of classes you define by yourself can be completed, but the return value of the method has no information about what class it is, so methods of Zubete's class appear in the completion candidates. Note that just because a method is listed as a candidate does not mean it exists.
 
 -----
 
 http://citeseer.ist.psu.edu/myers86ond.html
 
 *1214595267*[ruby]Singular methods
 I tried to rewrite Integer's +, but the behavior does not change. Maybe they make it so that Integer's + can't be overwritten to improve performance, but doesn't it skip an exception or something~?
 
 >|ruby|
 >> class Array
 >>   def +(x)
 >>     0
 >>   end
 >> end
 => nil
 >> [] + 1
 => 0
 
 >> class Integer
 >>   def +(x)
 >>     0
 >>   end
 >> end
 => nil
 >> 1 + 2
 => 3
 ||<
 
 Extra: Because it rewrites the class of the interpreter itself that irb is running on, irb itself will fall down depending on the contents.
 >||
 >> class String
 >>   def +(x)
 >>     0
 >>   end
 >> end
 => nil
 >> "hoge" + 1
 /System/Library/Frameworks/Ruby.framework/Versions/1.8/usr/lib/ruby/1.8/irb/ruby-lex.rb:191:in `buf_input': private method `split' called for 0:Fixnum (NoMethodError)
 (irb death)
 ||<
 
 -----
 
 PS, I wonder if the + is defined again in Fixnum, which inherits from Integer, so rewriting it in Integer will just overwrite it again.
 </body>
 <comments>
 <comment>
 <username>passing by</username
 <body>Hint: Fixnum</body>.
 <timestamp>1214599921</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-06-27 https://nishiohirokazu.hatenadiary.org/archive/2008/06/27]