Hatena2009-12-24
code:hatena
 <body>
 *1261632202*[Kaizen]S hook
 The bottom half of the hook must face this way to make it difficult to pick it up. When you take it off, it hits and falls off.
 
 Also, too small is inconvenient. And if it's too small, it's inconvenient.
 
 If I use it for a while and stop changing places, I'll probably hot-bond it so it doesn't fall off.
 
 *1261635932*[Kaizen] fabric softener
 The fabric softener is put in the fabric softener slot of the washing machine. I had never used it and had forgotten it existed.
 
 *1261636071*[Kaizen] melamine sponge
 The name "Gekiochi-kun" is not a joke. It's just a white material, but it cleans up nicely.
 
 I also bought a melamine sponge that had baking soda and citric acid pre-soaked in it, but it was small, softer than I had expected, and the area it soaks up all sorts of things turns white after it dries, so it needs to be wiped off separately, which is not good. I thought it would be better to buy a plain melamine sponge.
 
 When I rub the inside of the bath, the grime falls off as if I went to an Akasuri. Interesting.
 
 I cut the melamine sponge and scrubbed the toilet first, so it became very dirty and I had to throw it away immediately. I should start scrubbing from the cleanest place, I guess.
 
 *1261637415*[Kaizen] Kitchen timer
 First, a kitchen timer was introduced to solve such problems as "forgetting to turn on the bath water and letting it overflow," "hot food getting cold when I wanted to cool it down a bit," and "I have to leave in one hour, but when I realized it, three hours had passed.
 
 However, the kitchen timer that I kept under my pillow eventually tumbled somewhere and went missing, and when the bath started overflowing again, I had no choice but to buy a new one, and then the old one was discovered and I had two kitchen timers.
 
 Two kitchen timers in the same place but not using one of them. Should I throw it away? After thinking about it for a while, I decided to stick it with a command tab next to the gas ignition panel of the bathtub, because the most frequent use of the kitchen timer is to heat water for the bathtub. And that's it.
 </body>

[Hatena Diary 2009-12-24 https://nishiohirokazu.hatenadiary.org/archive/2009/12/24]