Hatena2008-10-05
code:hatena
 <body>
 *1223196437*Tsuruben drop
 It's only 5:30 and it's already dark. It's only October.
 
 http://www.nao.ac.jp/koyomi/dni/2008/hdni13084.html
 >Sunset 17:25
 
 Meanwhile, sunset in Osaka Prefecture was at 17:42.
 The sun sets at five o'clock on 11/06 in Osaka, but 10/20 in Tokyo. It is about half a month earlier.
 
 *1223198641*宿題.in
 10/04 23:16
 Web Service "Experts Solve Your Homework" Developed by Elementary School Students : bogusnews
 http://bogusne.ws/article/107605092.html
 >>
     Someone named Egachan made it for me for free."
 
 He said, "I am very happy to be able to do this. This is a good example of how the goodwill of the Internet can help children grow up healthy.
 <<
 And they get the story.
 
 
 
 10/05 05:29 1 commenter.
 >>
 And really, homework.in is done!
 
 http://egachan.net/shukudai/
 <<
 
 Ega-chan is really making it! Big laugh!
 I understand that some people are annoyed by the technical aspects and the lack of consideration for their actions, but I would like to positively evaluate this energetic attitude. A world where Ega-chan stops making services would be an uncomfortable world for engineers.
 
 I was going to write an entry saying "Poison in such a world where you can't even make what you want to make" when Ega-chan shut down her blog, but it looks like my fears are unfounded.
 
 -----
 
 Who is Ega-chan? I wonder if there is any summary site that you can recommend for people who are wondering who Ega-chan is.
 for now
 http://d.hatena.ne.jp/HolyGrail/20081001/1222880038
 is a good entry, mentioning both positive and negative aspects?
 
 -----
 
 10/05 18:43
 <img src="http://gyazo.com/cd3a30472ce974fb1ceb35b81def6255.png">
 
 Seriously, wow.
 It's funny, just like Ega-chan.
 
 -----
 
 10/06 7:00
 Although I wrote this entry in a positive way, I take back the statement "I actually made it in 6 hours in response to a fake news story" because it was factually incorrect.
 
 It is impossible for me to find and follow id:hiroyukiegami's good points. I give up.
 
 *1223224004*日曜日日記
 - Frozen Boiled Spinach 4 sets (1 handful)
 - Stir-fried cabbage, carrots and bacon
 and others were made.
 I forgot to cook the rice while it was still in the rice cooker in preparation for cooking. I reserved the rice to be cooked tomorrow morning, so I will remember to freeze it in the morning.
 
 I used to make water-brewed barley tea all summer long, but the last time I ran out of packets, I thought, "It's already winter," and didn't buy any. But it's a hassle to boil water every time. It's hard to get rid of the convenience of just putting water and a packet in the fridge and having a drink ready to go. The water boils quickly now, but it's too hot. Cat tongue.
 
 I washed the plastic object that dried the dishes.
 
 I bought VMWare Fusion from act2, about $2000 cheaper than store.vmware.com. I'll install CentOS tomorrow so that I can do company work on my MacBook. Also, I'm going to try OProfile.
 </body>
 <comments>
 <comment>
 <username>hiroyukiegami</username>
 <body>Wow, wow, wow, wow, wow, wow, wow, wow, wow, wow, wow, wow, wow, wow, wow, wow.
 <timestamp>1223209450</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>↑I don't understand. Didn't you publish it yourself? </body>
 <timestamp>1223224036</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>http://b.hatena.ne.jp/entry/http://egachan.net/shukudai/<br>>> id:hiroyukiegami I forgot to post my homework in! It was opened on 10/4. http://bogusne .ws/article/107605092.html<br><br>Is this true? <BR><BR>Something tells me that although I initially took a favorable view of the service, I'm starting to feel that it would be a mistake to praise it, seeing as how the service doesn't work properly and how it behaves in the comments. </body>
 <timestamp>1223224789</timestamp>
 </comment>
 <comment>
 <username>通りすがり</username>
 <body>Mr. Nishio, if you are taking this as "a newbie who has let his vulnerability hang out and we are all abusing him", you are mistaken. <br>Maybe you are influenced by the Amachan entry, but I would like you to follow his words and actions in the past a bit more</body>.
 <timestamp>1223232803</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-10-05 https://nishiohirokazu.hatenadiary.org/archive/2008/10/05]