Hatena2008-03-05
code:hatena
 <body>
 *1204675855* Talking in your sleep when you wake up.
 First, someone should implement Emacs Lisp in Java and make a new editor that is compatible with past Emacs and can also use Jython and JRuby (they don't want to make it themselves).
 
 *1204678686* I filed my tax return.
 
 I thought there might be a long line, but it was empty. I got lost on my way home, so I took the Tobu Line from Tikibune Station. It was hard work. I arrived at Asakusa. I took the wrong train.
 
 Can I take the Ginza line to Tameike-Sanno?
 
 *1204682049*Car sharing
 <a href="http://www.orix-carsharing.com/plan.html">ORIX Car Sharing [Petilenta] - Rate Plans</a>.
 
 I left my car behind when I came to Tokyo thinking, "Considering the cost per hour I spend, it is cheaper to call a cab when I need one than to rent a parking space," but I guess there are convenient things in this world. I should get a card....
 
 *1204687882*PyPy
 I had interpreted PyPy as "a Python processor written in Python, which is about 2000 times slower than CPython in execution speed, but because it is written in Python, it is easy to implement new functions," but PyPy may actually be much more than that.
 >>
 translator/ 	translation backends and support code
 translator/backendopt/ 	general optimizations that run before a backend generates code
 translator/c/ 	the GenC backend, producing C code from an RPython program (generally via the rtyper)
 translator/cli/ 	the CLI backend for .NET (Microsoft CLR or Mono)
 translator/goal/ 	our main PyPy-translation scripts live here
 translator/js/ 	the JavaScript backend
 translator/jvm/ 	the Java backend
 translator/llvm/ 	contains the LLVM backend producing LLVM assembler from fully annotated RPython programs
 <<
 http://codespeak.net/pypy/dist/pypy/doc/index.html
 
 *1204692344* Always with IBM
 Looking back, my first computer was an <a href="http://ja.wikipedia.org/wiki/IBM_JX">IBM JX</a>. As an elementary school student at the time, the JX introduced me to DOS and BASIC and got me hooked on programming.
 
 It was IBM's <a href="http://ja.wikipedia.org/wiki/Aptiva">Aptiva</a> that introduced me to Windows 95 and the Internet. I was often scolded for staying up late because of Telehodai and the plethora of free games that were available.
 
 My laptop has always been an IBM <a href="http://ja.wikipedia.org/wiki/ThinkPad">ThinkPad</a>. I have never had a mouse connected to a laptop. I still think the red track point is the best pointing device for programmers, as it allows you to control the mouse pointer without moving your hand from the home position on the keyboard.
 
 The last laptop I bought was a Thinkpad Tablet X41. The combination of a laptop and pen input made me hesitate to abandon the idea of "making my next machine a Thinkpad Tablet X60" until the very end.
 
 Looking back, my life as a programmer has been with IBM. Thank you very much, IBM.
 
 
 f:id:nishiohirokazu:20080305134600j:image
 
 *1204693950*[Mac]So I became a Macer!
 I thought I would miss the Python Developer Camp because I ordered it on Tuesday, but I made it! I guess I can just use MacPorts to get Python 25 for now.
 
 ----
 
 - xcodetools
 - adium
 - growl
 - macports
 - QuickSilver
 - Ctrl+Space to set Spotlight to not appear
 - Ctrl+Space Terminalでターミナル起動
 - I can't seem to turn off Japanese using Command+Space in the terminal. Why does Mac have only one global IME status, even if IME is turned on in Adium, there is no need to turn it on in the console!
 - I'm also annoyed that "nishio-yasushiwa-no-macbook" is displayed > terminal.
 -- Change in System Preferences -> Sharing -> Edit
 - F3 to Expose and then press Tab, which is like Alt+Tab in Windows. But this is much better.
 -- Cmd+Tab was Windows-like.
 - Please stop drawing red lines on nishio with spell check. I don't know where to register words.
 - I didn't notice the "Spaces is not configured" on the back. Oh, my desktop is so big!
 - Safari was heavy for some reason, so I searched for Firefox and Safari died.
 - Ustream worked if you're on Firefox, now streaming to your desktop with CamTwist. http://www.ustream.tv/channel/nishio
 - Chatzilla
 - Install LimeChat because I'm not sure.
 - It would be nice if I could close windows with Ctrl+Click or something while in Expose. I should learn to use the keyboard equivalent of Alt+F4 in Winwdows.
 -- Cmd+W
 -InputSwitcherを入れる
 -I assigned the lower left corner to desktop view, but moving the cursor is a hassle. Where do I set the key bindings?
 -I thought SIMBL was not in the description place, but it was in /Library.
 -I couldn't figure out where the folder created from the desktop dmg was. It was /Volumes.
 -I had trouble figuring out how to open /Library in Finder, Shift+Cmd+G to get to the folder.
 -I tried to copy, but I don't have authorization.
 -sudo su
 -mistakenly cp -r /Volumes/Input... /I... .bundle/ /L... /A... /SIMBL/Plugins/, so only the contents of the bundle were copied. Redo.
 -InputSwitcher is supposed to be enabled after rebooting, so let's assume it's done for now.
 -Right click is Ctrl+Click or
 -nishioを単語登録した
 I tried to solve the first question on -euler, but I couldn't log in, so I don't know if the answer is correct
 -- I'm not making the problem text bigger by making the browser time in unrelated areas bigger, and I'm not logging in and trying hard for a long time, and all kinds of awful w.
 -I solved the second question too...should I put IPython in?
 -- http://www.ustream.tv/recorded/6DkC99xncKK2lDQZa1sgurmVyZs1EGo5
 
 *1204722407*Live somethinging
 http://www.ustream.tv/recorded/m5dl8vlwdK0hzH8CU1,s4nI6Bikca,qg
 
 No one who watched it in real time? Too bad.
 
 Ahh. It was running smooth locally, but I guess the frame jumps when it's via Ustream. I figured if you have a Mac, you should play it yourself.
 
 *1204726791*勉強会情報
 I was going to tell a friend of mine who is thinking of joining an IT study group about a site that has information on study groups (I think there were several), but I was disappointed when I couldn't find it by searching Google.
 
 *1204727830*dropdb
 It occurred to me that it would be interesting to have an offline meeting of female programmers hosted by dropdb, with no boys allowed.
 
 And then I realized that I was no fun at all, not being able to participate. Oh well.
 
 *1204728380*woo
 
 I'm cold, I'm not happy with my Mac book and I'm not making any progress on my manuscript.
 
 *1204734739*MacBook Day 1 Summary
 - You should buy ATOK (from 2 people)
 - Carbon Emacs(今度入れる)
 - Omni Graffle
 - VMWare something
 -- Opinion that Palallels are heavy
 - I only downloaded the e-mobile driver and did not install it.
 </body>
 <comments>
 <comment>
 <username>Yoshiori</username>
 <body>Think about it the other way around! Gosling's implementation of NetBeans is ......</body>
 <timestamp>1204677168</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I see...! (AA abbreviation</body>)
 <timestamp>1204681856</timestamp>
 </comment>
 <comment>
 <username>jbking</username>
 <body>If you compile it, it's fast! <br>But it's slow as it is! </body>
 <timestamp>1204698935</timestamp>
 </comment>
 <comment>
 <username>okuryu</username>
 <body>> Also, I'm pissed off that it shows "nishio-yasushiwa-no-macbook">Terminal<br><br>Can't this be changed in System Preferences -> Sharing -> Edit? </body>
 <timestamp>1204707163</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Oh, thank you. I was able to change it. </body>
 <timestamp>1204708024</timestamp>
 </comment>
 <comment>
 <username>yugui</username>
 <body>Please see InputSwitcher for the "one global IME state" issue. And while you're at it, please take care of the "Let's send a bug report to Apple for changing such a spec" exercise written below it. <br>http://limechat.net/inputswitcher/index_ja.html</body>
 <timestamp>1204708900</timestamp>
 </comment>
 <comment>
 <username>coji</username>
 Please stop drawing a red line on <body>>nishio with spell check. I don't know where to register words. <br>Okay with the right click menu</body>.
 <timestamp>1204713251</timestamp>
 </comment>
 <comment>
 <username>Lian</username>
 <body>How about this one<br>http://blog.woopsdez.jp/2007/11/post_264.php</body>
 <timestamp>1204734022</timestamp>
 </comment>
 <comment>
 <username>i_ogi</username>
 <body>こことか<br>http://catbot.net/blog/2006/10/google.html</body>
 <timestamp>1204735119</timestamp>
 </comment>
 <comment>
 <username>nullpobug</username>
 <body>>>>nishio.女装()</body>
 <timestamp>1204762421</timestamp>
 </comment>
 <comment>
 <username>dropdb</username>
 <body>>>>nishio.女装()</body>
 <timestamp>1204768092</timestamp>
 </comment>
 <comment>
 <username>yugui</username>
 <body>こことか。<br>http://commusuke.eisbahn.jp/</body>
 <timestamp>1204769848</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Traceback (most recent call last):<br>  File ”<pyshell#91>”, line 1, in <module><br>AttributeError: ’Nishio’ object has no attribute ’女装’</body>
 <timestamp>1204770909</timestamp>
 </comment>
 <comment>
 <username>sorasemi</username>
 <body>Good to meet you. <br>As a complement to Expose and Cmd+Tab, there is software like this that allows you to switch between windows and applications using the keyboard (assignments are up to you). <br>Witch<br>http://www.manytricks.com/witch/</body>
 <timestamp>1204776948</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Thank you very much. I will pass it on. </body>
 <timestamp>1204781796</timestamp>
 </comment>
 <comment>
 <username>Youchan</username>
 <body>Come join me and dress up as a woman! </body>
 <timestamp>1204796833</timestamp>
 </comment>
 <comment>
 <username>tom</username>
 <body>>You can right-click with Ctrl+Click or<br>You can set up the trackpad in System Preferences/Keyboard and Mouse so that you can right-click with two fingers on the trackpad + click.　Trackpad two-finger scrolling is also useful! </body> <br
 <timestamp>1204808744</timestamp>
 </comment>
 <comment>
 <username>woopsdez</username>
 <body>I'm doing it! I was going to say "I'm doing it!" but Lian mentioned it. </body>
 <timestamp>1205602153</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-03-05 https://nishiohirokazu.hatenadiary.org/archive/2008/03/05]