Hatena2010-04-18
code:hatena
 <body>
 *1271565939*Tixani
 <a href='http://ja.wikipedia.org/wiki/%E3%82%AA%E3%82%AD%E3%82%AF%E3%83%AB%E3%83%9F'>Ainulakul - Wikipedia</a>
 
 >>
 As soon as the thunder god Kanna-Kamui looked down on the earth, he was attracted to Princess Chikisani on the ground and immediately descended on Chikisani with a thunderbolt.
 
 The wild descent of the god of thunder immediately set Chikisani on fire, and after several explosions, a baby was born from the burning flames.
 (omitted)
 Chikisani was extinguished after burning for six days after the birth of my child.
 <<
 
 Ehhh, too bad for them!
 
 *1271582669*Study of rule book structure
 We are in the process of gathering each theory.
 
 **San Juan
 - flavor
 - Objectives of the Game
 -- Enclosure of cards being used ambivalently
 - implements
 - Game Preparation
 - Game Procedures
 -- Role
 -- Role Tile
 - Next round
 - End of game
 - building
 -- Purple building
 -- Building 6
 - variation
 
 ** Brocks Duo
 - Age range, playing time, number of players
 - Set Contents
 - how to play
 - How to score
 - Strategy Tips
 
 ** Dominion
 - flavor
 - Objectives of the Game
 - contents
 - Game Preparation
 - Game Play
 -- How to choose the first move
 -- Turn Summary A: Action B: Purchase C: Cleanup
 -- Action Phase
 -- Purchase Phase
 -- Cleanup Phase
 -- Exit the game
 -- Example of the first few turns
 -- How to read the Action Card
 -- Other rules
 -- Kingdom Card Description
 -- Recommended kingdom card combinations
 
 ** Brain at its best
 - Age range, playing time, number of players
 - Objectives of the Game
 - implements
 - Game Preparation
 - Game progression
 - End of game
 
 ** Pyramid card
 - player
 - Characteristics of the game (explanation of card features)
 - How to play the game
 -- Seating
 -- Card distribution
 -- Card replacement
 
 *1271610310*Leverage memo: conditions for technologists prologue (1st draft)
 <a href="http://www.amazon.co.jp/gp/product/4478300720?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& CREATIVEASIN=4478300720">Leverage memo for The Technologist's Condition (First Drucker Read for the First Time (Technology))</a>. I finally realized today after a huge explosion in my last <a href='http://d.hatena.ne.jp/nishiohirokazu/20100330/1269945021'>leverage memo: innovation and entrepreneurship (1st draft)</a> that Drucker is so dense that it's too much work to read it all and then try to make a leverage memo with all of it together. So why don't I just make a leverage memo for each chapter? So this is just the prologue part.
 
 >>
 What is needed today are those who continue to acquire skills backed by knowledge. There is a myriad need for those who can use theory as the basis for their skills. They are not so much technicians as technologists. It is the brightest of our youth who should have the ability to be technologists, using skills backed by knowledge.
 <<
 
 >>
 Technologists do not like to manage. Rather, they prefer to work in their own world of technology and science. They also do not like to manage other people's work. Nor are they good at it. As a result, non-technologists often manage technologists.
 <<
 
 >>
 The special characteristic of modernity is the deliberate and systematic implementation of technological revolutions. The social institution that does this is the modern corporation.
 <<
 
 >>
 How to systematize the unknown. The modern worldview is that of Descartes. The whole is defined by its parts.
 The systematization of the unknown, the methodology to leap into the unknown, is exemplified by Mendeleev's discovery of the periodic table. He did not systematize the known. He considered what unknowns must be assumed in order to bring order to the known elements.
 The development of childhood vaccines was another innovation based on the systematization of the unknown←?
 <<
 <a href='http://ja.wikipedia.org/wiki/%E3%83%AF%E3%82%AF%E3%83%81%E3%83%B3 %E3%81%AE%E5%B9%B4%E8%A1%A8'>Timeline of vaccines - Wikipedia</a>. Which one is it?
 
 >>
 Change used to mean catastrophe.
 Change in innovation is purposeful and oriented activity. It differs from both pre-modernity, which fears change, and modernity, which sees change as inevitable progress. These two views made change something that was beyond the control of human beings.
 <<
 
 >>
 Order is dynamic change itself.
 <<
 
 >>
 Karl Marx was the first economist to see the role of industrialists as innovators, but admitting this would destroy the concept of inevitable progress.
 <<
 <a href='http://ja.wikipedia.org/wiki/%E3%82%AB%E3%83%BC%E3%83%AB%E3%83%BB %E3%83%9E%E3%83%AB%E3%82%AF%E3%82%B9'>Karl Marx - Wikipedia </a>. Does this mean "Based on Marx's view of history, he predicted that in a mature capitalist society, the substructure contains various contradictions and alienations, and that these contradictions and alienations will inevitably lead to a social revolution that will push forward drastically the transformation of the superstructure"?
 
 >>
 Innovation is not a substitute for the flutter of genius. Nor does it render unnecessary the systematic work of application and refinement of what is known. It multiplies these forces.
 Fleming's floundering led to the discovery of penicillin's bactericidal power. Waxman's systematization of the unknown led to innovations in our understanding of biological phenomena and antibiotic therapy. It took ten years. But after that innovation, the systematic discovery of antibiotics and the theoretical elucidation of their efficacy and side effects became possible.
 <<
 <a href='http://ja.wikipedia.org/wiki/%E3%82%BB%E3%83%AB%E3%83%9E%E3%83%B3 %E3%83%BB%E3%83%AF%E3%82%AF%E3%82%B9%E3%83%9E%E3%83%B3'> Selman Waksman - Wikipedia</a>"Waksman's team discovered several antibiotics, including actinomycin, clavacin, streptothricin, streptomycin, grisein, neomycin, fradicin, candicidin, candidin, and others."
 <a href="http://www.amazon.co.jp/gp/product/4621045377?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& According to Isaac Asimov's Chronology of Science and Discovery</a>, Fleming discovered penicillin in 1928 using his famous method, the active ingredient was isolated by Flory and Chane in 1939 after 11 years of neglect (the three were awarded the Nobel Prize in Physiology or Medicine in 1945). In 1940, Waxman discovered actinomycin and streptomycin using the same method, and many antibiotics were discovered in the following year. He discovered many more antibiotics, and gave them the name "antibiotics" as well.
 
 *1271616060*Intelligent workers own the means of production.
 <a href="http://www.amazon.co.jp/gp/product/4478300720?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=4478300720">The Condition of the Technologist (First Time Reading Drucker (Technology))</a> Chapter 5, p.85
 
 >>
 The intellectual worker owns the means of production. The knowledge stored in their heads is portable. It is precisely because they own the means of production that they are highly mobile.
 <<
 
 I thought this one word was amazing. In other words, the model of "workers do not have the means of production, so they sell their labor to a company (capitalist) that has the means of production and get paid for it" does not hold true for intellectual workers.
 
 Split misunderstanding you wrote in <a href='http://d.hatena.ne.jp/fromdusktildawn/20060227/1141028008'>How an uneducated, unemployed, and powerless NEET can become a full-time employee earning 5 million yen a year</a>.
 >>
 Because knowledge is personal, "individuals can legally misappropriate the firm's knowledge assets."
 <<
 So (good or bad expression aside), this is exactly what you are referring to.
 
 
 Now, the question is how to evaluate the value of that asset. This problem has been apparent in the hiring of programmers for quite some time now, and various methods have been proposed, such as having them write Fizzbuzz (it is surprising that people who can't even write Fizzbuzz apply for a job as a programmer) and breadth-first search problems. However, what is much more reliable than those tests, and a strong differentiating factor because there are not many people who do it, is the release of the source code of the home-made application.
 
 <a href="http://www.amazon.co.jp/gp/product/4334934064?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& As discussed in the <a href="creativeASIN=4334934064">dramatic one paper</a>, you have to output your own value. You have to actually output what you are capable of outputting. Whether it is by publishing source code, writing a blog, speaking at a conference, or writing an article for a magazine, it depends on each person, but at any rate, you must output something.
 </body>

[Hatena Diary 2010-04-18 https://nishiohirokazu.hatenadiary.org/archive/2010/04/18]