Hatena2015-03-08
code:hatena
 <body>
 *1425745173* The official page for the unorganized is now available.
 The official page of <a href='http://www.mitou.org/'>General Incorporated Association Unexplored</a> is now available: http://www.mitou.org/
 
 As a first-year MUTOH Youth alumnus, I intend to support MUTOH Incorporated Association immensely. It is a community with the highest concentration of "eccentrics and oddballs in the best sense of the word" that I have observed.
 
 ** Postscript
 At first, I wrote "The Incorporated Association Unexplored is now ready", but I thought it was more accurate to say "the official page is ready", so I have revised the title. Last year, a leaked article appeared while the official page was still incomplete, so many people were confused when they searched for it and found an unrelated page. Although the contents are still small, we can now safely introduce "This is the official page of the Unexplored Association".
 
 Also, it seems that the unexplored alumni/alumnae who can be contacted were contacted prior to this article, but unfortunately, many of them could not be contacted because they did not inform the IPA of their email address change or for some other reason. I hope this article will help get the word out to as many people as possible.
 
 Oh, and look forward to the Nico Nico Live broadcast on March 10 (unexplored day).
 
 *1425808274*March 10, there will be a Nico Live broadcast of the "Unexplored Conference".
 <a href='http://live.nicovideo.jp/watch/lv212898149?ref=top&zroute=index'>'Unexplored Conference' - The Future of 'Unexplored' Created by Innovative Talent - 2015/03/10 15:00Start -. Niconico Live</a> will be broadcast on Tuesday from 15:00 to 18:10. It is a weekday afternoon, so you may not be able to watch it live, but I think you can reserve a time-shifted preview.
 
 I'll reprint the timetable for those who want to know what it's all about.
 >||
 15:00-15:10 Opening
 
 15:10-15:50 Dialogue: Business Environment for Developing Creative Talent
 　　　　　　~The destructive power of unexplored human resources!
 
 　Tomoko Namba Founder and Director, D.N.K.
 　Ryo Morikawa President and CEO, LINE
 　Tsuyoshi Natsuno, Unexplored PM/Graduate School of Keio University
 　　　　 Specially Invited Professor, Graduate School of Media and Governance (Moderator)
 
 
 15:50-16:30 Unexplored Creators Talk (Presentation)
 　(1) loT is moving from "objects" to "places
 　　　Yoichi Ochiai
 　　　Senior Researcher/Founder, Gisecai Corporation
 
 　(2) V-Sido software for mouth pot control
 　　　Wataru Yoshizaki
 　　　Aslatech Corporation Chi-Flo Pot Cricuter
 
 　(3) Live2D: Aiming for a world standard from Japan~.
 　　　Tetsuya Nakashiro
 　　　Representative Director, Live2D, Inc.
 
 　(4) Growth strategies for open source projects or how to start a start-up company
 　　　Sadayuki Furuhashi
 　　　Treasure Data，lnc
 　　　Founder and Software Architect
 
 
 16:30-16:40 Break
 
 16:40-17:20 Dialogue: Creative Human Resources to Pioneer the loT Era
 　　　　　　~Heresy power to create the future!
 
 　Ken Sakamura, Professor, Interfaculty Initiative in Information Studies, The University of Tokyo
 　Jun Murai, Dean, Faculty of Environment and Information Studies, Keio University and Professor, Faculty of Environment and Information Studies, Keio University
 　Ikuo Takeuchi, Unexplored PM/Professor Emeritus, The University of Tokyo (moderator)
 
 
 17:20-18:00 Unexplored Creators Talk (Presentation)
 　(5) Interface of objects
 　　　Makoto Ohno
 　　　Master of Science in Computer Science, Graduate School of Systems and Information Engineering, University of Tsukuba
 
 　(6) Programming from work to culture
 　　　Ryo Suzuki
 　　　Master of Science in Expression Engineering, Graduate School of Core Ethics and Frontier Sciences, Faculty of Science and Engineering, Waseda University
 
 　(7) Design Everything by Yourself
 　　　Takeo Igarashi
 　　　Professor, Department of Contributor Science, Graduate School of Information Science and Technology, The University of Tokyo
 
 　(8) Development of a new user interface that senses sound with hair
 　　　Tatsuya Honda
 　　　Department of Systems Information Science, Graduate School of Systems Information Science, Future University Hakodate
 　　　Master of Media Design
 
 
 18:00-18:10 Kukusing
 ||<
 </body>

[Hatena Diary 2015-03-08 https://nishiohirokazu.hatenadiary.org/archive/2015/03/08]