Hatena2014-11-13
code:hatena
 <body>
 *1415887700* Lecture material on "Designing Learning Methods" given at Nagoya University is now available.
 Lecture materials for "Designing Learning Methods: Nagoya University Edition," a lecture given to information science students at Nagoya University, are now available.
 
 Here are the slides as they were used for the lecture.
 <iframe src="//www.slideshare.net/slideshow/embed_code/41509601" width="476" height="400" frameborder="0" marginwidth="0" marginheight="0" scrolling="no"></iframe>
 
 This is a written version of the information that was exchanged in the audio. I think this one is easier to read and understand the flow of the conversation, but there are a lot of fine print.
 <iframe src="//www.slideshare.net/slideshow/embed_code/41509693" width="476" height="400" frameborder="0" marginwidth="0" marginheight="0" scrolling="no"></iframe>
 
 The questions on the survey form written by the participants will be answered in a blur later.
 
 ** Q: Will computers ever be able to beat augmented humans?
 
 A system consisting of multiple components tends to have overhead at the joints. A "human + computer" system also has a large overhead at the joints, so it would be more efficient to use computers alone for tasks where humans do not perform very useful functions. For example, packet routing.
 
 ** Q: Are "less knowledgeable people" really less knowledgeable? What else could it be besides age differences?
 
 Hmmm, how to introduce a scale to measure the amount of knowledge is a difficult question.
 
 One simple measure is "time spent," in which case the total amount of knowledge is the same for the same age. However, this definition raises the question, "If person A could read the same book in one hour, but person B struggled through the book and it took him 10 hours, did he gain more knowledge from the book than person B?" Is Mr. B more knowledgeable than Mr. A? It is not so clear.
 
 Considering "the amount of input sources" as the second measure, it can be said that "A" and "B" who read the same book have the same amount of knowledge. However, this also raises the question, "Is the knowledge gained by Mr. A, who just skimmed through the book in an hour, the same as that of Mr. B, who read the parts he didn't understand over and over again? If Mr. A reads 10 books in one hour each, does he have 10 times more knowledge than Mr. B? I don't think so.
 
 The third measure is "the value is determined by the market need for the output. For example, suppose that the book they read is a book on an unknown programming language, and they are going to write a program in that language. If Mr. A can write a program with less than 0.1 times the efficiency of Mr. B, then "Mr. B took 10 times longer to learn than Mr. A, but gained 10 times more knowledge than Mr. A by doing so.
 
 In talking about this "it's not a one-way street from those with more knowledge to those with less," I did not consider it in detail because there is no real harm in adopting any of the scales.
 
 **Q: Isn't it important, but difficult, to make sure that Seeds and Needs match before going ahead?
 
 If you're thinking, "Let's make sure our Seeds and Needs match 'perfectly' before we go ahead and do it," it's going to be a hurdle and a difficult first step.
 
 ** Q: Who should be evaluated more: the person who writes a lot of things with a lot of content and a lot of volume, or the person who writes a lot of content that is not at all similar to others?
 
 The first important point is that "you can only know after the fact, after you have written it, whether or not it will be similar to others. The idea that "many people will think ~" is itself an untested hypothesis, and what the individual thought was a common idea may actually be something that surprisingly not everyone noticed. Therefore, the way an individual should feel when writing out a proposal is to write more and more without worrying about whether or not it will be similar to others.
 
 Rather, what about from the management's point of view, for example, who should be praised when they come up with ideas in the lab?
 I felt that this question statement assumes that "those who wrote a large amount of content that is not shared by others" are the best, but if all of those large amount of ideas are not feasible, then a pile of garbage has just been produced. Therefore, a good idea is not one that is developed at the idea generation stage, but one that is scrutinized carefully, implemented, and ultimately leads to a real benefit. This, of course, also cannot be determined at the ideation stage.
 
 ** Q: I don't have much time to organize what I feel in my daily life, so I really like and appreciate listening to these organized lectures and encountering new insights with understanding and conviction.
 
 Thank you very much. But I think that time will be increasingly fragmented in the future. What will you do?
 
 ** Q: I would love to know if there are any cases where the presentation failed when applied to reality.
 
 In this Q&A session, we made some mistakes and corrections to the Do of the lecture content.
 
 Not quite, but more abstract? The methodology I talked about in my lecture is the result of repeated abstraction from my own experience and information from various books, so it has been successful, at least in my experience, so in order to verify it by failing, I first need to "teach this methodology to others, observe them using it, and find examples where they are not producing the expected results. In order to verify the results by failure, we first need to "teach this methodology to others, observe them using it, and find examples where the results are not as expected. For example, in the workshop, there was a failure that "people were unexpectedly having difficulty in writing out the results," so we tried "giving them a top-down framework to make it easier to write out the results," and as a result, there was a failure that "people categorized the written results back into that framework," so we tried to emphasize the bottom-up approach more, and so on. We have been repeating trial and error in this way.
 
 ** Q: What about "software-enhanced" mice, etc.?
 
 Sorry for the explanation. So, among the "artifacts" of the human enhancement element, we have "software" and "mouse" as specific examples.
 
 ** Q: "Augmenting Human Intellect", is AR a recent and obvious example?
 
 That's right. Engelbart thought that if we create artifacts to augment human intelligence, we need to train ourselves to use them, but AR takes it one step further and reverses the idea of augmenting the apparent side of reality by using the way we normally perceive reality. I think that's what AR is all about.
 
 **Q: When I try to think of ideas I tend to think of artifacts, why?
 
 Is it possible that your bias is created by your past experiences? For example, when you are aware of research or papers, do you focus more on artifacts?
 
 For example, when asking person A in a different field how to solve a problem, he would say, "Let's think about the cause of the problem. A cause is something in the form of 'who did what'" or some such statement.
 
 For me, it was uncomfortable to define cause this way. For people, including myself, who have a bias that emphasizes the improvement of artifacts, "It is outrageous to attribute causes to humans. That does not lead to improvements in machines, software, or other systems. I think there is a belief that "the cause must be attributed to a defect in the system and must be used as a catalyst for system improvement.
 
 So I listened carefully to Mr. A without emotionally repelling him, and he said, "Once the cause of the problem has been clarified, the next step is to take action to improve it. In order to take action, it is necessary to clarify 'who' should take that action. Mr. A is focusing on the "organization," which is a system composed of human beings. Even if a system such as a machine or software needs to be improved, there must be someone who should be in charge of it, so the idea is that it can be handled uniformly within this framework.
 
 Personally, I understand the idea, but the discomfort is not completely gone. I feel that there may be some hole that Mr. A is overlooking, but I have not found it yet.
 
 ** Q: In situations where there are no textbooks, would software that compiles large amounts of information be useful?
 
 Where will the information to be put into that software be sourced from?
 
 As one concrete example, it would be useful to have software that automatically surveys papers in areas where there are no textbooks yet and produces a kind of map of knowledge.
 
 ** Q: Talk about cutting out the figure: crowdsourcing is also software. There are still many situations where software dominates.
 
 That's one interpretation. My interpretation is that crowdsourcing is not "software alone" but "software + human. Whether you see this as "software as the main component, with humans assisting" or "humans as the main component, augmented by software" is just a difference in perspective.
 
 ** Q: I may not know what I'm talking about when I write it down. Are there any tips on how to write it down?
 
 That is a good perspective. I think I have a knack for it, but I have not yet been able to verbalize it well. I think it is important to at least "write in a readable handwriting".
 
 However, if you add too many rules, the cost of verifying that you are following the rules goes up, and the psychological hurdle of writing out the rules goes up. It's a trade-off.
 
 ** Q: Getting more perspectives: is relying on computers one of them?
 
 Yes, I am. We were talking about the benefit of having something other than yourself that compensates for the perspective you lack.
 Aside from how exactly to achieve this, I think that computers and other artifacts could take on this role.
 For example, it would be beneficial to have a chatbot that can conduct discussions in natural language without worrying about time or the availability of the other party.
 If it uses a well-defined artificial language rather than natural language, Coq or Agda, for example, might be close.
 
 ** Q: PDCA cycle: is P always first?
 
 Adjust uses the results of Check, Check uses the results of Do, and Do implements the plan made in Plan. Therefore, Plan is first.
 Some people describe it as "Start with Do" because it reduces the time required for planning by using the principle of "don't try to make the plan highly complete from the beginning. Some people describe it as "Start with Do." "Run first, then think as you run," and so on.
 
 ** Q: Should we start with the easiest part to change because they won't change?
 
 It is easier to change yourself than the other party. I talked about this in my lecture.
 
 To explain what I failed to talk about, let's first consider the conflict between Mr. A and Mr. B, who is not himself. If Mr. A did not change himself, thinking that "it is Mr. B's fault for not changing," and as a result, the problem remained unresolved, then both "Mr. A did not change" and "Mr. B did not change" were factors that prevented the problem from being resolved. In this situation, Mr. A would think, "It is not my fault; it is Mr. B's fault. As is clear from the symmetry of the structure, Mr. B is also probably thinking, "It's not my fault, it's Mr. A's fault. If this equilibrium situation is reality, what can be done to change it for the better?
 
 Try to separate yourself from yourself in this way, and then think about what you would do if you were Mr. A.
 
 ** Q: Software augments human ability: human ability to read a paper in an e-book?
 
 For example, as a concrete example, let's consider the phenomenon that "Mr. A found out about an interesting article, searched for it on Google Scholar, and read the PDF as a down-low.
 
 Compared to the case where Mr. A does the same thing without B, i.e., "requests a copy from the library, waits a while, and reads the paper copy sent to him," the time spent by Mr. A has decreased, so the result per unit of time has increased. Since the outcome here is "knowledge of the content of the paper that has increased in Mr. A," B by itself cannot produce results. It is only an effect that occurs through the combination of A and B.
 
 In other words, this is a phenomenon in which A alone produces 1, B alone produces 0, and A+B produces 10, and so on. My interpretation of this is that "A's ability is enhanced by B.
 
 ** Q: Wikipedia, why is the Japanese version weaker than the English version?
 
 I think it is simply the difference in the number of people editing. It's an example of "quantity turning into quality."
 
 ** Q: Four elements of human augmentation: why do humans want to create artifacts? Is it because language and methodology are different in nature and background from Objects? If so, do we need to rethink from elementary school education?
 
 The "nature and background of each of the four elements of human enhancement" perspective was a blind spot. Software has been put into artifacts and explained until now, but unlike other physical artifacts, it does not have the property of being "difficult to replicate. The word "methodology" has led me to assume that it is executed by humans, but if we expand the subject of execution to computers and other artifacts, software may be more of a "methodology. This is an interesting perspective. I will give it some thought.
 
 
 ** Q: To teach someone something is to teach them what you think is right. At that point, am I already in a blind spot because I think I am right?
 
 Yes, I know. So you teach what you think is right and then realize after the fact that you have a blind spot when you realize it was not right.
 
 The blind spot becomes apparent after the fact as a result of the Do, not before.
 
 ** Q: If I create a PowerPoint document, I prefer to put it in writing. That way I can notice the holes in the content. Then do I need to make a draft every time?
 
 Make decisions based on whether it is beneficial to do so, not on whether it is necessary or not, or whether it should be done.
 
 As an extreme example, if you have plenty of time and don't have to think about the cost of your time, it is probably in your best interest to do it. At the other extreme, if you have only one hour left to present and your presentation material is not yet completed, it is not the time to prepare a manuscript. In this case, it is important to complete the presentation material and present it, even if there are some holes in it.
 
 So many real-life cases are somewhere between these two extremes.
 
 ** Q: Mind mapping is a top-down classification method, but it is very easy to use. Isn't it necessary to have a top-down approach from time to time?
 
 First, let's consider cutting out the "colorfulness," "pictures," and "letters crawling on branches" elements of mind maps, as they are irrelevant to the top-down or bottom-up discussion.
 Then I would think that making a bulleted list in a text editor, for example, would be equivalent to the top-down method.
 
 The first phase was "Let's write it out first," but it seems that it is easier to write if you have something to start with rather than just writing it out without anything.
 In my workshop, I gave the participants a top-down framework of "the gap between the ideal and the reality" and had them write about the ideal first, then the reality, and then the solution to the gap. Compared to last year's workshop, where we did not do this exercise, the amount of sticky notes written increased. I think that writing in a top-down tree-like form is an act of writing out while creating a top-down framework for oneself, which may have the effect of increasing the efficiency of writing out.
 
 On the other hand, I am concerned that the frame I have created may make it difficult to come up with ideas that break the frame, or that branches that do not fit well into the existing frame may be pushed into a corner and ignored. After using a mind map for writing out the ideas, you may be able to alleviate this problem by looking around the entire document, finding and marking information that is divided into multiple trunks but is related to each other, and then writing a new mind map that restructures the information so that they all come together in the same trunk.
 
 Incidentally, when I wrote "The Art of Supporting Coding," I wrote several mind maps for each chapter, but I have not used them very actively since then. I don't know if this is due to the characteristics of mind mapping (a human enhancement methodology) or my proficiency in mind mapping (i.e., education to master the methodology), as I don't have enough material to judge.
 
 ** Q: Raising the bar on technology -> how does this work with ethics and law?
 
 Changing the law, if useful, is an option.
 
 If the law hasn't changed yet, then there will be negative utility from not following the law.
 
 ** Q: (Regarding the graph comparing computer and human capabilities) Do people change?
 
 People can change, too. For example, technological advances have made it possible for people in developed countries to no longer worry about starvation, and as a result, brain resources that used to be used for securing food can now be used for other purposes. In Japan, for example, most people can read due to compulsory education. This is also due to the affluence of Japan, where a family does not starve to death even if the children are studying instead of working. Leaving aside ethical objections, it would be logically possible to create human beings with improved cognitive abilities through genetic engineering.
 
 ** Can't we learn what we can't concretize or experience? Can't we take a bottom-up approach? Is there any commercial value in such a thing in the first place?
 
 I don't have a concrete image of what "unexperienced without concreteness" means, but if you can't even "concretely implement" it, then it probably has no commercial value.
 
 ** Q: Is hand output on paper some sort of human enhancement?
 
 Yes, it is. It is one of the most powerful means of human enhancement that combines the "artifact" of pen and paper, the "language" of the alphabet, the "methodology" of expressing ideas by arranging the letters of the alphabet, and the "education" of how to use them. We spent years learning to read and write in compulsory education.
 
 ** Q: Isn't it easy to feel that one's own opinion (preconceived notion) is the most correct, even if several people with different ideas about reality observe it?
 
 Yes, it is easy to feel. So it is beneficial to be aware of such tendencies first, and not be so quick to dismiss ideas that differ from your own.
 
 ** Q: "It's not a one-way street of people with more knowledge -> people with less knowledge, but a mutually unknown knowledge" Doesn't this have to be a bias in knowledge to make it work? Wouldn't the person with more be wrapped up in the person with less?
 
 It is a logical case of the lesser being wrapped up in the greater number of people. How about practically?
 
 For example, if knowledge were limited only to the research field of the laboratory, the professor's knowledge would be overwhelmingly large and would completely encompass the knowledge of student A, who has just been assigned to the laboratory. However, if Mr. A starts to read papers in a particular field in depth and carefully, he will at least be more knowledgeable than the professor on the subject. Also, if Mr. A implements and conducts experiments, his knowledge of the details of the implementation and the results of the experiments will lightly surpass that of the professor. Then you will tell the professor in the seminar, "There is a paper on this, and it says this," or "I did an experiment on this, and it produced these results. This is the point where seminars are most different from classes.
 
 Even if you limit your knowledge to your field of study, this bias can easily occur. Without limitation, bias would occur even more easily. So in reality, cases of complete inclusion are rare.
 
 ** Q: "Lowering the hurdles and prioritizing quantity over quality first" is the process of creating 1 from 0, while PDCA is the process of making it bigger. it's hard to create 100 from 0, so first produce 1 and then make it bigger?
 
 Very good organization. I agree.
 
 ** Q: "Noticing blind spots" corresponds to "Knowledge of ignorance" in my mind, and "writing out sticky notes" corresponds to "writing out a lot of TODO lists", but "outputting as writing" had no corresponding one.
 
 I see, I'm glad I could help.
 
 Regarding one point, "writing out sticky notes" corresponds to "writing out a lot of TODO lists". GTD is well-known as a method of "writing out many TODOs," so I have taken it for granted that this is what you are referring to. However, GTD does not say, "Write down your TODOs. It is supposed to say, "Write down what is bothering you. Put all the things that are on your mind in your inbox, and then take your time to ask yourself, "What is this? "Is this actionable?" "Is this something that needs to be done within a week?" and then sort them into a top-down framework. So some of the first things that go into the inbox get sorted into the TODO list.
 
 So when compared to the content of this lecture, the writing part is almost the same. The big difference then is that GTD "looks at things one at a time from the top and categorizes them according to the existing framework". The reasons for this are also clearly stated in GTD: by processing one at a time, you don't have to worry about priorities, you don't have things that you don't check off because you prioritize other things, and it is easier to resume the process if it should be interrupted, especially the first time because it takes time.
 
 In particular, when we review the "I'll do it someday" list from time to time, we find that we have written the same or related things over and over again, and when we put those several descriptions together into a single group, it feels almost like creating a bottom-up group.
 
 ** Q: Multiple perspectives: to get opinions, don't we need to communicate "what we think, what's going on"? ⇔ Could the scope of the conversation become narrower as you communicate, resulting in a localized, knowledge gap...?
 
 I see. In the workshop at the Kyoto University Summer Design School, in the "Let's think after writing" phase, participants were asked to "write out their own learning style" and output their ideas before we had a chance to tell them everything we thought. This time, the approach was to share our ideas and then ask for their opinions.
 
 I guess one methodology is to "partially communicate your thoughts". For example, even if in your mind you are in a state of "I have a problem called A, which I think can be solved by using method B, what do you think?", you could first ask, "I have a problem called A, how can I solve it?" Or, "I have a problem A, and I wonder if there is a problem A." If the problem is "A," what can we do to solve it?
 
 ** Q: Is it important to leave "my thoughts" so I can track them?
 
 When I say "tracking," I think it gives the nuance that chronological order is important. That could be useful, but the intent of this lecture was "it is useful to write down information that is only in the brain and not disappear.
 
 ** Q: I can't seem to do anything but plan, and it's hard to subdivide the plan into smaller pieces.
 
 I see, it would be beneficial to be able to verbalize that methodology as well. I can't think of anything right now. I will think about it.
 
 ** Q: Wouldn't it be better to choose between top-down and bottom-up depending on the situation?
 
 That's right. It depends on the objective. The objective is "to find new and unexpected connections," and "to assemble the written stickies from the bottom up" is just a method. If your existing knowledge is reliable enough, it would be more efficient to work in a top-down manner by quickly categorizing the stickies instead of spending time on bottom-up assembly.
 
 ** Q: Shouldn't we discuss this as we write it down? Discussion increases "volume".
 
 That's exactly right. For example, many people mistakenly think that "brainstorming" is a verbal waiver, but Osborn, the creator of the term, wrote in his book, "Write down every idea that is put forth.
 
 ** Q: Can the output of a text be an output as an application?
 
 It is necessary to clarify the purpose of writing output. For example, if the purpose is to "convey your ideas to others, convince them, and have them help you with your work," you have "succeeded" if you have convinced them and had them help you. If, in doing so, for example, you read an explanation of "how to create easy-to-understand sentences" and used that knowledge, it means that you "actually applied the knowledge you gained from the explanation".
 
 If you tell someone else what you think and they don't agree with you, that's an opportunity to Check and Adjust.
 
 ** Q: I think it is important to abstract for the sake of understanding. However, too much abstraction may also cause us to lose sight of the essence, so we should strike a balance between the two.
 
 I think the line between good abstraction and bad abstraction is "whether or not the connection is maintained with the actual experience". If the connection is maintained, we can descend through it to concrete application. If it is severed, it becomes an empty theory on the table that cannot be put to practical use.
 
 ** Q: I was surprised to hear that "knowledge is not something to be gained, but something to be created by individuals." I thought he meant that knowledge is something to be gained, wisdom is something to be created by individuals, and the way we use knowledge is wisdom.
 
 I understand that you have such an abstracted model for knowledge. I don't know what concrete application that model can be used to explain, for example.
 
 ** Q: You mentioned that by reading textbooks and such, one can find blind spots, but if what one reads is wrong, doesn't that create false preconceptions? Or even if what you read is correct, but you are mistaken, I think you will also develop false preconceptions. How can we correct false preconceptions and stereotypes?
 
 Suppose you read the wrong textbook, or the wrong textbook, and you have the wrong understanding.
 
 The first method is to "act on understanding" and verify the results.
 
 The second method is to listen to "another textbook" or "another person's class" and observe if there is any mismatch between that "reality" and your "understanding.
 
 ** Q: I think that putting information in a diagram and in writing is a good way to summarize data and find new things, but it takes a lot of work, and time, and I think something needs to be done for that.
 
 Yes, I am. It really does take time. If this is a useful methodology and the time cost is high, then there is commercial value in software, methodologies, etc. to reduce the time cost.
 </body>

[Hatena Diary 2014-11-13 https://nishiohirokazu.hatenadiary.org/archive/2014/11/13]