Hatena2011-05-10
code:hatena
 <body>
 *1304954806*Housework, the existence of a "perception gap," and backward chaining.
 >>
 nyagai: The one who can't endure loses. RT @nontapapa: On the other hand, boys may win if they do it.... RT @nontapapa: On the other hand, boys can win if they do it... RT @sauza3: To the unmarried girls. Listen up. Housework is a "do-it-yourself" job.
 <<
 regarding
 >>
 nishio: While women endure the unpleasantness of messy conditions with frustration, thinking that "the one who does the housework loses," men find messy conditions comfortable rather than unpleasant. Of course, some men are cleaners, but men who make a mess basically have a high tolerance for unhygienic conditions.
 <<
 I Tweeted, and I would like to take this opportunity to explain.
 
 Of course some men like to be clean. I only know mine. Men like me, who sometimes show great concentration on things that interest me, but are usually out of it, and have a messy room, should expect a considerable difference in cognitive ability compared to the average woman in the world. These types of men are surprisingly insensitive when it comes to things other than what they are interested in or what they are paying attention to.
 
 What I mean is that while you are frustrated three times a day, or 100 times in a month, saying, "I'm losing if I do my chores," "I'm making a mess again," or "Why don't I clean up?" the male side is saying, "Gasp," "Gasp, why are things falling here? Let's move it to that corner over there. I'm just thinking "Yeah, tidy up happy~". If you keep quiet and get frustrated, you are just spinning your wheels, and the men's side doesn't even realize that the chores exist in the first place. You have to communicate with words to get through to them.
 
 Of course, there are people in the world who are uncooperative in housework. Whether or not a man is cooperative in housework can be judged by whether or not he will do it when you verbally ask him to do it when his mind is not occupied with other thoughts. It may be tempting to expect a man to do chores spontaneously without being told, but that requires more time and education. If it were that easy to learn housework, I would have lived alone a little better.
 
 Even with regard to the results of asking someone to do a chore, more often than not, what was not communicated in words was not communicated. If you say, "Take in the laundry," they may take in the laundry, or they may hang it in the closet instead of leaving it on the bed. But they don't think twice about folding towels and taking them to the changing room. If you get angry at them for that, you will just hate doing the chores. Regardless of the outcome, the more they are exposed to the experience of "doing chores and then getting angry," the more they will come to dislike chores and unconsciously avoid them. This will lower their cognitive ability to do housework, which is already low.
 
 Since the other party is like a toddler who has not mastered all of the household tasks, the same method needs to be used for education. If you want to teach a child how to put on his or her kindergarten clothes, you can't just hand them the clothes out of the blue and say, "Why aren't you wearing those clothes yet? You can't teach them how to wear preschool clothes by handing them the clothes and saying, "Why aren't you wearing them yet? First, let them put on the clothes and button them up, then praise them. Next, let them put on the sleeves and fasten the buttons, then praise them. It is better to teach by extending forward from the completed form. This is called backward chaining. Here is a link to an example of using this method to train new employees. <a href='http://nedwlt.exblog.jp/12267623/'>NED-WLT : Backward Chaining</a>. The detailed story should be in the book below.
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4861080150" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 Additional Tweet
 >>
 For those who don't understand the cognitive gap, let's look at it from the opposite perspective: "Why are you passing values here? Such accusations will not improve the code.
 <<
 Both the housework example and the programming example are phenomena in which there is a difference in perception between oneself and others, and as a result, others do not take "actions that one considers desirable. Blaming the person who is not aware that there is a problem for not solving the problem will not improve anything. The only way to improve the situation is to break it down into a chain of tasks, "recognize the problem → solve the problem," and let the person experience the problem from the point of solving it first.
 </body>

[Hatena Diary 2011-05-10 https://nishiohirokazu.hatenadiary.org/archive/2011/05/10]