Hatena2010-01-19
code:hatena
 <body>
 *1263890204* Brain in top form mini
 It seems to be a dangerous product, with a similar design, identical name, and a completely different game being sold.
 
 f:id:nishiohirokazu:20100119173116j:image
 
 The size of the outer box is the same as that of the Bloks Duo.
 
 f:id:nishiohirokazu:20100119173545j:image
 
 Collect points by lining up. The number of pieces of the same color lined up in five directions from the frame you placed is the number of points. The player with the highest score for the lowest color wins.
 
 
 By the way, here is the "totally different game" http://bgf.shop-pro.jp/?pid=17744790
 
 <hr>
 
 I played alone.
 
 f:id:nishiohirokazu:20100119235555j:image
 
 My turn. Hmmm. If the back player (hereafter referred to as "the back player") scores even one point for green, the front player loses because the back player has 6,6,6 for the front player and 6,6,7 for the back player. However, there is no way to prevent green from scoring. Both players have 6 points in yellow, but neither can make a move because there is already no foundation to extend it, and with the number of moves remaining, the opponent will score yellow if he plays a card that contains yellow carelessly. If we extend the orange...no, we can't. If two points are scored in green, it is 6,7,7 against 6,6,7, so even if the orange is extended a little, it is no good. Do I have to keep the green here?
 
 I guess this is a game where I should have played more effective moves from the beginning to avoid such a last minute scramble at the end of the game. Since it was the first time for both of us, we didn't really understand. I also thought that there was no time to generate "I'm a genius" (the score is now full, so I can place it again).
 
 *1263894219*Tokyo Dome City
 I would like to have a 10cm miniature of this guy in my house!
 
 f:id:nishiohirokazu:20100119184328j:image
 
 f:id:nishiohirokazu:20100119184358j:image
 
 *1263910811*[Kaizen] Grocery Consumption
 At any rate, I realized that "I'm not keeping track of how many ingredients I have left, so I'm going to have a surplus," so I threw out all the rotten food and then bought turnips. The goal is to make only turnip soup and consume 5 turnips without them spoiling.
 
 Yesterday I cut turnips into 8 pieces, boiled them from water, added chicken stock, stems and leaves. It was delicious.
 
 Today, I cut two turnips into four pieces and boiled them in water, and when I looked at the bottle of chicken broth, it said "2 teaspoons in 300 grams of water," so I added about five times more powder than I did yesterday. It turned out to be quite tasty. The turnips are cooked well enough even if you cut them into four pieces.
 
 And that's not the point of today's kaizen story. At first, I was going to cook rice for the first time in a while, but I got very hungry and thought, "I can't wait for the rice to cook, what should I do? Then I looked down and saw that my parents had sent me some microwaveable sekihan (red rice). They must know that I don't like sekihan, so why did they send it to me? Because I rearranged and put these dingy things in a prominent place. It says it only takes 2 minutes. If you're hungry, red rice was delicious.
 
 Condiments are similar to stationery, but groceries are not stationery. Pasta and rice are used frequently, but they do not need to be in a prominent location near the kitchen. Since they are used only a few times a day, they can be located a few steps away from the kitchen. On the other hand, items that are not necessary must be placed in a conspicuous location. We forget that they exist.
 
 Today I consumed a bad batch of red rice and yesterday I consumed a bad batch of retort pasta sauce. It's good. After I get used to it, for example, after I have established the flow of always having some retort pasta sauces in stock and using them, it will be OK to make a "retort pasta sauce container" in an inconspicuous position. Right now, anyway, it is about consuming the stock. The past when I had this stuff in my room and ate pasta with salt or sprinkles without realizing it.
 </body>

[Hatena Diary 2010-01-19 https://nishiohirokazu.hatenadiary.org/archive/2010/01/19]