Hatena2011-01-25
code:hatena
 <body>
 **1295921130*[Kaizen] Diary of discarding on the occasion of moving.
 When I told people that my room was untidy, they told me to "throw it away, throw it away," but I had trouble thinking of what to throw away, so it would be easier to just climb up on the roof of a building and throw myself away, etc. I was once mistaken for suicidal.
 
 Even those who say, "Throw it away," don't throw themselves away or renounce all their possessions and become ordained, which means that they are not throwing anything away, but can implicitly judge what to throw away and what not to throw away.
 
 On the other hand, people who seem to be accumulating things they don't need (including me) have not developed the ability to judge what to throw away and what not to throw away. They put off the decision of whether or not to discard something and choose to keep it for the time being. It is impossible to say to such people, "First, let's throw away what we don't need. They can't decide what they don't need.
 
 In the past year, I have grown from such a "person who can't throw anything away" to being able to "clean out the five-story cardboard tower that had been piled up in the middle of my room for six months after moving so I could pull out the hot carpet," "throw away about 200 kilograms of books," "throw away six bags of used clothes," and so on. I have grown up to be able to make such decisions! So I'll summarize what my current self would like to say to my old self. By the way, I can't tell you much about myself because I am still a useless person who can't even cook rice and eat it with furikake (sprinkles) on it.
 
 ** "I can't throw this away because I'm going to use it."
 
 Do you keep duct tape? If you don't, please read something else. Now, when someone says, "I need that duct tape, so let's get it out now," can you get it out right away? If you can't get it out, it's as good as nothing.
 
 I wrote "string + tape" on a transparent shoe case I bought at Daiso and put it together as soon as I found it there. There were 2 balls of vinyl string, 2 balls of hemp string, 3 rolls of gummed tape and 1 roll of curing tape.
 
 Tools, writing utensils, etc., were gradually "put in place" and collected there as soon as they were found. My life improved when I could find what I was looking for quickly. Until now, he had always put his keys in a certain lock box because he had trouble finding them when he left the house. It is not only keys. It is necessary to decide where all the "things to be used" should be so that they can be taken out immediately when they are used.
 
 ** 靴下
 I made a box for socks, which is a kind of "make a certain box. As I cleaned up the room, socks came out from here and there, so I washed them and put them in the box and ended up with about 20 pairs. I ended up with about 20 pairs of socks. The reason why I had to buy more socks as soon as I ran out is because they have no place in the house!
 
 As a result, the sock box is no longer able to hold all the socks. Do I need 20 pairs of socks? Let's throw out the old ones first.
 
 ** 書籍
 Books are hard to throw away. But recently I had an eye-opener. Bestsellers can be thrown away and then acquired again.
 
 The rest is just an extension of what we have been talking about. A book that cannot be retrieved immediately when it is needed is meaningless.
 
 ** 食品
 Throw away anything that has expired!
 
 When I was stressed out, I bought some half-baked snacks at a 100 yen store and left them there for a very long time, but under normal circumstances, the delicious Kit Kat would have turned white and plummy, and the rice crackers would be completely damp.
 
 If we are careful not to buy & receive things that we have no vision of using up, and if we throw away things that have expired, we will have less stuff!
 
 ** Quantity of objects
 In the first place, an ever-increasing amount of stuff is not a good state of affairs. If more things come in than are consumed or thrown away, there will be more and more things. If people with poor material management skills fall into such a situation, it will only get worse and worse.
 
 The only way to avoid a situation where books overflow from the bookshelves and pile up all over the place is to reduce the number of books by one book for every one more book. You can give them to others, throw them away, or sell them to used bookstores, but you have to let them go anyway. Drucker also says that to do something new, you have to get rid of the old things that are not creating value.
 
 
 To be continued later.
 
 *1295946214* Information that would be a waste if people moving in the metro area don't know about it.
 >>
 By registering your name and moving address in "Moving RakuRakucho", you can save yourself from having to enter the same information over and over again for procedures related to moving, such as electricity, water, and gas. Other major companies such as NHK, credit card, non-life insurance, etc. are also supported for address changes.
 <<
 <a href='http://www.tepore.com/rn/tepco_index.htm'>Tokyo Electric Power Moving Concierge</a>
 
 
 I completed the electricity and gas procedures in about 12 minutes. I didn't write down the customer number for the water service, so I'll do that later.
 </body>
 <comments>
 <comment>
 <username>myfinder</username>
 <body>I thought it would be a good idea to hire a scanning service or something to scan the books into digital data and throw away the main body. </body>
 <timestamp>1295922253</timestamp>
 </comment>
 </comments>

[Hatena Diary 2011-01-25 https://nishiohirokazu.hatenadiary.org/archive/2011/01/25]