Hatena2008-11-03
code:hatena
 <body>
 *1225658010* Affiliates
 If I use Amazon EC2 for a server to run Saichuji2 (with battle function & AI written in C++ or Haskell), it will cost me about $73 per month on an ongoing basis. I was wondering what to do about it, but then I was told, "Why don't you just put up ads and collect the money? That's right, if I create a service that earns more than $73/month, I don't have to think about the server cost.
 
 So I tried to create a Google AdSense account, but...it comes by check? That's a hassle. So I changed my target to a Japanese company. Also, I'm going to put it here because this blog has more page views than the game in the middle of the day.
 
 
 <a href='http://www.valuecommerce.ne.jp/'>Value Commerce</a>, It was my fault too for mistaking my e-mail address when I registered, but I'm having trouble registering with the same URL even though there should have been an error. It seems that the URL is not normalized, so I removed the trailing slash and it went through. But for some reason, it also asks me to enter the title of the site, so I'm getting conflicts there too. I wonder if it's a specification that sites with the same title can't be registered. I wonder how it works.
 
 
 <a href="http://www.j-a-net.jp/" target="_blank">JANet</a><img src="http://text.j-a-net.jp/1050611/1040/" width="1" height="1" border="0 The "JANet" is a service that handles money, but it has a ridiculous specification that the password must be alphanumeric and up to 10 characters. Well, the explanation may have been the most helpful. I was surprised that the input form has voice guidance, though.
 
 
 <a href="http://click.j-a-net.jp/1050611/240440/" target="_blank">Smart-C<img src="http://text.j-a-net.jp/1050611/240440/" height="1" width="1" border="0"></a>. Is this for a mobile site? I know this blog can be viewed from a cell phone, but I wonder if it's worth putting it here.
 
 
 And this kind of thing is supposed to be checked by a human to see if it's okay as an ad serving medium. I've gone so far as to create an account in a late-night fling, but for now, I guess I'll just have to wait, since no one inside is working at this late hour of the night. I have a feeling I'll be bored by the time it gets approved.
 
 
 Since I'm here, I'll post the link, though it's flying. <a href="http://click.j-a-net.jp/1050611/11675/" target="_blank">Finally, zero yen commission! FX Prime<img src="http://text.j-a-net.jp/1050611/11675/" height="1" width="1" border="0"></a>, <a href="http://click.j-a-net.jp/ 1050611/11676/" target="_blank">FX from 10,000 yen. FX Prime "Selectable Gaika" <img src="http://text.j-a-net.jp/1050611/11676/" height="1" width="1" border="0 "></a>. I don't know if this is the first time in Japan to offer zero yen commission. At any rate, they are offering 2000 yen cash back campaign until the end of December.
 
 *1225664339* noticed
 I was surprised to see so many affiliates offering a few yen per click, but when I think about it calmly, even if I posted one such link every day and 30 people clicked on it every day, it would still be 900 yen per month. Some of them pay 3 yen or so, but that's a minority. I'm starting to feel barren already.
 
 Oh, but I think it might be helpful in the future to see the number of times each link is displayed and clicked on, so I'll keep doing that for a while.
 
 *1225703557*Affiliate of the person OK type
 I want to experience it myself and then blog about it, but the dilemma is that I have to experience it after stepping on the link I wrote about it. w
 I'll just post the link for now and edit it later.
 
 <a href="http://click.j-a-net.jp/1050611/435/" target="_blank">あなたのインターネット回線速度はどれくらい？ここで簡単に測定出来ます。<img src="http://text.j-a-net.jp/1050611/435/" height="1" width="1" border="0"></a><a href="http://click.j-a-net.jp/1050611/33329/" target="_blank">速度測定して豪華賞品をGET!
 <img src="http://text.j-a-net.jp/1050611/33329/" height="1" width="1" border="0"></a>
 
 And then I stopped halfway through because it was too much trouble to get a Blu-ray disc player when I didn't have a TV in the first place (oh).
 
 **1225705283*Clione breeding
 I was quite surprised to read a description of an interior aquarium called <a href="http://click.j-a-net.jp/1050611/259085/" target="_blank">Curio<img src="http://text.j-a-net.jp/1050611/259085/" height ="1" width="1" border="0"></a>, which was quite surprising when I read the description of the interior aquarium.
 When I saw the phrases "keeping clione" and "interior aquarium," I thought it was a clione version of the common interior aquarium with fake jellyfish in it, but it was not at all.
 
 >>
 The water temperature is always fixed at 3°C when the indoor temperature is 28°C or lower by CPU control. The water supply and drainage integrated filtration system (our patented structure) generates convection currents that allow cliones to spend their time stress-free, reproducing the Sea of Okhotsk under the ice floes where cliones live.
 <<
 
 Because! They say you can seriously keep clione at home. The FAQ is quite interesting. The FAQs are quite interesting: clione larvae are bud-shaped, they don't have wings yet, so they move around with cilia, and clione are hermaphrodites. I wonder if we can also observe predation scenes.
 
 -----
 
 PS: I was afraid that the price might be unaffordable, like 200,000 yen, but when I looked at the price, I saw that the monthly rental fee is 6,000 yen for a year or longer rental. I thought the price would be out of my reach, but then I looked at the price and saw that the monthly rental fee for a year or longer is 6,000 yen. I'm not wrong by one digit.... Is it possible to do it that cheaply?
 
 *1225714463*Sleepy
 I woke up at 2pm and I'm already sleepy...
 
 The result of today's affiliate activity was 326 yen. I think I can raise the cost of AmazonEC2 for now. I'm going to release the prototype on Google App Engine as far as I can, test and develop the parts that can't be done on GAE on a VM at hand, and release it on EC2 when it's done.
 
 
 The biggest problem is that I can't write any code at all. I have to figure out how to live if I can't write code forever.
 </body>
 <comments>
 <comment>
 <username>ceekz</username>
 <body> So I tried to create a Google AdSense account, but...this comes by check? <br>We now accept bank transfers (in Japan), you know. </body>
 <timestamp>1225659621</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Oh, I see. I was too quick to guess. </body>
 <timestamp>1225662262</timestamp>
 </comment>
 <comment>
 <username>なまえ</username>
 <body>Many affiliates embed the affiliate's ID in the link, so it is safe to do so via RSS</body>.
 <timestamp>1225686556</timestamp>
 </comment>
 <comment>
 <username>isocchi</username>
 <body>If you use Adsense, you can embed ads in your feeds in conjunction with FeedBurner</body>.
 <timestamp>1225700066</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <BODY>Namae-san<BR>That is technically possible, but the contract says that you have to access the site from a registered site to be paid. I would be happy if they paid, but I can't complain even if they don't. <br><br><br>isocchi-tan<br>I don't really like ads that are mechanically embedded. </body>
 <timestamp>1225701208</timestamp>
 </comment>
 <comment>
 <username>Cherenkov</username>
 <body>You can keep them in a regular refrigerator. </body>
 <timestamp>1225712068</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <BODY>Unlike a refrigerator, the advantage is that it can be kept in a place where it can be seen at all times. If a clione dies during the rental period, it may be a good service to replenish it free of charge. </body><body
 <timestamp>1225939316</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-11-03 https://nishiohirokazu.hatenadiary.org/archive/2008/11/03]