Hatena2011-06-07
code:hatena
 <body>
 *1307450595* I started "After 30, I memorized 3000 words English vocabulary memorization system".
 When I was cleaning up my room this morning, I found an English vocabulary card I made in May 2009 in the pocket of my old bag. As expected, there were many words that I could not remember at all, and I realized that it is meaningless if I do not remember them until I have learned them.
 
 So I decided to practice <a href='http://d.hatena.ne.jp/higepon/20110218/1298031178'>After 30, I memorized 3000 words English vocabulary memorization system</a>! and bought a vocabulary book. But the bottleneck for me is my lack of continuity and the fact that I'm not sure I can remember to "review" until a week later. Anyway, I'll give it a try.
 
 ** 計測
 Measurement is necessary to improve the process.
 There were 79 word cards. Let's just test to see if I can remember these. This took 1 pomodoro. There were 29 cards that I knew the meaning of. I'll review these in a month. I didn't write the reverse side (did I look it up later and decide to write the meaning?) I added Japanese meanings to the ones I didn't understand because the explanation on the back side was written in English (e.g. "tends to" in English). I discarded the card with "prone" on the back and added "prone" and "prone to"; I mistook "increment" for "increment," so I added "increment"; and I added "increment" to two cards. One more pomodoro for the work so far.
 Three more sheets, 29 of which are now "review in a month," leaving me with 51 sheets, and that's all for today, because I don't want to spend too much time on the first day and not be able to continue.
 
 ** 目標
 I think you should set clear goals. For example, if you buy a book with vocabulary words and say, "I am going to get all the words in this book correct in one month's review," I think that is a good goal because it is easy to see how much you have accomplished and your efforts will easily lead to results. But, that would take me at least two months to achieve, and I'm not sure if my motivation will last that long. The goal I need to achieve is to keep going. I guess the first goal I should aim for is to "do it again tomorrow.
 
 For now, "I'll test tomorrow and measure the time. I'll put the ones I got right in my review pile in two days." I'll put the ones I got right in the review pile two days later. I'm going to review in 2 days, then 4 days, then 1 week. The time it took for this test was 23 minutes and 30 seconds for 79 pages, because there were various problems such as turning over the page and finding it blank, or turning over the page and finding it written in English and not understanding what it meant. I think the system should be able to turn the test around more quickly, and should lower the psychological hurdle of doing the test by reducing the time per sheet and controlling the input speed so that the "study pile" does not become too large. We need to measure and tune how much time we put into this system to see how fast we can learn the words.
 
 ** Motivation
 I'll be motivated by this "trying a new system" FUN for a few days, but that won't last a week, so I need a reward that I can generate within a week, I think I can learn this first bunch of words all the way through and empty them out within a week. That's the second goal. But this is not the minimum goal "I'll do it again tomorrow," so I may change it in favor of the minimum goal. That's fine.
 
 I don't have a specific source for input, but we shouldn't be in a hurry there. If I rush to input and the pile I'm studying grows too large, my motivation to continue will be undermined. I have a list of 13 words I got wrong when playing a free word game on my iPhone, and I have 53 words I looked up in Eijiro on my iPhone that I've clipped. I've been listening to the ESLPod on the train to and from work for the past few days, so I can look at the ESLPod scripts marked as "listened" and pick out the words I don't understand. Seeing how many new words I can introduce in two weeks while keeping the cycle steady is a good goal to quantify my efforts.
 
 Okay, I'll do it again tomorrow!
 
 <a href='http://d.hatena.ne.jp/nishiohirokazu/20110608/1307535139'>"After 30, I memorized 3000 words English vocabulary memorization system" Day 2 Diary</a>.
 </body>

[Hatena Diary 2011-06-07 https://nishiohirokazu.hatenadiary.org/archive/2011/06/07]