Hatena2010-03-30
code:hatena
 <body>
 *1269944749* Leverage memo: who ducks experts and who gets ducked.
 <a href="http://www.amazon.co.jp/gp/product/4062118300?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=4062118300">The Rich Brother's Royal Road&#8212;Who ducks experts and who gets ducked</a>.
 
 Book titles are often decided by the editor, not the author, but this is a terrible idea. Don't give the author a title that makes him or her say at the beginning of the book, "The title is this, but what is that?
 
 >>
 The numerous investment books and seminars since "Rich Dad" can be divided into three types. Economic commentary type. They don't get "So what?". Success stories. They boast about their success in the bubble economy, but their contents are often not in line with the current deflationary situation. The third and most sinister type is the "how-to" type. They talk about things that can be learned by going to a bank, real estate agent, or brokerage firm. They teach how to be controlled as a customer (a sucker) rather than how to control an expert as a partner.
 Financial freedom" is not "unearned income." It is to no longer have to give up the things you want to do for money/life. ((Removing only "things you have to do" without "things you want to do" will not make you happy.))
 Financial freedom hedges many misfortunes, but many people attract financial inconvenience and misfortune with the wrong investments. They take on things they don't need to take on, saying, "It's natural to take risks." ((Drucker also wrote that entrepreneurs are not risk oriented.))
 A good book if you want to learn how to think as a philosophy book, a bad book if you think it's a how-to book.
 Professionals are not supermen. They just work at it and are used to it. They are not overconfident.
 Do not leave "thinking" and "judging" to them. Only "information" and "labor" can be entrusted.
 Used car dealers have a list of valuation criteria to stabilize their evaluations between veterans and newcomers. Are you a veteran who assesses with your own eyes, or are you a rookie who takes the manual for granted?
 The author started by buying a Hachi Roku Treno with a "non-genuine tune" and "lots of scratches (that could easily be removed if checked properly)" for 150,000 from a dealer specializing in luxury cars who could not assess its value. He removed the scratches and sold it a year and a half later for 4 times the price.
 "Normal cars," "popular cars," and "best-selling cars." Normal cars drop to zero in value. Popular cars have a higher bottom line than the best-selling cars, and their prices fall more slowly. Popular cars (products with high brand loyalty) are less likely to be compared in price with other products.
 If you go to several real estate agents and they only tell you similar things, it is because the same data is passed around and the pepe is responding to the manual. Ask about the budget at the beginning. If it is that budget, I assure you, "This is the kind of housing. They don't look for the cheapest property or anything like that. It's just more work and less commission, and there is no benefit to the real estate agent to take such action.
 Every morning a flyer called "MySoku" is distributed to each real estate agency. So it is the same information at every store.
 Why are views not reflected in real estate prices? Real estate agents who repeatedly use manual responses do not acquire the skills to judge a view. They do not even try to sell the property at a higher price by appealing to the quality of the view. Nothing has changed since the bubble era when they could make a profit just by selling the property.
 The explanations in many auction books are almost the same. The minimum sale price at auction is 60-70% of the market price, so you must add 20-30% to that to your bid, or you must judge the market price from flyers, etc., and bid with a 10-20% discount. I am amazed that he buys with such a big discount. I wonder if they have a chance to compete with real estate agents in their main business in this way.
 Collect historical bid price data. Some percentage of properties that were not bid on. No bids = not even worth the minimum bid price. And they are willing to pay 20-30% more to buy it!
 They say things like "the risk of having a yakuza-like occupant," but it is rare to have an occupant in a cheap property. It is only natural because it is more profitable to occupy expensive properties.
 It is not uncommon for low-level appraisers to give outrageous valuations.
 Real estate is required to register transaction cases with the official distribution system (Raines). The market price and frequency of distribution can be determined by referring to past transactions for each condominium.
 Auction books may say, "Beginners should aim for vacant rooms," but vacant rooms are more convenient for occupiers to work without evicting the occupants.
 Purchased a cheap, decrepit property with a great view for 3 million yen. One year later, when he approached a real estate agent about selling it, he was told that he could sell it for 6 million. When he left it to a major conglomerate real estate company and thought it would be difficult to sell, another real estate agent approached him with a price of 5.5 million. There was no ingenuity at all in the advertising copy.
 When I say "advertised," I only mean that they spent a high 10,000 yen if the six properties share the printing cost of 40,000 for a B5 insert and 20,000 for a postage-posting cost.
 If we raised the price to 9.8 million and invested about $5,000 to distribute a decent flyer, we would have 2 job offers in a week.
 There is no use in trying to persuade the salesman at the end of the line. His mission is to wrap up the negotiations. He prepared an excusable statement: "I told him I could only sell the property for 5.5 million, and the seller came to me with a prospective buyer for 9.8 million, and he is angry at me for my ineptitude.
 Experts are experts only because manuals allow them to act like experts, not because they are good at thinking through new situations.
 20% of new construction is for advertising and model room promotion.
 The real estate agent tried to hold the open house during the daytime as is customary, without thinking, but that is a fool's errand for a north-facing property that sells views.
 A "true expert" capable of responding outside the manual
 There is a high hunger for properties that experts cannot find with manual support. Also, specialists are not able to correctly value such products.
 Experience marketing techniques have been well used for new condominiums, but not so much for existing properties. This is very important for selling an expensive product that is more expensive than others.
 Owner-change = sale and purchase with renter attached
 Many people overestimate experts more than necessary, rely on them, atrophy, and do not think for themselves. As a result, they become sitting ducks. You must take command of the experts and make them work for you.
 It is a mistake to be bossy toward experts. Instead of treating experts as customers, they should be treated politely as partners. It is easier to make a sucker out of them if you treat them as you would most of your clients.
 It is necessary to present the outputs that you want and pick them up in a position where it is easy to produce outputs, rather than just issuing requisitions.
 People are ultimately driven by emotion. Why do they get takeout from Starbucks instead of a 120 yen can of coffee? Why do they buy a condo priced tens of thousands of times more expensive while holding out for a few thousand yen?
 "Answering the Customer's "Why Me? Lester Wunderman
 Leave it to the experts. Labor and information is the job of the expert.
 It costs about 80,000 including transportation and witness fees to transfer ownership and erase the mortgage, but I can make the documents in 5 minutes, so I do it myself. But I leave the rest to judicial scriveners except in the center of the city.
 Data is the same as experts. Do not be overconfident. It is counterproductive if used in the wrong cut. For example, most of the properties on the north side of Koshu Kaido face south. You can only see the elevated railway tracks. If you face north, you have a panoramic view of the Tokyo Metropolitan Government Building area. If you live alone, you are at work during the daytime, so the sun exposure is not important. Because many people put "facing south" as a desirable condition. Because many people choose "facing south" as their preference. The reason is that there is no survey that asks, "Which do you prefer?
 It is important to look at the data and ask questions. There are many cases of contracts with the same price as the offer price on Raines, but it should be rare for a contract to be concluded without negotiating a limit price. This is strange. This is a case where the price is registered higher than it really is in order to get more mortgages (?). There are also unusually high outlier prices at auctions. High bids by amateurs and illegal self-auction.
 It is important to look for neighborhoods where the price is on the rise ((how?)).
 Decision-making and thinking should not be left to others. If you think for yourself and fail, you can use that know-how the next time.
 <<
 The "manual specialists" that the author is dismissing is not in itself a wrong strategy for a large company. To scale their business, they need to use manuals to provide a large number of interchangeable personnel at low training costs, and they specialize in hot-selling products rather than popular products because the market is wider that way.
 The author's strategy is to focus on the niche market of "people who want a room with a view. The only way for an individual with small capital to perform better than a large company is to use his/her head to find a niche market and invest more resources (in this case, more advertising expenses and the author's know-how in creating advertisements) than a large company would invest in the niche market. So the author's strategy is correct.
 However, if these small entrepreneurs, through their wisdom and efforts, discover a "profitable market" that pays well for large companies, the large companies will eventually enter the market and lose out due to their capital power.
 I guess the fact that he writes a book like this means that the market for "properties with good prospects" is no longer so good. Just as the author himself talks about "Rich Dad" at the beginning of the book, this is a good book if you read it as a practical example of niche strategy in one level of abstraction, but if you read it and think, "Well, I should look for properties with good views too! I'll look for a property with a view, too!" It's a bad book for someone who says, "Well, I'm going to look for a property with a view!
 
 *1269945021*Leverage memo: innovation and entrepreneurship (1st draft)
 <a href="http://www.amazon.co.jp/gp/product/4478000646?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=4478000646">Innovation and Entrepreneurship (Drucker's Famous Books)</a>. I'm still feeling a little indigestion so I'm going to put this up and rest for a while before reading it again. The good thing about Drucker's red book is that it is full of real-life examples, but I've cut them out because there are no end to the number of times I could quote them.
 >>
 Innovation through the discovery of high-tech inventions is risky. However, if it is managed systematically like Bell Labs and IBM, it is not so big.
 Innovation creates resources. Crude oil and bauxite were once nuisances that undermined the earth's power.
 There is no better resource in the economy than purchasing power. With the invention of installment sales, the resource of purchasing power for the purchase of farm equipment was suddenly available.
 The idea of containers has increased the productivity of ships by a factor of four.
 The invention of textbooks has increased teacher productivity dozens of times.
 Innovation is not limited to technology. It doesn't even have to be a thing. Newspapers, insurance, installment sales, apprenticeships, government and the modern state.
 Japan's creative imitation strategy is the entrepreneurial strategy with the highest probability of success.
 The greatest feat of the technology market in the 19th century was invention. From invention by floundering geniuses to invention by systematic development and research units. Innovation requires similar systematization.
 Seven opportunities for innovation: unexpected phenomena, existence of a gap between reality and ideals, needs, changes in industrial structure, demographic changes, changes in the way we see things, and the emergence of new knowledge. This is in order of reliability and certainty. Innovations based on new knowledge are prominent but less reliable. Instead, inconspicuous analysis of unexpected successes and failures in daily operations is less risky and has a shorter lead time.
 Management is paid for judgment, not infallibility.
 The unexpected success of the test equipment meant not simply that the product was used for another application, but the end of a niche market
 It was believed that farmers did not have the financial resources to buy televisions, but in fact, they did try and buy them. While Toshiba and Hitachi were selling televisions in department stores in major cities, Matsushita went door-to-door selling to farmers.
 Instead of spilling the beans on the irrationality of consumer behavior, they concluded that there was an ongoing phenomenon that did not conform to what they had previously considered to be "self-evident ideas about consumer behavior.
 If demand increases, performance must also increase. What does not happen is a "performance gap. From blast furnace to electric furnace.
 A "perception gap" where we are competing by focusing on areas that are wrong and not expected to deliver results. From increasing vessel speeds to reducing loading and unloading times with container vessels.
 Value Gap. Sometimes we buy things that we would not buy based on economic rationality. Matsushita and TV. My car. Investments that don't make money.
 Few customers buy what the producer thinks is teibashi. The value to them is different. Typical reaction shown by producers "consumers are irrational and do not want to pay for quality" This is the existence of a value gap
 Process Gap. Most of the process is easy, but one part is difficult. Solve it.
 Needs: process needs, labor needs,
 Process needs: Circulation of publications increased greatly, but typesetting required skilled typesetters → Typesetting machines became widely used in 5 years, and the process gap of typesetting
 Workforce needs: projected demand for telephone switchers in 15 years will require all women to become telephone switchers → AT&T developed an automatic switchboard in 2 years
 Knowledge Needs
 The smaller you focus your development research, the more effective it will be. Japanese line-of-sight markers
 Demand for news, but not enough to make a daily → Weekly Time
 Five assumptions: a complete process, only one missing piece, clear objectives, clarity of what is needed to achieve the objectives, and permeation of acceptance that "there must be something better".
 Three conditions: clear what the need is, necessary knowledge is available, and it matches the user's values.
 Changes in industrial structure.
 Rapid growth: dramatic structural change before doubling in size
 It has to be simple.
 Imitation is not helpful in turning changes in perception into opportunities for innovation.
 Lead Time for Innovation through Technology. The Structure of the Scientific Revolution, 30 years.
 Innovation through knowledge is stillborn if the pieces don't all fit together.
 You should not touch innovation with ideas. Exposition.
 Innovation by floundering genius cannot be done or taught again.
 Analyze the opportunity, what must be considered in order for the user to see the benefit, narrow the focus and simply start small.
 Don't be too complicated: make it usable by ordinary people. Don't diversify: need to concentrate energy, even Edison only in the field of electricity. Don't go for the future: ideas that cannot be realized at the moment are like sketches of the genius da Vinci. Our idea notes, which are not geniuses, have no immortal value.
 Be single-minded. To be strength-based. To change the economy and society.
 Institutionalizing the disposal of items that are no longer productive. Organizational hygiene. Assuming that there is a life cycle. Clarifying what kind of innovation needs to be done, in what areas, and when.
 Reasons why public institutions cannot innovate: budgets, inability to "put the customer first", unattainable perfection requirements
 Entrepreneurial Strategies
 - total power strategy
 　An all-out attack. Successful results are great, but gambling is also high. Aiming for market domination.
 - Guerrilla Strategy Creative Imitation Strategy Judo Strategy
 　Attacks on Weaknesses.
 　Creative imitation strategy: do not take away the customers of the new product you have created, but deal with the market they have created but neglected. The first innovators of high technology are rarely market oriented. They are unable to answer the demand they themselves created.
 　Judo Strategy: Products are not valuable for being difficult to produce. Customers will pay for what is beneficial to them. Vacuum tube radios and transistor radios. Sony won the market in 5 years. Japanese companies have won many times by Judo strategy.
 　The good side of the market and founder profits are nothing more than subsidies for new entrants who will have to fight it out in a few years.
 　Gaps where judo strategies are used: NIH, good market, misunderstanding of value, founder's profit, multifunctionalization
 　Situations in which judo strategies succeed: when top firms overlook the unexpected itself, top firms are classical monopolies (cousin-taking, higher prices, etc.), changes in market or industry structure
 - Niche Strategies: Interest Strategies Specialized Technology Strategies Specialized Market Strategies
 　Aim for a substantial monopoly in a limited area. Avoid competition.
 　Barrier Strategy: Occupy the inevitable barriers. Cannot grow beyond the size of the market. Demand can disappear overnight. There is nothing you can do.
 　Specialized Technology Strategy: Do not accept competition with highly specialized technology. Must always remain up-to-date. Sometimes expertise becomes generalized. Niche-adapted species cannot adapt to changes in the external environment.
 　Specialized market strategies: expertise for the market, not expertise by service. Traveler's checks. The biggest enemy is yourself. When a specialized market becomes a mass market, competition arises.
 - Customer Creation Strategy: Utility Strategy Price Strategy Circumstance Strategy Value Strategy
 　Utility Strategy: Making mail easier so that it can be used for purposes for which it has not been used before.
 　Pricing strategy: don't sell copiers, sell copies. Sell razor blades.
 　Situation strategy: add on replacement blades because the power company cannot afford the cost of maintenance.
 　Value Strategy: Provide value to customers. Profits come not from differences in cleverness, but from differences in stupidity." Profits are made by simply doing what is obvious because other things don't think. Marketing rudiments.
 
 Trying to have high technology without a broad entrepreneurial economy based in low and middle tech is like trying to have a mountaintop without a mountainside.
 In a society that is only interested in high-tech ventures that are nothing more than small skits and snickers at innovation in other fields, even the most tech-savvy will seek work and careers in large, stable organizations.
 Innovation is the creation of better economic goods and services
 <<
 
 *1269958525* Blue Moon Considerations
 I heard that having two full moons in a month is called a blue moon. Blue moons occur only once every 3 to 5 years, and this year, January and March are both blue moons, and furthermore, February is a month without a full moon, which happens only 3 times in 100 years!
 
 The moon's phase cycle is 29.5 days, so when 1/1 is a full moon, 1/30.5 is a full moon, and 1/60 = 2/29 = 3/1 is a full moon and 3/30.5 is also a full moon. In other words, "January and March are blue moons and February is a month without a full moon" is the same as "1/1 is a full moon." Since there are only two months shorter than 29.5, the month without a full moon can only occur in February, and it is only there that it rolls back, so inevitably the two blue moons of the year occur only in January and March. 29.5 * 12 is 354, so it shifts about 11 days a year. 11 and 31 are prime to each other, so 1/1 is a full moon only once every 31 years (to get it exactly, you need to take leap years into account), so 3 times in 100 years is about right. the months after April are +0.5 or +1.5, so they shift gradually and the big The probability of a blue moon occurring in a given year is about 6/31 since there are six large moons (1 or 3, 5, 7, 8, 10, 12), so the ratio is about 1 in 5.
 
 *1269959676*[GAE]Using bulkupdate
 http://github.com/arachnid/bulkupdate
 
 Let's just follow the procedure and try it out.
 >||
 handlers:
   - url: /_ah/queue/deferred
     script: $PYTHON_LIB/google/appengine/ext/deferred/handler.py
     login: admin
 ||<
 This is the kay-framework (http://code.google.com/p/kay-framework/)
 >||
 - url: /_ah/queue/deferred
   script: kay/main.py
   login: admin
 ||<
 You're bumping into the "/_ah/queue/deferred". I wondered what /_ah/queue/deferred was, but it's <a href='http://code.google.com/appengine/docs/python/taskqueue/overview.html'>Task Queue</a>. The "deferred" part seems to be optional. So I rewrote /_ah/queue/deferred in urls.py to /_ah/queue/kay_deferred. PS: Kay guarantees that kay.setup() is called by pointing to kay/main.py, so this workaround points out that if you call deferred.deferred in kay, kay.setup() will run without being called, causing trouble. There is a problem. Further note: I heard that bulkupdate works in kay's deferred even if it is not changed!
 
 >|python|
 def make_url():
   return Map([
     Rule('/_ah/queue/kay_deferred', endpoint='deferred'),
     Rule('/maintenance_page', endpoint='_internal/maintenance_page'),
   ])
 ||<
 
 The same goes for app.yaml:.
 >||
 - url: /_ah/queue/kay_deferred
   script: kay/main.py
   login: admin
 ||<
 
 <hr>
 
 Now, I don't need a repeating task, but I don't know what value to set for UPDATE_INTERVAL = datetime.timedelta(days=1). I don't see it in the documentation. It doesn't appear in the source code either.
 
 I was wondering if you just use if (datetime.datetime.now() - entity.last_reset) > self.UPDATE_INTERVAL: in handle_entity. So the iteration kick itself is not provided by this library.
 
 Now, write as the document says,
 
 http://localhost:8082/_ah/bulkupdate/admin/とかにアクセスすると
 >>
 Bulk update job listing
 
 No jobs.
 <<
 is displayed.
 
 Now, let's start the job. But then I get a PicklingError: Can't pickle <class 'main.views.ToMultiAnswer'>: it's not found as main.views.ToMultiAnswer. I guess you don't want to put a temporary task at the top level, so you put it in a function so you can't pickle it and put it back. No problem, let's put it in the top level.
 
 <img src="http://gyazo.com/62d885edc9c64a30f7209472d1480722.png">
 
 If you are wondering why the process is not done automatically...
 
 >>
 Task Queues and the Development Server
 
 When your app is running in the development server, task queues are not processed automatically.
 <<
 http://code.google.com/appengine/docs/python/taskqueue/overview.html
 
 This seems to be the case.
 
 <img src="http://gyazo.com/e68d18d2572f48d6497be5977ac6f333.png">
 
 When I pressed Run, the process was properly executed.
 
 <hr>
 
 On the production server, the link can be found at the bottom of the sidebar of the Admin Console. It was done correctly.
 </body>

[Hatena Diary 2010-03-30 https://nishiohirokazu.hatenadiary.org/archive/2010/03/30]