Hatena2008-10-13
code:hatena
 <body>
 **1223881375*[Mid-term] AI for game servers
 I only have an AI that plays randomly now, and the results of this are positive. In other words, humans are playing with an overestimated probability of "convenient situations" that they would be happy to see happen.
 
 A typical example would be, "I really want to get this turn, so I'll make the middle seven!" I want to win this turn! It is true that the middle 7 is the most likely to win the turn, but it is only 1/2 chance at most.
 
 By the way, I have played 8 games on the official server and got a score of 4. I'm not very good at playing against other players, but I wonder if that's because I sort my cards so I know what to expect, or if it's because I tend to play cards without thinking in a hurry when someone plays a card first.
 
 -----
 
 Yeah, I was thinking about it when I was playing against him.
 - Kick one of them up (let them get a big score in the first or second round) and play not to go over it in the rest of the turn.
 - Kick one person off (pile on the big number that someone else made in round 1~2 and make the same number and both of you score in that round) and "race to score no points" with the other one.
 This is a strong situation.
 - Situations where two people other than yourself score and you have to go for the in-between.
 This is weak.
 Perhaps a better strategy would be to beat one of them up early on. Also, you shouldn't act carelessly on turn 2, turn 3 is critical.
 
 **1223916883*[Midorihiki] "Midorihiki Online" has been released.
 This is a service that allows you to play the three-player card game "Saikyuu" on the web. There are no rankings yet, but play history and scores are recorded.
 
 http://saichugen-online.appspot.com/
 
 <img src="http://gyazo.com/321b4b5c7571142a05ee98ec31c41f21.png">
 
 As of yesterday, the game was ready to play, but I tried to make it easy to understand for people who have never played before, such as by mixing in English even though only Japanese people use the game, and by sending messages to people who have never played before.
 
 I told id:amachang that I would release it over the weekend, so I gave up and released it here for now. I wrote a lot of comments and documentation in case the next time I tweak the code, even if it's my own code, it'll be a little bit confusing. Django on Google App Engine was very easy.
 </body>

[Hatena Diary 2008-10-13 https://nishiohirokazu.hatenadiary.org/archive/2008/10/13]