Hatena2012-08-09
code:hatena
 <body>
 *1344512781*Spaced Repetition of Podcasts in iTunes
 I've been listening to English podcasts lately, but I don't think podcasts are suitable for studying English because they are not designed to be listened to again at intervals. If you request not only to listen again at intervals, but also to have the intervals gradually increase <a href='http://en.wikipedia.org/wiki/Spaced_repetition'>Spaced repetition</a>, you may get the impression that "I have to make such an app myself. I wonder if I have to make such an app by myself.
 
 So, before starting from scratch, I thought I should make a rough prototype with what I have now, and tried to see if I could do something with iTunes. It was surprisingly easy to make a rough prototype, so I'll share it here.
 
 First of all, I have a pile of podcasts that I haven't listened to yet, but I think that if I pour all these "unfamiliar podcasts" into my head at once, my mind will be flooded with them, so I narrowed down the amount of podcasts coming in to one. I created a "smart playlist" containing only one podcast that I have not yet listened to and named it SR1. For the following explanation, let A be the podcast you listened to on the first day.
 [f:id:nishiohirokazu:20120809204612p:image]
 
 Second, once a podcast has been listened to once, it will be removed from SR1 because it is not a "podcast that has not been listened to yet" at the next sync. Therefore, "listening to a podcast once with an interval between listens" is equivalent to "creating a smart playlist that will include the podcast after some time has passed. For example, if there is a playlist that says "A has been played once and the last playback was not within a day," then podcast A that was listened to on the first day will not yet be included in this list on the next day. It will go in the day after that. I sometimes listen to the same podcast multiple times in a day, so I have a range for the number of plays.
 [f:id:nishiohirokazu:20120809204608p:image]
 
 The rest of the smart playlists were similarly created up to SR5, where the list includes those with more than 19 plays and more than two weeks since the last playback.
 
 and bundle these smart playlists into a playlist. Listen to this playlist on shuffle + repeat within the playlist.
 [f:id:nishiohirokazu:20120809205355p:image]
 
 This time there are 5 listed with one in every list, but the contents of SR4 and SR5 will be empty for a while after tomorrow, since there is only one candidate in SR4 and SR5 so far. That will reduce the number of podcasts and thus increase the number of times they are repeated per day. It will probably waver for a while until a reasonable amount of podcasts are assigned to each class, but I'm sure it will settle into the right place eventually. I'll operate with this as a trial.
 
 [f:id:nishiohirokazu:20120809205948p:image]
 
 Incidentally, in the current situation where the respondents were randomly listening to the music "it would be better to listen to it repeatedly" without making such efforts, the distribution is as follows: 1 case of 22 times, 1 case of 18 times, 1 case of 7 times, 1 case of 5 times, and 4 cases of 20 or more times. This should be reversed, with 15 rank 5 (20 or more plays), 7 rank 4 (15 or more plays), 3 rank 3...and so on.
 </body>

[Hatena Diary 2012-08-09 https://nishiohirokazu.hatenadiary.org/archive/2012/08/09]