Hatena2009-02-02
code:hatena
 <body>
 *1233524610*6am
 Stayed up all night at a manga cafe. Well, I came to Akihabara on a bicycle, so it's a hassle that I have to ride my bicycle back home. It's tough.
 
 *1233526052*Ikigami
 It was recommended by id:voluntas before <a href="http://www.amazon.co.jp/gp/product/4091532810?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247& creative=7399&creativeASIN=4091532810">Ikigami</a><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as2&o=9&a=4091532810" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" /> read. The story is simply explained as follows: "One in a thousand people is randomly selected to die on a certain date and time by a mechanism that cannot be avoided, and the main character's job is to tell the selected people 24 hours before his death. I was impressed by the words of the therapist in the latter half of the second volume. I was impressed by what the therapist said in the latter half of the second volume. Especially for those who feel a sense of stagnation, or who are no longer questioning their unchanging daily life, this is a chance to think about what you would do if you were to die in the next 24 hours. I would also recommend the stories in the first half of volume 5, for example.
 
 So I'm assuming that I will die at 4:00 AM on February 3. In reality, I can only do so much in a 24-hour period, so I think it would be better to plan my death on March 1, which would give me a month or so to plan my actions.
 
 *1233528008*Sleepy
 Let's go home for now. I'm very sleepy, so drive safely.
 
 *1233534620*Home
 It took me 70 minutes to get there, but if I didn't make a wrong turn, I could be back in 45 minutes.
 
 *1233565685* I woke up.
 I slept in after the 2-hour round-trip bike ride to Akihabara and the all-nighter, and woke up at this time.... Well, I'm not really going to die today, so I think I'll take a break today.
 
 
 Something about the "I'm going to die in 24 hours" setting isn't very realistic, but the possibility of "flu onset in 24 hours" is starting to become a possibility. I haven't seen any signs so far, though. Should I go to the pharmacy and get some powdered sports drink?
 </body>
 <comments>
 <comment>
 <username>jbking</username>
 <body>This has nothing to do with the text, but the random looked like lambda. I'm tired, I must be. </body>
 <timestamp>1233697281</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-02-02 https://nishiohirokazu.hatenadiary.org/archive/2009/02/02]