Hatena2011-06-28
code:hatena
 <body>
 *1309267016*Guide to SEPCAN 2011
 I was told that the official site doesn't hit when I googled "sepcan", so I put a link to the official site with "sepcan 2011": <a href='http://www.ipa.go.jp/jinzai/renkei/spcamp2011/index.html'>sepcan 2011</a>
 
 And my Tweet, etc.:.
 
 ** If you can't write the appeal, we're talking about txt format.
 >>
 By the way, what should I do if I can't write enough appeal points in the margins of the application form? I mean, the application form is only available in PDF format, but how can I fill it out and attach it to an e-mail? Why is there no text format this year?
 <<
 
 →Text format has been added! You can write a lot of appeals and send them by e-mail with zero mailing cost!
 
 ** Talk about a gap in the difficulty of the application form.
 >>
 A word of advice to those who are thinking of applying for the Security & Programming Camp. For some reason, the security side has more difficult questions and the programming side doesn't, but don't make the mistake of thinking that the acceptance criteria for the programming side is not easy, because there are 10 people in each group. It's a "narrow gate" thing.
 <<
 
 ** Regarding "I prefer Python to Ruby.
 >>
 I prefer Python to Ruby too, so no problem there! But you should be able to read and write C by the time you get to camp! RT @Tomoki_Imai To be honest, I'm almost a programming newbie, but can I apply for Sepcamp? I like Python better than Ruby. ...... Ugg .......
 <<
 
 **In response to the "my parents don't trust me" and "they said it must be a scam" type of comments.
 >>
 kuroneko_stacy:
 This may work quite well since there are success stories. RT @nishio: I know it's a little late for this, but you could put a pillow word "METI's" when talking to parents #spcamp
 <<
 
 >>
 kensukesan:
 If your parents are suspicious, have them contact the Information Technology Promotion Division of METI http://tinyurl.com/5voqvdv or the IPA office http://tinyurl.com/5sopwtz #spcamp
 <<
 
 ** Tuttle's story of an ample budget.
 >>
 But it's still only about 1/10,000th of the money spent on free high school tuition."@matutake27: @DAI199 It looks like they have a pretty big budget, and all transportation, lodging, course fees, textbooks, and equipment usage fees are paid for by the organizers or free of charge. http://t.co/J8swtCQ"
 <<
 
 **Datastore group loss
 >>
 Oh my gosh, I can't believe that happened...I feel sorry for the people who applied. "@tadsan: @dasoran_univ2 Bids for the open call for each class were due two days ago. And the class application suspension notice right after that. ...... So no one raised their hand to run the datastore class."
 <<
 
 >>
 I didn't expect the datastore group to be canceled. And I was pretty surprised when I found out that the linux group was going away in the first place. Well, I hope those who said "I'll sign up next year" got some sense of why the lecturer said "there may not be a next year".
 <<
 
 ** and a tsk tsk to the misconception that it was because there were not enough applications.
 
 >>
 There is no evidence to connect this with the youth's disengagement from what-ifs. "@gunjisatoshi: "Datastore Class Recruitment Cancelled" Young people are seriously leaving fundamental software http://t.co/ddv2L7I"
 <<
 
 >>
 The idea that the event was cancelled because there were not enough applicants is ridiculous, since the application process has not even been closed yet.
 <<
 
 Applications for such events usually come in fast and furious at the deadline, so there is no way they would make a decision to cancel the event before the application period is over because there were not enough applications.
 
 **The question of whether it should be overestimated or underestimated.
 >>
 Eh, I personally don't know if subjective evaluations are over- or under-estimated, so I'd rather go through and evaluate myself based on objective information. "@uzimith: should I submit an overestimate of myself to Sepcan?　I'm so embarrassed (sic)."
 <<
 Therefore, I would be happy to have as much objective information as possible.
 
 **亀裂
 >>
 It is difficult. But at any rate, I don't like "those who make fun of those who couldn't go because they were able to go" and "those who drag down those who went because they were jealous of those who went because they couldn't go". RT @tadsan I'm worried that there will be a split between those who were able to go and those who were not able to go. It's difficult.
 <<
 
 I believe that sharing what we know with the participants will benefit Japan, so naturally I want the participants to share what they have learned with others and use it for the benefit of Japan.
 
 **For the discussion of which is better or should be prioritized over the Basic Information Technology Engineer Examination.
 >>
 The model answer is that it is hard to say which is better or which one to aim for, since it depends on the purpose and skills of the candidate. For reference, 30,000 to 40,000 people pass the Basic Information exam each year, with a competition rate of 3 times. The number of people who pass the SEPCAN is 60 per year, with a competition rate of 10 times. There is no argument as to which is rarer.
 <<
 
 **About the greatness of the instructor
 >>
 I think we need to come up with a system to rate and credit the "awesomeness" of the event. RT @hyoshiok You got great people together, so you must be great.
 <<
 
 *1309268536*英単語日記9
 **過去の記事
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20110607/1307450595'>I started the "After 30, I memorized 3000 words English vocabulary memorization system"</a>.
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20110608/1307535139'>"After 30, I memorized 3,000 words, English vocabulary memorization system" Day 2 Diary</a>.
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20110609/1307630086'>"After 30, I memorized 3,000 words, English vocabulary memorization system" Day 3 Diary</a>.
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20110610/1307715975'>英単語日記4</a> <a href='http://d.hatena.ne.jp/nishiohirokazu/20110612/1307885250'>英単語日記5</a> <a href='http://d.hatena.ne.jp/nishiohirokazu/20110615/1308097323'>英単語日記6</a> <a href='http://d.hatena.ne.jp/nishiohirokazu/20110616/1308227965'>英単語日記7</a> <a href='http://d.hatena.ne.jp/nishiohirokazu/20110619/1308452872'>英単語日記8</a>
 
 **Study for 6/20
 Tested 11 sheets. 1m30. ok 7 ng 4. 10m30 including 4 word fattening. no review for today.
 
 I tend to get pulled towards the first minor meaning I learn, such as "exploit" (verb), "offset" (verb), or "faculty" (meaning not a department), and make misunderstandings.
 
 I added 16 word cards and forced myself to meet the goal, but this does not feel like the right approach. I finished one pomodoro without taking the time to think about the meaning or transcribe the explanation from the English-English dictionary. The cards I added today will probably have a low percentage of correct answers on tomorrow's test.
 
 >||
 7/7  1m 29
 6/27 8d 10
 6/24 8d 26
 6/23 4d 22
 6/22 8d 35
 6/22 2d 7
 6/21 4d 16
 working 20
 
 [20, 7, 38, 71, 0, 29, 0, 0, 0, 0]
 total: 165
 score: 606
 ||<
 
 ** Study on 6/21
 28 piece test. ok 13 ng 15. very low percentage of correct answers. day 2 review test ok 3. day 4 review test ok 14 ng 2. day 3 review test ok 4. day 5 review test ok 5. day 6 review test ok 6. day 7 review test ok 7. day 8 review test ok 8.
 
 >||
 7/7  1m 29
 6/29 8d 14
 6/27 8d 10
 6/25 4d 3
 6/24 8d 26
 6/23 4d 22
 6/23 2d 13
 6/22 8d 35
 6/22 2d 7
 working 17
 
 [17, 20, 25, 85, 0, 29, 0, 0, 0, 0]
 total: 176
 score: 646
 ||<
 
 ** 所感
 It was a mistake to set a score as a goal. Setting a score as a goal provides an incentive to increase the amount of work per day. More work means you need more energy to get started on it. For example, if I set a goal of having to score 30 points per day, I would need to do a lot of work to achieve it. You have to add 15 words. It would be easier if I could just transcribe from an existing word list, but in my case, I have to read an English paper and put the words I don't understand into a word card, so it becomes a heavy "well, I won't finish in 30 minutes" feeling.
 
 We want to get into the habit of learning continuously for about one pomodoro (25 minutes) every day, so the first step is not to make the daily task heavy, but to make it light and remember to repeat it.
 
 ** 6/22 study
 OK 19 NG 13　4m30
 2d OK 6
 8d OK 34 NG 1
 
 >||
 7/8 16d 34
 7/7  1m 29
 6/29 8d 14
 6/27 8d 10
 6/26 4d 6
 6/25 4d 3
 6/24 8d 26
 6/24 2d 19
 6/23 4d 22
 6/23 2d 13
 working 14
 
 [14, 32, 31, 50, 34, 29, 0, 0, 0, 0]
 total: 190
 score: 715
 ||<
  
 1 Pomodoro.
 
 ** Study on 6/23
 The smallest time is ideal for making vocabulary cards, etc.
 2d 1m35 OK 11 NG 2. 4d 2m OK 16 NG 6. 3 of the NGs were things I felt like fattening up on rather than simply making a mistake.
 I remembered that an umbrella organization is a governing body, but what is a governing body? I see...governance is "governing," but what's the English word for that?
 OK 9 NG 5
 
 >||
 7/8 16d 34
 7/7  1m 29
 7/1 4d 16
 6/29 8d 14
 6/27 8d 10
 6/27 2d 11
 6/26 4d 6
 6/25 4d 3
 6/25 2d 11
 6/24 8d 26
 6/24 2d 19
 working 13
 ||<
 
 ** Study on 6/24
 Test 13, OK 13. day 2 review test 19 OK 17 NG 2. day 8 review test 26 OK 26.
 
 Worked on writing down the meanings of the words I didn't understand yesterday on a blank word card on the back, which I had written down for the time being. After all was done, I still had two minutes left, so I added words from the search history of the dictionary.
 
 >||
 7/10 8d 26
 7/8 16d 34
 7/7  1m 29
 7/1 4d 16
 6/29 8d 14
 6/28 4d 17
 6/27 8d 10
 6/27 2d 11
 6/26 4d 6
 6/26 2d 13
 6/25 4d 3
 6/25 2d 11
 working 17 
 ||<
 
 The biggest task at hand is to remember to work on it tomorrow.
 
 ** Study on 6/25
 Finally succeeded in studying on Saturday (oh).
 17 tests, OK 9 NG 8. I wrote the meanings on the back of the words I didn't get right, and so on.
 Fail fail, I didn't bring back the ring because it was the first time I did the test at home.
 
 Oh, shoot, I guess I didn't bring back the card I was going to review and test today in the first place, myself.
 I recently got three bundles of review cards and it was a pain in the ass to carry them around...
 
 ** Study on 6/26
 I forgot the cards for the review test, so 9 test 7 OK 2 NG.
 
 ** Study on 6/27
 For 25th, 4d test 3 OK 3, 2d test 9, OK 7 NG 2,
 For the 26th, 4d test 7 OK 6 NG 1, 2d test 13 OK 12 NG 1,
 For 27th, 4d test 11 OK 11, 8d test 9 OK 9
 
 Three 4d tests dated 7/1, 28 sheets. Let's put them all together. 28 sheets. 3 8d tests dated 7/5. 20 sheets.
 
 >||
 7/13 16d 9
 7/10 8d 26
 7/8 16d 34
 7/7  1m 29
 7/5 8d 20
 7/1 8d 16
 7/1 4d 28
 6/29 8d 14
 6/29 2d 7
 6/28 4d 17
 working 4
 [4, 7, 45, 76, 43, 29, 0, 0, 0, 0]
 total: 204
 score: 846
 ||<
 
 It's getting complicated with more and more bundles. The two cards I got right today should be scheduled as a 2d test dated 6/29, but I think it's too detailed, like two cards make one test. we'll merge anything less than 10 cards as needed. rewrite and merge the 6/28 2d test to 6/29.
 
 ** Study on 6/28
 Test 5 cards, OK 5. 4d test 17 cards, OK 17 cards. maybe I should stock up on 2d tests until I have more than 10 cards. So I'll combine the 9 tests dated 29th and the 5 that I got right this time to make the 2d test dated 30th. Basically, for tests that are less than 10, we can merge them with another test of the same review rank as soon as it is added. there are 9 16d tests dated 7/13 and 34 16d tests dated 7/8, but instead of merging the 7/8 with the 7/13, the 7/13's will be merged with the 16d tests that will be added in the future. They will be merged. This means that the half-dozen tests will be delayed.
 
 >||
 7/13 16d 9
 7/10 8d 26
 7/8 16d 34
 7/7  1m 29
 7/6 8d 17
 7/5 8d 20
 7/1 8d 16
 7/1 4d 28
 6/30 2d 14
 6/29 8d 14
 working 0
 
 [0, 14, 28, 93, 43, 29, 0, 0, 0, 0]
 total: 207
 score: 873
 ||<
 
 I haven't posted on my blog for too long, so it's time to put it up.
 
 ** 目標
 - I'll study this Saturday and Sunday too (although I have to go out!).
 - On 7/7 it will be one month since I started this memorization system, so let's do an overall test to see how many words I've learned in one month.
 </body>

[Hatena Diary 2011-06-28 https://nishiohirokazu.hatenadiary.org/archive/2011/06/28]