Hatena2009-04-19
code:hatena
 <body>
 *1240087047*[SpaMon] new design
 Surge was changed to "5 damage to enemy, 2 damage to self" and the card design was also changed.
 
 <img src="http://gyazo.com/ce111534a980cfa10f044f1a6dcec3e9.png">
 
 It's hard to understand what this Surge means, but at least I understand that RemoveCard, RemoveBit is better.
 
 *1240121206*[SpaMon] rule corrections
 With its vast board game collection? After playing Spaghetti Monsters with id:warufuzaketaichi, I won this kind of PATCH.
 
 - Heal is removed because it impairs the convergence of the game.
 - Charm is a card that favors the first hand too much, so it was removed.
 - Zap is too weak and removed
 - Crack (2 damage), Surge (1 damage to self, 3 damage to enemy = 2 damage), Bomb (4 damage) are slightly distributed (2, 2, 4), so Surge was changed to 2 damage to self and 5 damage to enemy.
 -- Surge * 2 is an instant death combo, but can be nullified as a difference by stacking bits on the Surge
 - Bomb was a first-mover advantage card that only the first bit activated because it "removes the card when activated". By changing this to "remove bits when activated", it is made fairer.
 - RemoveCard is "remove the card in front or behind" but the intent of the limitation is not clear, so it was changed to "remove any card".
 
 From id:TOKOROTEN: "I feel like the complexity is too low, but I guess I'll have to play it to find out." I think it's not a bad thing that we have to go ahead with the current rules because the rules of <a href='http://d.hatena.ne.jp/nishiohirokazu/20090321/1237628125'>Programmer's Nightmare</a> are too complicated to begin with. The reduction of 30 different cards to 18 cards was a bold move, but the gameplay was not lost, but rather enriched, so I think it's okay to cut it down to the bare essentials. If the game becomes like a three-card lineup, I think it would be good to add some of the cards that have been cut as extensions. Heal and Charm were simply removed this time, but I think it would be better to change Charm to "change one bit to your color, but not the bits on this card. The bits on this card are not included. Activated bits disappear." Maybe Inc/Dec should be an expansion card too.
 
 
 It is interesting to think about expansions, but it is also interesting to think about how much can be cut in terms of what the essence of this game is. I think it would be fun.
 
 
 Expansion plan
 :ReverseBits: Reverse the bits on a single card.
 :AddCard: Return a discarded card to any position after the game starts.
 :ChangeBit: (ex-Charm) Change one bit on board other than this card to your color and remove the bit that was activated.
 :something strong name: Each player reduces the number of life points by the number of bits they own.
 Invert: Multiply any Arabic number by -1
 
 *1240165349* "You lose when the request arrives in the database."
 >>
 The NicoNico Encyclopedia has been carefully designed so that most content is static. Even when dynamic elements are desired, the page can be generated dynamically locally using cookies/AJAX, etc. For example, the right menu of the Nico Nico Encyclopedia changes when the user is logged in or not, but this is generated dynamically by the browser by looking at the "login" value in the cookie.
 <<
 http://d.hatena.ne.jp/tasukuchan/20090417/nicopedia_hardware
 
 I see. When I created this org, I tried to reconcile the need to display the user's login status and login name with the desire to keep the content static and cached, and ended up displaying only the user information in an iframe. I'll try this next time I create my own server.
 </body>

[Hatena Diary 2009-04-19 https://nishiohirokazu.hatenadiary.org/archive/2009/04/19]