Hatena2011-03-30
code:hatena
 <body>
 *1301412252* mind map diary 12
 I forgot to mention that I bought mind mapping tools for my home last weekend.
 
 Last time I bought an AQATEC SLIM from Teranishi Industries, it started to blur because I use the black color very frequently. 45 sheets in 45 days since 2/12 (that's a brilliant pace of one sheet a day!). I write, and the black pen starts to blur, and...
 
 I couldn't find AQATEC black pens, so I bought a Mitsubishi Pencil PROCKEY fine round lead, the kind you see all the time. I don't like the black color of PROCKEY a little more than AQATEC, but I'll get used to it. 126 yen.
 
 I bought another croquis book for home because it was too heavy to carry around between home and office. The same one, A3 size, 100 pages, 630 yen. Even if I buy a set of 10 colors of markers, there are many colors I don't use (yellow, skin color, etc.!). So I decided to buy only the colors I use most often. Black, red, green, blue, orange, purple, light blue, and pink. When I have about 4 branches, I use red, green, blue, and orange in that order. The maximum number of branches is seven. Purple is often used in combination with red and blue to express "two things and in between". Light blue and pink are often used as modifiers. Inverse matrices are represented by light blue lines, and light blue and pink are used to correct mathematical expansions when they are written incorrectly.
 
 
 Sleepy head thinks about math mappings.
 
 Mathematics is highly compressed. Just as programmers combine functions to create higher level functions. For example, if rule 3 is derived as "A=B by rule 1, A=C by rule 2, and therefore B=C," then to be satisfied with rule 3, one must be satisfied with rule 1 and rule 2. Otherwise, it is necessary to recursively follow the "dependent rules".
 
 The dependencies of the rules should be DAGs in any decent math book. Some of the rules have no dependent rules. It may be an axiom, or a rule that is omitted from the proof because the reader is naturally expected to know it, or it may be "not explained in this book, see what for details".
 
 Just as the source code may say "which function to call" but not comment "why to do so", it would be "kind if it says so" regarding intent in mathematics. The reason might be "because if I choose to do so, I will get the rule I now want to get. The "why" may not have an answer even in current mathematics. It is also possible that there is no answer to the question, "Is it okay to do so?" Newton defined the derivative using the limit for physics around 1700, but it was around 1860 that Weierstrass established the reason why it was OK to do so as the epsilon-delta argument. It was around 1740 that Euler realized that the sum of the reciprocals of square numbers could be expressed numerically in terms of pi, but Riemann was born in 1826. Hmmm, I'd love to give more examples of "I don't know why, but it works if you choose this way" choices that were later explained, but I can't think of any.
 
 I think the reason math is so highly compressed is because there is no noise in the subject it deals with. In biology, there are many exceptions to the rule: "Basically, it is central dogma, but RNA that is not translated into protein can interfere with other RNA, some genetic information is not DNA, etc., etc.," and so compression is not effective. On the other hand, in mathematics and logic, rules deduced from a working hypothesis called axioms cannot be overturned unless the working hypothesis is rejected.
 
 If you know the parts and how to combine them, you can solve the problem. In other words, if you can't solve a problem, you either lack knowledge of the parts or knowledge of how to combine those parts. Basically, the parts are explained in the paper up to that point, but the ways to combine them are not named and not necessarily reusable. In the puzzle book I am reading, there is a proof of the pattern "A=B by rule 1, A=C by rule 2, therefore B=C" (Kxx=Kx if Kx=K, and Kxx=x by the definition of K, therefore Kx=x, etc.), but this is not named. It is perceived as a pattern that appears commonly in the process of solving a problem and is internalized without a name, just like in PRML: "decompose and organize in quadratic and linear terms," "eliminate inverse matrices by multiplying both sides of the equation by the matrix," "do partial differentiation on each component of a vector and set it to zero," and so on. Not named. Oh, there are some with names like integral elimination or square completion.
 
 If the explanation of how to solve a problem does not convince you, what are you missing?
 
 Regarding the debate about the level of granularity to which we should do mind maps in mathematics, one thing became clear today when I saw an opinion that "mind maps are written from the main branches, so you can only write something that is already organized as to what the main things are". It is a mistake to think that you can write a completed version from the beginning. Try writing out the unorganized state of your brain, then highlight what appears repeatedly in different branches and what is relevant to other branches, and elevate it the next time you write. That would be the same in mathematics. The process of writing a problem can be mind-mapped. You can map the process of trial and error, and the results of your writing may be wrong or misguided calculations. And the next time you organize it, the wrong branches should probably be excluded. Points that were not easily noticed should be highlighted. Items that come up in several problems should also be highlighted.
 
 Then, when further organizing those maps, detailed transformations of formulas, etc., should be replaced by more abstract components such as "expand and organize" or "organize in x dimension". It would probably be correct to repeat this process and gradually enrich it.
 </body>
 <comments>
 <comment>
 <username>t2y-1979</username>
 <body>I use my Copic Ciao to add strength to the branches. </body>
 <timestamp>1301414416</timestamp>
 </comment>
 </comments>

[Hatena Diary 2011-03-30 https://nishiohirokazu.hatenadiary.org/archive/2011/03/30]