Hatena2009-12-18
code:hatena
 <body>
 *1261118434*MacBook gave me a folder mark with a hatchet and wouldn't start -> clearing PRAM solved the problem.
 <img src="http://gyazo.com/744aa7e8c857ed57c3dc93cb9a77b504.png">
 
 It stopped working! I shouted on Twitter and got a solution, so I recorded it on my blog for future reference.
 >>
 @cakesjun: @nishio PRAM clear no? cmd+option+P+R while pressing power on -> sound startup sound twice then release key
 <<
 
 *1261118743*Clean up GMail.
 <img src="http://gyazo.com/4f3483586ddcefd9f04d6375c2b66395.png">
 
 I selected all of them and archived them anyway. Yay, the inbox is now empty! I'm done! (yeah!
 
 *1261119312* Twitter is being cracked.
 I'm worried that there is mixed information and no place to go to get accurate information when a situation like this arises.
 
 via ukstudio
 <img src="http://gyazo.com/227b36695b3b89bd1719a5eb6af34ead.png">
 
 There are rumors that it is DNS Poisoning, but I don't know the IP address of the original server, so I can't say for sure. At any rate, accessing twitter.com will definitely lead to an untrusted server, so we need to terminate our Twitter clients to avoid sending passwords and so on.
 
 I don't know much about networks, so I didn't know what to check, so I did an nslookup anyway.
 >||
 $ nslookup twitter.com
 Server:		133.22.16.5
 Address:	133.22.16.5#53
 
 Non-authoritative answer:
 Name:	twitter.com
 Address: 74.217.128.160
 ||<
 
 <hr>
 >>
 [09/12/18 15:51:10] mala: 168.143.162.100 I can write twitter.com or something and use it
 <<
 Hmmm. Does that mean it's still DNS poisoning?
 
 I'm not confident in my judgment, so I'm not going to connect to Twitter until things cool down...
 
 <hr>
 Does it look like it's fixed?
 
 <hr>
 <a href='http://netafull.net/twitter/033003.html'>[N] Twitter Hacked! </a>. So how many times do I have to tell you it's not a hack, it's a crack......................Mooo.
 
 *1261126318*Diary of SIGGRAPH Day 3
 The first day's diary was not written because my MacBook would not start, and the second day's diary was not written because I was tired and sleeping.
 Photo taken yesterday:
 <img src="http://gyazo.com/c368c17cb9c4f7166777b4892066b8c0.png">
 
 <img src="http://gyazo.com/14baa1eb3e56e36127570011a436ed8a.png">
 
 <img src="http://gyazo.com/98bcb722dc1fffe51fc04f9f389a5810.png">
 
 Director Tomino: "There is a text I would like to introduce about what imagination is, Nobel Prize in Literature winner Mascara(?). Dr. Mascara (?), Nobel laureate in literature, said, 'Imaginative power is to imagine and express what is to come next. It is what creates new things. It is to abstract what has happened in the past and see what is essential, not to be obsessed with the concrete. In the process of exploring the unknown, if we see too much of the concrete, we will miss the unknown possibilities. Think of other possibilities with an open mind. The images are so thoroughly concrete that they lack the ability to see the essence. What you are making is a patchwork of past works! How dare you say, 'I won't understand unless you explain it to me?' Anyone who has ever said such a thing should quit!"
 
 He talks softly, but sometimes he is shouted at in a very loud voice. It's a bit of a nerve-wracking experience.
 
 Business is about never getting tired of doing it."
 
 Kierkegaard said, "Despair is a deadly disease."
 
 I'll post the rest later. I've got a bunch of stuff on Twitter, #sa09 and stuff like that.
 </body>
 <comments>
 <comment>
 <username>reggaepunch</username>
 <body> Interesting! I was going to be there tomorrow too, but I won't be able to make it. <BR>That's quite a shame. </body>
 <timestamp>1261150257</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-12-18 https://nishiohirokazu.hatenadiary.org/archive/2009/12/18]