Hatena2009-01-09
code:hatena
 <body>
 *1231495305*[家事]
 f:id:nishiohirokazu:20090109190145j:image
 
 - 家計簿
 -- 玉子10個 236
 
 Iodine egg light was sold out. I bought eggs at 30% off that were close to the expiration date. Even if they expire, I will be able to eat them without much problem.
 
 -Dinner
 -- 1 cup of rice 100
 -- 玉子1個 24
 
 I actually ate about half a cup. The rest will be tomorrow's rice.
 
 *1231497340*AS型自分の説明書
 There seems to be a boom in the market for a book called "Type O Self Manual" or something like that, so I made one myself.
 
 <img src="http://gyazo.com/f24eafd37c0d3d83a84462beb859987c.png">
 
 - I don't like the sound of train brakes or the high pitched noise of rat repellent ringing at the entrance to underground restaurant areas.
 - Fluorescent lights sometimes glare.
 - It may be pointed out that you are wearing clothing that is not appropriate for the temperature
 -- "It's so cold, but you're fine in short sleeves? or "Why are you wearing a scarf when it's already spring? and "Why are you wearing a scarf when it's already spring?
 - Often when reading a novel or watching a drama on TV, it is difficult to understand the intentions of the characters
 -- I mean, I don't really like novels and dramas that focus on that kind of psychological portrayal.
 - Some celebrities are hard to distinguish from each other just by their portraits.
 -- or rather, I'm not interested in celebrities in the first place.
 - I have a very hard time talking to new people.
 - I'm very bad at casual chit-chat.
 - I get caught up in trying to come up with a real solution to a consultation where all I have to say is, "Yeah, yeah, I get it."
 - It's hard to hear what people are saying in a buzzing place like a party hall.
 - Irritated when interrupted in their "routine" that they always repeat
 - A slight change in a person's hair or clothing is either unnoticeable or very time consuming
 -- I noticed a while after the year-end party that a junior who had been straight had a perm, and I thought I should compliment him because I noticed it, so I said, "You got a perm, it looks like a bird's nest," and then I realized that that was not complimentary at all.
 - I am not good on the phone. I don't know when to speak my mind.
 - I like to collect information about specific types of things (cars, trains, birds, gadgets, anime and voice actors, etc.)
 -- Subjects can change over time.
 - Either they say I am weird with people, or I never invite people to events on my own, and most of the time I go along with them when they invite me.
 - Weak sense of time.
 -- If I fill the bathtub with hot water and say, "Let's go stop the bath in 12 minutes," I completely forget about it 12 minutes later, and when I go to the bathroom 30 minutes later, I discover the water is overflowing. So recently I have been setting a timer.
 -- If I have to wait for 12 minutes without a timer, I go check it every few minutes.
 -- I'm not good at making the most of 30 minutes when I know I have to go out in 30 minutes; I spend 30 minutes looking at sites I don't need to look at, and the next thing I know, 45 minutes have passed.
 
 -Sometimes, for some reason, I suddenly go into "hyper-focus mode" as if my brain is on fire.
 - They think I'm weird.
 
 -Inattentive (is this AD type?)
 --I am not good at paperwork. Often forgets to fill in parts of documents. I don't put my stamp where it should be, or conversely, I put my stamp where someone else's should not be.
 --When searching for a route in the transfer guide, for some reason, I selected another station without paying attention to the multiple candidates and did not realize my mistake until I arrived at the site.
 --I had a problem when I first started making my own airline reservations, somehow I had booked the wrong date and was unable to issue a ticket on the day of the flight.
 --I peeled off the labels from plastic bottles, washed and dried them, and stashed them in separate bags from the burnable trash, but put them all in one bag on the day of burnable trash.
 -Other
 -- Sometimes I get upset that they don't answer when I call them. From the opposite perspective, sometimes it seems like they are so focused on something else that they don't hear me calling them at all.
 -- I am not good at arranging things. When multiple tasks are dependent on each other, I get confused and cannot start either of them.
 -- Hates waiting in line
 -<a href='http://www.the-fortuneteller.com/asperger/aq-j.html'>Autism-Spectrum Quotient</a>が閾値(33)以上
 -- I was 42, by the way.
 
 Others are always welcome & updated as needed. If we collect a lot of them, maybe we can really publish them.
 
 *1231514991*Magnetic badge
 f:id:nishiohirokazu:20090110002950j:image
 
 Maybe there should be a can badge to affix a magnet to and play with.
 </body>
 <comments>
 <comment>
 <username>rokujyouhitoma</username>
 <body>I'm just passing by. For some reason, "looking into the void" scares me, so please glare between their eyes when you speak. m(__)m</body>
 <timestamp>1231497940</timestamp>
 </comment>
 <comment>
 <username>jj1bdx</username>
 <body>Autism-Spectrum Quotient は私も閾値以上でしたねえ．</body>
 <timestamp>1231557027</timestamp>
 </comment>
 <comment>
 <username>hykw</username>
 <body>Hoa. I was 34 and just barely fell out of bounds. w</body>
 <timestamp>1231638260</timestamp>
 </comment>
 <comment>
 <username>RRD</username>
 <body>"There are quite a few times when you say what day of the week it is, and what day of the week it is not."<br>The Autism-Spectrum Quotient was 28. </body>
 <timestamp>1231726278</timestamp>
 </comment>
 <comment>
 <username>nekomissile</username>
 <body>I'm just passing through. <BR>"I get confused when things happen that I didn't expect."<BR>"Why are you such a stranger when it's about you? <br>"I've had it pointed out to me."<br>"Instead of being able to do what others can't do, I can't do what others can do."<br>"I like playing with words."<br>I wonder if there is such a thing. </body>
 <timestamp>1232956974</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-01-09 https://nishiohirokazu.hatenadiary.org/archive/2009/01/09]