Hatena2009-06-06
code:hatena
 <body>
 *1244233945* Talk about a bad copy and paste.
 I had completed the Python version and was copying and pasting it into the C++ version when a bug was discovered, and of course it was not fixed in the Python version even though I fixed it in the C++ version, and the test started to rubbish, so I started to use etc.
 
 
 You make those policy mistakes because you don't sleep properly.
 
 
 Let's give up and throw away the C++ version and modify the Python version "so that it can also spit out C++ code with a single option".
 
 **1244272999* I received the artwork I bid on.
 If I told you that I won an artwork at an auction, you might think that I spent a great deal of money, but it was only 2,000 yen. It is not so expensive to buy the experience of winning a bid. But the mailing cost was more than the price of the artwork! So, the total bid was 5,000 yen.
 
 I was imagining about A3, and I got a box about A1.
 
 f:id:nishiohirokazu:20090606162426j:image
 
 It was huge. I thought, "Oh, did I order some furniture?"
 This is what it looks like inside.
 
 f:id:nishiohirokazu:20090606162511j:image
 
 There was a piece of work that was wrapped in corrugated paper, with a piece of cardboard inside that was double-layered with hard corrugated paper, and sandwiched between the corrugated paper was a piece of work wrapped in white paper and attached with a large piece of tape to hold the bandage in place. It was wrapped in white paper, and the work was attached with a large piece of bandage tape.
 
 f:id:nishiohirokazu:20090606163403j:image
 
 I was mainly interested in how the edition numbers and signatures were written on the edition pieces. It's a pencil, right? I wonder if a pencil is enough. I wonder if they can be erased with an eraser.
 
 
 
 It arrived in a tight package, so I thought, "How am I going to display it? We don't have such a big picture frame. But I thought calmly that 5,000 yen was more expensive than the PRML (6,500 yen) on the bookshelf, so I added it to my collection zone in the corner of my room without worrying about it.
 
 f:id:nishiohirokazu:20090606164350j:image
 
 I was expecting to see a flimsy silkscreened print like those often sold in the market, but instead I found that the print was very bumpy! I wondered if this is what mixed-media printmaking is all about. The gold pigment is raised, which is quite interesting.
 
 *1244281109* Visited Tomio Koyama Gallery in Kiyosumi-Shirakawa
 <a href='http://www.tomiokoyamagallery.com/'>Tomio Koyama Gallery</a>
 
 The location was very confusing. I had heard it was a warehouse, but it was totally a warehouse. Not a "reused warehouse building" or anything like that, but a normal warehouse. The entrance is in a small corner. The elevator was a big freight elevator, and it said, "It doesn't close automatically. Please push the "close" button for other people when you get off.
 f:id:nishiohirokazu:20090606183821j:image
 
 After getting to the gas station on Triangle, I got lost, saying that it was around here on the map. Across the street from the entrance is this. Across the street from the gas station, on the cab company's lot, in front of the entrance is this factory.
 f:id:nishiohirokazu:20090606184952j:image
 
 There were two other women wandering around with me. When I was about to leave, they came to me. Good night.
 
 Despite the fact that it is such a difficult place to find, there were quite a few people there.
 
 *1244286175*Painting of the Day
 I was steaming with a steaming towel because my eyes were tired, and I suddenly had an idea <del>A silver-white ratio rectangle</del> If you put a perpendicular line down from the remaining vertices to the diagonal of an A4 paper, it's trisecting. I'm sure everyone can figure out for themselves why that's so. (PS: I made the ratio 1 + sqrt(2) in concrete paper so as not to mislead people.)
 <img src="http://gyazo.com/a3b95b3dd5722077deaa5148f86e124a.png">
 I have a feeling that the silver/white ratio is more interesting than the golden ratio. With the golden ratio, you can see the golden ratio everywhere, but with the silver/white ratio, you can see the incidental ratios and they are interesting.
 
 <hr>
 
 Anyway, I cut it out again with a gradient like <a href="http://d.hatena.ne.jp/nishiohirokazu/20090530/1243671595">the last time</a>.
 <img src="http://gyazo.com/0c7d82397b42934f456be24dc7f4b12e.png">
 That's a little short. I'd like to see a few more "how the value here matches the value here!" I'd like to see a few more "how the value here matches the value here! Maybe a way to divide the line segment into 1:sqrt(2), or a way to beautifully show that it is divided.
 
 <hr>
 
 By the way, the SVG path specification was easier to use than I had imagined. I will draw something using this next time.
 
 <hr>
 
 <img src="http://gyazo.com/8f84726e80e416cbea6abb079708c64b.png">
 Hmm.
 
 <img src="http://gyazo.com/b4128f072694d1d513f8f998e8d9f643.png">
 Due to handwriting and arithmetical errors, the parts that should match exactly don't match exactly (^^;)
 When I'm done with animal chess, I'll put yesterday to draw gradient circles and paths in mysvglib.
 </body>

[Hatena Diary 2009-06-06 https://nishiohirokazu.hatenadiary.org/archive/2009/06/06]