Hatena2008-07-27
code:hatena
 <body>
 *1217123904*TOEIC
 I can't find my iPod with the audio files for TOEIC listening practice at all, where did they go? Did I leave it at work?
 
 *1217138832* and done.
 f:id:nishiohirokazu:20080727150709j:image
 
 The venue is the purple building over there.
 f:id:nishiohirokazu:20080727150911j:image
 
 I'm not sure if it's something to do with the light, but the photo above doesn't quite convey what I wanted to convey. The real thing is more pink, more purple, and the interior is yellow.
 
 It was going to rain, so I came home soon. As for my grades, I'll be waiting for the results to come back mysteriously. I think I did relatively well in allocating my time. Aside from the fact that I started to get upset as early as the second question of the Conversational Listening section. I realized about halfway through that I should have just marked the question instead of filling in the mark and tried to spend more time reading the next question, and I think I spent more time reading ahead than I had done before.
 Also, I have a weak short-term memory, so when I'm listening to a sentence and I think, "Oh, the second answer is A!" I also have a weak short-term memory, so even if I think, "Oh, the second answer is A," it takes up a lot of brain resources if I try to remember it. So, I decided to use my left hand. Since there were three questions, I would hold what I thought were the answers with my left thumb, index finger, and middle finger, and check the answers on the answer sheet after the conversational text was finished. If it works well, I can check all three on the mark sheet at the moment the conversational text ends and use the entire time spent reading the question text to read the next question ahead of time.
 
 I marked all the checked answers together after the listening section was over, but when I finished marking 60 questions (because I introduced the method above in the middle of the section), I looked at the clock and saw that more than 1 minute had passed, so it must have taken more than 1 second per mark. It's too much of a waste to spend this kind of time during the listening section.
 
 In the reading section, considering the results of the pre-test practice test, I suddenly started with part 7 of the long reading section; of the 100 questions and 75 minutes I have, I have solved 48 questions of part 7 and have 32 minutes left. I had 32 minutes remaining, which was quite a push. I calculated that I would have to solve the remaining questions in 37 seconds. Of course, I couldn't do that kind of calculation on the spot, but I was a little impatient and started to solve the short sentences. But since the choice is only one word and the sentences are short, I gradually started to relax from this point on. And the early questions are easy. When part 5 is finished and there are 12 questions left in part 6, I have 10 minutes left. It may seem like a waste to have 5 minutes left over, but on the other hand, it is also a reasonable margin because without this 5 minutes, I would be in a great hurry and make unnecessary mistakes. So I have no complaints about time control. All I have to do now is to wait for the results.
 
 
 But I'm still worried about listening.
 
 *1217171759* Google Code Jam is over.
 Geez, I was so buoyant after TOEIC that I forgot to join! Unsuccessful!
 </body>

[Hatena Diary 2008-07-27 https://nishiohirokazu.hatenadiary.org/archive/2008/07/27]