Hatena2011-03-02
code:hatena
 <body>
 *1299063229* mind map diary 9
 Yesterday I ran out of energy just putting up pictures. I don't want there to be any misunderstanding that I always write those mysterious symbols all over the place, so I'll give an example of how information that is completely unorganized in the brain is mapped out.
 
 The reason why I don't usually post them is because I don't think it would be interesting to see them. I don't even have any pictures.
 
 The constraint of having to draw a picture is useful to concretize concepts that we think we know but are actually vague, such as productivity, for example. But there is no way to draw a picture for a concept that is not yet understood in the first place. The reason why mathematical formulas are drawn in a general notation is because we don't know how to chew them up yet.
 
 f:id:nishiohirokazu:20110302193736j:image
 
 
 A photo I forgot to post yesterday. The notation on block matrices has been chewed up pretty good. Proof drawn on the train.
 
 f:id:nishiohirokazu:20110301132714j:image
 
 This was running in the wrong direction along the way, so I'll include a clean copy. I'll try to clean it up with formulas when I get home.
 
 f:id:nishiohirokazu:20110301133317j:image
 
 <hr>
 
 [tex:(A+BDC)^{-1} = A^{-1} - A^{-1}B(D^{-1}+CA^{-1}B)^{-1}CA^{-1} (eq. 1)]
 Proof. First multiply A+BDC from the left.
 [tex:I + BDCA^{-1} - (A+BDC)A^{-1}B(D^{-1}+CA^{-1}B)^{-1}CA^{-1} (eq. 2)]
 We will focus on this third term. We want to eliminate the part of the inverse matrix. First, we put the part of A^{-1}B in front of the inverse matrix in the previous parentheses.
 [tex:(B+BDCA^{-1}B)(D^{-1}+CA^{-1}B)^{-1}CA^{-1} (eq. 3)]
 Notice that there is an element in common, CA^{-1}B, with the inverse part you want to eliminate. Transform B into BDD^{-1}.
 [tex:(BDD^{-1}+BDCA^{-1}B)(D^{-1}+CA^{-1}B)^{-1}CA^{-1} (eq. 4)]
 and this BD, the rest is just the same form as the inverse part
 [tex:BD(D^{-1}+CA^{-1}B)(D^{-1}+CA^{-1}B)^{-1}CA^{-1} (eq. 4.1)]
 So the reverse queue disappears without incident.
 [tex:BDCA^{-1} (eq. 5)]
 Now, reviewing eq. 2,
 [tex: eq.2 = I + BDCA^{-1} - BDCA^{-1} = I]
 Thus, eq. 1 is proved.
 
 I think it would be easier to notice "Oh, there are /□＼³'s in a row" if this "notice" part was drawn in pictures rather than written in mathematical formulas, what do you think?
 
 I think this is similar to the difference between those who can speed read and those who cannot. If you read "Sh-e-i-in-ba-su-bee," it is large in size and easily overflows from the temporary memory of the brain, but if you read "(/+/■＼□/)(■+＼□/)," you have a similar structure as you can see, right?
 </body>

[Hatena Diary 2011-03-02 https://nishiohirokazu.hatenadiary.org/archive/2011/03/02]