Hatena2010-10-05
code:hatena
 <body>
 *1286241699*Conclusion of the cryptography test
 http://homepage1.nifty.com/herumi/diary/1010.html#4
 >>
 >The Hyakunin Isshu is based on the "poem textile" theory of "Teika's cipher," and the "Chinese numerals" are waved horizontally and "iroha" vertically in its arrangement.
 What the heck is that song textile? Is it a connection between "noki-" in "kuukenba" and "noki-" in "hisakata no hikari no nodokeki" in the upper right corner of the list of matching words? In addition, "mikakimori" and "tanuki" are placed next to each other. Don't use such a demo-like thing for the sign table. Didn't anyone from the Association for Intellectual Property Education object to it?
 <<
 
 
 特別能力検定・第１回暗号検定-知的財産教育協会
 http://ip-edu.org/angoukentei
 >>
  In the first place, a cipher is merely an encryption by conversion based on certain "conversion rules," and those "rules" need only be mutually understandable by the encryptor and the decryptor, and the "truth" of the "content" of those conversion rules does not matter at all. Therefore, whether the assertion of this theory is correct or incorrect does not need to be considered in solving this "cipher.
 <<
 
 
 It seems that the problem was to return a 7-letter sentence from only the encrypted one to the original one, on the assumption that a 100-to-100 mapping table, such as a song weave, was shared between the person who encrypted it in the first place and the original recipient of it, and that the third party who intercepts and decrypts the ciphertext does not know this mapping. ...
 
 It has been experimentally confirmed that even if the algorithm is naive to begin with, if the shared dictionary is large enough (in this case, larger than the ciphertext!), it is difficult to decipher even a short ciphertext leak. ), it is experimentally confirmed that it is difficult to decipher even a short ciphertext leak. Congratulations.
 
 *1286270906*Review of JS prototypes.
 >|javascript|
 function Foo(){
 }
 var x = {};
 Foo.prototype = x;
 var y = new Foo();
 console.log(y); # Object { }
 console.log(x == y); # false
 console.log(x === y); # false
 console.log(x === y.__proto__); # true
 ||<
 
 Hey, is == false between empty objects? It's not what I expected. Oh well, that's not the important point.
 
 *1286276938*Kindle DX
 id:TOKOROTENが<a href="http://www.amazon.com/gp/product/B002GYWHSQ?ie=UTF8&tag=a0478-20&linkCode=as2&camp=1789&creative=390957&creativeASIN=B002GYWHSQ">Kindle DX</a>を買うらしい。
 
 *1286287943* Census Internet Response
 I thought I couldn't find the method by googling, but the postcard in the envelope said something like, "Please do not use search sites.
 
 Oh, great, the census internet responses, Safari and Firefox are also supported, I realized after I wrote that that's the way it should be. I mean, it's a national site, and IE only or something like that would be weird.
 
 Enter the 6-character alphanumeric survey subject ID and the 6-digit confirmation code from the postcard. First, you will be asked to change the confirmation code. Hoho. The confirmation code requires a mixture of alphanumeric and numeric characters.
 
 Oh, I thought it was NICE so far, but when I clicked on Help for something I didn't understand, it opened in a separate tab and changed the window size and position on its own. Nice try.
 
 I finished. The first two pages were confusing, but the rest was easy. It was a good application. GJ Oki Electric!
 
 *1286293947*ASIAGRAPH講評
 Oh, the critique was attached to the list of excellent works of ASIAGRAPH before I knew it. I hadn't noticed that until now.
 
 http://www.asiagraph.jp/public/index.html 
 >>
 Tadao Shibata Tadao Editor-in-Chief, Nikkan Digital Creators
 
 Once again, we received a large number and variety of works, but the difference in the excellence of the works was so great that it was easy to select the winning entries in each category. In the following process, we selected works that clearly showed the intent of the artist's creation. In this respect, the Japanese artists whose works had been described by their creators in the first category had an advantage. For example, I also appreciated the excellent commentary on Yasukazu Nishio's work. I have long believed that an artist must be able to present his or her work not only visually, but also verbally. However, I evaluated the works of Minoru Sugiyama, Fumitake Suzuki, and Yuta Onoda based on the power of their visuals, even without such ability. This is not consistent with my argument. I am at a loss.
 <<
 
 I will make an effort to present in English as well!
 </body>
 <comments>
 <comment>
 <username>yukoba</username>
 <body>I think the latest Kindle 3 is better than the 2nd generation Kindle DX. I guess that's the wrong person to say that. </body>
 <timestamp>1286357715</timestamp>
 </comment>
 </comments>

[Hatena Diary 2010-10-05 https://nishiohirokazu.hatenadiary.org/archive/2010/10/05]