Hatena2007-10-06
code:hatena
 <body>
 *1191655923* Was Hatena Diary a SNS?
 
 id:jbking (like this? I don't know ><) is
 
 >>
 id:nishiohirokazu(You can now send id trackbacks!)
 <<
 
 I thought it was like @hogehoge on twitter when I saw that he wrote
 Hatena Diary may have come first, though.
 I had been aware of Hatena Diary as a "blog hosting service," but it is actually a social networking service.
 
 http://d.hatena.ne.jp/Voluntas/20071003/1191379852
 If I write this, they'll send me a trackback, right?
 
 *1191656724* java.util.concurrent.Exchanger
 
 http://d.hatena.ne.jp/jbking/20071005/p1#c
 I looked it up because it was written in the
 
 http://java.sun.com/j2se/1.5.0/docs/api/java/util/concurrent/Exchanger.html
 
 Comments.
 >>
 What kind of "thread + java.util.concurrent.Exchanger" is easier to understand than the generator that comes up just by changing "return" to "yield" in a function or changing "[]" to "()" in list comprehensions? I can't find any Japanese pages when I search for it.
 <<
 What it said, but there is a sample in Javadoc that comes up at the top of a google search for the entire web. It's not in Japanese, though.
 I also think that "easy to understand when others see it" and "short (seemingly simple) to write thanks to the syntax sugar provided" are two completely different things, and I can only think of it as a design error to return a value when yield has a return-like syntax.
 
 *1191657939*simutrans
 
 I wrote the other day that "Urban Net" is interesting, but simutrans is very specific and interesting.
 You should read this site in the order in which I did it.
 http://440hz.seesaa.net/category/3298011-1.html
 
 This is interesting too.
 http://simut.seesaa.net/
 
 Also, although it's not mentioned in the tutorial, you can put enemy AI in the "game options",
 Maybe it would be good to include the enemy and see what they do.
 
 The mac mini at home has been neglected for a long time because of what it ended up being,
 All I have to do when I get home is go online and play games.
 Because the internet and games are not connected to the mac.
 So I decided to install simutrans.
 
 map
 http://www.japanese.simutrans.com/index.php?%A5%DE%A5%C3%A5%D7
 
 Meishin area"? I was searching for Kinki or something. I couldn't find it.
 
 *1191689674* from cell phone
 
 I had a big bowl of negi-tama pork bowl with pork miso soup and salad set at Sukiya.
 </body>
 <comments>
 <comment>
 <username>Voluntas</username>
 <body>Sent. </body>
 <timestamp>1191675804</timestamp>
 </comment>
 </comments>

[Hatena Diary 2007-10-06 https://nishiohirokazu.hatenadiary.org/archive/2007/10/06]