Hatena2009-07-28
code:hatena
 <body>
 *1248743656*今日の電子工作
 Placing it on a breadboard is a different kind of puzzle than placing it on a universal substrate. We want to version physical electronic circuits.
 
 *1248774575*Evernoteに入れるPDFを物色中
 <a href='http://www.textdrop.net/doc/git-cheat-sheet-ja/'>Git Cheat Sheet 日本語版 | textdrop</a>
 <a href='http://www.textdrop.net/doc/mercurial-cheat-sheet-ja/'>Mercurial Cheat Sheet 日本語版 | textdrop</a>
 
 *1248796891*今日の電子工作2
 The amp + speaker circuit on a breadboard was taking up a lot of space, so I asked him to move it to a universal circuit board. I solved it like a puzzle on the train.
 
 The original circuit. Even the speaker is attached to the breadboard with double-sided tape, a waste of space.
 f:id:nishiohirokazu:20090729010241j:image f:id:nishiohirokazu:20090728104541j:image
 
 Looking at this picture, I solved the puzzle of how to arrange them in a compact way.
 f:id:nishiohirokazu:20090729010425j:image
 
 Wow compact.
 f:id:nishiohirokazu:20090729014229j:image
 
 I still need to attach the input terminal, Vcc terminal, and GND terminal to this, but unless I made a big mistake, the holes are secured next to where they should be connected, so I just need to insert the wires and solder them. However, I missed buying the wires on Sunday, so that's on hold. I want to connect it to Vcc and GND on the breadboard and some other appropriate places to get sound! I want to make it sound like that.
 
 I was also thinking of separating the crystal oscillator + sound chip and making it into a module, but the wiring for the sound chip has already been ripped off due to lack of jumper cables, so I would have to look at the datasheet to rewire it, and since I probably won't be using the sound chip, I may as well just remove it and keep it. If I have a chance to meet id:inajob, I could give it to him and get half of the resistor instead, but after all, both of them are not so expensive, so it would be no different from buying one in Akihabara if I have to pay the train fare to go see him.
 </body>

[Hatena Diary 2009-07-28 https://nishiohirokazu.hatenadiary.org/archive/2009/07/28]