Hatena2009-08-28
code:hatena
 <body>
 *1251419764*D01HW then
 - day before yesterday
 -- "Carrier wave not found" (light blue flashing) at a window seat in a Saizeriya in Tokyo.
 --- I didn't think there was any reason the signal couldn't reach you, but I wondered if there was some kind of interference, something jarring or something.
 -- I can't connect at home! It says, "Equipment not found."
 -- I changed the cable and it fixed it.
 
 - yesterday evening
 -- Connected at home
 -- Can't connect at Saizeria (can't find carrier wave)
 -- Tired of Saizeria for 3 days in a row, I go to Akihabara -> I can't find a carrier wave around McDonald's in front of Yodobashi. That's ridiculous.
 -- I can't find the carrier wave at home. Can't get internet!
 
 - today
 -- I woke up to find that my e-mobile, which I had left connected to my PC, was now blinking green.
 -- Trying to connect. It goes all the way to "Authenticating" and then says "PPP negotiation failed."
 -- I unplugged the cable and plugged it back in and now I can connect.
 --- Hmmm. I tried to connect the old cable to the new one, but it keeps blinking green and says "device not found". This cable must be a broken signal wire.
 
 -- Get D02HW sold at a discount.
 -- I replaced the SIM card and it connected with no problem.
 -- I got a connection at the Saizeria.
 
 
 The fact that it connected without any problem at Saizeriya, it was still strongly suggested that "there was a hardware problem and it didn't work both times when I happened to come to Saizeriya.
 
 **1251424341*Pandemic
 Yesterday, I went to Akihabara and went into a game store and inadvertently bought a game...
 <a href="http://www.amazon.co.jp/gp/product/B002EVOC5M?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=B002EVOC5M">Pandemic Japanese Version</a><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as2&o=9&a=B002EVOC5M" width="1 " height="1" border="0" alt="" style="border:none !important; margin:0px !important;" />
 
 It was about 700 yen cheaper to buy it on Amazon orz
 
 Extended sets are also that much cheaper. <a href="http://www.amazon.co.jp/gp/product/B002EVOC6G?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=B002EVOC6G">Pandemic Expansion Set "Zettai" Japanese Edition</a><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as2&o=9&a=B002EVOC 6G" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" />
 
 I'll buy the expansion set on amazon...
 
 **1251429679* Overcoming the Reverse Closing Effect
 The "deadline effect" is the effect that "work gets done before the deadline," and in the recent <a href='http://d.hatena.ne.jp/nishiohirokazu/20090824/1251112946'>Discussion on Deadline Driven</a>, we discussed that one of the reasons for this may be the ability to have clear criteria for narrowing down tasks. The other day in <a href='_blank' mce_href='_blank'>Deadline Driven</a>, I mentioned that one of the reasons may be the ability to have clear criteria for
 
 The "reverse deadline effect" is "the effect that when a task with a deadline exists, tasks unrelated to that deadline become unworkable," which is essentially the flip side of the same phenomenon. However, when the task that becomes unworkable is one that should not be discarded, the feeling of "I have to do it" and the deadline effect become opposite vectors, and the little person in charge of planning in the brain begins to get confused.
 
 concrete example
 - A: We need to prepare for the presentation on the 31st.
 - B: I need to see someone today at 3pm.
 - B': I have to see someone else at 16:00.
 - C: I need to go to the bank and withdraw money before B
 - D: I need to transfer the rent while I'm at the bank in C.
 - E: Something on the TODO list says that I'm supposed to make payment for XX together with the rent payment at the end of this month, but where's the money transfer form for the payment?
 Roughly this many tasks later, I'm completely confused and A is out of my hands. Then I start tweeting while confused, and the time limit for B is getting closer and closer. If I don't do this, I'll end up throwing away task E. Writing things down in written form is very important to organize my thoughts, and what I need to do now is not to write this text, but to look for a money transfer form!
 
 <hr>
 
 There was. I think I spent a lot of time in a deadlock, even though it was a task that could have been completed in 6 minutes if the "task to be done" was properly clarified.
 
 In order to be at my destination at 15:00, I should get on the train at 14:15, and if it takes 15 minutes from the bank to the station, I should leave the bank at 14:00, and then I have to go to a convenience store. It's 12:40 now, so I think it's a little early to leave, but I don't think I have much time to work. I'll just go to the bank and make a quick transfer, then finish up C~E, and if it's too late to go to my destination at 3pm, I can work at the McDonald's in front of the station. Even if my e-mobile breaks down again, I can get wifi there.
 
 *1251453177* Electronic Work Diary: Made a table-top light
 Use a gooseneck cable with a broken signal wire. Input is 5V DC, so USB is OK.
 
 f:id:nishiohirokazu:20090828185039j:image
 
 Unfortunate notice. When I connect the eneloop mobile booster and darken the room, it visibly brightens and darkens visibly at a frequency that I can see (about 2Hz).
 
 Well, I'm glad I found out early on that it is that kind of power supply. I was thinking of using it for a battery for the EEG sensor. It's no good if it shakes in such a cycle.
 
 
 I was going to light up my desk from a distance, but I didn't have a cable to extend the USB cable, so I put it on my desk for now. I thought it would be better to put it on the desk as it is, so I found a white bag or something to diffuse the light...!
 f:id:nishiohirokazu:20090828191050j:image
 O'Reilly! And it's an owl.
 </body>

[Hatena Diary 2009-08-28 https://nishiohirokazu.hatenadiary.org/archive/2009/08/28]