Hatena2008-01-07
code:hatena
 <body>
 *1199669305* Shinagawa now
 
 Oh, you can't make it?
 
 *1199670411* at Tokyo Station
 
 He couldn't find the Marunouchi Line and got lost. I got on a train bound for Ikebukuro and ran out to get off the train.
 
 *1199676248*New Lab.
 I was in a hurry because I couldn't find the map that I had put in my bag and couldn't locate the new lab,
 
 Wikipedia already knew the location of the new lab! >http://ja.wikipedia.org/wiki/%E8%B5%A4%E5%9D%82%E3%83%84%E3%82%A4%E3%83%B3%E3%82%BF%E3%83%AF%E3%83%BC
 
 I mean, it's amazing that it even lists the companies that have occupied a particular building in the past.
 
 *1199684745*Customize MediaWiki sidebar
 -Customize sidebar - Othersight Document Wiki
 --http://document.othersight.jp/wiki/%E3%82%B5%E3%82%A4%E3%83%89%E3%83%90%E3%83%BC%E3%81%AE%E3%82%AB%E3%82%B9%E3%82%BF%E3%83%9E%E3%82%A4%E3%82%BA
 with reference to
 -1000speakers - how to write wiki
 --http://ja.doukaku.org/wiki/index.php/1000speakers
 Customized the sidebar of the
 I had to log in as a user with Sysop privileges, but I had forgotten my username and password. I guessed the password on a hunch.
 
 *1199692658* tomorrow
 Oh, I need to find out where to go and how to get there.
 
 *1199697396*Sequel to Tomorrow
 At any rate, I decided to leave home by 9:30 a.m. and go to Tokyo Station and say, "I want to go to Odawara.
 
 I thought I had a lot of sticky notes, but they are all missing and there is no place to write notes...
 
 *1199705205*1000 Speakers Project Chat
 http://www.lingr.com/room/1000speakers
 <del>Today, we had 3 people at the time of the largest gathering. </del>At 21:50, there were 8 people! The advertising power of the amachang blog is tremendous.
 
 The password is 1000speakers.
 
 *1199707691*[1000speakers]Followed on amachang side too!
 Conference for People Who Want to Speak, Revised: Details of the First Conference of the 1,000 Speakers Project - IT War Diary
 http://d.hatena.ne.jp/amachang/20080107/1199707365
 
 *1199710233*Seal on business card
 http://born1981.g.hatena.ne.jp/uzulla/20071219
 ↑upThis story
 
 http://born1981.g.hatena.ne.jp/uzulla/20071226
 >>
 Oh, by the way, no one was able to copy the technique (of course not).
 
 Should I have put a CC mark or something on it? I didn't even get a business model patent (wrong).
 <<
 
 Actually, I'm planning to put an org sticker on my company's business card, so it's a relief to know that it's not patented!
 
 No, it's not, they're made by the company, so it's normal for them to include it, but before they did, they made 100 copies with the new lab address, so...
 
 *1199712108*1000 speakers project chat
 I'm sorry to say that I'm just getting excited, but I have to go home and get ready for the conference tomorrow.
 I wonder if someone could compile a log on video streaming (CamTwist) and put it up on the Wiki (other help).
 
 *1199718495* Problems with the recruitment process for the 1000 speaker project and a bill to address them.
 I have just realized that those who were slow to respond to the first call and missed the deadline are likely to miss the second call as well.
 
 If we can assign unique IDs to each account on the wiki, then each time someone gets in line but overflows the limit, 1 point will be added to their account, and when 5 points are accumulated, a recruitment notice will be emailed 24 hours before the others. Of course, the number of points would be reset to zero when a participant joins.
 </body>
 <comments>
 <comment>
 <username>Yoshiori</username>
 <body>Wouldn't it be better to write here that you'd be happy to throw up RSS? </body>
 <timestamp>1199688264</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I'm not sure how to make it spit out RSS, so I'm going through it</body>.
 <timestamp>1199691624</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>http://wiki.case.edu/Special:WikiFeeds<br>This one maybe</body>.
 <timestamp>1199692224</timestamp>
 </comment>
 <comment>
 <username>TOKOROTEN</username>
 <body>Me and Oshima-san are talking about taking the Romance Car! I'm talking about it. </body>.
 <timestamp>1199694992</timestamp>
 </comment>
 <comment>
 <username>earth2001y</username>
 <body>I will take the Shinkansen to Odawara, arrive at Odawara at 11:02 and climb the mountain while getting lunch. </body><body>I will be in the venue by 12:30.
 <timestamp>1199695707</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>At least we know our destination is not Nagano</body>.
 <timestamp>1199697087</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>It's hard to tell when you go to the update history page, but there are links to RSS and Atom in the sidebar</body>.
 <timestamp>1199706104</timestamp>
 </comment>
 <comment>
 <username>TOKOROTEN</username>
 <body>What's that, Comiket application</body>?
 <timestamp>1199740065</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Is this the kind of system they use at Comiket too? I thought it was a simple lottery. </body>
 <timestamp>1199748404</timestamp>
 </comment>
 <comment>
 <username>amachang</username>
 <body>Hmmm</body>.
 <timestamp>1200378103</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-01-07 https://nishiohirokazu.hatenadiary.org/archive/2008/01/07]