Hatena2011-02-15
code:hatena
 <body>
 *1297773254* mind map diary 2
 The difficult questions on the first day were "Draw a picture of productivity" and "Draw a picture of the right brain," but when I started using them for practical problems, they were already "Draw a picture of Gaussian distribution," "Draw an inverse matrix," "Draw a transpose matrix,"...
 
 And since both transposition and inversion return to their original state after two operations, I decided to use the symmetry to express them. Also, since there are cases where you want to take the inverse of the sum of multiple matrices, I defined normal parentheses = gray circles and inverse matrix parentheses = purple circles.
 
 f:id:nishiohirokazu:20110215213249j:image
 
 f:id:nishiohirokazu:20110215213309j:image
 
 It's not interesting to see the process of transforming formulas and such, but just making it colorful is kind of interesting. I'm starting to think about painting all my textbooks pink (lol).
 
 I noticed (it's hard to express in words) that [blue-white] and [blue-white] cannot be lined up as [blue-white] and [blue-white] and [blue-white][red][blue-white], and [blue-white][orange][white-blue][red][white-blue] are allowed to be adjacent to [blue-white][red][white-blue], but not [blue-white][red][white-blue]. The reason why such a pictorial restriction comes into play is that red and orange are square matrices of different sizes, and there is a rule that allows matrix addition and multiplication. That means that right now we are treating each as a separate matrix (represented by squares of the same shape), but we can change the pattern to one that expresses more "it only sticks here". They are incompatible types.
 
 f:id:nishiohirokazu:20110215221618j:image
 
 Also, grammatically [blue-white][white-blue] should be OK, but the fact that it doesn't appear once in so many expressions (which is nice to know right away) means it's a nashi. It's like "climb the valley" is OK grammatically, but nashi for practical use.
 
 I didn't even get the transposition in the assumption for the equation transformation (I defined it as a light blue circle, but never used it), there are about four writing errors (I corrected them with light blue that I didn't use), the flow is twisted and pushed into corners because I couldn't predict how much it would be at first, and there are a few other things I'm not sure about here. I'd like to clean it up when I do the review.
 
 f:id:nishiohirokazu:20110215223134j:image
 
 The mind map about the Gaussian distribution was about what I think is important about the Gaussian distribution, but it turns out that I missed the important part in a spectacular way...
 
 f:id:nishiohirokazu:20110215233343j:image
 
 Let's extend this branch tomorrow.
 
 f:id:nishiohirokazu:20110215233431j:image
 </body>

[Hatena Diary 2011-02-15 https://nishiohirokazu.hatenadiary.org/archive/2011/02/15]