Hatena2009-01-06
code:hatena
 <body>
 *1231224026* Groceries should not be put in stacks.
 >>
 What is a stack: A type of data structure characterized by the fact that the last data entered is output first. It is structured like a stack of books on a desk, with new data added at the top when data is entered and new data at the top when data is output, with the new data at the top having priority ...
 <<
 http://e-words.jp/w/E382B9E382BFE38383E382AF.html 
 
 In short, I was just sorting through my grocery box and found a retort with an expiration date of 2007 at the bottom.
 
 From an information engineering standpoint, a queue should be used for this kind of thing, so I am thinking about how to physically realize a queue. How about making the box shallow, eliminating the bottom axis, putting in new items from the back end, and looking for something from the front when you want to take it out?
 
 -----
 
 Quick correction. It's not right to queue opened furikake and unopened retort together. The opened ones should be queued as opened. Also, at least furikake has the clear advantage of being queued. I always take it from the top at random, so if the seasoned sesame seeds are at the top, all I get are sesame rice balls. The fish furikake comes from the bottom. This area should be rotated, and a stack that is wide in depth is not suitable for rotation.
 
 -----
 
 id:showyou
 >>
 You could make it a long tube shape and put it in from the top and take it out from the bottom. Just like a gashapon.
 <<
 
 That's how it behaves as a queue, but it's not searchable >.
 This is good if the objects in the queue are homogeneous and not picky. It seems to be done rather like using a stocking as an onion container.
 
 *1231236191*[housework] shopping
 I decided to keep a household budget regarding food since it was a good break in the new year.
 
 -Dashi Kelp 500
 -Yogurt 160
 -Apple juice 100
 -Milk 170
 -Pork chops 300
 -Chicken 160g 210
 -Radish 100
 -Carrots 25
 -Chinese cabbage/4 78
 -Green onion*2 100
 -Enoki mushroom 100g 100
 -Bean sprouts 200g 30
 -Total: 1856 yen
 
 I bought kombu (kelp) because it is expensive to buy nabe stock (about 250 yen) every time I make nabe. 100g is included, but I wonder how much I should put in. I put in the amount I thought would be enough for now, and it was 4g.
 
 Let's freeze half of the motsu and chicken.
 
 I found some leftover Chinese cabbage from last year's nabe in the fridge, so I put it in. I also added 1/4 of Chinese cabbage, so the quantity is too much. I'll put the bean sprouts for tomorrow. I should have used 1/8 of Chinese cabbage.
 
 -----
 
 The daikon radish is too big to be cooked easily, so I take a bit of Chinese cabbage from the top, sprinkle salt on it and eat it. Pieng Lo style. I just googled "pien lo" and realized that it is strange that there is no sesame oil in it. The flavor changed a lot when I added sesame oil, and it tasted even better.
 
 I think it might be easiest to buy dried shiitake mushrooms and make pien lo. I like Chinese cabbage. I don't like meat.
 
 -----
 
 I was thinking that the daikon was not cooked very well, but I realized that "daikon cooked through" was defined in my brain as "daikon surface stained with color" because all the nabe I had made so far had colored broth, and the white broth would not cook through forever. You're already ready to eat.
 
 -----
 
 I added half a cup of rice and ate it. It was not salty enough, so I added salt. Maybe I should have added concentrated tsuyu (soy sauce)? Whatever it was, it was delicious.
 
 -----
 
 Food for dinner today
 - Kelp 4g 20
 - Half a cup of rice 50
 -Pork chops 150
 -Chicken 105
 -Radish 30
 -Carrots 25
 -Chinese cabbage/4 78
 -Green onion 50
 -Enoki mushroom 100g 100
 -Total: 610 yen
 
 It costs a lot more than I thought it would. Well, there are not many dishes where you can eat a quarter of Chinese cabbage for 610 yen, so I guess it is inevitable for the sake of health. Enoki mushrooms are expensive. If I move the chicken and enoki out of the way, it costs 410 yen. Well, if I cut down too much and reduce the variety of my meals, my nutrition will be unbalanced, so I should not tune it too much. And I have to make variations of dishes other than nabe.
 
 -----
 
 That's right. The savings effect of cooking by oneself will be heard in the breakfast rather than the dinner. The cost of two rice balls and tea from a convenience store costs less than 400 yen, but it can be replaced by 50 yen for the leftover half cup of rice you just cooked, plus 50 yen for the tea you boiled yourself (how many yen?). The effect of replacing the cost with a half cup of rice left over from the rice cooker + tea (how many yen?) is very effective. With the money I save, I buy vegetables and eat them.
 
 *1231244393* Hatena's Trackback Filter
 I received another trackback spam from ja.nomatome.net. I thought I had put it on my rejection list before, but it was jp.nomatome.net that I had put on my rejection list. I wonder if this rejection list also rejects ja.nomatome.net if I specify nomatome.net. Or is it possible to specify *.nomatome.net? If either one is not possible, I can't deal with these annoying people who change subdomains while sending trackbacks. So I specified both.
 
 *1231249639* Habituation
 I read an entry on how to speed read English texts. And I realized that skills that require training cannot be acquired without continuity. It's like in a game where you have to learn the two-handed sword skill before you can learn the hard-hitting skill.
 
 So I once tried to learn the power of continuity. I once tried to circle a date on my calendar every day to learn the power of continuity. 3 months later, I said, "Oh, I haven't changed my calendar. What's with the circles?" He would imply, "Oh, I didn't change the calendar.
 
 I just realized that this is not practice at all. Let me rephrase it. Do something continuously every day in order to develop the skill of doing something continuously every day. That's blatantly wrong.
 
 I came up with a new continuity training system, but realized that it would be better to write it in code and release it as a service than to write it in text on a blog.
 </body>
 <comments>
 <comment>
 <username>showyou</username>
 <BODY>I think you can make it a long tube shape and put it in from the top and take it out from the bottom. Just like a gashapon. </body>
 <timestamp>1231227617</timestamp>
 </comment>
 <comment>
 <username>dmikurube</username>
 <body>If you want to implement queues naturally within physical constraints, you should use ring buffers. A Ferris wheel type or a baby spinning around on top of a baby type? </body>.
 <timestamp>1231230377</timestamp>
 </comment>
 <comment>
 <username>TOKOROTEN</username>
 <body>Does it have to be a queue? <BR>In essence, the purpose is to consume the product in a queue type implementation, even though the purpose is to consume it on time. <BR><BR>Is the light on? </body>
 <timestamp>1231251348</timestamp>
 </comment>
 <comment>
 <username>Kuro-hata</username>
 <BODY>Place all food items in plain view and label them with expiration dates. Don't put food out of sight unless it is for preservation. The manual book for living alone says. </body>.
 <timestamp>1231284881</timestamp>
 </comment>
 <comment>
 <username>tgbt</username>
 <body>Is it correct to expand horizontally like a bookshelf? </body>
 <timestamp>1231341004</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-01-06 https://nishiohirokazu.hatenadiary.org/archive/2009/01/06]