Hatena2009-08-02
code:hatena
 <body>
 *1249204986*MobsterWorld
 Today alone, I received 40 e-mails from people saying "MobsterWorld is here. I get direct messages with the same text all at the same time from people with whom I don't usually exchange messages.
 
 *1249205017*Electronics Today (Heart Rate Sensor)
 I connected the heart rate sensor to the code I wrote yesterday on the train and let it run.
 <img src="http://gyazo.com/1bf277a34ea3b29dbcc092b27340d610.png">
 The sample size is 1024 * 8 samples, or 90373 msec, which is enough to get such a clean result if you take this many samples. The peak to look for should be in the range of 90~180, assuming the heart rate is 60~120, which is sufficient. If you take a sample of about 5 seconds, it is difficult to extract 5 waves within that period. The heartbeat peaks also appear around 5~10, which is too coarse.
 
 
 Well, for now, let's try the one with a clean spectrum and one update every 90 seconds to actually display the heart rate.
 >||
 heartbeat:76.68257 @182310
 heartbeat:74.590195 @272690
 ||<
 I took the pulse by hand for about 30 seconds and it was about 38 times, so I guess I'm not wrong.
 
 <img src="http://gyazo.com/47378b70996875f231eba1266ae4b1ca.png">
 I reduced it to once every 45 seconds.
 >||
 heartbeat:73.04602 @91995
 heartbeat:79.63192 @137203
 heartbeat:73.03955 @182384
 heartbeat:73.03309 @227569
 ||<
 Hmmm. I'd like to test it by raising and lowering it. Maybe do some squats.
 
 I squatted and the cable disconnected and the program went haywire.
 
 Mwah, neither force quit nor kill -9 works on this one, what should I do?
 <img src="http://gyazo.com/82de0446211676474aa13a14fe1418ae.png">
 <img src="http://gyazo.com/f58e395a16f5a0b83019cda3a9ae1b1e.png">
 
 <hr>
 
 I rebooted. Now, when I move around, I can't get a good heartbeat with the noise. I might have to set it to 90 seconds after all.
 
 *1249236128* I'm starting to think that most of the problems can be solved by saying, "I guess there are some people in the world who say that.
 I had gone through "<a href='http://d.hatena.ne.jp/wasisan/20090725/p1'>[Memo] Not 'sane' things vs. 'sane' things</a>" via Sasada-san and went through it with "Well, there are some people in the world who say that, Today I read my entry "<a href='http://d.hatena.ne.jp/nishiohirokazu/20080202/1201921391'>[Haskell][Python] Make a list of delayed evaluations</a>" for the first time in a while and thought "This [. Python]" and then I looked at the code with all the defs and classes and wondered, "Who wrote that strike-out comment, 'It's hard to implement a lazy list in JavaScript without macros...'? It was very interesting to see that it was the same person.
 
 I guess some people in the world are like that.
 
 
 The problem may be that in a limited number of words, such as in Hatena comments or on Twitter, it is often difficult to distinguish between "that kind of person" and others. It's a shame that people who could send out useful information if they write long enough are often passed over as "that kind of person" with poorly-worded comments.
 
 I wonder what it is. I wonder if there is some kind of button-matching in the premise of communication.
 </body>

[Hatena Diary 2009-08-02 https://nishiohirokazu.hatenadiary.org/archive/2009/08/02]