Hatena2008-03-30
code:hatena
 <body>
 *1206859930*I woke up.
 I woke up at 1pm and ate a cobbler (560 kcal, 12.1g protein, 24.5g fat, 72.8g carbs, 405mg sodium). Ummm, greasy... Rather efficient if we limit our discussion to calorie intake only.
 
 I've been slacking on the idea.
 
 *1206861121*Calorie unit price
 I once got sick in high school by invoking the method of spending the money given to me for food by buying a bag of icing sugar and eating it, which led me to believe that I should not optimize my diet for per calorie unless I was really short of money and had no choice.
 
 *1206864500* On a station platform
 
 A boy who was told not to buy juice now because he would drink it when he arrived was frantically yelling "Densha koi", which was hilarious lol.
 
 *1206878059*password
 I was thinking that if I wrote a list of passwords in an email that did not include a "password" string and sent it to my gmail account, it would be safe enough that I would have to enter my gmail password first to check it, and then search for some other password that I could remember. I thought it would be safe enough, since I would have to enter my gmail password first and then search with some other password that I can remember.
 
 Then I realized it was a pain to add a new password and stopped.
 
 *1206886994*Python Code Reading
 Pytnon Code Reading &#8212; TRIVIAL TECHNOLOGIES 2.0 http://coreblog.org/ats/stuff/python-codereading/
 
 It looks really interesting, but I can't go because I will be attending the 86th generation development camp. I hope there will be a second meeting.
 
 *1206887360*UUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUUU
 The last chapter is not yet complete.
 I will miss the last train, so I go home.
 
 *1206895049*特異値分解
 http://ja.wikipedia.org/wiki/%E7%89%B9%E7%95%B0%E5%80%A4%E5%88%86%E8%A7%A3
 http://www.misojiro.t.u-tokyo.ac.jp/~murota/lect-kisosuri/singularvalue050129.pdf
 
 At any rate, I got to the point where singular value decomposition is useful when using the least square method. Also, a real unitary matrix is a direct matrix.
 
 http://www.cs.tsukuba.ac.jp/H16Syuron/200335283.pdf
 >>
 Chapter 4: Topic Detection Methods by Feature Axis6
 4.1 特異値分解
 4.2 Clustering
 4.3 独立成分分析
 <<
 
 http://www.dbsj.org/Japanese/DBSJLetters/vol3/no3/papers/ohuchi.pdf
 >>
 In general, a search on a set of text retrieves the main words, and then
 Processed based on a vector space model using these
 [1]. Text data has as many dimensions as there are words, and in general
 The data are high-dimensional, ranging from tens of thousands to hundreds of thousands of dimensions.
 //
 Singular Value Decomposition (SVD) is used to reduce the dimension of the search space
 The search results are then displayed on the screen. This allows a large reduction in dimensionality while maintaining search accuracy.
 Therefore, it is possible to achieve both search efficiency and search accuracy.
 It can be done.
 <<
 
 Hmmm...I see. I will read these two papers tomorrow.
 </body>
 <comments>
 <comment>
 <username>akihirox</username>
 <body>I miss singular value decomposition. I was working on the LSI method for my thesis, and I tried hard to implement it on my own, but it was too slow and unusable (I was just stupid enough to implement it on my own), so I picked up a library from somewhere. </body>.
 <timestamp>1206935827</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-03-30 https://nishiohirokazu.hatenadiary.org/archive/2008/03/30]