Hatena2009-02-03
code:hatena
 <body>
 *1233642867*Household
 - Go to buy Ebisumaki.
 - Take a stamp to a real estate agent.
 -- ■ Buy breakfast juice on the way home
 
 I'm hungry.
 
 I see that the last spaghetti code entry has over 10,000 page views. Surprised.
 
 *1233656632* How to prime factorize any prime number in an instant.
 Trigger:.
 >>
 NANKI Haruo: I'm selling an urn that will allow you to prime factorize any prime number in an instant.
 <<
 
 Create a survey on Livedoor and announce it on Twitter: <a href='http://lislog.livedoor.com/r/20964'>How to prime factorize any prime number in an instant - Livedoor Squirrel Log</a>.
 
 Result:.
 <img src="http://gyazo.com/45fea1245bbc123cdbc4ca2443091ea1.png">
 
 There are 23.7% who confidently say, "Impossible, wow," but if you are asked to prime factorize any prime number p, just reply p. The prime number p has already been prime factorized.
 
 <hr>
 
 There have been several comments that "prime numbers cannot be further decomposed." Then the definition of "decomposition" becomes important. According to Iwanami Dictionary of Mathematics, 3rd edition (p.469)
 >>
 180 C. Prime Factorization
 A positive integer a can be decomposed into a product of prime numbers. And there is only one result of the decomposition. ...
 <<
 
 The word "decompose" is not written in the text. The definition of the word "decompose" is not written, but "a positive integer a can be decomposed into a product of prime numbers" means that any prime number, even 1, can be decomposed into a product of prime numbers. In other words, I think we have to take it to mean "a prime number is decomposable into a product of 1 and 1 is decomposable into a product of 0 prime numbers". If you have a more reliable book that says, "No, it is wrong to interpret it that way!" Please contact us if you have any evidence to argue that this is the case.
 
 *1233689405*hotentry
 I am surprised when an entry that I don't expect to become a hotentry becomes a hotentry. Also, I guess most people don't even think to look up the background of the person commenting on someone else's entry. If you click on my name in the right sidebar, you can see that I have a PhD in science, and you can tell me that "1 is not a prime number"...
 
 Well, I don't like authoritarianism, so I'm not going to say "I'm a PhD, so I'm right" (in fact, I often make careless mistakes), but I don't think I can reasonably talk to someone who goes out of his way to look it up in a math dictionary and says "any positive integer can be decomposed into a product of prime numbers" and then brings up results from Wikipedia and Japanese dictionaries to force his own interpretation. I don't think I can have a rational conversation with someone who insists on his own interpretation of the result of Wikipedia or a Japanese dictionary.
 </body>
 <comments>
 <comment>
 <username>a</username>
 <body>From the conclusion, 1 is not a prime number. So the above proposition follows. Let's study more. </body>
 <timestamp>1233665313</timestamp>
 </comment>
 <comment>
 <username>idadi</username>
 <body>>The jar that makes it possible to prime factorize any prime number in an instant<br>What happens if you put in a non-prime number? That jar</body>.
 <timestamp>1233670309</timestamp>
 </comment>
 <comment>
 <username>MarriageTheorem</username>
 <body>>>idadi,<br>Why not just return what is put in (without regard to what it is)? <br>And it satisfies the specification that "if you put in a prime number, the result of prime factorization will be returned". </body>
 <timestamp>1233677619</timestamp>
 </comment>
 <comment>
 <username>test</username>
 <body>Mathematically speaking, it can be decomposed = factorized.
 <timestamp>1233711044</timestamp>
 </comment>
 <comment>
 <username>shivashanti</username>
 <body>Because it can be expressed as a product of one or more primes, "If someone asks you to prime factorize any prime number p, just reply p." Right? <br>And 1 is not a prime number, so you can ignore it.<br><br>But "1 is decomposed into a product of zero prime numbers" This is wrong. <br>It loses uniqueness. </body>
 <timestamp>1233712354</timestamp>
 </comment>
 <comment>
 <username>hajimehoshi</username>
 <body>> However, "1 is decomposed into a product of zero prime numbers" This is wrong. <br>> Uniqueness is lost. <br> Why? </body>
 <timestamp>1233715697</timestamp>
 </comment>
 <comment>
 <username>shou</username>
 <body>2^0 * 3^0 .... You want to say? </body>
 <timestamp>1233738290</timestamp>
 </comment>
 <comment>
 <username>wd0</username>
 <body>As a similar product, how about a pot that will allow you to sort any ascending column in an instant? </body>
 <timestamp>1233744367</timestamp>
 </comment>
 <comment>
 <username>Passing by</username
 <body>I don't think I can have a rational conversation with someone who, for whatever reason, hangs on to his authority and cannot make a logical counter-argument to a counter-argument. </body>
 <timestamp>1233760692</timestamp>
 </comment>
 <comment>
 <username>hyuki</username>
 <body>Tetra "Oh my God, there's a way to do that!" →2<br>Yuri "Yuri can do it too!
 <timestamp>1234267539</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-02-03 https://nishiohirokazu.hatenadiary.org/archive/2009/02/03]