Hatena2007-11-04
code:hatena
 <body>
 *1194158423* feeling relatively well
 But I think it's suicide to go out in a crowd. My face gets all hot just sitting on the bed and working.
 
 Let's refactor the room today. When we first moved in, there were several design errors that we did not notice in the spring. First, the desk is in a bad position to get a decent breeze from the air conditioner. Second, its placement near the window in the first place makes it unintentionally cold in the winter.
 
 Let's move the desk more inside. To do that, we need to run gc and then allocate a cohesive area.
 
 *1194162922*Konan
 I didn't know that Osaka is the home of "cornan". There weren't many in Tokyo.
 http://www.hc-kohnan.com/hc/tenpo/ten910_tokyo.html
 
 *1194169611*my desk
 I have legs made out of three hard containers from Konan, but the trap is that once the desk is cluttered, it becomes very cumbersome to remove the contents of the containers.
 http://www.kohnan-eshop.com/product_info.php/cPath/849_850_117/products_id/5463
 
 *1194170408* Considerations on room refactoring
 - If you look for something and find it somewhere other than where you first looked for it, then the first place you looked for it is where it should have been placed.
 -- However, if the first thing you look for is a desk top or side table, the "trying to put everything in a cache that essentially can't hold everything and is overflowing" syndrome.
 
 - The actions that we tend to do (like computers) should first make the cost of doing them higher. Computers now have to be crouched in an unnatural position to use them. If it's a TV or something else, you have to unplug it, or put the remote control in a closet.
 
 - The advantage of splitting up the module into smaller units is that it lowers the cost of change. With large modules, there is a lot to consider when making changes, which discourages motivation to change in the right direction. My desk is made of Daiso containers and wood planks, and each piece is designed to be easily movable, making it easy to move. The floor between the original placement and the new location is a mess, and if it were an integrated desk, I would have to clean up this area first.
 -- However, as mentioned earlier, it may be necessary to rethink the design as it is troublesome to remove items from the container during normal times.
 
 *1194171433* Move complete.
 
 The problem with the current desk is that clutter on the desk makes it difficult to retrieve the contents of the containers, and it is somewhat narrow in depth.
 
 - If you have a bunch of papers that you never accessed inside or a pile of stuff that you don't want, there is a very good chance that you don't need it. However, there may come a time when you need it (although it is very doubtful that you will be able to find it at that time). The physical world is not version controlled, so if you delete it, you cannot revert it. Pack it in an appropriate box and @deprecated just in case.
 </body>

[Hatena Diary 2007-11-04 https://nishiohirokazu.hatenadiary.org/archive/2007/11/04]