Hatena2009-08-03
code:hatena
 <body>
 *1249279556*MobsterWorld History repeats itself.
 Good commentary: <a href='http://www.machu.jp/diary/20090801.html#p01'>Twitter DM spam exploiting OAuth - Machu Diary (2009-08-01)</a>
 
 ITMedia's <a href='http://www.itmedia.co.jp/news/articles/0908/01/news011.html'>Spam DMs appear on Twitter, automatically sending DMs to followers - ITmedia News</a> writes, "Spam DMs appear on Twitter. However, there have been viruses that spoof the sender and pretend to be someone you know, as well as social networking sites that send invitations to your Gmail contacts. However, nothing has changed since there have been viruses that spoof the sender's e-mail address and pretend to know the sender, or social networking services that send invitations to Gmail contacts. After all, "clicking Allow on the authorization screen" is equivalent to "double-clicking a file sent as an attachment to an e-mail.
 
 - <a href='http://www.ipa.go.jp/security/virus/faq/klez_qa.html'>Information-technology Promotion Agency, Japan: Security Center: FAQ on W32/Klez</a>.
 - <a href='http://slashdot.jp/it/article.pl?sid=07/12/01/214255'>Beware of Invitations from Yaari.com - Slashdot Japan</a>.
 
 <hr>
 
 It occurred to me that this could have been designed to "not send multiple DMs to the same user". In my case, I received about 50 DMs, so I deleted them regardless of who they were from, but if I had received only one from an acquaintance, "It's funny: http://..... I might have clicked on it if it had been sent to me. Even if I hadn't clicked on it, I wouldn't have been convinced that it was spam or alerted to it on my blog like this by simply not clicking through.
 
 *1249284435* Twitter spam
 >>
 Just quit my job to work online! :] read more here: h ttp://googleboss.org
 <<
 
 And this one?
 
 PS: I chopped the http because it is not good if someone clicks on it without reading it properly because it becomes a link by itself.
 
 *1249289014*How to restore Firefox bookmarks when they are corrupted.
 There was a restore menu in this mysterious icon on the "Manage Bookmarks" screen.
 <img src="http://gyazo.com/76827c4d93fa6bcffd94a6280319cf02.png">
 </body>

[Hatena Diary 2009-08-03 https://nishiohirokazu.hatenadiary.org/archive/2009/08/03]