Hatena2009-11-05
code:hatena
 <body>
 **1257382843*Task Management Considerations
 Reprinting a twit I wrote on my iPhone in bed yesterday before it drifted away.
 
 ---
 
 There are many books out there on how to manage tasks and so on, but reading them does not make it possible. Just as teaching a child how to ride a spinning wheel will not suddenly make the child learn to ride a spinning wheel, it is necessary to think about how to make the child learn, not how to manage.
 
 I've heard a lot about how people grow as human beings when they have children, but maybe that's because they literally think about how to help them learn a skill they have no prerequisite knowledge of.
 
 >>
 @tokoroten I need task management software that allows me to re-split tasks.　I have TODOs of various granularities in one TODO list, so I can't prioritize them.　 If I can repartition the TODOs and make them primitive, then they can become automatons and the tasks will get done.
 <<
 
 I used to think "I want a task management tool that supports task breakdowns," but I think the essential mistake is that "people who don't have the skills to output the information in bullet points of the appropriate granularity for the management tool" are using "a restrictive editor that only allows bullet points. Now I use a regular text editor.
 
 Also, having only one task list is a mistake. If you write a list of things that need to be done today, including tasks that do not need to be done today but will be done someday, you will be distracted and unable to concentrate on the task.
 
 >>
 Ah, yes, there is that.　And the task to be done today is a pain in the ass, and the easy task to be done tomorrow is executed.
 <<
 
 If your ability to control your concentration is weak, when you receive a lot of information, you will become confused because you will not know which one to pay attention to. It is important to reduce the amount of information that enters your eyes.
 
 *1257399858* How to put affiliate links to iPhone apps
 I was checking for a while to see if it was true because there was a description that I should apply for Rakuten's LinkShare, but after all, I was sent to the LinkShare page even if I followed the link from Apple's official website, so I guess that's the way it is.
 <a href="http://click.linksynergy.com/fs-bin/stat?id=rQlYAmep4jU&offerid=7097.10000026&type=3&subid=0" >LinkShare Corporation</a><IMG border=0 width=1 height=1 src="http://ad.linksynergy.com/fs-bin/show?id=rQlYAmep4jU&bids=7097.10000026&type=3&subid=0" >
 
 When you have finished creating your LinkShare account and your home page in LinkShare appears, select the PROGRAM tab and search for iTunes in the Advertiser Search to find it. I can't create a link yet because I just applied and it hasn't been approved by Apple. I will try later and write more.
 
 <img src="http://gyazo.com/dcbd41420103d3c7ce85a6c784e6fd38.png">
 
 Clicking on the LINKS tab brings up a screen like this.
 
 <img src="http://gyazo.com/4cc26ee1fbd83b48530b32c5afc3d3a4.png">
 
 It seems that the program that introduces LinkShare is Active from the beginning, so I'm going to try this for now. When you select this advertiser, a screen appears where you can select a banner or text. Here is the banner I selected
 
 <img src="http://gyazo.com/ba992d299c62033f8a5e08679eee1aa1.png">
 
 Press "get link" to display the code to paste it into your blog, etc.
 
 <a href="http://click.linksynergy.com/fs-bin/stat?id=rQlYAmep4jU&offerid=7097.10000073&subid=0&type=4"><IMG border="0"   alt="LinkShare_234x60" src="http://ad.linksynergy.com/fs-bin/show?id=rQlYAmep4jU&bids=7097.10000073&subid=0&type=4&gridnum=3"></a>
 
 I was able to do it.
 
 <hr>
 
 Declined iTunes Affiliate Program.
 I applied at http://www.nishiohirokazu.org/, but apparently you couldn't get to http://www.nishiohirokazu.org/what_i_did/itheremin/. I was told that it was an unrelated page to iTunes. I decided to send an email to LinkShare, claiming that it was a misunderstanding that the page was unrelated to iTunes, since the LinkShare system seems to require two weeks to resubmit an application.
 </body>

[Hatena Diary 2009-11-05 https://nishiohirokazu.hatenadiary.org/archive/2009/11/05]