Hatena2009-07-07
code:hatena
 <body>
 *1246948011*A1 size Virtual Star
 A1 size prints arrived.
 I put it on the window because it was too big and there was no wall to put it on.
 
 http://twitpic.com/9kk7x
 
 The support material is polyester cloth, so it is rather easy to carry. You don't have to worry about creases and folds like you do with paper. So I'll carry it around from place to place.
 
 *1246951242* Playing with the iPhone's video capabilities
 I put it on YouTube.
 http://www.youtube.com/watch?v=kD2grh0_yoQ
 Mooo, it's dirty when you take a video of fractal things.
 
 
 By the way, the motion blur before this, I'm starting to think that after all, all I have to do is just take a monitor with a normal camera with a long exposure. w
 
 <hr>
 
 http://www.youtube.com/watch?v=HnNh9Ne12hc
 
 I put the camera horizontally on the bed, and it turned vertical.
 
 *1246966172* Down with the heat
 -1: Swollen tonsils (from sleeping with windows open because of the heat?)
 -2: I feel sick and very sluggish, let's go to bed
 -3: Sleep with a blanket over you so you don't get cold.
 -4: Wake up
 -5: Diarrhea won't stop
 -6: Goosebumps. Why?
 -7: Hoagy (I know, I know...) This is dehydration!)
 -8: There was tea in the fridge, so I drank it.
 -9: Falling into bed. I feel steam coming from my body.
 -10: It's cold. But if I put a blanket on now, I'm out for sure...
 -11: I noticed that it was pretty much settled.
 -12: Drink tea again. Make chicken ramen with more hot water and drink all of it, even the soup ← here and now
 
 I thought I shouldn't cool it down, but I covered it with a blanket and it made me dehydrated. I wish I could live in a cave where the temperature stays the same all year round.
 
 <hr>
 
 If sensors can be implanted in the body, maybe in my case they should be implanted with sensors that sound an alarm if my body temperature rises above a certain level. Several times a year I collapse from dehydration.
 
 *1246986490*Vasarely Hat-Leg
 http://203.158.253.5/wbi/Education/%E0%B8%AA%E0%B8%B8%E0%B8%99%E0%B8%97%E0%B8%A3%E0%B8%B5%E0%B8%A2%E0%B8%A8%E0%B8%B2%E0%B8%AA%E0%B8%95%E0%B8%A3%E0%B9%8C%20(Aesthetics)/unt4/pic/neo/Victor%20Vasarely%20Hat-Leg.jpg
 
 This is the wrong corner processing.... I wish I could fix it.
 </body>
 <comments>
 <comment>
 <username>flashingwind</username>
 <body>Oh. Cool. It is. </body>
 <timestamp>1246961039</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-07-07 https://nishiohirokazu.hatenadiary.org/archive/2009/07/07]