Hatena2010-06-10
code:hatena
 <body>
 *1276181321* Drucker's Leverage Memo for Post-Capitalist Society: what is an organization?
 Today's <a href="http://www.amazon.co.jp/gp/product/447800210X?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=447800210X">Leverage notes from Chapter 2, "The Coming of the Organizational Society," in Drucker's Famous Books 8: Post-Capitalist Society</a>.
 
 >>
 We are too specialized today. The academy is particularly bad. But the solution is not to teach liberal arts courses. That will not work. Experts only achieve results when they are experts. P.67
 <<
 
 >>
 An organization is a purpose-oriented institution. Organizations are tools. Like any other tool, an organization enhances its ability to carry out its purpose by specializing. P.71-72
 <<
 
 >>
 All 250 members of the orchestra are experts. All members of the orchestra play with the same sheet music. P.73
 <<
 An orchestra is a group of professionals with separate expertise, focused on a single purpose. An oboe player does not play the violin.
 
 >>
 Societies, communities, and families are sustaining institutions. They seek stability and seek to prevent change. In contrast, organizations in post-capitalist societies are institutions of change.
 
 The function of an organization is to apply knowledge to tools, processes, and products, to work, and to knowledge itself. Thus, organizations are constantly changing and innovating. Innovation is, as Schumpeter said, creative destruction.
 <<
 Incidentally, <a href='http://ja.wikipedia.org/wiki/%E3%83%A8%E3%83%BC%E3%82%BC%E3%83%95 %E3%83%BB%E3%82%B7%E3%83%A5%E3%83%B3%E3%83%9A%E3%83 BC%E3%82%BF%E3%83 %BC'>Joseph Schumpeter</a> is
 >>
 When an entrepreneur implements an innovation, the economy is disturbed, but the growing imbalance is the process of a boom. On the other hand, a recession was considered to be a process in which the economy as a whole responds to the new situation brought about by innovation by following the lead firms that have obtained monopoly profits, and the economy gradually returns to equilibrium due to credit contraction (repayment to banks).
 <<
 In other words, he says, "When an economy stabilizes without change, it is a recession. He said, "Humans are either progressing or regressing, there is no in-between. To think that the status quo is being maintained is actually evidence of regression." (Shinzo Mori) is one of my favorite quotes.
 
 >>
 Marx said that the greatest change that capitalism brought to society was the alienation of the working people. Workers did not have the means of production. They could only produce when they were loaned increasingly expensive opportunities by capitalists. P.86
 
 The relationship between employees as knowledge workers and the means of production is interdependent. Neither can function without the other. P.87
 <<
 Of course, knowledge workers here are not just "non-physical workers," but workers who have expertise that is irreplaceable.
 
 >>
 Historically, workers have been supervised. Knowledge workers, on the other hand, cannot be supervised. It is useless to have someone who knows more about your specialty than you do. P.87
 <<
 
 This is 34 of 277 pages, less than 20% of the total. That's about the price of two bottles of juice.
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=447800210X" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 *1276186682* Drucker's Post-Capitalism: leverage memo for Chapter 4, "Productivity".
 <a href="http://www.amazon.co.jp/gp/product/447800210X?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& CreativeASIN=447800210X">Leverage memo from Chapter 4, "Productivity," in Drucker's Famous Books 8: Post-Capitalist Society</a>.
 
 >>
 Huge numbers of service workers are engaged in jobs that require only relatively low skills and education. In an economy where the productivity of service workers is low, inflation will eventually drive down real incomes for all if wages are paid well above their productivity. And soon that inflation will cause serious social tensions. But if service workers are paid only in proportion to their productivity, the gap between their incomes and the incomes of better-off knowledge workers will have to widen. This divergence will cause equally serious social tensions. p. 107.
 <<
 So, I was reading today <a href="http://www.amazon.co.jp/gp/product/4478300623?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=4478300623">The Innovator's Condition&#8212;How to Create the Bonds of Society (First Read Drucker (Society Edition))</a> says
 >>
 Inflation or unemployment: Traditionally, unemployment has been seen as the most dangerous. In an aging society, inflation is the greatest threat to retirees who rely on pensions. Inflation is the greatest threat to retirees who rely on their pensions, while employees over 50 also fear a reduction in their future purchasing power. Together, these two generations already account for almost half of the adult population. Moreover, unemployment poses little threat to retirees and middle-aged workers. P.202-204
 <<
 So we cannot take the option of inflation. So the only options are to eliminate the minimum wage and pay low wages to those with low productivity or make them unemployed. This will widen the gap and bring about social tension.
 
 <b>So we must improve productivity! </b>
 
 >>
 Not all knowledge labor jobs and most service labor jobs are given. To improve productivity, we need to ask, "What should we expect from this work?" Answering this question requires risky decisions. And there is usually more than one option. Productivity cannot be improved unless the outcomes to be obtained are clearly defined. P.108
 <<
 
 >>
 There are three types of teams.
 1: Baseball type team. Players have fixed positions and defend their own positions. Baseball players have individual statistics.
 <<
 One man in the batter's box.
 >>
 2: A soccer orchestra type team. The positions are still fixed, and the tuba player does not play double bass. However, they work as a team.
 <<
 You can't just work hard on the tuba and make it louder.
 >>
 3: Doubles type team. No fixed positions, just have preferred positions. Run to cover each other's weaknesses as needed.
 <<
 
 >>
 Baseball-type teams get information from situations on their own. Soccer/orchestra-type teams get information from the coach or conductor. Doubles-type teams get it from other members.
 <<
 
 The classification of this area is not quite clear. P.108-112 above.
 
 >>
 Chores that do not contribute to results must be consciously eliminated. Eliminating chores is the best way to improve productivity. p.114
 For every activity, we must ask, "Is it the original job?", "Is it necessary for the original job?", "Is it useful for the original job?", and "Does it make the original job easier to do? If the answer is no, then it is a chore. It must be made a separate and independent task or eliminated. p.115
 <<
 I don't remember where it was written, but I read that outsourcing the cleaning, sheet washing, and paperwork that hospital nurses used to do somehow increased their productivity.
 
 >>
 Those that do the work know more about the work than anyone else. Improvements in work should begin with those that do the work. It is necessary to ask those who work to take responsibility for managing their own productivity. p.116
 <<
 
 >>
 Knowledge demands continuous learning from knowledge workers due to its constant change. It also demands continuous learning from service workers as a continuous self-improvement effort. Moreover, the best way to improve productivity is to let people teach. To improve productivity in a knowledge society, the organization itself must become both a learning and a teaching organization. p.118
 <<
 
 >>
 Organizational reforms to improve productivity should eliminate most of the management hierarchy. In an orchestra, there are often more than 100 musicians playing together. But there is only one management, or conductor. There will be a departure from the tradition of rewarding performance with promotions to middle management. Organizations will have few such positions in the future.
 <<
 This was rather eye-opening. Most people think that a "book on management" is a book on know-how for middle managers to survive. I thought so at first, too, and that's why I thought that Drucker's book on management was irrelevant to me. Then I told my friend that I did not want to do management and wondered if someone could manage me well, and he pointed out that "unless you learn management yourself, you cannot judge whether you are being managed well or not. I started to read the book. And I understood. <b>Drucker's Management is not a book for middle managers. He claims that middle management will disappear. </b
 
 >>
 Service labor becomes outsourced. Work that is outside the organization's value system cannot be promoted from that area to top management. Thus, no one in top management, no matter how costly, will have sufficient knowledge. Hospitals focus on patient care. Therefore, building maintenance and clerical work receive little attention, even if they account for half of the hospital's costs. P.120
 <<
 Outsource this to a maintenance company.
 >>
 Improving maintenance productivity is a primary concern for maintenance companies
 <<
 
 >>
 The rapid increase in the productivity of manual workers has banished the 19th century nightmare of class struggle. And the increase in the productivity of service workers will avert a new class struggle between knowledge workers and service workers. As long as service workers do not have sufficient income and dignity, post-capitalist society threatens to become a class society.
 <<
 As I mentioned briefly in <a href='http://d.hatena.ne.jp/nishiohirokazu/20100507/1273236672'>Drucker's Leverage Memo of Post-Capitalist Society Part I</a>, the composition of workers versus capitalists that Marx feared, With the advent of Taylor's scientific management method
 >>
 Assembly time for a single car body was reduced from 12.5 hours to just 2 hours and 40 minutes, and annual production exceeded 250,000 units, topping 1 million units by 1920. // In 1914, the company doubled the daily wage to $5 per day (equivalent to $103 in 2006 value) and reduced work shifts from a 9-hour day to an 8-hour day and 5-day work week---<a href='http://ja.wikipedia.org/wiki/%E3%83% 95%E3%82%A9%E3%83%BC%E3%83%89 %E3%83%BB%E3%83%A2%E3%83%BC%E3%82%BF%E3%83%BC'>Ford Motor - Wikipedia</a
 <<
 and collapse. I wrote in my earlier post <a href='http://d.hatena.ne.jp/nishiohirokazu/20100610/1276181321'>Drucker's leverage memo on post-capitalist society: what is organization</a>. What was initially "worker productivity <<< worker + machine productivity" became "worker + machine productivity << (worker + knowledge) + machine productivity" as a result of productivity gains from knowledge, resulting in an interdependent relationship between workers and machines with knowledge and not the class society that Marx predicted. In the same way, productivity improvement through the power of knowledge will be the trump card for a class society and a society of inequality that may emerge in the future.
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=447800210X" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 </body>

[Hatena Diary 2010-06-10 https://nishiohirokazu.hatenadiary.org/archive/2010/06/10]