Hatena2008-03-14
code:hatena
 <body>
 *1205469356*TDD
 http://www.atmarkit.co.jp/fdotnet/special/tdd/tdd_03.html
 >>
 Next, let's look at the test. Do you see the duplication here as well?
 
 Assertion.AssertEquals( 3, SampleClass.Plus(1,2) );
 Assertion.AssertEquals( 5, SampleClass.Plus(2,3) );
 
 　Here, the two cases are testing the same thing. Not long ago, the two cases showed different results. Now, however, they only show the same result. This is also a duplication, so we can remove one of them.
 <<
 
 Oh, really?
 
 *1205482400*something
 Tokoroten-kun's place is full of comments. I wonder if I did something wrong.
 But there are a lot of comments that are a mystery to me if I read and understood the text properly... I think it's good that you are strong enough to go through it.
 
 *1205487045* Let's take a bath!
 Yay...I finished checking chapters 6 and 7!
 Now all I need to do is check out the jythonc story in chapter 8 and complete the revisions in chapter 3 while calmly writing them down, even on paper... and I'm good to go!
 
 Let's take a bath and take a break!
 
 *1205516871*注意欠陥
 My eyes were itchy and I couldn't find my ibon, so I opened the top shelf of the sink, the bottom shelf, and looked in the bathroom and couldn't find it, so I thought, "Is it my imagination that I think I had some at home?" and got a new one, but it was in front of the sink (where I often put hand soap and such). Why I didn't notice it is a mystery to me.
 
 There is a difference between "in plain sight" and "noticed." When it is clearly in plain sight but you do not notice it, people tend to think that you are ignoring it even though you are aware of it, but this is a misunderstanding. If you say, "Tomorrow is garbage day, so I'll remember to take out the garbage," and put the garbage bag on the doorstep, the next day you will go out with the bag over your shoulder, thinking, "It's kind of hard to get out of the bag.
 </body>
 <comments>
 <comment>
 <username>emo</username>
 <BODY>When I just look here, it's not right. <br>As a white box test, I think it's OK. </body>
 <timestamp>1205476666</timestamp>
 </comment>
 <comment>
 <username>TOKOROTEN</username>
 <body>Well, that's okay, isn't it? <br>I laughed at dankogai or wrestling. </body>
 <timestamp>1205486649</timestamp>
 </comment>
 <comment>
 <username>kajuntk</username>
 <body>As usual, I thought dankongay was very, very unpopular. <br>But I also thought that if Tokoroten were not in the unexplored community, he would probably be an adult who writes a diary like that. </body>.
 <timestamp>1205616747</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-03-14 https://nishiohirokazu.hatenadiary.org/archive/2008/03/14]