Hatena2010-10-14
code:hatena
 <body>
 *1287070286* 40 Tips on How to Quell Anxiety Leverage Memo
 For a book sold in a convenience store, it was rather decent. The title "40 Tips" was probably forced on me by the editorial staff, and it didn't really give the impression that there were 40 tips, but it did explain what anxiety is, citing various references.
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=4569791247" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 <hr>
 People become anxious when their self-worth is threatened. They become anxious in situations of abandonment. People are anxious about being abandoned because we are all lonely.
 
 Humans differ greatly in terms of their ability to handle crisis situations when they encounter them."-Rolo May, "The Anthropology of Anxiety."
 
 So striving to improve that processing capacity is important for life.
 
 People who are frightened by anxiety avoid opportunities to test their abilities. There is no opportunity for creativity. They avoid it themselves.
 
 There are two types of anxiety: practical and neurotic. Unreasonable anxiety, fear, and agitation.
 
 When you are anxious, it is important to identify the cause of your anxiety.
 
 An attitude that focuses solely on results often robs life of its joy." Ellen Langer
 
 Karen Hornai lists three types of escape from anxiety: pandering, aggression, and withdrawal.
 
 If you pander to them, you lose yourself in your own value.
 
 Pandering is roughly defined as: 1: submissive, reserved 2: hard working, earnest, trying to excel 3: over-enthusiastic, cheerful
 
 Children have the fear of being abandoned by their parents. Hence, they play the good child. As a result, the child becomes anxious about life itself.
 The threat of "be good or I won't love you." To a child, it is indeed a threat. You, the adult, need not be frightened by it.
 
 Fromm-Reichman, "The Pathology of Human Relationships."
 
 Erich Fromm's idea. People become anxious when they lose their primary temporal bond and cannot gain a secondary bond. The primary temporal bond is the sense of oneness with the mother that existed before individuation. The process of individuation makes one physically and mentally stronger, but on the other hand, loneliness increases. The person loses a sense of his or her role and the meaning of life. Feelings of helplessness and meaninglessness increase. The impulse to throw away one's individuality and escape loneliness is therefore subjugation. Erich Fromm, "Escape from Freedom," p. 44~45
 
 Obedience does not solve problems.
 
 Obedience is not the same as obedience. An obedient person can communicate with others. Obedience is not communication by conforming to the other person.
 
 Those who pander want to be seen as nice. But in many cases, they are taken lightly.
 
 'You can't be happy because you make sacrifices' Tatarkevich
 
 Children raised by parents with strong neurotic tendencies perceive that their surroundings are forcing them to be obedient even as adults. Even though the other person is not demanding obedience.
 
 Why do we feel threatened by the world? It is because my parents expected me to be different from myself and I tried to live up to them. A basic sense of security that I am accepted by my parents just as I am. The insecurity that if you say "no," you will be discarded. The world is not a threat to you as an adult. The world is not a threat to you as an adult; you just feel threatened by it. Tell yourself, "I am not afraid of the world around me.
 
 Seriousness and work ethic are desirable. But for what purpose? Is it an escape from reality from insecurity or the pursuit of a goal?
 
 Good children are so earnest that they are hunted down to protect themselves from the fear of being abandoned.
 
 Fear of failure. What happens when we fail? Failure to meet people's expectations" This is highly stressful for obedient people who have lived by meeting people's expectations since childhood.
 
 Isn't a happy person one who looks like he or she is working hard from the side, even though he or she doesn't think he or she is working hard? Efforts motivated by love and efforts motivated by inferiority are completely different. It is the effort motivated by love that brings victory.
 
 When you work hard at a goal, don't work too hard. If you work too hard to maintain it, you will not achieve your goals.
 
 People who work hard because they are anxious are always tense and easily tired. People who have support in their hearts are not afraid of what is going on around them. Those without it are vulnerable to difficulties and changes.
 
 I don't know how to deal with people other than being serious. So I can't communicate. I made an effort, but it was not an effort to live my life. It was an effort to meet the expectations of others. And those expectations were too great compared to my ability.
 
 Reconstruction of values is important.
 
 There are many cunning people in this world. They are geniuses at recognizing anxious people. He will flatter them. Will he help me when I burn out? It is better to be alone than to be pampered by cunning people. People who condemn you when you try to self-actualize are bad people. They are people who exploit others. People who take away your power. Cut them down. If you are not in good physical or mental shape, you are stuck if you don't sort out your relationships. Cut out those who do nothing concrete to help you, but only say pleasant things to you.
 
 We must throw off the mask of forcing ourselves to act cheerful. Cheerfulness is sometimes just a mask to cover up insecurity. People say things like, "Why would a cheerful child commit suicide?" Why?" and so on. Wasn't cheerfulness a way to hide her anxiety?
 
 Try to stop doing something (such as attacking another person) and you will become anxious, which will show that the anxiety was the reason for the behavior.
 
 If you want to essentially quell anxiety, you need to be able to communicate.
 
 Ultimately, your life is your responsibility. If you think that way, you think about your life from many angles. If you leave your life to others, you will pander to them. If you don't think, "My life is my responsibility," you will be easily influenced by the advice of others. You have to make your own decisions.
 
 90% of seniors believe they may have dementia, but medical statistics show that 4% of seniors over age 64 have severe dementia and 10% have mild dementia
 
 People have all sorts of anxieties. But are you prepared? Are you researching to learn more about what you are worried about? They have desires, but they don't want to make the effort to realize them. And they don't admit it to themselves. He resents me when I say, "Why don't you just try?" What he wants is someone who will join him and say, "Oh no! It is only when he becomes energetic that he wants concrete advice.
 
 The idea of actually taking action. The "next best thing" is to do the worst possible thing without doing the best possible thing because you are so fixated on the best possible solution. For example, the best solution is to go to bed and wake up healthy, but if that is not possible, the next best solution is to take sleeping pills and go to bed. But they refuse to do so, and as a result, they cannot sleep and get sick. What is the purpose? Human beings are not supermen. Instead of pursuing an ideal, we need a realistic solution.
 
 People who are in a hurry can't do the next best thing either. Ideally, we would accomplish what we thought we would one after the other, but in reality, that is not always possible.
 
 Superman Obsessive Compulsive Syndrome. If you are trying to contribute to society by becoming Superman, you are not in a hurry if you can't. You are in a hurry because you are trying to resolve a mental conflict.
 
 The next best thing is to do what you can. What you can't do, you can't do.
 
 When I am troubled, I tell myself, "My brain is just poisoned right now.
 
 <hr>
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=4569791247" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 I get tangled up with people who attack others so much, and when I go in and say that they are making claims that I don't agree with, that's not true. I used to think I was the victim, but I guess not. People like that are insecure, and they find peace of mind by criticizing others to relieve their insecurity. They resent me because I suddenly rip them apart with attacks in the name of "righteous argument. I guess the victim is over there.
 
 I just don't like information that I think is wrong to be circulated without being corrected, so I guess I should correct them but not fold them in with more righteous arguments if they are offended by the correction.
 </body>

[Hatena Diary 2010-10-14 https://nishiohirokazu.hatenadiary.org/archive/2010/10/14]