Hatena2009-05-12
code:hatena
 <body>
 *1242073617* Fun way to play Gokiburi Poker.
 first of all, let me make a basic premise
 - 1: Playing Cockroach Poker
 - 2: "Basically, we're all just beating the crap out of people who are close to losing. Some people hardly get a turn until the game is over, and that's boring."
 - 3: id:warufuzaketaichi says to me, "You can change that by making it 'you win when you run out of cards'" and I think "That's it! I think "That's it!
 - 4: <a href='http://d.hatena.ne.jp/nishiohirokazu/20090509/1241884073'>Gokiburi Poker should be "You win when all the cards in your hand are gone</a>" and get stuck with "That's not true.
 After you understand the process of (^^;)
 
 I found out as a result of yesterday's discussion <a href='http://d.hatena.ne.jp/nishiohirokazu/20090511/1242038452#c'>about the disadvantages of invoking the original rules of Gokiburi Poker to invoke a laundry list</a>! but ...
 - Turning is a bad move in general, but when there are five or more players and all but one are turning, turning is a better move.
 - All those who claim that "Gokiburi poker is fun even with no-fix rules" (probably) think that "turning is a given."
 This seems to be the case. The first players who play with those who say "It's natural to turn," experience that "If you don't turn, you will be at a disadvantage," and become a member of the "It's natural to turn" group. On the other hand, if you play with other players, the condition that all players except one turn in a game of five or more players is rarely met, and you may wonder if it is worthwhile to turn, or you will be considered a sucker if you do so. and "Basically, I don't turn. The game is completely different depending on the players' behavior patterns.
 
 So, if you are like me and find cockroach poker boring, you should first try it a few times with 5 or more players with the "turn when you can turn" rule. If you think it's boring because there's not much to read, or if you think it's fundamentally a game where one player loses in a multiplayer game, or if you think it's a game where you beat one player to a pulp, you should try the "no hand wins" rule. If you think "It's boring because there is not much to read," or "It's fundamentally a game where one player loses and the other player beats the other player to a pulp!
 
 *1242076565*Ehh.
 >||
 has_key() takes exactly one argument (0 given)
 /Applications/GoogleAppEngineLauncher.app/Contents/Resources/GoogleAppEngine-default.bundle/Contents/Resources/google_appengine/google/appengine/ext/db/__init__.py in validate
 
 2681. if value is not None and not value.has_key(): 
 ||<
 
 I'm not going to pursue it because I don't need it for my current development.
 - Google App Engine SDK 1.2.2
 - Local development server
 - Plug the user object into Player.user as shown below
 >||
 class UserPref(db.Model):
     user = db.UserProperty()
 
 
 class Player(db.Model):
     user = db.ReferenceProperty(UserPref)
 ||<
 The event occurred in
 
 **1242102277* Game Considerations vs. Novels
 It seems that some people do not like to discuss games. When it comes down to it, I think this is almost the same as the argument that "if you see a spoiler in a novel first, you can't enjoy the novel.
 
 *1242120052* photo acrylic
 Recovered.
 f:id:nishiohirokazu:20090512182050j:image
 
 I know you can't tell much from the photo, but the picture covered with thick acrylic looks sharper than just a print. It made me want to make more. Also, I should buy a digital SLR camera instead of a cell phone camera.
 
 *1242155038*Bristles
 I suddenly thought of combing my hair and broke three teeth of the comb.
 
 *1242156877*An example of the phenomenon of flame wars caused by ambiguous titles.
 <a href='http://coliss.com/articles/build-websites/operation/design/design- tutorial-create-screenshots-at-300dpi.html'>Printing Screenshots How to print a screenshot without losing quality | Collis</a>.
 <a href='http://b.hatena.ne.jp/entry/http://coliss.com/articles/build- websites/operation/design/design-tutorial-create-screenshots- at- 300dpi.html'>Hatena Bookmark - How to print screenshots without losing quality | Collis</a>.
 
 After all, they say "this is terrible" because they suddenly reduce the colors while saying "we will not reduce the quality. The meaning of the word "quality" is ambiguous, so people think, "What are you talking about when you say you won't reduce the quality even though you are reducing the colors?
 If the title had been "How to enlarge a captured GUI image using only 256 colors while keeping it sharp," it would not have been so "where do I start? It would have just been "You don't need to reduce the number of colors" or "You don't understand that the reason for the blurriness is resampling.
 Well, if the solution is wrong, someone will come up with a more appropriate solution in no time, as long as the problem is properly posed. Also read: <a href='http://d.hatena.ne.jp/otsune/20090513/screenshot'>When printing a screenshot, you don't need to play with the dpi to enlarge the pixels unless you want to combine it with a picture of your hand or something. import otsune from Hatena</a>
 <hr>
 
 I thought it would be better to have a list of actual case memos, so I pulled up past case memos.
 - <a href='http://d.hatena.ne.jp/nishiohirokazu/20090224/1235426800'>An example of failure caused by timezone not always being JST even for Japanese web services - Yasukazu Nishio's Hatena Diary</a>.
 - <a href='http://d.hatena.ne.jp/nishiohirokazu/20080824/1219556026'>An illustration of the problems caused by word sense fluctuations in classification by tagging - Yasukazu Nishio's Hatena Diary</a>.
 
 *1242158369* Changing communication styles and avoiding problems
 After all, as with the previous entry, if a simple mistake or lack of words in the title or first comment makes people think, "This person doesn't understand," the bias will follow them for a long time. We are living in a situation that was unthinkable just a hundred years ago, where we are communicating with people beyond the limit of the number of dummies by textual information in almost real time, so the way to avoid problems may have to be a new way that was not available a hundred years ago.
 
 If you write the title first and then the body, the content may shift while you are writing the body and become mismatched with the title. Maybe you should review it at the end. If you write something like "Y is the best option in X situation" and then write "Y should be the best option", you will get a lot of backlash from people who are not X. Maybe "should" should be a banned word in the first place. Maybe I should write an entry titled "You should not write 'should' in the title.
 </body>
 <comments>
 <comment>
 <username>tyoro1210</username>
 <body><br><br>I was wondering about one thing, and I would like to confirm it. <BR><BR>I've only been playing for about two years, so I haven't played that many times, but most of the places I've been to in other prefectures have been built on the premise of playing poker. <BR><BR>If it means that I have been playing in a rare case, I would like to play in a more popular environment, so I am curious. </body>
 <timestamp>1242132826</timestamp>
 </comment>
 <comment>
 <username>tyoro1210</username>
 <body>Oh, I guess it depends on the number of people. <BR>I usually play with 5-6 people, 4 at least, and I have never played with less than 3 people. <br>With 3 people, it seems pointless to play with a turntable. </body><br>I think it's pointless to play with less than 3 people.
 <timestamp>1242133193</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Yes. If the number of players is small, it feels pointless to turn, and as explained the other day, unless there are 5 or more players and less than 1 person who does not turn, playing without turning is a bad idea, so I think in many cases, unless someone says "it's natural to turn", it will be played without turning. <br>And if you don't turn, it's not fun unless you apply a patch to make the out of hand win, so I guess many people who think the original rule is fun and play it repeatedly are in the "turn" camp. </body>
 <timestamp>1242150056</timestamp>
 </comment>
 <comment>
 <username>tyoro1210</username>
 <body>Well, I don't experience such cases very often, so I was wondering what it was like when Nishio-san actually played in the past. <BR><BR>I guess I'm biased in the places I participate in. <BR><BR>And also, the game is limited to 2-6 players for commercial reasons, but BoardGameGeek and other sites indicate that the optimal number of players is 4-5 and the recommended number is 4-6, so it seems that the original rules are not designed to be played by 2-3 players. <br>I wish the package would state the optimal number of players, not just the number of people who can play. </body>.
 <timestamp>1242150885</timestamp>
 </comment>
 <comment>
 <username>tacnac</username>
 <BODY>How do you do? I have been following the discussion with great interest. I don't know if this will be helpful, but here is my case. <BR><BR>I played cockroach poker for the first time a few years ago, and it was my first experience of playing bodgeball. <br>But the owner misinterpreted the rule and said "you can only turn once" (not one after the other in a chain). <BR><BR>The game was not fun for me at that time (after all, it was just a game of rock-paper-scissors between two players), and I was left with the impression that cockroach poker was not good enough for several years, which was a shame. <BR><BR>A few years later, I started buying games, and I bought Cockroach Poker just to combine shipping costs and as a beginner's staple. I bought it, but it had been sitting for a while, and then someone said, "Let's play it because the pictures are cute (cute?). <br>I bought it, but it had been sitting there for a while. <br>At that time, I re-read the rules and recognized the rule "you can play until everyone has a chance to play" (to be honest, I didn't know the rule was wrong at the time I grasped it). （<BR><BR>When I actually tried it, the cards pretty much went from everyone to everyone. And the game took on a completely different look. I didn't give any input because I didn't have any criteria to judge whether it was better or worse to turn the cards. I don't know if it was the atmosphere of the place or the chemistry of the members, but it just happened naturally. <BR><BR>After that, it was standard practice at my house to rotate the members even if they were replaced. <BR><BR>For my part, I would play other games if the standard is to play without turning (it's just rock-paper-scissors-scissors with a little extra added). <BR><BR>I don't find the card loss and win rule very appealing either. <BR>If the standard game is to play with a turn, I think the atmosphere of this game will turn into a game with originality that I can't think of anything else that is similar to. <br>If you look at the card that is played with a casual expression on your face, you will see that it says "Feed this worm to him," and you will say, "Okay, then, let's follow this route," and you will turn the cards one after another in a heart-to-heart manner, framing the last player. <br><br>The cards are all the same and are turned one after the other. <br>I believe that the key to this game is to see how each player's intention is built up in the pattern of the cards and the order in which they turn (and the declaration of change), and how the winner reads this from their facial expressions and the way they pause. <br>In that sense, I think this game is not to be enjoyed logically (saying yes because there are already three cards is a final clause or seasoning), but psychologically. (So while it is fun with a group of friends, colleagues, or other like-minded people, I don't feel like playing it with people I don't know. I don't think I would do it with people I don't know, but I don't think I would do it with people I don't know. </body>
 <timestamp>1242232341</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-05-12 https://nishiohirokazu.hatenadiary.org/archive/2009/05/12]