Hatena2009-01-11
code:hatena
 <body>
 *1231657174*bifur-ah-ta-ta-ta-ta-ta-ta-ta-ta-ta-ta-ta-ta-ta-ta-ta
 I'm putting this away.
 f:id:nishiohirokazu:20090111155933j:image
 
 one size does not fit all
 f:id:nishiohirokazu:20090111160100j:image
 
 A container for furikake (sprinkles). A container for food that is eaten with rice of some kind.
 f:id:nishiohirokazu:20090111160541j:image
 
 Kelp was found in the back of this under the sink. And nori seaweed with an expiration date of 2007.... Maybe I'll boil it and make it into a tsukudani-like food.
 
 <a href='http://cookpad.com/recipe/110393'>Don't throw away the seaweed -Nori no Tsukudani - by Omikan [Cookpad] 400,000 easy and delicious recipes</a>.
 
 
 I decided to place it under the rice cooker because it was not the right size and did not fit well in the space where the food cardboard box was originally placed nor under the nagashi.
 f:id:nishiohirokazu:20090111163020j:image
 
 -----
 
 I feel like no matter how much I put away, the place is getting messier and messier.
 
 Should we work with a clear language of what needs to be done? First, look at the bed.
 
 I have a MacBook on my bed and work on it because my desk is messy and I have nowhere to put it. Tangerine peels go in the trash. Plastic bottles are washed for now to make tea and put them in the refrigerator. The bottle of Evios should be put away on the shelf where the medicine and supplements are kept. Scarves should be hung together on the hangers where jackets are hung. Underwear should go to the washing machine.
 
 - Clear off the desk and put the MacBook there.
 - Empty plastic bottles should be cleaned and stored in the refrigerator. If they do not fit, dispose of them.
 - If there are empty plastic bottles in the refrigerator, boil barley tea.
 - If tangerine peels fall, move them to the trash.
 - Hang scarves and jackets on the same hanger
 - Evios are put away in the medicine cabinet.
 - Underwear goes to the washing machine.
 
 I'll do these seven for now.
 
 Done. 1 minute 35 seconds. Skipped "clean up my desk" because it was too big of a task. I also put my belt on a hanger with my scarf. Didn't boil the barley tea.
 
 Next is on the desk.
 Garbage is thrown away; LaQ goes to the LaQ box. Dishes go to the sink. Scales go to the kitchen. Nippers go in the tool box. Scissors should be put in the stationery box, but the stationery box is so full that the zipper won't close. I need a larger pencil case. Supplements go in the medicine cabinet. Seasonings go in the seasoning cabinet.
 
 Okay, I'll do this for now.
 
 pending
 - Receipt for copying fee for dissertation
 - CD-R that seems to have something in it. I check the contents later and write with a pen.
 - Business cards that won't fit in a business card case
 - Mac apple sticker
 - Paper with instructions on how to fill out the forms.
 
 13 minutes and 4 seconds.I had a little trouble with the part detailing past TOEIC scores, but decided to throw it away. I unearthed some sprinkles on the floor, so I put them in the sprinkles cabinet. I'm getting more done when I clearly define what I need to do and measure the time. I take a break because rice is cooking in a minute and I'm very hungry. At this point, it has been 74 minutes since I started cleaning up.
 
 -----
 
 18:30
 
 I'm kind of tired already. I wonder if I can at least take out the floor. I look at the floor and think.
 
 - Boiled tea into PET bottles
 - There is no place for rice or rice cakes. Do you want to use the space under the medicine cabinet?
 -- Found Eucommia tea in the space below -> Go to the tea shelf.
 - Kitchen poly goes in the drawer containing the saran wrap.
 - Catan to the games shelf.
 
 I thought I had boiled a liter, but there was only a little more than one bottle, so I decided to boil it again. 6 minutes and 7 seconds. There are only two of the smallest plastic bags left. I need to buy some more. I need somewhere to write down these TODOs.
 
 pending
 - A place to write down non-urgent purchases
 - A place to fix the electric kettle when not in use
 
 Truth be told, it's not a good idea to leave electric kettles and rice cookers plugged in when not in use.
 
 -----
 
 Continuation of floor tidying.
 - Thread and needles go to the toolbox.
 - Double-sided tape also goes into the toolbox.
 - Luminous feet are falling off. Collect them for now.
 - Boxes that contained food: think of a use for them later. Put it back under the sink for now.
 - Cardboard box containing food products: Let's use this as a box for rice and rice cakes.
 - Books, magazines, newspapers: collect them anyway
 
 I'll take it so far for now.
 
 I dumped a lot of trash. 27 minutes.
 The shelf I tried to fix a box of rice and rice to take with me, but it doesn't seem to fit anything like a box because of the power cables running through it.
 
 -----
 
 I went shopping. I wanted to buy a 100-pack of plastic bags, but they didn't have any. 55 bags for 100 yen, so that's okay. I also wanted to buy some white vinyl tape, but they had a roll of sticky notes. They are no longer sticky notes.
 
 f:id:nishiohirokazu:20090111203511j:image
 f:id:nishiohirokazu:20090111203848j:image
 
 Convenient.
 
 *1231685948* Too unmotivated.
 The last time I talked about using cvMatchTemplate for playing card images, I thought cvMatchTemplate could do it. It took me 14 days to think about it, 50 minutes to implement it, and 5 minutes to blog about it. I thought about the reason why it didn't work, and some ideas for improvement. function for this purpose, so let's use it). And how many more days until the next wave of motivation arrives?
 
 I was hoping to finish it by Tuesday and bring it to the programming symposium, but I don't know what to think.
 </body>

[Hatena Diary 2009-01-11 https://nishiohirokazu.hatenadiary.org/archive/2009/01/11]