Hatena2008-04-13
code:hatena
 <body>
 *1208058026*[Python] Read only the first few lines of a data file.
 I did everything from creating the data files and "I think itertools" to finding out what I was looking for, all in one partty.org.
 http://www.partty.org/session/head/2008/04/13/03/32/44
 
 By the way, when I edit after moving to the beginning of a line using Ctrl+A, the content of the line seems to disappear...
 
 *1208087134*Twitter
 Twit makes Twitter much more convenient, but the problem is that software that runs on the client side cannot take messages when the machine is off. Something like tiarra that runs 24 hours a day on the server might be more convenient.
 
 *1208087230*Gainer can be manipulated in Jython as well, apparently.
 Controlling Gainer with processing + jython: http://blog.kzfmix.com/entry/1207469282
 
 I hadn't followed it because I thought I'd play with Gainer only after I finished writing the Jython book, but I didn't realize that you can control Gainer with such a short script!
 
 *1208089142*partty.org Tried again.
 http://www.partty.org/session/parttytest/2008/04/13/12/02/08
 
 Hmmm... Like when you make an operation mistake and a lot of lines flow, it's so fast in your hand that only the last part comes out in an instant, but from TTY's point of view, you're displaying and flowing all of them....
 Also, I wonder if it would be difficult to tell if the characters behind are shifted or not when you go back to the beginning of a line and add a character using Ctrl-A or something while editing.
 I wish Emacs could do something about the fact that some places disappear while editing.
 
 *1208105283*[Python] Brainf*ck interpreter with 1024 characters.
 Needless to say, it is a one-liner.
 
 Create a -Brainf*ck interpreter. Put a bug in it while trying to make it a one-liner. Trying to debug and get disconnected from partty.org because of debug prints.
 --http://www.partty.org/session/make_bf_interpreter/2008/04/13/12/40/21
 -One-liner conversion
 --http://www.partty.org/session/bf_interpreter_onlinerize/2008/04/13/14/13/16
 
 The point is not that one-liners can be created in Python or how to create them,
 
 - Automate testing to make it easier to test.
 - Version control so that if it is inadvertently broken, it can be compared to the previous working version.
 - Learn editor commands, even gradually, to increase productivity.
 
 I think these three points are the key to writing insane one-liner code in Python, but if you have these fundamentals in place, you won't be afraid of it.
 
 *1208106670*memo
 >||
 I = SKK
 B = S(KS)K
 C = S(BBS)(KK)
 M = SII
 L = CBM
 Y = SLL
 ||<
 
 If I do this now, I'll be late tomorrow, so I'll continue next time.
 </body>
 <comments>
 <comment>
 <username>sotarok</username>
 <body>That's where TwitterIrcGateway and tig.rb.? </body>
 <timestamp>1208116577</timestamp>
 </comment>
 <comment>
 <username>jbking</username>
 <body>We should just make a one-liner compiler for AST. </body>
 <timestamp>1208117769</timestamp>
 </comment>
 <comment>
 <username>ramsn99</username>
 <body>I can see it with TwitterIrcGateway+tiarra+Cotton, so I'm sure it will work. <br>I think it will work. <br>In Linux, TwitterIrcGateway seems to require a mono environment, so maybe tig.rb is easier? </body>
 <timestamp>1208184698</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-04-13 https://nishiohirokazu.hatenadiary.org/archive/2008/04/13]