Hatena2008-01-02
code:hatena
 <body>
 *1199284148* Relatives
 They are adding a new child today or tomorrow!
 
 The second youngest 9 year old boy now is too active and quite tired.
 I gave Blokus Duo to the youngest 3 year old boy and he started to sing "put this here, here, here" and finally he put all the blocks on both sides of the table!
 
 I also gave TANTRIX to a girl who used to hate math stuff when she was little, but now that she's 14, I thought she could do it, and while I was making a triangle with point symmetry, she asked, "Are we going to connect the roads?" and then she joined in.
 As expected of a 3 year old, there are times when he doesn't notice when he goes in if he flips over with Blokus or when he gets stuck if he rotates with TANTRIX, but, well, it's too much to ask a 3 year old to go that far, isn't it?
 
 I remember that the girls were disappointed last year because they could only get about 2 sheets of 100 poems, but this time they got quite a few. Well, it was mainly due to their youth and instantaneous power, so they couldn't win against those who could recognize the first phrase by looking at the second phrase at the end of the game. I was in the same position until last year, and I think that since I am young, I can easily turn the tables on them if I want to. The hardest thing is to get them to do so.
 
 I'm really tired of dealing with a 9 year old, and I'm looking forward to seeing what the 3 year old has in store. I'd like to stock up on more toys, but after next year I'll have a zero year old, so I'll have to be careful about what he puts in his mouth.
 
 *1199289429* How to write org.
 If weekday access is set at 100, it is 50 on weekends and 30 on New Year's Eve and New Year's Day. I guess there are many people who don't use their PCs during the New Year's holidays.
 
 I am the one who is writing a silly diary in the midst of all this.
 
 *1199294323* The year's plans are made on New Year's Day... or, well, about three days later.
 I was reading my own past entries, as it seems to be popular to dig up and list the entries I wrote last year that got a good response, and I found an overseas blog mentioning a story about using IronPython to beat a Wii remote control. He said, "It's in Japanese, but the source code is easy to understand."
 
 So I created an account on Blogger and translated its entries,
 http://nishiohirokazu.blogspot.com/2008/01/get-values-from-wii-remote-through.html
 In addition, I Digg'd it myself.
 http://digg.com/programming/Use_Wii_Remote_through_IronPython
 
 I think we should do these things consistently at least 2-3 times a month this year. By the way, is this what the first Digg should look like?
 </body>

[Hatena Diary 2008-01-02 https://nishiohirokazu.hatenadiary.org/archive/2008/01/02]