Hatena2008-12-28
code:hatena
 <body>
 *1230422280*Cold
 I just got back from the Hacker's Cafe year-end party. I was planning to extract the playing card region, normalize, and kNN, but I think it would be better to use cvMatchTemplate to multiply the upright and inverted suits with JQK.
 
 Very sleepy. The room is colder than McDonald's at 14 degrees or so. I am sleepy. If I sleep, I'll die. And I'll miss the 16:00 Shinkansen from Tokyo.
 
 *1230446347*Shinkansen
 It is taking a lot of time to pick up the reserved tickets. There should be more unmanned terminals. The air is so stuffy that someone's dog is caning.
 
 
 The station staff told me to get in line, but I was told that I couldn't get a ticket here, so I was shuffled around. It was terrible.
 
 
 I got here 40 minutes ago, but it's already less than 15 minutes. I'm just in time. Is the train service in the Akita direction cancelled due to strong winds? And at the machine I was directed to, there was a sign saying that my ticket would be automatically cancelled and that I had to buy another one. Hmmm. What a mess.
 
 
 The train left less than a minute after we got on. Too extreme.
 
 
 
 f:id:nishiohirokazu:20081228164922j:image
 
 *1230489850*A review of this year's blog (January)
 -http://d.hatena.ne.jp/nishiohirokazu/20080102/1199294323
 
 I ended up doing this alone and was completely left alone around March. That's why I'm looking forward to Hacker's Cafe, where there are multiple editors.
 
 -http://d.hatena.ne.jp/nishiohirokazu/20080102/1199284148
 
 Oh, shoot. I brought a neodymium magnet and a catan this year, but both are dangerous with kids putting them in their mouths, should have gone with the TANTRIX.
 
 -http://d.hatena.ne.jp/nishiohirokazu/20080103/1199373029
 
 I thought about making a game of roulette with a map of Japan because it was so interesting, but in the end I haven't done it at all.
 
 http://d.hatena.ne.jp/nishiohirokazu/20080106/1199627112
 By this time, he had already begun collecting odd-shaped signs.
 
 http://d.hatena.ne.jp/nishiohirokazu/20080109/1199838176
 I could write a post on the Hacker's Cafe Blog saying, "Here's what we're doing at the Japanese Programming Symposium."
 
 I mean, it took you a year to get your hands on it, even though you knew about CUDA at this time and wrote it down on your blog.
 
 http://d.hatena.ne.jp/nishiohirokazu/20080112/1200117499
 The story is that ActionScript is Python.
 
 It's been a year since they were making the ETC with the Wii camera and infrared LEDs.
 
 The first 1000speakers meeting was in January of this year.
 
 http://d.hatena.ne.jp/nishiohirokazu/20080113/1200194380
 50 Ingredients, I'm leaving it out again.
 
 http://d.hatena.ne.jp/nishiohirokazu/20080114/1200282115
 Is this when you started collecting neodymium magnets? This is a cool photo, so I'm reprinting it on HCB.
 
 http://d.hatena.ne.jp/nishiohirokazu/20080121/1200888986
 I made a Scheme-like program in Python. And I left it without completing it.
 
 http://d.hatena.ne.jp/nishiohirokazu/20080122
 A Functional Programming Approach."
 
 http://d.hatena.ne.jp/nishiohirokazu/20080124/1201154132
 JSDeferred, left unread.
 
 http://d.hatena.ne.jp/nishiohirokazu/20080128/1201539815
 I was told that Haskell instances are easily misunderstood by people who know Java. Should this be translated into English?
 
 http://d.hatena.ne.jp/nishiohirokazu/20080128/1201514067
 Explanation of the golden split search method.
 
 http://d.hatena.ne.jp/nishiohirokazu/20080129/1201600506
 http://d.hatena.ne.jp/nishiohirokazu/20080130/1201688319
 The mystery of the stack overflow in AS3, even in just a loop, has it been solved or not?
 
 http://d.hatena.ne.jp/nishiohirokazu/20080129/1201598235
 Like the demonstration code for AS3 tuning. I should probably organize it.
 
 Whew, I finally finished January.
 </body>

[Hatena Diary 2008-12-28 https://nishiohirokazu.hatenadiary.org/archive/2008/12/28]