Hatena2010-03-27
code:hatena
 <body>
 *1269666996* First time clearing JNetHack.
 I've been playing it for more than 10 years now, and I've been playing it since last night because I remembered that I've been playing it every once in a while and then throwing it away in the middle of the game and not seeing the ending.
 
 Very spoilers below, so close it immediately if you don't want to see it, lol.
 
 3
 
 1
 
 4
 
 1
 
 5
 
 9
 
 There is a rumor in some circles that I am quite a gamer, but that is a misconception, I am a very lukewarm gamer.
 
 - First, start in wizard mode for debugging.
 - blessed +99 gray dragon scale mail and blessed +127 Excalibur to wish
 - Excalibur's modifier is too high and the hit detection routine overflows and attacks don't hit at all, so I change it to blessed +20 Grayswandir.
 - While taking the candles, we went to the lowest level of the gnome mine.
 - The blessed tinning kit is very useful!
 - After holding the candle, I forgot to PAY and teleported and had a hard time. Attribute values are falling all over the place.
 - I was pissed off at the entrance to the hometown quest for not having enough attribute values, but since I was in wizard mode, I was able to rewrite it.
 - I felt a hint of mind flare in Fort Rhodios, so genocide
 - WAND OF WISHING and other unwanted children.
 - L at the Medusa level is bled genocide; on second thought, it would have been good to genocide ;too. Gremlins are increasing in number after being soaked in water. g should have been genocided too.
 - I got a shield of reflection by shattering the statue of Perseus, but it is cursed, so I changed it to silver dragon scale mail because I don't want to put a curse on it. I changed it to silver dragon scale mail because I didn't want to put a curse on it. Instead, I got a magic protection with blessed fireproof +20 cloak of magic registance. I also added +20 speed boots, +20 gauntlets of dexterity, +20 helm of brilliance, and other than durability, the other specs are great.
 - I'm going down with guns blazing with map magic and teleportation. I forgot to mention that the staple food is bled tin of spinach.
 - I'm going to try to can Yonder out of the blue.
 - After a few moments of confusion about how to put the candles on the candlesticks, the ritual is safely performed at the lowest level.
 - I climbed as high as I could, but since I was an orderly, I was repeatedly returned to the first floor by level teleportation.
 - Outside. Gorged with blessed wand of digging (0:100) that I had previously to break the wall. Fluffed with blessed ring of levitation that WISHED around Fort Rhodios. But even with this cheat spec, I was killed twice by wind E. I had ring of conflict on. I had to run away to avoid touching it.
 - Ascending safely, he said.
 
 It was indeed too cheat and not interesting enough! (Yeah)
 
 *1269672031*What is the best way to WISH only one category in JNetHack?
 http://f18.aaa.livedoor.jp/~hakahori/nethack/pukiwiki.php?%A5%A2%A5%A4%A5%C6%A5%E0%B0%EC%CD%F7
 
 I am thinking of making it "scrolls only" or something like that, since it is too cheat to wish unlimitedly in wizard mode. Well, let's say that it is forbidden to wish for a "wand of wishes" in "wand-only" mode, since it is usually the best way to wish for a "wand of wishes".
 
 I think it's surprisingly difficult. potion can bless infinitely. wand can polymorph infinitely. With armor, it's ironclad, and with weapons, it's the most powerful. If you use tools, you can write any scroll you want as long as you have a blank sheet of paper. Hmmm...maybe wand. I guess it depends on the profession. I'm also wondering if there is an identification cheat or not. If there is identification, will scrolls be worth much less?
 
 If I had to choose from the perspective of ease in the beginning, it's armor and food, but that's as good as it gets. Okay, let's try WAND. I'll be a tourist by profession. Now what do I wish for...I need to scavenge trash items first since I plan to make various other things with polymorph, but I don't want to be dead by then. Oh, right, polymorph your pets!
 
 Pet kittens turned into prairie centaurs.
 
 I picked up a tinning kit. Ah, polymorph is hard to find a way to identify. Oh, he's dead. I'm dead. I thought I made a teleportation wand, but it turned out to be an invisibility wand.
 
 Dead again. Or maybe tourists are too weak to go to be killed by newts. I guess you have to keep your distance from newts, elbreth them, or kill them with a stick. Hmmm...maybe it would be better to use potion to raise the level to 20 or so at once.
 
 WISH 20 level up pills...I was taking them and then the djinn came out. Now, what do I wish for here?
 ...I think it's gray dragon armor. There it is again! Ummm. I wonder if it's a pair of Vikas shoes. I wonder if I can WISH this way.... Hmmm. So, my level is up, my equipment is ready, and I'm just going to play normally from here? It's not that interesting.
 
 Then I guess I'll have to IDENTIFY with SCROLL... hmmm...
 
 It's no good, after all, because I find the beginning of the process until all sorts of things come together to be a pain in the ass. I'll just hang the laundry instead of that.... It's been beautifully spoiled.
 </body>
 <comments>
 <comment>
 <username>kosaki</username>
 <body>Wow, this is a great spoiler (blah blah blah)</body>.
 <timestamp>1269671350</timestamp>
 </comment>
 </comments>

[Hatena Diary 2010-03-27 https://nishiohirokazu.hatenadiary.org/archive/2010/03/27]