Hatena2010-07-13
code:hatena
 <body>
 *1278980775*Wrote the solution version of the Haskell Quiz.
 <a href='http://blog.hackers-cafe.net/2010/07/haskell-quiz-answer.html'>Hacker's Cafe Blog: Haskell Quiz Answer</a>
 
 I'm writing this at length as an exercise in English, but I'll summarize it in a nutshell.
 - Haskell allows overloading of value definitions.
 -- I know I've defined it as "show" or something like that.
 - Possibility to select from overloaded definitions by return type (functions with the same argument type but different return value can be overloaded)
 - And it doesn't even need to take arguments.
 -- The <a href='http://d.hatena.ne.jp/nishiohirokazu/20100616/1276693135'>story I wrote earlier about how the same name in Haskell doesn't always return the same value</a> is almost the answer.
 - (+) and (==) are t -> t -> t, so x + (1::Int) has the effect of making x (x::Int)
 - Numeric literals such as 0 can be (0::Int) or (0::Integer) since (Num a) => a
 
 So a and b are variables that have different values when evaluated as Int and when evaluated as Integer. c is Int and d is Integer, and the type of a and b were controlled by arithmetic operations as appropriate.
 
 *1279032577*Globalization is not a choice but a fact
 Casually looking at the next article (<a href='http://d.hatena.ne.jp/camlspotter/20100707/1278525145'>Let's forget about Tokyo being financial and all that. - Oh, you `re no (fun _ → more)</a>) and was blown away by the sentence quoted there.
 
 >>
 I think the majority of Japanese people are saying, "I don't want to be awakened, I don't want to grow up and become globalized.
 <<
 
 They don't want to grow taller and globalize!
 
 The title of this article, "Globalization is not a choice but a fact," is a statement made by Secretary of State Condoleezza Rice at the Davos Forum. Globalization is a change in social structure brought about by the invention of the Internet and, in particular, e-commerce. In other words, it is a FACT. It is not an option that individual companies can say they will or will not choose globalization.
 
 Let me give you an example. Suppose you are a tableware manufacturer and have been making a modest profit by distributing tableware to nearby restaurants. You thought that globalization had nothing to do with you and that you could just carry on as before. However, now your customer, the owner of a café, may be looking at tableware from a Scandinavian manufacturer he has never heard of on the Internet and thinking, "I like this better. Sales, which have been stable every year, may suddenly drop by half next year. This is globalization. While you are saying, "I don't need globalization," and not taking any measures, your competitors somewhere in the world may be moving forward. Globalization will not stop even if you do nothing. Your inaction will not stop the change, you will only be left behind. In the history of life, it is not the strongest organisms that have survived, but those that have adapted the best to change. If you cannot adapt to change, even a tyrannosaurus will become extinct.
 
 If you were to say, "No, I don't want globalization! I would be tempted to say, "What are you talking about in your sleep?
 
 Of course, there are more than 100 million Japanese-speaking people in Japan, a small island nation in the Far East, so there is a certain amount of business that caters only to Japanese. Singapore was a country with four official languages, but since 80% of the population is Chinese, there were shopkeepers and others in the Chinese district who could not speak English. So, even if you can't speak English, you can still find a job. So, if you don't want to learn English by any means, then you should work in a job that doesn't require English. If you really don't want to learn how to operate a computer, just get a job that doesn't use computers. Well. I think that the cost of learning English is less than the risk of not learning English, but that's just my interpretation, so if you don't agree with it, you don't have to agree with it.
 
 Reprinted from Twitter
 >>
 The motivation for writing that article was "Even I, who am not familiar with current trends, am voluntarily studying English because I think English proficiency will be important in the future, but what kind of person doesn't study English even if the company explicitly gives you a goal? It is not communicated in Japanese either.
 <<
 
 >>
 Our company's fate depends on iPhone apps from now on! So, please study ObjC! →What? I can get sympathy if it's a flow like that, but when it comes to "English," I can't get any sympathy. English is the knowledge that is easier to use.
 <<
 
 I can only say that it is a difference in values now. I have no idea why you hate learning English so much. I don't understand it, but, well, it's not my life and I can do whatever I want.
 
 I am not very good at English either. I wish I had studied English more when I was younger. However, this is the youngest time in my future life. You can't change the past. What you can change is now. That's what I think now.
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=447800210X" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 <script src="http://www.gmodules.com/ig/ifr?url=http://4.latest.ikunozama.appspot.com/gg/def.xml&amp;up_bgcolor=AAFFAA&amp;up_asin=B000BMUVKQ&amp;up_nation=UK&amp;synd=open&amp;w=250&amp;h=240&amp;title=amazon.co.uk%E4%BE%A1%E6%A0%BC%E6%83%85%E5%A0%B1%3A+%E3%82%A4%E3%82%AF%E3%83%8E%E3%82%B6%E3%83%9E&amp;border=%23ffffff%7C3px%2C1px+solid+%23999999&amp;output=js"></script>
 
 *1279039399*Giggle, Cassie!
 On the topic of whether there is a polite way to say "Guggleskas".
 
 >>
  I apologize if you are not aware of this, but I have recently discovered an interesting American website called Google, and you might want to try Google for your question as well. Thank you for your continued patronage. Google it.
 nishio/nishio hirokazu 2010-07-06 10:08:10 26 favs
 <<
 
 Reprinted from Twitter.
 </body>
 <comments>
 <comment>
 <username>Zo</username>.
 <body>Hey there. <br><br>Our company will now focus its life on iPhone applications! So please learn ObjC!  <br><br><br>The Japanese have a deep-rooted English complex. <br><br>I wonder if that is called a "complex". <BR><BR>What is different between English and Objective-C is that there is no one who can use Objective-C without effort, while there are people who can use English without effort. And since the majority of Japanese in particular "can't necessarily use Objective-C even if they put in considerably more effort than the average person on earth" (due to the fact that Japanese and English have very little linguistic and cultural contact), we are objectively "at a disadvantage". <br><br>If you want to use your limited time after work for leisure or hobbies, it is natural to feel chagrined at being forced to spend it studying English, which you don't even like. <BR><BR>But if you try to complain, you will be misinterpreted as an "idiot who can't see the reality of the need for English" and not listened to, and this will only make you more dissatisfied. <BR><BR>For example, if I were asked to study English, I would say, "No, if I were a world dictator, I would ban English as a lingua franca and force all mankind to speak an artificial language that bears no resemblance to any natural language (probably the only way to avoid any advantage or disadvantage due to language). I think most of the people who are opposed to the recent trend are more or less in the same position as I am (although many of them may not be able to verbalize it so far), but the existence of such people is not I don't think that's often assumed in these kinds of discussions. <br><br><br>I think that the existence of such people is not often assumed in this kind of discussion, and it seems that it tends to be collected in the simplified scheme of "those who are willing to learn English" and "those who are not willing to learn English" (the former seems more reasonable in this case). <BR><BR><BR>This is a long story, but "not wanting to learn English" and "not learning English" are two different things, and "not having empathy" is also different from "not agreeing with factual perceptions," and in any case, that's not an "English complex" thing. I think that's the reason why this topic has been so difficult to engage in. </body>
 <timestamp>1279299855</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>In short,<br>>I can only say that it is a difference in values now. I have no idea why you hate learning English so much. I don't understand it, but well, it's not my life and I can do what I want. <br>I guess I'll just reply that it's not my life and I can do what I want. </body>
 <timestamp>1279418109</timestamp>
 </comment>
 <comment>
 <username>Zo</username>.
 <body>Hmmm, I'm not sure if I'm getting the point across. <BR>The point is that you're right that we have different values, but I think it's a questionable "fact" to lump those differences together as an "English complex". And that is because it overlooks the fact that "not wanting to learn English" and "not learning English" are not necessarily the same thing (i.e., I agree with the fact that "the cost of learning English is less than the risk one takes by not learning it"), and I think that the perception of "the choice between those two" is shifting). <br><br>This is, of course, my subjective view, but it's not necessarily the same thing.) <br>Of course, this is my subjective observation, and if you say "I don't think so", that's the end of the story. </body>
 <timestamp>1279453774</timestamp>
 </comment>
 </comments>

[Hatena Diary 2010-07-13 https://nishiohirokazu.hatenadiary.org/archive/2010/07/13]