Hatena2010-05-24
code:hatena
 <body>
 *1274665895*Diary of this morning
 Twitterから転載
 
 - miss a stop on a train
 - I'll change at another station.
 - Next thing you know, you're at the station and the doors are already open.
 - panic
 >>
 I was thinking about something when I arrived at the transfer station. I rushed outside with a plastic umbrella that was hanging on the nearby railing, and found the same plastic umbrella hanging on my left elbow. I am sorry for the man who was sleeping with his umbrella on the railing at the end of the seat. I left your umbrella at the ticket gate of Nihonbashi station.
 <<
 - change one's way of thinking
 >>
 Since each trial of simple Monte Carlo is independent, each trial can be implemented as a pure function and aggregated on top, so that it can be parallelized in the future without thinking about anything else. Therefore, it should be implemented purely. However, Monte Carlo using UCB is difficult because each trial is determined by the previous one.
 <<
 - I'll miss it again.
 >>
 Missed the train again... I must be crazy to miss two rides and almost miss one in one commute.
 <<
 
 Conclusion: Monte Carlo is bad.
 
 *1274703831*[Haskell]Random
 I tried not wrapping the IO monad until just before mkStdGen in main.
 
 >|haskell|
 import Random
 
 dice :: (RandomGen g) => g -> (Int, g)
 dice g = randomR (1, 6) g 
 
 dice_seq :: (RandomGen g) => g -> [Int]
 dice_seq g = 
     let 
         first_result = dice g
     in
       (fst first_result) : map fst (iterate (dice.snd) first_result)
 
 main = print $ take 10 $ dice_seq $ mkStdGen 1
 ||<
 </body>
 <comments>
 <comment>
 <username>TOKOROTEN</username>
 <body>The Monte Carlo method is executed in a parallelized world, and the parallelized Monte Carlo Nishio randomly misses stations. <br>The Monte Carlo Nishio basically selects the correct answer, but it makes a probabilistic mistake, which is why cases like this one occur. </body>
 <timestamp>1274706482</timestamp>
 </comment>
 </comments>

[Hatena Diary 2010-05-24 https://nishiohirokazu.hatenadiary.org/archive/2010/05/24]