Hatena2010-05-02
code:hatena
 <body>
 *1272808804*Diary of Day 4 in Singapore
 It's time to start worrying about beards and claws, but I've forgotten my entire grooming kit, so I have no hair clippers. No nail clippers either.
 
 There are many mines in drinks, such as id:TOKOROTEN buying chrysanthemum flower tea and screaming, but I rather liked this elderflower tea. But what is elderflower? <a href='http://ja.wikipedia.org/wiki/%E3%83%8B%E3%83%AF%E3%83%88%E3%82%B3'>Elderflower - Wikipedia</a>, apparently. Next to it is aloe honey. Super sweet.
 f:id:nishiohirokazu:20100502110805j:image
 
 I was supposed to go to Malaysia, but everyone was asleep when I returned yesterday, and when I woke up, the Malaysian team had already departed. I had no choice but to join the team that was going to Sentosa, the main tourist attraction.
 
 The team split into three when we decided to climb the Merlion Tower. I climbed the Merlion Tower, and I dare to say that it is one of the three most disappointing towers in the world. The Merlion Tower was supposedly built in an attempt to clear its name as one of the world's three biggest disappointments, but what if it turns out to be the double crown winner of "disappointment after climbing the Merlion Tower" and "disappointment after seeing the Merlion illuminated in lights"?
 
 f:id:nishiohirokazu:20100502130007j:image
 
 I've been leaning towards "Singapore is awesome" for the past 3 days, but I was disappointed when I saw Sentosa. Imitating other countries wouldn't be a differentiation. I wonder what they are thinking of making people walk on the ground in a hot country like Singapore. At the very least, make all the aisles shaded by trees. In fact, why not make all the corridors underground?
 
 The Malaysians, on the other hand, say, "Singapore is a good country! They said, "Singapore is a good country! They said they found the Southern Cross City when they crossed the border.
 
 Why are we paying to be scared of such a high place?
 f:id:nishiohirokazu:20100502144204j:image
 
 whiz (e.g. projectile through air)
 f:id:nishiohirokazu:20100502145426j:image f:id:nishiohirokazu:20100502145428j:image
 gusher
 f:id:nishiohirokazu:20100502145431j:image
 
 
 Slide here to that island over there. Hugh.
 f:id:nishiohirokazu:20100502150250j:image
 
 Why did they make it purple. I wasn't expecting it at all, but I'm disappointed.
 f:id:nishiohirokazu:20100502204835j:image
 
 Lunch, rice noodles.
 f:id:nishiohirokazu:20100502165639j:image
 
 Baktay. You can have more soup, or rather, if you don't refuse, it will be poured.
 f:id:nishiohirokazu:20100502211319j:image
 
 Surveillance Cameras. Watching You.
 f:id:nishiohirokazu:20100502235921j:image
 
 At the casino. They said that they had a lot of money after this.
 f:id:nishiohirokazu:20100502200800j:image
 
 I said three to the dealer and for some reason he put it on 16...16 is Shiliu in Chinese, right?
 
 realtor
 - http://www.propertyguru.com.sg/
 - http://www.propertyqueen.com.sg/
 - http://steevetan.myweb.sg/
 - http://www.jerryteo9.myweb.sg/
 There's something a lot of myweb.sg.
 </body>

[Hatena Diary 2010-05-02 https://nishiohirokazu.hatenadiary.org/archive/2010/05/02]