Hatena2007-11-21
code:hatena
 <body>
 *1195641084* What is random sorting lol?
 I don't know who came up with the idea that if you give a comparison function a "function that returns 1 or -1 at random" when sorting, you can shuffle, but I think the one who takes it seriously is the one who should take it seriously.
 
 For example, suppose the sort function is "quick sort that pivots on the first value in the list and sorts the list into larger and smaller values," as shown below. The comparison function is set to random.
 
 >|python|
 >>> def quicksort(xs):
 	from random import random
 	if len(xs) < 2:
 		return xs
 	pivot = xs[0]
 	left = []
 	right = []
 	for x in xs[1:]:
 		if random() < 0.5:
 			left.append(x)
 		else:
 			right.append(x)
 	return quicksort(left) + [pivot] + quicksort(right)
 ||<
 
 So, let's shuffle [0, 1, 2, 3, 4, 5, 6] in that "random sort".
 >|python|
 >>> range(7)
 [0, 1, 2, 3, 4, 5, 6]
 >>> quicksort(range(7))
 [4, 1, 3, 6, 0, 2, 5]
 ||<
 
 Seemingly mixed.
 
 Then, we do it 7000 times and make a list of the 0th number of the result of shuffling. If the numbers are shuffled properly, the result should be "every number appears approximately 1,000 times", right?
 
 >|python|
 >>> sample = [quicksort(range(7))[0] for _ in range(7000)]
 ||<
 
 Then let's display it.
 
 >|python|
 >>> for i in range(7):
 	print i, sample.count(i)
 
 	
 0 108
 1 848
 2 1102
 3 1180
 4 1227
 5 1233
 6 1302
 ||<
 
 As you can see, the probability of 0 appearing is extremely small. The number chosen for the first pivot can only come first if "all the remaining 6 pivots are greater than that pivot," so it can only appear first with a probability of 0.5 multiplied 6 times. No matter where you decide on the pivot to choose first, the probability of that number coming first is very small. As long as quick sorting is used, this method does not allow for even shuffling.
 
 Studying programming is not a matter of taking a lot of things that someone somewhere has said, "You can do it this way," and storing them up. If you don't digest it until you are satisfied with it, no matter how much you swallow, it won't nourish you. To tell you the truth, I would like you to develop the ability to recognize a lie as a lie, but if you don't have that ability yet, you should at least try before you believe it.
 
 ---
 
 PS: I tried using Python's built-in sorted and found that the probability of occurrence still differed depending on the number.
 >||
 >>> sample = [sorted(range(7), cmp=lambda x,y:choice([-1,1]))[0] for _ in range(70000)]
 >>> for i in range(7):
 	print i, sample.count(i)
 
 	
 0 17581
 1 6827
 2 8807
 3 11613
 4 7611
 5 8089
 6 9472
 ||<
 
 *1195645100* hmmm
 I feel... kind of flustered...
 
 *1195655236* Conclusion of the Day
 Ways to improve your English:
 
 Create an English Blog
 Create a "Planet of Japanese engineers who want to create an English blog.
 Graph the amount of updates
 Find out about international conferences
 Follow all the gaijin on Twitter!
 I only write in English on Twitter.
 Write something like "I'm a Japanese high school girl who loves anime and would love to have a gaijin boyfriend☆" in your Twitter profile.
 
 ---
 
 ITmedia News: Six Apart's New Blog "Vox" Prevents "Flames" by Restricting Access
 http://www.itmedia.co.jp/news/articles/0611/16/news092.html
 
 >>
 He says that the former will be addressed by limiting the scope of public access, while the latter will be addressed through the "Question of the Day" function, which asks a different question each day.
 <<
 
 Maybe a "Question of the Day" feature?
 
 ---
 
 Hello, world! - Vox
 http://nishiohirokazu.vox.com/library/post/hello-world.html
 
 HAHAHA, I did it! The faster is the better! Now it is a problem I can continue to write in English.
 
 *1195661945*gerry++
 http://www.youtube.com/watch?v=bdWDJCKEh8k&feature=related
 
 gerry awesome!
 
 *1195662390*English training on twitter
 I made new account to use English on twitter!
 
 http://twitter.com/nishio_en
 </body>

[Hatena Diary 2007-11-21 https://nishiohirokazu.hatenadiary.org/archive/2007/11/21]