Hatena2008-11-26
code:hatena
 <body>
 *1227675010*山手線(3日目)
 品川→田町→浜松町→新橋→有楽町→東京→神田→秋葉原→御徒町→上野→鶯谷→日暮里→西日暮里→田端→駒込→巣鴨→？→池袋→目白→高田馬場→新大久保→新宿→代々木→原宿→渋谷→恵比寿→目黒→五反田→大崎→品川
 
 Ah, what is that between Sugamo and Ikebukuro? What is that thing where the streetcar Toei Arakawa Line intersects?
 
 
 Grading. Ahhhh, Otsuka, 28/29. That was so close! I was going to answer correctly here and do the next problem.
 The station is located between Sugamo and Ikebukuro, and the reason why the name "Ootsuka" was not mentioned was that it was a lost cause.
 Memorizing the names of symbols is hard to pull from memory, like peripheral information. It would be nice if there was a word association or origin. I don't know the origin of the name, but the place where Otsuka Station on the Yamanote Line is located was Sugamo Village when it was built, and the actual Otsuka is about 1 km to the south. Otsuka is home to Ochanomizu University, which is not located in Ochanomizu Station. It is located at 2-1-1 Otsuka, Bunkyo-ku, Tokyo.
 
 -----
 
 I had drawn this far yesterday, but completely forgot to press the "Save" button.
 
 Today's Test
 品川→大崎→田町→浜松町→新橋→有楽町→東京→神田→秋葉原→御徒町→上野→鶯谷→日暮里→西日暮里→田端→駒込→巣鴨→大崎→池袋→目白→高田馬場→新大久保→新宿→代々木→原宿→渋谷→恵比寿→目黒→五反田→品川
 
 Oops, for some reason it says "Osaki" where "Otsuka" is. Moreover, the position of Osaki has been switched with Shinagawa.
 </body>
 <comments>
 <comment>
 <username>まちゅ</username>
 <body>How about remembering it with "Yamanote Line of Love" (old)<br>http://www.nicovideo.jp/watch/sm1585961</body>
 <timestamp>1227702070</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I didn't know there was a song like this... <br>When I think of Asahi Kobayashi, this is what I think of: <br>http://jp.youtube.com/watch?v=nkyRbp2YXag</body>
 <timestamp>1227702964</timestamp>
 </comment>
 <comment>
 <username>Cherenkov</username>
 <body>Is the next question a chug of Coke? </body>
 <timestamp>1227739482</timestamp>
 </comment>
 <comment>
 <username>akamegane</username>
 <BODY>How about a replacement song? <BR>With a single steam whistle melody, it can be sung counterclockwise from Tokyo. The end does not go in neatly. My elementary school students often sing along. <BR>The melody is from Seto no Bride and can be sung clockwise from Shibuya. This one will fit nicely. <br>Both of these are a bit forced, but they stand on their own in a manner of speaking. </body>
 <timestamp>1227793314</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-11-26 https://nishiohirokazu.hatenadiary.org/archive/2008/11/26]