Hatena2013-01-17
code:hatena
 <body>
 *1358398714* Difference between Python and Ruby tuple-an-packing
 I was surprised to learn in our lunchtime chat that Ruby's tuple-an-packing does not produce an error even if the number of pieces is mismatched.
 
 If there is excess, it can be thrown away.
 >|ruby|
 irb(main):007:0> x, y = 1, 2, 3
 => [1, 2, 3]
 irb(main):008:0> x
 => 1
 irb(main):009:0> y
 => 2
 ||<
 
 If it is missing, it can be filled with nil.
 >||
 irb(main):010:0> x, y, z = 1, 2
 => [1, 2]
 irb(main):011:0> x
 => 1
 irb(main):012:0> y
 => 2
 irb(main):013:0> z
 => nil
 ||<
 
 Incidentally, in Python, a mismatch in the number of pieces will cause a ValueError exception to fly.
 >|python|
 >>> x, y = 1, 2, 3
 Traceback (most recent call last):
   File "<stdin>", line 1, in <module>
 ValueError: too many values to unpack
 ||<
 
 >|python|
 >>> x, y, z = 1, 2
 Traceback (most recent call last):
   File "<stdin>", line 1, in <module>
 ValueError: need more than 2 values to unpack
 ||<
 
 https://github.com/nishio/learn_language/blob/master/coderunner/test/tuple_unpacking.py
 
 *1358429692*Is "outsourcing" jobs to China smart?
 The "<a href='http://www.itmedia.co.jp/news/articles/1301/17/news025.html'>employee who was "outsourcing" his job to China without permission</a>" was smart The benefits of outsourcing to countries with different salary levels were discussed in our article published eight months ago (<a href='http://d.hatena.ne.jp/nishiohirokazu/20120428/1335612941'>Don't Salt Your Ideas - How to Get Help from Around the World</a>). Don't salt your ideas - how to get people from all over the world to help you</a>), and I already wrote about the disadvantages of outsourcing all of your company's work (<a href='http://d.hatena.ne.jp/nishiohirokazu/20120430/1335718079'> answer to Yoshiori's question</a>), so for me it's a bit too late.
 
 <div style="width:425px" id="__ss_12725054"> <strong style="display:block;margin:12px 0 4px"><a href="http://www.slideshare.net/nishio/ss -12725054" title="Don't Salt Your Ideas - How to Get Help From Around the World -" target="_blank">Don't Salt Your Ideas - How to Get Help From Around the World -</a></strong> <iframe src="http://www. slideshare.net/slideshow/embed_code/12725054" width="425" height="355" frameborder="0" marginwidth="0" marginheight="0" scrolling="no "></iframe> <div style="padding:5px 0 12px"> View more <a href="http://www.slideshare.net/" target="_blank">presentations</a> from <a href=" http://www.slideshare.net/nishio" target="_blank">nishio</a> </div> </div
 
 
 So, the story is about whether he was smart enough to outsource his work to China. He had them connect to the company's VPN without permission? I'd say he's an idiot. Throwing the whole thing in? I can only assume that he lacked the ability to separate the two so that it wouldn't become a problem. There are so many ways to do this.
 
 The specific tactic depends on the specific situation, but of course you can "persuade your boss", or you can "have them make the code you will need in the future as an open source project in advance", or "have them fix bugs in third-party libraries that are of high importance to you", or "have them work on another project that is unrelated to their work but has a lot of diversions to accumulate know-how on how to use the framework", etc. There are many alternatives, such as "have them work on another project that is unrelated to their work, but has many areas that can be used, in order to accumulate know-how on how to use the frameworks".
 
 My favorite of them is the "throw a side job" one. There is no need to think about separating them because they are not related to the business in the first place. It takes a lot of brainpower to think about it. And that's what I did in the project I introduced in my presentation. This project led to a contact from a Canadian company, and another project is currently in progress.
 
 So, you see, and I repeat this because it's important, outsourcing is smart, but doing it in a way that damages the company is stupid. We live in a terrible time when even such an idiot can outsource privately, now.
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4641161763" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 </body>
 <comments>
 <comment>
 <username>methane</username>
 <body>In Python 3, you can write x, *y, z and so on. </body>
 <timestamp>1358411556</timestamp>
 </comment>
 </comments>

[Hatena Diary 2013-01-17 https://nishiohirokazu.hatenadiary.org/archive/2013/01/17]