Hatena2014-11-21
code:hatena
 <body>
 *1416574524* Real-life examples of users confused by complex traffic flow sites.
 1: A mention on a social networking site leads to a news release: http://www.recruit.jp/news_data/release/2014/1121_15463.html
 2: Read to the end. I think it would be interesting to sign up for membership.
 3: Click on the link at the end of the page that says "Please click here for more information on this matter.
 4: It's a PDF and it doesn't say how to register, so what does that mean?
 5: Read it again from the beginning. It has a link. Why don't you put this at the end of the page as well... http://techlabpaak.com/
 6: There is no information on the menu about membership registration. If I had to choose one, I'd say CONTACT... -> No.
 7: Tried to go back but the menu is blown up so there is no way to go back.
 8: And it's designed without transitions, so the browser's back button doesn't even work...
 9: Do I have to scroll? Oh, is this the button at the bottom left that goes back to the top?
 10: INFORMATION. "▼ For those interested in becoming a member, please see 'Steps to Membership' in the NEWS section of TOPICS."
 11: No link, so back to the top again for NEWS... but there's no NEWS in the menu? →I'll look again -> is there NEWS in the TOPICS?
 12: I followed TOPICS→NEWS→Steps to become a member, but there is no information on the screen. I scrolled down, but a whole screen of images with no information appeared, which made me uneasy. Finally, one screen down, there was a content!
 13: "You need to attend the judging session in order to register as a member *Date and details of the "judging session" will be posted on the event page later.
 14: The link to the "Project Review Board" is again non-existent. Events page... back to the menu... no EVENTS... where is it...
 15: There was EVENTS parallel to NEWS under TOPICS!
 16: "There it is!" I was happy, but I couldn't find the information. My wife, who was watching from the side, said to me, "It says 'It will be uploaded on the event page later,' so it must not be uploaded yet," and I was depressed.
 
 Seems like you have to have a lot of patience to become a member...
 </body>

[Hatena Diary 2014-11-21 https://nishiohirokazu.hatenadiary.org/archive/2014/11/21]