Hatena2010-03-01
code:hatena
 <body>
 *1267431964*Living with Yourself Leverage Memo
 <a href="http://www.amazon.co.jp/gp/product/4862381480?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& I called <a href="creativeASIN=4862381480">Living with Yourself</a> and leveraged notes. I don't think I chewed it up very well. I'll have to read it again after a while.
 
 <hr>
 
 Live with Yourself, Live with Yourself, Live with Yourself
 
 Dig into what "can't be a person/customer" within yourself, rather than "outside indicators" of what is popular or profitable or how you should live.
 
 Ueki said, "I am now over 60 years old, and I don't know what I should do with my life from now on.
 
 A good project is not born out of an ambition to leave a legacy of one's existence to future generations," said Achille Castiglioni. A good project does not come from the ambition to leave your existence to posterity, but from the desire to make an exchange with a stranger who will use what you have designed.
 
 The way it is. The gift is to be. When the word "thank you" is returned for work, not "interesting" or "interesting".
 
 Books, people, and workplaces that present "what is the purpose of working" and "how we should live our lives" have a certain gravitational pull, but is this something that should be presented by others?
 
 There is an obsession with the phrase "do what you love to work" that there should be something you love to do. When you are depressed because you are not getting what you want, it points to where you want to be. When there are ripples on the surface of your heart, there is something beneath the surface that you cannot yet see.
 
 If you start, you will start. Unless you start, nothing will start.
 
 myself between myself and society.
 
 There is no need to call it self-satisfaction and despise it when you are satisfied doing what you want to do. It is the same as being satisfied with making and eating a delicious breakfast. But there is no need to announce it to society. When you don't feel like it's just your problem, you can ask someone who is living in the same time period, "What do you think? and offer it to those who are living in the same era.
 
 It may not be society as a whole. It may be a few people close to you.
 
 Freedom is not a plethora of choices, but originates from oneself, from one's own self.
 
 <hr>
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=FFFFFF&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=4862381480" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 </body>

[Hatena Diary 2010-03-01 https://nishiohirokazu.hatenadiary.org/archive/2010/03/01]