Hatena2011-05-17
code:hatena
 <body>
 *1305591007*MacBookAir Day 2 Diary
 The excellence of TimeMachine can be seen in the fact that there are more troubles caused by changing the keyboard from JIS to US than those caused by migrating to a new machine.
 
 - Problems caused by keyboard
 -- backslash to press Enter
 -- I changed to Ctrl+Shift+(j|;) →Command+Space to switch between alphabetical and Japanese input since the conversion key is gone, it's easier!
 --- When I enter QuickSilver with Japanese input, I was able to switch to English before, but now it gets mad when I switch? Is there a time when it doesn't?
 --- I was wondering if the history was not synchronized properly because sometimes it doesn't work when searching from the history in the Firefox address bar. I thought so, but this is a problem caused by Kana-Kanji input. When I went to the address bar in Kana mode and switched to English characters by pressing Ctrl+Shift+;, something assigned to "Ctrl+Shift" was activated. The address bar was also grayed out, pressing Ctrl-Shift again fixed it.
 -- I tend to press Option when I try to press Command because fn comes to the left end and the modifiers are shifted to the right by one.
 -- CapsLock is set to Ctrl. (Can be changed from the system settings)
 
 - Problems arising from the transition
 -- Wireless LAN access tied by MAC address, etc. will have to be reconfigured.
 -- <del>I tried to access the company groupware remotely and it didn't work. Certificate not installed? Unconfirmed. -></del>It was a careless mistake of accessing the wrong page, I didn't have to re-configure anything, including the certificate.
 -- GoogleIME was not installed (not in the "Applications folder" or something?)　I reinstalled it and it came back, including the user dictionary where I registered words.
 -- make, gcc and g++ were not synchronized. ghc in the same directory was synchronized, so I wonder if there is a blacklist blacklist that doesn't synchronize.
 </body>
 <comments>
 <comment>
 <username>kuenishi</username>
 <body>You can use Cmd+Space to switch between character input conversions. </body>
 <timestamp>1305592283</timestamp>
 </comment>
 </comments>

[Hatena Diary 2011-05-17 https://nishiohirokazu.hatenadiary.org/archive/2011/05/17]