Hatena2009-02-11
code:hatena
 <body>
 *1234341963* Akihabara Hackathon Diary
 During a hackathon at the HUB, I was taught evernote. I realized I need to read Guevara.
 
 
 Hackathon continues at Geek House 3. There is some kind of argh game audio playing, which makes it very easy to work on. <a href='http://ikunozama.appspot.com/cross_search/'>Ichnozama Cross Search - Where to buy the cheapest? </a>. I see that some books are very cheap overseas and some are cheaper in Japan.
 
 
 This is a lifehack that allows you to send a "to do today" message to your friends via GTalk, and while the "I declared it, so I have to do it" effect occurs, Google saves it so you can search for it later. The problem is that the "things to do today" and "things to be done today" are not always the same, so I need to change it to "TODO:" or something like that. My friend has very good project management skills, so when I ramble on about random ideas, he immediately tells me to "write it down in the Wiki.
 
 
 I'll have to look into the Amazon API a bit. Since the number of products on ikunozama has been increasing, it would be useful to be able to divide them into genres, such as "a page with only anime DVDs" or "a page with only music CDs".
 
 
 Only 3/4 of what I said I would do today is done. I wasn't going to finish the last one yet, so I'll just mkdir and commit and call it started.
 
 
 Google doesn't invest much human resources in AdSense? l10n is pretty cut-and-dried. The documentation is so badly translated that it's probably better to look at it in English. Wow, I was told that I can only use up to 30 characters for an identifier.
 
 *1234358747*Amazon Japan-England-USA cross search
 <a href='http://ikunozama.appspot.com/cross_search/'>Ichnozama Cross Search - Where to buy the cheapest? </a>
 
 I made it during the hackathon yesterday and today!
 
 *1234367644* Goose cable for e-mobile.
 I'm using a USB type e-mobile, but one of the cables was ruined and I was using an extra cable at random, but that too was becoming suspect (like when I changed my posture while chatting in bed and it disconnected), so I bought a new cable.
 
 f:id:nishiohirokazu:20090212005422j:image
 
 <a href="http://www.amazon.co.jp/gp/product/B000H1REZG?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=B000H1REZG">USB Goose Cable A-Mini B 15CM Black AUGM15BK</a><img src="http://www.assoc-amazon.jp/e/ir?t=ikunoz-22&l=as2&o=9&a=B000H 1REZG" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" />. This is a cable cover made of metal that keeps its shape when bent. The kind you sometimes see on water faucets and the like.
 
 
 I drop my e-mobile quite often when I move from one seat to another when I'm using e-mobile. When I move around with my notebook, it doesn't seem to occur to me that I need to put the connected e-mobile on top of the notebook so that it doesn't fall off. Of course, the e-mobile itself never hits the floor because it is connected by a cable, but in other words, all the energy of a fall is absorbed by the cable and the USB port. I think it is understandable that the cable is easily damaged. And this cable is so solid that the e-mobile does not fall off even when I carry it around. After using it, I thought it was a good idea.
 
 Some people may not like the fact that it tends to be bulky in a bag because it is a rather thick and small cable that is hard to put together. I am not so much concerned about the bulkiness of the cable, as I am a bulky person. id:akio0911 was very interested in it and said "I will buy it if it is not broken in a few months", so I made a public note to let him know when I bought it.
 
 
 References: <a href='http://blogs.yahoo.co.jp/pcjunkees/37718760.html'>PC Junkees' PC Junk Diary</a>
 
 *1234381704*YAML Heard Documents
 I heard a voice on twitter saying, "I wish YAML had something like a hyadocument," to which I replied, "Yes, it does," but it's not easy to find on Google, so I made an entry to make it easier to understand.
 
 
 Two quotes from section 2.3 "Scalars" of the reference (<a href='http://yaml.org/spec/1.2/'>YAML Ain't Markup Language (YAML&#8482;) Version 1.2</a>)
 
 >||
 # ASCII Art
 --- |
   \//||\/||
   // ||  ||__
 ||<
 
 >||
 name: Mark McGwire
 accomplishment: >
   Mark set a major league
   home run record in 1998.
 stats: |
   65 Home Runs
   0.278 Batting Average
 ||<
 
 Hey, it's not hard, right? The main difference from a heared document is that there is no end sign, but rather the indentation is used to represent the block.
 
 *1234382397* Google's web history is interesting.
 <a href="http://gyazo.com/f479008633058f7ddbd1515dce69e86f.png"><img src="http://gyazo.com/f479008633058f7ddbd1515dce69e86f.png"></a>
 
 
 For a moment, I thought, "This is a beautifully nocturnal lifestyle! but when I thought about it calmly, there is no such thing as "getting up at 19:00 every day".
 </body>
 <comments>
 <comment>
 <username>sasada</username>.
 <body>It's a HUB. <br># In Akihabara (abbreviation). </body>
 <timestamp>1234348764</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>It was a meeting room in a coffee shop called Corona -> moved to a smaller room because there were fewer people. We are looking for a hackathon venue in Akihabara area where we can use power supply! (grinning</body>)
 <timestamp>1234359241</timestamp>
 </comment>
 <comment>
 <username>akio0911</username>
 <body>I like it</body>.
 <timestamp>1234368545</timestamp>
 </comment>
 <comment>
 <username>jbking</username>
 <body>There is also a way to fix it with Velcro, as my brother a2c does. </body>
 <timestamp>1234373360</timestamp>
 </comment>
 <comment>
 <username>a2c</username>
 <body>If it breaks, next, I recommend velcro, available at 100s. one was enough for two people. </body>
 <timestamp>1234403190</timestamp>
 </comment>
 <comment>
 <username>Mami Sakamoto</username>.
 <body>There were four participants. We were quite frantic during the battle, so <br>we didn't see what was going on around us. <br>http://www.excite-blog.com/keywordRed/08080335665linmovesmm.zip</body>
 <timestamp>1235570974</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-02-11 https://nishiohirokazu.hatenadiary.org/archive/2009/02/11]