Hatena2011-06-09
code:hatena
 <body>
 *1307627920*MacBookAir Diary Summary
 What I did after restoring from a TimeMachine backup.
 - Installing Google IME
 - emobileの接続の設定: http://d.hatena.ne.jp/kudakurage/20090902/1251879000
 - Caps to Ctrl (System Settings → Keyboard → Modifier Keys)
 - gcc, make, etc. are missing, so Xcode needs to be included. <a href='http://connect.apple.com/cgi-bin/WebObjects/MemberSite.woa/wa/downloads'>Developer Downloads & ADC Program Assets</a>. Xcode can be downloaded free of charge from here. 4GB of Xcode is hard to use on emobile. You should do it in an environment with wireless LAN.
 -- Software update first, since it may not be possible to install unless the OS is the latest version.
 - Inform the network administrator of the new MAC address
 - apply a software update
 -- because the printer driver or whatever is missing.
 - Connect the TimeMachine backup disk and select "Reuse Backup". The backup can continue on the new machine, taking over the history of the previous backup.
 - iTunesを削除し/System/Library/Extensions/AppleMobileDevice.kextを削除してiTunes再インストール
 -- to solve a problem that causes the sync service to give error messages: http://www.donpy.net/standard-entry/tips/13704.html
 
 So far, that's all I've needed to get back to work on the new machine: Emacs and terminal settings, IME word registration, certificates for remote access to the office, remembering browser bookmarks, history and passwords, printer settings, etc., all have been restored. Super useful.
 
 ** The theory that iTunes de-authentication is required.
 <a href='http://support.apple.com/kb/HT1420?viewlocale=ja_JP'>iTunes Store の認証と認証解除について</a>
 >>
 When the number of computers that can be authenticated reaches 5, the number of authentications can be reset by clicking "Unauthenticate All" on the Apple Account Information screen. ...Note: This feature can only be performed once per year. The "Deauthorize All" button will not appear if you have less than 5 authorized computers or if you have used this option within the last 12 months.
 <<
 So it turns out that we don't have to do it now.
 
 **Reference
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20110515/1305465673'>MacBook Airを買ってきた</a>
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20110517/1305591007'>MacBookAir 2日目日記</a>
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20110522/1305990124'>MacBookAir日記3</a>
 
 *1307630086*"After 30, I memorized 3000 words English vocabulary memorization system" Day 3 Diary
 **前回の記事
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20110607/1307450595'>I started the "After 30, I memorized 3000 words English vocabulary memorization system"</a>.
 -<a href='http://d.hatena.ne.jp/nishiohirokazu/20110608/1307535139'>"After 30, I memorized 3,000 words, English vocabulary memorization system" Day 2 Diary</a>.
 
 **計測
 Less than 2 minutes for 14 tests. OK 13 NG 1
 Oops, I got one wrong....
 
 **Fatten the information on words you couldn't remember.
 I guess I didn't remember it even though it is written in both English in OALD and Japanese in Eijiro.... I think the other source is Wiktionary, which says that "diligence" is derived from the Latin word "diligere" (to love), which means "careful" or "attentive. I wrote "diligence" in Japanese, but it is not the image of "diligence and sweat" but rather "I'm going to make this work wonderful," and "I'm going to love it! and love" rather than "work hard and sweat it out. I don't know if this interpretation is correct. I'm not sure if this interpretation is correct or not, but in the process of researching, I saw that "legere" means to make an alloy, to merge into one, or to tie together! You're working in tandem with the project!" I thought it was Latin, but it's Norwegian and Swedish, so I guess it's a fluke. Like road and road are similar. But that's what word combinations are for, right?
 
 One pomodoro for making two new cards and getting to the point of writing the article above. I was a little unsure if I should increase the pile I'm studying because I'm down to one card, but tomorrow I'll get this card right and say, "Yay! It's empty!" and feel a sense of accomplishment before starting the next session would be better motivation.
 
 **Target Update
 - "I'll do it again tomorrow."
 - "Empty the study pile within a week"←This will indeed be accomplished tomorrow, since there is only one piece left.
 - "We'll do the first review phase tomorrow and measure time and percent correct."
 </body>

[Hatena Diary 2011-06-09 https://nishiohirokazu.hatenadiary.org/archive/2011/06/09]