Hatena2008-09-09
code:hatena
 <body>
 *1220921372*Chou-you
 It's already 9/9. I am a little relieved to be done with the deadly schedule of three presentations (three 40-minute, three 800-person, and three 40-minute presentations) in about 10 days because I took on too much unintentionally.
 
 I've completely forgotten where and what I'm supposed to present next, probably the 11th java-ja on 10/16, right? I'll check later.
 
 The house is in stunning disrepair. There is so much clutter that there is no place to step. I haven't been able to deal with the leftover vegetables I bought the weekend before to make a potluck. There is a small fly somewhere. The garbage bag was giving off a strange smell, so I threw it out. (Today is burnable garbage day.) When I wasn't cooking for myself, I could leave the garbage bag until it was full and take it out once a month or once every two months, but not when I start handling raw food. I think it's been maybe 3 weeks and it already smelled pretty bad.
 
 Also, both the lights in the bathroom and the toilet went out. I think they have gone out twice in a year and a half, but I don't know if they are that bad. Maybe it's not the right model.
 
 -----
 >>
 id:TOKOROTEN
 Toilets and baths are repeatedly turned off and on, so they deteriorate considerably with the number of times they are turned off and on.
 Light bulbs and such are made to be kept on for a long time at their rated capacity.
 <<
 
 Maybe I should switch to LED bulbs. The bathroom and bath don't need to be bright enough to read a book.
 http://plusd.itmedia.co.jp/lifestyle/articles/0801/25/news083.html
 http://pc.watch.impress.co.jp/docs/2006/0731/yajiuma.htm
 
 -----
 >>
 id:jj1bdx 
 At least use fluorescent lights > bath and toilet
 LEDs are not yet technically stable.
 <<
 
 I have an image that fluorescent lamps are vulnerable to repeated turning-on and turning-off of lights, but I wonder... When I looked at the price of LED bulbs, they cost 7,000 yen, so I thought it would be more fun to go to Akihabara and buy various glowing things and play with them (yeah!).
 
 *1220976764*The biggest reason I keep blogging.
 Google "Yasukazu Nishio cooks."
 
 >>
 I was not sure about the amount of water, so I added about 200 cc of 3 times concentrated sauce and 200 cc of water for 2 cups. If I remember correctly, there is about 250 cc of water per 1 pot, and 400 cc is reasonable for 2 pots after subtracting the amount of water from the vegetables.
 <<
 http://d.hatena.ne.jp/nishiohirokazu/20080902/1220362658
 
 >>
 # Not too sticky, but a little more watery. Not like okowa, but more or less starch on the rice caddy. After mixing, I left the lid open to let the water evaporate a little.
 # Strong flavor.
 <<
 http://d.hatena.ne.jp/nishiohirokazu/20080903/1220399883
 
 Hmmm. Well, I'll try reducing only the dipping sauce by 50cc this time.
 
 
 If you are going to write a lifelog-like blog, we recommend that you decide on a unique string that means "what you did" and always use it in combination with that string. You can usually find "what was that?" in a search. The weakness of this method is that your memory is (relatively) weak for content that is not publicly available; I've tried using howm and sending myself emails via GMail, but I don't find it as effective as blogging.
 </body>
 <comments>
 <comment>
 <username>TOKOROTEN</username>
 <body>Toilets and bathtubs are turned off and on repeatedly, and the number of times they are turned off and on deteriorates them considerably. <br>Because light bulbs are made on the assumption that they will stay on for a long time at their rated capacity. </body><br><br
 <timestamp>1220922321</timestamp>
 </comment>
 <comment>
 <username>jj1bdx</username>
 <body>Let's at least use fluorescent lights >baths and toilets<br>LEDs are not yet technically stable. </body><br><br>LEDs are not yet technically stable.
 <timestamp>1220929096</timestamp>
 </comment>
 <comment>
 <username>jj1bdx</username>
 <BODY>The bulb type fluorescent lamp works normally. The only problem is that the inverter is susceptible to heat generation. This has been improved recently. </body><body
 <timestamp>1220937890</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-09-09 https://nishiohirokazu.hatenadiary.org/archive/2008/09/09]