Hatena2011-10-13
code:hatena
 <body>
 **1318509840* "The Idea Method" by Jiro Kawakita
 I found it on my wife's bookshelf, so I casually picked it up and flipped through it, and I couldn't help but say something like, "Wow! If you are interested in mind mapping and photo reading, you should definitely read this book.
 
 On the door of each chapter, you'll find the story of that chapter like this
 f:id:nishiohirokazu:20111013214054j:image
 
 Although this book was written before mind mapping and photo reading were created, it is interesting to read it and think, "Oh, this is about soft focus in photo reading, isn't it?
 
 I think it is well known that the KJ method is a bottom-up structuring method where you write things down on cards and then put them together, but the key "putting it all together" part, the story of spreading out the cards and "looking at them rather than reading them," "just glance at them anywhere," "eventually (omission) you will feel close to each other. The pieces of paper will become familiar to each other," and it's exactly like the whole "look at them without reading them, and important keywords will emerge" thing with photo reading.
 
 Compared to mind mapping, which is a top-down structuring method, the KJ method is a bottom-up structuring method, and the book says quite a bit about why top-down structuring is a bad idea. Roughly speaking, new ideas are born from finding connections between facts that would be split up by the preconceived categorization structure that many people assume, so categorizing the collected fact cards according to preconceived ideas is meaningless. Of course, if the purpose is to find "new ideas," then mind maps are meaningless, but if the purpose is to understand existing concepts or the contents of books, then mind maps are not a bad way to go. I think we should use them in different ways depending on the purpose.
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4121001362" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe><iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4121002105" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 </body>

[Hatena Diary 2011-10-13 https://nishiohirokazu.hatenadiary.org/archive/2011/10/13]