Hatena2007-11-15
code:hatena
 <body>
 *1195097481*Erri
 
 What's with this dress, the gable is bent inward.
 
 but it was the reverse side of the reverse.
 
 *1195101132* natural isomorphism
 I studied the theoretical background of monads on the train on the way there, but I didn't understand natural isomorphisms. I would like to have an actual example.
 
 *1195101704* We need to add a topic modifier to the org how to write.
 I forgot all about it.
 
 *1195113375* How to write bilingual data in org.
 I have written a lot of bilingual data here and there, and it would be a waste not to publish it, so I will write about it as a topic of how to write orgs.
 
 It would be tedious to do them all at once, but I guess doing them one at a time, one a day, would be just right to provide a topic of discussion.
 
 It's also training for my continuity.
 
 *1195115277* maybe.
 I think there will be a new entry on how to write org tomorrow, but maybe it won't be at the top. I don't think it will be at the top of the list where it is sorted by ID. Well, if there is any problem, I will fix it.
 
 *1195116698* How do you write an edit of a subject that has already been submitted?
 Yah, if you set OK to edit a subject that has already been submitted...
 
 - Is it possible to move an already submitted subject to a draft?
 - It seems like it's possible to move a topic that has already been submitted to a topic by saying, "Sorry, it was absurd to include this in the denominator of coverage.
 - I'm supposed to do a lot of things to the "state" part of the form, and I doubt I can successfully handle it without copying and pasting the topic submission form.
 - I don't want to complicate the checks that are now simply "the state does not take the value of 'submitted subject'".
 
 What a hassle, and if you NG it.
 
 - In the part where you give out the edit form, if it's a subject that has already been published, don't give it out.
 
 I can easily do that, but can I use NG?
 
 In the future, when the comments are edited, you will be able to edit the comment part of the subject.
 
 *1195118568*4096
 Yes, soon the number of comments on how to write org will reach 4096. Kiri number w
 
 But aggressive spotlighting of Kiri numbers may induce low quality posts by Kiri getters. Let's keep quiet about it.
 
 *1195118759*Cache Decorator
 I will write a commentary on the company blog later, maybe.
 
 >|python|
 def deco_cache(expire=86400):
     def decorater(f):
         def decorated(*args, **kw):
             from django.core.cache import cache
             key = f.func_name + str(args) + str(kw)
             result = cache.get(key)
             if result:
                 return result
 
             result = f(*args, **kw)
             cache.set(key, result, expire)
             return result
         return decorated
     return decorater
 
 ||<
 
 *1195119960*CodeRepos
 I thought it would be a good idea to include it in Hatena Notation Parser and CodeRepos.
 
 *1195121158*Eye strain
 calling attention
 
 *1195121933*Magic Classification
 - Blue Magic - http://ja.doukaku.org/comment/3557/
 - Yellow Magic - http://ja.doukaku.org/comment/1823/
 - Black Magic - http://ja.doukaku.org/comment/2580/
 - White magic...?  - http://ja.doukaku.org/comment/3463/
 - Red Magic - http://ja.doukaku.org/comment/2857/
 - Ancient Magical Languages - http://ja.doukaku.org/comment/3178/
 - Ninjutsu - http://ja.doukaku.org/comment/928/
 
 ---
 
 As I was walking home, I noticed somewhere earlier, "What about Time Magic?" The answer to the question "Time magic breakpoints!" I think it's "And Sutupjikkooooo."
 
 *1195125473*Two tips about Firebug
 Firebug command line is hard to read, so I changed the font - cloned.log
 http://d.hatena.ne.jp/cloned/20070808
 
 The LargerCommandLine font (the one that appears larger on the right side) is larger, but the one-line input field below the console is not.
 I don't know how to find out the name like fbLargeCommandLine specified in the CSS above. I've googled it but can't find it.
 So I gave up and decided to use the larger text LargeCommandLine. The reason I had not used this before was that it was a hassle to press the small Run button every time. It's a hassle to erase it every time. Is there any better way?
 
 Ctrl + Enter to execute, Esc to delete! It's a very easy-to-understand UI design!
 
 I will use LargeCommandLine from now on.
 
 ---
 
 Postscript:
 Firebug hotkey reference - Aptana
 http://www.aptana.com/docs/index.php/Firebug_hotkey_reference
 
 F12 to close and open! Ctrl + Shift + C to Inspect!
 
 ---
 
 Postscript:
 I see, I should have seen it called XUL.
 http://www.google.com/codesearch?hl=en&q=+package:fbug.googlecode.com+fbCommandLine+show:zp4jixZljDE:enniAyMdo3M:lnqSbc3PGc4&sa=N&cd=2&ct=rc&cs_p=http://fbug.googlecode.com/svn&cs_f=trunk/content/firebug/firebugOverlay.xul#l183
 I wonder if this is it.
 
 *1195126366*Insurance
 I thought I could write it tomorrow, the deadline, because it is the usual declaration form for moving dependents' deductions for salaried employees, but there is something unfamiliar: an application form for insurance deductions.
 I thought I didn't need insurance because I didn't mention it, but they said I had to check because I was given earthquake insurance when I rented the house. I have to look for those documents. It's probably in the mailbox. I'll look in the mailbox when I get home.
 
 *1195138784*RoR
 AoE AoM AoE AoM RoR
 
 *1195142909* What does PHP stand for?
 http://twitter.com/ujihisa/statuses/416994452
 >>
 PHP is Python Haskell Perl, right?
 <<
 
 HSP stands for HyperCard Squeak Processing, right?"
 
 I wonder if anyone will write a
 </body>
 <comments>
 <comment>
 <username>cloned</username>
 <body>The ID was checked by looking directly at Firebug's XUL. </body>
 <timestamp>1195133275</timestamp>
 </comment>
 <comment>
 <username>pateo</username>
 <body>That ROR ruined my college years</body>.
 <timestamp>1195182080</timestamp>
 </comment>
 </comments>

[Hatena Diary 2007-11-15 https://nishiohirokazu.hatenadiary.org/archive/2007/11/15]