Hatena2009-10-14
code:hatena
 <body>
 *1255498505*Apply to AppStore
 Aside from the lack of functionality, it now works without any problems, so let's quickly apply to the AppStore and see what happens.
 
 References: http://developer.apple.com/iphone/manage/distribution/appstore.action
 
 >>
 Unique Stock Keeping Unit (SKU) for each major version of your application
 <<
 
 What? What's that? Oh, it's a common noun. http://en.wikipedia.org/wiki/Stock-keeping_unit Well, it's an application identification code.
 
 Go to iTunes Connect; you can log in with your Apple Developper Connect account. I guess I should choose "Manage Your Applications: Add, view, and manage your applications in the iTunes Store.
 
 The Company Name field is "company or developer name", so I guess you can use your own name.
 
 It says SKU should be NUMERICAL, so I decided to use 0000. It's my first app. I didn't think about keywords, but it says you can't modify them when you first register.
 
 The support URL is http://www.nishiohirokazu.org/にしておく for now
 
 Next is the rating information. Well, there is no sex or violence in it, so I chose the lowest of all and finished easily.
 
 Uploading application binary, large icon 512x512, screenshot, in progress. It's a pain in the ass because I have to wait for it to upload before I can select the next one. Only for the last screenshot upload, do I have to choose all the files to upload and then upload them all at once?
 
 There are several pricing tiers available, and if you choose Tier 1, the price is 115 yen in Japan, 99 cents in the US, and so on.
 
 >>
 You do not have a contract in place for the price tier you selected. To make your application available on the App Store, you must have an active Paid Applications contract.
 <<
 
 I tried to pay for it, but was told that I need to pay for the Paid Applications contract first.
 
 Here you can select additional languages to be displayed in the AppStore. In this case, we only have English available, so skip this step.
 
 I thought there was a phase to reorder the screenshots, but there isn't. The ones I choosed are in order of newest to oldest, so it's the opposite of the flow of operations. I'll redo it.
 
 When I did the pending upload of the app itself, I was pissed off like this. I was not given any information on what kind of app to make during the application process, so I read the documentation.
 >>
 The binary you uploaded was invalid. The signature was invalid, or it was not signed with an Apple submission certificate.
 <<
 
 <hr>
 http://developer.apple.com/iphone/manage/certificates/team/howto.action
 I'm signing with a certificate made under "Development" in the "Development" section, but it seems I can't go without using a certificate made under "Distribution". ref. http://wiki.minaco.net/index.php?iPhone%2F%E7%94%B3%E8%AB%8B%E6%96%B9%E6%B3%95
 
 >>
 You currently do not have a valid distribution certificate
 <<
 
 It says, "I'm in the process of creating and uploading a CSR as written on . I'm just going to request this...I made a CSR as it says on http://developer.apple.com/iphone/manage/certificates/team/createDistribute.action and it's uploading now. Waiting. Downloading. Double click.
 
 Now, the next step is the distribution tab of provisioning. It says that there is no distribution method, so I create a new one, and a screen comes up to select Distribution Method: App Store, Ad Hoc, and so on. I see, so this is how it works.
 
 <img src="http://gyazo.com/efb94721bc567f4e7363e5d0a2e9f666.png">
 
 <hr>
 
 After this, while uploading the re-signed application, I was trying to get a Paid Applications contract, but for some reason I couldn't connect to iTunes Contact, and after a few minutes I asked someone and they said, "What? It's connected!" I restarted my browser and it connected! I restarted my browser and it connected!
 
 <hr>
 Complete the Paid Applications contract process.
 
 Contact Info. Well, I put in my own address.
 
 Bank Info. didn't expect to be asked for my address out of the blue. Bank address, SWIFT and SBA code are required.
 http://www.swift.com/home/index.page?lang=en
 http://ap.plala.jp/bank/
 The bank address shows up in the SWIFT search. Also, I knew the Zengin code but got stuck on how to write it. In my case, it's Mizuho Umeda branch, so it's "0001-460" I tried to put only 0001 or 0001 460 and it was rejected. ref. http://www.iphonedev.jp/iphone%E3%81%AEapp%E3%82%92%E5%A3%B2%E3%82 8b%e3%81%9f%e3%82%81%e3%81%ab/
 
 Tax Payment; 3. I set Type of Beneficial Owner to indivisual (individual); 4. Also, they persistently ask me if I have any employees or assets in the U.S. I think this is necessary for exemption from U.S. income tax. I think this is necessary to get exemption from U.S. income tax. I check the box that I swear I don't exist.
 
 Phew, I'm done. I'm afraid it says that modifications can't be made on the web, but, well, it's probably right.
 
 <hr>
 
 Ah. I was using a previously created certificate that I had left lying around on my desktop, thinking it was a new certificate, not a newly created one. No wonder it didn't work. I guess I should clean up my desk every day, real or virtual.
 
 I no longer get angry when uploading binaries with different certificates, but now I am told this.
 >>
 The binary you uploaded was invalid. The bundle identifier is already in use by a different software package.
 <<
 The "identifier" was changed to org.nishiohirokazu.conicfilm or something like that, since it was set to yourcompanyunun or something like that.
 
 <hr>
 The message that appears when I choose to pay has changed. I just registered a while ago, so it hasn't become active yet, I guess it means wait a minute.
 >>
 Your contract for this price tier is being reviewed and is not yet active. Your application will be available on the App Store once your contract becomes active.
 <<
 
 <hr>
 
 Oh, I got it. Now all I have to do is wait.
 <img src="http://gyazo.com/b5fe6c9fc972944f883e2ae0229f4056.png">
 
 <hr>
 
 Ugh, I found a bug w Reject Binary, it seems you can replace the binary. ref. http://d.hatena.ne.jp/moroshi/20090906/1252251073
 </body>

[Hatena Diary 2009-10-14 https://nishiohirokazu.hatenadiary.org/archive/2009/10/14]