Hatena2008-01-18
code:hatena
 <body>
 *1200671667* with a bloodlust.
 I was moving furniture in preparation for tomorrow's 1,000 speaker conference when I caught my finger and it bled.
 
 *1200674034* A group of people looking at Mr. Sake Toku and grinning.
 I went to a party where we sipped sake while grinning at Sakatoku-san, the perezvon.
 As usual, this diary is quite appropriate.
 
 Unfortunately, it was not a grin-inducing development.
 Talk to jbking about the least squares method (http://www.ritsumei.ac.jp/~hirai/edu/2003/algorithm/handout/lms.pdf or
 I heard great stories about the physical layer in Voluntas and the sister next door.
 I asked perezvon how to score 990 on TOEIC.
 
 ----
 
 http://d.hatena.ne.jp/Voluntas/searchdiary?word=%2a%5btonari%5d
 My Neighbor's Sister" is now on sale to rave reviews.
 >>
 I was using a flathead screwdriver to uncork ginger ale.
 
 Incidentally, it was dented by a failed attempt to uncork the bottle.
 <<
 They may or may not aim for a second dropdb, and those around them may decide to aim for it on their own.
 However, I heard that it can make a router or a switching hub (I'm not familiar with infrastructure, so I don't remember which one it was), so it's actually amazing. Don't underestimate it just because you can't uncork a bottle of ginger ale!
 I thought that those who are determined to be the best should go to the second meeting with the sister next door and fight fiercely.
 
 I can't do it.
 
 ----
 
 Postscript:
 Voluntas said that RAID is 6, so let's have a place to fight id:wadap anyway. (I want to watch from the sidelines)
 
 *1200676492* Methods to put in LDR and not read
 When busy, the LDR is not opened.
 So I didn't read id:jbking's entry.
 
 Writing a Genetic Algorithm - Y's Sandbox
 http://d.hatena.ne.jp/jbking/20080117/p1
 
 Let's see. They said they would eliminate the low scoring 80% and randomly select from the remaining 20% to make a child.
 And am I right in understanding that when the child production phase ends, the parents of the previous generation themselves die?
 
 Suppose one individual K is born that happens to mutate and is close to the answer (highly rated).
 If that guy gets another mutation, there is a high probability that the evaluation will go down.
 If you crossbreed with other people, there is still a high probability that your reputation will go down.
 But that K dies after having a child, so only that "no good second generation" is left.
 At the very least, the "king" who is the most well-adjusted should be made to reign until he is defeated and killed by the generation below him!
 
 *1200677318*RAID
 http://ja.wikipedia.org/wiki/RAID
 
 In the meantime, I'll think about how 4+1, 5 and 6 are different next time.
 </body>
 <comments>
 <comment>
 <username>wadap</username>
 <body>It's like what to do with Parity! </body>
 <timestamp>1200675333</timestamp>
 </comment>
 <comment>
 <username>jbking</username>
 <body>This time, the parents are not dead yet. I'm trying a few different things and I'll refer back to this -. I mean, Fourier transform advice thx.</body>.
 <timestamp>1200692323</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-01-18 https://nishiohirokazu.hatenadiary.org/archive/2008/01/18]