Hatena2008-01-17
code:hatena
 <body>
 *1200590956*dropdbを問い詰める会
 I was invited by amachang to attend a meeting to question dropdb.
 This diary is quite appropriate.
 
 Highlights
 - I quit the bash hair club because someone stole my bash in high school.
 - NAS pickles are delicious, and NAS can easily be made at home.
 - Crypto something is interesting.
 - Where is port 80 and where is port 23?
 - Toggle switch to call the shopkeeper.
 
 Various others.
 At any rate, I am sleepy.
 
 ----
 http://d.hatena.ne.jp/wadap/20080117/1200589008
 
 Yes, yes it was.
 
 - Four plus one does not equal five.
 - Terrible statement that dropdb is fine because there is no lovecall
 - Brother Taizo! Thanks for the food!
 
 It's like.
 
 ----
 http://d.hatena.ne.jp/akiyan/20080118/1200617853
 
 Yes it was, yes it was.
 "I like RAID a lot, but what's your RAID preference?"
 RAID 5.
 'Oh well, I guess I'm 4+1.'
 Doesn't it add up to five!"
 It was like.
 
 wadap++
 wadap is similar to LDAP (in a sexual way, of course).
 
 ----
 http://d.hatena.ne.jp/dropdb/20080118/1200611111
 
 Oh, shoot. Forgot to say, "Unlike your blog, you're quiet." That was my chance! (><)
 
 >>
 A married couple? I was blown away when he said, "A married couple?
 <<
 
 No, it's not! No, it's not! I was only told that because we sat two people side by side on the short side of a desk in a private room with a chandelier! It can be about any x, even if it's not me! (><)
 
 ----
 - Planet GEEK > I've come face to face with my dead brother : ITmedia Alternative Blog
 -- http://blogs.itmedia.co.jp/geek/2008/01/post-6b57.html
 
 Brother! <del>Kyasuba r</del> Taizo brother!
 
 >>
 Someone was giving off a whiff of Python in every word.
 <<
 
 I indent even in drinking conversations. (Yeah.
 
 >>
 I am happy to have a brother who is so talented that his mouth is not able to keep up with the speed of his mind and his output device.
 <<
 
 The encoding part is slow...I need a light cable to my brain. It's already smudging.
 ----
 http://d.hatena.ne.jp/dropdb/20080118/1200626705
 
 >>
 Kensyuu something like, "Everyone is a man today! I'm a man today!
 <<
 
 Come to think of it, that's what happened.
 
 I was so surprised to see how depressed yukoba was when she found out that lovecall was not going to be there! He had no choice but to try to use dropdb as a substitute! (exaggeration)
 
 >>
 I benefited from a little explanation of functional programming in Haskell.
 <<
 
 This is!
 I'm glad to see that the flag has been raised for a "Haskell study session broken down so that dropdb can understand it"!
 # I want to go listen
 -----
 Thank you all for your hard work!
 </body>
 <comments>
 <comment>
 <username>mizzusano</username>
 <body>The toggle switch to call someone at the store is a wow factor</body>.
 <timestamp>1200612827</timestamp>
 </comment>
 <comment>
 <username>wadap</username>
 <body>It's wadap, but I don't like ldap! </body>
 <timestamp>1200626994</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-01-17 https://nishiohirokazu.hatenadiary.org/archive/2008/01/17]