Hatena2011-09-22
code:hatena
 <body>
 *1316648688*howm and blog use
 I got this question and I'll try to answer it:.
 >>
 This has nothing to do with the contents of your diary, but I see that you use howm. How do you use howm and Hatena Diary?
 Do you usually take notes from howm -> only the important ones, and then transcribe them to hatena afterwards? That seems to be quite difficult....
 <<
 
 Hmmm... I hadn't thought of "using" them differently. If you were to ask me how I use howm and Evernote, or how I use Hatena Diary and Amoeba Blog, I would be able to answer the question, but I feel that I recognize that howm and Hatena Diary are two different things to begin with before I use them.
 
 I also write this blog post in howm. But this is to the extent that I am in the mindset of "I am not writing directly in the browser, but in an editor". Well... that's a lot of work... People tend to mistakenly think that what they see is all there is. However, bloggers have dozens of times more input/output than what they write about in their blogs, which they can't write about for various reasons, or don't write about because it's too much of a hassle. For me, I absolutely need a place to write down such information, and I am now using howm for that. Of what is written there, those that are suitable for publication and those that I originally intended to publish are reprinted on my blog.
 
 *1316702076*GTD Diary 4
 GTD books (<a href="http://www.amazon.co.jp/gp/product/4576082116/ref=as_li_ss_tl?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247& creative=7399&creativeASIN=4576082116">GTD for Beginners Stress-Free Organizing</a> and <a href="http://www.amazon.co.jp/gp/product/4576101714/ref=as_li_ss_ tl?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399&creativeASIN=4576101714">GTD Practice</a>). The first three parts of the book are as follows.
 
 I installed the Dropbox app on my iPhone and found that my task list, which is managed in howm on Dropbox, can be viewed on the iPhone without any problem. If you display the task list and press the star button, the list is arranged in the "frequently used items" tab, so it's easy to follow the list. The only problem is that I can't seem to edit them directly. I decided to put it in RememberTheMilk for now, because I should collect my ideas in the INBOX. If I write it down normally, it will be in the INBOX, so here it is. I made a list called "actions" to separate unorganized INBOX from reviewed actions.
 
 And many salted tasks in RTM! After reviewing them, two were moved to the ITUKA list. I will have to test if it is appropriate to use RTM for INBOX management. The batch shows the number of tasks due today, so what I put in the INBOX will be added to the number of tasks. Oh, that's OK, because there is a task "to determine which list to put in GTD" for each of the INBOX contents.
 
 In howm, if you write "<<<< Hoge" in the title, it will come to the top of the list when you search for "Hoge". Then, if you place the cursor on the ">>> Hoge" and press Enter, it will be searched for "Hoge". So it may be a good idea to use that for links from the project list.
 
 I have to clean up my room, but I haven't done it. This is another project. First, I did the task of finding out the garbage day. Next, I will do the task of scheduling what to throw away by when while keeping an eye on the trash date. The project must be clarified until the next action is decided. Otherwise, it will not be done.
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4576082116" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe><iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4576101714" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 </body>

[Hatena Diary 2011-09-22 https://nishiohirokazu.hatenadiary.org/archive/2011/09/22]