Hatena2008-02-21
code:hatena
 <body>
 *1203556673*I'm not feeling well
 
 Psychogenic.
 
 *1203582038* GoogleMap trap?
 I have not properly confirmed under what circumstances it happens,
 http://www.miraclelinux.com/corp/about/maps_google.html
 When I printed out the "What is the floor of the building?
 Under what circumstances would this happen?
 
 I noticed it before we left, so I was fine, but I would have been in a hurry if I realized after we left that I didn't have the crucial information~!
 
 *1203595830*Miracle Linux
 
 amazing (e.g. of strength)
 f:id:nishiohirokazu:20080221211024j:image
 
 *1203602368*[1000speakers] 1000 Speakers Conference the day after tomorrow
 There will be two projectors, so IRC will be projected on one of the screens. Network participants will also be able to participate via IRC! However, the problem is that people who are participating in the event will not be able to connect to the Internet. How can people at the venue participate in IRC? I have an e-mobile, so I don't have a problem, but I wonder if I can share the connection with others... If it's just IRC, it won't take up much bandwidth, so I think it should be okay to share it with a few people...
 
 Or is it possible to set up an IRC server on my notebook and relay it?
 
 I don't know how to solve this problem, so I wrote it down anyway. If you have e-mobile or something like that, I recommend you to bring it because there is a possibility that you won't find a good solution.
 
 *1203610267*nopaso
 
 I didn't bring my computer home today. No internet for a healthy life.
 </body>
 <comments>
 <comment>
 <username>Noboruhi</username>
 <body>How about using an IRC proxy like tiarra (requires perl)? <br>http://www.clovery.jp/tiarra/</body>
 <timestamp>1203602743</timestamp>
 </comment>
 <comment>
 <username>coji</username>
 <body>As we did at last week's rails study session, you can use your MacBook to share your e-mobile connection via wireless LAN</body>.
 <timestamp>1203602782</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-02-21 https://nishiohirokazu.hatenadiary.org/archive/2008/02/21]