Hatena2008-12-31
code:hatena
 <body>
 *1230671821*An interesting case of a 5th grader.
 <a href='http://ugomemo.hatena.ne.jp/0B3D19604CE04B2F@DSi/movie/E04B2F_08720FF94B42A_002'>Flipnote Hatena - Yuta's work</a>.
 
 Elementary school kids are so cute.
 By the way, I've seen a few comments here and there saying that the comments are not mature, but I think they are not. This is an age when a 5th grader can post a video with audio and get this much attention. It is hard to imagine that he is the only child in his class with Internet access, and it is also hard to imagine a 5th grader doing something so flashy and not talking to his classmates about it. If there is only one child who uses Hatena, and that child has only a DSi, would there be a trend of "Put millions of Hatena Stars on it! would happen? If there are several children who have used Hatena Hike or similar services, and getting a lot of Hatena Stars is equivalent to catching a big beetle in the old days, this kind of phenomenon will not occur unless it is recognized as a value among children.
 
 I imagined that "many of the users who are beating on the site are unusually poor in Japanese" and "if 96 of kakusi-96 was born in 1996, he would be in the 5th or 6th grade of elementary school".
 
 Of course, I don't deny the possibility that Dokukinoko is a junior high school student who is jealous of the attention that someone younger than herself is getting. If Dokukinoko, who is desperately beating a 5th grader from start to finish, happens to be in her late 20s or older, I would be seriously pessimistic about the future of Japan.
 
 *1230735119*Kanji memo for unreadable kanji
 They are doing a show called "New Year's Eve Miscellaneous King. They are playing a game where you have to answer the reading of a kanji in a time trial. I write down the kanji I couldn't read to remember them later.
 
 alternately
 False: I wonder if I'm right
 serow: serow
 Blue Jade: Sapphire
 Winding: undulate
 
 
 I didn't know that. I didn't know that.
 
 *1230748866*A review of this year's blog (March)
 >From the flow of things, today the 30th should be a review of the March entries, but it is already 26:00 because I went to a year-end party with my high school classmates.
 
 Yes, it is already the 31st.
 
 Yes, and the year has begun. I really wish you a happy new year.
 I finally got around to summarizing March. I don't think I have summarized much.
 
 -http://d.hatena.ne.jp/nishiohirokazu/20080303/1204538646
 A story about trying CLOS. There are various ways to dispatch methods depending on the language. Related:
 -http://d.hatena.ne.jp/nishiohirokazu/20080304/1204604699
 Talk about multiple dispatches.
 
 -http://d.hatena.ne.jp/nishiohirokazu/20080304/1204618942
 A story about staticmethod not being a method
 
 -http://d.hatena.ne.jp/nishiohirokazu/20080306/1204804005
 Talk about mixing old and new Python classes. It makes for a good negative campaign if you use it to make weird puzzles (yeah).
 
 -http://d.hatena.ne.jp/nishiohirokazu/20080307/1204893212
 About Method Resolution Order
 
 -I bought a MacBook.
 --http://d.hatena.ne.jp/nishiohirokazu/20080305/1204693950
 --http://d.hatena.ne.jp/nishiohirokazu/20080306/1204774379
 
 -NodeBox
 --http://d.hatena.ne.jp/nishiohirokazu/20080308/1204951902
 --http://d.hatena.ne.jp/nishiohirokazu/20080308/1204952714
 --http://d.hatena.ne.jp/nishiohirokazu/20080308/1204955802
 --http://d.hatena.ne.jp/nishiohirokazu/20080308/1204979033
 
 -http://d.hatena.ne.jp/nishiohirokazu/20080310/1205132595
 Haribo Dispersion
 
 -http://d.hatena.ne.jp/nishiohirokazu/20080315/1205584956
 Shibuya.abc#1 Distribution memo
 
 -http://d.hatena.ne.jp/nishiohirokazu/20080315/1205545299
 The supply of the problem
 
 -Python Quiz
 --Issue: http://d.hatena.ne.jp/nishiohirokazu/20080317/1205758607
 --Answer: http://d.hatena.ne.jp/nishiohirokazu/20080317/1205760512
 
 -http://d.hatena.ne.jp/nishiohirokazu/20080318/1205833455
 How to hit Grawl in Python
 
 -http://d.hatena.ne.jp/nishiohirokazu/20080319/1205909204
 Expressions equivalent to Python's if statements are realized with an appearance as close to an if statement as possible.
 
 -http://d.hatena.ne.jp/nishiohirokazu/20080319/1205915488
 Played with Grapher.
 
 -http://d.hatena.ne.jp/nishiohirokazu/20080319/1205898311
 \How to put all the files together into a single Јn. I wonder why these memos are usually made into entries in Japanese blogs as memos, but not in English blogs. I think it is because of such difference in treatment that English blogs are not updated enough.
 
 -http://d.hatena.ne.jp/nishiohirokazu/20080328/1206726363
 FizzBuzz with Regular Expressions
 
 -Haskell Hackathon
 -3rd 1000speakers http://d.hatena.ne.jp/nishiohirokazu/20080323/1206221953
 -nipotan nite
 
 *1230749118* Oh, right.
 It was still 27:44 on December 31, 2008 because I set the blog date to switch at 5:00 in the morning. Let's go to sleep. I guess I can call the dream I'm about to sleep the first dream I've ever had. I'm of the school of not remembering dreams.
 </body>
 <comments>
 <comment>
 <username>kakusi-96</username>
 <body>I'm kakusi-96, but<br>I'm not in elementary school</body>.
 <timestamp>1230701553</timestamp>
 </comment>
 <comment>
 <username>kakusi-96</username>
 <body>continued<br>96 was just added at random</body>.
 <timestamp>1230701629</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>The reason I started out<br>with 96 is because I set it as the year my brother was born. <br><br>In addition, I'm not in elementary school, so it's interesting that it was written<br>and then it seems to have been edited. </body>
 <timestamp>1230721570</timestamp>
 </comment>
 <comment>
 <username>ramuzei</username>
 <body>This is excellent. <br><br>But I don't think it's interesting. </body>
 <timestamp>1230723374</timestamp>
 </comment>
 <comment>
 <username>kajuntk</username>
 <body>I thought Hatena only had old men, nerds and misunderstood women. <BR>I see there are young girls too. <br>That's good. I'm glad. </body>
 <timestamp>1230776043</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-12-31 https://nishiohirokazu.hatenadiary.org/archive/2008/12/31]