Hatena2012-12-27
code:hatena
 <body>
 *1356534244* I want to write more slushy lean canvas.
 What can we do to solve the problem of "writing more slushy Lean Canvas?"
 
 Wouldn't it be better to use a question format?
 
 ** Q1: Do you have a well-defined problem, solution, or customer segment?
 
 Question → Q20
 Solution -> Q2
 Customer Segments → Q10
 No → Q40
 
 ** Q2: What problem is solved by the solution?
 
 Engineers like myself tend to think "it would be good to make something like that". However, that "good" should be verbalized concretely and clearly.
 How exactly does creating it solve anything? It may inadvertently be "fun for me" instead of solving a problem.
 
 I was able to verbalize the specific problem to be solved -> Q3
 
 ** Q3: Who has the problem?
 
 Could verbalize → Q4
 
 ** Q4: Who will pay for the solution? And what is the compensation?
 
 The person who pays is not always the same person who has the problem. For example, if a child has a problem keeping up with schoolwork and starts cram school, it is the parents who pay. If the goal is to monetize through advertising, it is the advertiser, not the user.
 
 The consideration is not necessarily money. What other actions are profitable for you? For example, referring others to me is a benefit, or emailing me about improvements is a benefit.
 
 Don't know → Q5
 
 ** Q5: Are you pursuing "assured success"?
 
 There is no such thing as "assured success" to begin with. The reason you can't come up with a customer after a little thought is because you are trying to come up with a "sure-fire customer. No matter how much you think about it, you will never come up with such a thing.
 
 It is important to form a hypothesis that "there might be a customer here" and begin taking action to test that hypothesis. Observe the results carefully and consider "where there are more likely to be customers".
 
 
 ** Q10: Does that customer include you?
 
 If you are trying to target activities internally, or if you are trying to improve retention and satisfaction of existing customers rather than attract new customers, the customer may be identified before the problem or solution.
 
 In this case, it is important to know how closely you can communicate with your customers. Does the customer include you? Do you have a chance to observe your customers? Or do you have to set up a survey or interview to meet the customer?
 
 
 ** Q20: How do you solve that problem?
 
 
 ** Q40: What are you good at?
 
 (hereafter referred to as TODO)
 
 ** Unorganized Q
 
 How big is the market?
 How do we reach our customers?
 How do we stir up demand?
 How do we make money?
 What is the price of providing a solution?
 Are the customer segments clear enough? Can you visualize the customer image clearly enough that you can act on it? Can the segment be further detailed by breaking it down into smaller segments?
 What is the catchphrase that makes customers say, "Whoa!
 What is the minimum implementation to solve the problem?
 What is the minimum demo that will convince the customer that a solution to the problem is possible?
 What is the minimum action to verify if there are customers? (e.g., not making a product, just making a promo video)
 What are the actions that users can take that will benefit them? What of them can be measured quantitatively? What are the most important of them?
 What channels can be used to get customer feedback?
 What methods can be used to observe customers?
 What are the usable channels to let customers know about the product?
 What are the costs involved?
 How do we generate revenue?
 What are the barriers to entry?
 
 *1356582324*Pyspa Advent Calendar
 I had no idea about the theme, purpose, target audience, etc. of the Pyspa Advent Calendar... and when I went through it, id:Voluntas told me to write it even if it was past Christmas.
 
 I don't need to write about what Pyspa is or what a great event it is, because other people have already written about it. So I will write about something negative, which I rarely write about.
 
 
 ** Community activities are not my thing.
 
 I've noticed recently that I don't seem to like community activities very much.
 
 I don't know new people very well, and I can't be considerate of other people's feelings and try to make them feel comfortable, and I can't actively talk to and support people who are new to the group and are confused about the situation, unless I have a lot of energy and am in a high state of vitality. I think it would be very difficult to endure.
 
 So I don't participate much in terms of community activities these days. One of the few exceptions would be Pyspa.
 
 
 ** Because it's a spa trip.
 
 Pyspa is a spa trip consisting of about 28 out of 30 people who look familiar. It is not a development camp. It was a trip to a hot spring.
 
 I think this strategy of "keeping the ratio of regulars high" is the most wonderful part of Pyspa's operation. Well, it's just "for me", so it may be a hindrance for newcomers.
 
 By repeating the process in the same place as usual, mostly repeaters, the cost of operation is spread out and very low.
 
 Also, I can't remember any new people's faces or names, but since only two or three people are added at a time, well, I'm willing to give it a try.
 
 Well, even though I try my best, I don't actively talk to them. I just make sure that everyone participates in the meal and that I listen to the "self-introductions" at the meal.
 
 
 ** Donate if you have any left over
 
 I was reminded of this when I wrote that I like the all-meals rule. It is also a good idea to keep the amount of money collected to a reasonable amount (in decimal system) and donate the remainder to Python Software Foundation to reduce the cost of operation. It's a hassle to calculate the details of the money, and it's also a hassle to pool the money and use it next time.
 
 
 ** What are you doing?
 
 Let me also answer the question, what are you doing at Pyspa?
 
 On the first day, I brought the manuscript of the book I am currently writing to be reviewed, and I got a full-throated "you are absolutely right, there is no room for argument" situation, so I spent the rest of the day in a hot spring with tears in my eyes, playing board games and solving puzzles. It went roughly like this.
 
 Yes, the problem areas have been refactored quite busted. Thanks to everyone who reviewed it.
 
 
 ** Pyspa
 
 So, for me, Pyspa is an event worth paying tens of thousands of yen for.
 So I wish we could give more of these good things to more people,
 I also think that Pyspa will not be able to increase the number of people or new participants in order to maintain its value.
 
 So I guess I'll share some information about what was good about Pyspa's design so that others can refer to it when they decide to do something Pyspa-like.
 
 
 ** Small Start
 
 I think it is a good idea for various people to do Pyspa-like things, which has also been written many times by others.
 
 I've been saying that probably for years, but maybe some people have been frustrated trying to make the same thing Pyspa is now from the beginning.
 
 I think it's good to start smaller. I think the first step should be just to open a hole in the ground to allow a few other people to join in, such as a trip to a spa by members who know each other. I think it would be a good idea to have a few other people join in the first step.
 
 Pyspa also went through many trials and errors before it became what it is today. For example, we bought food for a barbecue, but a typhoon hit and wreaked havoc because of the organizer, who is a rain man, as usual. Or the case where Yoshiori was sleeping when I was sleeping and we didn't see each other until the last day of the event because our life rhythms didn't match up. There was a disagreement between the segment of customers who demanded quality food and hot springs and the segment of customers who didn't care about such things.
 
 Through a process of trial and error, we were able to gather a "supplier" in the form of the current venue and 30+α "customers" who were satisfied with the quality of the event, and we were able to continue to hold stable events.
 
 I guess the important thing is that the operator doesn't lose money in the process of trial and error. Of course, this is true from a financial standpoint as well, but it also includes things like not much to gain for all the hard work.
 
 
 ** and say
 
 It's terrible that you tell others to "just start small and do it," but you don't act on your own.
 
 I'm really sorry for being a free rider. I benefit from Pyspa in many ways because of the various people who run and participate in Pyspa.
 
 
 ** Summary
 
 We often hear the assertion that "community activities are a good thing." Certainly, when I recall my own experiences, I have gained a great deal from community activities.
 
 However, everyone is human and has times when they are unmotivated, and when they are unmotivated, they do not write blogs or go to study groups. People watching over the Internet cannot see when you are unmotivated because you don't blog, they can only observe your activities. And they will have an image of you that is more exaggerated than you really are.
 
 Then they compare themselves to this misunderstood image and say things like "I'm no good" or "I'm above the clouds. It is barren. How can you create psychological barriers for yourself?
 
 I think everyone should relax their shoulders more!
 </body>

[Hatena Diary 2012-12-27 https://nishiohirokazu.hatenadiary.org/archive/2012/12/27]