Hatena2009-02-26
code:hatena
 <body>
 *1235608056*家事
 The hot pot I made yesterday was unexpectedly delicious.
 
 
 I'll take care of this today.
 f:id:nishiohirokazu:20090226101130j:image
 
 
 I have a feeling it will go missing again if I don't make a "container for things I looked for but were missing." Sun visor and isodine.
 
 
 For now, I've isolated a change of clothes for the whole day tomorrow, and all the clothes I see will be knocked into cardboard boxes.
 
 
 A collapse occurred.
 
 
 I adjusted the length of the two elastics I bought yesterday so that the basket can be held in a tucked position.
 f:id:nishiohirokazu:20090226121721j:image
 f:id:nishiohirokazu:20090226123949j:image
 I made the magazine horizontally rather than vertically.
 
 
 I failed to take a picture of the LCD monitor on the bike, even though it looked pretty cool. It is okay even if you tilt the bike. Surprisingly solid.
 
 
 I had been saving empty cans with lids thinking I could use them for something, but I ended up collecting three of them without using them, so I guess I should leave one and throw it away.
 
 
 There was a bag of frozen pilaf left in the freezer, so I ate it.
 My hand went crazy and I dropped it and spilled a little. Oh dear.
 
 
 Carried the PC. It took 18 minutes to get out of the room and back to the room.
 f:id:nishiohirokazu:20090226144244j:image
 
 
 Even if you put it away.
 Tidied up and still a mess.
 Stare at your hands
 
 
 It doesn't look like it has been cleaned up much...at all!
 f:id:nishiohirokazu:20090226165032j:image
 
 
 It's only 5:00 p.m., we'll be fine. We have 23 hours to move in. Even if I don't make it in time, I still have 24 hours before I have to vacate my room, and since it took me 18 minutes for a heavy, careful, slow-moving thing like a PC, I can make three round trips an hour for something smaller. It's not like we won't make it in time.
 
 
 Turned off the freezer.
 
 
 Beyond this line is tidy! That doesn't mean it's tidy at all!
 f:id:nishiohirokazu:20090226193033j:image
 
 
 I mean, we keep too much of everything. If I haven't used something for two years since I moved here, I'm sure I won't use it in the future, so I should throw it away. But I haven't made up my mind yet, so if no one asks for it, I'll throw it away.
 f:id:nishiohirokazu:20090226193915j:image
 
 
 f:id:nishiohirokazu:20090226195817j:image
 
 
 Dated.
 f:id:nishiohirokazu:20090227001545j:image
 Are you okay?
 
 
 I am exhausted. Should I go to bed? The only real "thing to do today" is to take out the non-burnable trash. Even if I wake up at midnight tomorrow, I still have four hours to spare. Let's throw out the garbage and go to bed.
 
 
 There are three things I absolutely have to do tomorrow: empty the refrigerator, empty the washing machine, and disassemble the shelves and have them transported. The rest I can carry by myself if I work hard at it.
 
 
 I secured a place to sleep. Oh shoot, I've secured a change of clothes but not my sleeping clothes.
 
 - What you have to do today
 -- Pack everything in boxes (exception: tomorrow's clothes, tomorrow's bath stuff)
 --- I can carry enough bath goods in one basket, so let's not think about the inside of the bathroom today.
 -- Put out unburnable trash
 - What I have to do tomorrow
 -- Empty the refrigerator
 -- Empty the washing machine
 -- Have the shelves disassembled and transported.
 -- 4-6 p.m. Moving
 -- Put out burnable trash
 - I have to do it the day after tomorrow.
 -- Attend electric and gas outages in the morning
 -- Keep your PC in your bag so you don't have to waste time waiting
 -- 4:00 p.m., hand over the key (maybe wait in the new house because it's cold waiting in the old room with the curtains gone).
 
 <hr>
 - □ Put what you see in the box anyway
 - □ Transporting items that do not fit in the box by bicycle
 - PCs and other fragile items are carried on bicycles in a leisurely and safe manner.
 -- ■ LCD
 - Toilet paper
 - □ Carry halogen heaters?
 
 - Moving 2009-02-27 16:00-18:00
 - Prepare 31500 yen in cash on the day of the event.
 - □ Refrigerator must be emptied and turned off about 3 days in advance
 
 - Gas, electricity, and water service are available.
 -- □ Gas
 --- □ [2009-02-28 9:00]@ close witnessed by Gus 9-12
 --■ 水道
 --□ 電気
 --- □ [2009-02-28]@ electricity service stopped Coming to check meter in the morning of 28th.
 --- □ Turn off the stability breaker
 
 - □ Change of address of license
 - □ Wash the contents of the washing machine before moving
 - □ The notebook is full of old addresses and other information, so I will print it out and replace it in the near future.
 - Checklist so you don't forget to move
 -- □ Replace the water-saving shower head with the original shower head.
 -- □ Remove curtains
 -- □ Toilet paper
 -- □ 照明
 
 *1235625732*Pagination vs.
 <a href='http://info.dwango.co.jp/rd/2009/02/ruby-on-rails-mysql.html'>Ruby on Rails + MySQL で全文検索 - ドワンゴ 研究開発ブログ</a>
 >>
 StreetPasserby | February 9, 2009 at 11:29 pm Reply
 Pagination, yes.
 <<
 
 <img src="http://gyazo.com/be9f28748fe478d7ae718ba77a023289.png">
 
 Well, I guess pajinate is closer to the English pronunciation, but if we start talking about that, we would be talking about calling it bialas instead of virus, or genome instead of genome...
 </body>

[Hatena Diary 2009-02-26 https://nishiohirokazu.hatenadiary.org/archive/2009/02/26]