Hatena2007-12-21
code:hatena
 <body>
 *1198195415*Ruby FORUM
 Why is Python-ml looking for volunteers to run the event on the day of the event?
 
 -----
 
 I tried to click on the link "Registration / List of Participants", but it denied me access. Hmmm. I wonder if I need to create an account to see it. I guess some people might leave without knowing how to register.
 
 *1198198490*It's time to get out of here.
 I was wondering if Yodobashi Akiba opens at 10:00.
 When I went to Yodobashi in Kinshicho on my way home yesterday, there was a line of about 30 people, I think because it was during the after-work hours of the Christmas season. I guess I was the only idiot who took a paid day off first thing on Friday morning to come and buy it.
 
 http://d.hatena.ne.jp/inajob/20071215
 Inazu quickly made an infrared USB camera.
 
 I had no idea that Tsukuba Express was so close to such a dungeon. I missed to make a unique event. I missed a unique event. I lost time because I couldn't find the location of Akizuki, and I thought the infrared light-emitting diode was on the shelf of light-emitting diodes, but it was on the shelf of phototransistors.
 
 *1198205719* I'm an idiot, myself.
 
 I forgot to write down my contact phone number so I can't call to say I'll be one call late.
 
 *1198208841* at the general store in town.
 f:id:nishiohirokazu:20071221124631j:image
 
 *1198209959* Tower of Beginning
 
 Probably the easiest dungeon.
 f:id:nishiohirokazu:20071221130507j:image
 
 *1198214618*The Mysterious Box
 
 Do you want to have a friendly conversation? No, I don't.
 f:id:nishiohirokazu:20071221142243j:image
 
 I found a mysterious booklet.
 f:id:nishiohirokazu:20071221153654j:image
 
 *1198219348*Found a magic book of wishes to hold a student assembly.
 f:id:nishiohirokazu:20071221154141j:image
 
 *1198220269*Nikki Kan? I found a
 f:id:nishiohirokazu:20071221155659j:image
 
 Nixie tube - Wikipedia http://ja.wikipedia.org/wiki/%E3%83%8B%E3%82%AD%E3%82%B7%E3%83%BC%E7%AE%A1
 
 "cool
 
 *1198226796*Takesako Potion
 
 Found Takezako potion in AC room!
 f:id:nishiohirokazu:20071221174546j:image
 
 *1198227541* Mystery Rides
 f:id:nishiohirokazu:20071221175815j:image
 
 *1198227782* Poster introducing the laboratory
 f:id:nishiohirokazu:20071221180216j:image
 
 
 f:id:nishiohirokazu:20071221180627j:image
 
 **1198228363*Mystery chip found.
 
 According to Ueda-san's appraisal, it's a Pentium 3.
 f:id:nishiohirokazu:20071221181153j:image
 
 *1198228532*Amazing quality!
 f:id:nishiohirokazu:20071221181443j:image
 
 *1198231625*uder
 f:id:nishiohirokazu:20071221190612j:image
 
 *1198232461* ring finger is de
 
 I heard "Yoo" is easy to play.
 f:id:nishiohirokazu:20071221192008j:image
 
 *1198233927* Monster appeared!
 f:id:nishiohirokazu:20071221194436j:image
 
 *1198235903* Korean version now available!
 
 Let's study Korean!
 f:id:nishiohirokazu:20071221201729j:image
 
 *1198236887*udar
 
 I heard that it contains 400 sensors made of pressure-sensitive conductive rubber. All handmade. Amazing.
 
 *1198240145*Puncture.
 I had a BIG bowl of run-run rice!
 f:id:nishiohirokazu:20071221212806j:image
 
 
 f:id:nishiohirokazu:20071221221410j:image
 
 Glowing nails by Father Udder
 
 f:id:nishiohirokazu:20071221223101j:image
 
 They dance the Awaodori dance with it on.
 
 *1198245416*Current Status
 
 SoftEther is currently verifying a rumor within SoftEther that a mechanical pencil lead and battery will cut a cutter blade.
 
 A circuit to boost the voltage to 8,000 volts is apparently sold for 500 yen.
 
 *1198255212* Pikachihu's corpse
 
 So why do you go to public places to sleep for an hour.
 f:id:nishiohirokazu:20071222013919j:image
 </body>
 <comments>
 <comment>
 <username>Kimura(K)</username
 <body>As I said in a previous Ruby thread (at 2chan) when the email advertising the forum project itself went out, <br>You guessed right and you need to create an account to go to the registration/participant list link. <BR>Well, what can I say, I think you should leave without knowing how. <BR>In many ways. <br>#You don't think your name (email account) and the company you belong to will be <br>#disseminated to the ML<br>#but it is their understanding that they should have obtained that consent when they created the account</body>.
 <timestamp>1198201821</timestamp>
 </comment>
 <comment>
 <username>hayamiz</username>
 <body>I want a workbench. </body>
 <timestamp>1198241053</timestamp>
 </comment>
 <comment>
 <username>earth2001y</username>
 <body>As usual, this guy w</body>.
 <timestamp>1198279374</timestamp>
 </comment>
 <comment>
 <username>Yoshimi</username>.
 <body>Is this Kimura, a RubyKai ML in Japan? It's been a while. <BR>I don't mean to be too glib, but<BR><BR>I'm told from that source that it seems to be an event for people related to NTT executives. <BR><BR>I checked it out just now, and in terms of Kimura's phrasing<BR>I think it is a bit exaggerated and problematic. <BR><BR>I frankly felt it personally. I am sorry if it was rude. </body>
 <timestamp>1198322526</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I have no idea what you are trying to argue, but if this is a private letter to an acquaintance and you have no intention of writing in a way that can be understood by an unspecified number of people, I think it should be done in the comment section of a third party's diary. </body>
 <timestamp>1198422180</timestamp>
 </comment>
 </comments>

[Hatena Diary 2007-12-21 https://nishiohirokazu.hatenadiary.org/archive/2007/12/21]