Hatena2015-01-14
code:hatena
 <body>
 *1421209451* I read "Non-Quantitative Goals Have No Meaning" and thought.
 Regarding "<a href="http://cybozushiki.cybozu.co.jp/articles/m000409.html">Non-quantitative goals are meaningless</a>.
 
 First, there are advantages to quantifying goals. The advantage is that it makes it easier to divide goals. For example, if the goal is to "solve this 100-page problem book," then "First, let's do one page" → "I got one page! → "I got a sense of accomplishment! and so on, you can get a sense of accomplishment quickly and frequently. This has the effect of maintaining motivation.
 
 On the other hand, some things are easier to quantify than others. This is also true. For example, the number of lines of code written by a programmer is very easy to quantify. On the other hand, if deletion or extraction of common parts is prohibited in order to increase the number of lines, the code becomes harder and harder to read. This "illegibility" is difficult to quantify. Programmers who are forced to work with hard-to-read code feel strong "stress" and their "mental state" gradually worsens. This is also difficult to quantify. As a result, the incidence of depression increases, which can finally be quantified. ref. http://itpro.nikkeibp.co.jp/article/Watcher/20071220/289950/
 
 Since there are things that are easy to quantify and things that are difficult to quantify, the situation where "all goals are quantified" is a bad situation where "things that are difficult to quantify are left out of the goals. Therefore, many people are tempted to say "it is not good to quantify" or "stop quantification" in response to this bad situation. However, the essential problem is not that we have quantified goals that can be quantified, but that we have turned a blind eye to goals that are difficult to quantify in order to promote quantification. That is what needs to be resolved.
 
 So, to organize the advice, it would be "quantify your quantifiable goals" for "those who are not quantifying quantifiable goals," and "try to find non-quantifiable goals" for "those who are trying to quantify their goals and are losing sight of their non-quantifiable goals.
 </body>

[Hatena Diary 2015-01-14 https://nishiohirokazu.hatenadiary.org/archive/2015/01/14]