Hatena2008-01-01
code:hatena
 <body>
 *1199165132*The year's plans are made on New Year's Day
 This is why I am studying the Hyakunin Isshu.
 
 >||
 UPPER> Whether you know it or not, you can't tell the difference
 >>> This and that, and this and that, are all inseparable.
 lower> This or that, this or that, the frogs and the toads will be divided
 NG> This and this x and this kumo kaerumo wa wakareta wa
 ||<
 
 The second line is where I type.
 The source code will be uploaded to the server later because 100 lines of 100 data is annoying to post on a blog. Once it is cleared.
 
 >||
 up> Okima to haasare shiraki-no-hana (The white chrysanthemum that can be seen from the top)
 >>> If I had your heart, I would have done it myself.
 Down> If you count on my heart, you'll be the first to know
 NG> Kokoro yorena yorena x hatsushimono
 
 Ue> Waiting for the moon in the morning and wondering if it will be a crane
 >> I'm going to go now, and I'm going to stay a long time.
 I've got a long time to wait for the right moment.
 NG> Now I'm going to go to the beach.
 
 above> Nakakumo kanaka to omokakeru kanaka?
 >>> Even life is forbidden to you
 ok.
 
 Top: "If only I could see you, I'd be so worried.
 >> I'm so glad you're here.
 Lower> I want to be a good coach, but I'm not ready yet.
 NG> Koisu ××××××××××××××
 ||<
 
 Hmmm. I thought it was "Koisutefu"... Oh, the original data is in modern kana for the first part to match the pronunciation, and in old kana for the second part to match the torihata....
 
 -----
 
 Since it is tedious to type everything, I decided to use forward matching.
 
 >||
 Top> "Tsuritsu no ki tsukitome tama takaritake
 >>> ？
 Lower> The wind blows in the clear blue sky
 NG> ×
 
 Top: "People can't see me, but Aki is gone.
 >>> Yaemugura
 ok.
 
 above> What is the meaning of "to be found in the heart of Karakurenai"?
 >>> I'm going to kill it.
 ok.
 
 up> Okima to haasare shiraki-no-hana (The white chrysanthemum that can be seen from the top)
 >>> For your information
 ok.
 
 above: When you think of the world, you think of yourself.
 >>> I envy you and I envy you
 ok.
 
 Ue> Waiting for the moon in the morning and wondering if it will be a crane
 >> Now is a good time to get in.
 I've got a long time to wait for the right moment.
 NG> Now I'm going to do a good job.
 ||<
 
 The shaking of "mu" and "n" is....
 Imakon to Ii shashin ni: 1010 items
 Imakomu to ikimasu ichibanashi ni: 843
 It's too subtle... I'll just use the "mu" I'm used to.
 
 -----
 
 Oh, the upper and lower phrases are written backwards.
 
 *1199169537* As a 20-something, I'm pathetic.
 My mother is by far the fastest at counting backwards from the bottom phrase to the top phrase....
 
 *1199187895* What is a Type III Close Encounter?
 id:naoya_t
 >>
 We will probably have a Type 3 (or Type 4) close encounter with Mr. Nishio this year. Please do so.
 <<
 
 It's nice to meet you too.
 I mean, what's a Type III Close Encounter?
 
 <a href="http://ja.wikipedia.org/wiki/%E6%8E%A5%E8%BF%91%E9%81%AD%E9%81%87">接近遭遇 - Wikipedia</a>
 >>
  The third type of close encounter is contact with the crew of a flying saucer.
  Type 4 Close Encounter is to be kidnapped or implanted by a flying saucer crew member. It also involves capturing and restraining a flying saucer crew member.
 <<
 
 So you're saying you want to contact or capture the person in me? Is this a declaration of war?
 
 *1199198631*Flowers and the breeze
 It turns out that the two stuck together and I remembered both songs as "Kaze Saso".
 
 *1199198632* Data
 I wonder if there is any data on the 100 poems per Wikipedia.
 
 Agh, and yet it's "asajiu"...
 Is quality an issue when data from a choice-type quiz is converted to an input-type quiz....
 I'm having trouble figuring out which way to align it.
 
 I solved 100 questions and pushed it to the point where I got 2 wrong (input is limited to cliched characters).
 I wonder if it would be interesting to have software that would make it easy for non-programmers to create these "anti-brain/knowledge installers".
 It would be crucial to automatically adjust the percentage of correct answers to just the right place.
 
 </body>
 <comments>
 <comment>
 <username>rokujyouhitoma</username>
 <body>>So you're saying you want to contact or capture the person in me? Is this a declaration of war? <BR><BR><BR>We laughed<BR><BR>Again, Happy New Year! <BR><BR>This is the first year I will be in Pai Pai's care. </body>
 <timestamp>1199193954</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I was much taken care of when I was a zero year old. </body>
 <timestamp>1199289960</timestamp>
 </comment>
 <comment>
 <username>naoya_t</username>
 <body>Interstellar exchange is quite difficult. <br>In addition, I am "ex" id:naoya_t since I left Hatena. </body>
 <timestamp>1199340087</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-01-01 https://nishiohirokazu.hatenadiary.org/archive/2008/01/01]