Hatena2010-12-16
code:hatena
 <body>
 *1292514869*Aurantiochytrium
 <a href='http://ja.wikipedia.org/wiki/%E3%82%AA%E3%83%BC%E3%83%A9%E3%83%B3%E3%83%81%E3%82%AA%E3%82%AD%E3%83%88%E3%83%AA%E3%82%A6%E3 %83%A0'>Aurantiochytrium - Wikipedia</a>
 >>
 Aurantiochytrium (English: Aurantiochytrium) is an algae.
 
 It belongs to the Labiurintula group and does not photosynthesize.
 <<
 
 <a href='http://ja.wikipedia.org/wiki/%E3%83%A9%E3%83%93%E3%83%AA%E3%83%B3%E3%83%81%E3%83%A5%E3%83%A9'>Labyrinthera - Wikipedia</a>
 >>
 All Labyrinthulae are heterotrophic groups of organisms that absorb and predate, but do not engage in photosynthesis. Predation is extracellular digestion and absorption without phagocytosis; bacteria, fungi, and aquatic multicellular plants are digested at the cell surface. Absorbed nutrients accumulate as oil droplets within the cell. These oil droplets contain highly unsaturated fatty acids, which will be discussed below.
 <<
 
 I had assumed that algae were used to make petroleum through photosynthesis, but I was wrong. Just as we store most of the surplus energy from eating meat and sugar in the form of fat, this algae stores surplus energy in a form similar to petroleum.
 
 *1292519869* value of yen
 >>
 I don't know much about the economy, so I have a question. I used to think that the value of the yen has decreased because I could once take a cab for a yen and now I can't even buy a piece of chocolate, but the fact that I can buy a dollar for 100 yen when I could buy one for 360 yen suggests that the value of the dollar has increased. Does this mean that the value of the dollar has dropped even more violently? Should I compare it to gold or something else?
 <<
 
 <a href='http://gold.tanaka.co.jp/commodity/souba/y-gold.php'>Tanaka Kikinzoku Kogyo K.K.│Annual Gold Price Trends</a>
 
 >||
 2000 1014 yen/g
 1975 1616 yen/g
 1950 401 yen/g
 1925 1.73 yen/g
 ||<
 Oh, compared to gold, the value of the Japanese yen has decreased to less than 1/500th!
 
 
 <a href='http://ja.wikipedia.org/wiki/%E3%83%97%E3%83%A9%E3%82%B6%E5%90%88%E6%84%8F'>Plaza Accord - Wikipedia</a>
 
 Hoho, I didn't understand it at all even though I was already old enough to have been born.
 </body>

[Hatena Diary 2010-12-16 https://nishiohirokazu.hatenadiary.org/archive/2010/12/16]