Hatena2012-12-07
code:hatena
 <body>
 *1354872835*Solution (clue 2)
 <a href='http://d.hatena.ne.jp/nishiohirokazu/20121206/1354727324'>出題編</a>
 <a href='http://d.hatena.ne.jp/nishiohirokazu/20121206/1354792274'>解答編(ヒント1)</a>
 
 The ciphertext is too short for a conversion cipher. It is not realistic to estimate the original character from its frequency in such a short sentence, and the types of characters appearing in the ciphertext are too few to begin with. If it were a cipher from an ordinary sentence, there would be many more kinds of characters. So let's hold off on the ciphertext line and see what other structures are possible.
 
 For now, let's display the characters before and after "sa," which appears most frequently.
 
 >||
 >>> for i in range(len(data) - 10):
 ...       line = data[i:i + 21]
 ...       if line[10] == u'さ':
 ...               print re.sub("(\w)", r" \1", line)
 ... 
 sah sah sah sah sah sah sah sah sah sah sah sah sah sah sah sah sah sah sah sah sah sah sah
 haha akasatama ya akasatama aa arama 0sawaa
 akasata ha arama 0 sah sah sah sah sah sah sah sah sah sah sah sah sah sah sah sah sah
 haaaaaaaaama 0sawaaaaamaa saaaaaaasataaaaaaaaaa
 arama 0sawa arama sawa arama sawa arama sawa arama sawa arama sawa arama sawa arama sawa
 the world of hungry spirits and the world of animals
 Sawa akasata haha akasaka wa akasaka b c aa
 
 Hawa akasaka b c akasaka ah ah ah ah ah ah ah ah ah ah ah ah ah ah ah ah ah
 
 ah ah ah ah ah ah ah ah ah ah ah ah ah ah ah ah ah ah ah ah ah ah
 hawa ma 7 asa hahata sahasa sahasa sahasa sahasa sahasa sahasa 0
 Ma 7 asa ha ha ha sa sa sa sa sa sa sa sa ha ha 0 aka
 morning, morning, afternoon, afternoon, morning, afternoon, 0Asahata, 0Asahata, 0Asahata
 
 0Asahasa 0Asahasa 4Bawamaraa
 kasata ha 0a kasata ha saa 4 bwa maraa 6 ma 6
 A 4 bwa ma la a 6 ma 6 sa 7 ah ah ah ah ah ah ah ah ah ah ah ah ah ah ah ah ah ah ah
 7Sa 7Akasawama 7Akasatama 7Akasatama well
 Ma 7 akasataha 7 akasatama akasatasa b aa
 a 7 a akasatasa a b aya b c maya
 aa aa b ay aa b c maya
 ||<
 
 Here's what it looks like when highlighted in the editor
 
 [f:id:nishiohirokazu:20121207183644p:image]
 </body>

[Hatena Diary 2012-12-07 https://nishiohirokazu.hatenadiary.org/archive/2012/12/07]