Hatena2011-02-27
code:hatena
 <body>
 *1298819036*e-Tax日記(失敗編)
 Now, let's file our tax returns via eTax.
 
 Is the address only full-width characters? I tried changing the numbers that were half-width to full-width and got splashed again, and wondered why, but the hyphen was half-width.
 
 Password is not hidden.... Surprised.
 
 I don't know, like a confirmation number for tax purposes, what's that? Hmmm? It says, "Please enter a six-digit number of your own choosing." Is this some kind of new password setting? But there is only one input field. I decided to go ahead and try it. The message "Please keep your PIN and tax confirmation number in a safe place. I wonder if that's what it means.
 
 As I proceeded, the Java applet suddenly requested access to the machine... what the heck? What does it mean by "access to the machine"? I allowed it anyway, and it said, "Please connect an IC card reader. I see, so that's what it means. I immediately connected it and inserted my IC card. The light was flickering, so I waited for about 30 seconds, but there seemed to be no change, so I wondered if I could proceed. When I pressed the button, I got an error message. I can't retry, can't do anything, can't copy and paste the error code because it's a Java applet... I don't know how to go back. There is a process indicator at the top of the page, but I can't go back even if I click on it.... I was trying to figure out how to get back, when a dialog box came up asking for the keychain password! Oh, should I have waited a little longer? I enter the password. The dialog pops up again. Hmm? I enter it again. It pops up again! I can't even look at the help screen because the dialogs keep popping up! Even if I press cancel, it doesn't stop! I pulled out the card and canceled it, and it somehow stopped. Phew.
 
 In general, there is no information in the help about the error message in question... and I don't know what to do...
 
 At any rate, I saved the input data up to that point and started over from the beginning. For those who have a user identification number"...I was issued a user identification number a while ago, so I guess I should proceed on the side that I have a user identification number. I don't have a user identification number, so should I proceed on the side where I have one? The search results showed that there was no corresponding address or other search information. Please click the 'Cancel' button to return to the previous screen." I should check the ............... checkbox. Hmmm, still no luck.
 
 Oh, somehow from here I could get back to the top screen. Loading saved data! It's loaded! I was able to get back to just before the Java applet that failed earlier! I did it! And the same error again.
 
 Back to the top page. And here comes the "Safari is trying to use JPKI-card #2" dialog again... another infinite dialog...
 
 Search.
 
 <a href='http://pc.nikkeibp.co.jp/article/column/20090306/1012924/?P=6'> "e-Tax with Mac" -- a story that makes me laugh rather than get angry: Nobuo Hayashi, "Long and Winding Mac"</a>.
 >>
 Often, when updating iTunes, etc., it will ask me to enter the administrator password, or iCal will ask me to enter the password for sync using the keychain? Sometimes it says, "Please enter your administrator password. If you think that this is probably the administrator password, you are mistaken. You will be in a lot of trouble later. // In fact, the correct answer here is the password applied to the certificate of public personal authentication stored in the resident card.
 
 　There are two types of passwords on the resident card: the PIN on the card and the password on the certificate. I had to put the password that was applied to the certificate in the keychain access dialog box above. I tried the Mac administrator password, the PIN of the Juki card, and the password of the certificate in turn, but none of them worked. In fact, the PIN for the basic resident registration card was so hazy that I had to enter the card PIN several times and then try the password for the certificate. The Basic Resident Registration Card (IC card) has a mechanism that locks the card after five consecutive wrong password attempts to prevent unauthorized use. It seems that the card was locked because of repeated attempts. Since there was no indication that the card was locked, it was wrong for me to try again and again.
 <<
 
 Ahhhhhhhh, that's how it is.... I thought I was being asked for the admin password and typed it in a few times... I guess I'll have to go to the ward office tomorrow to reset my password...
 
 Time consumed so far, 1 hour. Still a long way to go...
 </body>

[Hatena Diary 2011-02-27 https://nishiohirokazu.hatenadiary.org/archive/2011/02/27]