Hatena2011-09-05
code:hatena
 <body>
 *1315182264*"You too can read books 10 times faster than before" Leverage Memo
 - Before you read a book, you should clarify why you are reading it. This will help you absorb more efficiently.
 - It is better to read through the table of contents alone than to buy a book and pile it up without reading it.
 - The subconscious mind remembers unexpectedly even if you think "I can't understand anything with this way of reading.
 
 The third is a matter of faith, and I myself am still skeptical about it, but I think the first two are correct. When I receive a book I bought from Amazon because of its title, I don't just put it on my bookshelf or pile it up, I first take a few minutes to read the table of contents. If you can't even bring yourself to spend a few minutes with the book, then you probably won't even want to read it thoroughly, so you should throw it away.
 
 If I read the table of contents and am intrigued, I flip through the book and pick up only the parts that interest me, and when I am done, I do "photo reading," pick up again, and when I am ready, I read from the beginning of the book in the normal reading style. I believe that it is a matter of faith, not evidence, that this method will lead to a blossoming of one's abilities or a wonderful future. However, if I start reading from the beginning of the book and read up to about one chapter, or if I read through the table of contents and all the key words, the latter would be a better condition. If I read that far and decide that I shouldn't invest more time in reading this book, that it won't help me achieve my goal, I should stop reading it, but if I read only one chapter, I might not be able to make a decision and keep on reading.
 
 "20% of the text is worth 80% of the value" (<a href="http://www.amazon.co.jp/gp/product/4492042695/ref=as_li_ss_tl?ie=UTF8&tag=nishiohirokaz-22&linkCode= as2&camp=247&creative=7399&creativeASIN=4492042695">Leverage Reading</a>'s leverage memo), I think it is reasonable to pick up that "valuable 20%" quickly by choosing to "read the entire text thinly and repeatedly rather than reading it thoroughly from the beginning. I think the choice to "read it thinly and many times" is a reasonable one. This book has survived on my bookshelf through several rounds of "throw away the book pressure," but there are still some interesting points when I read it again. Reading a book is also a task, so you should prioritize books by "urgent," "not urgent but important," and "neither urgent nor important," and read them in order of urgency. I tend to read books from the easiest ones, so I should be careful.
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4894513692" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe><iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4492042695" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 **1315226195* Stanford online classes
 <a href='http://www.publickey1.jp/blog/11/post_178.html'>Stanford University to Launch Free Online Classes on Machine Learning, Databases, and Artificial Intelligence This Fall - Publickey</a >. I haven't officially registered for the machine learning one yet, but the artificial intelligence one had started, so I registered.
 
 <img src="http://gyazo.com/8c59f675ec99e6d17b1c37ffd9a0df07.png">
 
 Ho-ho-ho, so I guess I am not allowed to blog about homework and exam content. Too bad.
 
 What made you decide to take it?" The question "Interest in online/new approaches to education" is one of the options in the question "Why did you decide to take the course? You know what you are talking about.
 
 *1315226308*A case of assuming that RT is capped by the number of followers.
 <img src="http://gyazo.com/721bab40040a017f8d6c7d07a1928655.png">
 
 Interesting.
 
 <img src="http://gyazo.com/b691e31d14c1d8996f498ee6050ca715.png">
 </body>

[Hatena Diary 2011-09-05 https://nishiohirokazu.hatenadiary.org/archive/2011/09/05]