Hatena2009-06-03
code:hatena
 <body>
 *1243993543*Monad's problem was a big hit in Russia.
 via id:akio0911
 About 1,500 page views are pouring in from Russia.
 http://habrahabr.ru/blogs/zadachki/60745/
 I don't understand it at all because it is in Russian. Result of machine translation
 >>
 Entertaining задачки Solve sense of the Japanese diagram
 Problem from NISHIO Hirokazu. As he said, this problem is intended for programmers who know the functional programming language. Look at the following diagram:
 (fig)
 Your problem &#8212; to explain value of symbols (white and black squares, signs plus, the sign is more...)
 
 If the audience will show interest I shall lay out the answer with an explanation to a problem … later
 
 UPD: Cautiously, in comments the reference to page with the answer is given. For those to whom not hunting to think (url)
 <<
 Expect "answer with an explanation to a problem."
 
 
 But you never know what will be a hit. So anyway, I think it would be better to publish everything that can be made into English in English.
 
 *1244031540*Stack
 >|python|
 stack.push(middle limit online2)
 stack.push(Matrix Ranch) # since the boys' ranch has been released.
 stack.pop()
 stack.push(MTM03) # I still wanted to exhibit
 stack.pop()
 stack.push(Animal Shogi) # I thought I could do it with backward analysis
 stack.pop()
 stack.push (summary page of drawings I've done so far) # I'm getting access from Russia.
 # I just found an article from 5/17 that says "We will soon release the most limited 2.0".
 ||<
 
 *1244036157* Hierarchy of Understanding
 - A: I feel like I understand concept X
 - B: Implement sample code that uses the concept X
 - C: Write practical code that uses the concept X
 - D: Teach concept X to others
 - E: Solving problems that have little to do with Concept X itself, which are obstacles to creating practical software using Concept X.
 - F: If you want to use concept X to create practical software, notice the problems with concept X itself and fix them.
 - G: Create concept Y, considering it a mistake to use concept X for that purpose in the first place
 
 Going to G suddenly is a mid-life crisis.
 
 <hr>
 
 concrete example
 - A: I feel like I understand PageRank.
 - B: Write sample code for PageRank. <a href='http://ja.doukaku.org/48/'>Calculating PageRank How to write it? org</a>
 - C: Write code that uses PageRank to rank some data at hand.
 - D: Teaching PageRank to others
 - E: I tried to feed large scale data to the PageRank program I made in C, but it was slow and unusable due to matrix computation problems, so I studied the problem and did something about it.
 
 Is it?
 
 *1244038947* made
 Phew, now I have a page to put up "for more information" the next time I get a flood of access from Russia!
 http://www.nishiohirokazu.org/what_i_did/
 
 Well, it's already 11:30 p.m.?
 Hungry, hungry, hungry.
 
 *1244057094*Inkscape + Python + lxml
 >||
 sudo port install py25-lxml
 ||<
 
 Then I run the plugin in Inkscape and get an error "lxml missing".
 
 >||
 sudo python_select python25
 ||<
 
 I then started Inkscape, and it worked fine.
 </body>

[Hatena Diary 2009-06-03 https://nishiohirokazu.hatenadiary.org/archive/2009/06/03]