Hatena2014-01-04
code:hatena
 <body>
 *1388839297*We are looking for "what you want to know" about abstraction!
 We will be presenting a session on "Abstraction" at the upcoming <a href='http://www.ipsj.or.jp/prosym/55/55CFA.html'>55th Programming Symposium</a> on January 10-12.
 
 ** Session Summary
 
 With "abstraction" as the keyword, participants are asked to submit "what they want to know," and everyone gets together to think about the answers to those questions.
 
 Examples of "what you want to know"
 
 - To what extent do we abstract in writing the program?
 - How do you determine the appropriate level of abstraction?
 - Is there an appropriate language choice for abstraction?
 - How can we learn to think abstractly? Can it be taught?
 - What is "abstraction" anyway?
 - To what extent can the overhead of abstraction be reduced?
 - Is there any difference between mandatory abstractions, such as OS separation of powers, and non-mandatory abstractions, such as frameworks?
 - What kind of environment/constraints are needed to make abstraction work, or to think abstractly? (The constraint "what I want to know" is a concrete example this time. What else? Specific examples of environments are learning environments at universities, lots of whiteboards, fixtures that facilitate discussion, etc. Anything else?)
 
 ** how it happened
 
 Recently, I have been interested in improving the "way we learn" and have been tweeting about it on Facebook. This caught the attention of the secretary, who said, "Wouldn't it be interesting to have a session on this topic?" So we started to plan a session on this theme.
 
 When I think about it, I have not experienced many discussions on the theme of "abstraction. This may be an attempt unique to the Programming Symposium, where people from different fields of expertise gather under the more abstract keyword of "programming.
 
 There will be no "right answer" to this theme, and we are not even sure if we can answer the "things we want to know" submitted by everyone. This is a very challenging session. I will do my best to make it useful.
 
 ** 募集
 
 そこで、<span class="deco" style="font-weight:bold;">抽象化に関して「知りたいこと」を募集します。</span>
 
 Facilitation is easier when information is available in advance. Also, the more participants know in advance how the facilitation of the session is designed, the easier it will be to manage the site.
 
 The reason we limit it to "'What we want to know'" is that it is easier to come up with a limited number of ideas than it is to be told, "Please send us your opinions on anything you want."
 
 We chose "what we want to know" as the restriction target because this can be formed into a "question" with a little modification, and it is easy to elicit other people's opinions about it.
 
 Facilitation in the field would roughly follow the flow of "gather concrete information from people with different viewpoints and share it on the whiteboard" → "look for common structure among different information". In other words, this is also a process of "abstraction.
 
 <span class="deco" style="font-weight:bold;">We are looking for "what you want to know". </span>Thank you in advance.
 
 ** Rough Agenda for this Session
 The current plan is as follows, although we intend to change it flexibly depending on the situation.
 
 - Continue to solicit questions by sticky note or other means before the start of the program.
 - After the start, visualize what questions were asked on the whiteboard
 - Solicit additional questions orally.
 - Solicit questions about the text of the question, including unfamiliar words and the intent of the question.
 - Rearrange all the questions so that the closest ones are closer together.
 - Solicit answers to your questions
 - Solicit rebuttals to your answers.
 - Solicit actual examples for abstract statements.
 - Look for commonalities between different examples
 
 ** 参考文献
 - http://vox.nishimotz.com/design-pattern.html It would be nice if the meta-pattern stuff in ple was organized, including things other than by object relationships <a href='https://twitter.com/kazuho/ status/420126917669289984'>by @kazuho</a>
 
 ** Summary
 https://gist.github.com/nishio/8378624
 </body>

[Hatena Diary 2014-01-04 https://nishiohirokazu.hatenadiary.org/archive/2014/01/04]