Hatena2007-12-30
code:hatena
 <body>
 *1199001802*Miffy's World Journey
 I was looking at Miffy and I heard she has been traveling to "Asia".
 I can't use chopsticks well because it's my first time to use them. Handing a knife and fork to Taka, a local, he said, "Taka can't use the knife and fork well because it's the first time he's seen them."
 
 No, no, no, where is that? LOL!
 
 Generally speaking, "Asia".... I guess Japan and China are the same to Westerners. Is that the same as someone thinking that Koshien Stadium is in Osaka? Koshien stadium is not in Osaka! On the contrary, it's not even in Kobe!
 
 *1199007656*__doc__
 Using doctest - Mizupi Diary
 http://d.hatena.ne.jp/mzp/20071229/doctest
 
 >>
 Is there any way to get the documentation string from a regular program?
 <<
 
 This is what you mean?
 
 >|python|
 >>> def foo():
 	"docstring!"
 	pass
 
 >>> foo.__doc__
 'docstring!'
 ||<
 
 *1199011083* Causes of Sea Level Rise
 
 Like the melting of Antarctic ice?
 
 *1199032627*Outline of Tokyo Metropolitan Government's Action Plan for New Influenza Pandemic
 http://www.fukushihoken.metro.tokyo.jp/kansen/sidou/influ/gaiyou.html
 >>
 Health hazards were projected as follows　　*Predicted figures for the epidemic period in Tokyo and up to the late stage of the epidemic
 -Number of patients: approx. 3.8 million
 -Number of inpatients: approx. 290,000
 -Deaths: approximately 14,000
 <<
 
 I don't know if there are many or few.
 
 ----
 
 >>
 - As a precaution against the rapidly increasing number of deaths due to H1N1 influenza, businesses are requested to operate incinerators and prepare for cremation whenever possible. (Bureau of Social Welfare and Public Health)
 - In preparation for a sharp increase in the number of deaths during a large-scale epidemic, request ward and city governments to prepare a list of sports centers and other facilities that can be used as temporary morgues for dead bodies. (General Affairs Bureau, Welfare and Public Health Bureau, Education Agency)
 - Request the industry that handles dry ice to be prepared to supply dry ice when the morgue is set up. (General Affairs Bureau, Welfare and Public Health Bureau)
 -Simplify the procedures necessary to use a portion of a metropolitan park as a temporary burial site and coordinate with the park to allow for burial in the ground. (Bureau of Social Welfare and Public Health, Bureau of Construction)
 <<
 
 This is a very graphic story.
 
 ----
 http://www.fukushihoken.metro.tokyo.jp/kansen/sidou/influ_manyual.pdf
 
 >>
 Influenza (H5N1) was first reported in humans in Hong Kong in 1997, and since then, cases have been reported mainly in Asia. According to the World Health Organization (WHO), as of March 23, 2007, 281 cases (169 deaths) have been reported in 12 countries.
 (snip)
 (1) Clinical presentation of influenza (H5N1)
 Most are healthy young adults in their 20s or younger with no underlying disease. There is no difference between men and women. (snip)
 Course and Prognosis
 Many cases are complicated by acute respiratory failure, with about 50% of reported cases resulting in death. (It is likely that some minor cases go unreported, and the actual mortality rate may be lower.) In addition to respiratory failure, the most common causes of death are renal failure, heart failure, and multiorgan failure.
 <<
 
 >>
 (Reference) "Cough Etiquette"
 When coughing or sneezing, hold your mouth and nose with tissue paper, turn your face away from others, and move at least 1 meter away.
 Create an environment in which tissues containing respiratory secretions can be immediately disposed of in a waste bin with a lid.
 Encourage people with coughs to wear surgical masks.
 (Reference) "Standard Precautionary Measures"
 Wear gloves if contact with blood, body fluids, secretions (excluding sweat), or excretions is anticipated. Wash hands after removing gloves.
 If splashing of blood, body fluids, secretions (excluding sweat), excrement, etc. is expected, wear a surgical mask, eye protection (goggles or face shield), and gown in a timely manner depending on the degree and location of splashing.
 Apparatus and instruments contaminated with blood, body fluids, secretions (excluding sweat), excretions, etc. should be properly cleaned and disinfected.
 <<
 
 Ho.
 
 >>
 Visitation Restrictions
 As a general rule, visiting is prohibited. If a visit is unavoidable, visitors should wear N95 masks, gloves, eye protection (face shield or goggles), and gowns, and patients should wear surgical masks.
 <<
 
 Intense. <a href="http://ja.wikipedia.org/wiki/N95%E3%83%9E%E3%82%B9%E3%82%AF">N95 mask - Wikipedia</a>. Ho.
 
 >>
 (10) Voluntary restraint of Tokyo residents from leaving the house and support for the elderly, etc.
 a. The General Affairs Bureau, with the cooperation of wards, municipalities, related organizations, and media organizations, will request that Tokyo residents refrain from leaving their homes unnecessarily. In addition, they are requested to secure food and daily necessities on their own in principle.
 <<
 
 "Don't go out, but get your own food," he said.
 Well, when I return to Tokyo next year, I think I will stockpile about 3 months worth of rice, pasta, and retort for now! Also, N95 masks and goggles.
 
 *1199035692*Precise Analysis of Spanish Flu in Japan
 Precise Analysis of Spanish Flu in Japan
 http://www.tokyo-eiken.go.jp/SAGE/SAGE2005/sage.html
 
 >>
 2. age distribution of deaths due to spanish flu
 　Figure 2 shows a generational map of influenza deaths from 1899 to 1943. 1917-19 and 1920-22 were heavily affected by the Spanish flu, with a larger number of deaths in both age groups compared to other calendar years. Infants aged 0-2 years accounted for the largest proportion of deaths in both periods.
 　A closer look at the generation map shows that for males, the major peak in 1917-19 was in the 21-23 age group, while in 1920-22, the peak was in the 33-35 age group. The position of the age peak for boys differs between 1917-19 and 1920-22, while the peak for girls is in the 24-26 age range in both periods. It is also worth noting that the peak for girls is higher than that for boys.
 <<
 
 I understand the temptation to say that the peaks are different if you look at the position of the peaks, but if you look at the actual graph, the bottom line is that there are more deaths among people in their 20s and 30s.
 Also, I wish the graph was not graphed by number of deaths, but by death rate.
 
 Population pyramid in 1920. Japan seemed to have a typical "pyramid shape" at that time.
 http://www.stat.go.jp/data/kokusei/2005/kouhou/useful/u01_z01.htm
 So you can't say "more deaths among people in their 20s and 30s simply because the population was larger". For example, people that age were more likely to be infected than teenagers because of their wider range of activities...(I think in 1918, many people were working even at 16-18...), or because of something like I wrote in yesterday's article on cytokine storms. Or the high mortality rate in the 20s and 30s.
 </body>

[Hatena Diary 2007-12-30 https://nishiohirokazu.hatenadiary.org/archive/2007/12/30]