Hatena2013-10-29
code:hatena
 <body>
 *1382984154* Quantum Shogi: Explanation of the game record that led to the identification of the king in 15 moves.
 棋譜: http://shogitter.com/kifu/1059
 
 1: The pioneer suddenly charges in with a Kogan Tobishiki.
 
 2: The back player moves to the side and takes it. As a result, the pieces that moved sideways converge on the kinbisha king.
 
 3: Pioneer attacks with Kogan Tobisha through an open gap.
 
 4: The back player moves to the side and takes this piece as well. This piece also converges with the kinbisha king.
 
 5: The first move, to take away the possibility of a piece taken from the opponent. 1Roku "may be a square (actually may be a flying horse)" strike. It is very Kaku-like because it is aiming for a gap in the corner with a Kakudo from the corner. This is a bluff.
 
 6: Avoiding a targeted wind piece if you think it is a corner.
 
 7: The first player moves the piece he played three pieces to the side. This confirms this piece as a flying horse. Then, the back player's kinbisha king is deprived of the possibility of a flying car and converges on the kin-o. The flying car will aim at this kin-o.
 
 8: Rear player avoids the gold king, which is targeted by the flying car.
 
 9: The first player plays a piece taken from the opponent. This is a "poka-katsura-gin-kin-kaku". The next move is to move downwards to confirm the gold, thus confirming that one of the opponent's two gold kings is a king.
 
 10: Go player, aiming for the first player's flying car with kagan-tobisha.
 
 11: The first player takes the second player's kagan tsuki with his flying car. If you don't do this and do the "down and gold" as planned, you will be giving the flying car away for free. (PS: It might have been better to move to the left here, or ignore it. It is not important for later development)
 
 12: The back player, for some reason, makes an assault instead of taking the first player's flying car. Unfortunately, due to my "fixing the piece taken from the opponent as a flying car" at move 7, there is no possibility of a flying car left in the back hand piece, and this is not a flying car but just a kagarashi.
 
 13: The first player executes "down and gold" as planned. At this point, it is determined that either the diagonally behind the first move's dragon king or the gold king behind it is the king.
 
 14: Later, take that gold with Narika. (Not important)
 
 15: First move, taking a gold king diagonally behind with a dragon king. Since the taken gold king is determined to have been gold, the remaining gold kings converge on the king. Since the undetermined piece of the previous player still leaves the possibility of a square, the game is deadlocked with a quadruple king move of "97 angles," "59 fei," "1 7 angles," and "5 2 dragons," which leaves no room for movement.
 
 ** 考察
 
 Therefore, it is quite likely to be a bad move to take a piece that has jumped in with a kagan-tobisha by moving sideways. If you were to take it, you could think of "taking it with a kagan-bisha in the same row," "taking it with a kakuma," "taking it with a horn," and so on... Both sides consume one move each, and what the first player gets is an all-mighty, and what the second player gets is a kagan-bisha, and one piece is quite convergent. Hmmm, isn't this exchange a loss? Perhaps the latter player should "charge into the earlier player's position with a kagan-tobisha as well".
 
 It is interesting that Kogarashi, which is usually relegated to the corner and has little chance to play an active role in ordinary shogi, is a wonderful piece that rushes head first to capture the enemy in Quantum Shogi.
 
 As for where the first player should spear the most, well, it is not obvious that 5 rows are really the best choice, except for 2 rows and 8 columns, which are taken with less convergence. So, it would be better to shoot through rows 4, 5, or 6, where people would naturally choose "move sideways and take it". But now that I have disclosed the information that "moving sideways seems to be a bad move," it may be difficult to easily identify the king and win in this way in the future. Now, let's think about the next strategy!
 </body>
 <comments>
 <comment>
 <username>makoll</username>
 <BODY>This is a great game record that could become a joseki as it is. It is wonderful. <br>I also thought a lot about it, but only for the first move. </body>
 <timestamp>1383069232</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>That's a good thought. I hadn't thought about the 39 corner against the 5 san in the first move. I thought it would be the same Katsura or ignore it and play 4-7. <BR><BR>This game will not work if people think that moving to the right is a bad move. <BR><BR><BR>What is the condition that determines whether it is better to take the intruder by one move and have your pieces converge, or to leave the intruder alone and do something else? I wonder if the problem would not be so big if I limit convergence to one gold king, or if it would be better if I make a third piece on my own hand before my opponent makes a third piece (but is it hard since my king is limited to those three pieces). </body>
 <timestamp>1383149442</timestamp>
 </comment>
 </comments>

[Hatena Diary 2013-10-29 https://nishiohirokazu.hatenadiary.org/archive/2013/10/29]