Hatena2008-04-11
code:hatena
 <body>
 *1207880472*Re: Where Python fits in
 http://d.hatena.ne.jp/jYoshiori/20080410/1207828397
 
 I suppose it must seem strange to eyes accustomed to Java that the logical operators do not return bool, but it is rather normal in LL.
 
 >||
 C:\>perl -e "print 1 && 2"
 2
 C:\>ruby -e "print 1 && 2"
 2
 C:\>python -c "print 1 and 2"
 2
 ||<
 
 Even in Java, "false || x" or "true && x" returns x. The return value is also limited to true/false because of a type error if x is not bool.
 
 
 Also, the explanation of using the ternary operator to convert to bool, but it is OK to use bool.
 
 >||
 >>> bool(1)
 True
 >>> bool(0)
 False
 ||<
 
 *1207885463*About the Mac UI
 They say that having the menu at the top of the screen makes it easier to adjust the pointer, but it is very stressful to adjust the pointer to the small red circle when closing a window! It's so stressful that I learned to use Cmd+W to close a window first.
 
 If a window is maximized in Windows, it can be closed by clicking in the upper right corner. The buttons on the taskbar also appear to be one pixel away from the corner, but clicking on the corner will open it. (Most of the software has alphabets in the menus, so it is easy to use the keys. I don't use the mouse to select menus in the first place.
 
 In the end, it may just be a matter of which operations are performed with the mouse and which with the keyboard.
 
 -----
 
 > kazuhooku The menu being at the top of the screen is just historical.
 > Dubhead I read somewhere that the reason the Mac menu was at the top of the screen was to make use of the narrow screen at the time.
 
 I see. I don't know the details, but can I conclude that there were designers who used to say appropriate things?
 
 -Joel on Software - Designing for People Who Have More to Do, Part 2
 --http://japanese.joelonsoftware.com/uibook/chapters/7.html
 </body>
 <comments>
 <comment>
 <username>jYoshiori</username>
 <body>Thanks! I learned a lot...</body>.
 <timestamp>1207883018</timestamp>
 </comment>
 <comment>
 <username>Dubhead</username>
 <body>I read somewhere that the Mac menu being at the top of the screen was an ingenious way to use the then-narrow screen more widely. </body>.
 <timestamp>1207889900</timestamp>
 </comment>
 <comment>
 <username>kazuhooku</username>
 <body>To begin with, in early Macs, there was only one application running at a time. <br><br><br>In the early days of the Mac, there was only one application running at a time. Menus were common to all applications, but there were multiple windows for each application, so it was logical that a window would not have its own menubar. <BR><BR>Windows, on the other hand, is designed to generate an MDI window containing a menu bar for each application. <BR><BR>In the end, because of this conceptual difference, I think that "having the menu at the top of the screen makes it easier to align the pointer" may have been the result, but at least it was not the purpose of the UI design. </body>
 <timestamp>1207899918</timestamp>
 </comment>
 <comment>
 <username>a2c</username>
 <body>I don't know of any scientific support for this, but I have heard it commonly referred to as the "rule of threes. It is said that the human eye moves in the order of top left, top right, bottom right, and bottom left. Therefore, it is said that important things should be placed in the upper left corner and unimportant things in the lower left corner to make things look clearer. I think TV screens are pretty much like that. <br>The "Ts" rule may just be a legend of the year. </body>.
 <timestamp>1207935830</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-04-11 https://nishiohirokazu.hatenadiary.org/archive/2008/04/11]