Hatena2009-04-15
code:hatena
 <body>
 *1239770480*[SpaMon] I need more thickness on the card.
 If the material is paper-thin, it will be troublesome to slide multiple items together; if it is a hard material with a thickness of 1 to 2 mm, it will be convenient to move them all together.
 
 I had a little look at the price of plastic, but it is quite expensive. Balsa wood is cheap. It looks easy to process.
 
 <a href='http://ja.wikipedia.org/wiki/%E3%83%90%E3%83%AB%E3%82%B5'>Barça - Wikipedia</a> has a detailed description of the processing process, Wikipedia is awesome.
 
 *1239776054*[en]Matsuba Sushi
 f:id:nishiohirokazu:20090415151412j:image
 
 *1239777536* Infrared Photography
 This is gross. It moves in real time and my mouth is red when I laugh!
 f:id:nishiohirokazu:20090415153854j:image
 
 *1239781214* Museum of Contemporary Art Tokyo
 
 f:id:nishiohirokazu:20090415164012j:image
 
 
 f:id:nishiohirokazu:20090415164402j:image
 
 
 f:id:nishiohirokazu:20090415164556j:image
 
 *1239787918*Supya
 
 f:id:nishiohirokazu:20090415183151j:image
 
 *1239795440* I went to the Ryoji Ikeda exhibition.
 <a href='http://www.ryojiikeda.mot-art-museum.jp/'>+/- [ the infinite between 0 and 1 ] Ryoji Ikeda Ryoji Ikeda</a>
 
 There was a square pi and the bottom of an elongated natural logarithm. And all sorts of things projected by a projector all over the big wall. It is hard to have an experience where there are only numbers in your field of vision. The digital video was synchronized with noisy music, and... well, I watched the loop one time, but my retinas started to scream, so I got out early.
 
 
 The permanent exhibition was interesting. The pipe ears should be experienced once. Also, the "God's Dwelling Place" on the wall was amazing. The "place where God dwells" on the wall was amazing. The hand rocks were quite impressive. I would like to try using photo acrylics. <a href='http://www.yamanotephoto.jp/priceacryl.html'>Photo acrylic "Yamanote Photo Factory"</a> is surprisingly cheap. I'm going to print some of the monadic rules from the other day. And what was that? The metal elephant was nice. All in all, it was contemporary chaos compared to the classical museum niceties.
 
 *1239797301*[SpaMon] Prototype #2
 f:id:nishiohirokazu:20090415210818j:image
 
 Making it a regular card size gives me a place to put my chips. And the balsa makes it easier to move multiple cards together. I may make a smaller version (8/9).
 
 
 I'll change the rule to deal 16 cards instead of 2.
 
 Current rulebook: http://www.nishiohirokazu.org/files/spaghetti_monsters.pdf
 Current rulebook: http://www.nishiohirokazu.org/files/spamon_cards.pdf
 </body>

[Hatena Diary 2009-04-15 https://nishiohirokazu.hatenadiary.org/archive/2009/04/15]