Hatena2016-01-11
code:hatena
 <body>
 *1452478442* Discussion of Information Education at Programming Symposium
 During the evening session of this year's Programming Symposium, there was a heated discussion about information education. I wrote this article because I agree with the opinion expressed there that it would be beneficial to write about this discussion on blogs and other media.
 
 In order to discuss the merits of a method, it is first necessary to clarify "what is the 'objective' to be achieved by that method. Otherwise, it will lead to a meaningless argument that "Method X is beneficial (for Objective A)" or "No, Method X is not beneficial (for Objective B).
 
 As <a href="https://www.facebook.com/photo.php?fbid=10153203123322761&set=a.10150245498142761.318995.653777760&type=3&theater">Dr. Suto pointed out</a>, there are at least three objectives of programming education. </>As Dr. Shudo pointed out</>, there are at least three purposes of programming education: "teaching how to program," "teaching computer science," and "spreading the joy of the act of programming.
 
 I agree with this opinion.
 
 The second objective includes <a href='http://csunplugged.jp/'>Computer Science Unplugged</a> and <a href='http://www.digitalpocket.org/computerscience/'>Biscuit developer "Harada Hakase"'s Introduction to Computer Science</a>, and more. I was very impressed when I heard Mr. Harada in the audience talk about teaching how "there is a big difference in efficiency by devising a method (algorithm)" by putting playing cards face down and having a pair of people work together with one person only giving instructions and the other person only looking at the cards. It was also interesting to hear about a magic trick that anyone can do using Othello frames (the seed is the concept of parity bits).
 
 A cycle of improvement by creating, sharing, and actually using more "computer science education methods" of this kind will make it easier to achieve Objective 2.
 
 
 Another angle of the objective is to "a. Accelerate the top corps that are already emerging," "b. Conduct selection to find those who can join the top corps in the future," and "c. Raise the level of all citizens broadly. Looking at the topics discussed at the meeting, it seems that some of the participants assumed that 2-c "widely educate all citizens to master the basics of computer science" is a good thing and should be done. I have my doubts about this assumption, but if we are going to discuss the merits or demerits of the means of "having all citizens learn the basics of computer science," it is necessary to first clarify what the objective is.
 </body>

[Hatena Diary 2016-01-11 https://nishiohirokazu.hatenadiary.org/archive/2016/01/11]