Hatena2008-04-16
code:hatena
 <body>
 *1208303675*Cover
 f:id:nishiohirokazu:20080416085302j:image
 
 TODO: Replace the top left when the book enters Amazon.
 
 They have already decided on an ISBN. It's still 404, but will it be in here eventually? >http://www.amazon.co.jp/gp/product/9784839922825
 
 TODO: Make a list of addresses to send book donations to by the 20th and give it to the publisher.
 
 *1208314120* 4 letter name
 <a href="http://b.hatena.ne.jp/entry/http://d.hatena.ne.jp/Hamachiya2/20080415/euphonious"> Hatena Bookmark - Names with 4 Sounds - I'm Machi-chan! (Hatena)</a>
 
 Python: Paizo
 Jython: jason
 Google App Engine: .........Gooape! I've just decided on Guape! (Oh!
 
 
 
 Combinatory Logic: Konroji
 Immovable point operator: immovable point operator
 Sanitizing: Sanitan
 Schwarz transformation: Shuwa Hen
 Schwarzschild radius: Schwarzschild
 Einstein: Ein
 Black hole: braho
 Hatena Diary: Hatenari-i
 Logout: Logout
 Permanent Link: Pamarin
 Support Vector Machines: Sapo
 Desktop Reference: Depris
 Sandwich: Sandwich
 Makkuku Bukku: Makkuku
 IronPython: Aipai
 Amazon Associate: Azo Ashi
 
 
 It's surprising how far you can go.
 
 *1208315432*Who seeks contact with Geek?
 -Who Wants Contact with Geeks--Wii Athletes Report - ITmedia Enterprise
 --http://www.itmedia.co.jp/enterprise/articles/0804/14/news016.html
 
 <del>I was just playing Wii Sports and it's kind of a cool story! Professional reporters are awesome! </del>(Deleted)
 
 
 Thank you for promoting the 1000 Speakers Conference!
 
 *1208325413*Dedication
 Oh no, it's hard to choose 5 people to go. I want to send everyone I know, "Look what I wrote! I managed to choose 5 people, but I'm afraid I have to send out an e-mail asking for their addresses. What should I write in such a mail? Ugh.
 
 >>
 norahmodel @nishio Decide on Wii competition > dedication
 tokoroten @nishio I put it on the top shelf of Hot Pepper in Shinjuku. First five to arrive.　　I'm not sure if it's a good idea or not.
 <<
 
 That's interesting w especially the tokoroten proposal.
 
 *1208333617*Python Survey
 Original story: [Python-ml-jp 4322] 10 Questions to Ask a Pythonist http://www.python.jp/pipermail/python-ml-jp/2008-April/004319.html
 
 Livedoor Surveys is so interesting and easy to create surveys. I also like the UI of this graph! So I made it!
 
 -Python coding style: How do you indent?
 --http://lislog.livedoor.com/r/7034
 -Python coding style (blanks): where would you put a blank in "if(x+y)*2==4:"?
 --http://lislog.livedoor.com/r/7035
 -Python Coding Style (Blanks Part 2): Which of the following would you put a blank in qsort([1,2,3],cmp,reversed=True)?
 --http://lislog.livedoor.com/r/7040
 -Python coding style (naming conventions): If you create a class to represent "HTML parser error," what name should you use?
 --http://lislog.livedoor.com/r/7041
 -If you could possess Guido before he created Python and change his mind about just one of the options below, which one would it be?
 --http://lislog.livedoor.com/r/7038
 
 It's interesting to see the votes come in one after another, and I write the commentary after a day or two when the number of votes stops increasing.
 
 *1208346202*Hate to lose
 He hates to lose, so when he saw id:suztomo of the 86 generation playing TopCoder, he wanted to play it too.
 
 http://d.hatena.ne.jp/suztomo/searchdiary?word=topcoder
 
 http://d.hatena.ne.jp/y_yanbe/20080106/1199566667
 
 I am not sure about the Purchasing Role in the registration section. I entered it at random and registered.
 
 
 
 http://www.topcoder.com/tc?module=Static&d1=dev&d2=support&d3=devGettingStarted
 
 I heard I should read this. No, it's component competitions and I wanted to do algorithm competitions (held weekly), maybe.
 
 
 
 http://www.topcoder.com/tc?module=Static&d1=calendar&d2=thisMonth
 
 This seems to be the schedule for the weekly event. Blue. I think it's next Wednesday night at 9:00pm. I wonder how long it will take; I think I heard an hour and a half so I can do it at work and go home when it's over. I think I heard an hour and a half, so I can do it at work and then go home. All times are Eastern Time unless otherwise stated. When I registered, they asked me what time zone I was in, so I thought of course I had converted it. 9pm Eastern Standard Time means...let's see...11am the next day?
 
 http://www.topcoder.com/tc?module=Static&d1=help&d2=getStarted#whatisarena
 
 Read the following. Pressing Launch Arena on the left menu launches the program in JWS. At first, a cool screen was launched. I was able to log in.
 
 Double click on his name and you'll see that he's an Argentine student and a C++ user, and you'll see a one-line profile of what he put in Quote.
 
 
 I found someone else's source code when I pressed "Summary" at random. Is that the extent of the problem? I'll do it in Java for now, or I'll do it in C++ to study C++.
 
 By the way, contrary to what you might imagine, I don't know C++ at all. I just learned that #include<algorithm> is about STL. I wonder why I should study it.
 
 
 
 http://gulfweed.starlancer.org/d/index.php?itemid=10
 
 This will help you install the necessary tools.
 
 -----
 
 Browser restart.
 Read the 250-point question from the last convention.
 Solving. (in Python)
 >|python|
 >>> def foo(A0, X, Y, M, n):
 	buf = [A0]
 	minDist = 10000
 	for i in range(1, n):
 		v = (buf[-1] * X + Y) % M
 		minDist = min(minDist, min(x - v for x in buf))
 		buf.append(v)
 	return minDist
 
 >>> foo(3, 7, 1, 101, 5)  # miss
 -73
 >>> def foo(A0, X, Y, M, n):
 	buf = [A0]
 	minDist = 10000
 	for i in range(1, n):
 		v = (buf[-1] * X + Y) % M
 		minDist = min(minDist,
 			      min(abs(x - v) for x in buf))
 		buf.append(v)
 	return minDist
 
 >>> foo(3, 7, 1, 101, 5)
 6
 >>> foo(3, 9, 8, 32, 8)
 0
 >>> foo(67, 13, 17, 4003, 23)
 14
 >>> foo(1, 1221, 3553, 9889, 11)
 275
 >>> foo(1, 1, 1, 2, 10000) # probably times out
 0
 ||<
 Hmmm.
 I'll try it in C++ as well. When I open the issue, *.cpp is created locally. Open it. Write something appropriate, save it, and then go to the TopCoder app and do Save, Compile, Test. Save, Compile, Test in the TopCoder app and select test case #1. Oh, it passes.
 >||
 #line 96 "MinDifference.cpp"
 #include <string>
 #include <vector>
 class MinDifference {
 	public:
 	int closestElements(int A0, int X, int Y, int M, int n) {
 	  return 6;
 	}
 };
 ||<
 I tried SUBMIT and got 209 points. Hmmm... I wonder if this is good as long as others don't Challenge me. I wonder what would happen if I prepare a program that generates an obfuscated code that can only be correct for that test case when a test case is entered. I wonder if there is no punishment for Challenge failure... Then I would just Challenge the code that is doing something weird like that...
 
 -----
 STL
 http://www005.upp.so-net.ne.jp/episteme/html/stlprog/
 
 -----
 I was going to read and study other people's (especially RedCoder's) code, but I can't copy and paste.
 
 http://www.umechando.com/software/
 >"Coppit! is a simple tool for copying text strings that cannot be copied by normal methods, such as descriptions on dialog boxes or selected lines in list boxes.
 
 Mwah, I can't grab it.
 
 -----
 >||
 >nslookup topcoder.org
 Non-authoritative answer:
 Name:    topcoder.com
 Address:  66.37.210.86
 ||<
 
 Captured in Eathereal and pasted into Python.
 
 >|python|
 >>> data = """
 0160  7a 02 03 7a 23 69 6e 63  6c 75 64 65 20 3c 76 65   z..z#inc lude <ve
 0170  63 74 6f 72 3e 0a 23 69  6e 63 6c 75 64 65 20 3c   ctor>.#i nclude <
 0180  6c 69 73 74 3e 0a 23 69  6e 63 6c 75 64 65 20 3c   list>.#i nclude <
 (omitted)
 """
 >>> data = data.strip()
 >>> data = data.split("\n")
 >>> data[0]
 '0160  7a 02 03 7a 23 69 6e 63  6c 75 64 65 20 3c 76 65   z..z#inc lude <ve'
 >>> data[0][6:-20]
 '7a 02 03 7a 23 69 6e 63  6c 75 64 65 20 3c 76 65'
 >>> [chr(int(x, 16)) for x in data[0][6:-20].split()]
 ['z', '\x02', '\x03', 'z', '#', 'i', 'n', 'c', 'l', 'u', 'd', 'e', ' ', '<', 'v', 'e']
 >>> [[fo.write(chr(int(x, 16))) for x in line[6:-20].split()] for line in data]  # miss
 (Omitted)
 >>> fo.close()
 ||<
 
 Then, open the saved file and delete the unwanted characters before and after. Done.
 
 I can understand if it's HTTP, but it's too much trouble to parse the query since it's being sent in binary via TCP. I wonder if I can make a program to cut out and save the next null character if there is an "#include" string in the returned packet.
 
 http://d.hatena.ne.jp/Voluntas/20071231/1199109958
 
 I wonder if we should not echo this, but rather have the client send it to the server and the server throw it to the client~?
 
 Time is up for today. I was chastised for being late, and for the past three days neither amachang nor I have been late. Gradually, the time of arrival and departure shifted backwards, and as of 23:00, there are still two of us left. This might be a flag that one of us will be late tomorrow.
 </body>
 <comments>
 <comment>
 <username>shou</username>.
 <body>Yasukazu Nishio: Moemoe</body>.
 <timestamp>1208320268</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Because it's not an abbreviation! <BR>Walking moe factor: there is one</BODY>.
 <timestamp>1208321448</timestamp>
 </comment>
 <comment>
 <username>jj1bdx</username>
 <body>Purchasing role is generally defined as the extent to which a company is involved in the purchasing of products. The right to decide which products to use, or the discretionary budget for those products, are the specific factors that determine the role. </body>
 <timestamp>1208389630</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I see what you mean. So it was a question like whether or not you have the right to make a decision. I had never been asked that before, so it didn't ring a bell. </body>
 <timestamp>1208399420</timestamp>
 </comment>
 <comment>
 <username>Gus</username>
 <body>> I hope this doesn't make me Challenged by others? <br>After Challenge Phase, there is System Test, where you will be tested on a much larger number of test cases. If you want to practice past questions in arena, you can try System Test in Practice Options->Run System Test in the practice room. <br><br>What if we have a program that, when you put in a test case, generates obfuscated code that can only answer that test case correctly? <br>In addition to the above, there is a rule against obfuscation. <br>http://www.topcoder.com/wiki/display/tc/Competing+in+a+Rated+Algorithm+Competition<br><br>Is there any punishment for Challenge failure? <br>Challenge success is +50, failure is -25. If you fail too many times and your score becomes negative, you will not be able to Challenge. </body>
 <timestamp>1208405021</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-04-16 https://nishiohirokazu.hatenadiary.org/archive/2008/04/16]