Hatena2009-09-09
code:hatena
 <body>
 *1252463890*[Python] Slice
 <a href='http://d.hatena.ne.jp/snow-bell/20090909/1252438160'>Extracting elements using slices - snow-bell's diary</a>
 
 I think this might be confusing with subscripts and values since a in the example is a list of numbers. Let's change the example.
 
 >|python|
 >>> a = range(5)
 >>> a
 [0, 1, 2, 3, 4]
 >>> a[:3]
 [0, 1, 2]
 >>> a[3:]
 [3, 4]
 
 >>> a = 'abcde'
 >>> a
 'abcde'
 >>> a[:3]
 'abc'
 >>> a[3:]
 'de'
 ||<
 
 In the first example, the zeroth contains the number 0. The index and the value are the same. Then, [3:] will take the value after the third (index greater than or equal to 3), and [:3] will take the value before the third (index less than 3).
 In the second example, the value is changed to a letter, but the slicing process itself is the same; if you are not accustomed to counting from 0, it is easy to misunderstand where the third number is (d, not c), but it is divided into two parts: before the third number and after the third number.
 
 >>
 I was told that a[1:3] means more than 1 and less than 3
 Similarly, a[3:4] returns the element = 3 since it is greater than or equal to 3 and less than 4.
 But in fact, they write [a[3] when returning an element of 3
 <<
 
 So "a[3:4] returns 3 elements" is wrong.
 
 - Slices (such as a[3:4] or a[3:]) always return list-like items (not elements).
 - The way to write taking elements is a[3].
 - a[3:4] returns a list containing only one third element (a[3]). Same as [a[3]].
 -- I wonder if the Hatena Diary mistakes two [hatena-diary] as some kind of notation and reduces it to one.
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=479733665X" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 <hr>
 >>
 id:snow-bell something list-like? What do you call it?
 <<
 <a href='http://www.python.jp/doc/release/lib/typesseq.html'>3.6 Sequence types str, unicode, list, tuple, buffer, xrange</a> I guess.
 
 *1252494814*Diary
 If you have too many things you want to do or need to do, you will panic and feel like you are not making any progress. Make a list and start small and move forward one step at a time.
 
 What we did today
 - I threw away a few plastic bottles.
 - Put a little trash in the trash bag. I'll put it out tomorrow.
 - I bought some bath detergent.
 - I washed the bath.
 - I paid the electricity bill.
 - Requested an application for credit card payment for electricity.
 - Apple Developer Connection activated.
 - I made a place for piled-up books next to my bed. The books that are left here and there in the room are collected. If this storage space overflows, there are too many piles of books.
 
 What does it mean to read a book?
 >>
 Some books are to be tasted, others to be swallowed, and some few to be chewed and digested: that is, some books are to be read only in parts, others to be read, but not curiously, and some few to be read wholly, and with diligence and attention. --- Sir Francis Bacon
 <<
 
 Some books should be tasted, the rest should be swallowed. And very few books are those that should be chewed and digested well. In other words, some books are good enough to read only part of, and the rest should be read but with ease. And very few books should be read carefully and thoroughly.
 
 *1252498528*EEG Diary
 Looking at the schematic http://openeeg.sourceforge.net/doc/modeeg/modEEGamp-v1.0.png and parts list http://openeeg.sourceforge.net/buildeeg/files/orders.txt Order what you couldn't find in Akihabara.
 
 ** INA114
 
 Two INA114APs.
 
 ** TLC277
 I have a TLC277IP and a TLC277CP. Which one is it? I found that the IP is a "dual high-precision single power supply op amp" and the CP does not have a single power supply. I will probably have to buy the one with a single power supply.
 
 Four TLC277IP (296-7365-5-ND)
 
 ** 6N 139 OPTOKOPPLER
 Photo coupler. Without it, noise will cause serious problems.
 
 Hmmm, there are a lot of part numbers 6N139 and there are two types of Darlingtons, Darlingtons with base and Darlingtons with Vcc. Which is it.
 
 http://gyazo.com/3a81670860c3f5a514fb7a17b3591f0e.png
 
 I was thinking maybe Darlington with Vcc, since it's Vcc connected, but upon closer inspection, I see that only one company makes one with Vcc, and the rest are all based. I wonder if when they say regular 6N139, they mean with base. I'm not sure what you mean by "with base".
 
 http://search.digikey.com/scripts/DkSearch/dksus.dll?Detail&name=6N139QT-ND
 Example of Darlington with base.
 
 http://search.digikey.com/scripts/DkSearch/dksus.dll?Detail&name=160-1799-ND
 Example of Darlington with Vcc.
 
 http://gyazo.com/3a81670860c3f5a514fb7a17b3591f0e.png
 http://gyazo.com/289662ed63c81bfe2342a80cbb37f0dd.png
 http://gyazo.com/bd2eb60547fd7e0e7680b3b15965b517.png
 
 They all look the same... Can we use Darlington with base?
 
 ** Result
 <img src="http://gyazo.com/4c97944844da7303d28fe7af717cd6d5.png">
 
 The amount of transportation is so high.
 
 ** memo
 - CTR is Current Transfer Ratio
 </body>
 <comments>
 <comment>
 <username>c-yan</username>
 <body>] instead of ] with an entity reference. </body>
 <timestamp>1252492586</timestamp>
 </comment>
 <comment>
 <username>Passing by</username
 <body>In this case, shouldn't taste be translated as "to taste"? </body>
 <timestamp>1252521240</timestamp>
 </comment>
 <comment>
 <username>shou</username>
 <body>Exciting. Looking forward to it. </body>
 <timestamp>1252548611</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I see. </body>
 <timestamp>1252550248</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I see: &#93;</body>.
 <timestamp>1252550367</timestamp>
 </comment>
 <comment>
 <username>SUUDARA</username>
 <BODY>That's a lot of progress. <br>The difference between TLC277IP and TLC277CP is at the "heavy box" level and can be ignored for practical purposes. <BR><BR>The difference between TLC277IP and TLC277CP is a "heavy box" level and negligible for practical use. <BR><BR><BR>In the same way, if the model number 6N139 is the same, the wiring is also the same, and pin 7 is the base terminal for all of them. <BR><BR>The person in charge of preparing Digikey's catalog may have entered the wrong number just by glancing at the HCPL2730 (6N139 two-circuit built-in type), which appears in the same data sheet, because it does not have a base terminal, But still, the fare is too high...</body>.
 <timestamp>1252657777</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-09-09 https://nishiohirokazu.hatenadiary.org/archive/2009/09/09]