Hatena2007-10-10
code:hatena
 <body>
 *1191978713* from my phone.
 
 I woke up in the morning and was almost late because I was too enthusiastic when I typed up the Django Jar song to prevent myself from falling back asleep.
 
 I just noticed that Jango Jar seems to be a sentai thing. Python squadron Jangojar. The turbogear transforms and becomes the leg part of a giant robot.
 
 PS
 >>
 mitszo "I'm curious about everything but the giant robot's legs."
 <<
 Maybe Pilons will be the head part of a small airplane shaped one. Pilons launch!
 
 *1191979033* from cell phone.
 
 All the conversion study results and sound settings on my phone were gone.
 
 Gingko trees were drying on the road.
 
 If you personify a past rack, is it Michi Torako? Is the sister a child-bearing child?
 
 *1191983753* Test Indications
 
 I thought that writing tests was a life hack that kept me motivated by quantifying and visualizing the "development progress".
 
 *1191986503* I just noticed.
 
 id:o
 A person with a hat and an open mouth.
 
 *1191987050* from cell phone. Lunch.
 
 Magellanic Shrine
 
 *1191987163* From my phone. Character Collection.
 
 A stand?
 f:id:nishiohirokazu:20071010123244j:image
 
 *1191987351* from cell phone.
 
 This is the first time I've heard of sakiwau.
 f:id:nishiohirokazu:20071010123551j:image
 
 *1191987505* from cell phone. Kanji Collection.
 
 (Edo-period) fireman
 f:id:nishiohirokazu:20071010123825j:image
 
 PS: No, is this a mirror character for "Chiaki"?
 Thousand-autumn Delightful Drinks
 
 *1191987668* from cell phone. Kanji Collection.
 
 The registration abstract is in an unfamiliar script.
 f:id:nishiohirokazu:20071010124108j:image
 Iwamura Brewery
 
 *1191990549* from cell phone.
 
 I took so many pictures that it's hard to upload them. I thought there would be a lot of things to take pictures of at a shrine, but I didn't expect to see a sake barrel.
 
 *1191991492* Gearman
 
 When I heard that id:jbking said that Gearman can help you transcend language barriers, I looked into it. I've always thought it was a useful library like Perl (but not for me), but this might be a pretty good one.
 
 TokuLog: Shut up and write some code, bald guy - Gearman Python port
 http://d.hatena.ne.jp/tokuhirom/20070506/1178450297
 
 >>
 Job from an application written in RoR to gearmand
 You can enqueue and process jobs in Python, or write applications in Sledge.
 The job is enqueued to gearmand from a Python job description, and the job is processed in Python.
 or by enqueueing a job from an application written in Turbogears.
 Perl can also handle this.
 What's exciting about this is that you can write Python web applications
 When I was working on a project, I was trying to find a library that Perl has but Python doesn't. (I was trying to find a library that would be useful to me, but I didn't have the time.
 The "I want to use the "I" button (I know, I know...).
 The time when language barriers will be eliminated is already at hand.
 <<
 
 Oh, wow.
 So I can use Perl's Text::VimColor with gearman from the org how to write in Django!
 
 *1191996699* Was looking into Pylons.
 
 Diary of perezvon - Pylons traceback is awesome!
 http://d.hatena.ne.jp/perezvon/20070324/1174758114
 >>
 via a browser for the stack frame when an exception occurs! You can debug interactively via the
 <<
 
 Amazing!
 Imada-dasunda-dasunda-dasunda-dasunda-dasunda-dasunda-dasunda-dasunda-dasunda-dasunda-dasunda!
 
 *1192018196* java-ja song
 
 The flow of java-ja is very fast. I'll reprint it here because it's too much trouble to follow it later.
 
 >>
 If the jabba-jabba had not been...
 The earth immediately freezes
 Even if the night of sorrows continues
 You don't lose, you wait for morning.
 
 Jabba Jabba is the language of life.
 Happiness, O. It's the flame that protects.
 Apatchi! Jeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee! Shhhh!
 Apatchi! Jeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee! Shhhh!
 Our souls are on fire.
 Follow The Sun, Catch The Sun
 Jabba Jabba Sentai Jabba Jabba Jabba
 <<
 
 *1192019043* Well, let's go home.
 Finally no more errors in the new version of org how to write.
 But of course, the new features I haven't written tests for yet haven't shown any errors.
 There is still a long way to go.
 
 By the way, the development codename is "Douwu kigyoutai.succ 2nd GIG". I just decided.
 
 *1192033810* Kanji collection
 a votive lantern
 f:id:nishiohirokazu:20071010213240j:image
 f:id:nishiohirokazu:20071010213246j:image
 
 It's a gold bias, isn't it? Stirrups.
 
 *1192021093* From my phone. Kanji Collection.
 
 Fame, roaring in the sky?
 f:id:nishiohirokazu:20071010215811j:image
 
 honorary medal awarded to the winner of a bout
 f:id:nishiohirokazu:20071010220000j:image
 
 sake made without added alcohol or sugar
 f:id:nishiohirokazu:20071010220103j:image
 
 Niigata sake, maybe.
 f:id:nishiohirokazu:20071010220154j:image
 
 The fame roars in the four seas. Rokkasen brewery
 f:id:nishiohirokazu:20071010220514j:image
 
 Sake cups gajumo?
 f:id:nishiohirokazu:20071010220727j:image
 Does that read "as many cups as there are"?
 
 *1192033811* Pachelbel's Canon in Hatsune Miku (with some lyrics)
 
 On my way home this day, I suddenly remembered that I had seen a video of Hatsune Miku making Pachelbel's Canon, and I thought it was a waste of time because she only said "ah", which is almost meaningless. But I got tired of it halfway through, or ran out of energy, or something, and Hatsune got drunk, so I'm back to "A" again. Well, I'll do something when I feel like it.
 http://www.nishiohirokazu.org/files/canon.mp3
 The reason why the notes seem to be shaking in the second half is because the default setting for portamento, which is a smooth connection between notes, was set. If you want to play canon seriously, you need to turn off portamento and vibrato in the default setting of notes first. Also, the three of them are like three sisters with gender factors of 0, +30, and -30 respectively. But it's not good. First of all, the first note doesn't cover the range of the canon.
 </body>
 <comments>
 <comment>
 <username>mitszo</username>
 <body>I am concerned about everything but the giant robot legs. </body>
 <timestamp>1191990163</timestamp>
 </comment>
 <comment>
 <username>Yoshiori</username>
 <body>"Pylons On!" </body>
 <timestamp>1191993255</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>♪ Pilons on, the heart of justice! <BR>Tobasse- Tekken- paster serve<BR>Imada-dasunda- WSGI-! <BR><BR>I don't know if it's like this! （</body><br><br>I don't know!
 <timestamp>1191995962</timestamp>
 </comment>
 <comment>
 <username>Voluntas</username>
 <body>Make a python vimcolor</body>.
 <timestamp>1192005628</timestamp>
 </comment>
 <comment>
 <username>perezvon</username>
 <body>This http://blog.nomadscafe.jp/archives/000725.html</body>
 <timestamp>1192031884</timestamp>
 </comment>
 <comment>
 <username>likk</username>
 <body>Heihein Jas is a variant of Autumn</body>.
 <timestamp>1192063340</timestamp>
 </comment>
 </comments>

[Hatena Diary 2007-10-10 https://nishiohirokazu.hatenadiary.org/archive/2007/10/10]