Hatena2012-10-10
code:hatena
 <body>
 *1349852027*Re: How good are programmers~?
 <a href='http://d.hatena.ne.jp/nowokay/20121010'>Programmer competence does not increase with experience alone, which leads to a level gap - Kishida's Hatena</a>.
 
 A claim that can be summarized as "we should learn X" cannot be judged by the listener as to whether or not it is true; since we don't know about X, there is no way we can judge it.
 
 I doubt that the speaker is judging correctly either. Simply because he/she has learned X and doesn't want to think that it was pointless, he/she thinks "I should have learned X"? This is difficult to answer: wouldn't you have been better off learning Y in the time it took you to learn X? I can't answer this question; I haven't learned Y, so I can't judge it.
 
 So the argument that "you should learn X" is essentially sterile. Instead, we could say, "I'm interested in X," "I think learning X is beneficial," "I enjoy learning X itself," or "If you think, 'Learning X is pointless,' then be my guest. I'm just going to do what I want to do."
 
 So, I'm not interested in the "what should I learn theory", I'm interested in ZDD, so I'll put up the slides (yeah).
 <iframe src="http://www.slideshare.net/slideshow/embed_code/14662843" width="427" height="356" frameborder="0" marginwidth="0" marginheight="0" scrolling="no" style="border:1px solid #CCC;border-width:1px 1px 0;margin-bottom:5px" allowfullscreen> </iframe> <div style ="margin-bottom:5px"> <strong> <a href="http://www.slideshare.net/nishio/zdd" title="Introduction to ZDD - How to Save Your Sister" target="_blank">Introduction to ZDD - How to Save Your Sister</ a> </strong> from <strong><a href="http://www.slideshare.net/nishio" target="_blank">nishio</a></strong> </div
 
 ** Postscript
 
 Well, for those of you who don't understand the context or who I am, I am in the "it's important to learn X" camp, just like Kishida-san. However, when I say in one voice here, "Yes, yes, yes! does not prove the truth of this assertion. If there is an opposing opinion to this opinion, I don't want to argue with them to prove that I am right. If you don't think it's important to learn, then go ahead and do it on your own. ZDD is fun! And that's what I thought.
 </body>
 <comments>
 <comment>
 <username>nowokay</username>
 <body>ZDD is fun, isn't it? <br>Lately, I've been using The Art of Computer Programing 4-1 as my pillow because I can fall asleep easily when I think about ZDD! </body>
 <timestamp>1349855880</timestamp>
 </comment>
 </comments>

[Hatena Diary 2012-10-10 https://nishiohirokazu.hatenadiary.org/archive/2012/10/10]