Hatena2008-04-27
code:hatena
 <body>
 *1209262260* That "Satomi Koorogi" is her real name.
 I remembered being asked yesterday about the difference between crickets, grasshoppers, and pine beetles, and while doing a little research, I learned that the family name "Koorogi" exists.
 
 >>
 There is an obfuscated surname called Koorogi (興梠) (Koorogi). It is found in Miyazaki to Kumamoto prefectures. One famous person is voice actress Satomi Koorogi (her father's side is from Kumamoto).
 <<
 http://ja.wikipedia.org/wiki/%E3%82%B3%E3%82%AA%E3%83%AD%E3%82%AE
 
 >>
 Satomi Korogi (born November 14, 1962) is a Japanese female voice actress. Real name: Satomi Korogi.
 <<
 http://ja.wikipedia.org/wiki/%E3%81%93%E3%81%8A%E3%82%8D%E3%81%8E%E3%81%95%E3%81%A8%E3%81%BF
 
 Column - Origin of Kourogi
 http://www.kuis.ac.jp/chinese/column-korogi.htm
 
 *1209291527*材料
 f:id:nishiohirokazu:20080427191145j:image
 
 *1209295811* fluffy
 I was kind of very sore in the morning, orz.
 
 I woke up at 11:00 and it's only 8:30 and I'm already sleepy... Battery dead.
 
 *1209298932*Thinkpad
 I've been using my Thinkpad for a while now, but lately it's not doing so well. The battery lasts only 20 minutes, the browser freezes easily, and the HDD sometimes runs down to 200MB or so. It's not good to have such a small HDD (32.67GB) to begin with. I think I'll take this opportunity to make a backup of the entire contents of my HDD and have it replaced...
 Should I send it in for repair or buy a HDD and replace it myself?
 Moo.
 </body>
 <comments>
 <comment>
 <username>kotarok</username>
 <BODY>There is a person named "Satoko Kohrogi" who was my junior in school, and I wonder why Mr. Nishio is mentioning her? Is she an acquaintance? I wondered why Nishio-san mentioned her. </body> I was wondering why Mr. Nishio mentioned her.
 <timestamp>1209282093</timestamp>
 </comment>
 <comment>
 <username>kajuntk</username>
 <body>新しいのを買う</body>
 <timestamp>1209305331</timestamp>
 </comment>
 <comment>
 <username>m-wada</username>
 <body>I vote to buy it (for the manuscript fee and royalties. Congratulations on the publication.)<br>There is little hope of increasing the capacity of either. <br>A little work may be necessary. Please refer to the following. <br>http://homepage2.nifty.com/emotom/x40/x4.htm<br>If you send it in for repair, it may be changed to a specification that connects to the HDD with a special connector. <br>ttp://pc11.2ch.net/test/read.cgi/notepc/1187096704/236-246(I can't see the picture now)<br>I gave up and decided to put it in an external HDD and 16G SD. </body>
 <timestamp>1209313049</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-04-27 https://nishiohirokazu.hatenadiary.org/archive/2008/04/27]