Hatena2009-07-03
code:hatena
 <body>
 *1246613465* Raw commercial for mobile digital signage bag
 <a href='http://ketudancom.blog47.fc2.com/blog-entry-69.html'>Decision Potoff - I'll be live commercializing the mobile digital signage bag</a>.
 
 But it comes with only three pockets for iPhones: <a href='http://d.hatena.ne.jp/akio0911/20090629/p2'>The pockets on the mobile digital signage bag are underwhelming</a>.
 
 *1246616720*Making t-shirts because it's summer
 1: Print the Python logo in A3 size as appropriate.
 
 f:id:nishiohirokazu:20090703192553j:image
 
 2: Cut out the pieces with a cutter and affix them to the T-shirt with double-sided tape around the edges.
 
 f:id:nishiohirokazu:20090703192806j:image
 
 3: This is what happens when you spray paint and remove it. I could have sprayed more.
 f:id:nishiohirokazu:20090703193008j:image
 
 4: I reversed it because it's not artistic to do the same on the other side.
 f:id:nishiohirokazu:20090703193011j:image
 
 Try shooting in bright light.
 f:id:nishiohirokazu:20090703193643j:image
 
 recipe
 - Dye-Q Gold (spray paint)
 - A3 print (online print at convenience store)
 - cutter knife
 - double-sided tape
 
 *1246634560*Painting of the Day
 <img src="http://gyazo.com/5c79269f5b805bc8552a6a10a50ea669.png">
 
 Wow I feel bad!
 
 *1246640484*Hacker's Cafe English Blog
 Access information for <a href='http://blog.hackers-cafe.net/'>Hacker's Cafe Blog</a>.
 
 <img src="http://gyazo.com/ad8c1b1ef671516e663d2b7fa13942b9.png">
 
 After the U.S. and Russia, India is next.... Surprisingly, Africa is also looking at us.
 
 *1246641277*The Stakes
 <a href='http://anond.hatelabo.jp/20090703232636'>Even in the US, the stakes are higher. Even more than in Japan</a>.
 
 Look at this,
 
 <a href='http://ja.wikipedia.org/wiki/%E3%83%95%E3%83%AA%E3%83%BC%E3%83%A9%E3%82%A4%E3%83%80%E3%83%BC'>Freerider - Wikipedia</a>
 
 >>
 According to a comparative experiment in experimental economics between Japan and the U.S., Japanese students are more likely than their American counterparts to pull the legs of those who free-ride even at a loss to themselves[2]. // Also, in a similar experiment with Japanese and U.S. graduate students [3], Japanese students were more likely than their American counterparts to try to make their non-participating counterparts lose money, even at a considerable reduction in their own profits.
 <<
 
 I was reminded of the following. Now here in the original sentence.
 
 >>
 It seems that there is a system built into the national system to spot the real ones among the stakes and support them without hesitation.
 <<
 
 That is not the same as saying "the stakes are high. The "out stakes will be hammered" is to be hammered just for being out, even if the content of the claim is in line with the content of the claim. It is natural to strike at things that are at odds with what they claim and what they actually are, and to strike at things that are disadvantageous to oneself. It is not wrong to strike for the public good of society, even if it does not benefit you. The problem is the existence of those who strike even though no one benefits by striking.
 </body>

[Hatena Diary 2009-07-03 https://nishiohirokazu.hatenadiary.org/archive/2009/07/03]