Hatena2011-08-28
code:hatena
 <body>
 *1314542109*Working on organizing books
 After all, the biggest problem I have is that the books I bought because I thought "I should read this to make myself better" but haven't been able to find the time or motivation to read them are sticking around like sludge. After taking inventory of all the books, I found that English, math, and <a href="http://www.amazon.co.jp/gp/product/4804761055/ref=as_li_ss_tl?ie=UTF8&tag=nishiohirokaz-22& linkCode=as2&camp=247&creative=7399&creativeASIN=4804761055">Why can't I put them away</a> type books are too numerous.
 
 When talking about this kind of thing, there are often people who say, "Just throw them away and get them again when you need them," but this is only applicable to people who have only books that are easy to obtain. It may not be possible to get the books you bought in the past or on your travels again. For example, I had 10 years' worth of IPSJ journals and IJA journals in my house, which I threw away when I moved last time, as well as a textbook in the local aboriginal language that I bought when my plane broke down and I had to spend a night in Alaska on my way back from an American conference.
 
 We need to change the way we make decisions a little.
 - Q: "Suppose, for example, your house catches fire and this book burns up and is lost. Would you ever want to reacquire it?"
 -- I threw away the Alaska vernacular textbooks when I realized I didn't want to reacquire them.
 - Q: "When you say reacquire, don't you mean physically reacquire, or even borrow or copy from the library?"
 -- I can get the journals at the Library of Congress or some other place without me personally storing them. It is not my job to keep these 240 journals! So I threw them away.
 
 Now, if we ask questions and discard in this way, most of the books will be "thrown away". What about that? What about a book right after you bought it with the intention of reading it, for example? Oh, well, if it's right after I bought it with the intention of reading it, I'll buy it again when it burns. Should I think about what happens to the books I've piled up with the intention of reading but haven't read in the end, and if I don't want to buy them again once I burn them, should I decide that it was a mistake to buy them and throw them away? Hmmm.
 
 I need to think of a good question statement regarding a book I haven't read to read. "Do you want to read this? Why are you reading it?" Or something like that.
 </body>
 <comments>
 <comment>
 <username>mrwk</username>
 <body>"Do you think you will read this book within a year?" How about this</body>?
 <timestamp>1314592078</timestamp>
 </comment>
 </comments>

[Hatena Diary 2011-08-28 https://nishiohirokazu.hatenadiary.org/archive/2011/08/28]