Hatena2009-04-29
code:hatena
 <body>
 *1240995902*[en]Okame Sushi
 f:id:nishiohirokazu:20090429180458j:image
 
 Kaimen. It's like "I'm sorry, I'm sorry" or "It's okay, I forgive you" (wrong).
 
 *1240999605*TwitterがGoogleになった
 Something weird happened.
 <img src="http://gyazo.com/d89b9a91dd882695e35b2c07882fbe3a.png">
 
 twitter.com/homeにアクセスすると
 <img src="http://gyazo.com/e757d24602a5f14625657d5140a882c7.png">
 Such a thing. Too mysterious.
 
 
 I accessed it with Safari and it was normal. I guess I should stop using Firefox 2 for now.
 
 *1241008675*I switched to Firefox 3 and the bookmarklet is broken.
 I wonder if the &amp;lt; in the bookmark was reverted to <...
 
 *1241008878*The Complete Ruby Source Code Guide should be read even if you don't use Ruby.
 <a href='http://i.loveruby.net/ja/rhg/book/'>Complete Ruby Source Code Explained</a>
 
 I had never read it before, thinking "I'll never read Ruby source code" or something like that, but I thought this was a good text to read even if you don't use Ruby. Especially the introductory chapter, "The Art of Reading Source Code.
 <hr>
 Leverage memo below
 
 
 The secret to reading source code is to "read with a purpose.
 
 If you do not know what you are trying to know, there is no way you can "know" anything. So the first step in all of this is to clearly put into words what you want to know.
 
 If you want to know the truth, you should start with the facts. Not predictions.
 
 Be able to explain in a few words what the function does.
 
 When reading, it's not what you read that matters, but what you don't read
 
 The first thing you need to do is look at the directory structure.
 
 *1241012638* Pandemic Sanitation Kit
 I'm looking at the contents of the pandemic sanitation kit my parents sent me last year. <a href="http://www.amazon.co.jp/gp/product/B000FQU036?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=B000FQU036">Cleverine G 150g</a> or <a href="http://www.amazon.co.jp/gp/product/B000IJ6X2W?ie=UTF8&tag=nishiohirokaz-22& linkCode=as2&camp=247&creative=7399&creativeASIN=B000IJ6X2W">Vicre 60ml</a>, and some protective clothing that I have no idea when to use.
 
 f:id:nishiohirokazu:20090429230744j:image
 
 Cleverine is a powder and liquid that, when left mixed together, releases chlorine dioxide to kill viruses. <a href='http://www.seirogan.co.jp/medical/eiseidata.html#ancher1'>Chlorine Dioxide Experimental/Verification Data - Daiko Pharmaceutical Co. They say it lasts two months, so I've already decided to install it.
 
 f:id:nishiohirokazu:20090429235704j:image
 
 It looks like an ordinary deodorizer. What makes it a little different is that the amount of gas that comes out can be adjusted with the lid.
 
 I also tried on the N95 mask. It's hooked to my chin.... It's quite interesting.
 </body>

[Hatena Diary 2009-04-29 https://nishiohirokazu.hatenadiary.org/archive/2009/04/29]