Hatena2007-12-25
code:hatena
 <body>
 *1198538990*朝
 I woke up all right!
 
 *1198541679* Reverse Closing Effect
 When there is a "deadline that must not be missed," such as "I have to leave at 12:00," it is difficult to concentrate on the work, contrary to the usual deadline effect.
 Maybe it's out of a sense of "not getting too immersed and falling behind."
 
 So after I finish the laundry I am doing this time, I will hang it up and leave. It's a more useful use of my time to go to the ICT school and watch the high school students than to slack off and go online.
 
 *1198552034* Oshiage to Mizonokuchi
 
 I took the Hanzomon Line to Shibuya and asked the station attendant after I crossed over my regular train, and he told me that the Denentoshi Line is connected to the Denentoshi Line, so I didn't have to get off the train. It got complicated. I mean, the transfer guide says it's a direct line, so I should have read it myself.
 
 I thought it was a project of the Ministry of Education, Culture, Sports, Science and Technology, but I thought it was going to be held at a mysterious place called Hotel KSP, which stands for Kanagawa Science Park.
 
 *1198571238*Schedule is pushed a lot.
 
 How long does it take to get from Kanagawa to Odaiba?
 
 *1198572205* Restroom
 
 I'm not sure about the expression "gentlemen's restroom".
 
 *1198593848*帰り電車
 
 I forgot to charge my computer at the Odaiba lab. I can't make good use of the train time for writing. What a bummer.
 
 *1198599323*帰宅
 Woohoo, it's already 25:00.
 
 I was surprised to see that my one-liner about my work yesterday received more than 100 hits.
 Why three years?" One reason is simply that the first task of the lab was to "create innovations that will become the pillars of the next generation of the Cybozu Group over the next three to five years.
 
 
 If you prefer a cooler solution, I would suggest using "100 million seconds is roughly 3.1 years" as a basis. What can you do with the 100 million seconds that flow equally to everyone? Do you throw away 300 seconds by saying "I want to sleep for 5 more minutes"? Busy" and "I'm not feeling well" are not excuses. It is all my responsibility. I know it sounds harsh, and I am not confident that I will be able to grasp anything of value in the storm-like flow of time, but it is a stark fact that three years have passed by the accumulation of every second.
 
 Well, it's early in the morning today, I'm drunk, and I haven't been to work in a while tomorrow, so let's get to bed.
 </body>
 <comments>
 <comment>
 <username>Yoshiori</username>
 <BODY>Nearly by our house></BODY>
 <timestamp>1198553249</timestamp>
 </comment>
 </comments>

[Hatena Diary 2007-12-25 https://nishiohirokazu.hatenadiary.org/archive/2007/12/25]