Hatena2008-03-15
code:hatena
 <body>
 *1205542184* Swollen tonsils
 -Pollen in the room.
 -Too much house dust.
 
 Which is.
 
 *1205545299* Matz's view on motivations for contributing to open source projects.
 >>
 I asked Matsumoto, "But what is the motivation of the people who gather around and contribute to the project? Matsumoto gave me an answer I had never considered. Most people are looking for a good problem of the right size and complexity." There are indeed many people of high intellectual level in the world, but most of them are incapable of setting up their own problems. // If there is a continuous supply of "good problems," the project has a high probability of success. This was Matsumoto's view. Many scales fell from my eyes.
 <<
 http://www.shinchosha.co.jp/foresight/web_kikaku/u138.html
 
 Scales fell from my eyes, too.
 
 *1205557225*Shibuya.abc#1
 http://www.ustream.tv/channel/nishio
 
 中継中～
 
 *1205569630*jQuery
 It would be interesting to use a jQuery-like interface when manipulating tree-like objects.
 
 *1205584956*Shibuya.abc#1 has been delivered!
 Putting it all together gradually
 
 - Connect as appropriate
 - Pull the display cable to connect TwinPact to the machine and the projector.
 - I tried turning it on for now, but CamTwist does not recognize TwinPact. I rebooted and it fixed it.
 - I recognized it, but when I selected TwinPact as the video source, nothing appeared -> it was because the input switching on the TwinPact side was set to Analog instead of RGB.
 - The screen has moved on! Next, sound.
 - Connect the EDIROL UA-3FX.
 -- I looked for a power supply, but it was USB bus-powered.
 -- Plugged into USB but power light does not come on. Need to install driver.
 -- There are many things in the driver package and they install different things.
 -- I installed the correct one and now the power light comes on. Note that a reboot is required.
 -- I first plugged the mini plug into the EDIROL headphone jack and input to the projector on the analog side, but this did not produce sound because the projector's input switching is RGB. (It might have worked if I switched to analog input, but I didn't try it.)
 -- Plug the microphone into the microphone input, analog out from there, and plug it into the projector using the analog to mini plug conversion cable. The projector now produces sound.
 
 f:id:nishiohirokazu:20080315215839j:image
 
 - I took a picture of the presenter's face with iSight on the MacBook on the desk next to the presenter, Sekino. The problem with this method is that I have to go to the front of the room to adjust the volume or when my face is covered by the presentation material, making it difficult to see. I wonder if I can share my desktop with the relay Mac?
 
 
 
 
 About encoding and such:
 -Install MacPorts. The instructions I found in my search were somewhat cumbersome, but I just downloaded it and double-clicked. I guess the instructions I found were out of date.
 -- http://svn.macports.org/repository/macports/downloads/MacPorts-1.6.0/MacPorts-1.6.0-10.5-Leopard.dmg
 -Paths must be passed through. export PATH=$PATH:/opt/local/bin.
 -- Add a note to ~/.bach_profile
 - sudo port install ffmpeg +x264 +faac +faad +lame
 -- It takes a lot of time.
 -- Wait, I started to install Perl.
 -
 >>
  10:00 coji : How to deal with ffmpeg make error termination:.
 /opt/local/var/macports/build/_opt_local_var_macports_sources_rsync.macports.org_release_ports_multimedia_ffmpeg/work/trunk/common.mak  の75行目  INSTALL_TARGETS-$(BUILD_SHARED) += install-lib-shared  をコメントアウトして再度 sudo port install ffmpeg +x264 +faac +faad +lame
 <<
 -- It wasn't on line 75, but a quick search found it -- it was on line 60.
 - Download the video from Ustream's MyVideoes by clicking on the Download: .FLV link on the video screen.
 -- If you don't change the name to something easy to understand, the file name will be a mass of numbers with the first few letters matching, which is stressful.
 -- For some reason, Firefox's Save As doesn't seem to create the file at the specified location... I have no choice but to download and rename them one by one.
 - Converted for Nico Nico Douga by script http://coderepos.org/share/browser/lang/ruby/misc/ust2smile.rb
 -- you can download it at the link at the bottom.
 - I looked hard to find where to upload to Nico Nico Douga, but SMILEVIDEO, which I had passed over as an unrelated service, was the one I was looking for.
 - I'm trying to upload one for now, but it's tough on e-mobile. e-mobile's upstream bandwidth is too narrow.
 -Geez. I was told that the file size was over.
 -- 40.8MB
 -- 40MB seems to be the upper limit
 - The extension of the file output by ffmpeg is changed to mov. The encoding is left to SMILEVIDEO, so the picture quality will be lower, but it's easy to use.
 - There are two videos that are labeled "broken". They are only broken in the middle, so I think they should be connected, but what should I use to connect them?
 -- QuickTime Pro makes it easy to connect with copy and paste. You may be able to do it with ffmpeg alone.
 - I'm trying to rewrite the description of a video that has already been posted while uploading to SMILEVIDEO, but I get the "Please log in" screen.
 - Since the description of the video does not appear on the My Lists list screen, it is necessary to put the necessary information in the title. At first, I used a title like "Shibuya.abc#1_1" but changed it to "1 Presentation title Presenter's name". The reason I put the number at the beginning is so that I can arrange them in ascending order later.
 - 失敗点
 -- I went to the trouble of hooking up a microphone, but the audio source was still set to the built-in microphone on the Ustream distribution screen (for the first two presentations), and they said it was much easier to hear when they changed the setting.
 -- I forgot to keep a log. I'm not sure what I'm talking about when I get rebooted for installing drivers, etc... should I put in tiarra or something like that?
 
 
 
 f:id:nishiohirokazu:20080315215911j:image
 The projector and TwinPact, as you can see there are two RGB cables in the TwinPact. The audio input is plugged into the RGB cable of the TwinPact projector.
 
 f:id:nishiohirokazu:20080315215956j:image
 EDIROL. analog LR input from a microphone. The white cable is a USB cable connected to a MacBook, which looks like a USB microphone from the MacBook.
 
 *1205592527* I sent you a picture.
 
 I didn't get it, so I'll do it again.
 f:id:nishiohirokazu:20080315234831j:image
 
 *1205603077* Well, I'm tired already.
 I'm tired.
 </body>

[Hatena Diary 2008-03-15 https://nishiohirokazu.hatenadiary.org/archive/2008/03/15]