Hatena2011-02-28
code:hatena
 <body>
 *1298899426* mind map diary 7
 When you are transforming formulas, it usually gets messed up. It is natural for this to happen because the structure of the equation has not been foreseen in advance.
 
 f:id:nishiohirokazu:20110228192418j:image
 
 The development of formulas with colorful symbols is probably to lower the cost of finding structure by paying the cost of getting used to the symbol system and switching colorful pens.
 
 This one is still only halfway drawn.
 
 f:id:nishiohirokazu:20110228192431j:image
 
 "Is it possible to create appropriate symbols because we have found the structure, or is it impossible to use appropriate symbols if we have not found the structure?" Is it still profitable to pay the cost of not using the de facto standard method of expression and the additional cost of becoming the de facto standard protocol in the future? There is no obvious answer to the question.
 
 Well, as for the former, it is likely to converge with the repetition of "try to express with an appropriate symbol system" → "update the symbol system based on the knowledge obtained". In the first place, it is possible to start with a de facto protocol and then start converting it to an oleo protocol. Since spontaneous protocols are subject to individual interpretation fluctuations, redundancy is inevitable. By compressing them, we can create a more waste-free system of symbols.
 
 As for the latter, it depends on your definition of cost and benefit. If we answer that the purpose of mind mapping is "understanding," then of course we need to answer the philosophical question, "What is understanding? I used to be a junior high school student. As a junior high school student, I used to think that storing knowledge and being able to retrieve it as needed was "understanding. But I think that is a mistake. By that definition, no one can beat a search engine in terms of comprehension. On the other hand, "to be able to create something new by applying knowledge" is too demanding. I think the answer to the question of whether or not "someone who cannot build a nuclear power plant but can explain the mechanism of nuclear power plants in simple terms" understands the mechanism of nuclear power plants is yes. For me, the definition of "understanding" that best fits my needs is "to be able to output knowledge in a format different from the format of its input. And by that definition, it is obvious that mind maps can be an aid to understanding.
 </body>

[Hatena Diary 2011-02-28 https://nishiohirokazu.hatenadiary.org/archive/2011/02/28]