Hatena2009-09-16
code:hatena
 <body>
 **1253067377*[ObjC]Crop image
 dried young anchovies (or sardines)
 >||
 CGRect crop_rect = [[info objectForKey:UIImagePickerControllerCropRect] CGRectValue];
 
 UIImage* smallImage = [UIImage 
     imageWithCGImage:CGImageCreateWithImageInRect(
         originalImage.CGImage, crop_rect)];
 ||<
 But the crop_rect was 300x301 and I couldn't figure out how to resize this crop frame. Then I came up with another solution and decided not to use this one.
 
 *1253080335*[ObjC]EXC_BAD_ACCESS
 It is a very typical Heisen bug that fails with EXC_BAD_ACCESS when executed on the actual machine, has no problem in the simulator, and cannot be reproduced when trying to narrow down the cause by step execution on the actual machine.
 
 It was my first iPhone app and I thought "I can't allow a progress bar to appear for a time-consuming process", but then NSThread and NSAutoreleasePool appeared and I was in tears.
 
 <a href='http://www.remus.dti.ne.jp/~yoshiki/cocoa/ed1/10/index.html'>Let's go with Cocoa! Like a Mac! 10th Edition</a>.
 
 Oh my. I read it in English and thought it said "need to retain" which I thought was a normal verb and thought it was "need to retain" but there's a message to retain. retain is like Py_IncRef. I memorized it.
 
 <hr>
 
 Now that we have learned that we need to RETAIN, let's take another look at the source. First, in the handler for the button press event, the received value is passed to another thread, but it is not retained. If this argument is autoreleased, it will be released after being passed to another thread.
 
 *1253089521*I'm getting sick of this.
 Let's do something else for a break.
 
 By the time you come back to do something else for a break, you've forgotten all about it.
 
 *1253116161*Autumn
 I walked from the next station to get some exercise, but it's chilly in a T-shirt. It must be autumn already.
 
 And as soon as I got home, I was too hot with a body that had been burned by exercise. Ugh.
 </body>

[Hatena Diary 2009-09-16 https://nishiohirokazu.hatenadiary.org/archive/2009/09/16]