Hatena2008-06-02
code:hatena
 <body>
 *1212352059*Mathematical terms are made into special moves.
 Today's 86 Chat Summary
 >>
 ujihisa23 said: the mathematical terms are non-intuitive and difficult.
 ujihisa23 said: that's rather good from a chuunibi point of view
 from_kyushu said: Chuunibyou www.
 ujihisa23 says: "If we indefinitely integrate this nonlinear function by Lagrangian relaxation, the nominal measure is lower approximation and the proof is finished."
 ujihisa23 said: and that's too cool!
 asuinim/L4RK/nommy said: cool.
 asuinim/L4RK/nommy said: all middle school students should be enlightened.
 
 
 Yasukazu Nishio says: Is it OK to think that a mathematical term with a difficult name is a special technique?
 Haiku says: That's what I meant. (KILLER).
 Yasukazu Nishio says: "Dynamic Programming ！！！！" and the furigana says "Dynamic Programming".
 Yasukazu Nishio said: wow, cool!
 ujihisa23 said: oh oh oh!
 ujihisa23 said: togashi-like WW
 
 
 ujihisa23 said: mother function! (Generating Function)
 Haiku says: Eat...! Diffuse code multiple connection pulses! (CDMA)
 Masafumi Otsune says: "Overlap the Taniyama-Shimura conjecture on this number theory! Professor Wiles shines!
 Masafumi Otsune says: "Oh, that card, the traveling salesman problem! Too NP-complete!"
 hakui says: "No way, he's trying to prove NP!=P!"
 hakui says: "You are now trapped in my 2 legal space.... You now have only 0 or 1."
 Statement by Yasukazu Nishio: Diagonalization Argument! (Diagonalization Argument!!!) Zubaba!
 Yasukazu Nishio said: "Nonsense, an infinitely wide two-dimensional plane can be projected onto the unit sphere! That is called the Riemann sphere, young man.
 [2008/06/01 23:38:51] Yasukazu Nishio said: I kind of wanted to bring out Yoda.
 
 
 Yasukazu Nishio says: "Hey, what's with the universal constant? Why, it's a completely different system!"
 hakui said: awww, there are still people doing it!
 Yasukazu Nishio says: "That's the Feigenbaum constant, young man."
 Yasukazu Nishio said: Oh man, I really want to read this manga!
 ujihisa23 said: too chuunibi wow!
 <<
 
 Only one person has not noticed the end of the festival, which is my quality.
 
 *1212416633*Sleepy
 It's hard because I haven't slept much because of the Selenium tinkering and the math discussion that suddenly got going in the 86 chat room yesterday. I'm going to sleep now.
 </body>
 <comments>
 <comment>
 <username>asami81</username>
 <body>Okay in Japanese! <BR><BR>.......but you are very cool! <BR><BR>I wish I knew the mathematical terms, I could have batted around like I did with Kosaku Shima</BODY>.
 <timestamp>1212371148</timestamp>
 </comment>
 <comment>
 <username>shiro</username>
 <BODY>I really want to read something like that. That kind of manga. Or even a novel. </body>
 <timestamp>1212431933</timestamp>
 </comment>
 <comment>
 <username>takano32</username>
 <body>"Expand the complex plane (complex field)..." "Is this complex analysis (complex analysis)...? <body>"Bataan Euler (Euler's formula), it's pi." <br>I don't know how the story goes and what the punchline is, but I want to read it: ！！！！ And later on, "Luke, use the power of ________!" is ironclad. </body>
 <timestamp>1212502486</timestamp>
 </comment>
 <comment>
 <username>takano32</username>
 <body>Complex fields are commonly known as CP fields! (Enough already</body>)
 <timestamp>1212502971</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-06-02 https://nishiohirokazu.hatenadiary.org/archive/2008/06/02]