Hatena2010-11-10
code:hatena
 <body>
 *1289394851*A foolish consistency is the hobgoblin of little minds
 >>
 A foolish consistency is the hobgoblin of little minds, adored by little statesmen and philosophers and divines. With consistency a great soul has simply nothing to do. He may as well concern himself with his shadow on the wall. Speak what you think now in hard words, and to-morrow speak what to-morrow thinks in hard words again, though it contradict every thing you said to-day. &#8212; 'Ah, so you shall be sure to be misunderstood.' &#8212; Is it so bad, then, to be misunderstood? Pythagoras was misunderstood, and Socrates, and Jesus, and Luther, and Copernicus, and Galileo, and Newton, and every pure and wise spirit that ever took flesh. To be great is to be misunderstood. 
 <<
 http://www.emersoncentral.com/selfreliance.htm
 
 The sentence is often quoted in the context that too much emphasis on consistency is not good, but in many cases that of the first sentence is also just the first half of the sentence that is cut off. What was the point of this story in the first place? English is difficult.
 
 >>
 A foolish consistency is the hobgoblin of little minds, adored by little statesmen and philosophers and divines.
 <<
 
 Can we assume that this adored takes on A foolish consistency? That is, "A foolish consistency is the hobgoblin of little minds, espoused only by statemen, philosophers, and devines." (translating the latter half of the word little as "only") is that correct?
 </body>
 <comments>
 <comment>
 <username>Zo</username>.
 <body>Hey, long time no see. <BR><BR>Is it safe to assume that this adored takes on A foolish consistency? <BR><BR>Yes, that's right, "[which is] adored..." I think it is easier to understand if you read it with the complement "[which is] adored...". By the way, as you may know, the postfixation is actually more dominant in English grammatical rules, so I thought it would be easier to make sense of it if you keep that in mind. <br><br> (translate "little" in the second half as "only")<br><br>This "little" doesn't mean that, it's more like "little boy" or "(politician) you" or something like that. To quote from the Oxford Advanced Learner's Dictionary, "used after an adjective to show affection or dislike, especially in a PATRONIZING way (= one that suggests that you think you are better than sb)" and examples include "What a nasty LITTLE man!", "She's a good LITTLE worker", "He'd become quite the LITTLE gentleman". </body>
 <timestamp>1289405345</timestamp>
 </comment>
 </comments>

[Hatena Diary 2010-11-10 https://nishiohirokazu.hatenadiary.org/archive/2010/11/10]