Hatena2010-09-22
code:hatena
 <body>
 *1285130521*1377136101094667656108956765175025610
 [key] "The Book of Arithmetic."
 
 <hr>
 <a href='http://ip-edu.org/angou1'>Special Proficiency Test, 1st Cryptography Test - Intellectual Property Education Association</a>
 
 I looked at the clue B and thought it must be the answer, so I wrote about 5 lines in Python and came to the same conclusion as Mitsunari's answer. I saw the clue B and thought it must be the one, so I wrote about 5 lines in Python and came to the same conclusion as Mitsunari's answer. I don't know the mapping rule between the answer and the special A question.
 
 *1285135217*Leverage memo: design and evolution of C++
 I haven't had time to read all of it and make leveraged notes yet, but I'll just note the parts I'm likely to use in the near future.
 
 P.283 C++, like C and Fortran, has entered difficult territory with no complete solution by choosing implicit promotion.
 
 P.284 The desire for flexibility and freedom of expression clashes with the desire for safety, predictability, and simplicity.
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=4797328541" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 *1285155312*Story about receiving permission to reprint an interview on okyuu.com
 <a href='http://d.hatena.ne.jp/Yoshiori/20100922/1285138899'>The article I interviewed on okyuu.com has disappeared, so I'm reprinting it with permission! - Yoshiori's Blog</a>.
 >>
 yoshiori: I was wondering what's going on since people don't write about it, but then I wrote about it.
 <<
 Hi. I've been a bit slammed and haven't been able to get any work done!
 
 We asked Mr. Hori of Kakaku.com if we could reprint the article, and he replied that there was "no problem at all" after properly checking with the company. However, there is a condition that the logo of okyuu.com must not be used.
 
 I have wget -r so I probably have files for everyone, but I've been slammed and only checked mine & was going to remove the logo and upload it, but haven't done so yet.
 </body>

[Hatena Diary 2010-09-22 https://nishiohirokazu.hatenadiary.org/archive/2010/09/22]