Hatena2009-10-07
code:hatena
 <body>
 *1254887712* New sun visor came in.
 The old one grips the head with a plastic band like a catsuit, but I stepped between the eyebrows and broke it, so it keeps slipping off. The new one has a smaller brim and is attached to the head with cloth and Velcro. If this is the case, I should have bought it earlier.
 
 
 Oh, and the smaller size allows me to wear muffled headphones over the sun visor.
 
 *1254895659*A discussion of why my task management doesn't work.
 Reprinted from a previous Twit
 
 Consideration of why my task management doesn't work: In addition to the MUST TO DOs, I have a lot of WANT TO DOs in my TODO LIST that I come up with that I don't have to do. LIST is overflowing.
 
 MUST TO DO tasks often have deadlines. If you imagine how much time it will take and look at your current to-do list, and if it doesn't look like you can fit it in, you can decline by saying "I can't do it because I'm working on something right now. Also, tasks are not left over because they disappear before the deadline, or because the deadline has passed and there is nothing left to do but to give up on them. So tasks don't accumulate beyond a certain level. On the other hand, I have 700 lines of tasks recorded in "howm". If I accumulate that many MUST TO DOs, I will die.
 
 >>
 @kazmaro My conclusion today is "WANT TO DO should not be written where you can usually see it. Just looking at a long list of things will discourage you from doing them.
 <<
 
 Maybe it's better to keep the TODOs that are visible empty all the time or something... I felt better when I boldly threw away the old tasks that had accumulated in RTM.
 
 >>
 @ssig33 RT WANT TO DO and I think it's good to forget everything you can't do on the spot, if you can remember it later, that's fine, if you can't remember it, you didn't have a connection.
 <<
 
 No, but some of them are "new ideas" and may be useful later... haha, this task list that I keep saying it may be useful someday, is the same as the large amount of stuff in this room that I keep saying I may use someday? As for the stuff in the room, I'm beginning to think it's the same as if I can't get it out of there quickly when I need it.
 
 <hr>
 
 You must ultimately create your own habits. Other people's habits may be helpful, but copying them does not always work the same way. This is because the way we feel and do things is different for each of us.
 
 *1254898515* Sunshine Ranch Diary
 Harvested dandelions.
 
 It is troublesome to acquire the remaining 4090EXP by carrot digging even if it is automated (rather, it is very troublesome to automate it safely and reliably because the behavior changes due to uncertain network latency), so I gave up and planted various plants at random.
 
 It's a game that quickly becomes saturated with things to do and "the rest is just waiting".
 
 **1254899159* Obsessions and the Scale of Communication Objects
 以前のTwitを加筆転載
 
 <hr>
 
 >>
 @muranoizumi It's beginners who don't miss @. Intermediate users are those who sometimes miss them. Advanced users are the ones who lightly go through it. <a href="http://twitter.com/muranoizumi/status/2866194650">https://twitter.com/muranoizumi/status/2866194650</a>
 <<
 
 Advanced or not, the obsession with "I have to respond to @" doesn't allow for much more communication, so it's inevitable.
 - 1: Increase too much, become too reactive, get tired and stop.
 - 2: Become like watching TV: "just receive, don't react" attitude.
 - 3: Create small clusters of relatives only
 It's going to be one of the following
 </body>
 <comments>
 <comment>
 <username>flag-boy</username>
 <body>Wouldn't it be better to manage the WANT TO DO and MUST TO DO in two ways instead of together? </body>
 <timestamp>1254906648</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-10-07 https://nishiohirokazu.hatenadiary.org/archive/2009/10/07]