Hatena2007-11-08
code:hatena
 <body>
 *1194491813* down
 Oooh. I was feeling really good yesterday and thought I was over my cold.
 
 Take the day off or come in, that is the question. I mean, I have to go out for a meal anyway. I took both ginger tea and kuzu-netsu to the office.
 
 *1194495700*jknaoya in.
 http://blogs.dion.ne.jp/konohamoero/archives/6359773.html
 >>
 I bet id:jknaoya is the person below.
 Hatena Diary of naoya
 <<
 
 ...! I see! I didn't know that! I hadn't thought of that idea! I'm sure you did!
 I'm curious to find out what other blogs naoya has created!
 
 - Hatena Diary of id:naoya naoya
 - id:jnaoya jnaoyaのはてな日記
 - id:snaoya snaoyaの日記
 - id:tnaoya tnaoyaの日記
 - id:banaoya banaoyaの日記
 - id:dknaoya Blog of a high school boy, Purogurumanao☆.
 - id:hanaoya is a blog.
 - id:jcnaoya Blog of a middle school girl, Naiya Purogurumaa
 - id:jdnaoya Blog of a female college student, Purogurumanao☆.
 - id:jknaoya Blog of a high school girl, Purogurumanao☆.
 - id:jsnaoya Blog of a female elementary school student, Puroguruma-nao Yazawa
 - id:olnaoya olnaoyaの日記
 - id:jinnaoya jinnaoyaの日記
 
 It's amazing, isn't it? I can't believe that you update so much on your own when some people fall behind on updating even one blog!
 I've never met naoya, but I'm sure she's the kind of woman you're looking for.
 http://www3.aa.tufs.ac.jp/~mmine/indspace/devcit3.html
 
 ---
 
 I'm sorry for everything.
 Because I was writing the script for this survey yesterday(?) My cold has worsened.
 
 *1194496016*Tension
 I want to pretend that the reason for the strange tension since yesterday is because of a cold.
 
 At least I'm hungry. Let's go get some food and medicine.
 
 *1194532509*woo
 A lot of sweat after drinking ginger tea
 one's tonsils are gurgling
 
 *1194534564* I need a haircut.
 Whether or not I was right in hesitating to get a haircut yesterday because I had a cold.
 
 *1194534611*Mist sauna
 A solution to create a handy mist sauna by applying a hot shower to the wall.
 
 I thought it was a pain that the temperature control is a digital control panel outside the bathroom, but you can just turn on the water faucet to get it warm...
 
 *1194535059*生駒市
 >>
 ujihisa Oh, I think of Ikoma as just another city in Nara!
 <<
 
 I was going to say "No, Ikoma is in Osaka," but when I searched for it, I found that it really is in Nara.
 
 I checked and it seems that NAIST is located in Ikoma. That means I should have lived there for 3 years....
 
 *1194537233*初暖房
 I thought I turned on the air conditioning for the first time, but it turned out to be air conditioning.
 
 *1194538784* Metabolome Symposium
 Metabolome Symposium
 metabolic syndrome
 metabolic syndrome
 
 Nope, you've matched 8 out of 12 letters.
 </body>

[Hatena Diary 2007-11-08 https://nishiohirokazu.hatenadiary.org/archive/2007/11/08]