Hatena2008-04-28
code:hatena
 <body>
 *1209342312*mixi
 'You haven't updated your diary in a long time, are you still alive?' So I switched my external blog that was registered on mixi from my previous blog to this one.
 
 *1209342541*[TopCoder] points deducted for rules violation
 I received an email saying that I would lose 20% of my points because I violated the "no more than 30% unused codes rule."
 
 >>
 Unused Code Rule Violated
 
 The code you submitted during SRM 399 for the 250 point problem violates the "excessive extra code" rule.  Submissions may contain no more than 30% unused code.  For more information, please see the following URL:  http://www.topcoder.com/tc?module=Static&d1=help&d2=ratedEvent#extracoderule
 
  
 
 Your submissions have been re-scored as 20% of the problem value.
 <<
 
 The rating dropped to 899 and I became a gray user.
 
 Code in question
 http://www.topcoder.com/stat?c=problem_solution&rm=269920&rd=12171&pm=8761&cr=22724714
 It seems that the code below, which is not used, is not good. The Japanese in the comments is garbled, which may have also hurt the impression.
 >||
 // [㜙7][℁5][ቂ0][ቒ2][ቇ3][ቈ8][ሹ8][㠦3][ሷ3][ቃ4][㚂0][ሷ7]
 template<class T, size_t N>size_t elementof(T (&)[N]){return N;};
 template<class T>size_t elementof(const T& t){return t.size();} 
  
 // [ቑ0][ቈ3][ቐ3][ሶ4][⤰5][⍅0][ሹ8][ቆ1][ቔ0][ቃ4][┴5][ሸ7][ሹ0][ስ6][ቂ7][ሶ3][ሹ3][ስ8][ሶ3][ቃ4][㚂0][ሷ7]
 template<typename _K, typename _V>
 bool has_key(map<_K, _V> m, _K k){
   return (m.find(k) != m.end());
 };
  
 typedef string S;
 typedef long long LL;
 typedef long double LD;
 typedef vector<LL> VL;
 typedef vector<string> VS;
 typedef vector<LL> VL;
 typedef vector<LD> VD;
 ||<
 
 I was going to paste some things into the template to make it more convenient to write code, but if it's against the rules at this level, it would be a hassle to delete it when I post it if I paste too much.
 
 *1209350272* Shit.
 I was going to send you the publishing contract for the Jython book, but I forgot to bring a piece of paper with the mailing address, so I'll have to go home to send it to you...
 
 *1209379774*Great Hacker
 I noticed that I can listen to Paul Graham's "Great Hacker" so I am listening to it. <a href="http://itc.conversationsnetwork.org/shows/detail188.html">IT Conversations | IT Conversations Legacy Programs | Paul Graham</a>
 The audience laughed out loud at the comparison of Python and Java.
 
 
 Japanese text here: <a href="http://practical-scheme.net/trans/gh-j.html">Great Hackers</a>
 
 Python and Java aside.
 
 >>
 The difficulty is not in solving the problems, but in deciding which ones to solve. It is difficult to measure imagination.
 <<
 
 I guess so.
 On the other hand, "something great" is not 100 percent made up of "interesting problems. Innovation is made up of 1% inspiration and 99% sweat. No matter how "trivial" it may seem, you have to sweat.
 
 I'm not listening to the English language to escape, I'm trying to transfer SQLite data to MySQL....
 
 *1209383955*[mac]Perian was added.
 I can now open flv.
 
 *1209396025*port
 Today, I tried to run mysql-server and mysql-client at the same time on FreeBSD ports, but a mysterious phenomenon occurred and I was told that "the c compiler does not create an executable file". Well, I tried again and it went in...now that I've learned to screen, I guess I shouldn't get carried away and run everything at the same time.
 
 
 I'm trying to get ethereal in macports right now, but it's taking a long time.
 
 *1209396256*[TopCoder] For those who don't have anything they want to make.
 mootoh.log - TopCoder seems to be all the rage.
 http://blog.deadbeaf.org/2008/04/25/my-topcoder-history/
 
 >>
 We hear that there are people who want to program but can't think of anything to create. In that case, why don't you log in to TopCoder, enter the Practice Room, and try solving 250 problems? I think it's a good way to give yourself a push because it's rather easy to work on.
 <<
 
 
 You should create a TopCoder account, start a Java program called Arena, enter the Practice Room labeled DIV2 (second army), and solve 250 problems. If you are not satisfied, you can try to solve 500 or 1000 problems.
 </body>
 <comments>
 <comment>
 <username>yukoba</username>
 <body>>The most evil pythonista in Japan<br><br>Is this your motto, as stated in TopCoder? （</body> <br><br>The most evil pythonista in Japan<br><br
 <timestamp>1209365059</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Oh, so that's what QUOTE means. </body>
 <timestamp>1209366645</timestamp>
 </comment>
 <comment>
 <username>jj1bdx</username>
 <body>Port is a complex dependency, so if you try to do it in parallel, you will get into trouble. If you have mysql51-server, you don't need mysql51-client, so read the Makefile. </body>
 <timestamp>1209417265</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-04-28 https://nishiohirokazu.hatenadiary.org/archive/2008/04/28]