Hatena2012-05-09
code:hatena
 <body>
 *1336538784* What we want to create: a system that brings the experts' idea of a "good state" closer to realization.
 Masui's <a href='http://www.scribd.com/doc/91645150/%E4%BD%9C%E3%82%8A%E3%81%9F%E3%81%84%E3%82%82%E3%81%AE%E3%83%AA%E3%82%B9%E3%83%88% E3%82%92%E4%BD%9C%E3%82%8D%E3%81%86'>Let's make a list of things we want to make</a>, and I thought, "Surely, just putting things on a 'to do someday' list will not develop, so why not make public those that are safe to make public? I did it. This time, I discarded it early on as "not something I would do" and didn't even put it on the list, but I decided it should be made public, so I'm going to make it public.
 
 ** Background
 
 Dr. Takagi's diary today (<a href='http://takagi-hiromitsu.jp/diary/20120508.html'>Diary of Hiromitsu Takagi at Home - The evils of the "personal information" definition, finally to local governments</a>)
 >>
 We have been writing about the inadequacies in the definition of "personal information" in the current Personal Information Protection Law. I have been writing about the danger that the current definition of "personal information" in the Personal Information Protection Law is inadequate, and that the notion that "information is not personal information as long as it does not identify an individual (by name, address, etc.)" (and therefore, "anything may be done with it") may be allowed to prevail.
 
 (omitted)
 
 This is as far as I can go. I do not think it is my role to go any further. I would like to ask those who think it necessary to take action to do so. Since last summer, I have been devoting almost all of my personal time to the new issues that have appeared one after another, but I feel that I am reaching my limit. I have been running with the thought, "If I don't write about this," or "I might as well just let it slide through. I wonder how long this will continue. I believe that the various problems of the past should be solved by social mechanisms, not by my own personal actions. I hope that a system similar to those seen in Europe and the U.S. will be established in Japan soon.
 <<
 
 My own tweet this morning
 
 >>
 Because Dr. Takagi was so powerful, I felt that I should just leave it to him. Was it like a project that did not burst into flames, so to speak, thanks to one competent engineer desperately extinguishing the fire? He said that it was necessary to create a system that did not impose the burden on a single person.
 <<
 
 ** Reflection
 
 In the past, I once thought about another matter and thought, "Dr. Takagi should do this," "Dr. Takagi is the right person for this," or "Dr. Takagi should do this. I was reminded of this when I saw Takagi Sensei's diary this time.
 
 >>
 HiromitsuTakagi: 
 It is time to establish a consensus that services that require users to register IDs and passwords before confirming the arrival of their e-mail addresses (without measures to prevent erroneous e-mail address registration) are in violation of the security control measures under the Personal Information Protection Law (when sending personal information) and Article 5 of the current Unauthorized Computer Access Prohibition Law (when sending passwords). It is time to establish a consensus.
 
 
 nishio: @HiromitsuTakagi If we make a checklist of things to watch out for, publish it, and rate some existing services on the checklist, wouldn't people try to follow the checklist for fear of getting a bad rating?
 <<
 https://twitter.com/#!/nishio/status/188918927970144256
 
 ** Need for a rating system
 
 Why is it that society does not move in the direction that experts and engineers consider "good"? It is because the experts' criteria for judging what is a "good situation" are not shared by those who are not experts in the field and are in charge of steering things.
 
 Now, for example, various companies have clearly stated and published their privacy policies. This is a good state of affairs. But if there was no <a href='http://privacymark.jp/'>PrivacyMark system</a>, would those companies have chosen to "make their privacy policies public"? Wouldn't the existence of the PrivacyMark rating system have brought them closer to the "good state" of "having a clearly stated privacy policy"?
 
 Asking a non-specialist to understand "why it is bad" is a high educational cost due to lack of prerequisite knowledge. Is an understanding of "why" essential to bringing a society into a "good state"? Wouldn't it be better to have an objectively verifiable list of "what is evil"?
 
 If we make a list of "what is evil" and make it public, and then rate the targets based on that list, wouldn't society be better off?
 
 ** My mistake.
 
 After thinking about it, I thought to myself, "This should be done by Dr. Takagi, not me. The reason is simple: the quickest way to ensure the accuracy of the contents of the list is to have it prepared by a well-known and trusted expert in the field.
 
 And implicitly there was another reason. The parent company of the company I work for sells software to corporations. I foresaw that the act of rating a web service created by another company without permission would lead to complaints to the parent company, threats of contract termination, and other troublesome phenomena. Therefore, I decided that I could not do it myself. In retrospect, this decision was naive. If I had really wanted to do it, I would have had many options, such as quitting the company. So, when it came down to it, I would have to say that I was not that motivated. That's not cool.
 
 By running away from realizing his own ideas in this way, he has tried to push all the costs of creating, publishing, and dealing with various forms of pressure on that "list" to Dr. Takagi.
 
 Yesterday and today, I saw Mayor Keisuke Hiwatari putting pressure on Dr. Takaki to "lobby his superiors" and "lobby Diet members," and I realized that working for an independent administrative agency is not immune to that kind of pressure. The idea that "Dr. Takagi should do it" was clearly a mistake.
 
 Then what should we do?
 
 ** Uncertainty of decision makers
 
 One way to do this is to eliminate the judgmental subject. How about persuading people that "the consensus of many experts is that it is evil."
 
 To begin with, even if, for example, Dr. Takagi asserts that "this is good and this is bad," a person outside of the field cannot determine which opinion is unique to that person and which is the consensus opinion among many experts.
 
 Experts have emphasized the reasons why "this is bad 'for the reason that X'" to assure that their opinions are correct. However, if the target of persuasion does not want to understand the reasons, then the option must be given up. Nothing progresses if the target of persuasion is unwilling to understand the reasons.
 
 How can we persuade them that "the consensus of many experts is that it is bad?" One way that already exists would be through the recommendations of trade associations, academic societies, and so on. On the other hand, I am personally interested in the possibility of creating such a "list of evils" through collective knowledge.
 
 ** Challenges of collective knowledge
 
 Once the social credibility of the "rating list" created is somewhat enhanced, the number of participants will increase and positive feedback will begin to occur, even if they are not known to the public, because participating in the list as a judgmental entity will showcase one's expertise. However, the problem is how to reach this point.
 
 First, there is the problem of getting people to post lists. A sense of justice would probably be the primary motivation, since anonymity does not lead to self-expression. Will a sufficient number of professionals with a sense of justice be attracted?
 
 Another issue is whether quality can be assured. Just because one is righteous does not mean that one's arguments are appropriate. Goodness is subjective. So what about weighting by number of people, such as "78 out of 89 engineers think this is evil"? That won't work either. It is easy to get a head count. Then the contributors/voters need to be weighted according to the correctness of the judgment they made. Whether this "his judgment is correct" is itself correct is also unclear.
 
 Just as Google has mechanically rated web pages with its PageRank algorithm, I wonder if there is an algorithm that can mechanically rate how reliable the judgments of individual contributors are, and how much support there is for individual "this is evil" postings. How reliable are the judgments of individual contributors, and how supportive are the individual "this is bad" posts? Could we use this to create a system that makes judgments that have practical value without making any particular individual the subject of the judgment?
 
 ** Summary
 
 I haven't come up with a concrete algorithm or anything because I was totally unmotivated and neglected it until yesterday. I apologize for the lack of concrete ideas. I am sorry for the lack of concrete ideas, and this text is almost worthless because there is no value in an idea that will not be realized. Still, I decided that it would be better for the society if I made it public than if I left it without disclosing it to the public.
 
 *1336562160* What we want to make: an application that clips web pages and magazines and allows you to view and select from a list of images.
 Masui's <a href='http://www.scribd.com/doc/91645150/%E4%BD%9C%E3%82%8A%E3%81%9F%E3%81%84%E3%82%82%E3%81%AE%E3%83%AA%E3%82%B9%E3%83%88% E3%82%92%E4%BD%9C%E3%82%8D%E3%81%86'>Let's make a list of things we want to make</a>, and I thought, "Surely, just putting things on a 'to do someday' list will not develop, so why not make public those that are safe to make public? I did it. This time, it is not mine, but something my wife wants to make. My wife thinks she can make it if she picks up an appropriate CMS and do a lot of work with PHP, but I think there is a better way to do it.
 
 ** Request: I want my own cookpad.
 
 - "I want to scrap recipes from magazines and recipes I find on Cookpad in the same row."
 - "Maybe I should just print out a copy of Cookpad, but that's a pain in the ass."
 - "It would be even better if you could search by tag or something."
 - "I don't want to take my computer into the kitchen with me when I look up a recipe on it, and it's a pain in the ass to look for it on my iPad. Now I jot them down on paper."
 - "It's disappointing when you go back to look at it later and it's no longer on the Web."
 
 ** Suggestion: Maybe you can use Evernote for that.
 
 - Why don't you just look at the recipe on your PC, put it in Evernote with a bookmarklet, and then look at it on your iPad? You could take a photo of the magazine article and put it in Evernote.
 - Experiments, results:.
 -- "The step-by-step images make it extremely difficult to see the procedure, the only image should be the finished drawing."
 -- "I don't even want menus or social networking messages."
 -- I think this is an important need that has not been expressed in words, and that's probably why we decided to implement it ourselves in the CMS.
 
 ** Redesign based on this
 
 - User sees the recipe on PC and launches the bookmarklet
 - The script launched performs DOM manipulation, cuts out only the necessary parts, and then puts them into Evernote.
 - In the kitchen, watch on iPad
 - It seems that Evernote's API can be used to retrieve only images, so I'm going to use it to create an iPad app that lists images.
 - The advantage of using Evernote instead of a homegrown implementation is that you no longer need to prepare your own server.
 
 ** Summary
 
 It's like working on the customer's requirements into specifications, which is rather interesting since I don't usually do that as part of my work. It may be possible to verbalize what other people want to make.
 
 ** Postscript
 
 There was a serious miscommunication.
 
 -No, it's not an advantage that I don't have to prepare a server. It's a system for me, not for others, so why don't I just run Apache locally and use PHP for CMS?
 - "It's not that important to look at it on the iPad in the kitchen. Because I don't want to touch it with dirty hands, and that's fine because I'm going shopping and transcribing it to my notes in the first place."
 
 Well, then a CMS with PHP on a local server is not a bad choice.
 
 - "Uploading to another server takes time, it's better to run locally."
 - Cookpad isn't the only site that uses it, and if you're scraping with JS, you'll need to support each individual site.
 
 Bottom line, we designed poorly before we got to the customer's needs, but to no avail (><).
 
 *1336567904* How to stay productive with my wife
 Summary of responses to Tweet
 
 nishio: I gave my wife WebDB Press, went to work, came back and read "Push Media Reduces Engineer Productivity" and said "My wife is also a push media"
 nishio: question for married engineers: how can I stay productive with my wife?
 
 ** Adultery.
 
 Yappo: to commit adultery
 nishio: "If you have an affair, you'll just get more media!" my wife
 Yappo: Mistress is a pull type media. Please tell them that ><
 
 
 I see...
 
 ** For example, avoid wives
 
 tokuhirom: unsubscribe
 bulkneets: you can ignore it
 hayamiz: e.g., avoid wife
 
 
 （＞＜）
 
 ** Physical firewall
 pandeiro245: I work in the closet.
 
 
 That sounds pretty good! It looks like I can concentrate. My wife seems to be envious of the large closet.
 
 ** Sleeping
 
 U40: Sleep
 nagaseyasuhito: Honestly, it's difficult. I have to wait until after my wife goes to bed.
 
 ** Automate household chores
 ayakomuro: I think you should buy a dishwasher and a Roomba.
 
 
 I bought a Roomba. I didn't buy a dishwasher because I don't have room for one.
 
 ** Wrong conception.
 kyoheif: The idea is funny ... Don't do anything productive when you are with your partner.
 
 
 [Excellent insight.]
 
 
 wraith13: We need to produce!　More birthrate is not good! ＞＜ RT @kyoheif: @nishio The idea is wrong. Don't do anything productive when you are with your partner.
 piyonori1971: We don't produce programs, we produce people who program. It will take some time, but in the long run, it is important to keep the productivity of the society as a whole low.
 
 
 My wife said, "What an old man's gag!
 
 ** Time sharing
 shuyo: Getting married means giving and sharing the most precious thing of all: time.
 
 
 I see...I mean,
 
 ** Make your wife a productive force
 
 W_Sakurai: Or have my wife create a hobby that she won't be lonely alone.
 shin_semiya: Bring in additional wives as additional staff to make up for delays caused by lost productivity.
 ayakomuro: I think the only thing left to do is to engineer your wife! Backslash.
 ako_n: Programming with my wife
 Ohka: It seems best to marry an engineer, but I don't know.
 camloeba: couple entrepreneurship
 myaaaaa_chan: I work with my wife.
 
 
 Is this the best option....
 
 ** Summary
 
 So, ma'am, I know you probably read this blog in your spare time, so please proceed with the implementation of this matter w <a href='http://d.hatena.ne.jp/nishiohirokazu/20120509/1336562160'>What we want to make: An app that clips web pages and magazines and allows you to view and select from a list of images</a>.
 </body>
 <comments>
 <comment>
 <username>kosaki</username>
 <BODY>Mogelo backslash,</BODY><BR><BR>Is it like this? I don't know (while reading the comments section of Chinese Wife Diary)</body>.
 <timestamp>1336589747</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>But I refuse</body>.
 <timestamp>1336605457</timestamp>
 </comment>
 <comment>
 <username>anepan</username>
 <body>I would also like to see balancing childcare participation and productivity on the agenda! </body>
 <timestamp>1336643795</timestamp>
 </comment>
 </comments>

[Hatena Diary 2012-05-09 https://nishiohirokazu.hatenadiary.org/archive/2012/05/09]