Hatena2009-11-11
code:hatena
 <body>
 *1257922124*Application URL means.
 <img src="http://gyazo.com/8307e33b353dc4064ba63cff2c2b4b5b.png">
 
 It didn't look like it was required, so I went to http://のまま放置していたんだが and used iTunes to see if that was the reason.
 
 <img src="http://gyazo.com/143bf8ae55d8aff69aefdaddff7c5a7b.png">
 
 When I click on the link above this one, I get an error that says "URL is incorrect and cannot be opened". I haven't checked yet, but I've put in the proper URL for now, and it doesn't seem to require a redo of the Review, so I'm hoping that will be reflected soon.
 
 *1257939509*iTheremin 20091111
 I made a new video.
 <object width="425" height="344"><param name="movie" value="http://www.youtube.com/v/fy1mVAEagWo&hl=en&fs=1"></param><param name="allowFullScreen" value="true"></param><param name="allowscriptaccess" value="always"></param><embed src="http://www.youtube.com/v/fy1mVAEagWo&hl=en&fs=1" type="application/x-shockwave-flash" allowscriptaccess="always" allowfullscreen="true" width="425" height="344"></embed></object>
 
 *1257942375* Broken Japanese
 >>
 Shout out... Excuse me, hindrance, Antarctica jolly. Questions about the Japanese town? Domo arigatou culture like love nihon.Domo arigatou culture like Antarctica chances
 <<
 
 In terms of understandability
 
 Machine translation of Indonesian < < Roman alphabetical Japanese written by that Indonesian < English < Japanese
 
 I was in a foreign country. It seems that there are a certain amount of people from these countries who can speak a few words of Japanese but not English, and they sometimes talk to me on Skype, but it is frustrating to deal with people who speak a few words of Japanese. I don't know why. I'm aware that I'm also a one-word English speaker, so I don't get annoyed, I just think, "Oh, he's more broken than I am. They are speaking to me in Japanese, so there should be no problem, but I respond back in English.
 
 
 I wonder if "intercultural communication = English" in my mind.
 </body>

[Hatena Diary 2009-11-11 https://nishiohirokazu.hatenadiary.org/archive/2009/11/11]