Hatena2009-02-17
code:hatena
 <body>
 *1234862879*Household
 Mmmm. I feel cold... At least I have to get some beet tea before the store closes.
 
 
 It was expensive, so I decided to buy it on Rakuten.
 <img src="http://gyazo.com/b068dd39ba0647392d49d849956b10ca.png">
 Hmm. I see. So Rakuten has the user's name and address, and can get them to sign with one click. If you want to sign the petition, click here:.
 http://event.rakuten.co.jp/medicine/net_signature/index.html
 I heard that 490,000 signatures have already been collected. Signing a petition with one's name and address is a very difficult psychological hurdle to overcome, but the fact that it can be done in a very casual way with a single click is probably the most effective factor. Also, when collecting signatures in person, it is difficult to collect opinions only in urban areas, and in the case of this issue, people might say, "Why don't you just buy such a medicine at a pharmacy? It would be interesting to analyze the geographical distribution of signatures, but I doubt it will be made public.
 
 
 I was hungry, so I made a pot, so I washed the pot, so I washed the dishes piled up in the sink.
 
 
 The daikon radish and green onion that were to be used in the pot were already contaminated with mold. You can find out when they were bought by searching. The daikon was <a href='http://d.hatena.ne.jp/nishiohirokazu/20090108/1231416645'>January 8</a>, and the leeks...well, that's not recorded. The daikon and carrots that I packed in Tupperware because I couldn't eat them at that time are still in the refrigerator, but should I discard the entire Tupperware?
 
 
 Steamed Chinese cabbage rather than a hot pot.
 
 <hr>
 - □ Tomorrow is resource garbage day, so I'm going to throw away all the books I don't need and feel lighter!
 
 I'm having trouble getting the task "I'm having trouble getting this task started at all. Use a timer.
 
 
 But I can't find the timer. Found salt with the mouth left open. Dangerous. Timer found. In 15 minutes from now, I'll have a workspace the size of an open newspaper.
 
 
 Put the pot in the kitchen. Unplug the power cable of the pot from the outlet and put it in place (cable compartment). Put the cell phone charger in its place (cable compartment). The digital camera charger was also put in the cable compartment. 6 minutes later, it was done.
 
 
 List the things that come to mind before moving on to the next action.
 - Clear away dishes and other items that are blocking the aisle.
 - Removing rust from a magnet that has become partially rusted due to exposure to water.
 - Reusing torn jeans to make a cloth bag to hold magnets
 - Duke out the books to be discarded by tomorrow morning and put them out front.
 
 
 Arrange in order of priority.
 - Duke out the books to be discarded by tomorrow morning and put them out front.
 - Clear away dishes and other items that are blocking the aisle.
 
 
 Aisle building should be limited to areas that are in the way of getting books in and out. Estimate. Hmmm, 15 minutes should be enough. Start.
 
 
 Clothes are in the washer, cables are in the cable bin. Dishes are in the sink. The top drawer of the desk is now stuffed with books and heavy, but I now think it should be used for small miscellaneous items. The mail has been unearthed and I put it in the space for important documents for now. Hey, I found some documents that look essential for tax returns, like payment records, unopened from the floor!
 
 
 Tidied up. Magazines and newspapers on the floor can be discarded even if they look interesting. Books are difficult indeed. I can't find them in my "<a href="http://www.amazon.co.jp/gp/product/407256107X?ie=UTF8&tag=ikunoz-22&linkCode=as2&camp=247&creative=7399&creativeASIN= 407256107X">Our 3 Sisters 4</a>" or something like that when I need a little healing now and then, or I have a life crisis.
 And then I googled <a href='http://ameblo.jp/3shimai/'>My 3 Sisters - Today in Manga</a> and found that Qi has hair! Oh my! I guess I can throw it away then.
 
 
 I didn't have many books to throw away. I had a few books that were still packed in boxes from a previous move, and I didn't want to go through the trouble of opening the boxes and throwing them away. What? Throw away the whole box?
 
 
 At any rate, it's already 5:00 p.m., so let's just cobble together the books we're supposed to throw away and get them out.
 
 
 I couldn't find the string and had to look for it, but I ended up safely throwing away 5 bundles of old books. I had one bag of burnable trash. In the process of looking for the string, I found a few books under the bed that looked like they could be thrown away, but that's okay, I threw away 5 bundles, so I made progress on 5 bundles. I need to vacuum under the bed to get rid of the dust. I'll do that next time.
 <hr>
 
 - Buy beet tea.
 -- I bought it by mail order because it was about 800 yen for 36 grams at a nearby drugstore. I wonder how long pollen lasts. I ended up buying 8 of them, which gets me free shipping. http://item.rakuten.co.jp/soukai/4960867708876/
 - □ Tomorrow is resource garbage day, so I'm going to throw away all the books I don't need and feel lighter!
 
 - Make a pot
 - Washing pots and pans for
 - Washing dishes piled in the sink for
 
 - □ You need to drop off your rent or credit card at the post office and have it in by the time your rent or credit card is debited.
 - Washing PET bottles
 - Write a reply to your e-mail
 - □ Clean up the room
 - Map
 - Headphones
 - □ Summarize how to create a GAE project
 - □ About Mercurial's bisect
 the others
 - 18 Resource Trash Day. Throw away as much unwanted newspapers, magazines, etc. as possible.
 - 19 Head Office
 - 20 pots / debit your Rakuten card
 - 28 Return of keys to current address
 - I'll get a haircut soon (maybe next time I'm in Akihabara).
 
 *1234879037* Out of the ordinary.
 I think it is a mistake to attribute it to the goodness of the head in the first place. There are two patterns in the world: "those who walk on the same rails as the majority" and "those who walk irrespective of the rails the majority walks on. Sometimes the person consciously chooses that pattern of behavior, and sometimes he or she chooses it unconsciously.
 
 
 Now I remember a concrete example. For example, if there is a pot of cheese fondue with some sashimi tuna, I would of course put the tuna in the fondue. Of course I know that tuna is not usually put in fondue, but that is irrelevant. I can't answer the question, "Why did you put tuna in the fondue?" I can't answer that question. Because it was there.
 
 
 So, I think "out of the ordinary" is a good way to describe this kind of behavior pattern in one word. It is "off the rails.
 </body>

[Hatena Diary 2009-02-17 https://nishiohirokazu.hatenadiary.org/archive/2009/02/17]