Hatena2008-03-16
code:hatena
 <body>
 *1205638227*Alpha Blogger
 I'm not sure it's a good idea for a major leaguer to "take the diary of a player on a grassroots baseball team and point out his inadequacies." If you can't tolerate that risk, you shouldn't publish the diary. Of course, it is not a good idea to write a malicious and misleading article about a specific individual, but in most cases, it is just a case of "I happened to see it and wrote my opinion because it happened to be different from my own.
 
 Of course, major leaguers are human beings, and they may misread the context and assumptions in a short diary entry and write something misguided. But then again, I am a human being, so I could do that at any time. It is not the fault of the individual major leaguer, just that computers made of human protein are a bit unreliable.
 
 That is why I don't agree with the assertion that "major leaguers should not criticize the play of grassroots baseball teams. It is troublesome to be told, "You are influential, so be careful what you say," and I think it is stifling to live in a world where we are forced to do so.
 
 I won't link to the original article because I feel that if I link to the original article, it might cause another flame war and a secondary disaster.
 
 -----
 I mean, if you read carefully, the entries by alpha bloggers and the one I didn't link to this time are not that offensive. It seems to me that the vocabulary used and the structure of putting negative things in the first half of the article are only unnecessarily increasing the number of "people who feel repulsed".
 
 -----
 Oh, and the foxes who throw stones at grassroots baseball players en masse with the authority of major leaguers, well, I'm not so sure. If you ask, "Is bullying a bad thing?" I'm sure they would answer, "No! but their usual behavior is nothing but bullying. I wonder if people like that will ever disappear structurally.
 
 *1205642355*MathArt
 http://d.hatena.ne.jp/inajob/20080312#1205332204
 
 An S person like me wants to see and tinker with randomly generated expressions.
 
 *1205645820*doukaku.org
 Hey, I rebooted yesterday and now it's down again.
 When the site was down frequently for a while, the default limit for the number of processes in apache was left unchanged, and when a strange crawler or something accessed the site at once, too many processes were added and memory became insufficient, causing thrashing and causing the site to freeze up.
 I lowered the upper limit on the number of processes and it stopped crashing, so I left it as is, but recently it has started crashing again. Is it because the number of accesses has increased, or is it because MediaWiki has been added to the site and is now consuming memory in various ways?
 
 Also, why is it that just because thrashing has occurred, it not only freezes for a while, but it will not come back to life permanently until rebooted.
 
 *1205653128*Study Calendar
 http://born1981.g.hatena.ne.jp/gamella/20080310
 
 The reason why new study group information compilation sites are being created all the time and not being integrated is because there is no incentive to integrate them. The reason why new sites are being created and not integrated is because there is no incentive to integrate them.
 
 Even if a wiki or some other method were to be used to create a summary site that "anyone can write on," the cost of learning how to write, the style of tagging, etc., and the "slight hesitation" would lead to the conclusion that it would be "easier (and easier) to create a new site.
 
 So, no matter how you organize it, it would be a good idea to first create a "Google Gadget that displays study groups matching keywords" or something similar so that it can be posted on the sidebar of your blog or something. This would create an incentive for people who want new people to come to the study group to register their own study group.
 
 *1205664885*jythonc should not be used
 I've been buzzing about jythonc since 2.1, but I just checked and they officially said I shouldn't use it.
 
 >>
  it is not recommended that new Jython projects make use of jythonc.
 <<
 
 http://jython.org/Project/jythonc.html
 
 *1205665543* Wow!
 Chapter 8 is over!
 Now all I have to do is finish chapter 3, which I cried out last time I was halfway through it, and I'm good to go!
 
 *1205672261*Suspension ads in cars
 
 The real scary Akihabara, No. 1 in Tokyo for extortion, No. 2 for violations of the Firearms Act
 
 This is! (laughs)
 
 *1205678890*Karaoke
 
 It was changed to uga. Amazing. Masayuki Yamamoto alone has one hundred and fifty songs. The total number of ani-songs is less than 10,000.
 </body>
 <comments>
 <comment>
 <username>gamella</username>
 <BODY>While writing in my calendar too, I thought it should be integrated. However, I feel that a Hatena Diary that can be peeled off to Google Calendar and iCal is worth it, though. <br><br>This would create an incentive for people who want new people to come to their study groups to register their own study groups. <br><br>Most study groups are full of people, so it might be difficult to do this. If it's a less popular study group, there might be a little incentive, </body>.
 <timestamp>1205653544</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-03-16 https://nishiohirokazu.hatenadiary.org/archive/2008/03/16]