Hatena2008-05-26
code:hatena
 <body>
 *1211749307* hot nevertheless
 It's so damp.
 
 *1211752283*About the 6th 1000 Speakers Conference
 This time, there was no post-conference "next notice", but that was intentional.
 
 Some of you may remember my stack overflow at the 4th conference. It's no fun to have a conference where the organizers are frustrated. I told id:amachang that I wanted to take a break from organizing the conference, and he said he wanted to take a break too, so I decided to take a break for a while after the 5th conference.
 
 I don't want this to be the end of it, but it seems that me and amachang can't keep up the pace of once a month. We need to figure out how to keep it going. And it is difficult to "change things up" because if we keep at least "giving notice of the next meeting at the end of the conference", we have to FIX the number of people and venue by then.
 
 At the after-party after the conference, we talked about the future management of the event, and it was suggested that "for now, COJI-san will be in charge of July. However, after thinking about it calmly, I think it would be difficult for "Mr. coji to take care of the video shooting, while Mr. coji collects the pizza money and Mr. coji is the host of the event. Any person has only two eyes and two hands each.
 
 There was also a suggestion to use a franchise system. If a manual on "what to consider when holding a conference" is created, more conferences may be held throughout Japan. So, for the time being, I have written down as many tasks as I could think of:
 - http://ja.doukaku.org/wiki/index.php/1000speakers:tasks
 However, I think that "the current way of doing 1,000 speaker conferences may be somewhat unreasonable, and we may have to change it," so I think that even if the current situation is made into a manual, franchising will not go well.
 
 The first thing that I think needs to be changed is to not cut off presenters in the middle of their presentations. If you are not used to giving presentations, it is difficult to finish them on time. Unlike many other lightning talks, I don't keep a timetable because I don't want the presenters to run out of time when they have the courage to give their first presentation. But that is the biggest factor that makes the timetable difficult to manage. The reason why we have to order pizza at a later time, or why we can't schedule breaks and sessions exactly, is because we don't have an exact time for the presentations. Perhaps we should declare that time is up after 10 minutes if it is 10 minutes.
 
 The same goes for the method of recruitment. I think it was the right decision to switch to "recruiting speakers first" this time. Some people say that the current format where recruitment is done on Lingr is confusing, but the format where we ask people to write directly on the Wiki is confusing as well. I wonder if we need to collect email addresses until we have people create an account (we have never sent out an email in the 5 times we have done this), or if we should stop the first-come, first-served basis itself. I have many ideas. One idea is to reduce the number of people attending itself more. This would reduce time and venue constraints and make things a lot easier.
 
 So there are many things to think about, such as. One thing is for sure: "You have to crouch to jump." If you run once a month, you cannot crouch to jump. Now is the time to crouch.
 
 *1211785438* at Shinbashi
 
 JR is stopped. Oh my god. I wanted to go to Kamata, but there seems to have been a train accident at Kamata.
 
 Take the Toei Asakusa Line to Kamata.
 </body>
 <comments>
 <comment>
 <username>cactusman</username>
 <body>I will be in Tokyo from June, so I will help. </body>
 <timestamp>1211767631</timestamp>
 </comment>
 <comment>
 <username>sasada</username>.
 <body>I've been to Ruby conferences overseas, and I've noticed that they are very relaxed, with a lot of time to spare. I'd like to try something like that. </body> I'd like to try something like that.
 <timestamp>1211770146</timestamp>
 </comment>
 <comment>
 <username>sasada</username>.
 <body>I've been to Ruby conferences overseas, and I've noticed that they are very relaxed, with a lot of time to spare. I'd like to try something like that. </body> I'd like to try something like that.
 <timestamp>1211770182</timestamp>
 </comment>
 <comment>
 <username>kunit</username>
 <body>This was my first time attending the 5th edition and I thought it was a really good event. <br>Please let me help make sure that 1000speakers continues to take place in the future. </body><br
 <timestamp>1211770985</timestamp>
 </comment>
 <comment>
 <username>camelmasa</username>
 <BODY>I have seen this conference. <BR>I saw the above entry and feel that I could be of some assistance. </body>
 <timestamp>1211773978</timestamp>
 </comment>
 <comment>
 <username>showyou</username>
 <BODY>I participated in the 4th meeting. <br>I'm not sure if I will be able to give a presentation due to work and my own laziness, but I think I can help out with the venue management. </body><br><br
 <timestamp>1211801092</timestamp>
 </comment>
 <comment>
 <username>skobayas</username>
 <body>I participated in the 5th meeting. <Body>I have been in the business for a long time, so I would like to make a comment to express my gratitude. <br>There are so many things you have to do at a conference. <br>It is really hard work. <br>I know what I am talking about. <BR>So, I think this is a great decision. If people burn out, there is nothing to be gained. Please aim for a sustainable effort. If there is anything I can do to help, I will do my best as much as possible. </body> <br><br
 <timestamp>1211809637</timestamp>
 </comment>
 <comment>
 <username>ctrlshift</username>
 <body>I was wearing sunglasses that day, ctrlshift. Hello. <BR>It was quite a difficult situation behind the conference. <br>I hope I can help in some way, as I was inspired by the many things I was able to participate in this year's event. </body>
 <timestamp>1211810024</timestamp>
 </comment>
 <comment>
 <username>t_yano</username>
 <body>No - I think you can do it if you want to do it in a more gdgd way like the java-ja I've heard rumors about. You could do it once every two weeks if you wanted to, or once every few months if your motivation wanes. <br><br>So now you want to squat, you should squat</body>.
 <timestamp>1211819004</timestamp>
 </comment>
 <comment>
 <username>seiunsky</username>
 <body>I'm late to the party... <BR>I'll help you if you need anything. <br>I had a good time at 1000speakers myself! </body>.
 <timestamp>1211912202</timestamp>
 </comment>
 <comment>
 <username>isocchi</username>
 <BODY>I'm late to the party...<BR>I'm looking forward to returning in July to help out with the recruitment flex and other miscellaneous work on the day of the event. <BR>I didn't know that Nishio and amachang were having such a hard time, and I'm sorry for being so selfish and asking them to move the order to later.
 <timestamp>1212494089</timestamp>
 </comment>
 <comment>
 <username>hyoshiok</username>
 <BODY>Shall we have a meeting on how to promote the study group? <br>The gdgd management of the kernel reading group (?) could be a reference for something. <br><br>The kernel reading group's gdgd management(?) might be helpful too. </body> <br><br
 <timestamp>1214178603</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-05-26 https://nishiohirokazu.hatenadiary.org/archive/2008/05/26]