Hatena2015-12-26
code:hatena
 <body>
 *1451129666*Diary of trying 3D printing: more complex shapes
 I was so pleased to find out in the last article that I could quickly make a small container in an hour and a half that I decided to try a more complex shape.
 
 [f:id:nishiohirokazu:20151226201358p:image]
 
 Last time I cut out a rectangle from a rectangle using boolean operations (Subtract), but this time I cut out a cylinder. Rounding the corners is done by selecting the edges and Fillet. 1.5 hours to create the shape except for the letters. Rounding the corners makes it instantly cool (interpretation).
 
 He then decided that it would be cheaper to make it in plaster this time because of its size, and started to put in letters because plaster should be able to output in color, but he misunderstood how to put in the letters and ended up carving them without color. So far, plus one hour.
 
 Ordered at 1:00 a.m. on Dec. 23, 740 yen, shipped on Dec. 25. It was much faster than the last time I made it with nylon, but was it because it was plaster, or was it simply too thin? I don't have enough information to make a judgment.
 
 [f:id:nishiohirokazu:20151226202158p:image]
 
 As a result of daring to push the limits, ignoring the note that "(plaster) is not good at fine shapes.
 
 - Groove with 0.5mm radius cylinder on surface → No problem
 - Groove with 0.3mm radius cylinder on the side surface -> The groove itself remains visible, although it appears to be slightly thinner.
 - 0.3mm radius cylinder with a through hole in a 2mm board → glue filled the inside by about 1mm!
 - 0.1 mm depth characters on the surface → total loss
 
 as it were. Plaster is a type of adhesive that hardens with glue, so any structure thinner than a certain degree would be buried. After thinking for a while about what to do with the holes that have been filled in, we used drawing strokes to penetrate them.
 
 A jig for breadboard jumper cables where there is too much excess of the long ones and not enough of the short yellow or orange ones, so one end of a long yellow cable is put in a hole, cut at the right end, stripped at the top end, and bent at the appropriate side groove to make a short yellow cable.
 
 [f:id:nishiohirokazu:20151226202605j:image]
 
 It's just about usable; I'd give it about 60 points. It was the right idea to dig a groove to prevent the cable from swinging from side to side, but since the groove was dug only at the edge of the jig, I had to hold the cable with my finger at the edge of the jig, which made it difficult to hold the cable. It would have been better to dig straight through. The 0.3mm groove may have been too thin.
 
 I thought it was a good time to get feedback in about 3 days that a 0.3mm hole could be filled, or that this area should have been designed this way.
 </body>

[Hatena Diary 2015-12-26 https://nishiohirokazu.hatenadiary.org/archive/2015/12/26]