Hatena2009-04-01
code:hatena
 <body>
 *1238562617*I made a switch statement in Python 3.0
 Since it's April Fool's Day, I tried to do something false.
 
 >|python|
 for x in range(5):
     print(x)
     MESSAGE = "The value is"
 
     class _(switch(x)):
         @case(0)
         def _():
             print(MESSAGE, "zero!")
 
         @case(1)
         def _():
             print(MESSAGE, "one!")
 
         @case(2)
         def _():
             print(MESSAGE, "twei!")
 
         @case_else
         def _():
             print(MESSAGE, "something else!!")
 ||<
 
 I put the MESSAGE outside of the class to show that it can see the scope outside of the class. It is natural for nested_scopes or later to work.
 
 This is what happens when it is executed.
 >||
 0
 The value is zero!
 1
 The value is one!
 2
 The value is twei!
 3
 The value is something else!!
 4
 The value is something else!!
 ||<
 
 Click here for implementation:
 >|python|
 def switch(val):
     case.cases = []
     case_else.func = lambda :None
 
     class SwitchMetaclass(type):
         def __init__(cls, name, bases, dct):
             if not case.cases: return
             for (v, func) in case.cases:
                 if v == val:
                     func()
                     break
             else:
                 case_else.func()
                 
 
     class Switch(metaclass=SwitchMetaclass): pass
     return Switch
 
 def case(x):
     def foo(f):
         case.cases.append((x, f))
     return foo
 
 def case_else(f):
     case_else.func = f
 ||<
 
 The metaclass constructor __init__ is called at the timing when the metaclass instance (i.e., class) is instantiated, so it is just a matter of creating a function/value mapping with a decorator and executing it at that timing, looking for matches in order from the mapping.
 
 I was trying to do something practical with class Foo(lambda: ...) as suggested by id:moriyoshi. I was trying to do something practical with class Foo(lambda: ...), which id:moriyoshi told me recently, but I ended up with something other than lambda.
 
 *1238588872*"Did You Know" Japanese translation
 This video is worth watching. I translated it into Japanese because I thought it would be a waste if people were too embarrassed by the English language to watch it. (PS: This seems to be version 3.0...)
 
 (PS: A subtitled version is now available on Nico Nico Douga)
 [http://www.nicovideo.jp/watch/sm6631983:movie]
 [http://www.youtube.com/watch?v=UIDLIwlzkgY:movie]
 
 Did you know?
 
 - If you are "one in a million" in China...
 - There are 1,300 people like you in the country.
 
 - China will soon become the most English-speaking country in the world.
 
 - India's "25% from the high IQ side" is
 - That's more than the entire population of the United States.
 - In other words, there are more honor students born in India than all children born in the United States.
 
 Did you know?
 
 - The top 10 jobs in demand in 2010 are
 - It did not yet exist in 2004.
 
 - Now we are teaching students. Preparing them for jobs that don't exist yet.
 - Using technology that has not yet been invented.
 - Prepare for the job of solving problems you don't yet know.
 
 - The U.S. Department of Labor estimates that today's students will be working 10 to 14 jobs.
 - By age 38.
 
 - One in four workers has been in their current job for less than one year
 - One out of two is less than five years old.
 
 Did you know?
 
 - For every eight couples married in the U.S. last year, one met online.
 - MySpace has more than 200 million registered users.
 - If MySpace were a country, it would be the 5th largest country in the world. (between Indonesia and Brazil).
 - Broadband penetration is highest in
 - Bermuda Islands.
 - The U.S. ranks 19th.
 - Japan is ranked 22nd
 
 Did you know?
 
 We live in an era of exponential growth.
 
 - 31 billion searches are made on Google every month.
 - In 2006, there were 2.7 billion cases.
 - Who in the world were all these questions being asked, before the advent of Google?
 
 - The first text message outside of research was sent in December 1992.
 - Today, more text messages are sent and received every day than the total population of the earth.
 
 (Translation: refers to SMS first sent on 1992/12 http://en.wikipedia.org/wiki/Short_message_service)
 
 - Years it took to reach 50 million viewers
 - Radio 38 years
 - Television 13 years
 - Internet 4 years
 - iPod 3 years
 - Facebook 2 years
 
 - 1,000 devices connected to the Internet in 1984
 - 1,000,000 in 1992.
 - 1,000,000 in 2008
 
 - Approximately 540,000 words in English
 - This is about five times what it was in Shakespeare's day.
 
 - It is estimated that a week's worth of information contained in the New York Times is more information than an 18th century person would encounter in a lifetime.
 
 - It is estimated that 4 exabytes (4.0 x 10^18) of original information will be created this year
 - This is more than the last 5,000 years combined.
 
 - Technical information doubles in two years.
 - For students who are now beginning their four years of college, this is a
 - Half of what you learn in first grade is obsolete by the time you're in third grade.
 
 - NTT Japan Successfully Experiments with Fiber Optics
 - For an experiment to send 14 trillion bits of information per second over a single fiber.
 - This means that the equivalent of 2,660 CDs or 2.1 billion phone calls can be sent in one second.
 - Line speeds have tripled in 6 months and are expected to continue that trend for the next 20 years
 - By 2013, supercomputers will be built with more computing power than the human brain
 - By 2049, a $1,000 computer will have more computing power than the entire human race combined!
 
 Did you know?
 
 - While watching this video.
 - 67 children were born in the U.S.
 - 274 children born in China.
 - 395 children born in India.
 - And 694,000 songs have been downloaded illegally.
 
 What does this mean?
 
 <hr>
 PS: If you feel frustrated after reading this entry, here's another recommendation: <a href='http://d.hatena.ne.jp/nishiohirokazu/20120902/1346576549'>Practice not thinking</a>.
 
 *1238589956*April Fool's Day
 I picked up a thunderbolt in front of Kitasenri station on my way home from university, should I report this to the police?
 
 *1238595595* My head is not in good shape.
 Hmmm.
 I think my diaper is not in good shape.
 
 
 I have a very short concentration span, so work that requires long periods of concentration doesn't go well at all. This morning's code to tinker with metaclasses and do weird things lasted about 15 minutes. Well, when I stepped on the gas pedal, the engine would just say "psshhhh" and not turn over at all, but now it turns over at least. It's like after about 15 minutes of driving, the radiator starts making a warning sound due to overheating.
 
 
 So I should have had a paper spread out at hand to think about drawing graphs, but for some reason I'm writing on Twitter "What should I learn to be able to write SF?" and translating English videos. Mwah.
 
 
 Should I just go back to the task list and start picking them off in order? I'm drawing a graph on a piece of paper that says, "The current task itself is not on the task list! That's a derailment!
 
 
 Oh, yes. I was going to do something about the papers that were strewn all over the place.
 
 - □ Create a temporary place to store documents.
 -- A container of documents taken from the mail that must be processed.
 -- A place to keep important documents that you will need later.
 --- Tickets, etc. (need to remember to bring them on the day)
 --- Medical expenses, receipts, etc. (may be needed for next year's tax return)
 -- Documents to be processed with due dates
 -- Money vouchers with an expiration date (such as discount coupons for meals)
 -- A container for documents that need to be engraved (with addresses, etc.)
 -- Unwanted documents (to the trash)
 
 For now, let's make a place for outstanding documents and a place for "documents that will be needed later". I made it. For now, I put everything that was scattered all over my desk and stuff in there. Whew.
 
 Stored documents do not speak of due dates. So if you store them, you may inadvertently forget to process them.
 The way to prevent this would be to "write it in the schedule" since the processing deadline is still a deadline.
 
 - Temporary document container (not yet processed, new mail: Inbox)
 - Place to store until needed later.
 -- Tickets, etc. (up to a specific date)
 -- Medical expenses and receipts (until tax return)
 -- Warranty card/receipt for the machine (until the warranty expires)
 -- Machine operating instructions (until machine is disposed of)
 - Items to be processed by the deadline (write them in the schedule!)
 -- Documents to be processed by the deadline
 -- Money orders and meal discount coupons with expiration dates
 - Items to be disposed of
 -- Items that need to be engraved (e.g., items with addresses on them)
 -- those that don't (go right to the trash!)
 
 It's easy to advise people who are screaming, "I can't find my papers! It's easy to advise people who are fretting about missing documents to keep them in a safe place, but in reality, a large percentage of people who say, "I can't find my documents! But in reality, I think a large percentage of people who say, "I can't find my documents! I have three plastic containers full of papers, but I don't need receipts from five years ago, and I have a lot of A4 kraft envelopes, so let's do an inventory. I'll take out the papers and put the ones that need to be kept in the envelopes and the ones that don't go in the bin to be thrown away.
 
 *1238605664*Re: I'm not even going to sigh.
 <a href='http://d.hatena.ne.jp/finalvent/20090323/1237767824'>What's the point of sighing - finalvent's diary</a>
 
 I agree 100% with the assertion that "It is known that poor nutrition can cause mental disorders such as anger" is an exaggeration, or "If you say 'it is known,' show us the source. I wonder what the benefit is in denying a mentally ill person a source of comfort. It doesn't seem like a very rational course of action.
 
 To use an analogy, you might go to Kitano Tenmangu Shrine at the beginning of the year and say, "There is no way that visiting Tenmangu Shrine will change my chances of passing the exam. Do you really believe that? Are you stupid?" It's like shouting, "You really believe that? In theory, it is correct. But who would benefit from such a cry?
 </body>
 <comments>
 <comment>
 <username>kybernetes</username>
 <body>Since there seem to be multiple versions of "Did You Know", it would be good to specify that this is 3.0. </body>
 <timestamp>1238594011</timestamp>
 </comment>
 <comment>
 <username>m</username>
 <body>2.0 is on niconico<br>http://www.nicovideo.jp/watch/sm1232676<br>. <BR><BR>Will someone make 3.0 as well? </body>
 <timestamp>1238644559</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I will not claim copyright on this translation, so please feel free to make your own > Nikoniko</body>.
 <timestamp>1238645153</timestamp>
 </comment>
 <comment>
 <username>vdna</username>
 <body> Interesting. There are two translations that caught my attention. <BR>1. "about a job that doesn't exist yet" is PREPARING, so it's a nuance like <BR>"in preparation for a job that doesn't exist yet". <br>I'm not talking about being able to teach specifically ("about"), but <br>assuming that you should be able to adapt to it (the unknown job). <br>I think the nuance of "even though there is no way I could teach about a job that doesn't exist yet"<br>(not knowing about the future, but relying on the past to do so)<br>is behind this. <br>2. "Using technology that has not yet been invented" has't been<br>so I think phrases like "did not exist until yesterday" would be appropriate. <br>Because you can't use technology that doesn't exist at the moment. </body>
 <timestamp>1238672301</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I see, the nuance of preparing can certainly be expressed by "to prepare for". I'll correct that. <br>As for the second point, I think it is reasonable to interpret it as referring to "technology that does not exist at this time" in context, since "haven't been" also means "does not exist yet at this time". </body>
 <timestamp>1238688504</timestamp>
 </comment>
 <comment>
 <username>passing by</username
 <body>I'm sorry to be negative, but I didn't think it was particularly worth it. Well, to each his own. <BR>The last What does it all mean ? My own answer to this question is, It doesn't mean anything ! . It's just like looking at the present part of a long history.　For example, if the same question was asked 100 years ago, I would think that 100 years from now, there is nothing.... It's not like there is something that will destroy the human race. </body>.
 <timestamp>1238692555</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>>I didn't find it particularly valuable. Well, to each his own. <BR><BR>I think it's much more worth watching than your banal and unproductive comments. To each his own. </body><br><br
 <timestamp>1238713909</timestamp>
 </comment>
 <comment>
 <username>blackbird</username>
 <body>Thank you for introducing something interesting. <br>I wanted to spread it further, so I took your word for it<br>and made a Japanese translation and put it up on Nico Nico Douga. <br>http://www.nicovideo.jp/watch/sm6631983</body>
 <timestamp>1238715768</timestamp>
 </comment>
 <comment>
 <username>kochi</username>
 <body>I wonder if this can be processed into a screen saver. </body>
 <timestamp>1238725985</timestamp>
 </comment>
 <comment>
 <username>yorihito_tanaka</username>
 <body>I'm impressed! </body>
 <timestamp>1238731944</timestamp>
 </comment>
 <comment>
 <username>userinjapan</username>
 <body>Was it "If the world were a village of 100 people"? It has the same kind of "fun" factor. <br>It's hard to verify the statistical evidence, though. </body>.
 <timestamp>1238747902</timestamp>
 </comment>
 <comment>
 <username>Job Hunting</username>.
 <body>You are in the middle of an unprecedented paradigm shift. <BR>When you think about it, the environment has changed dramatically between five years ago and now. <br>This is such a big change that you can actually feel it in your daily life. <BR>If I were to think back five years ago in the same way, I would not be as shocked as I am now. <BR><BR>As a student looking for a job<BR>>The US Department of Labor estimates that students today will be working 10 to 14 jobs<BR>>by the age of 38. <br>>>One in four workers has been in their current job less than a year<br>>One in two has been in their current job less than five years<br><br>These somethings got me wondering. </body>
 <timestamp>1238766735</timestamp>
 </comment>
 <comment>
 <username>chanera</username>.
 <body>You brought up the population issue at the beginning and end. Population growth in China and India means that the number of talented people is exploding as well<br>. That means they have the potential to dominate the world as the overwhelming manpower of the future. <br>What do you guys (US students) think about this? <br>What do you (U.S. students) think about this? I think that is the question that you are asking. <br>They are saving plant seeds, especially in the U.S., and I have no doubt that this is a major bargaining chip in the future. <br>The monopoly of GMOs is another powerful card. <br>There are also whispers of plans to reduce the population through the spread of viruses. <br>This is a good sign that some of the students who are asked will actually go down this path of population reduction. <br>OG!
 <timestamp>1255686730</timestamp>
 </comment>
 <comment>
 <username>Takuo</username>.
 <body>>>There are 22 Japanese people<br>Why take Japan out of the picture!　WOW<br><br>That's more than the last 5000 years combined<br>By 2049, $1000 computers will be all mankind...<br>What are you basing this on? <BR><BR>If MySpace were a country, it would be the 5th largest country in the world. <BR>>Today, more text messages are sent and received every day than the total population of the earth<BR>It doesn't matter intensely. So? I say</body>.
 <timestamp>1270881006</timestamp>
 </comment>
 <comment>
 <username>Cappuccino</username>.
 <body>I was thrilled to read this article. We are living in an age of exponential growth." I will keep these words in mind as I live my life. <br><br>You say "4 exabytes (4.0 x 10^19)", but isn't "1 exabyte = 10^18 bytes"? </body>
 <timestamp>1283583777</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Oh, that's a typo. I have corrected it. Thanks for pointing it out. </body>
 <timestamp>1283645205</timestamp>
 </comment>
 <comment>
 <username>hajime_create</username>
 <body>It doesn't change the fact that living things eat food and take a dump. </body>
 <timestamp>1346987182</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Yes. </body>
 <timestamp>1346988817</timestamp>
 </comment>
 <comment>
 <username>kbzoffice</username>
 <body>What is the source of the data for these things? <br>(...sorry, I'm asking before looking it up myself)</body>
 <timestamp>1347012619</timestamp>
 </comment>
 <comment>
 <username>passing by</username
 <BODY>I like this kind of thing, it's interesting! Do you know of any others like this? I am interested! </body>
 <timestamp>1347026671</timestamp>
 </comment>
 <comment>
 <username>Reply</username>
 <body>"It is estimated that a week's worth of information contained in the New York Times is more than an 18th century person would encounter in a lifetime. This has been said for about 30 years now. An older planner once told me. </body>
 <timestamp>1347045649</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-04-01 https://nishiohirokazu.hatenadiary.org/archive/2009/04/01]