Hatena2008-04-14
code:hatena
 <body>
 *1208133117*LL
 The pants I bought yesterday were LL. They are all too big.
 
 
 But, well, bigger is better than too small to wear. Big is better than small.
 
 *1208139595*Tried XPathGraph
 -XPathGraph: http://xpath.kayac.com/recent
 --A service that extracts information from a specified URL once a day using a specified XPath and creates a graph.
 --http://xpath.kayac.com/graph/CCtjpMgJ3RGZVg
 --I'm not graphing yet because it's once a day.
 
 -MyOpenID.com
 --https://www.myopenid.com/
 --If you create an OpenID here, you don't have to create accounts here and there when OpenID-enabled services are created here and there in the future.
 
 -----
 
 -amachang helped me.
 -count(....) Check to see if the node is taken by
 Avoid -tbody or tr because the browser may have pinched it.
 -If you start from the root, you may not be able to follow the path because of the tags that the browser inserted in the middle of the path, so you should use // to get a marker that looks like it and search around it.
 -//font/b[3] Take the third B tag in the font tag
 -//text()[contains(. , "of about")]/following-sibling::node()[1] Take a text node containing "of about" and the next element
 -http://xpath.kayac.com/graph/wAjHX80J3RG0PA
 -http://xpath.kayac.com/graph/lDNkZ88J3RGj6w
 
 This kind of thing doesn't make me very happy because it's empty, even if you show me something that was made recently.
 
 *1208143175*We study Chinese
 I love my Mac! I can write in traditional Chinese!
 
 *1208163069*Search is Google, Learn is Cerego
 http://japan.cnet.com/special/media/story/0,2000056936,20367453-5,00.htm
 >>
 Roughly speaking, we want to position Search as Google and Learn as Cerego.
 <<
 
 Ho. It is true that Google has made it very convenient for people who know what they are looking for to remember what they are looking for, but for the novice who does not even know what to search for, the increased options have made it easier to get lost. I wonder if there is a need for innovation in the process of installing base knowledge in the brain.
 
 *1208164441*Client-side database storage
 <a href="http://d.hatena.ne.jp/amachang/20080327/1206607704">What is the Client-side database storage (SQL API) implemented in Safari 3.1? - IT Warnings</a>
 
 I was doing some things with GreaseMonkey and it occurred to me that I could do a lot of interesting things if I had a database of my followers' IDs on twitter. I thought it was Firefox, but I was mistaken.
 
 I'm too scared to string it into GM_setValue or something like that ><
 </body>
 <comments>
 <comment>
 <username>amachang</username>
 <body>This is terrible lightweight log</body>.
 <timestamp>1208138209</timestamp>
 </comment>
 <comment>
 <username>jbking</username>
 <body>I think this article is better for reference. <br>http://d.hatena.ne.jp/amachang/20080327/1206631712</body>
 <timestamp>1208165417</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-04-14 https://nishiohirokazu.hatenadiary.org/archive/2008/04/14]