Hatena2011-09-06
code:hatena
 <body>
 *1315235848* "It's time to get serious about making continuity a thing!" Leverage Memo.
 The book classifies the process of continuing something and making it a habit into three types and five steps, and suggests seven rules to support the process. <a href="http://www.amazon.co.jp/gp/product/4820717081/ref=as_li_ss_tl?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative= 7399&creativeASIN=4820717081">It's time to get serious about making continuity a thing! </a>
 
 >>
 It takes both time and motivation at the same time for people to take action.
 <<
 
 I see.
 
 ** Rule 1: Make time a top priority.
 >>
 Drucker lists the following four characteristics in "The Condition of the Professional": 1.
 1: Time defines the limits of results.
 2: The resource of time cannot be replaced by anything else.
 3: Time is needed for everything.
 4: People are not prepared to manage their time
 <<
 <a href="http://www.amazon.co.jp/gp/product/4478300593/ref=as_li_ss_tl?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative= 7399&creativeASIN=4478300593">Conditions for Professionals - How to Achieve Results and Grow (Hajimete Hajimete Drucker (Self-Realization))</a
 
 In other words, time is more precious than money. I often remind myself that I tend to waste time by calculating, "If my hourly wage is 1,200 yen, then one minute is 20 yen," but it is important. However, unlike money, time cannot be saved, and this book says that time management is more difficult than money management.
 
 ** Rule 2: Don't count on yourself.
 I'm the one who decides "I'm going to do it," but in the end I don't take the action I've decided to take. There are two reasons for this. There are two reasons for this. One is that your schedule is not a "feasible plan," but rather "an ideal, a theoretical idea of what I wish I could do. The other is that I have excessive expectations of myself in the future, saying, "If I work hard tomorrow, I'll be able to manage. If you put off today's tasks because you don't feel like doing them today, and then you put today's tasks on tomorrow's self, tomorrow you will see those tasks piled up and lose even more motivation to do them. It's not surprising when you look at it that way. To keep things going for a long time, it is important to maintain a steady speed.
 
 It also introduces small tips such as making tasks routine to maintain speed, and making changes to reminder e-mails to avoid getting bored with routine tasks.
 
 ** Rule 3, 4 Omitted
 Ensure that rewards are promptly obtained by filling in the squares or by other means. Results in the distant future are not powerful enough to get you laid.
 
 Keep a record of what you want to do. Include a set of reasons/feelings for why you want to do it.
 
 ** Rule 5: Embrace the unplanned.
 Schedules are drafts. If you're not careful, people like me tend to take the schedule as a rule and panic when something unforeseen happens and we can't keep to the schedule. For example, I set up a meeting, but one of the participants goes missing the day before the meeting.
 
 - Choose from "what you want to do," not "what you should do."
 - I'll continue for one week only.
 - Keep a brief record. Circle as well as a few words of feedback.
 - Observe what happens to you when an exception occurs and you are unable to do the task you were continuing. If you feel uncomfortable about not being able to do it, you can continue.
 
 ** Rule 6: Involve your comrades.
 T/O
 
 ** Rule 7: Self-praise gets you laid.
 
 Not wanting to do something means that you don't want to do it. So, you should praise yourself for trying to do what you think you don't want to do. and praising yourself for trying to do something that you feel bad about. Positive words. Praise yourself and stretch yourself.
 
 ** Other
 By the way, this book categorizes habits into three types: the "keep going" type, the "accumulate" type, and the "master" type, and I think this means, in essence, that just doing it will give you success rewards, doing it several times will give you success rewards, and just doing it does not necessarily give you success rewards. Of course, the later you do it, the harder it is to get laid. The accumulating system is a little different, though, in that the accumulated results can be the driving force for continuation.
 
 Do not aim for perfection. If you can do even a little, you have done it.
 Keep the hurdles as low as possible and get the sense of accomplishment as quickly as possible. It is much better than not doing it. Hurdles should be carefully raised from a height that is achievable, rather than towering high in an ideal position.
 Write down as many excuses as you can think of on a piece of paper, then roll it up and throw it away.
 Write exceptions in advance. When you decide to "run every day," writing "sit-ups when it rains" as an exception will prevent you from losing your motivation when it rains.
 Put yourself in motivating environments. Cafes, in subways without internet, libraries, etc. The important thing is to keep a record of how you feel in which environment.
 Avoid excessive expectations of your future self by writing a future diary.
 Slump, a state in which results do not follow despite efforts, need to examine how to make efforts
 A period of stagnant reward growth may occur as you continue. At this time, one of the reasons for frustration is to get impatient with the lack of results, or to give up and quit. You could keep a record of the good things you've done so that you can read it back and read it when times are tough. Or, you could continue to slog along with moderate expectations and moderate motivation.
 Accepting the unscheduled, continuing should have been a means, not an end. If you have an obsession to continue every day, you will suffer.
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4820717081" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe><iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4478300593" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 </body>

[Hatena Diary 2011-09-06 https://nishiohirokazu.hatenadiary.org/archive/2011/09/06]