Hatena2009-06-26
code:hatena
 <body>
 *1245962139* Received Special Jury Award at TAGBOAT SUMMER AWARD 2009
 Yesterday and today we exhibited at the <a href='http://www.tagboat.com/ngs/award/summer/2009/exhibition.html'>TAGBOAT SUMMER AWARD 2009</a>, and to our surprise, we received the Special Jury Award! I was so surprised! What a surprise! I heard that TAGBOAT will issue a news release tomorrow, so I'll post a link to it after the release. (Reprinted from yesterday's article)
 
 <hr>
 
 The <a href='http://www.tagboat.com/ngs/award/summer/2009/result.html'>TAGBOAT SUMMER AWARD 2009 Final Results</a> are in.
 
 Here is the result of the interview (I answered all the questions well and it turned out to be a huge amount): <a href='http://www.tagboat.com/ngs/user_voice/post-23.html'>Artists' Voices | TAGBOAT Next GenerationS</a> (Japanese only)
 
 **1245970725*Hydrangea improvement
 before
 <img src="http://gyazo.com/ecdff21791d5d7646383753e53794844.png">
 after
 <img src="http://gyazo.com/5338cd3d4cbc15eed4f506999c7858a9.png">
 
 Originally, the whole flower, large petals, and small petals were in the golden ratio in horizontal size, but that was only the golden ratio in the horizontal direction, so the large petals and small petals did not touch each other. However, since the golden ratio is only in the horizontal direction, the large and small petals do not touch each other.
 
 <img src="http://gyazo.com/668d4d0b321f31b67113cad27b3a7781.png">
 <img src="http://gyazo.com/21229b61860c2b4a18ad7cfa1691d796.png">
 It's a convenient time.
 
 I'm currently using WolframAlpha to calculate the equations for things like circles touching each other, but it would be useful to have a solver that would place them in the proper position once the constraints are written. Maybe I'll make one.
 
 <hr>
 
 I made sorba.
 
 <img src="http://gyazo.com/7e8ead0bf82ccdff0cbee6fe16ac0591.png">
 
 However, since there is more than one circle that contacts 3 yen, it sometimes returns a different side than expected. I need to make it more generic, so that I can specify "the one on this side" or something like that.
 
 <hr>
 
 You want "through the intersection of these two circles" as well as "tangent to"? That's quite a tedious generalization.
 
 <img src="http://gyazo.com/0e040a4478444f329126e589692321c2.png">
 
 <hr>
 
 <img src="http://gyazo.com/e7dae3d2e3fd056fcafb1380e975483c.png">
 It's pretty much finished.
 However.... Last time I used Virtual Star, I decided the composition by hand, and after a while I noticed that it was off by about 5mm from the "calculated correct position", which irritated me. I would like to calculate the color scheme by hand. First of all, I would like to find the adjacency between squares and arrange them so that the difference in hue between adjacent squares is maximized.
 
 <img src="http://gyazo.com/9598da5dd18e11a3d3c7a9533f014c7c.png">
 Or you could combine different hues like this so that no two colors are the same...
 
 <img src="http://gyazo.com/f0a05b063a4beb64587d48e1f64f0312.png">
 
 Hmmm. It's something different.
 
 <hr>
 I had to wait 30 minutes in Atami, so I took a footbath.
 
 <img src="http://gyazo.com/2759ee907f2d7716ac25cf83f698f0bc.png">
 
 If I made the colors this quiet, I think I could be forgiven. I tried to reduce the difference in hue to a level where you can just barely make out the differences in the colors of the flowers.
 
 Compared to the first manually colored version, however, it looks globally similar and not so good. I think I'll apply the optimization "maximize the difference in hue between adjacent flowers," and then I'll shake up the hue of the flower components a little bit like this.
 
 By the way, as usual, no random numbers are used, so the color scheme itself is also a quiz. Hint: the color scheme itself is a quiz.
 
 <img src="http://gyazo.com/8d509be086f709b904027e4edc1279c7.png">
 
 *1245998829*[pyspa]Footbath in Atami
 I had to wait 30 minutes in Atami, so rather than wait in the station, I came out and took a footbath. It was so hot!
 
 <hr>
 
 f:id:nishiohirokazu:20090626161814j:image
 
 <hr>
 
 I'm surprised this isn't all of it.
 f:id:nishiohirokazu:20090626164802j:image
 I counted them and there were 46 in all!
 
 
 What's that? id:yoshiori You're not coming? Even though there are so many Pepsi's?
 f:id:nishiohirokazu:20090626164944j:image
 
 
 f:id:nishiohirokazu:20090626191500j:image
 
 
 f:id:nishiohirokazu:20090626204247j:image
 </body>
 <comments>
 <comment>
 <username>shou</username>
 <body>Something beautiful</body>.
 <timestamp>1245980902</timestamp>
 </comment>
 <comment>
 <username>Yoshiori</username>
 <body>Sorry ......orz</body>
 <timestamp>1246003681</timestamp>
 </comment>
 <comment>
 <username>bgnori</username>
 <body>The "circle touching three circles" story reminded me of this area. <br>http://aozoragakuen.sakura.ne.jp/taiwa/taiwaNch03/enkan/node2.html</body>
 <timestamp>1246028268</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I was trying to draw that very Steiner circle thing. Thanks for the helpful URL! </body>
 <timestamp>1246066355</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-06-26 https://nishiohirokazu.hatenadiary.org/archive/2009/06/26]