Hatena2008-04-03
code:hatena
 <body>
 *1207187645*EX-F1
 I casually looked at the bookshelf in the lab and saw that Nikkei Electronics had a feature on machine gun cameras, with a reference to the pros and cons of the EX-F1. Not that it matters:
 <a href="http://journal.mycom.co.jp/articles/2008/01/07/exf1/">[Interview] Interview with the developer of the Casio EXILIM PRO EX-F1 - The joy of ultra high-speed continuous shooting for all users | Home Appliances | My Comi Journal</a>.
 
 *1207194255*[Python] Common Errors
 I had written a Japanese translation of the error messages that beginners tend to give in a Jython book, thinking that many people would skip them without reading them because they are in English.
 
 -"__add__ nor __radd__ defined for these operands" "Neither __add__ nor __radd__ is defined for the object that is the target of the calculation (addition is not defined)" -> It is common that a variable that is supposed to contain a number contains None. It is common that a variable that is supposed to contain a number contains None. A function that is supposed to return a number may return "none" by just wrinkling the return.
 
 - "global name 'x' is not defined" "I couldn't find a variable named 'x' (I went looking for it in the global)! Are you sure you spelled it right?"
 - "NameError: name 'true' is not defined" "'true' is not defined! Are you sure you spelled it right?"
 -- True is correct, by the way.
 
 - "UnboundLocalError: local variable 'y' referenced before assignment" "The local variable y is read before assignment! Are you sure you spelled it right?"
 
 - "TypeError: drawOval(): 1st arg can't be coerced to int" "The 1st argument of drawOval can't be coerced to int!
 
 - "not all arguments converted" - "there are too many things to embed"
 
 - "not enough arguments for format string" "not enough things to embed"
 
 -----
 - "IndentationError: unindent does not match any outer indentation level" "The number of indentations is reduced to the halfway point!"
 - "IndentationError: unexpected indent" "Indentation where I don't want it"
 - "IndentationError: expected an indented block" "There's no indentation required!"
 
 It should say something like line 3, so look at that line and fix it. If it looks OK, it may be a mixture of tabs and spaces. Use an editor that can distinguish between tabs and spaces.
 
 -----
 
 >>
 It is quite miserable when the indentation is made to generate an error with full-width spaces.　 It only says "SyntaxError: invalid syntax".
 <<
 
 I hope the editor that renders whitespace as really whitespace will go away. In the meantime, you can paste it into IDLE and run it, and it will redden the syntax error location.
 
 *1207196259*Appendix writing in progress
 Done & reread later to check.
 - docstring
 - string format operation
 - Python's private modkit
 - Private is just a decoration.
 - Nested Scope
 
 Fuu.
 Be careful not to start a topic that you can't read the scale of when it is completed by saying, "Oh, I want to write that one, too. ←When I started a story about multiple inheritance, for some reason it turned out to be a huge work of over 1,000 lines and I almost died.
 
 Make a list of the things you are going to write and think about which ones you are going to throw away. Also, be really selective about what you might want to write and put it on the list.
 
 - Japanese codecs in Jython 2.2.1
 -- The one I wrote is from 2.2.2, but the latest version is 2.2.1 at this time.
 
 -----
 
 There is a section called "Indefinite Length Arguments in Java" and an almost empty section called "Variable Length Arguments in Java.
 Of course, when I explained Python's variable length argument, I said, "Actually, you can do this in Java since 1.5. See the appendix for details." And then it says, "You can also do it in Java since 1.5. And I don't think this information is necessary for a Jython book (oh
 
 The appendix is really just a collection of columns, since everything that was hard to include in the main book has been pushed out, including how to sign an applet since Jython requires a signature to use it.
 
 -----
 >>
 Unfortunately, however, there is a bug in readline and readlines,
 When I read a Japanese file, it is garbled.
 If you want to read Japanese files line by line in Jython 2.1,
 After reading the whole thing in READ.
 I think it would be easiest to divide by split.
 <<
 <pre>
 fi = open(r"c:\tmp.py")
 lineNum = 0
 for line in fi.read().split("\n"):
     line = line.rstrip()
     lineNum += 1
     print "%d: %s" % (lineNum, line)
 
 fi.close()
 </pre>
 
 I had written "Jython2.2.1.0.0.1", but it didn't work with Jython2.2, so I erased it! I put it here because it's a waste! (Oh!
 
 -----
 
 I don't know what I wrote in a sentence that exceeds 1,000 lines or where I wrote it because my brain's memory load is low!
 
 *1207199219*Python and CG
 The crowd simulation used in the 4K video "The Battle of Sekigahara" is written in Python &#8212; TRIVIAL TECHNOLOGIES 2.0 http://coreblog.org/ats/python-crowd-simulation
 
 Heh!
 
 >>
 Python has become the de facto standard scripting language in the CG world, and I think all you CG people will be happy if you learn Python:-)
 <<
 
 Great sales pitch > "Python is the de facto standard in the world of computer graphics.
 But in writing the Jython book, I did some research on software that uses Python and found that Python is the de facto standard for CG software, even though there is almost no reason why it should be Python (Ruby or Lua is fine). Even though there is almost no reason to use Python (Ruby or Lua is fine), most of the software uses Python, which is why Python is the first choice when it comes to new support.
 
 Also, not really related, but Civilization, which was recently popular on Nico Nico Douga, has a built-in Python console for debugging.
 
 I wonder how much market share Jython will have as a scripting language embedded in Java software.
 
 *1207210043*86 camp
 If you think about it, this weekend is the 86 camp, isn't it?
 If I don't finish the manuscript, I have to take my Thinkpad with me.
 When the manuscript is finished, take your MacBook and ActionScript.
 Ahhhhhh.
 
 *1207213059* Writing Methods in Blogs
 The method is to reduce the psychological load of starting writing by starting on the blog writing screen, and when you have written some amount of text that you would cry if it accidentally disappeared, paste it into a text editor and continue writing.
 
 If I had discovered this earlier, I could have written more manuscripts.
 
 *1207213939* I'm cool with it.
 It puts a lot of strain on the people who edit to work right up to the real deadline, doesn't it?
 This is one thing I'm going to say, that I'm going to close until I leave for the 86 camp.
 
 The reason I am able to write these things with a normal mind is that I have a rough idea of when I will be able to complete them. There are so many things I want to add, but I don't have time to write them all.
 
 *1207215178*[Jython] String formatting operations are corrupted.
 [f:id:nishiohirokazu:20080403183151p:image]
 
 What, what, the behavior changes depending on whether you write "python.console.encoding = sjis" in the repository or not?
 
 *1207216115*Wow!
 Now I finally understand.
 It's smartest to write it the way I understand it now.
 Do you have time to rewrite all the places where you can rewrite the sample code? > <
 
 
 ahhhhh
 
 
 
 I can't read the time it will take. Hmmm, what should I do?
 I guess I'll just have to finish the manuscript first. I'll have to check the code for the appendix section I'm writing first.
 After that, I'd ask the editor to see if he has time to revise it.
 Mm.
 Rather than making elegant code that is working but could be written more elegantly, we need to check code that has not been verified to work with 2.2.1 first.
 
 *1207221588* Not enough white space to write proofs.
 Stories deleted because there was too little time to complete them:
 
 - After asking him why he insists that fields should be private, he says that there is no access modifier that says "read is OK but write is not allowed", so he has to create a getter that just returns the value, or that he has no choice but to write a getter because the language is not strong enough. Then he showed them how to hook a field write in Python and said, "I don't need a setter because I can do this" (absurd).
 
 - After a lot of DIS about how singletons are effectively global objects or whatever, I argue that in the end, you're just using the uniqueness of classes to create a single object that ties classes together one-to-one, so why not use modules if you're using Python? What you write in the top class is executed as if you wrote it in the constructor, and you have to call your own termination process because Java destructors don't run on termination anyway.
 
 Oh no. Too bad (dry laugh).
 
 -----
 
 - 0 Appendix
 --- String formatting operations
 --- Automatic conversion to Java object
 --- Handling Japanese in Jython
 --- About import's style
 --- Standard output
 --- Problem when there are public fields and methods with the same name
 --- How to check
 --- Comparing Python and Java (Operators)
 --- Comparing Python and Java (Identity Determination)
 --- Python has no types?
 --- what is true
 --- Python's private modem
 ---private is just a decoration.
 --- docstring
 --- Beans Property
 --- Try to make it an applet with signature
 --- Variable Length Arguments in Java
 --- Nested Scope
 --- List of method names in reflection
 --- Convert Java import statement to Jython
 --- Example of file loading
 --- String Methods
 --- Reasons why "fields should be private
 --- Singleton
 
 No, that's too much, no matter how much. At this point, it's about 1600 lines, and if I write about private, singleton, etc., it will be about 2500 lines.
 
 *1207233024* Appendix completed.
 I'm going to start revising chapter 4 now.
 
 *1207234839* understood.
 Jython 2.2.1 behavior:
 >|python|
 >>> unicode(u "A")
 u'あ'
 >>> unicode(u"あ")
 u'あ'
 >>> "A"
 u'あ'
 >>> unicode(_)
 u'B'
 ||<
 
 I understand why it would be B.
 
 -----
 
 <pre>
 >>> data = "Taro:25, Hanako:23, Jiro:21"
 >>> data
 u'太郎:25, 花子:23, 次郎:21'
 >>> print data
 (broken into pieces)
 </pre>
 interjection expressing surprise, pain, fear, or disgust
 
 <pre>
 >>> data = u "Taro:25, Hanako:23, Jiro:21"
 >>> data
 u'太郎:25, 花子:23, 次郎:21'
 >>> print data
 Taro:25, Hanako:23, Jiro:21
 </pre>
 
 Phew. Please don't give me a break because I feel like my heart is going to stop every time I see a garbled character anymore.
 
 -----
 
 <pre>
 >>> print u "When $1 is %.2f yen, 100 yen is %.2f dollars" % (140, 100.0 / 140)
 1ﾉ?140.00?B100?0.71ﾉ?
 </pre>
 
 Geez.
 Is there still a bug in the formatting operation....
 
 <pre>
 >>> print u "a%d" % 1
 B1
 </pre>
 
 Hmmm.
 
 -----
 
 Something like, due to the fact that we use Japanese whenever possible, if the Japanese language is falsified, there is a huge amount to be corrected.
 
 <pre>
 # Tuples allow multiple values to be embedded
 >>> print "%s is %d yen." % ("daikon", 100)
 Daikon is 100 yen.
 </pre>
 
 It is absolutely not possible to be satisfied with this or "daikon" as "daikon," so we have to come up with a natural sample.
 
 <pre>
 # Tuples allow multiple values to be embedded
 >>> print "%s is %d years old." % ("Alice", 26)
 Alice is 26 years old.
 </pre>
 
 It went like this.
 
 -----
 
 I've mentioned the bug where the formatting operation breaks Japanese, but the second time "print "%d is a prime number!" % n" or something like that, do I write "this is broken due to a bug" again, or do I change it to "print n," "is a prime number!" or do I change it to "% n," which is a prime number?
 
 -----
 
 It came up again.
 
 *1207239773* done at one point.
 I have now submitted all the manuscripts...
 
 But what is not so neat, imho, is around the other chapters where the Japanese output would be falsified.... I fixed that where it would be an essential problem, though....
 
 Well, if it doesn't become an essential problem, it means that the surrounding text doesn't change significantly (only the source code changes a bit), so it should be possible to fix it in the proofreading stage. I would like to think so. Well, I won't be taking my Thinkpad with the manuscript to the development camp starting tomorrow.
 
 *1207240413*I'm tired.
 Aaaaahhh!
 
 It's only 25:30, which is about the time you'd think "Oh, it's that time already?" if you were leisurely browsing the Internet, but when I looked outside after playing games all night, I felt as tired as I did when the 8:00 a.m. light was shining brightly.
 </body>
 <comments>
 <comment>
 <username>TOKOROTEN</username>
 <body>Well, Python does a lot of errors when you forget the: in if, but <br>I hardly remember doing runtime errors. </body>
 <timestamp>1207203258</timestamp>
 </comment>
 <comment>
 <username>tkuro</username>
 <body>Mixed tabs and spaces<br>￥t print "foo"<br>￥s￥s￥s print "bar"<br><br>IndentationError: unindent does not match any outer indentation level<br><br>and so on. Elementary cedar? </body>
 <timestamp>1207203958</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>↑Adopted! </body>
 <timestamp>1207210335</timestamp>
 </comment>
 <comment>
 <username>jbking</username>
 <body>"Fields can be made private(ry<br>by a combination of constructor and public final</body>.
 <timestamp>1207223175</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I think final can't even be rewritten from within. </body>
 <timestamp>1207223933</timestamp>
 </comment>
 <comment>
 <username>Shibukawa</username>.
 <body>Wow! This info is helpful when teaching new people. <BR><BR>I wonder what I'm doing wrong...I'll observe...PyScripter picks up indentation and other SyntaxError levels in real time, so I think I make fewer stupid mistakes than I used to. I did use variables before assigning them, or sometimes I do the wrong number of variables when expanding, like a, b, c = [1, 2]. </body>
 <timestamp>1207239434</timestamp>
 </comment>
 <comment>
 <username>otsune</username>
 <body>It is true that the scripting engines for 3D software are all in Python. <br>But Adobe software is ECMAScript.<br>In the end, I had to do a lot of things...</body>.
 <timestamp>1207239625</timestamp>
 </comment>
 <comment>
 <username>poohtarou</username>
 <body>Thanks for your help (o^We^o)</body>.
 <timestamp>1207251579</timestamp>
 </comment>
 <comment>
 <username>jbking</username>
 <body> Oh, so from the inside you want to rewrite it. I thought it would be better if I could set it first since it says "read is ok, but write is not allowed." I guess I'll have to wait for a property from Java7 to make that happen. </body>
 <timestamp>1207252076</timestamp>
 </comment>
 <comment>
 <username>passing by</username
 <body>I started python after reading this. <br>Thank you! </body>
 <timestamp>1207287037</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>ECMAScript<br>After all, JavaScript/ECMAScript holds a large market share as a scripting language that runs in the browser, so it would not be surprising if ECMAScript swallows up a wider area in the future. It would not be surprising if ECMAScript swallows up a wider area in the future. </body>
 <timestamp>1207537222</timestamp>
 </comment>
 <comment>
 <username>tgbt</username>
 <body>When I found out Blender was loaded with Python (?) When I found out that <body>Blender has Python (?) (how many years ago?!), I thought "Python? I thought "Python? I wonder when Python became popular.<br># I think Nishio-san is responsible for making Python famous in Japan. </body>
 <timestamp>1207846575</timestamp>
 </comment>
 <comment>
 <username>TOKOROTEN</username>
 <body>PaintShopPro has a Python macro that has helped me a lot. <BR><BR>To create about 100,000 images for experiments. <BR><BR>And now I'm trying to respond. </body>
 <timestamp>1210355798</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-04-03 https://nishiohirokazu.hatenadiary.org/archive/2008/04/03]