Hatena2014-04-27
code:hatena
 <body>
 *1398524475* "How Engineers Learn" was written.
 The April 24 issue of <a href="http://www.amazon.co.jp/gp/product/4774163988/ref=as_li_ss_tl?ie=UTF8&camp=247&creative=7399&creativeASIN= 4774163988&linkCode=as2&tag=nishiohirokaz-22">WEB+DB PRESS Vol. 80</a>, I wrote an article "How Engineers Learn" as a special project.
 
 [f:id:nishiohirokazu:20140426232155p:image]
 
 Vol. 80 itself was released in April, so it was titled "Welcome Newcomers! and "How to Learn to be an Engineer" is also intended for readers who will be working or going to school in April. How to Learn to be an Engineer" is also intended for readers who will be working or going on to higher education in April. However, we are sure that the contents will be useful for other people as well.
 
 What inspired me to write this article was a column in my best-selling book, <a href="http://www.amazon.co.jp/gp/product/477415654X/ref=as_li_ss_tl?ie=UTF8&camp=247&creative= 7399&creativeASIN=477415654X&linkCode=as2&tag=nishiohirokaz-22">The Technology Behind Coding</a>" column. I was asked to write a column because I had some extra space, and I wrote several columns about how to learn.
 
 - p.23 "Output first to confirm understanding"
 - p. 26, "Why I Don't Know What to Learn."
 - p. 79, "Concrete and Abstract Knowledge."
 - p. 80, "Biting the Dust."
 - p.82 "Nibble from where you need to."
 - p.134 "grasp roughly and gradually flesh out the details."
 - p.235 "Transcribe from one end to the other."
 
 This column has been very well received and praised by many people. For example, an Amazon reviewer wrote
 >>
 A column not directly related to the purpose of this book was particularly excellent for me.
 It contains a prescription, albeit a short one, for "what to do when you feel overwhelmed by the sheer volume of information."
 Just reading this column alone was (at least for me) worth the price of the book.
 <<
 
 I am very happy to receive your evaluation, but actually, as the author, I am not satisfied with the results. In order to fill the margins of the column, I had to cram in a limited number of words, so I had to cut some parts out. In addition, because the columns were published in bits and pieces, some "connections" were inevitably sacrificed.
 
 We were able to write 17 pages on this subject in this special issue of "How Engineers Learn". Here is the table of contents:
 
 - How to learn efficiently --- 3 axes of knowledge and 3 phases of learning
 - How to take the first step --- learn where you need to go, get the big picture, copy scripture
 - How to understand deeply --- compare, learn from history, make and learn
 - What to Learn, What to Make --- How to Find Problems and Achieve Results
 
 If you compare this to the columns in "The Art of Supporting Coding," you will see that the knowledge is networked together. The chapter "How to Understand Deeply" is less connected to the columns, but this is in harmony with the first chapter "How to Learn a Language Deeply and Effectively" in "The Art of Supporting Coding."
 
 In other words, this special project, "How Engineers Learn," is "the art of learning that supports 'the art of coding. Although "How Engineers Learn" is written in such a way that it is safe to read by itself, it is even better when read together.
 
 We hope you enjoy it. Thank you for your continued support.
 
 
 References:.
 <a href="http://www.amazon.co.jp/gp/product/4774163988/ref=as_li_ss_tl?ie=UTF8&camp=247&creative=7399&creativeASIN=4774163988&linkCode=as2&tag=nishiohirokaz-22">WEB+DB PRESS Vol.80</a>
 <a href="http://www.amazon.co.jp/gp/product/477415654X/ref=as_li_ss_tl?ie=UTF8&camp=247&creative=7399&creativeASIN=477415654X& linkCode=as2&tag=nishiohirokaz-22">Technologies Supporting Coding</a>
 WEB+DB PRESS Vol. 80 is available in e-book format from the publisher's official page "<a href='http://gihyo.jp/magazine/wdpress/archive/2014/vol80'>WEB+DB PRESS Vol. 80｜Gijutsu Hyoronsha</a>". Gijutsu-Hyohron-Sha</a
 PS: You can now read it on Gijutsu Hyoronsha's website. <a href='http://gihyo.jp/lifestyle/feature/01/engineer-studying'>How Engineers Learn - Gain Knowledge Efficiently and Achieve Results</a>.
 </body>

[Hatena Diary 2014-04-27 https://nishiohirokazu.hatenadiary.org/archive/2014/04/27]