Hatena2013-11-02
code:hatena
 <body>
 *1383364575*Quantum Shogi: Explanation of the game record of the game I lost.
 Although Quantum Shogi has a strong theory of the first move advantage, I lost in the first move, so I explained the game record for reflection and review.
 
 Click here for the game record: http://shogitter.com/kifu/2204
 
 1: 先手５三香飛、後手同香飛。
 3: Ace 43 Koufei; I'm thinking that this is more advantageous than getting back the 53 Koufei, since it takes a piece that is not in convergence.
 4: Dong Fei, the rear player. The Shang Fei moved to the side, which confirmed it as a flying car.
 5: Pioneer has the same scent. Goalkeeper has the same piece. So far, the first player has Quantum, Quantum, and Fei, and the second player has Shang Fei, Shang Fei, and Shang Fei. I think the situation is still in the first player's favor.
 7: Ponte 61-silver-kin-gaku-uchi. This is a move that eliminates the possibility of a walk or a katsura by playing in the lower part of the enemy's line, thereby converging on a stronger piece.
 8: The move by the rear player to play 69 Fei. This is another move to eliminate the possibility of Kogaris and converge on the flying car by playing Kohi in the lower part of the enemy's line.
 9: Sensei 7-1 Kin Yose. The silver, gold, and horns move sideways to confirm to gold.
 10: Gote 79 Fei Cheng. Well, he wants to take a piece.
 
 Here, I, as the player ahead, thought about it. In battles between players who are averse to confirming their pieces, it is often the case that the players take each other's pieces from this position. Is that really right? Especially, the diagonal move takes time to converge because there is a possibility of 4 pieces of Ginkaku-o. If it is a convergence to Ginkaku-o and a flying car, wouldn't it be OK to exchange them?
 
 11: 先手同銀角王。
 12: 後手４四量子打。
 
 I, as the first player, did not understand the meaning of this move. However, after the game, the first thing that the player pointed out to me was that I had made a mistake in dealing with 12, and I agreed with him. In this move, the player has two choices: to take the 7-1 gold or to invade the opponent's position at the same time the Kaku is determined in the next move. What I should have done here would have been to move Ginkaku-o to 5-7 or 46 to confirm Kaku. But I didn't notice.
 
 13: 先手８一金寄。
 14: Gote 7 Shichikaku-nari. At this point, the previous player's Ginkaku-o has converged into Gin-o. Once it is the Silver King, the previous player can no longer confirm it to be Silver by his own power. The move range is covered by the silver king. The only way is to ask the opponent to take it. But, there is no way he will take it, is there?
 
 15: First move, same Katsura. This made the pawns of the first player look gorgeous.
 16: Rikote 92 Quantum Strike. This is a quantum derived from the first move, which is both silver and gold, so if my gold does not move, I can take it while confirming it as silver, reducing the possibility of silver from my piece. If my gold moves, I can take it while confirming to gold to reduce the possibility of gold from my piece.
 17: 先手９一金。後手同金。
 
 19: The first player makes a 6-1 quantum move. Goatee same angle. This was a poker mistake by the first player, giving him one quantum and a definite corner on the opponent's side.
 21: The first move was 5-7 Quantum Strike. He failed to cut down his pieces by striking into the opponent's camp, so he thought to make it easier to take the silver and gold by advancing the definite silver and gold on his hand, but it was a weak move.
 22: 後手１七香成。後手が攻撃に出る。同桂。１六香。２五桂馬。２四銀金打。３三桂成。同銀。
 
 The first move's Katsura horse has run away, and the first move has gained one Quantum, but the second move has identified one Silver. The first move's silver king is still the same silver king, but there is a "convergence from silver to silver king," so to speak.
 
 29: The first move is 29 Quantum Strike. This is a move to take away the possibility of gold for the back hand, while still being attacked by Kakaku. Same gold. The player's gold is now guaranteed.
 
 32: Rote 2-5 Kogan. 3-6 Quantum Strike. The move is also an attempt to take away the possibility of a silver by the player who is attacking. 2.7 Kashinari. The same silver.
 
 36: 後手７五桂馬。
 37: Ignoring the previous move, the player plays 7-1 flying move. This is a move to take both gold and angle, since the square is no longer effective due to the fact that the latter's silver possibility has just been eliminated, and for the same reason the 91 gold is no longer effective. The second move is a 7-2 Quantum Strike. 9-1 Toi Cheng.
 40: Ignore the back hand and play 877 Katsura. Ignore the first move and play 45 Katsura. Why did he make this move...?
 
 (中略)
 
 53: The first move is a 97 Katsura. This takes away the possibility of a Katsura horse from the Go player's Ayoku Katsura-o and converges on Ayoku-o. However, there are 9 pawns for the pawn king. Moreover, the 9-row side has 3 pieces of silver and gold, so it is difficult to attack.
 
 (中略)
 
 64: Gote 9-3 silver. This deprived the first player of the possibility of a silver, and the silver king was finally identified as the king. Oh no, he has been identified in the garrison. Before this happened, I should have converged on the Silver King by, for example, diagonally drawing the 4-7 Aimi-Gin-Kin-O. Then, "which is the silver and which is the king" would not have been determined by the opponent's move. In the 70th move, the first player surrendered.
 
 ** 考察
 
 As for the definite move to the silver angle king and the exchange of the flying car itself, the author believes that it is not yet decided to be bad. However, the move was like "the path by the cliff," and the player should have proceeded with great care not to fall down the cliff. The next move after taking the flying car would have had to be "definite to the corner".
 </body>
 <comments>
 <comment>
 <username>魔法中年</username>
 <body>Nice to meet you. <br>I was surprised at move 20, where the first player took the second player's Kaku determination and the second player can again determine it to be Kaku. <BR>I was surprised at the 20th move, where the first player took the second player's corner decision and the second player could again decide on the corner. I guess I had been under the preconceived notion that the piece allocations were equal on both sides. I learned a lot.
 <timestamp>1384406987</timestamp>
 </comment>
 </comments>

[Hatena Diary 2013-11-02 https://nishiohirokazu.hatenadiary.org/archive/2013/11/02]