Hatena2012-11-14
code:hatena
 <body>
 *1352902687* lean startup: leverage memo
 Leverage memo for "<a href="http://www.amazon.co.jp/gp/product/4822248976/ref=as_li_ss_tl?ie=UTF8&camp=247&creative=7399&creativeASIN=4822248976& linkCode=as2&tag=nishiohirokaz-22">Lean Startup - Creating Innovation through a Waste-Free Entrepreneurial Process</a>" leverage memo
 
 ** Q: Which hypothesis should be tested, "demand exists" or "technically feasible"?
 
 Instead of "Can we make this product?" we should ask "Should we make this product?" and "Can we build a sustainable business around this product?
 
 It says that Kodak asks teams to answer the following four questions (p. 91)
 
 - 1: Are consumers aware of the problem we are trying to solve?
 - 2: If there is a solution, will consumers buy it?
 - 3: Do you want to buy from us?
 - 4: Can we provide the solution?
 
 And it also says that many fail to skip 1-3 and go to 4, creating a solution before checking to see if the customer has a problem.
 
 If consumers are unaware of the problem -> "Dropbox believed that file synchronization is a problem that most people are unaware of its existence," so they made a promotional video before creating the product to see if many people would take the action of "pre-ordering the beta version" (if they are made aware of the problem, will they want it). (P133)
 
 ** Q: What kind of indicators should be established?
 
 Three "ease of doing" is important (p. 192)
 - Ease of Action. For a report to lead to action, the cause-and-effect relationship must be clear. Otherwise, it is a vanity metric. If the "total number of visits" goes up or down, it doesn't tell us what to act on.
 - Understandability. If the data is not understandable to the reader, it is meaningless. We recommend using "person" as the unit of measure because it is easier to understand.
 - Ease of checking (verification). Can the report be verified by other means (e.g., by asking the customer directly) to see if it is correct?
 
 The third one is quite difficult.
 
 ** Q: It is difficult to measure quantitatively from the beginning, what should we do?
 
 Startups in the early stages do not have enough data to derive an appropriate model. Therefore, early strategies tend to be based on instinct (p. 119).
 
 So it seems to be a hunch at first. The important thing is to "make decisions based on data" and move the pieces in the direction that will allow you to do so.
 
 ** Other
 
 Shortening the verification cycle.
 
 Early adopters do not care much about shortcomings. Therefore, an approach of quickly launching a prototype of poor quality can be successful. Pivots are always necessary when a business grows and begins to deal with the mainstream.
 
 Hypothesis to be tested. Will it add value to the user? Can the business continue to grow sustainably?
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4822248976" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 *1352904902* What if the pomodoro is over in 5 minutes?
 I wrote the rest of what id:Yoshiori and I were talking about in the car on the way to PySpa on Twitter, so I'm reposting it on my blog so it doesn't drift away.
 
 <hr>
 
 I've been asked many times in my own past blogs about what I do when I have less than one pomodoro of work left over. In the original book, the authors mentioned reviewing what was done, repeating what was learned, thinking of ways to improve the work, and making notes of conclusions.
 
 Maybe the author doesn't envision a situation where "a task that was supposed to take 25 minutes is done in 5 minutes"; if a 25-minute task is done in 22 minutes, I can still imagine using the rest of the time in that way, and if it's an input task like studying, it can be repeated in the remaining time.
 
 But when you have 20 minutes left over after 5 minutes for a "difficult to estimate task" like debugging, it doesn't seem right to "kill" the remaining time by thinking of a new task that would use 20 minutes on the spot. That would not be "25 minutes of focus" that can be compared to other pomodoros.
 
 So, if you have so much time left over that you don't know what to do with the rest of your time, I think you should gracefully cancel your pomodoro and start a new one.
 
 >>
 yoshiori
 I see, but I need to do something about my lowly mind that thinks, "Well, I did a little work on that pomodoro earlier, and I feel like I'm losing something."
 <<
 
 "Woohoo, I finished in 5 minutes what I thought would take 25 minutes, I'm a genius!" I'm a genius!
 
 We are in pursuit of "a fun way to get the job done," so we should always choose the fun way: "I did it, I concentrated for 25 minutes" when we concentrated for 25 minutes but did not finish the task, and "I did it, I finished the task" when the task was finished but it was not 25 minutes.
 
 I don't think a system that brings up "feelings of loss" or other negative emotions would be able to continue.
 
 >>
 yoshiori
 Ah, I see, I forgot a little about the basic premise of "I want to enjoy my work! Of course there's a reason "so I can concentrate", but the basic premise is "to have fun"! Thank you! I feel a little better now.
 
 I think we have to be careful not to think too much and make tasks that don't fit in 25 minutes or are too small look like something we don't want to do.
 <<
 
 Such tasks are supposed to be "crisp, beatable, comfortable tasks" if they are managed with a conventional TODO list. Pomodoro made it possible to get a sense of accomplishment quickly by chopping large tasks into 25 minutes, which is difficult to feel a sense of accomplishment with conventional TODO, but on the other hand, there is a disadvantage in handling tasks shorter than 25 minutes.
 
 I'm beginning to feel that it's important to have a chance to get a sense of accomplishment on both the scale axis of "task completion" and the time axis of "25 minutes of focus."
 
 >>
 yoshiori
 Ah, I see, I should just think of the 25 minutes of concentration and the completion of the task as two rewards, how can I say it? I should try to eat a piece of chocolate to make it easier to understand. That way, if I finish the task in 5 minutes, I can eat one piece of chocolate and move on, and if I concentrate for 25 minutes and finish the task, I can eat two pieces of chocolate and take a break.
 <<
 
 I can make it an easy-to-understand material reward, since "accomplishment = mental reward. But if I do the chocolate system, there are two punishment opportunities waiting for me: "I get fat" and "I get cavities.
 
 >>
 yoshiori
 That would add a pretty big task of "lose weight" and "fix cavities" to the list.
 <<
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4048689525" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 </body>

[Hatena Diary 2012-11-14 https://nishiohirokazu.hatenadiary.org/archive/2012/11/14]