Hatena2009-10-26
code:hatena
 <body>
 **1256546108* Examples of misinterpreting mere advertisements as authoritative.
 I'm often asked by people who teach media literacy classes somewhere if I have any good subject matter, so here's a note.
 
 <a href='http://blog.pasonatech.co.jp/mitani/10225.html#Comm'>Don't trust Google? Beware of ESTA agency websites if you are going to the US! | Fool on the web around the world | Asunaro BLOG</a>.
 
 In summary, "When I clicked on a sponsored link (advertisement) that appears when I searched for ESTA, the link was to an application agency, and they charge me money for what is supposed to be a free application! This is a scam!" This is a scam!
 
 I guess something that is taken for granted in your mind is something that you don't even realize exists until you meet someone with a different opinion.
 
 <img src="http://gyazo.com/958639726e1afd1be1c8a6b5aed05671.png">
 
 When I actually search for ESTA, this is what I get. So (I) usually open the top one. Then (I) usually open the top one, and maybe the second one too. I would never open a sponsored link. Why did you open it? Because it was there? It takes money to advertise. When you advertise, you are a commercial enterprise, right? It's *.com. What's an ad anyway? You pay money to buy the right to be prominently displayed. It's only natural that it's in a prominent place. The fact that it appears there only guarantees that the advertiser has paid for it.
 
 Suppose you follow the link. The following site is displayed.
 <img src="http://gyazo.com/783b4877180bd78b9ff528fbcbc768b8.png">
 
 First of all, it does not look (to me) like an official site. I feel uncomfortable when I am told that this is a government web page. First of all, there is no menu to move to the top page or other pages. It is obvious if you compare it with the real official page.
 <img src="http://gyazo.com/2fac25d0be80f87a21d1faad4a657fe7.png">
 
 Furthermore, the contents of the site start out with "Welcome to the application agency website," and then go on to say, "This is not an official government website, but a website that acts on behalf of the government (abbreviated). It is hard for me to believe that there are people who think that this is an official site. But it seems that there are actually a certain number of people.
 
 The text of the ad is simple and perhaps misleading, but it never says anything about being official. There is a link to *.gov just below the ad that says "official," which is not an ad. The ad is an ad with a different background color. Why would I click on the ad link?
 
 And, if I may add, I feel that this site is like an organization where no one is fluent in Japanese, maybe in China. For example, I would not be surprised if I send an e-mail question in Japanese and get a reply in Chinese or English. Maybe the simplicity of the text in the ads is also because they are not confident in their Japanese.
 </body>

[Hatena Diary 2009-10-26 https://nishiohirokazu.hatenadiary.org/archive/2009/10/26]