Hatena2008-09-20
code:hatena
 <body>
 *1221869236*情報科学若手の会日記
 出発
 
 -----
 
 I made a mistake. I had to go to Keisei Tikifune, but I am at Tobu line Tikifune station. I thought I didn't know how to get to Bakuro-Yokoyama, but I was at the wrong station.
 
 -----
 
 It is being overtaken by an express train in Iwamotocho.
 
 -----
 
 10:31 Shinjuku. I was told that the limited express ODAGIRI is no longer available until the afternoon; I was told that there is a bus at 11:00, but I don't know if I can take that.
 
 I searched, but I'm helpless when buses are involved, I don't know. But even if you go by train, you are recommended to change trains 6 times or some other unexplainable route.
 <img src="http://gyazo.com/238aabe74faa6110cffbb07621a2869d.png">
 
 It's hard to imagine going back to Tokyo now, so the email said.
 >||
 | 小田急 新宿→新松田 750円
 | 徒歩 新松田→松田
 | JR 松田→御殿場 480円
 ||<
 I'm not sure how long the walk is, but I'm sure it's still decent. I don't know how long the walk is.
 
 -----
 
 I'm sitting on the 11:00 express bound for Odawara, arriving at Shin-Matsuda in 83 minutes. It is a secret that I searched the time to Shin Matsudo by mistake. It takes 31 minutes from Matsudo to Gotemba. 83+31+18=132. Oops, even if walking and changing buses took only 0 seconds, I would arrive at 13:12.
 
 Funny, I checked the train arriving at Gotemba at 12:00 p.m., and it left at 9:45 a.m. from Keisei Hikifune, so I should have left 30 minutes earlier to give myself more time.
 
 -----
 
 新松田12:30
 f:id:nishiohirokazu:20080920122534j:image
 
 Numazu-bound train departs at 12:47 orz
 
 f:id:nishiohirokazu:20080920123523j:image
 Matsuda san Higashi san Yamakita san Sagami san Kaneko san I was wondering if there are many in the vicinity.
 
 I wondered what it was because the electric board above the door said it was on deadline. I thought it was something, because it said that at small stations, only the front door would open. So I collected my ticket.
 
 There is also a fare electronic bulletin board and numbered ticket issuing machine like buses. Small stations do not have ticket vending machines themselves?
 
 -----
 
 次が御殿場 @13:12
 I check the bus schedule but it probably isn't convenient, so I guess I'll take a cab. I had GoogleMap open in case the driver didn't know.
 
 I have a special egg. It's a good boy.
 
 -----
 
 Self-introduction phase. There are four people starting with "ue."
 
 -----
 
 'I became a father. Speculative execution."
 Out of order, I understand."
 
 -----
 
 <img src="http://gyazo.com/fc979611e58103783a92f2ea4f6c1d6c.png">
 
 That's new!
 
 -----
 
 I thought I should make an introductory slide.
 
 ----------
 
 Night.
 -Access to the open-air baths built this year
 --Writing access:
 --- Go to the far end of the hotel → open the emergency exit → walk through the sunken door → turn up the curtains → walk carefully not to slip on the wet floor while looking at the bathtub on the right and the shower on the left → changing room
 --Read access
 ---Open the window of the common room on the second floor.
 --備考
 --- There are only two showers, so there is easily a queue.
 ---Note that it is a mixed bath.
 
 -----
 
 I inadvertently missed TopCoder.
 
 -----
 
 It's already 3 o'clock. The discussion is getting lively, but my feet are getting cold and I have a cold, so I'm going to bed. I have to take care of myself.
 
 **1221895422*Instructions for the Young Scientists in Information Science Session
 
 The maximum matching problem in graph theory ignores processes along the way. Solve the process by setting up a physical model. If the approach speed is too fast, the rounding fails. Fly-by, Orbiter, Penetrator.
 
 The rocket's sensors have errors, of course, so if you trust the measurements and try to make the most efficient approach, you may hit a bump in error. We will collect detailed data and correct it as we approach on a trajectory that will allow us to get close enough to have the largest error. I see.
 
 The planet has a sphere of influence.
 
 They are going to observe a star and do image processing to use it as a reference for attitude control, and then do something like "Oh, it's the Big Dipper. Of course, this is just a metaphor, but I wonder if it is really done like fingerprint matching.
 
 Even if a physical model is built, there are unknown physical quantities, so white Gaussian noise is added. Repeated predictions, observations, and corrections gradually reduce the variance. Kalman filter. It is used in online FPS to correct the ping value.
 
 Astronomical Data Mining.
 
 They also use Ada and others to develop high-reliability software for spacecraft.
 
 http://render.s73.xrea.com/program.html
 relativistic ray-tracing
 
 They used UML to design Mars Rover.
 
 <a href='http://ci.nii.ac.jp/naid/110002725685/'>CiNii - Symplectic Ray Tracing : Tracking Rays in Black Hole Spacetime</a>
 
 最適軌道設計
 
 Flight Formation. They are going to actively interfere with gravity with multiple spacecraft in the future. Wow. I thought Starfleet was science fiction.
 
 There are sensors that look only at the sun and sensors that look only at the earth, and determine one's position and posture based on size and its angle.
 
 http://www.taplas.org/~hedkandi/slides/060919.pdf
 Secure compilers have a tolerance to memory rewrites caused by cosmic rays.
 
 <a href='http://ja.wikipedia.org/wiki/VDM'>VDM - Wikipedia</a>
 
 -----
 
 Cyan interesting. Oh, it's not published yet? I'm disappointed.
 
 His health began to deteriorate. Hisa is cold.
 
 -----
 
 f:id:nishiohirokazu:20080920195558j:image
 
 -----
 
 SunSPOT
 Multi-hop without writing code. Squawk Java VM is written in Java. getAccelX and others can be used to get acceleration in X direction.
 </body>
 <comments>
 <comment>
 <username>earth2001y</username>
 <BODY>This is indeed the state of affairs after leaving 30 minutes early! <BR>Come on!
 <timestamp>1221883006</timestamp>
 </comment>
 <comment>
 <username>TOKOROTEN</username>
 <body>Between Tomakomai and Chitose, I guess Yubari.
 <timestamp>1221929385</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-09-20 https://nishiohirokazu.hatenadiary.org/archive/2008/09/20]