Hatena2015-09-10
code:hatena
 <body>
 *1441851856*Speaking at the "Special Lecture on Information and Communication" at Tokyo Metropolitan University
 I gave a one and a half hour lecture in the "Special Lecture on Information and Communication", a subject distributed to first and second year students of the Faculty of System Design, Tokyo Metropolitan University.
 
 Lecture materials will be added and released after receiving the results of the survey.
 
 This time, the lecture was given by several lecturers.
 
 <blockquote class="twitter-tweet" lang="ja"><p lang="ja" dir="ltr">Tomorrow and the day after tomorrow, a gorgeous talk (<a href="https://twitter.com/mamoruk">@ mamoruk</a>, <a href="https://twitter.com/nishio">@nishio</a>, <a href="https://twitter.com/uchumik">@uchumik</a>, <a href="https:// twitter.com/unnonouno">@unnonouno</a>, <a href="https://twitter.com/hitoshi_ni">@hitoshi_ni</a>, <a href="https://twitter.com/overlast twitter "com/unnonouno">@unnonouno</a>, <a href="">@hitoshi_ni</a>, <a href="">@overlast</a>), and people outside the university are free to participate. Please do. &#10;<a href="http://t.co/ysUl44hiAl">http://t.co/ysUl44hiAl</a></p>&mdash; Tomoyuki Kajiwara (@moguranosenshi) <a href="https://twitter.com/ moguranosenshi/status/640743981819674624">2015, September 7</a></blockquote>
 <script async src="//platform.twitter.com/widgets.js" charset="utf-8"></script>
 
 Prof. Komachi tweets under the tag #tmutalks, including lectures by other lecturers. <a href='http://togetter.com/li/871540'>Special Lecture on Information and Communication, a course distributed to 1st and 2nd year students of Tokyo Metropolitan University, Faculty of System Design - Togetter summary</a>.
 
 ** Summary of my Tweets
 
 After the lecture, I tweeted a few things that I felt uncomfortable about (the "gap between reality and my understanding" if you want to express it in the "language" I used in my lecture) during the Q&A and chat after the lecture and after listening to the other lecturers, so I will reprint them and make some additions.
 
 ■ On the truth of the phrase "connections are important
 
 You mentioned several times that "to sum it up in one word, connections are important," but I personally don't use the word "connections" very often. I have been thinking about what created that gap:
 
 When I was a student, I hated old men who said "connections are important. Now that I am an old man, I understand what they were trying to convey. I now think that there was a discrepancy between my interpretation of the word "connections" at the time and theirs.
 
 At the time, I saw "connections" as something determined by luck, like having great parents. However, there is no way that an old man who gives advice to students would say that such "things that cannot be done by one's own efforts" are important. They are talking about "connections that can be made through effort. How are these made?
 
 Here's how to make it: "Befriend people. Befriending them in the past will help you, but messing with them in the past will make them bounce back." The "connections" that will help you when you are in trouble cannot be made by laughing and exchanging business cards. It is made by taking the initiative to help others. https://t.co/LToipAZb7e
 
 (Ref: Give and take starts with giving <a href='http://d.hatena.ne.jp/nishiohirokazu/20110309/1299598527'>To stop slash-and-burn agriculture --- New Graduate Preparation Calendar Spring 2011</a>)
 
 So I think what Osan meant by "connections are important" was, to put it in a way that was easy for me to understand at the time, "Help the people around you so that they will help you when you are in trouble, and that is important. No one taught me that much, though.
 
 
 ■ "Let's jump on the bandwagon"
 
 I thought that, as with "connections," there might be a discrepancy between the interpretation of "connections" among males and among students, so I wrote a few words about the phrase "let's jump on the bandwagon," which was probably mentioned in id:overlast's lecture:
 
 I am concerned that "let's jump on the bandwagon" is also a rather high context way of putting it. I assume that the thesis that "mathematics is important" and "the more abstract the knowledge, the wider the range of application," is the prevailing tone, and "let's jump on the bandwagon" dares to be the antithesis of that, doesn't it?
 
 Knowledge at a higher level of abstraction has a wider range of applications, and the importance of such knowledge increases as one gets older. Old men are acutely aware of the need for such knowledge in their daily lives, which is why they give advice to students such as "college math is super important. On the other hand, abstract knowledge is difficult to apply unless it is connected with experience, and it is difficult to maintain motivation to learn it.
 
 Based on this, "let's jump on the bandwagon" is a useful strategy for young people. In a battle between experienced old men and young people, the young people are basically at a disadvantage, but because the difference in the starting line for trendy items is small, the young people with more physical strength and time at their disposal will have the advantage. The strategy of winning on an advantageous playing field and capturing attention, achievements, and connections (before they are taken by the old men) is suited to the young.
 
 On the other hand, if you get caught up in the success of that "fad strategy," you will become jittery. My first book was a book on Jython, which was a success in that I had a track record of publishing books, but I personally interpreted it as a failure in the choice of subject matter because the speed at which the content became obsolete exceeded my expectations. This strongly influenced my choice of subject matter for the second book.
 
 (Written with the goal of not becoming obsolete after five years, "<a href="http://www.amazon.co.jp/gp/product/477415654X/ref=as_li_ss_tl?ie=UTF8&camp=247&creative=7399& creativeASIN=477415654X&linkCode=as2&tag=nishiohirokaz-22">The Technology Behind Coding: Programming Manners Learned from the Origins</a>")
 
 Well, I said something like "strategies for young people to fight against old men," but when I was a 33-year-old old man and was asked to publish a book on the trendy word2vec, I chose the strategy of "jump in and establish a track record," now that I think about it. I can interpret it after the fact that I adopted the strategy of "jumping on the bandwagon" because I couldn't compete with people like PFN, whose main business is machine learning itself, in terms of the amount of accumulated knowledge if I explained the broad theme of machine learning.
 
 To backtrack a bit, "let's jump on the bandwagon" is useful as a strategy for young people not only as a strategy against old men. Because it is a field with little accumulation, the time to realize what others have not done is short. Because it is a high-profile field, the probability of getting feedback is high. In other words, the learning cycle is faster.
 
 I learned the concept of "fast learning cycles" not actually from an educational book, but, perhaps surprisingly, from a book on venture management. <a href="http://www.amazon.co.jp/gp/product/4822248976/ref=as_li_ss_tl?ie=UTF8&camp=247&creative=7399&creativeASIN=4822248976& linkCode=as2&tag=nishiohirokaz-22">Lean Startup</a>. Going back, this is one of the factions in management strategy, and I wrote about it in my Cybozu-style manuscript, which will be published soon.
 </body>

[Hatena Diary 2015-09-10 https://nishiohirokazu.hatenadiary.org/archive/2015/09/10]