Hatena2014-01-23
code:hatena
 <body>
 *1390486128* I passed the 3rd class Intellectual Property Management Technician
 Last year, I studied intellectual property and felt I understood a lot about it. But as I explained in <a href='http://nhiro.org/kuds2013/'>last summer's lecture material</a>, "I feel I understand" is just a hypothesis. Without verification, you will not know if you really understand.
 
 So I looked for a way to verify my understanding. There was also the idea of a patent attorney exam, but I thought that this is a national qualification to undertake intellectual property applications and other work as a business, and it would be a bit over speculative for my case, as I don't do that kind of work.
 
 Intellectual property management technicians, on the other hand, are
 
 >>
 Intellectual Property Management Technician is a national certification that certifies competence in intellectual property. Because its main purpose is to prove competence, it is not legally granted an exclusive practice (like a patent attorney)." http://www.kentei-info-ip-edu.org/howto.html#a002 Parentheses are assigned by the author
 <<
 
 So I thought it was a perfect qualification to check if I understood it.
 
 ** Impressions after taking the test
 
 Scope: http://www.kentei-info-ip-edu.org/library/pdf/saimoku03.pdf
 
 To be honest, as an IT engineer, I didn't find the seed law knowledge very useful. I think it would be better to remove it and instead include the domain provisions of the Unfair Competition Prevention Law or something like that, but I guess it is not that much of a problem since the Seed and Seedling Law is not very heavy.
 
 To see how difficult it is, please refer to the past questions published here: http://www.kentei-info-ip-edu.org/exam_kakomon
 
 Level 2 and above have qualifications such as "those who have at least two years of work experience in intellectual property-related business," and I took Level 3 because I thought I would not be able to meet these qualifications. However, after carefully reading the definition of "work experience," I felt that I might be able to meet the requirements. It was only after I applied for Level 3 that I realized this. http://www.kentei-info-ip-edu.org/exam_keiken
 
 ** Thoughts after passing the exam
 
 I thought the acceptance letter would come in a white print-like thing, but I was surprised to receive something more than I expected.
 [f:id:nishiohirokazu:20140123230657p:image]
 </body>

[Hatena Diary 2014-01-23 https://nishiohirokazu.hatenadiary.org/archive/2014/01/23]