Hatena2007-11-17
code:hatena
 <body>
 *1195292852* Brain Training Today
 
 Disposal of cans and plastic bottles
 I piled the scattered books in the corner of the room.
 Some of them were reassembled into cases.
 Buy batteries for a pedometer whose batteries were dead.
 buy tissues
 buy bleach
 I saw that they sell an assortment of vegetables for one-pot dishes, so I made one-pot dishes for dinner tonight!
 Discarded sausages with an expiration date in April and tofu with an expiration date in June.
 Pots.
 The rest can be loaded into Tupperware.
 Walking to the bank. To do the bookkeeping. Right here.
 
 *1195313509*Reproducing Bad Holiday Patterns
 This week's <a href="http://d.hatena.ne.jp/nishiohirokazu/20071112/1194827164">No Holiday Pattern</a>
 
 - Staying up late the night before OR going to bed without an alarm
 -- →At about three o'clock I realized, "I should go to bed!" and go to bed.
 - Wake up after midnight OR forget to prepare food
 -- →The alarm didn't go off for some reason (now that I think about it, I think I turned off the alarm that I had set in advance "so I wouldn't forget to set the alarm" just before I went to bed, saying "I have to set the alarm" and went back to sleep.
 -- I wake up at 10:00. **but I fall asleep twice and wake up at 12**.
 -- Breakfast Bread and juice
 - Blood sugar drops and activity slows down OR you suddenly turn on the computer.
 -- You suddenly turn on your computer. I start coding. I decide that this is not good enough, so I take a bath and clean up my room.
 - It's dark before you know it.
 - Go out for dinner.
 - Blood collects in the stomach and makes you sleepy OR you start to get a headache
 -- I found myself selling pot ingredients.
 -- I bought some and made a pot.
 -- I'm sleepy.
 - I'm not working, so I go to bed around 9pm.
 -- I can't work, so I go to bed around 7:00 p.m.
 - I wake up around 25:00.
 -- I wake up around 24:00←here I am now orz
 
 - Lazy or sleeps and wakes up
 - It's bright when you come to your senses.
 - I'm tired, so I'm going to bed.
 - When I wake up, it's past midnight. Back to the top.
 -- What to do, it's going to be very reproducible...
 
 *1195314965* No slack.
 I did something productive for a change.
 - http://ja.doukaku.org/92/nested/
 
 I'll pick one that looks good from the wiki at hand and post it.
 
 I was going to make ginger tea and go to bed, but then I remembered I broke a cup today. I'm going to go to Shop 99 to buy some (do they sell it?).
 
 *1195324718*
 -The Science Girl's Instruction Manual - Hairy
 --http://d.hatena.ne.jp/gomi-box/20071109/1194613291
 
 Read the following,
 
 -404 Blog Not Found:Pride = Well
 --http://blog.livedoor.jp/dankogai/archives/50949374.html
 >>
 In order for this kind of childhood "pride" to turn into real pride, the "pride" may need to be thoroughly destroyed once.
 <<
 
 and wondered how I could break down my walls and go outside the well. Do I still have to take a leave of absence and study abroad?
 
 -Shiro
 --http://practical-scheme.net/wiliki/wiliki.cgi?Shiro
 >>
 One way is to make things, expose them to the public, and listen to criticism. Regardless of how you feel about yourself, your work is a brutally clear representation of who you are today.
 <<
 
 After all, the only way is to create things. We cannot see ourselves, but we can know ourselves by observing the mirror of "things we have created.
 
 When I look at how to write orgs with those eyes...oh, I'm not there yet....
 
 *1195324746* Specifics still in progress.
 For example, the auto-update function is designed to "submit the next entry after an appropriate amount of time has passed since the last entry's pub_date", but this pub_date is actually the date and time the entry was submitted when the entry was submitted, and the auto-submission function is designed to update it with the entry's date and time when the entry is submitted. The pub_date is designed to be updated with the date and time of the submission when the automatic submission function is used. (When automatically submitting a question, the oldest question in the pub_date is submitted, so you can, for example, slightly change the order of similar questions in a row.) The automatic submission of questions is run by cron, but it was pointed out to me that if the automatic submission of questions does not terminate properly, the server may stop due to the number of processes that are added to it. However, there was a bug in the program that prevented it from working properly, so I manually changed the state of Dan's Trie problem from "queued" to "challenge" and submitted the problem. In other words, pub_date was not rewritten... and then the automatic submission program was fixed and the subsequent problems were submitted.
 </body>

[Hatena Diary 2007-11-17 https://nishiohirokazu.hatenadiary.org/archive/2007/11/17]