Hatena2008-02-03
code:hatena
 <body>
 *1202004120* Snow?
 f:id:nishiohirokazu:20080203110155j:image
 
 No, kefir.
 
 *1202005062* Delayed evaluation
 - Can be implemented in a programming language
 - Can explain in natural language in a way that others can understand
 
 The latter is more difficult. So, I think id:amachang understands delayed evaluation (because he is able to implement it), but I don't understand what he is trying to say when I hear his explanation in Japanese.
 
 -----
 
 Writing a program without learning it is dangerous."
 To learn without writing a program is not to understand."
 What is the English text to the effect of "What is the English text to the effect of
 
 *1202005972* Shit.
 Yesterday evening, I bought thick rolls with the intention of having them for breakfast, but I ate regular bread for breakfast.
 
 *1202009383* Our Ramadan
 >>
 Leaving by night bus on the night of the 26th and returning on the night of the 28th.
 <<
 The keyboard ban trip was to take place on the schedule of
 
 I told him I'd call him after Ramadan and I never heard from him again.
 
 *1202010988* Wow!
 
 There's a pile of snow on the road that's a watery mess! I've never seen anything like this before! What should we do!
 
 *1202012173* I almost got lost.
 
 I missed the sign and got lost because the snow was blocking my view.
 
 *1202014765* Bean Roll
 http://inajob.no-ip.org/dev/mame/mame.html
 
 Too many beans!
 The beans that get caught and fall off are too cute!
 
 *1202014876* Socks
 sodden
 I should have brought extra socks.
 
 *1202017871*Udah!
 I arrived at the writing camp with my shoes wet in the snow, but I couldn't get the engine started and was sluggish.
 
 *1202021754* Dungeon RPG Certification
 http://www.atlusnet.jp/dungeon/
 
 f:id:nishiohirokazu:20080203155327p:image
 
 It is important to be able to easily post the results to a blog or mixi diary and say, "I got this result! What is the point of having no permalinks?
 
 *1202036834*spf record
 I was told.
 
 Sender ID: Setup work on the sender side - @IT
 http://www.atmarkit.co.jp/fsecurity/special/82senderid/sender101.html
 
 If you don't keep this SPF record called SPF record, you can go to 誰でもメールのFrom:を例えばwebmaster@doukaku.orgとかにして送ることができてしまう.
 
 *1202040718* Fat Asial.
 
 Thank you for providing the venue!
 f:id:nishiohirokazu:20080203211151j:image
 
 I took the picture so that it would show "Please take it home freely," but it doesn't come out clearly enough...
 
 *1202042052* Writing camp
 
 The first day goes well. The second day you are too tired to work. The same can be said for development camps, but you need an unwritten rule: don't play. We push ourselves. There should be a separate meeting for friendship and a meeting to focus on work. This time it worked out well, but both Python Hot Springs and the Unexplored Youth Development Camp fell into the easy way because the distinction between the two was not clear.
 
 *1202044633* "Push Yourself" meeting proposal
 What about calling it a "writing camp" when it does not involve overnight stays? Is it necessary to limit it to writing? I thought about it and came up with the name "Push Yourself to the Limit". What I write here is just an idea.
 
 - It is not a social gathering, but rather a meeting to make progress in a situation where everyone around you is working silently. It is not a meeting for socializing, but a meeting to push yourself into a situation where "everyone around you is working silently" and try to make some progress in your slow work.
 - Present a roadmap of what you will do and how far you will go on that day in advance. Since it takes time to make each presentation orally, each participant writes it on his/her own Lingr.
 - If you are seen opening mixi or LDR or something, is that a fine?
 - Everyone <a href="https://addons.mozilla.org/en-US/firefox/addon/4476">LeechBlock :: Firefox Add-ons</a> installed
 - First, decide on an appropriate timetable, such as 90 minutes of work and 10 minutes of rest, etc., in order to create a deadline effect in small increments.
 - Chatting is prohibited except during recess.
 
 And so on. We can have as few participants as we want, and it would be easy to hold the event if we wanted to. At any rate, we would like to do it again next week.
 
 -----
 
 http://d.hatena.ne.jp/Rocco/20080203/p1
 >>
 It is such a waste to work in silence when there are people who think the same way and are gathered together. I think it is a waste to work in silence.
 <<
 That's a good argument, but I want to do it when I have the time and the mind to do so. To that end, we want to enjoy our lives by quickly completing the "work that we tend to put off but must be done" in an efficient manner! I would like to try out a prototype of a "push-push meeting" as a framework for increasing productivity in this area.
 </body>
 <comments>
 <comment>
 <username>amachang</username>
 <body>Yes, that's right. <br>It took me a long time to understand JavaScript prototypes and to be able to explain them. <br>I mean, even now I can't explain it orz</body>.
 <timestamp>1202010240</timestamp>
 </comment>
 <comment>
 <username>earth2001y</username>
 <body>Learning and thinking without programming is partial understanding.</body>
 <timestamp>1202013384</timestamp>
 </comment>
 <comment>
 <username>shin’</username>
 <body>>"Writing a program without learning is dangerous,<br>>and learning without writing a program is poor understanding."<br>The words alone sound like Philip Marlowe's "If I wasn't hard, I wouldn't 't be alive...." by Philip Marlowe. <br>via. http://ja.wikipedia.org/wiki/フィリップ and Marlowe</body>.
 <timestamp>1202013569</timestamp>
 </comment>
 <comment>
 <username>coji</username>
 <body>Good luck! </body>
 <timestamp>1202019995</timestamp>
 </comment>
 <comment>
 <username>inajob</username>
 <body>Thanks for playing w<br>The seasonality is important! </body>
 <timestamp>1202025037</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>That's it! >earth2001y<br>But there was a first half, right? </body>
 <timestamp>1202026574</timestamp>
 </comment>
 <comment>
 <username>latchet</username>
 <body>This seems to be a parody or homage to the Analects. <br><br>To study and not think is a waste. To think and not study is dangerous. >http://en.wikiquote.org/wiki/Confucius<br>http://ja.wikiquote.org/wiki/%E5%AD%94%E5%AD%90</body>
 <timestamp>1202032329</timestamp>
 </comment>
 <comment>
 <username>TOKOROTEN</username>
 <BODY>I can't work from home without a From disguise. <br>There seem to be a lot of people who say that. <br>I mean, I am. </body>
 <timestamp>1202060514</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Learning without programming is a waste...Programming without learning is dangerous...</body>.
 <timestamp>1202085085</timestamp>
 </comment>
 <comment>
 <username>ujihisa</username>
 <body>What a SatsuBatsu</body>!
 <timestamp>1202125493</timestamp>
 </comment>
 <comment>
 <username>naoya_t</username>
 <body>SatsuBatsu has side effects on the abdominal muscles...</body>.
 <timestamp>1202430078</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-02-03 https://nishiohirokazu.hatenadiary.org/archive/2008/02/03]