Hatena2015-01-27
code:hatena
 <body>
 *1422289880*An Experiment in Discussing Computers and Kitaro Nishida
 References: <a href="http://www.amazon.co.jp/gp/product/4003312449/ref=as_li_ss_tl?ie=UTF8&camp=247&creative=7399&creativeASIN=4003312449& linkCode=as2&tag=nishiohirokaz-22">The Philosophical Essays of Kitaro Nishida <1>Place, I and Thou, and Six Others (Iwanami Bunko)</a>.
 
 he> What would you like to see happen in this conversation?
 Me> I read a paper the other day called "Place" by Kitaro Nishida, so I hope I can explain it to you and help you understand it better.
 he> What kind of day ahead is that day ahead?
 Me> previous weekend. The concept of place first appears in the paper "Place," where we begin by saying that when we say "something is," we need a place where it is "at.
 he> What happens just before that?
 I> Well, as I just confirmed, when we say that a system is established by the relation between the object and the subject, we start with the need for a place for that system. The concrete relation then is the opposition between a cognitive action that shifts in time and an object that does not.
 he> What does the subject seem to be?
 I> The image is a physical object.
 he> What does that image look like?
 I> To use Kitaro Nishida's expression, it is pure experience.
 he> What does that expression seem to be?
 I> No, expression is the translation of an abstract concept into a string of symbols in the form of nonfree words.
 he> Where is that concept?
 I> The concept is in Kitaro Nishida's head.
 he> What kind of concept is that concept?
 I> Skepticism about Western philosophy. Kitaro Nishida doubted the assumption of Western philosophy that things and minds exist separately, and then he wondered if there was anything that could not be doubted.
 He> Is there anything else about this Nishida?
 I> Wittgenstein's philosophy is divided into the early and late periods, but Kitaro Nishida's philosophy is also about overcoming the past by denying oneself.
 He> What is it that you value?
 I> It was a battle all over again. What I found valuable was the concept of place. I saw Ikujiro Nonaka mentioned as the originator of the concept of place in his paper, and I was interested in how he described it in the original.
 He> Then what happens?
 I> After reading the article, I found that Kitaro Nishida himself avoided using the word "place" in his later articles because he thought it was misleading.
 he> What should happen to that misunderstanding?
 I> Kitaro Nishida himself uses the term "general person". That is why it would be good if it were better known that place is a concept that is inseparable from the relation between the particular and the general.
 He> What would need to happen for that to be a misunderstanding?
 I> When introducing the story of the place, should we talk about the general public as a set?
 He> misunderstanding can it?
 I> Misunderstanding itself is not possible. As for whether I can do it, I'm still a little short of understanding.
 He> What do you hope will happen with that misunderstanding itself?
 me> ngkw.
 he> What happens next?
 Me> hmmm, would they ask about the relationship between the place and the public?
 he> Where is that relationship?
 I> The relation to a general person is naturally to another general person who is different from that general person.
 He> What happens when its common, different?
 me> ngkw.
 He> Is there anything else about that other?
 me> ngkw.
 he> What is the connection between the thesis and the concept?
 I> The paper will contain concepts.
 he> What happens to the paper when that concept is
 I> A concept is created and a paper is written to communicate it to others.
 he> what is that stranger like?
 Me> Student.
 He> Is there anything else you can tell us about the student?
 I> Students sometimes hold beliefs that conflict with the concept they are trying to convey.
 he> What happens next?
 I> Students read the paper and feel repulsed by the content.
 he> Where is that paper?
 I> The paper is outside the student.
 he> What happens just before that?
 I> Kitaro Nishida outputs his concept in the form of a thesis.
 he> What is the connection between that paper and Kitaro Nishida?
 I> There is a relationship between the author and the work.
 he> Where is that work located?
 I> The works are originally in Kitaro Nishida's possession, but they leave his possession and are reproduced and go to his students.
 he> What kind of student is that student?
 I> There are all kinds. From those who are themselves doing research in philosophy to those who are not. No, if we can consider anyone who is trying to read a philosophy paper to be doing research in philosophy, then we can say that they are all researchers in philosophy.
 he> What happens next?
 I> Research paper.
 he> Where does that paper come from?
 I> From Kitaro Nishida.
 he> What happens next?
 I> There may be peer review.
 He> Is there anything else about that peer review?
 I> I wonder who peer reviewed it.
 He> How do you know about that peer review?
 I> The reader cannot know who did what kind of peer review.
 he> What does that knowledge seem to be?
 me> ngkw.
 He> What is the connection between that reader and whom?
 me> ngkw.
 Is he> time the same as a transition line? Is it different?
 I> Time also changes, but I am talking about perception here.
 he> What is the connection between that transition and recognition?
 I> there is a subject-predicate relationship of shifting perceptions.
 He> Is there anything else about that perception?
 I> I am aware that "there is a subject-predicate relationship"
 he> Where does that predicate come from?
 I> Kitaro Nishida says that predicates are abstractions. When a strawberry is red, "red" is an abstraction of "red strawberry," "red apple," etc.
 He> Then what happens?
 I> There are individual strawberries as more particular entities than "strawberries," there are "colors" and "properties" as more general entities than "red"... and the increasingly generalized limit is the "transcendental predicate surface" and the "place of nothingness.
 he> Where does that place come from?
 I> The word "place" itself is derived from Plato's Timaeus, but the note says that they are not identical concepts.
 He> Where is that word?
 I> Timaeus
 He> Is there anything else about that Timaeus?
 I> There he talks about beings who imitate Ideas and create the real world, which, combined with Jewish monotheism, set the trend for the later use of Plato's ideas to authorize Christianity.
 he> What is the relationship between that authorization and teaching?
 me> ngkw.
 he> What happens to the Idea when its Plato?
 I> Plato said that the reason we know, when we see an object, that it is a dog, for example, is because there exists the idea of a dog. Kitaro Nishida's idea is that there is an "Idea of a dog," "Idea of a cat," and so on, and what is the relationship between these concrete ideas and the more abstract "Idea of an animal. And if there are various kinds of concrete ideas in this way, what is the "Idea of Ideas"?
 he> Where does that Idea come from?
 I> I don't think Plato said anything about it. Kitaro Nishida also said that there is a place for nothingness from the beginning...or maybe I shouldn't say there is. If there is X, then there must be a place for it, and the limit of that endless chain is the place of nothingness, and that's why there is "no place"?
 
 I see, just as ∞ as the destination of the act of repeating +1 is not a number, the place of nothingness as the limit of abstraction is also not a place of existence.
 </body>

[Hatena Diary 2015-01-27 https://nishiohirokazu.hatenadiary.org/archive/2015/01/27]