Hatena2016-04-14
code:hatena
 <body>
 *1460602667*TensorFlow Playground is recommended for understanding neural nets.
 It is a very good teaching tool that visualizes the weights of the network and what kind of input each neuron fires at each time during the learning process. http://playground.tensorflow.org/
 
 There seems to be a misconception about the Uzumaki dataset that you can't solve Uzumaki (linear non-separable problem) if there is only one intermediate layer, so I first introduce a picture that it can be done with one layer. I would like to mention that id:a2c noticed this before me on my timeline, for his honor.
 [f:id:nishiohirokazu:20160414114802p:image]
 
 So, then, what do you mean when you say, "I can't solve a linear non-separable problem" as often said? It is a problem set up like this. You can't just multiply the inputs by the appropriate coefficients and add them together to make the appropriate bounds.
 [f:id:nishiohirokazu:20160414115500p:image]
 
 In cases like this, adding an intermediate layer allows us to solve problems that could not be solved thanks to the fact that the intermediate layer takes care of nonlinear combinations of inputs.
 [f:id:nishiohirokazu:20160414115458p:image]
 
 
 The first data set shows the importance of feature selection. In this data set, if x^2 and y^2 are used as inputs, the problem becomes a linear separation and can be easily solved. The "x^2 + y^2 < R" corresponds to "inside radius R."
 [f:id:nishiohirokazu:20160414120112p:image]
 
 But x and y alone cannot be linearly separated.
 
 [f:id:nishiohirokazu:20160414150301p:image]
 
 So, if we add an intermediate layer, we can observe each intermediate layer sharing a bit of the problem. It would be interesting to try increasing or decreasing the number of neurons in the intermediate layer; we recommend observing one, two, or three in each pattern.
 
 [f:id:nishiohirokazu:20160414150259p:image]
 [f:id:nishiohirokazu:20160414150258p:image]
 [f:id:nishiohirokazu:20160414150255p:image]
 [f:id:nishiohirokazu:20160414120051p:image]
 
 and I think it is a great teaching tool because it allows us to tinker and try things out in a nicely visualized environment like this.
 </body>
 <comments>
 <comment>
 <username>yukoba</username>
 <body>>If you have only one intermediate layer, you can't solve vortex (linear non-separable problem)<br><br>As for the book "Learning and its Algorithms", it says that you can learn if you place <br>30 neurons (though the number of teacher data is different from the book)<br>This site has a limit of 8 neurons. This site has an upper limit of 8 neurons. </body>
 <timestamp>1460608930</timestamp>
 </comment>
 </comments>

[Hatena Diary 2016-04-14 https://nishiohirokazu.hatenadiary.org/archive/2016/04/14]