Hatena2009-02-19
code:hatena
 <body>
 *1234996622*Don't Laugh Budget Committee
 id:tokoroten経由
 
 <a href='http://www.nicovideo.jp/watch/sm6077498'>[Do not laugh] Naoto Kan's Budget Committee [09.02.04] - Nico Nico Douga (beta beta)</a>.
 
 
 I laughed. Then it occurred to me that without this kind of medium, most people would not have watched the Budget Committee. I wonder if the days of TV concentration and everyone watching TV will ever return. It will be diversified and diffused.
 
 I suddenly remembered this: <a href='http://blog.livedoor.jp/dqnplus/archives/1216852.html'>Ouch News: "TV has become boring because of the appearance of various media such as Youtube on the Internet. The current director of a TV program says</a>.
 
 **1234997657*Task Management
 The world is full of task management systems, but none of them seem to fit the bill. I've been trying to figure out why.
 Most of them make you register a task first. That's a bad idea at first. There is no way that someone like me, who has no task management skills, can easily register tasks when asked to do so. I can't think of anything when I'm asked to write down seven things. If you can do that, you can manage without a task management system by writing bullet points on a piece of paper. What you need is not a task management system that is a "great bullet list system (with a deadline reminder function).
 
 
 I think we need a task extraction support system. I don't know what kind of system would be useful yet, but for the time being, I am doing well with the recent method of writing sentences and bullet points and then putting asterisks where the tasks are feasible. If there are no □'s, it means that the breakdown has not been completed to the executable level.
 
 *1234997767*家事
 Let's not be stingy with the details," he said. Envelopes are cheap." He puts a sticky note on the envelope saying "tax-related documents". It's a waste to write directly on an envelope with a sealed opening just to classify the documents and make it unusable! (Oh!
 
 
 Over the years, I have kept various documents under the policy of "just keep them and don't throw them away" and the files for storage are about to be flattened. There are documents that we obviously don't need.
 
 
 Not cleaned up at all...got the payment records for '19. Mmmm.
 
 
 It's getting tough. I can't find at least two of the documents I thought I needed for my tax return. I'm going crazy.
 
 
 I thought I had taken all of them, so why aren't they there?
 <hr>
 
 - □ Classify and process important documents.
 -- □ Put together what you need, especially for this year's tax return. One large envelope it would alloc like that.
 - □ Clean up your room with moving in mind
 -- to be carried when moving: bed, washing machine, refrigerator
 -- Hard containers: you can carry them yourself or when you move
 -- Miscellaneous: I'll figure something out. What do we do?
 
 - □ Electricity, gas, and water are installed in the new house.
 - □ Throw away empty cans
 - □ Throw away plastic bottles
 
 - □ 地図
 - □ Summarize how to create a GAE project
 - □ Mercurialのbisectについて
 the others
 - 19 本社
 - 20 pots / debit your Rakuten card
 - 28 現住所鍵返却
 - I'll get a haircut soon (maybe next time I'm in Akihabara).
 
 *1235003927*中川財務相辞任報道
 >>
 On the same day, the BBC broadcast a video of a press conference when reporting on the decline in the Tokyo stock market, and the anchor himself burst into laughter after making a gesture as if he were slurring his words.
 <<
 
 http://sankei.jp.msn.com/politics/policy/090217/plc0902172025016-n1.htm
 
 
 What about that?
 
 **1235016331*MySQL has a trap that characters are garbled -> encoding is latin1.
 Twitter conversation, reprinted because I thought it was useful information. Icons omitted. I have arranged them in the flow of the conversation, not in chronological order (subjective).
 
 >>
 kyoheif I'm using MySQL for DB in Django, but when storing data, it spits out warnings and garbles a lot of characters: ......
 
 
 __nishio I often hear about garbled characters in Django and MySQL. I wonder if there's some kind of trap that they can easily get stuck in.
 
 
 everes @__nishio Garbled characters in MySQL are common, not only in Django.
 
 
 __nishio @everes So you're saying MySQL is a trap! !!!1 (oh)
 
 
 showyou @__nishio MySQL is latin1 in defu and
 
 
 __nishio @showyou MySQL's default encoding is latin-1... I feel like that's nothing but a trap for the non-latin-1 sphere...
 
 
 __nishio I googled and found a lot of stuff down about how to change to utf8 when I accidentally created a database in MySQL with latin1. I guess it's a trap that everyone falls into. I'll be careful when I use MySQL. (I have only used SQLite and GAE Datastore)
 
 
 __nishio Not a spoiler, but a conclusion that MySQL's default encoding is normally a trap.
 
 
 everes @__nishio I've always insisted that if you don't know better, don't use MySQL :)
 
 
 everes Don't recommend MySQL to beginners! I'm just mad at you.
 <<
 
 *1235017243* How to be as happy as you can be with just a clip and a rubber band.
 <a href='http://www.ideaxidea.com/archives/2008/03/post_436.html'>How to be as happy as you can be with just a paper clip and a rubber band anywhere - IDEA*IDEA - The Life Hack Blog of a Hundred Managers -</a>.
 
 >>
 It is an amazing low-cost way to be happy.
 <<
 
 Just looking at the commentary made me quite happy, so I thought I'd introduce it to you. If you haven't seen it yet, please do so.
 
 *1235019787* Twitter Clip
 I wish there was such a service because it was a pain to reproduce statements made by multiple people on Twitter on my blog.
 
 - 1: When you click "Start Clip" on the site, a new page is created, where you can find a bookmarklet for registration.
 -- A unique "clip ID" is issued at this time. The ID is also embedded in the bookmarklet.
 - 2: When the bookmarklet is used on a Twitter page, an "Add to Clip" button appears for each remark.
 - 3: The button executes a JavaScript that sends the permalink URL of the remark to the API, which is http://twitterclip.com/api/(Clip ID)/add/(Permalink URL)/ or something like that.
 - 4: The API crawls the received permalinks and stores them with the content of the utterance and the user name.
 - 5: If you press the publish button at the end, you will be able to see the series of statements at http://twitterclip.com/view/(Clip ID)/ or something like that.
 
 If it is public, you don't need a password and it is easy to do. Of course, instead of sending the permalink URL, you can send the ID of the comment and have it picked up by the Twitter API.
 
 I thought about it, but I don't think I have time to implement it because I have many other things I want to make, so I'll leave it here. If you want to make it, you are free to do so. I don't claim any rights.
 
 <hr>
 
 >>
 id:vantguarde protected and public are attached to a person, so I think it is different from what should or should not be made public.
 <<
 
 I see. Even if a person is PROTECTED, there is nothing wrong with making it public if that person allows it, so it may not be useful to be able to clip only conversations consisting of PUBLIC people. If that is the case
 
 - 3: The button executes a JavaScript that sends the permalink URL of the remark to the API, which is http://twitterclip.com/api/(Clip ID)/add/(Permalink URL)/ or something like that.
 
 indicates object of desire, like, hate, etc.
 
 - 3: When the button is pressed, JavaScript is executed that sends the permalink URL <ins> of the remark, the remark content and the user name</ins> to the API.
 
 to "I'm sorry, but I'm not responsible for the service provider. This modification will make it easier to publish unauthorized comments by protected persons, but it is not the responsibility of the service provider, since it is the person who published it who is at fault. It would be good if you put a disclaimer in the terms of use. The only other thing that could be done is to make it possible to delete the clipped material if there is a request for deletion from the person who clipped it.
 
 *1235039106* Garbled quiz (question version)
 Everyone says, "It's garbled! but there are many different kinds of garbled characters, so I made a quiz with 5 questions.
 
 -Q1 (Elementary): For some reason, difficult kanji characters such as "縺薙" were displayed when it should have said "Hello, world. What happened?
 
 -Q2(beginner level): Why did I see "&#227;" (~ over a) etc. when it was supposed to say "Hello, world. What happened.
 
 -Q3 (Intermediate): I clicked on a certain link in my browser and a mysterious string of text beginning with "mortar NG" appeared. What happened.
 
 -Q4(Advanced): For some reason "S?kao" was displayed when it should have said "Hello". What happened?
 
 -Q5 (Advanced): For some reason, a question mark surrounded by diagonal squares, etc., appeared when it should have displayed "File not found". What happened? For reference, the string displayed was 20 characters, and the encoding of the displayed web page was utf8. (PS: If I add the information that up to the 6th character is ? I don't mean to ask you to go that far, but...)
 
 
 Beginner to intermediate level is a level that non-programmers can encounter just browsing the Internet with a browser, and many people may be able to solve the beginner level problems. The advanced level is for non-programmers who may never have encountered such problems, but both are true stories that I have encountered. I made a code to reproduce the problem just to make sure, so it should not be an unsolvable problem.
 
 
 In the past, I think it was more common to see half-width kana than to see &#227; all over the place, but I don't think I've seen it much lately. I wonder if it is a change of the times.
 
 
 Note: I don't have any experience in mobile web development, so I didn't include pictogram-related garbled characters in the issue. It would have been interesting if it had been included. I guess "cp932 is not SJIS!" type problems are between Q3 and Q4. I didn't write about it because I thought it had already been talked about on technical sites. I wonder if it would have been better to put those problems as advanced and Q4 and Q5 as super advanced.
 </body>
 <comments>
 <comment>
 <username>TOKOROTEN</username>
 <body>That's where the technology to summarize the parliamentary proceedings comes in. <BR>http://www16.atwiki.jp/tokoroten/pages/453.html<BR><BR>The problem is that even though the people have the right to watch the Diet, they can't do their job if they exercise that right. <br>I think we need a summary that does not lean on the media. </body>
 <timestamp>1235020942</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-02-19 https://nishiohirokazu.hatenadiary.org/archive/2009/02/19]