Hatena2008-03-21
code:hatena
 <body>
 *1206071002* Sleeping in
 I forgot to set my alarm.
 
 *1206086532*RST
 When the socket is not connected, an RST (Reset) packet is sent.
 
 *1206086822* How to isolate cause by telnet when unable to connect to remote server
 http://d.hatena.ne.jp/kazuhooku/20080321/1206086299
 
 Next time doukaku.org hangs up, try this.
 
 *1206090086*tiarra
 Mwah...I lost the right to speak on the ustream server channel before I knew it.
 
 -----
 
 I rebooted tiarra and it fixed it. Hmmm. What could be the cause of the nick being changed at AWAY time?
 
 *1206097313*[Python]pyswf
 This beautiful SWF.
 http://www.swftools.org/flash/coltunnel.html
 It is made up of the 88-line Python script below.
 http://www.swftools.org/flash/coltunnel.py
 
 -----
 
 It may be surprisingly easy to make NodeBox spit out SWF since both are Python....
 
 *1206123250*Impact
 I hate the statement, "You have a lot of influence, so pull your weight," but now I see one person with a lot of influence DIS another person with a lot of influence, and it makes me shudder. If it ignites, there will be another sterile war between one industry and another.... I am afraid...
 </body>
 <comments>
 <comment>
 <username>paella</username>
 <body>This is Katokichi, who helped me at PyDevCamp2008. <BR><BR><BR>Aside from that, there was a little mistake in the original trackback article, so I've submitted a corrected comment. <br>I would appreciate it if you could read it. </body>
 <timestamp>1206089566</timestamp>
 </comment>
 <comment>
 <username>cactusman</username>
 <body>Is it legal to use the civilized tool that is Wireshark? </body>
 <timestamp>1206098958</timestamp>
 </comment>
 <comment>
 <username>Yoshiori</username>
 <BODY>I had the same problem, and when I tried not to change it when away for the time being, it was fine. <BR><BR>I haven't followed the cause of the problem.
 <timestamp>1206177233</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-03-21 https://nishiohirokazu.hatenadiary.org/archive/2008/03/21]