Hatena2007-10-19
code:hatena
 <body>
 *1192790436*I can't read the air.
 
 I thought it was okay because it was only raining lightly, so I went out and it started to rain heavily.
 
 *1192790532*Tenya's new menu
 
 Ah, oyster season!
 
 *1192806236* How to write today
 
 I almost missed the last train. The word "hash" has a different target behavior in the context of tamper-proof and in the context of hash table implementation. I googled "hash function" but couldn't find a good explanation.
 
 The basic premise of the former is that it is too expensive to send the same content again for comparison to make sure it has not been tampered with. Therefore, the hash function is designed to be less prone to collision. On the other hand, the latter assumes that it is easy to compare the contents themselves. Therefore, the hash function does not have to work so hard, but instead needs to anticipate the possibility of collisions. But thanks to this, it is possible to avoid judging different things to be the same.
 
 *1192807480*新機能
 
 I would like to have a function to filter and display only the comments by specifying a list of comment IDs. I will create it on Monday.
 
 *1192814424*phpspot
 Everyone is shouting about phpspot methods and such - for those of us who don't believe in God.
 http://d.hatena.ne.jp/Isoparametric/20071018/1192713353
 
 in Tokyo
 
 Akimoto@Cybozu Labs Programmer Blog: Maybe phpspot people shouldn't talk about regular expressions
 http://labs.cybozu.co.jp/blog/akky/archives/2007/10/phpspot-bad-regex.html
 
 And.
 
 It's awful that both Django and Turbogears are made in PHP.
 Can someone please tell him about search engines, Wikipedia, etc. (> ___)
 
 The regular expression matching the IP address is
 
 >||
 /^(([0-2]*[0-9]+[0-9]+).([0-2]*[0-9]+[0-9]+).([0-2]*[0-9]+[0-9]+).([0-2]*[0-9]+[0-9]+)$/
 ||<
 
 Because is also a shocking claim.
 At any rate, if you open the explanation of regular expressions, you will find "+ is one or more repetitions" in a rather obvious place, but if you understand at least that, you will think something is wrong when you see "[0-9]+[0-9]+", so this must be an intentionally put This must be a challenge to the reader.
 Or you're providing interview material for a company that you think is a little too FizzBuzz!
 
 The question should be, "This is a regular expression that says it matches an IP address, but give me an example where it doesn't behave correctly." Of course, I don't need to give you a runtime environment, just a visual inspection. I'm just eyeballing it too, but at any rate, 000000000000000 or something like that will pass, because the period is not escaped.
 
 All the mistakes that exist in phpspot, whether intended or not, are either exercises or jokes for the reader." in the footer in small letters of about 5 points.
 
 </body>

[Hatena Diary 2007-10-19 https://nishiohirokazu.hatenadiary.org/archive/2007/10/19]