Hatena2008-09-13
code:hatena
 <body>
 *1221274561*扁桃腺
 Well, the house arrest process.
 
 *1221278427*Editing TV Stations
 http://blog.livedoor.jp/dqnplus/archives/1173772.html
 >>
 Participants in "High School Quiz" express their anger in a blog.
 (中略)
 They claim that the editing has twisted the actual development of the game, and that the erroneous parts of the opposing high school they were playing against have also been edited out.
 <<
 
 Young. It's still better because the result is broadcast as a loss. At least, according to what I heard, there was a case in which first-year junior high school students at my school were supposed to compete in a quiz show with a TV producer, but the junior high school students did not win according to the scenario, so they made the audience think that the junior high school students won by filming only the scenes where the students were happy with their victory and using more of the scenes where they answered the questions correctly. I heard that.
 Even in the news, when they came to cover the introduction of the five-day workweek, they all said they were against it, but they only aired the part where my classmate, Mr. K, said, "Well, that's fine.
 I don't think the TV stations have any intention of broadcasting the facts as they are. The actors are simply providers of material. Their job is to combine the material and make it interesting for the audience.
 
 *1221282704* Your competitor is yourself.
 http://www.itmedia.co.jp/bizid/articles/0809/08/news015_3.html
 >>
 Even if the average in the world market is 70 points and my subordinate's ability is 20 points, I try to accept the fact flatly by using the phrase "it is only 20 points" and not emotionally by using the phrase "I only got 20 points. And if a change of 21 points occurs the next day, I do not accept it as "only 21 points," but acknowledge it as "one point higher than yesterday.
 <<
 I guess the comparison between myself and others can't be turned upside down by a little effort. So it is hard to see the results of your efforts and you cannot continue. On the other hand, if you compare yourself with your past self, you will see results immediately. The person you are comparing yourself to should be your past self.
 
 *1221289701*[Housework] Cold Diary
 I have a cold and have no strength (in the voice of Anpanman).
 
 f:id:nishiohirokazu:20080913160855j:image
 
 It is already 4:00 p.m., but I decided that it is not good to eat nothing since this morning, so I went to the store to buy some food, but cooking is also a pain in the ass. I have been on a diet recently, so I have been trying to eat 350 kcal per meal. 100% orange juice, for example, has 48 kcal per 100 ml, so one bottle has 480 kcal. 338 kcal for 500 ml of Pilkul, which I bought to rehydrate during a fever and for the vitamin C. But I feel that juice alone is enough calories, As for calories, juice alone seems to be enough.
 As for the vitamin B system, as usual, it is taken with Neovitamin.
 Then the question is where to get the amino acids (protein) from, since we need a lot of amino acids to make antibodies. I don't feel like eating meat. I bought eel because it is my favorite food and I thought I could eat it even if I have a fever. Also, yogurt seems to have a lot of protein. I also take Evios to replenish minerals.
 </body>
 <comments>
 <comment>
 <username>shou</username>
 <BODY>Whether you go up or not You're still the same as you were in the past...</BODY></BODY
 <timestamp>1221532393</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-09-13 https://nishiohirokazu.hatenadiary.org/archive/2008/09/13]