Hatena2009-02-10
code:hatena
 <body>
 *1234236130*ikunozama
 I heavily rewrote my previous amazonuki from yesterday's hackathon. <a href='http://ikunozama.appspot.com/'>Ichnozama - cheap items on Amazon abroad</a>. The biggest apparent changes are
 - Name changed.
 - Domain has changed.
 It is! (E)
 
 
 I had made amazonuki with amazon uk when I made it last time, but I was told that it would be bad from a trademark standpoint if the domain name started with "amazon", so I decided to make it that way. The most difficult modification, though it does not look much different, is this one, which is quietly appealing at the bottom of the page: "amazonuki".
 
 >>
 Current exchange rates: 1 British pound = 136.20 yen, 1 U.S. dollar = 91.43 yen, 1 euro = 118.92 yen, 1 Canadian dollar = 74.88 yen, 1 Chinese yuan = 13.37 yen.
 <<
 
 I hear they are cheaper in the U.S., but what about in the Eurozone? In order to respond to such comments, the database design, which had been limited to Amazon UK, was expanded to handle multiple countries. This was the hardest part.
 
 Well, it would be nice to be able to display a product side by side with how much it costs in Japan, how much it costs in the US, how much it costs in the UK... but unfortunately, the ASINs are often different and it seems difficult to find the "same product" mechanically. I had no choice but to add a search link.
 
 <a href='http://ikunozama.appspot.com/'><img src="http://gyazo.com/3906bb52f46f6d0c3df1cb8bf3742934.png"></a>
 
 The database design allows for "related products" to be attached to individual items, so it would be more useful if we could somehow find similar products in other countries. I'll think about that later.
 
 *1234280701*Python Dinner Party
 I went. I am sleepy because I did not sleep last night. I was told that I should have put up an affiliate of a genome-related book when I got fired up with a genome story. I see. He also told me that I should check how much money I can make by posting adSense, which I didn't want to do because I didn't want to make a paid account on Hatena. If it's in the red, I'll just quit, so I'll give it a try.
 
 
 Sleepiness has circled around and the tension has gone crazy and I'm getting excited in the opposite direction. This is not a good sign. After writing this, I close the machine, turn off the light, lie down on the bed and close my eyes.
 </body>

[Hatena Diary 2009-02-10 https://nishiohirokazu.hatenadiary.org/archive/2009/02/10]