Hatena2009-10-01
code:hatena
 <body>
 *1254371616* Organizing HACKS! Leverage Memo
 <a href="http://www.amazon.co.jp/gp/product/4492043373?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=4492043373">Organizing HACKS!&#8212;Organizing Tips and Habits to Clear Your Mind in One Minute</a><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as2&o=9 &a=4492043373" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" />
 
 I've been having a hard time finding motivation lately and it's been sitting in my bag for a long time, but as I was flipping through it, I read that "the night should be a time for input," so I read it quickly and easily before I went to bed yesterday.
 
 As usual, raw leverage memo:.
 <hr>
 Just throw it in without thinking" is the Lifehacker method of super-organization.
 Organization is the process design of work
 Enthusiasm because it's fun -> Enthusiasm for results -> Fun
 It's not about having a "creative job," it's about doing the job creatively.
 How creative and fun can you be with boring tasks?
 The "traditional organization method" of taking time to carefully organize is not suited to today's overwhelming increase in the amount of information.
 It is useless to have paper documents that remain as data.
 Digitize everything with a scanner: no more decision-making about which to scan
 Eliminate notational quirks: unify date formatting, etc.
 Don't worry about this and don't worry about that, try first and you will discover something unexpected.
 Reference files are the fruit of wisdom and experience: presentation materials, reference materials, logos, photos, installers to set up other machines to your specifications
 Create your own dictionary: reduced copies of illustrations
 Personalized book catalog with a reduced copy of the book's table of contents
 The advantage of paper documents is their listability. You can have the ongoing items on paper. Place the documents in a clear folder with the date and the name of the project. Then arrange them so that the most recently accessed one is in the front. Scan and discard the ones in the back.
 When making notes, put the date in the upper right corner. Post it with notes written on post-its, etc., to keep track of them together.
 Tear off the corners of the notebook for quick access to the latest.
 Keep together what you use together.
 You don't have to memorize every single possession, but you can memorize the container in which you put it.
 Small post-its and large post-its for notes
 Fix things that move around on the desk so that they can be taken without looking at them. Pen holders, etc.
 Breakthrough Partners: http://www.b-t-partners.com/dl1.html
 Leave with a clean desk and desktop.
 When you try to unify the environment, rules that were unconsciously created are clarified → refinement is possible.
 Throw the book away after you read it, the reason you can't throw it away is because you didn't write down the important parts.
 Convert book to PDF with SnapScan→read while annotating and highlighting→view in one place with "List of Annotations
 @nifty's newspaper/magazine article search can search articles from 20 years ago.
 Check to see if you are using your raw short-term memory when you say, "Tasks take too long to process and are inefficient." Your concentration is being distracted to remember things that people don't need to remember.
 Minutes Driven Meeting.
 The Pyramid Principle: Bring your conclusion to the beginning and place several supporting statements after it: McKinsey Writing Techniques
 Saving time with mail order: ASKUL also offers mail order for personal use; If you can't go out on weekends to wait for packages, it's a real downfall; convenience store pickup service
 Pattern refinement is possible because we pattern.
 Being in a daze when you can't concentrate on your work is not an improvement. The "can't concentrate" state is inevitable (e.g., after lunch), so clean up.
 Benefits of cleaning: cleaning removes dirt and **feels a sense of accomplishment**.
 Give up organizing and go elsewhere.
 If you put in a lot of information that you don't understand, your brain will get tired and sleepy before your body gets used to it.
 Input information before bed. Output before bed does not work well. Unorganized information received during the day is piled up in the brain, making it difficult to organize ideas. Input at night and output in the morning.
 It is impossible to have several outputs at the same time, you will end up confused and unable to output.
 To be creative, TODOs are necessary, especially when new ideas are needed. Think: about 6 things.
 The 1.0mm pen is suitable for bold writing; the 0.5mm pen is suitable for delicate writing.
 Raise the layers by naming them.
 Thinking is the division and integration of information. Are we dividing or integrating now?
 When making a personal business card, you need to decide for yourself what your title should be. You will see what you want to do and what you do not want to do.
 It is important to have many choices
 A person with the same abilities but with a wider network of contacts would be much more highly regarded.
 
 <hr>
 
 I thought I understood what he meant when he said, "At night, we receive a lot of information during the daytime, so we are unable to organize our thoughts. It is true that at night, I think about a lot of things incoherently, and in the end, I can't put them all together. Even in bed, I think about things and can't sleep. In such cases, I should just force myself to read a difficult book, tire my brain out, and go to bed. I thought that the reason I couldn't sleep was a lack of input.
 
 I've often heard people talk about cleaning when they are feeling unmotivated, but I've always wondered how they can motivate themselves to do something as tedious as cleaning when they are unmotivated. Apparently, the key is that it's easy and gives you a sense of accomplishment. I see. I guess the reason my room is so messy is that I don't feel that sense of accomplishment.
 
 To summarize in general, "There is too much information and not enough time to sort and organize it all. I don't have time to sort and organize it all, so I'm going to put it in a searchable digital format and store it in one place so I can refer to it whenever I need to." Or, in other words, "I don't have time to sort and organize all the information.
 
 <a href='http://www.amazon.co.jp/%E3%82%B3%E3%83%B3%E3%83%93%E3%83%8B%E5%8F%97%E5%8F%96/b?ie=UTF8&node=57083051'>Amazon.co.jp: Convenience Stores Receiving: Home</a>.
 
 <a href="http://www.amazon.co.jp/gp/product/B001QXCZ26?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399&creativeASIN=B001QXCZ26">FUJITSU ScanSnap S1500M FI-S1500M</a><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as2&o=9&a=B001QXCZ26" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" />
 
 Unfortunately, I was told that this item cannot be picked up at a convenience store.
 
 Read this next: <a href="http://www.amazon.co.jp/gp/product/4537256842?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=4537256842">Effective Time Management&#8212;Maximize Work Efficiency The Yashiro 15 Minute Work Method</a><img src="http://www.assoc-amazon.jp/e/ir?t= nishiohirokaz-22&l=as2&o=9&a=4537256842" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" />
 I'm not good at using small time slots. I have to do something about it.
 
 *1254375877* Bought a ScanSnap.
 <a href="http://www.amazon.co.jp/gp/product/B001QXCZ26?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=B001QXCZ26">FUJITSU ScanSnap S1500M FI-S1500M</a><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as2&o=9&a =B001QXCZ26" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px ! It's expensive, but if you think about it calmly, a 1% increase in productivity of a person earning 3 million yen a year is worth 30,000 yen a year, so the ScanSnap will probably run for more than a year, and productivity will probably increase by more than 1%! I told myself, "I'm not spending 30,000 yen, I'm investing it!
 
 
 You have to make a "place to put it" before it arrives.
 
 **1254393106* Epson "PX-5002" Print Experience Event
 <a href='http://agilemedia.jp/blog/2009/09/101px-5002.html'>Now coming to Thursday, October 1: Epson "PX-5002" Powerful Print Experience Blogger Event</a>.
 
 It's bigger than I thought it would be! I'm told it can print at A2, so that's no surprise!
 
 f:id:nishiohirokazu:20091001193036j:image
 
 This is the 10th time they've held a blogger event. They have held only 5 presentations for the mass media during that time.
 
 <a href='http://proselection.weblogs.jp/'>Epson Proselection Blog</a>
 
 Seiya Nakai is talking: <a href='http://railman.cocolog-nifty.com/'>Reilman Nakai's 1 iron a day!　powered by Cocolog</a>.
 
 >>
 Many people think of railroad photography as taking close-ups of trains, but I think of railroad photography as including only railroad tracks and station scenery.
 <<
 
 The interaction between the host and the instructor photographer was interesting. I had expected the event to be boring, but I'm glad it was more enjoyable than I had imagined. I heard this was the 10th blogger event, so maybe I'm getting used to it.
 
 About the positioning of PX-5002: It is the successor to PX-5800, but we have changed the model numbering because we are full of them. Why not 5001?" "It's your favorite railroad, isn't it?"
 
 Mainly targeted at photographers, studio photographers, and others who make their living from photography.
 
 Pigmented ink resists fading. Lightfastness of 45 years, lasting 200 years in an album.
 
 I don't know what the unit of ΔE is, but dye ink has 2ΔE, and pigment ink has 0.6ΔE even though it is less than 1. I don't know how much the unit of ΔE is, but it is about 0.6 even though it is less than 1 with dye ink.
 
 The story is about the difficulty in mass producing inks such as vivid magenta ink and vivid light magenta ink. The amount of ink is quite large. The image data I brought this time is grayscale. I feel sorry for the person who developed it.
 
 I've heard that it has a beautiful black color, or a deep blue etc. Three different shades of black ink are used. I heard that monochrome is also beautiful. I'm not sure what they mean by "no color blur.
 
 Black and white and square make a bad photo look good." lol
 
 LUT (Look Up Table) says that a table holds 184K ways to produce which color and how much of it!　Oh, that's not what you meant, you meant that there are 184 ways to mix 8 different inks.
 
 Imaging Workshop (Epson print software) Color management is set automatically, so you can easily output the correct colors if you use an Epson printer.
 
 <hr>
 
 This time they are going to wrap a wooden frame around it to make it look like a canvas. You don't frame it? They did it with nails and got complaints from other meeting rooms...they said it was a wooden frame they bought at IKEA for 999 yen, lol!
 >>
 The main part of the photo should be within 300mm x 440mm.
 <<
 I had thought that it was unintelligible that the data to be prepared was specified in units of 300mm x 440mm, but I guess that's what it was all about!
 
 
 The printer is even bigger!
 f:id:nishiohirokazu:20091001203427j:image
 
 
 
 f:id:nishiohirokazu:20091001205158j:image
 
 f:id:nishiohirokazu:20091001210816j:image
 
 f:id:nishiohirokazu:20091001211115j:image
 
 f:id:nishiohirokazu:20091001211435j:image
 
 I was told three times that it looked like something they would sell at IKEA.
 
 id:sakusan_net said, "Why don't you try printing it matte?" but when I make it matte, it looks kind of strange like an oil painting. Interesting.
 
 I heard that the printing cost is about 500 yen per sheet of paper and 1,000 yen for ink.
 
 
 On the train on the way home. When I saw it in the bag, I wanted to take a close-up.
 f:id:nishiohirokazu:20091001222220j:image
 
 I took it on video. Ah, the compression process ruins it, I knew it.
 <object width="425" height="344"><param name="movie" value="http://www.youtube.com/v/UjPuWOXJy3U&hl=en&fs=1&"></param><param name="allowFullScreen" value="true"></param><param name="allowscriptaccess" value="always"></param><embed src="http://www.youtube.com/v/UjPuWOXJy3U&hl=en&fs=1&" type="application/x-shockwave-flash" allowscriptaccess="always" allowfullscreen="true" width="425" height="344"></embed></object>
 
 <hr>
 The entry went up on the official blog: <a href='http://proselection.weblogs.jp/epson_proselection_blog/2009/10/post-eab3.html'>Epson Proselection Blog: PX -5002 Blogger Presentation! Part 1</a>.
 </body>

[Hatena Diary 2009-10-01 https://nishiohirokazu.hatenadiary.org/archive/2009/10/01]