Hatena2012-07-23
code:hatena
 <body>
 *1343017326*Diary of trying Gunosy
 I don't have high expectations for recommendation engines. Or rather, I think the public expects too much. A recommendation engine is not a magic wand. If you don't put in good data, you won't get good results, and if you put in garbage data, you will get garbage.
 
 That is why I have never been interested in "recommendations of articles that might be of interest to you," but the other day I learned about a service called Gunosy. This approach is to use posts on Twitter and other social media as data for estimating my interests.
 
 >>
 Gunosy is a smart personal magazine that analyzes your interests based on your Twitter, Facebook, and Hatena accounts and recommends news and articles that match your interests.
 <<
 http://gunosy.com/
 
 
 Of course, not only that, but we will also use data on which articles are viewed to improve recommendations.
 >>
 Gunosy learns which articles you are looking at and improves its algorithm; the more you use Gunosy, the smarter Gunosy gets to recommend articles for you.
 <<
 
 With recommendations that only do the latter, the recommendations are junk when you first access the site, so you will be disappointed and stop using it immediately. So I think the approach of "using the services you already use and the data you have accumulated" is very correct. So, what kind of recommendations would you make if I fed you my Twitter comments? I was curious, so I immediately registered.
 
 (The list of recommended content that was posted here has been moved to the end of the page)
 
 ** Summary
 
 It is hard to evaluate quantitatively how much of a benefit it was, but at least it seemed to have a higher density of good information than the Hatena Bookmark top page, Google News, or Twitter timeline. In the future, when I feel like looking at the Twitter TL, I will look at this one first.
 
 ** Recommended content
 
 Below is what I was recommended for on the 22nd and the 23rd.
 
 ** What was recomended on the 22nd
 - Ohloh makes code searching perfect even if Google Code Search is gone
 
 -- Let's find out what Ohloh is all about for now. (Interested)
 
 - I tried to teach programming to complete beginners with code.9leap - Diary of UEI/ARC shi3z So, I taught programming to complete amateurs with code.9leap and asked them to make a game on the spot. I taught them how to program with code.9leap and asked them to make a game on the spot. (Omitted hereafter.
 
 -- Not interested.
 
 - Whereabouts of Google's first 20 employees (+ other famous ex-Googlers)
 
 -- Not interested.
 
 - Google acquires Sparrow, a provider of email clients for iOS and Mac. Future development will be halted while support continues.
 
 -- I'm not really interested, but I may possibly come across the keyword Sparrow again, which I've seen on this topic and here. (I work for a groupware company.)
 
 - Limited until October! Enjoy beers from around the world at Ikebukuro Sunshine! - OZmall
 
 -- Not interested.
 
 - 5pb. announces production of the latest work in the "Science Adventure" series [Science Adventure Festival 2012 SUMMER] - Famitsu.com
 
 -- I'm kind of curious if there is such a thing as a science adventure.
 
 - Google has acquired Sparrow, a popular mailer for Mac and iOS! : Gizmodo Japan
 
 -- duplicated
 
 - Notes on mobile site search optimization: Is the Vary HTTP header necessary for separate URL operation? Unnecessary? ::SEM R (#SEMR)
 
 -- Not interested.
 
 - No Torrent Client Required; Download from Torrent Networks with Google Chrome "OneClick" - MOONGIFT|Blog for IT engineers and web designers with a focus on open source software introductions
 
 -- Heh, I didn't know there was such a thing. I don't plan to use it, so I won't go too deep into it.
 
 - Numerous reports of display backlight light leaks in Google's Nexus 7 Nexus series tablets | Google Pad
 
 -- Heh, I see.
 
 - Erina Mano : Erina Mano announces her graduation from Hello! Project / BARKS News
 
 -- I'm not interested. Why did you recommend it?
 
 - 4Gamer.net - Face your "other self" once again - Review of "Persona 4 the Golden," the best remake of a JRPG in history.
 
 -- Oh, well.
 
 - A story of large-scale JavaScript development -www.slideshare.net
 
 -- I see that this slide may contain some content that would be beneficial to our business. I'll read it.
 
 - Thinking about JoinTV, with Summer Wars at its core. - Blue Cloud, it is the light you saw. (Jumu Kawada) | CREATOR BLOG (Creator Blog) | HOUYHNHNM
 
 -- I forgot to get Summer Wars recorded, so I didn't end up watching it.
 
 - The Next Decade is Microsoft's Critical Moment
 
 -- Hmmm.
 
 - ShootingStar for iOS, development decided or &#8211; I'm sorry!
 
 -- What is ShootingStar? Oh, it's a Twitter client?
 
 ** What was recomended on the 23rd
 
 - All right, Dad, I'm going to get drunk and diss those who are excited about JSX&#65533; - mitamex4u's Diary
 
 -- You are indeed reading Tweet to understand that I was interested in JSX. Unfortunately, I'm not interested anymore.
 
 - Git Pocket Reference" - Glide Note - Glide Note
 
 -- The title sounds like fishing. Let's take a look at it just in case. →I read it, but I didn't have to.
 
 - Improving type error reporting in ML-like languages - Oh, you `re no (fun _ → more)
 
 -- Kitakore!
 
 - Nekoneko Blog : According to Toshio Okada, "Aiming for what you like and want to do as a profession is the worst thing you can do. Otaking quintessence.... Interest as a fundamental formation of society
 
 -- Hmmm, that's what you're saying, through and through.
 
 - 20120721 #NHK Special "Meltdown: The Truth Behind the Chain" - Togetter
 
 -- Togetter, or another sterile exchange must be repeating itself. Through.
 
 - Three Principles for Bringing Ideas to Life Scott Belsky Keynote #WDS | Lifehacking.com
 
 -- That sounds like a fishing title.
 
 - Haxe is good Haxe - GEOQUAKE Backstage
 
 -- Yeah.
 
 - Bullying is an instinct.
 
 -- Yes.
 
 - Matt Cutts comments on Google's largest ever delivery of warning messages: ... Yesterday, Google sent out a massive number of warning e-mails, sending webmasters around the world into a panic.
 
 -- Is that what happened? What exactly is the message?
 
 - Game Q&A: "Robotics Notes" - Idols passionately act out girls' gestures - MANTANWEB We asked the developers about their thoughts on game production in our "Game Q&A" series. This time, we will talk about "Robotics Notes", the third installment of the science adventure series following "Chaos Head" and "Steins;Gate".
 
 -- Hmmm.
 
 - The first step is to change the way we think... 12 Automatic Thoughts We're Prone to : Lifehacker
 
 -- I just realized that although I post my own lifehacks, I'm not really interested in the lifehack information posted by others, because there is too much of it, and the cost of filtering it is not worth it. I'm not really interested in the lifehack information that other people are sharing, because there is too much of it, and the cost of filtering it out for myself doesn't pay for itself. I think most of them adopt such know-how not from the Web, but by imitating the methods practiced by "good engineers" close to them.
 
 - Asahi Shimbun Digital: Otsu City Superintendent of Education Visits Overseas Two Days after Collecting Bullying Questionnaire - Society
 
 -- Not interested.
 
 - Announcement] "Ticket-Driven Development" Handbook to be Published: Programmer's Thoughts
 
 -- There may be someone close to you who is interested.
 
 - How to Create Beautifully Different PowerPoint Documents by Just Fixing Fonts - NAVER Summary
 
 -- Well, if you're talking about MS Gothic not being beautiful, I agree, I use Keynote, so it's completely irrelevant.
 
 - What is a Producer - Meguriai Chronicle
 
 -- haha.
 
 - Twitter's "Contact me about a deceased user" feature is rarely used | Slashdot Japan IT
 
 -- I read this through a different channel, but I didn't have to read it separately.
 
 *1343047785*11111 years old!
 Today was my 31st birthday + 1st wedding anniversary.
 
 I said, "I'm 31 years old... I'm worried that I'm gradually becoming a boring adult.
 Wife: "Hmm, don't worry, he's just a kid."
 I said, "Gahhhh!"
 
 Then: I forgot to bring the lunch box I had made to the office → I had no choice but to go eat sudadon for lunch → I ate too late and was not hungry at night → I canceled my plan to go out for French food → I'm sorry, I'm sorry, I'm sorry.
 
 Next year I will finally turn 20 in hexadecimal, and I hope to be a bit more mature by late adulthood. Thank you for your continued support.
 </body>

[Hatena Diary 2012-07-23 https://nishiohirokazu.hatenadiary.org/archive/2012/07/23]