Hatena2009-10-17
code:hatena
 <body>
 *1255752306*Re: Is a blog copyrighted?
 Re: http://loftwork.com/special/web_copyright01.aspx
 
 >>
 You are always showing pictures of your cute cat on your blog. One day, you receive an e-mail from a friend informing you that some of the photos are on a stranger's blog. You are completely delighted to see that they seem to clearly state that they were taken from your blog, and they also include a comment that says, "They are so cute, I had to introduce them.
 
 　Surprisingly, however, the friend said this.
 
 　You said, "The photos and text you post on your blog are clear works of authorship, and if you quote them without permission, you are infringing on their copyrights. You are, from a legal standpoint, infringing on my rights."
 <<
 
 >>
 Conventional copyright law is outdated
 
 　In this way, you can see how the existing copyright laws are not suited to the Internet age.
 　A person who posts a photo of his or her cat on his or her blog is treated as the "author" of a "work" of art, a photo of a beloved cat, and is subject to protection under copyright law, regardless of whether the person is aware of the fact that he or she has posted the photo. Therefore, if the work is reproduced without permission, the copyright has been infringed.
 <<
 
 >>
 A happy relationship has been established between the user who posted a photo of his cat on his blog and the user who, in good faith, featured that photo on his own blog. However, from the perspective of the current copyright law, these two people are the victim of an infringement and the perpetrator of an infringement.
 <<
 
 No, you can just go to the citee's site and write "Thank you for the introduction" when the unauthorized citation is discovered. The person who reprinted the article should not reprint it without permission. The person who reprinted it should not reprint it without permission, but just ask "Can I reprint it?
 
 It's one thing to have rights, it's another to exercise them. If the law is such that the right is not granted in this situation, it would be impossible to say to remove it even if the photo is quoted in the same way and the comment is "Here's the woman who took the picture in the mirror in the corner of this picture with her spunky face HAHAHA".
 
 I don't think copyright law is a perfect fit for the current situation, but I think the current copyright law is the right one, at least in this case.
 
 *1255789475* Pretty candlelight.
 I went to a restaurant that looked like it was lit by candles.
 
 <img src="http://gyazo.com/b808ac6975b3e39a2054eef012dc734e.png">
 http://www.flickr.com/search/?q=conicfilm&w=43547333%40N06&ss=2&s=rec#page=3
 
 There are about 3 photos mixed in that were not taken at the store. I think that the photos taken of bright things in a dark place can be converted beautifully.
 
 *1255799326* What are you taking?
 I found it hard to answer on Twitter, so here I am.
 I'll put the link first as a question version.
 
 http://www.flickr.com/photos/nishiohirokazu/4018733221/
 http://www.flickr.com/photos/nishiohirokazu/4019495294/
 http://www.flickr.com/photos/nishiohirokazu/4018725101/
 http://www.flickr.com/photos/nishiohirokazu/4019483600/
 http://www.flickr.com/photos/nishiohirokazu/4019472166/
 http://www.flickr.com/photos/nishiohirokazu/4019471626/
 http://www.flickr.com/photos/nishiohirokazu/4018168353/
 http://www.flickr.com/photos/nishiohirokazu/4007719803/
 http://www.flickr.com/photos/nishiohirokazu/4007714825/
 http://www.flickr.com/photos/nishiohirokazu/4008480888/
 
 ** 解答編
 <img src="http://farm3.static.flickr.com/2581/4018733221_f37880cd81.jpg">
 These are the jeans I wear most often.
 
 <img src="http://farm4.static.flickr.com/3514/4019495294_e2487c4d7a.jpg">
 Night view of the crosswalk and beyond
 
 <img src="http://farm3.static.flickr.com/2566/4018725101_ac29f9d538.jpg">
 街灯
 
 <img src="http://farm3.static.flickr.com/2739/4019483600_e2e9d883df.jpg">
 Signboard of a pachinko parlor
 
 <img src="http://farm3.static.flickr.com/2471/4019472166_97c723af68.jpg">
 Rows of candles in white or red containers
 
 <img src="http://farm3.static.flickr.com/2581/4019471626_3f908de42c.jpg">
 Close-up of a candle in a glass vessel
 
 <img src="http://farm3.static.flickr.com/2517/4018168353_4ecce7f355.jpg">
 Lined streetlights and their halation
 
 <img src="http://farm3.static.flickr.com/2604/4007719803_3f91a1ecca.jpg">
 Fluorescent lights at the station photographed through a net
 
 <img src="http://farm4.static.flickr.com/3508/4007714825_4396baa465.jpg">
 Lighting of a box to do entry cards or something in some building in Akihabara.
 
 <img src="http://farm4.static.flickr.com/3481/4008480888_66417fce59.jpg">
 Moon of Tehran by Hamed Saber
 </body>
 <comments>
 <comment>
 <username>calc</username>
 <body>>It is one thing to have rights and another to exercise them. <BR><BR>That's exactly right<BR><BR>If you are not familiar with the law, you may have the following assumptions. <br><br>1. Laws are effective only by their existence<br>2. Laws transcend time<br><br>1. To put it plainly, if you do not go to court and cry yourself to sleep, <br>no matter how unreasonable the crime, the law will not bring the offender to justice. <br>Also, the rights granted are meaningless if not exercised. <BR>In the case of property rights, you say, "This belongs to me," in the case of human rights, you insist, "I have human rights, so protect them," and so on. <BR><BR>On the contrary, if you do not exercise your rights, you are in a state of "tacit consent"<BR>so if you decide that there is no need to forcefully apply your rights or the law,<BR>I don't think you need to do anything in particular. <BR><BR>About #2. <BR>Laws are time sensitive. <BR>First of all, it takes time to make them. <br>It is not unusual for a law to be out of step with the current situation after it has been passed. <br>It takes time to make it known. <br>It takes a long time to get the word out, and by the time you realize, "Oh, there's such a law! <br>It takes time to apply the law. <BR><BR>It takes time to apply. You have to consult a lawyer, file a lawsuit, go to trial, and receive a judgment before it takes effect. <BR><BR>It seems that the text of the aforementioned blog assumes a world where <BR>"laws act as if they are automatic, and <BR>there is little time taken to create, disseminate, and apply them. <BR><BR>This is hardly realistic. <br><br>So, when copyright infringement actually occurs, we have no choice but to do what we can with the current law<br>by expanding the interpretation of the current copyright law, by looking for similar cases in the past, etc.<br>As a result, we are forced to do what we can with the current law. <br>As a result, when "the current law is inadequate" and "it is criminal by all accounts,"<br>then the decision is finally made to "make a new law. <br><br>"The existing copyright law is outdated" - that's right, the law always follows. </body>
 <timestamp>1255871594</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-10-17 https://nishiohirokazu.hatenadiary.org/archive/2009/10/17]