Hatena2012-07-28
code:hatena
 <body>
 *1343461885*Vicon Revue 3MP Diary
 I bought a Vicon Revue 3MP lifelog camera after @ochyai showed me the real thing and the images taken and I was fascinated.
 
 f:id:nishiohirokazu:20120726195838j:image
 
 I was surprised that it came in a bigger box than I had imagined. The customs duty of 1,000 yen will be charged on delivery, so if your wife is going to receive the package, you should talk to her about it beforehand!
 
 f:id:nishiohirokazu:20120726195917j:image
 
 The box is about twice the size of the real thing.
 
 The values of various sensors can be taken in CSV.
 >||
 In [7]: reader = csv.reader(file("/Users/nishio/Documents/Vicon Revue Data/AB54DB54-3AF2-19F9-EF16-CC77BAF91B04/SENSOR.CSV"))
 
 In [8]: set(line[0] for line in reader)
 Out[8]: set(['TMP', 'ACC', 'VER', 'CAM', 'DID', 'CLR', 'MAG', 'FUEL', 'PIR', 'FIL'])
 ||<
 
 According to <a href='http://www.pilhokim.com/index.php?title=E-Log:Status'>E-Log:Status - Pilho Kim</a>, TMP is temperature, ACC is acceleration, CLR is illumination, BAT is battery, MAG is geomagnetic I wonder what VER, CAM, DID, FUEL, FIL are.
 
 >||
 CAM,2000/01/01 00:01:05,00000018.JPG,PIR
 DID,2000/01/01 00:09:37,462
 VER,2000/01/01 00:09:37,6,1,11
 FIL,2000/01/01 00:09:37,C:\omg\code\head\lib\app\src\sensor_manager.c,14:57:03,Aug 24 2011
 FUEL,2000/01/01 00:10:05,561,4197,98
 ||<
 
 Also, where can I set the clock to be out of sync, it says if I connect it via USB it will sync.
 
 The included viewer, Vicon Revue Desktop, is a good tool for displaying manual shutter events as notes on video clips. So if you want to post a sticky note at the "now" moment in your daily life, just press the manual shutter button. Easy!
 
 The images taken are saved as sequentially numbered JPEG images. The size is 2048x1536. Is the shooting interval about once every 10 seconds?
 
 Here is a 10FPS video of my lifelog of the process of writing a mind map in ffmpeg http://www.youtube.com/watch?v=DM2YCg_ycwg&feature=youtu.be
 
 The camera is attached to my chest, so it doesn't do a very good job of capturing what's laying flat on the desk. I think it would be interesting to make a video of the process of mind mapping, so I'd like to make it look better. For now, I tried a physical hack as shown in the picture below. When the string is hooked to the hook, the camera turns slightly downward, and when it is removed from the hook, the camera becomes normal. I'll try to draw a mind map with it next time.
 
 f:id:nishiohirokazu:20120729211308j:image
 
 This article on how to use ffmpeg was helpful <a href='http://stevesgeekspeak.com/2011/04/howto-convert-lots-of-jpeg-images-into-a-movie/'>HOWTO:. Convert lots of JPEG images into a movie</a>.
 
 Oh, the physical hack resulted in a nice, whole mind map that fits on the screen http://www.youtube.com/watch?v=1o79aZ2YFe0&feature=youtu.be
 It's hard to read the back of the image because it's taken from an angle. Well, if you really want to record the process of creation, you should set up a camera with a reasonable resolution right above you. I guess it's OK to use it as a life-logging camera and also to show my desk when I am working at my desk.
 
 ** Added (2012-08-02)
 I don't like the file copying in Vicon Revue Desktop, so I wrote a script to create my own daily folders and move them there. I think it is better to use 20FPS for video. I think 10FPS is fine for people who work outside the home, but I sit at my desk all day tapping away at the keyboard, so I get bored with the lack of change. If I want to take my time, I can pause the video and watch it frame by frame.
 </body>
 <comments>
 <comment>
 <username>tokuhirom</username>
 <body>s/CVS/CSV/</body>
 <timestamp>1343612018</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>thanks!</body>
 <timestamp>1343625204</timestamp>
 </comment>
 </comments>

[Hatena Diary 2012-07-28 https://nishiohirokazu.hatenadiary.org/archive/2012/07/28]