Hatena2009-11-03
code:hatena
 <body>
 *1257217253*Re: mixi, 4200 people's information "exposed" for 3 days
 http://headlines.yahoo.co.jp/hl?a=20091103-00000155-yom-soci
 
 No, it wasn't Mixi that leaked the information, it was Rikoo... I feel too bad for Mixi.
 
 *1257246906* Hanging ads
 Pinakli? Something like a world camera?
 
 
 f:id:nishiohirokazu:20091103201357j:image
 
 *1257252205* Attention Deficient
 It's cold, cold, cold, it's already winter... Let's turn on the heat for the first time this year,
 
 
 
 I thought it was still cold, but it was air-conditioning.
 
 *1257256166*Ebios
 It says I bought it on 8/20/2009 because I bought it on Amazon last time. 2 months and 10 days. I take 30 pills in the morning because it's too much trouble to carry them around to take them after every meal. 2000 pills divided by 30 pills/day is 66.6, so I guess I sometimes miss a pill. I decided to buy 3 cases because it's too much trouble this time, and I save 1500 yen because the shipping cost is zero, which was 500 yen when I bought each case.
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as1&m=amazon&f=ifr&md=1X69VDGQCMF7Z30FM082&asins=B0013UJ4L2" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 </body>
 <comments>
 <comment>
 <username>kazushi_nakamura</username>
 <body>The problem is that the operation "looks" like a mixi service. Considering the relationship between the department store and the store inside, mixi is pretty much responsible for this. </body>
 <timestamp>1257236098</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>"Visible" is subjective, so it could be argued that because it says "Sunshine Ranch (courtesy of Rekoo)" or "report to mixi" on every display, it does not look like a mixi service, and that the reason it is visible is because IT literacy is low. So that is not the essence of it. <br><br>Although it is inevitable that the general public blames mixi, the Yomiuri Shimbun is terrible because they titled their article "mixi, 4200 people's information 'exposed' for 3 days" with the understanding that Sunshine Ranch is provided by rekoo, not mixi. If this causes the stock price to plummet and shareholders sue Yomiuri for damages...well, I don't think it will. </body>
 <timestamp>1257252753</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-11-03 https://nishiohirokazu.hatenadiary.org/archive/2009/11/03]