Hatena2009-05-13
code:hatena
 <body>
 *1242159891* Distributed version control is useful for more than just programmers.
 >>
 In Japanese-language work, there are often multiple releases of a single product, such as a serial that must be completed in a hurry, and a book that must be revised to ensure quality and fix problems, so a distributed version control This is where a distributed version control system with easy branching can be of great benefit. It is not often that I hear of anyone but myself working with a distributed version control system in the author community, but it is quite effective.
 <<
 http://pastorale.jpn.org/2009-05-12-1.html
 
 I don't know if it's easy to use on Windows or not.
 
 *1242201470*blueberry
 I bought frozen blueberries on a whim and forgot about them in the fridge when I moved out.
 
 When I looked at it now, it was swollen.
 
 
 (((( ;゜゜゜)))))
 
 
 
 
 
 We should throw it away before it explodes and wreaks havoc...
 
 *1242207510*I'm lost.
 I got off at Daimon, thinking that I would know where I was going because my destination was near Tokyo Tower, but the surrounding buildings were so high that I couldn't see anything at all. I got off at Daimon, but the surrounding buildings were too high for me to see at all.
 
 Oh, there was a tower.
 
 
 
 f:id:nishiohirokazu:20090513183911j:image
 
 
 f:id:nishiohirokazu:20090513184421j:image
 
 
 f:id:nishiohirokazu:20090513184800j:image
 
 
 f:id:nishiohirokazu:20090513184930j:image
 
 
 f:id:nishiohirokazu:20090513185042j:image
 
 *1242229640*！
 http://d.hatena.ne.jp/Voluntas/20090426/1240673825
 <img src="http://gyazo.com/5753b0eef1f3326764cb5e034f355ccd.png">
 Hey, I'm being tutored again after the fact! Well, that's okay. w
 
 *1242232786*爆発
 >>
 OHSHIMA: Nishio: "I tried to go see the explosion and got lost."
 <<
 
 It sure sounds like you're going to say something like that.
 
 *1242233703*0 trap
 >|python|
     def check_turn_end(self):
         "Make sure everyone has played their face-down cards and end the turn."
         seats = self.seat_set.fetch(3)
         if all(s.closed_card for s in seats):
 ||<
 
 Sorry, I didn't assign a model to the card this time, but instead represented it as an integer from 0 to 51... 0 is the equivalent of False...
 
 >|python|
         if all(s.closed_card != None for s in seats):
 ||<
 
 Like this.
 
 *1242234370* Designing the Most Limited Online 2.0
 I've got a local script working for now that hits the API and finishes a game, so I'll write the documentation around tomorrow.
 
 - Do not send values that can be obtained by calculation
 - Delay calculations until needed.
 - Prepare a simple format.
 - Provide a simple authentication method
 - Allow your AI to play against others in a simple way.
 
 I designed it with an emphasis on the following areas. I will write tomorrow.
 
 *1242235560* Dear Dwarf
 I can still forgive them for hiding the belt, but I am rather annoyed when they hide the jeans. Please give them back.
 
 <hr>
 
 I asked for it and they gave it back to me! Good man, dwarf! Please return the belt to a conspicuous place when you are done playing with it!
 </body>
 <comments>
 <comment>
 <username>nowokay</username>
 <body>I guess it's easier to use on Windows because of TortoiseHG, it's better than Git. </body>
 <timestamp>1242203455</timestamp>
 </comment>
 <comment>
 <username>通りすがり</username>
 <body>I started. <BR>The other day, I completely forgot that I had canned peaches, and they expanded, and then exploded violently! ToT<br>When I got home from work, I saw that the whole area was soaked in syrup and thought it would be a nuisance if the floor rotted, so I wiped it with water and dried it with a hair dryer, even though it was late at night, and my neighbor yelled at me. ^^;<br>I think you should throw away those "frozen blueberries" as soon as possible! </body>
 <timestamp>1242207816</timestamp>
 </comment>
 <comment>
 <username>通りすがり</username>
 <body>Sorry. <br>The greeting "Nice to meet you." was "Nice to meet you. I'm sorry. ^^;</body>
 <timestamp>1242207909</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I'm afraid...I'll throw it away without opening it on the next burnable garbage day.
 <timestamp>1242225993</timestamp>
 </comment>
 <comment>
 <username>from_kyushu</username>
 <body>>It's better than Git<br>Git also has TortoiseGit! <br>It's not quite perfect yet, but the versions are getting better and somewhat usable. </body>
 <timestamp>1242246759</timestamp>
 </comment>
 <comment>
 <username>nowokay</username>
 <body>Oh, I checked TortoiseGit, and it seems that the latest version is now available in Japanese. </body>
 <timestamp>1242257227</timestamp>
 </comment>
 <comment>
 <username>Voluntas</username>
 <body>よろしく:-P</body>
 <timestamp>1242271004</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-05-13 https://nishiohirokazu.hatenadiary.org/archive/2009/05/13]