Hatena2008-12-01
code:hatena
 <body>
 *1228084112*vim training day 2
 How do I copy what I wrote in vim?" I thought I could do it with *yyy, but I couldn't. I had no choice but to select it with the mouse and copy it.
 
 How do I do this after entering "def __init__(self, x, y, z):"?
 >|python|
 def __init__(self, x, y, z):
     self.x = x
     self.y = y
     self.z = z
 ||<
 Think about how easy it is to type. First, use "?selfC-jW" to move to the next word after self, "v4wy" to copy it, "p" to paste it on the next line, and...oh, wrong. That would paste it where I'm at. Well, what should I do? I think it should be "AC-jC-[p]". Then, "^" to move to the beginning, "qa" to start recording the macro, and "isC-n." to make "self.x, y, z". How do you make a comma into a new line? Would it be "C-[wwrC-j. Or "w@aw@a" with "w@aw@a"?
 
 Oh, no. There is no "= x" in "self.x = x". Let's redo it. How about "?sC-jW", then "v2WyAC-jC-[p]" to copy and paste, then "^qaisC-n." to copy that one character? Can I just use "yl"?
 
 I'm tired already, so I'll continue tomorrow.
 
 *1228087497* Food for the intellect
 In saving money, it is more efficient to cut major expenses than to cut minor living expenses. But when you get right down to it, does it make sense to cut spending on things that "won't kill you if you don't have them," such as books, in order to live a minimum life without starving? Even if the body is alive, the intellect is as good as dead from starvation. I am troubled by such comments.
 
 No, I'm talking about whether or not to buy a new MacBook.
 
 *1228149329*The lighting is too bright.
 f:id:nishiohirokazu:20081202013528j:image
 
 A sheet of translucent polyethylene is held in place with a magnet. The area around the desk remains bright and only the area around the bed becomes faintly dark. It is perfect in terms of size and brightness. The only problem is that it says "recommended for the 23 wards of Tokyo".
 
 *1228152977*23 Wards of Tokyo (Day 2)
 f:id:nishiohirokazu:20081202023649j:image
 
 21 pieces. Itabashi and Setagaya wards are forgotten. Toshima Ward Office is inside the Yamanote Line. Toshima-ku is shifted down and Itabashi-ku is placed there. Suginami ward moves to the west of Nakano ward, and where it says Suginami ward, Setagaya ward enters.
 
 The location of Taito-ku is perfect. Taito Ward is on the east side of the Ueno Plateau, so Taito Ward is on the east side of the Ueno Plateau. The position of Chuo and Chiyoda wards is reversed. Chuo Ward is not the center of the Yamanote Line. It is east of Yurakucho. The position of Adachi-ku is very wrong. Arakawa-ku comes down to around Nippori, and Adachi-ku enters to the north of it. Nerima and Adachi wards are located in the north of Kita-ku, but the north of Kita-ku immediately becomes Warabi and Toda cities.
 
 
 f:id:nishiohirokazu:20081202025719j:image
 </body>
 <comments>
 <comment>
 <username>Voluntas</username>
 <body>You may buy it. </body>
 <timestamp>1228094736</timestamp>
 </comment>
 <comment>
 <username>shou</username>
 <body>Buy it, I beg you (in a push my back kind of way)</body>.
 <timestamp>1228096014</timestamp>
 </comment>
 <comment>
 <username>elim</username>
 <body>Let's buy it :)</body>
 <timestamp>1228099892</timestamp>
 </comment>
 <comment>
 <username>ka-nacht</username>
 <body>> How do I copy what I wrote in vim?" I thought I could do it with *yyy, but I couldn't. <BR>If you mean copying to the clipboard on the OS side, you can't if :echo has('+clipboard') is 1 (=GUI version in ten). <br>There is a plugin that makes it possible to use such a version. http://www.vim.org/scripts/script.php?script_id=2098<br><br>> With "def __init__(self, x, y, z):" after typing ......<br>I would I would be oself.x = x<Esc>YpPfxryjrzfxrzry on the sticky. <br>If we are talking about a large number and want to automate it, I would do the following. <br>?x<Return>yt):put =map(split(@@, ', '), '' self.'' . v:val . '' = '' . . v:val'')<br><br><br>Special keys are more convenient for Vim users to interact with if they are written in :help key-notation. For example, "C-j" does not distinguish between "C", "-", "j", and CTRL-J (although the context may tell you). This notation is also more convenient from a Vim perspective because it is reusable. </body>
 <timestamp>1228102200</timestamp>
 </comment>
 <comment>
 <username>Youchan</username>
 <body>It's going to be bad with the heat trapped in it...</body>.
 <timestamp>1228186739</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>The invisible half is open, so it's probably fine! </body>
 <timestamp>1228190813</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-12-01 https://nishiohirokazu.hatenadiary.org/archive/2008/12/01]