Hatena2009-04-16
code:hatena
 <body>
 *1239896753* green star
 I got it and I'm going to try it out.
 
 <img src="http://gyazo.com/45900a6f0740eff45ecf435953f8c5f9.png" style="border: solid">
 
 Heh.
 
 *1239901799*Only Child - Greg Egan
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?t=nishiohirokaz-22&o=9&p=8&l=as1&asins=415011594X&md=1X69VDGQCMF7Z30FM082&fc1=000000&IS2=1&lt1=_blank&m=amazon&lc1=0000FF&bc1=000000&bg1=AAFFAA&f=ifr" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 Diaspora was recommended to me as a good choice, so while I was buying that, I also bought this short story collection. It's good, it's good. The keywords in the stories are new. Compared to the old science fiction "science of the time plus imagination," this is more interesting because it is based on recent science and technology. Well, the interestingness is subjective, and each person feels it differently. For example, just as parody stories are not interesting at all for those who do not know the original story, science fiction stories may not be interesting for those who do not know the science of the original story. After the novel was finished, the author commented, "This is a rough sketch of a novel, and if you are interested in a detailed model, please refer to Dennett's "Unraveling Consciousness" or Minsky's "Society of the Mind". After 57 pages of reading the novel, I thought to myself, "Oh, this protagonist is not 'him'! The main character is a "he"! I was shocked when I realized that "he" was the main character. Well, I won't reveal who "he" is because it would be too much of a spoiler.
 
 I don't know how much you need to know to find it interesting, but I can at least say with certainty that <a href='http://ja.wikipedia.org/wiki/%E3%82%B2%E3%83%BC%E3%83%87%E3%83%AB%E6%95%B0'>Gödel What are numbers</a>? <a href='http://ja.wikipedia.org/wiki/%E3%82%A8%E3%83%B4%E3%82%A7%E3%83%AC%E3% 83%83%E3%83%88%E3%81%AE%E5%A4%9A%E4%B8%96%E7%95%8C%E8 %A7%A3%E9%87%88'>What's the Many Worlds Interpretation</a>? If you've never heard of it before, it must not be interesting at first. Such hard science fiction.
 
 *1239906170* I can't sleep.
 Let's paint a picture.
 
 Let's paint a new one in the smallest cabinet size of <a href='http://www.yamanotephoto.jp/priceacryl.html'>photo acrylic "Yamanote Photo Studio"</a>, 115 x 165.
 
 >|python|
 >>> from math import sqrt
 >>> (sqrt(5) + 1) / 2
 1.6180339887498949
 >>> G = _
 >>> [115 / G ** n for n in range(5)]
 [115.0, 71.073908706237901, 43.926091293762092, 27.147817412475813, 16.778273881286275]
 >>> [165 / G ** n for n in range(5)]
 [165.0, 101.97560814373264, 63.02439185626735, 38.9512162874653, 24.073175568802046]
 ||<
 
 I was thinking that if I drew a bunch of pictures and pasted them together in an appropriate manner, I could create a design for a mug, but when I actually did it, I found that it was not consistent and looked sloppy. I guess you have to do a rough sketch of an idea and a rough draft separately. So I chose one of the new rough sketches.
 
 <img src="http://gyazo.com/d8c6e63af1726b3511a3b19ba03dd16d.png">
 
 
 設計図完成
 f:id:nishiohirokazu:20090417045332j:image
 Maybe this blueprint will be more popular than the one I'm trying to draw....
 
 
 Okay, let's make both the "seven divisions," which are just the lines we originally intended to draw, and the "blueprint of the seven divisions," which is a clean copy of the blueprint.
 
 Now all I have to do is to draw it at a scale of about 0 = 7mm, but it is not very interesting because I have already solved the puzzle. The process of making and solving a puzzle is art. The final work is excrement. Well, but since I'm going to go through with it, I'll finish the process of putting it into photo acrylics as I originally planned.
 </body>

[Hatena Diary 2009-04-16 https://nishiohirokazu.hatenadiary.org/archive/2009/04/16]