Hatena2009-04-28
code:hatena
 <body>
 *1240868505*Graggles
 I noticed the light shaking, but the timing of this is very laughable, "big earthquake -> gathering at evacuation center -> influenza pandemic".
 
 *1240875894*How to use carbonEmacs for commit log entry.
 I usually use carbonEmacs to write code, and I want to use carbonEmacs to enter the commit log. However, it is annoying to have the carbonEmacs process start up every time I commit, so I want to edit using carbonEmacs that is already running.
 
 I am not sure if this is the right way or not, but I used export EDITOR=carbonEmacs.sh. carbonEmacs.sh is located in ~/bin/ and the path to this directory is passed through. carbonEmacs.sh looks like this:
 >|bash|
 #!/usr/bin/env bash
 open $1 -a /Applications/Emacs.app
 echo hit enter key
 read
 ||<
 
 If you simply do "open $1 -a /Applications/Emacs.app", the process returns immediately and you get an error message "Log message unchanged or not specified", so I added "read". After editing and saving the file in carbonEmacs, press Enter in the terminal to commit the file.
 
 
 I'm sure they'll say, "Why don't you just open a shell with emacs?
 
 <hr>
 PS: I could do it normally using emacsclient.
 
 **1240876712*[GAE]What about myapp when using app-engine-patch? Talking about
 I'm writing this because I just remembered that I was asked at the Django Hack-a-thon and answered verbatim.
 
 I write this after the INSTALLED_APPS setting in settings.py.
 >|python|
 IS_LOCAL = os.environ.get('SERVER_SOFTWARE', '').startswith('Dev')
 if not IS_LOCAL:
     INSTALLED_APPS.remove("myapp")
 ||<
 
 *1240883787*Re: I'm seriously running out of money.
 >>
 I don't like working that much to begin with, so I don't want to do it much if possible. Instead, I would rather be like I've been doing, just relaxing everyday without thinking about money, and occasionally creating interesting web services that don't make any money.
 
 So I'm wondering if I can somehow create a website or something and live off of that affiliate alone, but I'm not sure if it will be easy.
 <<
 http://d.hatena.ne.jp/pha/20090427/1240833329
 
 I am! Walking about 3 years ahead of me! Just recently I was thinking <a href='http://www.go-taiwan.net/guide/inst.html'>that Taiwan's rent is surprisingly cheap</a> and the cost of food is about 1/3 of Japan's, so the "cost of living" is low, the food is delicious, the people are friendly toward Japan, it's warm, and coming back to Japan is not that hard. It's not that hard to come back to Japan, and I was thinking that it might be a good place to move to.
 
 *1240893438*Natto with an expiration date 20 days ago
 f:id:nishiohirokazu:20090428133728j:image
 
 There are three packs.
 No, kimchi over here might be a bigger problem than that.
 
 f:id:nishiohirokazu:20090428134255j:image
 
 Eating something sour makes me think, "Wouldn't that be rather good for me?" I feel like it's good for me.
 
 *1240907546*Effing Hail
 http://jiggmin.com/play_game.php?title=Effing+Hail
 
 <img src="http://gyazo.com/65322c01e3c57745d78934d4c2caee88.png">
 <img src="http://gyazo.com/d869d83ff9f8d8f100dd57119514c31f.png">
 
 *1240919899*Blender is difficult
 <img src="http://gyazo.com/da1d8a8f9def0d05e5883e3c006fc7c5.png">
 
 What's wrong with me is that I'm trying to operate 3D tools on a MacBook that has no numeric keypad or right-click function.
 
 *1240921158*sum(x^2)
 <img src="http://gyazo.com/e5815488641a216f5040904ebd2fbcb8.png">
 
 *1240922227*sum(x^2) = 1/6 x(x + 1)(2x + 1) I wanted to make
 <img src="http://gyazo.com/1b03611bcc710dc36d04c78973e133d9.png">
 
 But first, you need a little more technical skill. This doesn't convey the idea at all. If you put these three together exactly, the zigzag will stick out one step on top, so if you make a combination of the same three and stick them on top, you get x(x + 1)(2x + 1), right?
 
 <hr>
 Paint each of the three blocks with a different hue color, and change the saturation in each layer, but make the shadows a little softer or rather not, etc.
 
 *1240932918*Word notes that don't appear.
 Trade-off: For some reason, "cross" or something comes up first and then "it's not cross shading, so what is it?". If you stand up that way, you can't stand up this way.
 :binary backoff: "binary cutoff...it's not supposed to be a cutoff..."
 I'm sure there's at least one more, but I can't think of it.
 
 *1240939904*Re: 最近点検索
 <a href='http://blog.livedoor.jp/dankogai/archives/51206550.html'>404 Blog Not Found:algorithm - 最近点検索</a>
 
 I drew only a diagram.
 <img src="http://gyazo.com/ec1e628b34091ed9a0e95a9ac2a5009d.png">
 </body>
 <comments>
 <comment>
 <username>okkez</username>
 <body>You could use emacsclient or something like that. </body>
 <timestamp>1240877966</timestamp>
 </comment>
 <comment>
 <username>Youchan</username>
 <body>Nishio, you are going to quit your job and become a NEET...</body>
 <timestamp>1240894112</timestamp>
 </comment>
 <comment>
 <username>hayamiz</username>
 <body>Can't carbon emacs use emacsclient?
 <timestamp>1240902011</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I'll try it next time I commit something. </body>
 <timestamp>1240925262</timestamp>
 </comment>
 <comment>
 <username>ひど</username>
 <body>You don't have to worry about kimchi getting soggy after a few days if you use it in things like kimchi fried rice or kimchi nabe.
 <timestamp>1240946237</timestamp>
 </comment>
 <comment>
 <username>sanjapo</username>
 <body>The prices in the link are high. <BR>A typical 1R for students rents for around TW$6000 (=about 20,000 yen) and up. <br>Of course, this is in central Taipei. <BR><BR>If you pay TW$20,000, you can get a pretty good apartment. <BR><BR>Well, Mandarin is required. <BR><BR>By the way, I lived in a 3 bedroom apartment (3 people sharing) for TW$20000 for a shared room. （<BR><BR>The first floor had a lobby and a garden, and the service was as good as a hotel. <BR><BR>The elevator is also of the type where you can only enter the floor you live on with a card key. <BR><BR>I wonder how much it would cost to live in Japan.... <br>That was the point. <BR><BR>If you are employed in Japan in the form of a local assignment, it is paradise. <BR><BR>But with local employment, I think the starting salary for a college student was about 80,000 Japanese yen. <BR><BR>The annual salary of a locally hired Harvard-educated lawyer was 6 million Japanese yen. <br>Well, that seems to be the ceiling. <br>I guess that is about half of the salary in Japan. </body><br><br>I think that is the ceiling of the salary in Japan.
 <timestamp>1240962804</timestamp>
 </comment>
 <comment>
 <username>bgnori</username>
 <body>Natto is frozen. Kimchi is a matter of taste? </body>
 <timestamp>1240972877</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Oh, living in Taipei for 20,000 yen is pretty good! When I went to Taipei, I was there for an academic conference, so I had the impression that everyone spoke English, but I guess it's still Mandarin with real estate agents and the like. <br>If you can make about 80,000 yen a month from your online business for Japan, you can live like a new college graduate in Taipei. I see. </body> <br><br
 <timestamp>1241004367</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-04-28 https://nishiohirokazu.hatenadiary.org/archive/2009/04/28]