Hatena2012-09-17
code:hatena
 <body>
 *1347883189* I attended the 2012 Meeting of Young Scientists in Information Science
 I attended the <a href='http://wakate.org/'>Information Science Young Scientists Conference</a> 2012. This year's invited speakers were Mr. Hisashi Katsuya, Professional Connector, and Mr. Kunihiro Tanaka, President of Sakura Internet. Both were very interesting.
 
 
 Mr. Katsuya's lecture "Acceptance" was very recently published in "<a href="http://www.amazon.co.jp/gp/product/4093881065/ref=as_li_ss_tl?ie=UTF8&camp=247&creative=7399& I felt very comfortable with it because I had just recently learned the concept of "not thinking, but seeing what is happening in front of me as it is" in "<a href=";ASI=4093881065&linkCode=as2&tag=nishiohirokaz-22">The Practice of Not Thinking</a>". I was able to feel it very well. Universal concepts appear again and again in different places and with different expressions.
 
 After ruminating for a while, I came to this understanding by drawing on my programming language.
 
 
 When programming, error messages often appear.
 People who are used to programming may feel that the error message is "telling me I'm stupid" or "The computer won't listen to me. I'm busy! or "The computer won't listen to me! If you are unfamiliar with it, you might feel that way, but after seeing error messages hundreds of times, you won't react with emotion every time you see them. Error messages are clues to help you understand the situation.
 
 
 The same is true for the behavior of others.
 Others may say, "That doesn't make any sense," or "Don't you even know that?" When they say it, they may turn red in the face and yell something at you. But that just means that the system of "others" is outputting such error messages. There is no need to react emotionally to it by getting angry or depressed.
 
 
 Not only others, but also society and ourselves.
 If you are angry about something, it just means that the closed-source system called you has spit out a warning message in the log in response to some input. The important thing is to be able to read something from the warning message to improve the situation.
 
 
 The message, "Let's abolish preconceptions and stereotypes and accept the person in front of us as he or she is," also means, in debugging terms, "Don't assume that this code is supposed to work this way.
 
 
 When I woke up early the next morning, I happened to meet Mr. Katsuya on his way home from a walk, and he told me many stories.
 One could use the analogy here, "Not all of the output in the logs needs to be addressed. It is not important to "react to the logs," but rather "what can we read from the logs to make improvements."
 
 The other, briefly, can be summarized as "how I want to be is more important than the stereotype of 'how I should be'". My wife and I have talked about this before, and the two of us describe it as "eldest child disease. Since I am the eldest child, my parents have a strong sense of "how I should be," and the children who feel this way feel they have to play that role in order to please me. I guess I'm not cured yet.
 Mr. Tanaka also introduced an episode in which he removed "I like anime" from his profile column when he became president, explaining that there is nothing good about distorting "my personality" in that way. I guess it is the same thing.
 
 
 The other part of Mr. Tanaka's lecture was "Even if you think you want to be like this, you can't see yourself clearly. We need someone else to tell us what we are doing wrong.
 
 I'm tired of writing this much, so I'm just going to publish it.
 
 I decided to read "Algorithm Design" which was introduced as a book to learn how to think about algorithms instead of memorizing knowledge of algorithms.
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4320122178" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 Also, since brainstorming only focuses on divergence, I thought "gamestorming," which also focuses on convergence of the two, would be interesting.
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4873115051" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 </body>

[Hatena Diary 2012-09-17 https://nishiohirokazu.hatenadiary.org/archive/2012/09/17]