Hatena2012-08-24
code:hatena
 <body>
 *1345787312* Great note on Prosin!
 The <a href='http://spro2012.prosym.jp/'>2012 Summer Programming Symposium</a> notes are excellent.
 >>
 The staff will not leave the door unlocked except for the meeting time. If you are late, please call or twitter someone you know inside to ask for help. The person who goes to help you will not be able to hear your presentation. Please be aware of this.
 <<
 In a one-line description of the
 >>
 There are always people who arrive late after reception hours. There is also the cost of assigning receptionists, elevator attendants, etc. to handle late arrivals. --- <a href='http://d.hatena.ne.jp/hyoshiok/20111010#p1'>2011-10-10 - Diary of sometime in the future/hyoshiok</a>
 <<
 The cost of the system has been busted. It's a great hack!
 
 *1345797131* Advantages and disadvantages of using Facebook event pages for presentations.
 Advantages and disadvantages of using Facebook's public event page as a place for people listening to a presentation to communicate during the presentation, compared to Twitter or IRC at events where multiple people are presenting (study groups and conferences).
 
 ** Benefits
 - IRC requires setting up its own server. If you use an external freenode, you may be limited to the number of connections from the same IP.
 - Twitter comments are quickly scattered unless they are manually summarized on Togetter, etc. Facebook can do this automatically, and unlike IRC, there is no need for an IRC bot to record them.
 - It is very labor intensive to separate the comments by presenter on Togetter, but if you create a thread for each presentation on Facebook and reply to the conversation, it will automatically create a separate list for each presentation. This is easy for people to read later. Topics from multiple presentations will not get mixed up.
 - The threads for each presenter have permalinks, so it is easy to mention them on Twitter, blogs, etc. after the presentation. It is also easy for presenters to read and answer questions and discuss after their presentations.
 - Compared to the excitement on Twitter, there are no problems such as forgetting to add hashtags, distorting notations, or missing searches, and communication among the people writing is closer.
 
 ** Disadvantages of Facebook
 - Less power to PUSH presence to unrelated people compared to the excitement on Twitter (can this be done by Tweeting permalinks as appropriate?)
 - People who don't usually use Facebook much often don't turn off notification e-mails, so they are surprised at the large number of notification e-mails in their mailboxes.
 - Usability as a chat is less than IRC.
 - The link to the individual event page is a little confusing because, unlike groups, it is not expanded in the left column (press on the event and then choose from the list).
 
 ** Know-how
 - To get things going when nothing is initially written, you can do a live broadcast on Facebook.
 - The presenter and the title of the presentation should be posted first, and comments about the presentation should be written in the form of a reply to that post.
 - It is better to post the title and presenter for all presenters when there is enough time. the top post is important because the second and subsequent posts will be collapsed if too many comments are made, but it is tricky to make a mistake in a hurry because editing is not possible. It is better for one person to make them all together in the same format.
 - It is okay for anyone to search and age the thread at the start of the presentation; just mention that you need help with the ageing.
 - If you click on the time display of the top post, you will be taken to a page that opens only that thread. There is also a permalink, which is suitable for introducing the topic to others.
 
 
 ** A good idea for Twitter and Facebook.
 - It would be nice if there was a Facebook app that would say posts to one's Facebook public group on one's Twitter account with the thread's permalink. An app similar to that exists, but it tweets status changes rather than posts to the group, so it cannot be used for this purpose. It would not be technically difficult to create an app that suits the purpose of this project.
 - If some users use it, they will hear "discussions on Facebook" leaking onto Twitter. If someone is interested in hearing what is leaked, they can follow the link to see a summary of what was said on Facebook.
 </body>

[Hatena Diary 2012-08-24 https://nishiohirokazu.hatenadiary.org/archive/2012/08/24]