Hatena2012-03-23
code:hatena
 <body>
 *1332504404* Language Girls' Club 3: Python consulted Ruby about her love life.
 <a href='http://d.hatena.ne.jp/nishiohirokazu/20120316/1331906887'>Language Girls' Club: do we need both undef and null? </a>, <a href='http://d.hatena.ne.jp/nishiohirokazu/20120321/1332333583'>Language girls' group 2: do we need var? No /private? </a> sequel.
 
 ** Ruby for love advice
 
 Python: I've been struggling lately...
 Ruby: Hmmm, to what?
 Python: I wonder what kind of people I like... or...
 Ruby: Oh, that's easy! It's about having fun together! (((Ruby's "Enjoy Programming" approach <a href='http://enterprisezine.jp/article/detail/3826?p=2'>Yukihiro Matsumoto talks about the past, present and future of the "language world" (2/2)</a>))
 Python: That's not a differentiator because it's fun to get along with anyone.
 Ruby: Not necessarily, for example, oh...
 C: Sorry, the meeting went long and I'm late! (Hair fussing)
 Python: Ah... I see...
 
 
 ** C
 
 C: What are you talking about? Oh, you're having trouble with love? That's easy. It's excellence.
 Python: Excellence?
 C: Yes. You have to create an "I'm the best" situation in some area. Then, men will come to you as much as they can.
 Python: I see... to be number one...
 C: Well, then you need to get a stomach. You need to eat every day. Once you get the foundation of what you're going to need every day, you're going to be in a position to be steadfast.
 Python: Is that going to be an OS implementation language or something?
 C: That's what I mean. It's easy - a man in that situation is easy. Because he has no choice but to obey me.
 Python: (How very career woman!)
 
 
 ** JavaScript
 
 Python: (I say so, but it's not like I can implement an OS in Python... I'll have to find another platform...)
 JavaScript: What Mr. C said earlier was really interesting!
 Python: Oh, I was listening.
 JavaScript: If you monopolize the platform, it's totally powerful☆ (smiling with the confidence of monopolizing the browser)
 Python: (annoyed)
 Ruby: (annoyed) By the way, how's your sister doing? (( <a href='http://ja.wikipedia.org/wiki/ActionScript'>ActionScript</a>. See also <a href='http://ja.wikipedia.org/wiki/ECMAScript'>ECMAScript</a>. ))
 JavaScript: Well, he's fine, isn't he? But she won't go out unless she's with her pets, like Patrush or Flash...
 Ruby: I know a lot of stores don't allow pets these days, like the Apple Store and Metro. ((( Flash is not supported on many mobile devices including iPhone, iPad, etc., and Metro UI on Windows )))
 JavaScript: That's right. I'm so depressed about being kicked out of the restaurant that I've been playing video games in my room lately. I've been playing games in my room lately, but lately I've been on Facebook or something.
 Ruby: (I think ActionScript is going to get sick at this point...)
 JavaScript: Well, I can make games using canvas too.
 
 
 ** Java
 
 Ruby: Well, it's not hard to understand that if you can dominate a platform, you're on the winning side, but there's no such thing as a conveniently available platform.
 Python: I know, right?
 Java: (interrupting) If you don't have a platform, just make one!
 Python: Oh, Mr. Java...
 Java: wolla! (( <a href='http://ja.wikipedia.org/wiki/Write_once,_run_anywhere'>Write once, run anywhere</a> ))
 Python: Heeeey scary...
 Java: Well, agitation aside, it's too early to give up just because Mr. C has dominated the platform. There will always be subtle differences in what humans create. By homogenizing them, any number of platforms can be created!
 Python: Homogenization...?
 Java: Yes, JS is making a big face because of the homogenization of cross-browser libraries like jQuery! That's also platform creation through homogenization. And I am the founder of it! (bang)
 Ruby: I knew that Java-san and JavaScript-chan are good friends!
 Java:! Who the hell knew that guy... he took my name... mumble mumble mumble...
 Python: (Ruby, you're in trouble. That's a minefield.)
 Java: When people say, "Hey, can anyone write Java?" because of him, they are usually talking about JS. When people say, "Can anyone write Java?", they are usually talking about JS. (( Note: This is Java's fantasy and is not based on statistical information ;p ))) It's a nuisance!
 Ruby: (ah, is that what you mean?)
 Java: You know, it's almost like, "Class? What's that good for? Java: I don't know, I'm just not comfortable with that kind of "What's so good about classes? PHP is still much prettier than him! ((( PHP adopts Java-like "single inheritance class and multiple inheritance interface" )))
 Python: Oh, really? Surprising...
 Java: Yes! You guys! You know what's the most important thing in keeping a man in line? It's discipline!
 Ruby: Discipline?
 Java: Yes, all men are stupid. If you let them do what they want, they are bound to make mistakes. That's why you have to set rules and make them walk on a certain track. First of all, create a class. Type declarations. No multiple inheritance. No need for global variables.
 Python: I see... you make it easier to manage men by reducing their freedom...
 Java: Yes, when you have as many assi-messy-mitsugu as I do, it's a lot of work just to keep track of them!
 Python: (Wow, what a bubble thought this guy has about "the more men the better"...)
 Ruby: (This is the kind of thinking that makes you say "with a head count" or "in man-months"...)
 
 
 ** PHP
 
 Another day...
 
 
 Python: Java's philosophy still doesn't feel right to me.
 Ruby: And you're all private.
 Python: (-_-#)
 Ruby: But what I didn't expect to hear from Java is that he seems to think highly of PHP.
 Python: Yeah, I thought PHP was a bit more laid back like JavaScript.
 Ruby: We haven't talked about this much so far, but you might be surprised how helpful it can be.
 Python: Yes, that's right.
 
 
 Python: ...so can I get some advice on love?
 PHP: Well... the important thing is to make them feel safe.
 Python: A sense of security?
 PHP: People are insecure. If you ask them to do something difficult, they will run away. The first step is to be gentle.
 Python: I see.
 PHP: It's like recruiting for college clubs. It's important to make people feel like they are accepted into the club. In the case of programming, the first step in the process of creating something that works is to make it short and easy to understand.
 Python: Oh, I see... Ease of understanding. I think that is important, too.
 PHP: Right. And then there's the excellence that Mr. C was talking about. You have to be superhuman to excel at everything. Excellence and specialization go hand in hand. You have to specialize in your domain and be number one in it. In my case, it was "shortest path to web apps.
 Python: Okay, so you pick a field, and
 PHP: It is impossible to excel at everything. So once you have a target, you have to drop everything else. For example, you get an error when you concatenate a string and a number. But that is a design that forces you to understand that numbers and strings are two different things.
 Python: Eh, I never thought of that...
 PHP: It's a shorter moving line to get the web app working if you combine them without making an error. Maybe you think it's okay to distinguish between numbers and strings, but you're forcing me to distinguish between tuples and lists, between strings and unicode strings, and all sorts of other annoying distinctions.
 Python: Hmmm, I'm of the "explicit is better than implicit" mindset, so I don't really want to convert implicit...
 PHP: That's just your ideal. How many men are looking for that?
 Python: Sure...
 PHP: Isn't it right to provide what men actually want quickly and easily, rather than chasing an ideal, assuming that "this is what men would like"?
 Haskell: ...filthily....
 
 
 ** Haskell
 Haskell: I don't agree with PHP's claims at all! Chasing ideals is the right thing to do!
 
 
 Python: (hiss hiss hiss Haskell-chan, did you have a boyfriend?)
 Ruby: (hissing) See, I thought you regretted allowing your boyfriend to use unsafePerformIO.
 Python: (hissing, hissing, hissing... Oh, I see!)
 
 
 Haskell: Do you really need to be popular with many people to begin with? It is enough to have a handful of friends who understand you and support you in achieving your ideals!
 Python: Well, you may have a point.
 Haskell: Only when you combine the uniqueness of being one-of-a-kind and the rejection of those who can't keep up with you, can you create a strong bond with others! Only when these are combined can a strong bond be formed!
 Python: So by pushing away, you're leaving only the enthusiastic.
 Haskell: You've crossed the chasm. The more fans you have, the lower the average level of enthusiasm. It's obvious.
 Python: Okay...
 Haskell: And yet you are trying to be nice to all your fans. You're a beauty on all sides. That's why you talk in your sleep about how you don't know what to do. Do what you want to do, and discard those who don't follow you!
 Python: mmmm, I see... how can I...
 Haskell: Has Python recently made it possible to annotate function arguments and return values? We should make type declarations mandatory as it is.
 Python: Type Declaration or...
 Haskell: Also, all the objects should be coroutines, all the lists should be generators, and the Erlang VM bytecode should be spit out after type checking at compile time.
 Python: Well, I'm not sure I want to get into that market...
 Haskell: More than half of Erlang fans are disappointed with the grammar, so you can make love to them by claiming "The grammar is beautiful! You can make love to them by claiming that "the syntax is beautiful! Haskell is definitely better than Erlang in this respect. You can fight and crush each other in a big fight. After that, I'll join in with Parallel Haskell.
 Python: What the heck, it's for your own good!
 Haskell: Of course. Who would give serious advice to a language that is more popular than yours? You are an idiot.
 
 
 ** Summary
 
 Python: So I've talked to a lot of people, but I still don't know what I'm supposed to do...
 Ruby: You don't have a killer app like Rails. Oh, did I have one? What was it? Soap?
 Python: Zope? Well, I think it's not bad that both Zope and Django can easily create web apps with admin screens. I think Rails is getting more attention in the world.
 Ruby: Well, why don't you move your focus to something that's not a web app? You know, like Civilization, or something that's built into a game. What about that?
 Python: Hmmm... I think I'll have to get into a real battle with Lua on that front.
 Ruby: Well, what about Blender, Inkscape, and other artistic things like that?
 Python: hmmm... looks kinda unstable...
 Ruby: What about NumPy, SciPy, and other scientific stuff?
 Python: I get sleepy when I look at complicated equations...
 Ruby: Maybe you should lose some fans. (-_-#)
 Python: eh
 
 ** Summary of Reactions
 
 - Assembly grandma: "We never thought about love because we knew the man (chip) we were going to be with from the time we were born" (by id:raitu thanks!)
 
 - COBOL auntie: "If you keep the banks and people with money in check, you'll be eating for a long time. Good luck." (by @town_b thanks!)
 
 - PHP is in full bloom, so let's color him your own color with thorough configurations. But be careful, sometimes he will change his character and fight back with a VerUp. (by @KentarouTakeda thanks!)
 
 - Ruby-san, who is ready to battle with Lua-chan (mruby-RiteVM), is paranoid about her reaction: "Then I'll go for it..." (by id:taninsw thanks!).
 
 - Vim script-chan: "It's important to dominate the platform!" (by @thinca thanks!)
 -- EmacsLisp-chan "eh".
 
 - I thought Ruby-chan's view on love was "just dye the other person your color (in the Babel-17 sense)" (by id:yowa thanks!)
 -- Ruby "I'm not sure if I can get that across by saying that..." ref. <a href='http://blade.nagaokaut.ac.jp/cgi-bin/scat.rb/ruby/ruby-list/16610'>[ruby-list:16610] Opening session report: Ruby Workshop in 9/4.</a>
 
 - I would like to see C++, Smalltalk and lisp added to the list, as it is not enough that the only unique one is Haskell. (by id:coolstyle thanks!)
 - Lisp women's meeting was also planned by young Clojure... Scheme said, "It's impossible! There are too many people!" Common Lisp "There are as many programmers as there are programmers..." Clojure "But it's a good opportunity for me to talk with my seniors..." Emacs Lisp "But they only understand car/cdr/cons, don't they? Clojure "What is car/cdr? Sc&CL&EL "This is why young girls these days..." (by @dowhileloop thanks!)
 
 - PHP, which is in charge of the punchline, looks rather decent. wPython is being pushed too hard in the natural language processing field. And C# is still dissing Java's sister as having stopped evolving?  (by @kiichi543321 thanks!)
 - Mr. java may not just appreciate Mr. php, but may think "this guy is a degrading java" or "if he is not enough, he will come to me" (by id:akitsukada thanks!).
 - The idea that "explicit is better than implicit" allows you to become a loose-fitting, popular cutie is about as far-fetched a strategy as nail care is for appealing to men (by id:dekaino thanks!).
 -- Python: "Why doesn't everyone just expose more of SELF?"
 -- PHP: "Python, don't be so open about it, or men will be attracted to you. Men think 'idols don't fart' or something like that."
 
 ** Postscript
 
 In looking at the differences between the various languages, the view of men is still more important than makeup and accessories - right? So I asked Python-chan, who has been losing herself lately, to give me some advice on love.
 
 
 If you are interested in comparing languages, I recommend "Web+DB Press Compilation" which contains 60 PDFs in one volume, including "Fundamentals of Language Design" I wrote.
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4774148318" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 </body>
 <comments>
 <comment>
 <username>s025236</username>
 <body>>Ruby: I know a lot of stores don't allow pets these days...like Apple Stores. <br>>JavaScript: Yes, that's right. I'm so depressed about being kicked out of the store that I've been playing video games in my room lately. <br><br>I've been playing games in my room lately. <br>Did you know that Air apps can't be registered in the market? </body> <br><br>I'm not sure if the Air app can be registered on the market.
 <timestamp>1332522213</timestamp>
 </comment>
 <comment>
 <username>tka2</username>
 <body>Ruby and python are both too general-purpose, and there is no firm "this is the language to use if you want to do this". <BR><BR>I think it is important to note that Python is becoming the default scripting language for Linux-based software, replacing Perl. <BR><BR>And, as expected, there is no Nyu.
 <timestamp>1332542375</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>>I thought Air apps could not be registered in the market? <BR><BR>I think the intent is that non-petable = no support for Flash or other plug-ins. I'll add that since it seems to be difficult to understand. </body>
 <timestamp>1332559723</timestamp>
 </comment>
 <comment>
 <username>zyzy</username>
 <body>I started with blender and now I'm a python fan. <br>After all, the wide base is its strength as a gateway</body>.
 <timestamp>1332563130</timestamp>
 </comment>
 <comment>
 <username>fuga</username>
 <body>It's kind of erotic to performUnsafeIO in this context. </body>
 <timestamp>1332571754</timestamp>
 </comment>
 <comment>
 <username>kazkaz03</username>
 <body>It took me a few minutes to realize that ActionScript is javascript's little sister. </body>
 <timestamp>1332654482</timestamp>
 </comment>
 </comments>

[Hatena Diary 2012-03-23 https://nishiohirokazu.hatenadiary.org/archive/2012/03/23]