Hatena2007-11-19
code:hatena
 <body>
 *1195443155* imitating a bird
 Amazon.com: Math Puzzle: Imitating Birds: A Dream Bird Tale of Delightful Puzzles and Binding Child Logic: Book: Raymond Smullyan, Raymond Smullyan, Tsuyohisa Abe, Osami Fukushima, Toshio Kurosawa, Yutaka Yamaguchi
 http://www.amazon.co.jp/dp/4627019017/ref=sr_1_7?ie=UTF8&s=books&qid=1195442761&sr=8-7
 Amazon.com: To Mock a Mockingbird: Western Book: Raymond M. Smullyan
 http://www.amazon.co.jp/Mock-Mockingbird-Raymond-M-Smullyan/dp/0192801422/ref=sr_1_8?ie=UTF8&s=english-books&qid=1195442869&sr=1-8
 Japanese books are four times the price of Western books.
 
 *1195443710*Shiritori Sphere
 First Step: Shiritori no sphere - Masayuki Hiyama's Chimera Breeding Journal
 http://d.hatena.ne.jp/m-hiyama/20060821/1156120185
 
 >>
 Here is one specific example of a sphere that can be understood without prior knowledge.
 <<
 
 Easy to understand.
 
 *1195443867*I thought I tested it.
 >>
 I didn't get any errors through the test, but for some reason I get errors when I view it in the browser.
 ...
 I get it! I understand the reason!
 When you put together a test that does not require the database to be reset.
 def all_test(self):
 Test method does not start with test_, so it is not executed (><)
 I thought I had been testing it until now, but in fact it was hardly tested orz.
 <<
 
 Too stupid orz
 
 Because of this, I was getting 1200 error mails on Monday because I didn't go through the errors when I accessed /lang/. */. I had a stack of 1200 error mails on Monday because I didn't go through the error when I accessed /*/. orz
 
 *1195449191*Programming Magick
 Test-driven development is a tandem attack, summoning a stand (yeah).
 
 If a bug is found, the first thing to do is to launch a stand (test case) and launch a flurry of upper-middle attacks to get the opponent to stand guard, then make a big crouching attack on the body side while the opponent is standing guard.
 
 When refactoring, you're going to make it difficult to orient the guard between the stand (test case) and yourself and your opponent.
 
 I think that's a fighting game, not a magic game.
 
 *1195455275*The Battle of the Three Fronts
 Right now in my mind CSS, linear programming and monads are each screaming "learn me".
 
 *1195459415* How fun to write org.
 http://ja.doukaku.org/88/
 I thought it was impossible to prohibit both arithmetic operations and strlen...(I thought it would use something only in Haskell's library), but I solved it!
 http://ja.doukaku.org/comment/4235/
 I am very happy.
 
 I had been submitting the theme by myself, or checking the sent-in items before submitting them, so I was more on the "management" side than a "participant". I was very happy to be able to read the contents and challenge for the first time as a participant.
 
 I guess now that users can post their own themes, I don't have to sit on the sidelines and watch everyone else play with their fingers crossed. That's wonderful.
 
 *1195460366* I know when I use it.
 I find it hard to use diff.
 
 *1195471948*cssutils - CSS Cascading Style Sheets parser and library for Python
 http://cthedot.de/cssutils/
 There was a parser.
 Most of them are there.
 Why no PHP parser?
 </body>

[Hatena Diary 2007-11-19 https://nishiohirokazu.hatenadiary.org/archive/2007/11/19]