Hatena2008-12-03
code:hatena
 <body>
 *1228276649*pyspa challenge1 解答編
 http://d.hatena.ne.jp/nishiohirokazu/20081129/1227952375
 The solution section of the
 
 But I think the answers to the first and second questions have been sufficiently explained in the entries below and elsewhere, so I'll just talk about the third question.
 http://d.hatena.ne.jp/ama-ch/20081129/1227970925
 http://d.hatena.ne.jp/CortYuming/20081203/p1
 
 
 
 まずはPEP20(Zen of Python)を見る。
 http://www.python.org/dev/peps/pep-0020/
 Bilingual translation for some people who may not like English.
 http://d.hatena.ne.jp/kakatofu/20080322/zen_of_python
 
 It's one of the three easter eggs in Python (as far as I know), and when you import this, you get a poem called Zen of Python. The only other question is whether or not you associate "this" with "libraries that seem to produce strings with -m." Well, 1/4 of the participants of pyspa, where this question was made, did not associate this, so you can participate even if you cannot solve the third question (oh).
 
 Personally, I think that the problem-solving ability to do it by exploration when you don't know THIS should be valued more than knowledge about THIS.
 
 *1228280795* Environment for doing CUDA
 選択肢1：新MacBook
 - GeForce 9600M G: http://journal.mycom.co.jp/news/2008/10/15/062/index.html
 -- 16SP(Stream Processor)
 - 2.0GHz CPU, 160GB HDDで15万
 - 2.4GHz CPU, 250GB HDDで19万
 - x High
 - o Can be carried around and demonstrated
 - x? Doesn't it get pretty hot?
 
 Option 2: HP ML115 + Gravo
 - HP ProLiant ML115 G5: http://h50146.www5.hp.com/products/servers/proliant/ml115g5/
 - 2.7GHz CPU is the cheapest line
 -- 15,000 yen to 50,000 yen
 - Grabber: 15,000 to 30,000 yen
 - 9600GT http://www.nvidia.co.jp/object/geforce_9600gt_jp.html
 -- 64SP
 -- 650MHz core clock, 1625MHz shader clock, 900MHz memory clock
 -- 512MB memory
 - 8800GT http://jp.nvidia.com/object/geforce_8800gt_jp.html
 -- 112SP?
 -- 600MHz graphics clock, 1500MHz processor clock, 900MHz memory clock
 - x Difficult to carry
 - x Bulky, noisy, hot
 - I'm thinking of installing knoppix for CUDA or Windows OS, Windows will cost more.
 - o 安い
 - o There is also the possibility of making it a home server(?)
 - o There is also the possibility of using it as a game machine (???).
 
 Option 3: I guess I'll have to learn to write code on a device emulator for now ← here and now
 
 *1228305663*鍋日記
 If you buy the base of the pot, it costs about 250 yen, so I'll make it without buying it to save money.
 
 First, I put a pack I bought a long time ago into 2 liters of water to take out the broth. The expiration date is June 2007. I've left it at room temperature, but it seems to be OK.
 
 After the soup stock has been extracted, the next step is to add motsu (pork). Simmer it. When it's done, I taste it. Wow, this is terrible, there is no taste. I added 100 ml of 3 times diluted soup stock. It tastes light, but it's okay. I add another 100ml of water to the vegetables.
 
 Add vegetables. I forgot about the carrots. It's lonely with only Chinese cabbage and green onion, but oh well. Taste. Not bad.
 
 I put in mochi with an expiration date of March 2007. They have been in the refrigerator for a long time, so I thought it was time for them to disappear. The bag is bulging out and it's too bulky.
 
 -----
 
 The rice cake was so delicious that I ate four pieces. I ate too much.
 </body>
 <comments>
 <comment>
 <username>CortYuming</username>
 <body>After the answer! It's a little clearer now. </body>
 <timestamp>1228283799</timestamp>
 </comment>
 <comment>
 <username>Voluntas</username>
 <body>Good luck</body>.
 <timestamp>1228283949</timestamp>
 </comment>
 <comment>
 <username>ama-ch</username>
 <body>When I ran python -m this, I thought, "What the heck is this?" I thought. <br>I see, it was an Easter egg! </body>
 <timestamp>1228285287</timestamp>
 </comment>
 <comment>
 <username>shou</username>
 <body>And you say only dashi. What about soy sauce, mirin and sake</body>?
 <timestamp>1228439578</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-12-03 https://nishiohirokazu.hatenadiary.org/archive/2008/12/03]