Hatena2013-10-28
code:hatena
 <body>
 *1382887406* Quantum chess is interesting.
 I was told that a game called Quantum Shogi is now available to play, and I immediately tried it. The rules are simply this: all pieces are in a state of quantum superposition, and the state of the pieces converge depending on how you move them. You win if you take a piece that converges to a king. (PS: I wrote an explanation of the rules: <a href='http://d.hatena.ne.jp/nishiohirokazu/20131028/1382954363'>Quantum Shogi Q&A</a>)
 
 It was pretty interesting with two wins and two losses, so I wrote down my impressions before it drifted away and became inaccessible.
 
 ** 1st(win)
 Game record: http://shogitter.com/kifu/884
 
 My Strategy
 - Once the type of piece is determined, there are fewer options available. Therefore, it is better not to move a piece unless it is necessary. If you have to move a piece, it is best to pretend to take a step.
 - If you win by taking a piece that is confirmed to be the king, you should narrow down the possibilities by taking more and more pieces that may be the king's pieces.
 
 impressions
 - Hovering the mouse pointer over a piece brings up the possible piece types
 - I am wondering if it is a good idea to take a flying car. Since it is "a piece that is only a flying car."
 
 ** 2nd (win)
 Game record: http://shogitter.com/kifu/885
 
 My Strategy
 - I won the first round, so I continued with the "take more and more pieces that might be king pieces".
 - In order to reduce the opponent's "O-ma-ma-ma-ma-ma" as soon as possible, you play "Katsura-ma-ma-ma" that you have taken from the opponent, and exchange both pieces.
 
 impressions
 - The piece I used with the intention of being a kogan, my opponent converged it into a flying car by "hitting it and moving it sideways", depriving all of my pieces of the possibility of being a flying car.
 - By having "pawns to carry," can you change the probability of not only your own pieces, but also those of your opponent?
 - After the opponent had two pieces that might be kings, one of them was the incoming ball. I thought, "Let's surround the one that is easy to fill and take it," but when I thought about it calmly, I realized that if I take it, the one that has the ball would become the real king. I had to take the one that was hard to fill up first. It was hard work.
 - It's hard because you have to hunt them both down if they're scattered around, keeping them in a state where they might be kings.
 
 ** 3rd (loss)
 Game record: http://shogitter.com/kifu/894
 
 My Strategy
 - Won, so continued to "take more and more king pieces".
 - If there is an opportunity, let's do the "Fix the kagan tsuki as a tsuki that you have taken from your opponent".
 
 impressions
 - The opponent confirms the taken piece in the corner, and I still don't realize the gravity of the situation.
 - Steadily and repeatedly exchanging with the other party's "King Maybe".
 - "Okay, a lot of my opponent's pieces are now infantry!" I thought (move 109), but then I realized that I had long ago (move 91) converged on the "king of pawns". From the pieces I had not moved, the possibility of gold in move 83 and silver in move 64 had disappeared.
 - This is the result of generalizing and applying the opponent's "fixing the kagan tsukiji taken from the opponent as a tsuki and taking away the possibility of a tsuki from the remaining pieces".
 - If you are the king of a step or the king of a pawn, even if an enemy piece comes next to you, you will be hesitant to take it because you will be confirmed as the king if you take it.
 - When the probability distribution converges and approaches normal chess, I am at a disadvantage because of my lack of experience in chess.
 
 ** 4th (loss)
 Game record: http://shogitter.com/kifu/899
 
 My Strategy
 - I was given the above "take away your opponent's gold and silver potential" strategy, so let's implement it!
 
 impressions
 - I was the latecomer, and my opponent made a hasty attack by shoving a kagan tsuki in the middle of the field, so I had no time to think about "taking away my opponent's gold and silver possibilities".
 - I played two Kogan Bishan and thought, "If my opponent's Kogan Bishan drops, it will be confirmed as a Bishan, so I won't lose anything by exchanging it", but when my opponent's Kogan Bishan drops and converges to a Bishan, my Kogan Bishan converges to a Bishan, and I lose a lot of money.
 - While my opponent says "we're getting closer to normal chess," I'm getting more confused.
 - Probably the reason is that I have no basic chess skills and cannot remember how the pieces have moved in the past. As a result, I have to rely on the "remaining possibilities" tooltip that appears when I hover the mouse to see how the probability convergence is, and access performance is very poor.
 - On move 42, without understanding that one of his 11 remaining undetermined pieces is a gold piece and one is a king piece, he moves one of them to the side, causing a sudden convergence of probabilities and reducing the number of king pieces to two.
 - On move 47, one of them is taken and the king is identified.
 - He's in a hurry to move the king to a place of effect and gets taken easily.
 
 ** Summary
 
 I won two games and lost two games in Quantum Shogi. Because I do not have basic Shogi skills, I could not know "how I moved the piece in the past" or "which piece I took from my opponent" and could not seem to execute it even after hearing the strategy being used. Basic fitness is important even when fighting in the applied game.
 
 I thought I would play Quantum Go since I am better at Go than Shogi, but Go has been a quantum game for more than 2000 years, in which stones are superimposed in a dead state and a living state, and when the life or death of a stone is determined, whether the surrounding squares are white, black, or no good is decided, and the amount of the dead stones is competed. It was a quantum game. If there are two eyes, they converge on life!
 
 *1382894200*Made a script to make the state of quantum chess easier to understand (pre-alpha).
 >||
 $('.koma').parent().each(function(){$(this).css('position', 'relative'); $(this).append($('<span style="position: absolute; left: 0; top: 0; color: blue; font-size: 65%; float: left; display: block; background: #fff;">' + this.title + '</span>'))})
 ||<
 
 [f:id:nishiohirokazu:20131028021428p:image]
 
 Right now, because of the parent with position: relative, the origin of the coordinates is in the upper left corner of the document, making it difficult to manipulate the piece, so I have to reload to turn it off. It would be useful to be able to manipulate them even if they are left visible.
 
 *1382954363* Quantum Shogi Q&A
 The article "Quantum Shogi is Interesting" that I wrote yesterday is very popular, but since I skimped on the explanation of the rules, some people seem to misunderstand it, so I put it in the form of a Q&A session.
 
 ** Q: Is luck involved?
 
 NO. Luck is involved only in the swinging pieces that determine the first and second moves. The rest of the game is the same as regular Shogi, without any element of luck.
 
 ** Q: What? When you take a piece, doesn't the probability determine which piece it was?
 
 NO. that is not correct, even though it may be an association from military chess. For example, if you take a piece "either a kogan or a flying car", you can use it directly as "either a kogan or a flying car".
 
 ** Q: When you play, do you decide whether to use it as a kasha or a flying car?
 
 NO. Immediately after the move is made, the piece is in the superposition state of "either a kogar or a flying car". If you move the piece to the back, the piece is determined to be a flying car, because it is impossible for a kogar to make such a move. If the piece is placed at the far end of the opponent's position, for example, the piece is determined to be an airship, because it is impossible for a kogar to be placed there under the rules.
 
 ** Q: I don't know which one is king in the initial state?
 
 The question is ambiguous and the answer can be either yes or no.
 If the question is, "Is any of them kingdoms initially, and the player doesn't know which one it is?" the answer is no.
 Do you know at the start of the game which of these will eventually converge on the kingpin?" Then the answer is yes.
 Initially, all of them have the potential to be kingdoms, and which of them will eventually converge to be kingdoms depends on the player's subsequent manipulations. That is why it is not known at the beginning of the game. The probability values of the pieces are completely deterministic and there is no element of luck. The reason why you do not know which piece is the king at the beginning of the game is because you do not know "what kind of action the player will take afterwards".
 
 ** Q: If I take a piece that might be a king, is it possible for that piece to later converge on a king and win?
 
 NO. The rule there is that if an undetermined piece is taken, the possibility of it being a king general disappears. If the piece is a king, the game should have ended when it was taken, and the observation that the game did not end eliminates the possibility that the piece is a king.
 
 I think it was theoretically possible to design a game here that "the piece is held with the possibility of being an osho" or "it is determined that the piece was not an osho because it cannot be an osho at the time it is played". However, I am not sure if that game would be fun.
 
 ** Q: So it can't happen that the game ends without any of the king generals being determined?
 
 YES, that is correct. Taking a piece that has not been determined as a king does not win the game.
 
 Some people asked whether you win if you jam the king general or if you take it. But the situation in which you win is the same as in ordinary shogi, since there are only two ways to win: "identify a king general and jam it" or "identify a king general and have that general commit suicide. But, well, you have to be careful about inadvertently committing the latter suicide. For example, in a situation where Kogan is not identified, it is dangerous because all the pieces that might be Kogan have the effect of the front row.
 
 Note: Although it is a very rare case, there exists a pattern in which the silver and gold are determined to be gold by the "action to fall back" in the case of "falling back and taking the opponent's gold king with the silver and gold taken from the opponent", and as a result, the opponent's gold king is determined to be king due to the number of gold pieces constraint and the game ends when the king is taken. I found that I cannot say YES. Game record: http://shogitter.com/kifu/1090
 
 ** Q: How is Nariri handled when a piece enters enemy territory before it is determined?
 
 Will it be?" you will be asked. If the player chooses to play, the possibility that the original piece is a gold or a king disappears. On the other hand, if you go to the far end of the board but don't reach the end, the possibility that the original piece is an infantryman or a kaguruma is gone.
 
 ** Q: Is it advantageous to bring the opponent to two steps?
 
 NO. there is no rule for two steps. If there were a two-step rule, the speed at which steps are identified would increase. I think that option is possible in game design, but perhaps the convergence would be too fast to be interesting.
 
 ** Q: Where can I play?
 
 Just login to http://shogitter.com/ with your Twitter account, go to "New Game" and select "108: Quantum Shogi" from the list of rules. You can find an unspecified opponent on Twitter or invite a specific person.
 
 ** Q: How long will it take?
 
 That depends on how much you spend on each move, but I imagine it takes about 50 to 150 moves to settle. I did it during my lunch break today and it took about 40 minutes. When it was fast, it took 12 minutes, and when it was slow (when I chased after them trying to fill in the gaps and couldn't do it after all, and it took about 150 moves), it took more than an hour.
 
 ** Q: The point is that you can pretend to take a full step so as not to be identified, or you can go step by step on all sides, or you can just hang around in the crevices inside.
 
 I think that a foot-to-foot march is disadvantageous because you can move a piece in the position of a step in the first move as a kashira to take a piece in the opponent's position. Even if you take back the piece that jumped in, it is an exchange where the piece taken is an all-around piece and the piece replaced is a kogan-bisha, and the opponent can determine the appropriate piece to be a flying car in one move and change that kogan-bisha to a kogan.
 
 ** Q: How long does it take to identify a kingpin?
 
 My shortest record is 15 moves to identify the King's General http://t.co/ltzncNhwqP
 
 ** Q: Is a strong chess player stronger than a strong chess player?
 
 As the pieces converge, the game gets closer and closer to normal chess, so the stronger the chess player is, the better the endgame will be.
 
 I read a book titled "Beginner's Three Moves Ahead" at a bookstore yesterday and found that my shogi skills are so weak that I couldn't solve the first problem. The "ability to read 3 moves ahead" trained in Shogi is probably effective in Quantum Shogi as a basic physical strength.
 
 On the other hand, as for the early game, it is a "king-specific game" unique to Quantum Shogi, so it seems to be highly independent of the power of Shogi. I imagine that the author is applying the experience of Go to this game, for example, "to increase the efficiency of one move by choosing multiple targeted moves in one move while remaining indeterminate."
 
 ** Q: For now, just raise all the pieces one step at a time, like steps.
 
 NO, that's impossible, because once the 17th piece is raised, the remaining 3 pieces will converge on the "Katsura horse or Kaku", which is the only way to satisfy the condition that there are 3 "Katsura horses or Kaku" in the 20 pieces that cannot move forward.
 
 ** Q: I can't tell if I'm in the king's hand or not?
 
 The question is ambiguous, so the answer can be either yes or no. If by "king move" you are referring to "the state in which the next king is taken and you die," then the answer is NO. See above "Can it happen that the game ends without any king being determined? → YES".
 
 On the other hand, the situation "when the king is identified by your move or your opponent's move, the king is already in the king's hand" can happen. It would be suicide, especially if you identify the king by yourself.
 
 ** Q: First-mover advantage?
 
 It is the author's subjective opinion, but so far that is a strong possibility. Those who are familiar with the game should aim to take the backseat and then turn around and win the game.
 
 If quantum shogi is shown to have a serious advantage for the first player, I think it would be a good idea to add a piece "Ishi", which cannot move at all, to the second player, and to add a 5-2 to the initial placement. I think that the balance of Quantum Shogi can be adjusted only by adding a piece that is useful only as a piece to be used as a go piece, but not by adding an undetermined piece that the opponent cannot actively determine. Or, if we add "Gyakuho", which can only "move backward", when the opponent's piece is moved backward, the piece that is now converging on kinfei can still be a gyakuho. Adding a piece with only "three squares behind and diagonally behind" would intertwine the gold specific path and the silver specific path. I think this is an effective way to adjust the balance of quantum chess without destroying the balance of chess too much.
 
 ** Q: It's a full information game, right?
 
 I too have played more than 10 games with the assumption that it is a full information game, but the answer is no. Under the current rules, the game is not perfect because "if there are pieces of your origin and pieces of your opponent's origin that converge to the same degree in the pieces your opponent has, we cannot tell which of the two is struck. Incidentally, the reason I noticed this is because I made the mistake of "I had a piece of my own origin and a piece of my opponent's origin that converged to the same degree in my pieces, and I hit my piece by mistake when I intended to converge the opponent's piece...".
 
 ** Q: Is quantum chess life?
 
 <a href='http://d.hatena.ne.jp/nishiohirokazu/20131031/1383230688'>Quantum chess is life</a>.
 </body>
 <comments>
 <comment>
 <username>nlogn</username>
 <body>"Can it happen? >> YES, that's right.", the question looks like a negative question, so it seems confusing to write "yes" in the Japanese way... (just a matter of expression). </body>
 <timestamp>1383000685</timestamp>
 </comment>
 <comment>
 <username>kobayashi_shinji</username>
 <body>If you also specify pointer-events: none; for the span you are appending, you should be able to use IE11 or later and other good browsers</body>.
 <timestamp>1383101772</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>In my brain, "Is X impossible?" was "Is X impossible?". I guess there is no room for misunderstanding here as long as it is expressed in natural language. </body>.
 <timestamp>1383274494</timestamp>
 </comment>
 <comment>
 <username>JL</username>
 <BODY>That's interesting! There are various derivative board games such as Shogi, Chess, Zogi, etc., but I think the rules have been established as a respectable derivative game. <br>I would love to see a professional chess player play it. </body>
 <timestamp>1383408379</timestamp>
 </comment>
 <comment>
 <username>tasbranded</username>
 <body>Because of this, the origin of the coordinates is in the upper left corner of the document, making it difficult to manipulate the pieces, so it is necessary to reload to turn it off. It would be useful to be able to manipulate them even if they are left displayed</body>.
 <timestamp>1383542402</timestamp>
 </comment>
 <comment>
 <username>nlogn</username>
 <body>I see. </body>
 <timestamp>1383921350</timestamp>
 </comment>
 </comments>

[Hatena Diary 2013-10-28 https://nishiohirokazu.hatenadiary.org/archive/2013/10/28]