Hatena2008-03-31
code:hatena
 <body>
 *1206932861*Wiki refactoring
 I am refactoring the wiki for the 1000 speakers conference, and after 3 times it is starting to look stable, so the next milestone is to create a system where someone can take over for me or amachang if we are hospitalized due to a sudden accident. To do this, we need to at least verbalize our know-how and the history of why we adopted the current recruitment method.
 
 We have various ideas, such as co-hosting the conference with the Ambition Group, a 1,000 speaker conference @ Kansai, or holding the conference on a weekday evening with half the time and half the number of presenters.
 
 *1206933078* Why is this article...
 Via @happy_ryo
 
 livedoor news - For women joining us in April http://news.livedoor.com/article/detail/3576291/
 >>
 For example, only women come to the office at 8:30 to wipe desks, make tea at 10:00 and 15:00, and are in charge of buying snacks. If the president of a venture company is a one-man operation, the secretary may have to go shopping for shirts and socks, prepare for business trips, or buy cigarettes during the workday.
 <<
 
 If it were a personal blog, I wouldn't be bothered by it, but what about this content and style for "news"?
 
 *1206937521* Banach-Tarski's inverse theorem.
 While eating lunch, Mitsunari told me <a href="http://ja.wikipedia.org/wiki/%E3%83%90%E3%83%8A%E3%83%83%E3%83%8F%EF %BC%9D%E3%82%BF%E3%83%AB%E3%82%B9%E3%%. 82%AD%E3%83%BC%E3%81%AE%E3%83%91%E3% 83%A9%E3%83%89%E3%83%83%E3%82%AF%E3%82%B9">Banach-Tarsky paradox - Wikipedia</a> and gave me a rough idea why this happens. I was interested in looking into it.
 
 The English version has a "Proof Summary" that is not in the Japanese article. <a href="http://en.wikipedia.org/wiki/Banach%E2%80%93Tarski_paradox">Banach&#8211;Tarski paradox</a>
 
 So I was reading it, looking up <a href="http://en.wikipedia.org/wiki/Free_group">Free group</a> and then <a href="http://en.wikipedia.org/wiki/Generating _set_of_a_group">Generating a set of a group</a> and fell asleep (here and now).
 
 Simply put, if you accept the claim (<a href="">selection axiom</a>) that "when there are many sets, you can make a pair of sets by taking one from each set (for example, if you have a set of integers, a set of ASCII strings and a set of Japanese cities, you can take one from each set and make a pair called (1, "hoge", Tokyo))," then you can say If you accept the claim (<a href="http://ja.wikipedia.org/wiki/%E9%81%B8%E6%8A%9E%E5%85%AC%E7%90%86">the selection axiom</a>) that "If we divide a 3-dimensional sphere of radius 1 into 5 pieces and recombine them by translating and rotating only  I heard that if you use the selection axiom to first divide a sphere into three dimensions whose volume cannot be defined, then rotate it three-dimensionally, and then combine them, you can create something different from the original volume.
 
 0 area in spite of being visible <a href="http://ja.wikipedia.org/wiki/%E3%82%B7%E3%82%A7%E3%83%AB%E3%83%94%E3% 83%B3%E3%82%B9%E3%82%AD%E3%83%BC%E3%81%AE% E3%82%AE%E3%83%A3%E3%82%B9%E3%82% B1%E3%83%83%E3%83%88">Sierpinski's gasket</a> still has an area of "0," so a three-dimensional object with no volume definition must have a very mysterious shape It must be a mysterious shape.
 
 -----
 
 Free Group I think I understand.
 
 -----
 
 >>
 let A be a rotation of some irrational multiple of π, take arccos(1/3), about the first, x axis, 
 and B be a rotation of some irrational multiple of π, take arccos(1/3), about the second, z axis.
 <<
 
 It's hard to tell, but I guess A rotates around the x-axis by an irrational multiple of pi, and B rotates around the z-axis.
 
 -----
 
 I feel like I could make countless ORBITs, but I'm not sure what I'm misunderstanding.
 
 *1206942742*[Emacs] No backups are made within a specific folder.
 In this previous article (http://d.hatena.ne.jp/nishiohirokazu/20080328/1206694276)
 
 >>
 When I edit snippets in Emacs, I have trouble creating files with tildes. I wonder if it's possible to prevent them from being created only in the snippets folder.
 <<
 
 When I was writing this, id:IMAKADO gave me a sample code. Thank you very much.
 I wrote the code below in .emacs.el for reference.
 
 >|lisp|
 (add-hook 
  'before-save-hook 
  (lambda ()
    (let ((snippet-dirs "yas_private/")
 	 (buf-dir (file-name-directory (or buffer-file-name " "))))
      (when (string-match snippet-dirs buf-dir)
        (set (make-local-variable 'make-backup-files) nil)))))
 
 ||<
 
 It seems that string-match is a function that takes a regular expression as its first argument and checks whether it matches or not, so multiple directories are OK if they are written in a series of snippet-dirs.
 >||
 (string= "a.b" "acb");nil
 (string-match "a.b" "acb");0
 (string-match "/x/.y" "/foo/x/by");4
 ||<
 
 Note: The asterisk was not needed because (string-match "a" "bab") is non-nil. Removed.
 
 *1206945150*Lunch today
 I had planned to just have leftover rice from the one cup I had cooked for breakfast for lunch, but at 3:30 I was starting to get hungry.
 
 261kcal Spring cabbage salad udon
 240kcal Drinking yogurt aloe
 
 I bought it thinking it was a salad, but it was udon.
 
 That's about 600 kcal for a cup of rice for breakfast. A piece of bread used to be 160 kcal, but that's quite an increase. Is rice really that high in calories?
 
 *1206950824*I created a yasnippet directory in Spark.
 http://www.libspark.org/wiki/yasnipet
 
 I've written a rough explanation for now, so if you have any questions, please ask. If you have any more questions, please feel free to ask.
 
 *1206962180*web.py
 - wellingtons
 - I don't think I'm looking for documentation.
 - I used it just to see what it looked like and it worked.
 
 The "look-and-feel" of web.py is quite high. However, I would not recommend it for a first time web app creator. I didn't think I would be able to understand it well.
 Oh, of course, if you're not happy with what you see and use, no problem.
 -----
 References:
 
 A simple wiki with web.py - TokuLog Shut up and write some code, baldie!
 http://d.hatena.ne.jp/tokuhirom/20060225/1140867631
 
 *1206968824*Replacement
 f:id:nishiohirokazu:20080331220635j:image
 
 *1206969590*I'm so sleepy.
 
 Is blood collecting in the stomach? It is cold outside but warm inside.
 </body>
 <comments>
 <comment>
 <username>chiqashi</username>
 <body>The link to Wikipedia seems to be wrong. The correct link is<br>http://ja.wikipedia.org/wiki/%E3%83%90%E3%83%8A%E3%83%83%E3%83%8F%EF%BC%9D%E3%82%BF%E3%83%AB%E3%82%B9%E3%82%AD%E3%83%BC%E3 %81%AE%E3%83%91%E3%83%A9%E3%83%89%E3%83%83%E3%82%AF%E3%82%B9<br>. </body>
 <timestamp>1206943734</timestamp>
 </comment>
 <comment>
 <username>IMAKADO</username>
 <body>Hello, thank you for taking the time to make an entry. It was a pleasure. <BR>Yasnippet is very convenient, isn't it? I love it myself. </body>
 <timestamp>1206981183</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-03-31 https://nishiohirokazu.hatenadiary.org/archive/2008/03/31]