Hatena2010-04-08
code:hatena
 <body>
 *1270720345* longest to start
 I looked at Tumblr, used it for a while, and said, "It would be easier for me to use it if it were like this. I changed the title of my Tumblr to "Connecting until I can make my own apps" in 2007.
 
 I started making it yesterday and it took me two days to get it to the point where I could use it. What the heck, just get on with it. It's a pain in the ass to transfer the content I posted on Tumblr to this one.
 
 Well, it's important to reread it, which is good.
 
 Right now, I've only implemented the bare minimum functionality, and I'm thinking, "If this is all there is, why not just use Tumblr? I'm going to release it after eating dog food by myself for a while.
 
 *1270746530*線香数学
 There are nine incense sticks that burn at a constant rate and burn out in an hour, clocking in at 20 minutes."
 
 ** 条件
 -0 The moment when the incense burns out is clearly visible. Therefore, one hour can be measured.
 -1 Igniting and extinguishing incense takes no time. Therefore, 30 minutes can be measured by "lighting both ends of one incense stick at the same time until it burns out.
 -2 It is possible to light another incense stick and extinguish another incense stick at the moment it burns out. Therefore, 15 minutes can be measured by "lighting both ends of one incense stick and one end of another leading, and lighting the other end at the moment the first one burns out, and from there until it burns out.
 -3 Incense sticks are straight line segments and are not considered thick. Any number of incense sticks can be stacked on the same line segment.
 -4 By attaching one end of an incense stick somewhere and rotating it, one can draw a circle centered at that point. This allows, given three incense sticks, to make a triangle with them.
 -5 If a point on the incense is identified in some way, it can be marked. The moment the incense burns to that point can be clearly identified, as can the moment it burns out.
 
 *1270751829*[GAE]GAEでPagination
 I was wondering how smart it would be to implement pagination because of fetch limitations, and I found an official statement that is exactly what I was looking for. <a href='http://code.google.com/intl/ja/appengine/articles/paging.html'>How to do paging with App Engine - Google App Engine - Google Code</a>
 
 What's a shard?
 
 <a href='http://code.google.com/intl/ja/appengine/articles/sharding_counters.html'>Counter sharding - Google App Engine - Google Code</a>
 
 Uh, in other words.
 >>
 If we read/write to a single object in the Datastore for a process that is being performed by a user, it will eventually become a bottleneck when the number of users increases, right? Should we first use a task queue to flatten the system, and then distribute the objects themselves over several objects when it becomes too much to handle?
 <<
 http://twitter.com/nishio/statuses/10957320426
 Is sharding called the second half of the
 </body>
 <comments>
 <comment>
 <username>showyou</username>
 <body>Do you enjoy dog food? </body>
 <timestamp>1270723256</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Dog food is bad</body>.
 <timestamp>1270800271</timestamp>
 </comment>
 </comments>

[Hatena Diary 2010-04-08 https://nishiohirokazu.hatenadiary.org/archive/2010/04/08]