Hatena2008-07-29
code:hatena
 <body>
 *1217301708*[RTM] Easy to create and delete tasks!
 Yesterday, on the train on my way home, I remembered that I had registered "XX transfer" on my cell phone, and since it was completed, I hit "Complete". I also transferred the money for the gas because the gas was turned off this morning, but I forgot to register it in the task, so I can't click "Complete". I was disappointed even though I had completed the task. I'm starting to enjoy completing and deleting tasks, so I'm going to register them so I don't forget.
 
 *1217341528*水風呂
 I paid for gas but haven't opened the tap yet.
 
 
 The water baths were also surprisingly antsy.
 
 *1217342195* I still think it's August.
 I saw TopCoder on Tuesday, 7/1 and thought, "Oh, TopCoder today. The next one is Thursday night at 8:00 pm.
 
 *1217345553* Being nice to people takes practice.
 <a href='http://d.hatena.ne.jp/satomies/20080728/p1'>I was vomiting in a convenience store, little kid - Miss S. Hatena</a>.
 
 That's a good story. This is the kind of person I want to be. On the other hand, when I think about whether I would be able to respond in this way, I probably can't. I can't do it if I'm standing in the middle of the street looking at a person who has collapsed and the person who is administering first aid from a distance, or glancing sideways at a foreigner who is spinning around a map.
 
 even
 >>
 I learned that it takes practice to be kind to others.
 
 It's a matter of experience. If you don't know what to do the first time, you can learn to do it the second time by watching someone else do it well. /And the fact that you can't do it even though you know how to do it is not to blame either.
 <<
 http://b.hatena.ne.jp/entry/http://d.hatena.ne.jp/satomies/20080728/p1
 
 I guess it takes practice. I can't do it now, but I'll try to be a little braver next time.
 
 
 As a side note, I wonder if those who are talking about norovirus are those who do not have the reading comprehension skills to read that what the speaker did was something unlikely to cause norovirus infection, such as "handing a box of tissues and saying, 'Use it,'" or "asking, 'Can I use the restroom? I wonder if they just want an excuse to justify themselves for not doing it. Either way, I don't want to be that kind of adult.
 </body>
 <comments>
 <comment>
 <username>jbking</username>
 <body>Don't you have a public bath nearby? W, don't catch a cold! </body>
 <timestamp>1217349770</timestamp>
 </comment>
 <comment>
 <username>Michiyo</username>
 <body>That's great! <BR>I don't think I would be able to move unless my children were alone or something.... I think the parents will do something about it. I'm sorry. <BR><BR>I think it's great that you have made up your mind that you want to be this kind of person after reading that diary. Respect☆<br>I want to learn from you too. </body><br>I want to learn from you.
 <timestamp>1217356867</timestamp>
 </comment>
 <comment>
 <username>asami81</username>
 <body>You are free to criticize and evaluate, but it is sad to see so many people who can't read and only criticize. <br>I don't want to be this kind of person. <br>I think the most important thing is to keep practicing and to keep doing it. <br>I will start practicing again. </body>
 <timestamp>1217381670</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-07-29 https://nishiohirokazu.hatenadiary.org/archive/2008/07/29]