Hatena2011-02-06
code:hatena
 <body>
 *1296970748* Mini beast assembled.
 My son was born with a bad knee and his leg was removed, but he walks on the rest of his legs. I thought it was amazing who designed this plastic model thing. It was easy to put the parts together without using tools. I would have had nothing to complain about if they had left a few more parts for the possibility of these dysplastic joints getting mixed in.
 
 
 f:id:nishiohirokazu:20110206142512j:image
 
 *1296981634* The benefits of an opportunity are limited by the fear of the person receiving the opportunity.
 Keep track of your thought process on Twitter.
 
 >>
 If God appeared to you and said, "Declare an amount of money and toss a coin. If it comes up heads, I will give you ten times that amount, but if it comes down tails, I will collect that amount.
 <<
 
 Note that the coin must be undistorted and uncontrollable, with a 1/2 probability of being face up, and only one attempt is allowed.
 
 I suppose that anyone who understands probability calculations to some extent knows that "the more you bet, the higher the expected return," but even so, some people may resist betting 100,000 yen, while others may be willing to bet a million yen without hesitation. What is the difference? There is no difference in the chance itself.
 
 >>
 In other words, even if the same opportunity is given, each person has a different expectation of the benefits to be gained from it. The amount of fear of failure, the margin for challenge, risk tolerance, and so on may be expressed in various ways, but what limits the benefits to be gained is in the mind of the person who receives the opportunity.
 <<
 
 In the comic "Silver and Gold," there is a line that says, "You can't have gold unless you have the strength to hold it," and I guess that is exactly what it means. Even if you have a chance, you need to have a tolerance for risk in order to see it as an opportunity. Without that, even if you see the same thing, you will only see it as "something risky and scary.
 
 <hr>
 
 I have modified the problem a bit because I have thought this far and realized the possibility of drawing a more interesting conclusion than "my risk tolerance changes the expected value I get from the opportunity".
 
 >>
 Suppose God appears and says, 'Declare an amount of money and toss a coin. If it is heads, I will give you 101 times that amount, but if it is tails, I will charge you that amount. Assume that God does not cheat, that there is only one chance, and that it is easy to prove to a third party that such a contract was made with God. What should we do?
 <<
 
 The important point is that the "ability to prove that you have a chance" was explicitly stated. Normally, if I told a third party that "God appeared to me~," they wouldn't trust me, but I assumed that they would.
 
 >>
 I realized that there are a lot of good solutions and a lot of people using those solutions in the world.
 <<
 
 In the previous example, we were talking about the same exposures but with different expectations obtained depending on the individual's risk tolerance, but the exposures themselves can be used in a different way if you can convince others of the expected value of the exposures. In other words, you shift the gamble to someone with a higher risk tolerance.
 
 >>
 My answer, by the way, was, "Why don't you take a gamble where there is a one-in-two chance that your investment will increase fifty-fold? I can hire a sales person and a coin-shaking person as soon as investments start coming in.
 <<
 
 This is exactly what venture companies and venture capitalists are doing. Venture capitalists invest in businesses that have the potential to fail but will be profitable if they succeed, knowing that they will most likely go out of business. The same is true on the venture side.
 
 When I said, "There are plenty of people in the world using this solution," what I was envisioning was "issuing stock," which is the same thing in terms of transferring risk. The reason why the final solution did not take the form of an issuance of shares was because, considering the effort required to remove the influence of voting rights and to collect money from an unspecified number of people by going public, we decided that it would be easier to sell directly to those who had the money and risk tolerance.
 </body>
 <comments>
 <comment>
 <username>nyaxt</username>
 <body>I wanted to increase the number of trials by gathering a number of reliable people to get closer to the expected value. </body>.
 <timestamp>1297011844</timestamp>
 </comment>
 </comments>

[Hatena Diary 2011-02-06 https://nishiohirokazu.hatenadiary.org/archive/2011/02/06]