Hatena2008-08-07
code:hatena
 <body>
 *1218124698*Domestic
 I don't understand what procedures are required when boarding a domestic flight in Japan. I don't think I need my passport for now. I wonder what time I should arrive at the airport for the 8:20 a.m. departure from Haneda. It says that the boarding procedure is until 15 minutes before the flight. And I don't know how to pick up my ticket.
 </body>
 <comments>
 <comment>
 <username>snow-bell</username>
 <body>If you are flying domestically, you should arrive at the airport at least one hour before your flight<br>Because it takes time to check your luggage...<br>I recommend arriving at the airport two hours before your flight in case there are any problems. <br>You can pick up your ticket at the airport on the day of your flight, but you will need the credit card with which you purchased your ticket.
 <timestamp>1218127494</timestamp>
 </comment>
 <comment>
 <username>t3kai</username>
 <BODY>I think a credit card or a JAL or ANA card will do. I aim to arrive at the airport about an hour before, but it is usually about 30 minutes before. I don't recommend it...</body>.
 <timestamp>1218173960</timestamp>
 </comment>
 <comment>
 <username>m-hashimoto</username>
 <body>I do it about 20 minutes before. <br>But I recommend 30 minutes before, as id:3kai says, to give yourself plenty of time! </body>
 <timestamp>1218174292</timestamp>
 </comment>
 <comment>
 <username>from_kyushu</username>
 <body>>Time to get to the airport<br>I tried to check in 15 minutes before boarding, but was called out a few minutes before by an announcement: ...... (Haneda Airport). <br>Therefore, I recommend 30 minutes before. <br><br>Ticketing<br>Insert the credit card, JAL card or ANA card used to purchase the ticket into the ticketing machine and your ticket will be issued. <br>If you are using Haneda Airport, I believe it is located just up from the subway station. </body><br><br
 <timestamp>1218174602</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>Thanks everyone. <br>For now, I'm going to limit my baggage to just one piece of hand luggage, so I'll assume it won't take too long for the procedure to be completed. </body>
 <timestamp>1218175384</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-08-07 https://nishiohirokazu.hatenadiary.org/archive/2008/08/07]