Hatena2015-04-23
code:hatena
 <body>
 *1429792843*Diary of playing with JINS MEME
 I won a prize in the <a href="https://developers.jins.com/ja/ideapitch/">JINS MEME DEVELOPER IDEA PITCH CONTEST</a> and received a JINS MEME. In a word, it is a pair of glasses with a sensor that can take information such as eye movement.
 
 *** April 22
 
 [f:id:nishiohirokazu:20150423213850j:image]
 
 Compared to the JINS PCs I wear, they are huge, and when I put them on my wife said, "You look like a father. When I put them on, my wife said I looked like a father, but if I look like a father wearing JINS MEME, it means that I am not so different from many fathers.
 
 I borrowed my wife's MacBook Air, installed XCode, bought the Apple Developer Program, etc., and after a full day of work, I was able to create a program that sends the values measured by JINS MEME to the server. By the way, I have Focus=1 and Sleepy=3, which means I am very sleepy and not able to concentrate.
 
 *** April 23
 
 I went to bed and woke up and JINS MEME says "you are super sleepy" lol
 
 I had a good night's sleep and woke up feeling refreshed, but JINS MEME told me "you are very sleepy" and I laughed, but then I realized that I had forgotten something. He was laughing, but then he realized he had forgotten something.
 
 [f:id:nishiohirokazu:20150423215059p:image]
 
 It is getting values that look like that.
 
 *** April 29
 
 I'm sure there are many people who don't have JINS MEME with them but are interested in what kind of data they can get, so I'll share the CSV of the 2600 lines I recorded while wearing JINS MEME.
 
 https://github.com/nishio/jins_meme/blob/master/log.csv
 
 I wanted to try acquiring data in real-time mode, but for some reason I couldn't connect. Then I noticed that I couldn't connect in standard mode either, which I had been able to connect before. Did something go wrong when switching modes?
 
 *** April 30
 
 Notes from Twitter conversation regarding resolution of lost connection
 
 ---
 nishio: I tried to connect to JINS MEME real time mode for the first time, but for some reason it stayed connected and didn't move on after 20 minutes or so... I reset the power and the behavior didn't change, so I wonder why...?
 
 nishio: I mean, the standard mode that used to work stopped working too. Did something go wrong when I switched?
 
 t_furu: Press and hold the power button and the red dot light will turn off after a while. If rebooting after that does not improve the situation, you may be able to get it back by connecting the USB cable, putting it in charge mode, and unplugging the USB cable.
 
 nishio: I will give it a try! Thank you!
 
 hatone: t_furu nice advice. When the advertisements stop coming, recharge your batteries and try again to see if the advertisements come. If it still doesn't work, give it some time (wait for the battery to run out). If it still doesn't work, then I wait for a while (wait for the battery to run out).
 
 nishio: I was able to connect to my iPhone after a 13 second reset on the MEME side and unplugging and plugging in the charging cable, but then I realized that I had to turn off the iPhone and restart it.
 ---
 
 (To be added gradually)
 </body>

[Hatena Diary 2015-04-23 https://nishiohirokazu.hatenadiary.org/archive/2015/04/23]