Hatena2007-12-08
code:hatena
 <body>
 *1197083978*洗顔料2倍
 For some reason I found an unopened face wash in my bag that I always carry with me, so I have two unopened face washes, along with the new one I bought last time. My face is not that wide.
 
 *1197084004*口内炎
 Your tongue is so rough.
 
 *1197084049*Monday
 Perhaps a combinatorial book, an English book, and a commercial ginger tea (!) will arrive at the company. will be delivered to the company.
 
 *1197088163* One of the Day
 
 For a moment, I thought there was some kind of event. On second thought, this one was the original.
 
 *1197088307* Geez.
 
 They are building something exaggerated in front of the company!
 f:id:nishiohirokazu:20071208133139j:image
 
 It may be hard to tell from the picture, but we are building a huge Christmas tree.
 
 *1197093328*The Greatest Cowboy Tournament in the World
 -The Best Cowboy Tournament in the World
 --http://onosendai.jp/championship2007/cowboychampionship.html
 
 I filtered it by name and didn't read it until now, but I should have attended. I should have joined the secret guest, my physics teacher! I haven't seen him in a few years because of the mess of the case.
 
 *1197094669* Train home
 I made a reservation for the Shinkansen departing from Tokyo at 16:20 on December 28. It was easy to use the station net, JR++.
 
 Several flights were already booked up with reserved seats.
 
 I will arrive at Shin-Osaka at 9:00 p.m., but where should I have dinner...
 
 *1197098125*Jython本執筆日記
 Reading it again, I wonder if I'm writing too carefully about Eclipse installation and so on.
 It is written to the point where you forget to specify the classpath and get an error.
 
 There was a time when I was depressed and thought, "I'm sorry to leave it like this," but I knew that there must be some people in the world who are looking for this kind of writing.
 
 *1197101870*Move section 1 of chapter 7 to chapter 6
 How to serialize and arrange the various pieces of information, which are not arranged in a linear fashion, is difficult.
 
 Blogging is probably easier because there is no need for serialization.
 
 -----
 
 Wow, I suddenly found my keyboard unresponsive and svchost is using 100% of it. I guess it's either a virus pattern or Windows Update coming down.... This is the kind of thing that hinders my writing.
 
 *1197103276*[writing] I think I might be getting the idea.
 I guess it was a mistake to try to imitate the type of person who writes continuously and painstakingly, when I do not have the ability to keep going in the first place. What would happen if I were to suddenly run a full marathon now and try to follow a veteran runner? I think that is what happened.
 
 I would like to be able to run a full marathon in the future, but for now it's not possible. And the constitution will not change overnight. So you should solve the problem in a way that suits you.
 
 In other words, I can't write in the way that I am now, like a steady pile of stuff, and I should do something more barbaric. By "barbaric things," I mean that when I was asked to make a calculator, I made a function calculator that could define functions because just making a calculator was not interesting, or when I was asked to make a rock-paper-scissors agent, I thought that if the rules were random OK, I might not win even if I did my best with the algorithm, so I ran with the story and made it into a one-liner, Or, when asked to talk about Jython in 5 minutes at the head of a session in the early afternoon when you feel sleepy, you make Fibonacci audible with MIDI to wake up the audience. Why don't you do a few more cases of that kind of savagery and write about it? And then, after you have something barbaric like that, why don't you make a chewed up commentary on it?
 
 I mean, you're already emulating class inheritance with hashes, outputting Fibonacci music to files, and doing some pretty barbaric things...
 
 *1197108401*生姜湯
 I thought ginger tea was just ginger, sugar, and starch, but there was a big difference between Sugimaru's ginger tea (http://www.sugimaru.com/seihin.html) and the 3 bags of 99 yen ginger tea sold at Shop 99.
 The difference between 63 yen and 33 yen is significant.
 
 I considered what produced this difference.
 
 Sugimaru's is 33g and 99's is 22g. If you add the same amount of hot water, it's 1.5 times thinner ORZ
 
 ---
 
 http://www.nittou-relay.com/121_204.html
 I want to taste this.
 
 *1197112787* It's getting colder.
 And I don't have the heat on.
 It is not earth-friendly to turn on the heat for just me in a large lab.
 
 I'm going home because it's cold.
 I will hack it without internet access when I get back.
 Hack hack.
 
 Curse me if I didn't get anything done on Monday.
 </body>

[Hatena Diary 2007-12-08 https://nishiohirokazu.hatenadiary.org/archive/2007/12/08]