Hatena2009-11-13
code:hatena
 <body>
 **1258074511*The Mystery of the Japanese
 New Year's Day? There was a video of "Mystery of the Japanese" that was broadcast on
 
 <a href='http://karapaia.livedoor.biz/archives/51526840.html'>The world of shrines you don't know. What is enshrined in shrines? 
 
 It was interesting to watch in parts in real time, but it is even more interesting to watch it through now.
 
 Also <a href="http://www.amazon.co.jp/gp/product/4344980603?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399& creativeASIN=4344980603">10 Major New Religions in Japan (Gentosha Shinsho)</a><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as2&o=9&a=4344980603" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px ! I was under the impression that Inari Shrine and others are "religions that were born at a certain time and gradually expanded their power. I wonder if the "new religions" that we now call "emerging religions" will become a part of our daily lives as they spread and become more and more localized, becoming like air.
 
 *1258087976* Looks delicious!
 Since yesterday, every time I see an ad below for pickled ginger honey or something on my own blog, I want to buy it...
 
 *1258105532*ScanSnap S1500 actual measurement data
 <a href="http://www.amazon.co.jp/gp/product/B001QXCZ12?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399&creativeASIN=B001QXCZ12">FUJITSU ScanSnap S1500 FI-S1500</a><img src="http://www.assoc-amazon.jp/e/ir?t=nishiohirokaz-22&l=as2&o=9&a=B001QXCZ12" width="1" height="1" border="0" alt="" style="border:none !important; margin:0px !important;" />
 
 >||
 194 pages in paperback
 Scanning 3m45
 OCR processing 6m35
 ||<
 I can't search vertical text with Mac Preview because of some special characters between letters (like "efficiency"). Acrobar Reader 9 can do it, and of course Spotlight search doesn't find it. Hmmm. Well, when a book is on the bookshelf in paper form, there are two phases: "I'm sure that's the book I'm looking for" and "After I find the book I want, I search inside the book".
 
 >||
 210 pages in paperback
 Cutting 3m20
 Scanning 4m29
 OCR processing 3m23
 ||<
 Cutting is done with a cutter knife. The reason I haven't been able to measure the cutting on the other books is generally because it's hard to measure them all together because I'm cutting while interspersing operations like unjamming while scanning the other books. It is a mystery why the PDF conversion process takes less time than the first book.
 
 >||
 354 pages of comic book
 Scan 5m53 (non-stop success)
 OCR processing 7m45
 ||<
 I forgot to deactivate it and OCR'd it even though it's a comic book. I can easily find the Philosopher's Stone:.
 <img src="http://gyazo.com/46a9e8c5ec672f531929f0be793cb1af.png">
 
 >||
 comic book
 Cutting 5m24
 Check for cutting errors1m43 (check for attached pages)
 Scan 10m19 (more trouble)
 OCR processing 9m09
 ||<
 
 I guess I shouldn't OCR comics after all.
 
 *1258123257* Brainstorm on "putting things away".
 Reprinted from Twitter
 
 >>
 nishio I finally understand now that tidying up means you have to have a place to put things away first. There was no way I would have been able to put things away if I had just moved them around randomly with the things that were around there. The next thing to think about is how to make a place to put things away.
 <<
 
 This "place to put away" was intended to be "the destination to put away" rather than "the space temporarily used to put away" but it didn't come across, so it was later reworded as "home position".
 
 >>
 nishio Great summary RT @boussk So the start of tidying up is to think about what to throw away.
 nishio The problem must be that it is difficult to decide what to throw away and what not to. If you can discard without thinking, the easiest thing to do is to go up to a building now and throw yourself off.
 <<
 
 But it does not mean that you can really throw anything away. You need to decide what to throw away and what not to throw away. Well, you don't throw away bankbooks and personal seals. The problem may be that we lack the ability to judge what to throw away.
 
 >>
 A: Cleaning up and B: Keeping things in the same state are two different tasks. Even I am able to keep the peels of mandarin oranges in a tidy state. I have been able to clean up the bottles of soft drink water that were scattered around my bed due to a cold. What exactly have I not done?
 <<
 
 >>
 The problem is that the subject that gives the impression of clutter does not have a "place to clean up" or home position, and the first task should be to select specific clutter and create a home position
 <<
 
 >>
 I recently made an eye mask hanger so I don't have to look for my eye mask before bed at night. I can also find my scarf because I decided to hang it on a hanger where I hang my jacket. I am able to put away things that have a fixed home position in their home position. That is the task to keep the B: state. What is not done is the task of setting the home position for the items that do not have a fixed home position. This is the task A: Putting things away.
 Things cannot be put away unless they have a "place to put away = home position". If a room is not put away, something specifically is not in its home position. There are two types of cases: one is that "the home position has not been decided yet" and the other is that "it has not returned to the home position.
 In other words, what is not done is "assigning a home position to something that has no home position". And since it is "something concrete that has no home position", "tidying up the room" is split into the subtask of "selecting something concrete uncluttered and determining its home position".
 <<
 
 In other words, "putting things away" is the act of "establishing a home position for things that do not have a fixed home position, and moving them to that position. If there is not enough space to create a clear home position, it is necessary to obtain space by throwing things away, moving to a bigger house, renting space, or rearranging the space.
 
 The purpose is to create space, and as a means to that end, it is necessary to throw away knives in some cases. For example, if you are wondering whether you have more space to gain by throwing away souvenirs bought on a trip or by putting things in order, the former is about a handful and the latter is about half a drawer, then of course the latter should take precedence. If the former is about the size of your hand and the latter is about half a drawer, then of course the latter should be given priority.
 
 A well-organized space is easy to use. Unorganized space is difficult to use. Even if some souvenirs are thrown out of a box in which they have been randomly shoved, the box will not shrink, so the effective space will not increase. That is not creating space. On the other hand, if you are organizing souvenirs and they no longer fit in the box, it is a good strategy to try to solve the problem by discarding some of them, since replacing them with another box will increase the space occupied by the box. This is a good strategy to solve the problem by discarding some of the souvenirs.
 
 What does it mean to say that throwing away souvenirs that are already in boxes does not create space? In other words, throwing away something that is already put away is not tidying up unless the entire box is thrown away.
 
 Summary:
 "Tidying up: = (create a cohesive space) + (select uncluttered items and move them to their home position (or create one if you don't have one))"
 </body>

[Hatena Diary 2009-11-13 https://nishiohirokazu.hatenadiary.org/archive/2009/11/13]