Hatena2007-10-31
code:hatena
 <body>
 *1193812510*The Early History of Nupedia and Wikipedia
 History of how Wikipedia has developed
 
 Slashdot | The Early History of Nupedia and Wikipedia: A Memoir
 http://features.slashdot.org/article.pl?sid=05/04/18/164213
 Slashdot | The Early History of Nupedia and Wikipedia, Part II
 http://features.slashdot.org/article.pl?sid=05/04/19/1746205
 
 I am struggling with how to develop the org I write into multiple languages.
 
 *1193814760*[Interview] "The Largest Encyclopedia in History" - A Volunteer Effort - Behind the Scenes of the Japanese Version of Wikipedia: Nikkei PC Online
 http://pc.nikkeibp.co.jp/article/Interview/20070313/264635/?ST=pc_news
 
 >>
 ■Do the respective language versions work together in terminology and operation?
 　Not at all. It is completely independent. The terms we publish and interpret differently in different languages, so it is difficult as a practical matter to collaborate with each other. The Wikimedia Foundation has a number of policies, and each of us operates autonomously based on them.
 <<
 
 I wonder if it will still happen.
 
 *1193823133*lexとyaccの勉強
 I made something like this.
 >||
 calc >1+2
 3
 calc >1+2*3
 7
 calc >1+2 * 3
 9
 ||<
 
 *1193829034* How to write org.
 I wondered why I was getting so many accesses from RjpWiki and wondered if it had been added to the links page or something, but the link was on the top page!
 That's what I thought when I saw more and more postings in R!
 
 *1193842572*左手
 Mwah, I just played one game of WiiSports bowling with my left hand yesterday at the provocation, but something is wrong with my left hand. My wrist hurts and I have a dull feeling of heat in the back of my hand.
 
 It must be tendonitis.... I put a compress on it anyway.
 
 I don't notice it while I'm healthy, but health is very important. I can still use my right hand, but if I were to have an accident or something and lose the use of both hands, I would not be able to continue my current job.
 </body>
 <comments>
 <comment>
 <username>Yoshiori</username>
 <body>That's exactly what I'm talking about, "How would you write this sentence here? How would you write it in English?" Why not? </body>.
 <timestamp>1193814851</timestamp>
 </comment>
 <comment>
 <username>amachang</username>
 <body>Parser! Parser! </body>
 <timestamp>1193824516</timestamp>
 </comment>
 <comment>
 <username>earth2001y</username>
 <body>スペースで優先度付けktkr!!</body>
 <timestamp>1193839643</timestamp>
 </comment>
 </comments>

[Hatena Diary 2007-10-31 https://nishiohirokazu.hatenadiary.org/archive/2007/10/31]