Hatena2011-09-04
code:hatena
 <body>
 *1315062816* "I have Asperger's, but I'm a wife, mother, and president." Leverage Memo.
 My wife bought it and I read it <a href="http://www.amazon.co.jp/gp/product/4804761853/ref=as_li_ss_tl?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp =247&creative=7399&creativeASIN=4804761853">"I have Asperger's, but I'm a wife, mother and president." </a>
 
 The author, who had low self-esteem, changed his way of life and became happy after being diagnosed with Asperger's (high-functioning autism) with strong ADD (Attention Deficit Disorder) tendencies. I had thrown the book away once because of the painful preface, but when I read it, I found it quite interesting. I heard that after he found out that he had Asperger's, he decided to create his own handling manual, which he repeatedly practiced and made clear. The 30 rules are written in three chapters.
 
 Many of the rules themselves are helpful even if you don't have Asperger's. For example, daily one-person meetings are often mentioned in other books, but in this book, "spending free and imaginative time" is woven into the one-person meetings, which is interesting. It is also interesting to note that "gossip and bad-mouthing people are subjective, and even if you try to confirm the facts, you may end up hurting people, so it's better to ignore them. If you have a lot of tasks and start to get confused about what to do next, it is okay to ask others to decide which ones you should do, or try to calm your mind by doing mindless tasks, or draw a mind map to try to grasp the big picture. I'll put "rub your ears when you need help" into practice next time, lol.
 
 Also, the idea that "the first priority when you deviate from the rules is to wait until you are calm so as not to spread the wound, and not to blame yourself too much" is an important point in setting rules, isn't it? It is helpful.
 
 PS: Since this is a viewpoint from the parties involved, it is not suitable for those who have no knowledge about Asperger's and want to know about Asperger's from an objective point of view. For those who want to know objectively <a href="http://www.amazon.co.jp/gp/product/4535560951/ref=as_li_ss_tl?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp= 247&creative=7399&creativeASIN=4535560951">Autism by Akira Nakane</a> is recommended.
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4804761853" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe><iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&ref=ss_til&asins=4535560951" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 *1315062977*英単語日記13
 前回は7/20。<a href='http://d.hatena.ne.jp/nishiohirokazu/20110720/1311168311'>英単語日記12</a>。
 
 In the doldrums of the sepcan, I forgot to clean up my word study. A whole bunch of word cards are past their scheduled test dates. Let's just put them away from the end as we see fit.
 
 1st month test scheduled 8/21, confused savor and savage. ok76 ng13. 1st month test scheduled 8/20. ok74 ng13. about 1 pomodoro for these 2 tests.
 The 27 cards in the bundle that were the 1-month test from the beginning because they were correct at the start of 6/7, OK27, all correct. buffer for 16-day test, OK27NG18. well, the cards in the buffer for the 16-day test are for the 16-day test, so the correct answers to these should be sent to the 1-month test, OK? Do I mix them with the 27 cards that were all correct earlier to make one bundle?
 Next is 8 day test buffer, OK 15 NG 10. next is 4 day buffer, and this is where the cards for translation issues start to grow. It's weak. The next one is a 4-day buffer, and around this time, the translation cards get weaker. I'm asking you not to forget to add "the" to "refrigerator" in "Where are the eggs? And I still get it wrong. I put in the hardest words in level 12, so I can't remember abdicate, abominable, abhor, etc. OK10 NG12...more incorrect answers...7/25 test on day 2...OK20 NG6...buffer while studying...OK5 NG8..., OK5 NG8... Well, that took care of the whole stack of vocabulary cards... The buffer during study got so big because of all the NGs... 80 cards in all... 80 cards in total.
 </body>

[Hatena Diary 2011-09-04 https://nishiohirokazu.hatenadiary.org/archive/2011/09/04]