Hatena2009-08-09
code:hatena
 <body>
 *1249791504*Diary
 I forgot to put out the garbage again, so my room is full of empty cans. I thought to myself, "This time I'll take out the trash," but I was away at a programming camp on the next trash day.
 
 You say, "I write on Twitter so I don't have anything to blog about," but at least one reason I blog is that I can search for it later, so it's hard to substitute Twitter. I did Fourier analysis in Python before. I did it in Python before. Easy, easy, wait a minute, I'll do a search. I'm writing this to do something like:<a href='http://www.nishiohirokazu.org/archived_coreblog/962'>Spectrum Analysis in Python @ NISHIO HIROKAZU # Archived COREBlog</a>". I don't even remember the code from 3 years ago.
 
 Twitter is a service that seems to have expanded the "communication aspect" of blogging. In blogging, if you want your blog to have value as a place for communication, it is important to update it frequently to some extent. The better you are at writing, the faster you will be. The limitation of the number of characters on Twitter lowers the psychological threshold for writing a poor piece of writing.
 
 On the other hand, it is not suitable for writing coherent sentences, and it is difficult to read the flow of the timeline before and afterwards when searching later.
 
 Blog entries that reprint Twitter posts as is, saying "Tweet of the Day" are hard to read, but I wonder what I'm missing.
 
 And well, there is no law against writing these coherent sentences and blogging about it.
 
 *1249814034* Doomsday Theory 1st contact
 <a href='http://kiretsu.itoyanagi.name/'>The Happiness Crack Project</a> will be releasing this book at Summer Comic Con!
 
 <img src="http://gyazo.com/374c0b9ba04543d3aa16a72f88df61b6.png">
 
 <img src="http://gyazo.com/c31adca2a3c24314ffc571c397a86f79.png">
 
 <img src="http://gyazo.com/bf7d50ec35e8b6bd98f86ad07fb5d7b2.png">
 
 My manuscript looks like this:.
 
 <img src="http://gyazo.com/9a6f6264b8b8f2eec3fbf4d7899452ee.png">
 
 I was told that it was like a technical book, so I gave the source code and explained it, but I was the only one who put the source code.
 
 Whether or not the cover will be the image above is undecided, and there is a possibility that it will be a psychotic black-and-white cover, appropriating an unpublished work of mine:)
 
 <img src="http://gyazo.com/ca9be8056b4691d7b94000c29396c660.png">
 </body>

[Hatena Diary 2009-08-09 https://nishiohirokazu.hatenadiary.org/archive/2009/08/09]