Hatena2010-10-28
code:hatena
 <body>
 *1288239304*How many hours does it take to crush one roll of petit petit?
 Here is a roll of puchi-puchi. If you crush one every second, how many hours will it take to crush them all?
 
 
 f:id:nishiohirokazu:20101028130616j:image
 
 Answer by selecting the closest match from the following options:.
 - A: 0.13 hours (8 minutes)
 - B: 1.3 hours
 - C: 13 hours (half day)
 - D: 130 hours (5 days)
 - E: 1300 hours (50 days)
 
 Answers will be available when you get home.
 
 <hr>
 
 Solution Edition.
 I had the real thing in front of me and was able to measure it, so I had quite an advantage, but, well, I guess it was a reasonable question because everyone answered it correctly except for a few careless mistakes.
 
 The roll was about 120 petits vertically, 120 on the outside, 24 on the inside, and 56 from the outside to the inside, which means (24 + 120) / 2 * 56 * 120, or about 480,000 petits. 480,000 petits are crushed one per second, so divide by 3600 to get the number of hours it would take. 134 hours. So the correct answer was D.
 
 Even if we were to make a mistake in estimating the length, width, and height by about 50%, it would only be 1.5 * 1.5 * 1.5, or 3.375 times, so it would not be difficult to choose from the 10-fold spacing options.
 </body>
 <comments>
 <comment>
 <username>Crimson_Apple</username>
 <body>I could be wrong...but...isn't it E? <BR><BR>----------------------------------------------------<BR>Assuming<BR>Π = 3.14<BR>Mackie = about a little over 13 cm? <BR><BR>Estimate the length of the cylinder of the sheet being rolled up. <BR>Sheet<BR>130 cm long, 40 cm outside, 6 cm inside<BR><BR>Puchiuchi is probably about this big. <BR>Puchiuchi<BR>Assume 8mm wide petit puchi are lined up at 5mm intervals. <BR><BR>Assuming that the thickness of the sheet is approximately equal to the thickness of the Petit Pouch<BR>Assuming that the thickness of the Petit Pouch is about 3mm. <BR><BR>Assume that the approximate thickness of the sheet is 4 mm if the bulge of the sheet's backing is taken into account. <br><br>If we assume that the spiral sheet is made up of overlapping concentric circles,<br>the length of the sheet can be calculated from the above conditions using the following equation. <br>40Π+(40-0.8)Π... <br>6.4Π = 997.6Π<br><br>Number of vertical lines<br>130÷0.8≒162 pieces<br>Number of horizontal lines<br>997.6Π÷1.3≒766Π<br><br>General petite petites are supposed to be arranged in a diamond-shaped grid, but if the diamond-shaped grid is shifted, the line becomes a straight line. <br><br>The rhombic lattice is a straight line, so it can be calculated as it is. <br><br>The number of all pieces <br>766Π pieces x 162 pieces = 124092Π pieces<br><br>Change to time unit since we crush one piece per second<br>124092Π÷360=344. 7Π<br><br>The number of all pieces is 766Π pieces x 162 pieces = 124092Π pieces<br><br><br>The number of all pieces is 766Π pieces x 162 pieces = 124092Π pieces<br><br><br>The number of pieces is 766Π pieces x 162 pieces = 124092Π pieces<br><br><br>The number of pieces is 124092Π÷360 = 344. 7Π<br><br>If we use Π = 3.14. <br><br>It is found that it takes approximately 1082.358 hours to finish crushing. <br>----------------------------------------------------<br><br>Something like this? </body>
 <timestamp>1288243654</timestamp>
 </comment>
 <comment>
 <username>kuboon</username>
 <body>One row takes one minute. 60 cm advance in one hour, so about two hours per roll. The thickness is less than 1 cm, so the radius is reduced by 10 cm in one day. Therefore D</body>.
 <timestamp>1288244790</timestamp>
 </comment>
 <comment>
 <username>TOKOROTEN</username>
 <body>http://www.baikado-shigyo.co.jp/service2.html<br>If we look at this, one roll is 50m, so we estimate the total area to be about 120cm * 50m<br><br>http://www.baikado-shigyo.co .jp/service2.html<br>If we look at this, the area per petit petit is about 13mm * 13mm? <br><br>I put the above into a google calculator and got <br>(((((120 cm) * 50 m) / ((13 mm) * 13 mm)) / 60) / 60) / 24 = 4.10913872<br>It seems to be about 4.1 days, so maybe D? </body>
 <timestamp>1288244948</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>>>Crimson_Apple<br><br>Ohhhh, "÷360" at the last minute... What a waste of time, even though it's almost always correct... </body>
 <timestamp>1288268021</timestamp>
 </comment>
 <comment>
 <username>Crimson_Apple</username>
 <body>Hoa! Oh shoot! </body>
 <timestamp>1288348149</timestamp>
 </comment>
 <comment>
 <username>Crimson_Apple</username>
 <body>Hoa.... It was a mistake for which there is no excuse...! </body>.
 <timestamp>1288349151</timestamp>
 </comment>
 </comments>

[Hatena Diary 2010-10-28 https://nishiohirokazu.hatenadiary.org/archive/2010/10/28]