Hatena2012-08-29
code:hatena
 <body>
 *1346174301* Visualization of the structure of the Heart Sutra
 I had always thought that the structure of the Heart Sutra was interesting and wondered if I could do something good with it, but until now I had only been thinking about visualizing it as a two-dimensional image. I couldn't sleep and was in a daze when it suddenly occurred to me that it would be better to express it using sound and images as a moving image, so I wrote a storyboard for now, and while I was at it, I tried drawing a clean copy in Keynote and adding colors.
 
 Since there is no sound included yet, those who cannot recite the Heart Sutra may want to find an audio file on Youtube or Nico Nico Douga and flip through the pages in time with it.
 
 <iframe src="http://www.slideshare.net/slideshow/embed_code/14096753" width="427" height="356" frameborder="0" marginwidth="0" marginheight="0" scrolling="no" style="border:1px solid #CCC;border-width:1px 1px 0;margin-bottom:5px" allowfullscreen> </iframe> <div style ="margin-bottom:5px"> <strong> <a href="http://www.slideshare.net/nishio/ss-14096753" title="Heart Sutra" target="_blank">Heart Sutra</a> </strong> from <strong><a href="http://www.slideshare.net/nishio" target="_blank">nishio</a></strong> </div
 
 Postscript. Explanation of the colors attached to the letters.
 - Blue is the image of a mountain top. Enlightenment, wisdom, excellence. Prajnaparamita, anuttara samyak sambodhi, ultimate nirvana.
 - Yellow is a word referring to a person. Kanjizajibodhisattva = Bodhisattva&#22517;, Sharishi = Saariputta, the Buddhas of the three generations.
 - Light blue is the word for empty, nothingness, and the "remove" system. I think some may object to the idea of grouping removing with empty or nothing.
 - Red is the thing. The part of "~" referred to as "~ is empty" or "~ does not exist." All things and senses = the five skandhas, color, thought, action, perception, eye, ear, nose, tongue, body and will, color, voice, smell, taste, touch, etc. It is a little regrettable that the three-fold meta-reference of "no more ignorance and no more exhaustion of ignorance" is not fully expressed in colors.
 - Purple is a spell. 
 </body>

[Hatena Diary 2012-08-29 https://nishiohirokazu.hatenadiary.org/archive/2012/08/29]