Hatena2010-08-18
code:hatena
 <body>
 *1282131226* The road to hell is good intentions...
 <a href='http://d.hatena.ne.jp/kenjiaiko/20090922/1253630999'>Pattern of interpretation of the famous quote "The road to hell is always full of good intentions" - KENJI'S BLOG</a>.
 <a href='http://d.hatena.ne.jp/keyword/%C3%CF%B9%F6%A4%D8%A4%CE%C6%BB%A4%CF %C1%B1%B0%D5%A4%C7%CA%DE%C1%F5%A4%B5%A4%EC%A4%C6%A4%A 4%EB'>The Road to Hell is Paved with Good Intentions - Hatena Keyword</a>.
 
 *1282132372*Daily
 There seems to be a misconception that because there have been so many diaries about tidying up recently, people think that I am tidying up very much, but a diary is not an equal sampling of everyday life. What we take for granted in our daily lives does not motivate us to write in our diaries, so what we write in our diaries is extraordinary. In other words, tidying up is an unusual thing to do, and I haven't tidied up at all!
 
 I went to the 100 yen store on the way home today and bought pasta sauce and cut salad, came home for the first time in about a week, screened the windows to ventilate the room, put the pasta in a container and put it in the microwave, set the timer to heat for 13 minutes, and put the clothes in the washing machine. I put the pasta in a container, put it in the microwave, put it on a heat timer for 13 minutes, remove from the washing machine the things that I have to wear but will have a hard time hanging out to dry because it looks like it will rain tonight, put detergent in the washer and run it, then put two containers to make barley tea that were left in the sink (SEE <a href='http://d.hatena.ne.jp/nishiohirokazu/20100725/ 1280045661'>Double buffer of barley tea</a>), washed them, filled them with water and put a pack of barley tea in them, and then I opened the fridge and found two 500ml bottles of barley tea in the fridge, and I thought to myself, "Oh, they're both out, that means there's no drink - I should have bought some! GJ! I put the pasta sauce in the container first, then put the pasta on top, mixed it well, ate it, put 140g of salad in the leftover sauce, ate it, and was thinking, "I'm full of vegetables," while I was writing on my blog, the laundry was done! I'm going to hang it up now!
 
 It's just another day in the life of the company.
 
 *1282144562* For a moment it seemed like a good argument.
 >>
 I'll tell you something, because sometimes some kids get it wrong. What readers have is not the right to change the story of a work. It is the right to choose whether or not to read the work. If you don't like it, you can stop reading it."
 <<
 <a href='http://blog.livedoor.jp/dqnplus/archives/1528469.html'>That's right, the author of Bleach: "Those who complain and drag their feet without talent and without effort should just open their mouths, eat rain and dust, and barely survive. Livedoor Blog
 
 Let me tell you something that sometimes people misunderstand. What you have is not the right to stop others from criticizing you. You have the right to choose whether or not to read the criticism. If you don't like it, you can stop reading it.
 
 Ahhhh, that's a brilliant boomerang! Someone should tell him, "Why don't you just block it?
 </body>

[Hatena Diary 2010-08-18 https://nishiohirokazu.hatenadiary.org/archive/2010/08/18]