Hatena2009-10-11
code:hatena
 <body>
 *1255227148* Malnutrition of stimulus
 Just as the human body seeks nourishment, the human brain seeks stimulation.
 
 If they don't eat and their blood sugar drops too low, they feel too sick to act. They eat snacks that they have bought because it is too much trouble to go out to eat or buy them. Although the sugar temporarily distracts them from their hunger, the human body does not run on sugar alone. It needs a wide variety of vitamins. If you only take sugar, your health will deteriorate.
 
 The same is true of the brain. When it lacks a certain type of stimulation, it gets "brain tone" and can't be bothered to take action. It is too much trouble to go outside and look at twitter or b.hatena. What is there is indeed a stimulus of "new information". The "hunger in the brain" is temporarily satisfied. However, the human brain is not satisfied only with new information. It needs a wide variety of stimuli.
 
 List of potential "brain nutrients" you might want to have
 - Walking, swimming, etc. (rhythmic movement and resulting feedback stimulation)
 - Aroma, etc. (stimulation of the sense of smell)
 - Laughing, crying
 - raise one's voice
 - Crowds (stimuli in the form of other people's faces and voices)
 - Changes in temperature, humidity and weather
 - Physical Movement
 
 This makes me wonder if this information was important to humans and animals before the development of written civilization.
 
 *1255228813* Big printer
 It arrived. It's huge. It's heavy.
 f:id:nishiohirokazu:20091009171014j:image
 f:id:nishiohirokazu:20091009171614j:image
 I was going to clear out a section of the shelf, a little higher than eye level, and put it there, but it was too heavy to store there by myself. I gave up and decided to build a new shelf out of blocks.
 f:id:nishiohirokazu:20091009182137j:image
 I managed to install it.
 f:id:nishiohirokazu:20091011131639j:image
 There are 9 inks. I almost put the light magenta ink in the light cyan ink by mistake after this. I'm glad I noticed that they are color-coded.
 </body>

[Hatena Diary 2009-10-11 https://nishiohirokazu.hatenadiary.org/archive/2009/10/11]