Hatena2007-11-12
code:hatena
 <body>
 *1194818654* I woke up.
 I'm hungry.
 
 *1194823418*Response to disease coming out
 You have 26 Stars for yesterday's disease coming out.
 
 >>
 jbking "Why don't you just go to the hot springs for a day and not think about anything else?"
 <<
 
 I feel like I went to a hot spring for two nights and three days and came back without doing what I should have done.
 
 >>
 perezvon [Yasukazu Nishio].
 <<
 
 You don't have to tag it like that, it's in the title.
 
 >>
 jknaoya 25 Stars
 <<
 
 You put too much on!
 
 *1194825479*Calendar
 Huh? Today is Sunday? I thought, but it was the August calendar.
 
 *1194827164*No holiday pattern
 See, bug patterns, anti-patterns, that kind of thing.
 
 - Staying up late the night before OR going to bed without an alarm
 - Wake up after midnight OR forget to prepare food
 - Blood sugar drops and activity slows down OR you suddenly turn on the computer.
 - It's dark before you know it.
 - Go out for dinner.
 - Blood collects in the stomach and makes you sleepy OR you start to get a headache
 - I'm not working, so I go to bed around 9pm.
 - I wake up around 25:00.
 - Lazy or sleeps and wakes up
 - It's bright when you come to your senses.
 - I'm tired, so I'm going to bed.
 - When I wake up, it's past midnight. Back to the top.
 
 Mm, the reason why we cannot make the most of our holidays is obvious. We should wake up at the same time on holidays as we do on weekdays.
 
 ---
 
 PS: I casually read in a book that this kind of thing is frontal lobe damage.
 
 *1194831369*Train is running late.
 
 Perhaps a cultural day?
 
 *1194842523*Anti DNS Pinning
 http://www.jumperz.net/texts/anti_dns_pinning.html
 
 I learned. I guess it's no good to think, "It's for internal use (local IP address), so there's no need for access restrictions or anything like that.
 
 *1194843414* Life hacks to improve quality of life.
 Today, while dozing off on the train on the way to work, I was thinking that if there is a way to do pair programming to improve the quality of programs, there is also a way to do pair living to improve the quality of life. Both require a collaborator, though.
 
 *1194876398* I made something weird.
 Inspired by Takesako
 
 I'll publish it after Takesako's original.
 
 My back is super sore.
 </body>
 <comments>
 <comment>
 <username>perezvon</username>
 <body> tag will be useful when you write "Legend of Yasukazu Nishio" later.
 <timestamp>1194840847</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>No, the legend of "Just gut-punch it and the line breaks are gone from my Python script!" is now being debunked by his own blog post! To make it a legend, the evidence must be erased! (Yeah</body>.
 <timestamp>1194845073</timestamp>
 </comment>
 <comment>
 <username>earth2001y</username>
 <body>Wow, that's me this weekend</body>.
 <timestamp>1194879992</timestamp>
 </comment>
 <comment>
 <username>jbking</username>
 <body>I didn't word it well enough. I wanted to say, "Why don't you put the machine away, don't think about writing at all, and go soak in the hot springs for a day and just relax?" I wanted to say, "Why don't you leave the machine behind and go soak in a hot spring for a day and relax? I did go to the hot springs, after all. </body> <body>
 <timestamp>1194938981</timestamp>
 </comment>
 </comments>

[Hatena Diary 2007-11-12 https://nishiohirokazu.hatenadiary.org/archive/2007/11/12]