Hatena2008-08-16
code:hatena
 <body>
 *1218859744*Household Diary
 Oh no, it's already been an hour since I woke up. I'm in the typical "my day off is over while I'm slacking off" mode.
 
 
 I thought it was going to rain heavily, but the cicadas are singing. It seems it won't rain for a while yet.
 I checked the Tokyo Amesh, but it's not raining at all. I checked the typhoon information on tenki.jp. What, it's just passing offshore? I'm going to do laundry.
 
 -----
 
 Compared to the past when I could not do household chores as much as I used to, I am a little better off. I think the reason for the improvement is that I now finish "tasks with waiting time," such as running the washing machine or using the rice cooker, ahead of time and use the waiting time to do other household chores. Until now, I would cook rice, play with my computer while waiting for the rice to cook, and then forget that I had cooked rice.
 
 -----
 
 id:snow-bell taught me how to make fried rice, so I bought the ingredients. Like eepa.
 
 f:id:nishiohirokazu:20080816133759j:image
 
 -----
 
 I only bought bitter melon because I thought there would be frozen vegetables in the freezer that I would have to take care of, but surprisingly there were no frozen vegetables. No, there were, but I thought it would be a good idea to put them in fried rice with some potatoes for simmering. And spinach. Mooo. I'll just use bitter melon.
 
 -----
 
 I have to get this out of the way first.
 f:id:nishiohirokazu:20080816135103j:image
 
 -----
 
 Finished washing and cooking rice, but it's raining... bright sky, so I guess it's raining locally. I'm going to watch for a while and cook rice and rice.
 
 First mix with eggs
 f:id:nishiohirokazu:20080816142157j:image
 
 bitter gourd
 f:id:nishiohirokazu:20080816143027j:image
 
 Seeds.
 f:id:nishiohirokazu:20080816143544j:image
 
 We don't have a stove.
 f:id:nishiohirokazu:20080816144200j:image
 
 Stir-fry for now. I think the rice came first.... Oh well.
 f:id:nishiohirokazu:20080816144659j:image
 
 Less oil. Is this okay?
 I didn't remember when to put in the wapers, but I thought I didn't want the bitter melon to have any flavor, so I put them in here.
 The sea chicken is brown. Oh, I should have fried the bitter melon first.
 f:id:nishiohirokazu:20080816145505j:image
 
 I wonder how much I should fry. I ended up putting the wapers in the rice side as well.
 f:id:nishiohirokazu:20080816150305j:image
 
 Mix.
 f:id:nishiohirokazu:20080816150718j:image
 
 -----
 - Rice is overcooked and partially snackable (crispy)
 - Mainly the sea chicken, which sucked up the wafers, is too flavorful.
 - Bitter a little due to insufficient cooking time of bitter melon
 
 **-----
 
 I started my diet yesterday.
 - One cup of rice has less than 600 kcal
 - A can of sea chicken contains less than 60 kcal
 - Less than 40 kcal for one bitter melon
 - And a little oil.
 I'd say 700 kcal total.
 
 The energy requirement for a male in his 20s at Life Intensity 1 is 2000 kcal. http://www.herbism.net/lib004.html
 
 I still have about half of the fried rice left, but I'm not hungry, so I guess I'll leave it. Maybe I'll pack it in Tupperware and freeze it...
 
 *1218887075*Diary of Housework Part 2
 Split up because it got long. I'm hungry.
 
 I bought them at random without thinking about what to make.
 f:id:nishiohirokazu:20080816204631j:image
 
 I was told to boil komatsuna without cutting it, so I'm going to try it. But if I don't cut it, it's hard to wash around the roots.
 
 
 f:id:nishiohirokazu:20080816205515j:image
 
 I chopped it up anyway, undecided what to make.
 f:id:nishiohirokazu:20080816210135j:image
 
 Chop boiled komatsuna. It was easier than in the microwave. The color was more beautiful than in the microwave, probably because salt was added to the boiling water.
 f:id:nishiohirokazu:20080816210816j:image
 
 Sprinkle more salt and leave it.
 f:id:nishiohirokazu:20080816211432j:image
 
 The carrots were somehow chopped and fried in sesame oil, then simmered in water and chicken broth. The little guy did it.
 f:id:nishiohirokazu:20080816211844j:image
 
 Oh my, here comes Kitsune Udon..." (the voice of a midget)
 f:id:nishiohirokazu:20080816214025j:image
 
 In the end, it became kitsune udon with lots of vegetables. I mean, you don't need to add chicken soup....
 f:id:nishiohirokazu:20080816214539j:image
 
 -----
 
 Calculating calories while huffing and puffing
 - 1/4 cabbage 80 kcal
 - 1 carrot 70kcal
 - 1-2 bunches komatsuna 15 kcal
 - Pack of udon noodles 310 kcal
 Total 475 kcal.
 
 Calculating calories for breakfast after all this time.
 - Soukai Vitamin 182kcal
 - 10 tablets of Evios 7kcal
 Total 190 kcal.
 
 I left half of my lunch, so if I count 350 kcal, my calorie intake for today is a little over 1000 kcal, minus 1000 kcal, since I consume 2000 kcal. Since 1 kg of body fat is equivalent to 7,000 kcal of excess calories, I should be able to lose 1 kg per week if I keep this diet. Well, I don't think I can keep it up, so I guess I'll have to exercise what I can't.
 
 Compare with usual meal: Sukiya's Negitama Pork Bowl with Negi Tamago Pork Bowl with Pork Soup and Salad Set 921kcal
 
 *1218911320*[TopCoder]SRM 413 Div1
 I've submitted easy and medium, read the problem statement for hard, but I don't think I can implement it in the remaining 20 minutes. gcd and lcm are in Boost, but I found out that boost::rational exists. But I haven't come up with any algorithm at all.
 
 EASY was dropped in the subsequent system test. I implemented it in the straightforward way I came up with, it failed in the test at hand, and I did my best to fix it. I think medium is easier.
 
 The problem is how to make the process of writing and submitting a document, receiving the next document, writing and submitting the next document, and so on, again in a short period of time. However, the window for submitting documents is only open for a certain number of hours in a day, and if the window is closed even after the documents are completed, you have to wait until the window opens. The question is how many hours minimum it takes to complete the process from the time you start writing the documents.
 
 It was not possible to submit the documents when the window opens on the first day, write the documents you receive, and if the window is closed, then clock forward to the time the next window opens. For example, if the window is open for one hour and the document you receive on the first day takes two hours to write, it would take less time to submit it just before the window closes because the result would be the same whether you submit it when the window opens or when it closes. Hmm.
 
 ↓ Unelegant code that looks like it is struggling
 >|cpp|
   int visaApplication(vector <int> forms, int dayLength, int openTime) {
     vector<int> start;
     int t = -forms[0];
     start.push_back(t);
     t += forms[0];
 
     size_t N = forms.size();
     for(size_t i=1; i<N; i++){
       // wait
       if(t % dayLength > openTime){
 	t = (t / dayLength + 1) * dayLength;
       }
       // submit
       start += t; // got another
       t += forms[i];
     }
     if(t % dayLength > openTime){
       t = (t / dayLength + 1) * dayLength;
     }
     // submit last one
     int head = t;
     // packing phase
     //DP(start);
     for(size_t i=N-1; i!=-1; i--){
       if(start[i] + forms[i] == head){
 	head = start[i];
       }else{
 	// pack?
 	int lasttime = openTime - (start[i] % dayLength);
 	int gap = head - start[i] - forms[i];
 	if(gap < lasttime){
 	  start[i] += gap;
 	  head = start[i];
 	}else{
 	  start[i] += lasttime;
 	  head = start[i];
 	}
       }
     }
 
     return t - start[0];
   }
 ||<
 
 The problem for medium is simply that given the strings acd, be, efg, make abcdeefg.
 >||
 a_cd
 _b__e
 _____efg
 ||<
 
 The source code looks like this: slice is inserted from my toolbox.hpp, where I've written a lot of detailed utility functions. It is a Python slice-style string manipulation, where x[1:] becomes slice(x, 1, ""). The algorithm, as you can read, is just to add the number soldier and then sort and take the first letter of the top one in order. Simple.
 
 >|cpp|
 string slice(const string &s, int start, int end){
   if(end < 0) end += s.size();
   if(start < 0) start += s.size();
   if(start > end) return "";
   return s.substr(start, end - start);
 }
 string slice(const string &s, int start, const string&){
   return slice(s, start, s.size());
 }
 
 class StringInterspersal {
 public:
   string minimum(vector <string> W) {
     string result = "";
     for(size_t i=0; i<W.size(); i++){
       W[i] += ('Z' + 1);
     }
     while(1){
       sort(W.begin(), W.end());
       if(W[0][0] > 'Z') break;
       result += W[0][0];
       W[0] = slice(W[0], 1, "");
       if(W[0].empty()){
 	W.erase(W.begin());
       }
     }
     return result;
   }
 ||<
 
 The rating managed to go up, 1489.
 The battery in my MacBook is about to run out.
 </body>
 <comments>
 <comment>
 <username>kyoheif</username>
 <body>If you slice the bitter melon and soak it in a small bowl of salted water (a pinch of salt) for about 10 minutes, the bitterness will be greatly reduced. <br>It is difficult to make a good fried rice, so I think you should make bitter melon stir-fry. It is surprisingly easy to make. <br>If you buy pork belly that doesn't have much fat on it, the calories will be fine. </body>
 <timestamp>1218901864</timestamp>
 </comment>
 <comment>
 <username>jj1bdx</username>
 <body>I think that pork bowl + egg probably only contributes to weight gain :)<br>If you are careful from your current age, you won't end up like me. </body>
 <timestamp>1218926358</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-08-16 https://nishiohirokazu.hatenadiary.org/archive/2008/08/16]