Hatena2011-05-18
code:hatena
 <body>
 *1305718594*git add and git commit undo method (ver.2)
 As an exercise to make a cheat sheet, I made a diagram of what happens in add and commit and how to undo at each stage (note: there are some mistakes, so please read to the end).
 
 <img src="http://gyazo.com/5065515e112cf67bd65b9ee23f0ffc7f.png">
 
 It's hard to tell that it's one point in a set of three verticals, so maybe it would be better to reduce the vertical width a little more?
 
 I also tried to clarify HEAD, which is omitted only on the rightmost part of the bottom, but if you want to clarify that part, you should also clarify the second one from the right, and that would be too long and annoying, so I think it would be better to omit both.
 
 p.s.
 
 The git rm A on the far left is a mistake for git rm --cached A. The reason why git reset is not good here is that initial commit has not been done yet at this point.
 
 I could only specify <path> for git reset without --hard or --soft......................................better use checkout. thanks id:Yuichirou !
 
 version.2
 <img src="http://gyazo.com/e04057c8fda44acccab0839d11ed1dd3.png">
 I may need to write about "--" as an explanation outside the column. If I specify "A" as a file and a reference named "A" exists, won't it be interpreted as the commit object to which the reference refers? Conversely, if I specify HEAD as a reference and a file named HEAD exists, won't it be misinterpreted as referring to that file? I wonder if it is correct to say that the special keyword "-- can only mean HEAD" has been introduced to eliminate such ambiguity.
 
 I wrote the story as a story about creating a repository, but it seems that some people interpret it as a story about adding files to an existing repository and updating it. I thought it would be better to write a story about that, since I think it is rare. As for how to create a repository, I thought it would be better to write "creating a repository is just git init and committing README" like the github explanation.
 </body>
 <comments>
 <comment>
 <username>Yuichirou</username>
 <body>Second from right below, git reset --hard cannot specify a file. git checkout [--] A or git checkout HEAD A is correct. </body>
 <timestamp>1305739265</timestamp>
 </comment>
 </comments>

[Hatena Diary 2011-05-18 https://nishiohirokazu.hatenadiary.org/archive/2011/05/18]