Hatena2012-03-25
code:hatena
 <body>
 *1332659813*Diary of a visit to Java-ja Hot Springs
 I returned safely! (to be written gradually)
 
 <hr>
 
 I arrived around 9:00 and there is a proper meal.
 
 <hr>
 
 In the meantime, I will publish Language Girls' Club 3, which I wrote on the train on the way there.
 
 <hr>
 
 There is plenty of material for a girls' night out.
 
 Java "The minimum machine memory is 8 gigabytes, and people who say Eclipse is too heavy are spending too much money on memory.
 Python: "Well, I only have 2 gigs, but I'm comfortable - I don't need a GUI."
 
 <hr>
 
 Alloy is good stuff. The use cases where I use Haskell are all taken away by Alloy.
 
 <hr>
 
 I didn't know Bootstrap, so I don't even smell Bootstrap.
 
 I'll use it for now.
 
 <hr>
 
 A self-proclaimed "not bad monster" was wktked to play the board game.
 
 <hr>
 
 There is plenty of material for a girls' night out2
 
 Java "Hey, hey Scala, how do you create a static method?"
 Scala: "The idea of a class having static methods is strange to begin with."
 Java "eh, yeah?"
 Scala: "That's a class that has both a role as a 'singleton object' and a role as a 'declaration and implementation of methods that the object should have'.
 Java "Oh, it's true that my class also behaves as an 'object guaranteed to be a singleton'. So singleton as a design pattern is a trick that takes advantage of the fact that a class is a singleton object.
 Scala: "Yes, I do. I think your class has too many roles. So in cases where the idea of not having a static method in a class comes up, having a singleton object with a method will suffice.
 Jython: "In that case, what happens to the visibility of each other's members between a method that a class Foo has and a method that a singleton object Foo has?"
 Scala: "It's called a companion object..."
 Java "Mmmmmm, some difficult concept again! (>_<)"
 Jython: "Let's google it. Hmmm...so singleton objects of the same name defined in the same file as the class become 'companion objects' of the class and can access each other's private members."
 </body>

[Hatena Diary 2012-03-25 https://nishiohirokazu.hatenadiary.org/archive/2012/03/25]