Hatena2009-01-26
code:hatena
 <body>
 *1232956483*Housekeeping
 - Sagawa express delivery to a liquor store in town
 -- I walked in, and there were two old men sitting there, and I said, "I'd like to send out a Sagawa Express," and they said, "Do you have a husband over there?" I said, "Do you have a husband over there? Two customers were watching TV and drinking alcohol. That's what you would expect from a liquor store in town.
 - Call the hospital to make an appointment.
 -- I'm on hold because the receptionist who answered was different from the last time I called and said something I didn't understand and said she would call me back to check with the doctor. I'm waiting. I have so many things to do. I should have called tomorrow.
 -- Added while we wait: http://d.hatena.ne.jp/nishiohirokazu/20090124/1232795960
 -- Still no call...
 -- Forget it, let's get Sagawa Express out first.
 -- ■ Completion
 - Go to Able
 -- I've decided on a property.
 -- I've got so much more work to do, like transfers and contracts and stuff.
 - Write documents to be sent out tomorrow
 
 Tomorrow's business
 - □ Go to hospital
 - □ Call a real estate agent
 - □ Fill out the contract and mail it to the parents (guarantor)
 - □ (until 29th) Money transfer
 - □ (up to 30 days)Certificate of residence
 
 *1232989377*Ghost in the Shell
 http://www.dmm.com/rental/ppr/-/detail/=/cid=n_609bcba2606/
 The other day Solid State Society was playing on the monitor at the electronics store, and I thought to myself, I haven't seen this. 480 yen to have it sent to my house, and I can just return it by post? Then I thought I might borrow it.
 
 **1232998613*[Midterm] Matching for strength quantification
 To simplify the problem, the middle limit is a 3-player game, but it is broken down into 2-player games. In other words, a game of A: +2, B: -1, C: -1 is a composite of three games: "A: +1, B: -1", "A: +1, C: -1", and "B: 0, C: 0". This allows us to think of it in the same way as a rating for a 2-player game, for example. Of course, this means that there is no such thing as "A is strong against both B and C, but weak against both B and C at the same time. Of course, this is not correct, but it is just like the naive Bayesian SPAM filter working fine in practical use even though the naive assumption of naive Bayesian is not correct.
 
 Now, that's why you can calculate the rating with <a href='http://en.wikipedia.org/wiki/Elo_rating_system'>Elo rating system - Wikipedia, the free encyclopedia</a> or something like that. You know that the middle limit is 100% for the stronger player. As you know, in the middle of the game, it is not always the case that the stronger player wins 100% of the time, so it is necessary to repeat the game several times to find the winning percentage.
 
 So, the question is, "If the winner is to be decided in a limited time (number of games), is a simple round-robin game acceptable?" I think this is a no. I think this is a NO. I think this is an extension of <a href='http://en.wikipedia.org/wiki/Multi-armed_bandit'>Multi-armed bandit - Wikipedia, the free encyclopedia</a>. I think this can be thought of as an extension of < href'95>Multi-armed bandit - Wikipedia, the free free encyclopedia</> and that a simple total win is the same as the act of putting the same amount in all slots in a Multi-armed bandit.
 
 
 
 
 I want to sleep but I can't, so I am writing about random things.
 </body>
 <comments>
 <comment>
 <username>TOKOROTEN</username>
 <body>Wouldn't the Swiss draw algorithm be fine? </body>
 <timestamp>1233009521</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-01-26 https://nishiohirokazu.hatenadiary.org/archive/2009/01/26]