Hatena2008-03-28
code:hatena
 <body>
 *1206679551*Eating habits
 - http://d.hatena.ne.jp/amachang/20080326/1206506973
 - http://tech.g.hatena.ne.jp/itkz/20080328/1206654763
 
 AMACHANG asked me, "If I eat sweets and exercise to lower my blood sugar, won't I get diabetes?" I explained roughly how insulin is produced by the pancreas and how sugar ravages blood vessels, but this was the context.
 
 Clearly itkz is right on this one. The level of amachang's "walking home" is not enough to be called "exercising". He sits all day long, so at best, he is not exercising at all. I also thought that amachang's inactivity was just a "hassle," but it seems to me that he is paying for things that money can't buy, such as health and longevity, in exchange for saving a few hundred yen per day. I guess it's a lose-lose deal.
 
 -----
 
 I walk 10 kilometers a day!
 
 -----
 
 Some people have said that the comments section is helpful, so I'll add a few things to it.
 
 >>
 Rinnai 2008/03/26 18:07 I recommend living on raw vegetables and raw fruits only.
 Energy for digestion and absorption is not burdened by digestion and absorption.
 You can spend it on programming.
 <<
 
 While it is true that digestion and absorption also use energy, it is quite misguided to say that raw vegetables and raw fruits are not burdensome. If we limit our discussion to the fructose in fruits, the burden is certainly less. In general, it is not possible to be inactive due to lack of energy unless you are starving, so the idea that "energy can be spent on programming" is strange to begin with.
 
 >>
 Juices such as Vegetable Life are no good. Those are vegetables that have been heat-treated and made into juice,
 It is a drink that makes you spend energy on dead digestion and absorption.
 <<
 
 What do you mean by dead digestion and absorption? At any rate, it is true that vitamin C is heat sensitive, but I think in many cases it is added later as an antioxidant because it can be produced industrially. I see it in PET bottles of green tea. <a href="http://ja.wikipedia.org/wiki/%E3%82%A2%E3%82%B9%E3%82%B3%E3%83%AB%E3% 83%93%E3%83%B3%E9%85%B8">Ascorbic acid - Wikipedia</a>
 I think what you also want to get from carrot juice-type products is beta-carotene, but that is heat-resistant. Also, even if you drink raw carrots made into juice, the absorption efficiency is poor because beta-carotene is not soluble in water. It is better to fry them in oil than to eat them raw.
 
 >>
 pha Carbohydrates eventually break down to sugar, but I don't think taking sugar as it is instead of carbohydrates was good for my gut or something.
 <<
 
 Yes. Taking sugar directly causes blood sugar levels to fluctuate violently, which puts a strain on the insulin-producing cells in the pancreas. Diabetes ensues.
 http://www.kyotokojohokenkai.or.jp/HP/knk_qa/qa_2/top.htm
 
 <!--
 -----
 
 I told him that I was looking forward to seeing the results of my physical exam when I turn 30, and he said, "I'll prove that my body is OK with this. No way. -->.
 
 *1206692150*yasnippets
 Missionary to higepon.
 
 -----
 
 Mr. Higepon has started to hustle and is determined to make one snippet before the reception.
 
 ZIGOROu started to get impatient when he saw that w ZIGOROu is the type of person who wants to have toys when others have them.
 
 *1206694276*[AS3][yas]
 Created tag yas for yasnippet.
 I also started making snippets for ActionScript.
 
 >|lisp|
 `(progn 
   (defvar classname 
    (capitalize (file-name-nondirectory (file-name-sans-extension (buffer-file-name)))))"")
 `package {
   import flash.display.*;
   [SWF(width="400", height="300", backgroundColor="#eeffee")] 
     public class `classname` extends Sprite {
     public function `classname`() {
       
     }
   }
 }
 ||<
 
 Now create a file with the appropriate name Test.as, type main and press Tab to enter as shown below.
 
 >|actionscript|
 package {
   import flash.display.*;
   [SWF(width="400", height="300", backgroundColor="#eeffee")] 
     public class Test extends Sprite {
     public function Test() {
       
     }
   }
 }
 ||<
 
 The highlight is that the class name is automatically generated from the file name. I noticed after I wrote it that the indentation is strange.
 
 When I edit snippets in Emacs, I have trouble creating files with tildes. I wonder if it's possible to prevent them from being created only in the snippets folder.
 
 -----
 
 I've made other for's and such, but I wonder if anyone would be happy if I committed them to Spark or something.
 
 *1206717031*An impostor appears.
 <a href="http://d.hatena.ne.jp/jishiohirokazu/20080328/1206710135">Eating Habits - The Hatena Diaries of Yasukazu j Nishio</a>
 J. Nishio said.
 
 >>
 I'm tired of it.
 <<
 
 I blew it.
 
 *1206720855* I'm not wrestling.
 Why I Don't Spend Money - IT War
 http://d.hatena.ne.jp/amachang/20080328/1206681360
 >>
 It's not a question of which is right. I don't want everything to be wrestling. There are people who are hurt in the ring.
 <<
 
 Ah, it seems I hurt amachang's feelings because of my usual lack of words. What I meant to say was that at the very least, amachang's "sugar doesn't raise blood sugar if you exercise" is a scientifically false claim, and that *I* feel that a life without eating vegetables to save a few hundred yen is wrong.
 
 -----
 
 Me, I would avoid diabetes if I could avoid it, but if I chose to. - What kind of dilemma
 http://d.hatena.ne.jp/hrkt0115311/20080328/1206716222
 >>
 What you work for and what you earn, you are free to do with it as you see fit.
 <<
 
 Yeah, yeah, I agree with that opinion. So it's not like I'm taking the cobbler out of amachang's hand or shoving vegetable salad into amachang's mouth. I'm not a child.
 
 >>
 So, when I caught a glimpse of this stream, I felt as if I saw "people trying to stop a Shugendo ascetic or something from running barefoot on the fire.
 
 I wouldn't imitate it, I wouldn't recommend it to others, and I would stop them if they asked me about it, but since you have made the choice, I think it's best to wait and see.
 <<
 
 So, what I am doing is not called "keeping an eye on things," even though I am not taking a cobbler out of amachang's hand or shoving a vegetable salad into amachang's mouth, and I am not allowed to just write a blog post that denies amachang's ideology? I don't know.
 
 I'm tempted to say, "Whatever, I'm tired. I want to say "lol" (by dropdb).
 
 -----
 
 At the last Py Yakiniku, someone who has been watching my blog since it was Zope or MT told me that it has become less interesting lately. Compared to non-Hatena Diary, Hatena Diary tends to have a higher search ranking on Google, and the reaction of Hatena and Hatesta seems to be more intense. And when you wrestle, it becomes even more intense. This may be the reason why I got into the habit of wrestling unconsciously.
 
 I am tired of wrestling. It is futile to spend time on this kind of thing. I will be careful to avoid wrestling in the future.
 
 *1206723812*[yas]FizzBuzz with yasnippets
 I was explaining to a vim user about the advantages of yas's "ability to evaluate EmacsLisp", and it occurred to me to make one.
 >|lisp|
 `(progn
 (defun fizzbuzz (i n)
   (if (> i n) ""
     (concat
         (cond ((= 0 (% i 15)) "FizzBuzz")
   	      ((= 0 (% i 3)) "Fizz")
   	      ((= 0 (% i 5)) "Buzz")
 	      (t (number-to-string i)))
 	"\n"
 	(fizzbuzz (+ i 1) n))))
 
 "")
 `FizzBuzz to ${1:10}:
 ${1:$(fizzbuzz 1 (string-to-number text))}
 ||<
 
 Now if you write "fizzbuzz" and press TAB, a string like the one below will be inserted. The focus is on the "10" and when you edit the number, it immediately changes to that number of FizzBuzz.
 
 >||
 FizzBuzz to 10:
 1
 2
 Fizz
 4
 Buzz
 Fizz
 7
 8
 Fizz
 Buzz
 ||<
 
 *1206726363*FizzBuzz with regular expressions
 Interactive execution in Python:
 >|python|
 >>> MOD3 = re.compile("(([369][0369])|([147][258])|([258][147])|[^\d][369]) ")
 >>> MOD15 = re.compile("\d*[05]<")
 >>> MOD5 = re.compile("\d*[05] ")
 >>> MOD3AFTER = re.compile("\d+<")
 >>> data = "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 "
 >>> MOD3.sub(r"\1<", data)
 '1 2 3<4 5 6<7 8 9<10 11 12<13 14 15<16 17 18<19 20 '
 >>> MOD15.sub("FizzBuzz ", _)
 '1 2 3<4 5 6<7 8 9<10 11 12<13 14 FizzBuzz 16 17 18<19 20 '
 >>> MOD5.sub("Buzz ", _)
 '1 2 3<4 Buzz 6<7 8 9<Buzz 11 12<13 14 FizzBuzz 16 17 18<19 Buzz '
 >>> MOD3AFTER.sub("Fizz ", _)
 '1 2 Fizz 4 Buzz Fizz 7 8 Fizz Buzz 11 Fizz 13 14 FizzBuzz 16 17 Fizz 19 Buzz '
 ||<
 
 I was told to both "write a regular expression and settle down" and "write a FizzBuzz and settle down," so I did both.
 </body>
 <comments>
 <comment>
 <username>amachang</username>
 <body>I'm walking 10 km a day and working pretty hard, so I'm getting a lot of exercise.
 <timestamp>1206680377</timestamp>
 </comment>
 <comment>
 <username>amachang</username>
 <body>"I will prove that this is OK with my body."<br><br>No, you didn't mean this so seriously, you said it a bit more jokingly. <BR><BR>No, I didn't mean it that seriously, but you said it a bit more jokingly. <BR>I'm at a point in my life where I want to withdraw. </body>
 <timestamp>1206683046</timestamp>
 </comment>
 <comment>
 <username>TAKESAKO</username>
 <body>It is said that in type 2 diabetes there is a strong genetic predisposition in addition to lifestyle, so each person is different. </body>
 <timestamp>1206683573</timestamp>
 </comment>
 <comment>
 <username>kensuu</username>
 <BODY>I think you should meet and talk to each other since you are so close and in such close proximity in real life! <BR><BR>Something not so nice tends to happen when you discuss things in a public forum on the internet! <BR><BR>I ate a set of Burger King in the morning and I feel really sick! <BR>Bodies are important! </body>
 <timestamp>1206686465</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I got angry when I told a story about what we had talked about...orz</body>.
 <timestamp>1206686833</timestamp>
 </comment>
 <comment>
 <username>amachang</username>
 <body>A distance of 2 meters is about w</body>.
 <timestamp>1206686876</timestamp>
 </comment>
 <comment>
 <username>amachang</username>
 <body>I'm not mad yp!
 <timestamp>1206686891</timestamp>
 </comment>
 <comment>
 <username>Name</username>.
 <body>At a distance of about 2 meters, how much is that? <br>It tends to come across as ruthless in writing, so it's something to think about</body>.
 <timestamp>1206687034</timestamp>
 </comment>
 <comment>
 <username>kensuu</username>
 
 <timestamp>1206688402</timestamp>
 </comment>
 <comment>
 <username>Yoshiori</username>
 <body>I'm the one who was told I wouldn't even make it to 30 because of my picky eating</body>.
 <timestamp>1206692136</timestamp>
 </comment>
 <comment>
 <username>hrkt0115311</username>
 <body>Good evening. <BR>Excuse me from my cell phone. I apologize for any offense I may have caused you. <BR>Also, I believe I am included in the watchful eye. <BR>I am sorry that my bad writing was difficult to understand. <BR>As for forgiveness and unforgiveness, you are free to write whatever you want. <BR><BR>I am sorry if my bad writing is not clear. <BR><BR>At once, I would like to reply and apologize. </body>
 <timestamp>1206723189</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>While it may appear that I am angry in the online text, rest assured that I am not actually angry at all. </body>
 <timestamp>1206724415</timestamp>
 </comment>
 <comment>
 <username>dropdb</username>
 <body>Me, Amachan, Nishiotan and everyone else are all tired! <br>Let's soothe and heal ourselves by ruffling our smooth, smooth Macs! <br>Sure, </body>.
 <timestamp>1206726456</timestamp>
 </comment>
 <comment>
 <username>amachang</username>
 <body>I saw a terrible apple believer on the web</body>.
 <timestamp>1206762531</timestamp>
 </comment>
 <comment>
 <username>IMAKADO</username>
 <body>Hello, if you only want a specific directory, how about this? <br>(add-hook 'before-save-hook (lambda ()<br> (let ((snippet-dir (expand-file-name "path/to/snippets ")<br> (buf-dir (or (file-name-directory (or buffer-file-name "")))))<br> (when (string-match snippet- dir buf-dir)<br> (set (make-local-variable 'make-backup-files) nil)))))<br>I think I called a function to make backups in the save function, so I used before-save-hook<br>. If the buffer directory contains a snippet directory, then make-backup-files is set to buffer-local and nil is set. <br>Sorry if this is not what you are looking for. </body>
 <timestamp>1206806674</timestamp>
 </comment>
 <comment>
 <username>IMAKADO</username>
 <body>Sorry, the (buf-dir... I think it would work even if there was an or, but it was like this. I think it would work even if there was, but it was like this<br>(buf-dir (file-name-directory (or buffer-file-name "")))</body>
 <timestamp>1206806812</timestamp>
 </comment>
 <comment>
 <username>t_yano</username>
 <body>My Mac is a little rough. </body>
 <timestamp>1206974521</timestamp>
 </comment>
 </comments>

[Hatena Diary 2008-03-28 https://nishiohirokazu.hatenadiary.org/archive/2008/03/28]