Hatena2009-08-16
code:hatena
 <body>
 *1250386497*Diary of the last day of programming camp
 I'm nervous about the presentation, even though it's not my presentation.
 
 <hr>
 
 My back hurts...
 
 <hr>
 
 <a href='http://en.wikipedia.org/wiki/Conficker'>Conficker</a> measures.
 
 Often when you listen to the security side of the story, you hear about the 8th layer and above. Interesting.
 
 <a href='http://ja.wikipedia.org/wiki/%E4%BE%B5%E5%85%A5%E9%98%B2%E6%AD%A2%E3%82%B7%E3%82%B9%E3%83%86%E3%83%A0'>intrusion prevention system</a>, <a href href='http://ja.wikipedia.org/wiki/%E4%BE%B5%E5%85%A5%E6%A4%9C%E7%9F%A5%E3%82%B7%E3%82%B9%E3%83%86%E3%83%A0'>Intrusion Detection Systems</a>
 
 <hr>
 
 DF bit: 1 is the manner, some malware sends a large number of packets with 0.
 
 I'm not sure I understand the relationship between the DF bit standing still and the Source IP Address being spoofed. Oh, if it's spoofed, it won't come back. I guess it's 1 for the router to poke back to the sender and say "you split it and send it back" when it needs to be split, and 0 for the router to split it. So, if I'm faking it, I'm in trouble because that "send it back" doesn't come back to me.
 
 <hr>
 
 Returned home. Supplied with cream puffs; Surreal Number book had arrived.
 </body>
 <comments>
 <comment>
 <username>kosaki</username>
 <body>I didn't understand the DF bit thing either, so I asked Mr. Yoshifuji about it in the time that followed. In addition to what he wrote here, he told me why we can assume that a normal OS has DF=1. <BR>In a normal OS, you want to increase the throughput, so you want to increase the packet size to the size of the MTU limit. So, they gradually increase the packet size with DF=1 to find out the MTU. <br>And since the fragment counter is only 16 bits, it will circle around in an instant in a modern network, so it practically doesn't work well. </body>
 <timestamp>1250506596</timestamp>
 </comment>
 <comment>
 <username>nishiohirokazu</username>
 <body>I see what you mean, thank you! </body>
 <timestamp>1250528500</timestamp>
 </comment>
 </comments>

[Hatena Diary 2009-08-16 https://nishiohirokazu.hatenadiary.org/archive/2009/08/16]