Hatena2014-09-21
code:hatena
 <body>
 *1411306312* Visualization of brain waves
 I wrote a script to FFT the EEG sensor recorded data and then make an image of it. The vertical axis is time (bottom is after, 1px is 1 second) and the horizontal axis is the FFT result of 128 signals per second from the 14-channel EEG sensor, from 1Hz to 30Hz.
 
 [f:id:nishiohirokazu:20140921223139p:image]
 
 A little longer one.
 
 [f:id:nishiohirokazu:20140921223059p:image]
 
 
 
 I still wish I could record what I am doing by some means and keep track of it. This is a brainwave I had while typing the contents of the book, and I'd like to know what the heck was going on in the black band...
 
 [f:id:nishiohirokazu:20140921223335p:image]
 
 
 
 This is a brain wave when I put on the EEG sensor when I was sleepy and fell asleep for a while. The position of the peak is different from the others...oops, I didn't explain what the peak is. The higher the value, the whiter it becomes, and in the previous one, the left end of each channel was a white gradation. In other words, the lower frequencies are higher. But in this result, a white band appears about 1/3 from the left.
 
 1/3 of 30 Hz is around 10 Hz, so <a href='http://ja.wikipedia.org/wiki/%E3%82%A2%E3%83%AB%E3%83%95%E3%82%A1%E6%B3%A2'>alpha waves</a> "during rest (relaxation) and eye closure alpha waves account for a higher percentage of the alpha waves than the other frequency components in the EEG of <a href="'>Rest (relaxed)</a>, and are the main component of the fundamental rhythm." This is probably the characteristic that has been observed.
 
 [f:id:nishiohirokazu:20140921223622p:image]
 
 
 
 Here are the brain waves while speed reading a normal book. It looks much different, with stronger white lines. But this could just be the muscle potentials of eye movement being picked up.
 
 [f:id:nishiohirokazu:20140921224143p:image]
 
 Here are the brain waves while training eye movement with a meaningless string of letters. Hmmm, I can't really tell the difference. The above "speed-reading training with ordinary books" is almost an eye movement training, as it involves turning a page in one second or something like that. I should get the data when I read at a speed I can read.
 
 [f:id:nishiohirokazu:20140921223930p:image]
 
 
 This is a brain wave while reading a manga (Astro Boy). It seems like the 6th channel is black, doesn't it? Each channel is AF3 F7 F3 FC5 T7 P7 O1 O2 P8 T8 FC6 F4 F8 AF4, and the diagram can be found at http://www.hindawi.com/journals/mpe/2014/365101/fig4/. The 6th channel is the area behind the left diagonal. I am not sure if the output of this EEG sensor is accurate enough to discuss which regions are active, so I would not go too deep into it at this stage.
 
 [f:id:nishiohirokazu:20140921225008p:image]
 
 
 The raw data and conversion scripts are located here: https://github.com/nishio/emotiv
 </body>

[Hatena Diary 2014-09-21 https://nishiohirokazu.hatenadiary.org/archive/2014/09/21]