Hatena2011-02-12
code:hatena
 <body>
 *1297511487* Reintroduction to Mind Mapping
 When I did it before, I used only black because I thought it was too much of a hassle and left it alone, thinking, "What the heck, it's just a bunch of bullet points." However, I bought a color pen and a croquis book because it seems colorful is essentially important.
 
 f:id:nishiohirokazu:20110212204658j:image
 
 The book I read is the one you see in the picture <a href="http://www.amazon.co.jp/gp/product/4877710523?ie=UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative= 7399&creativeASIN=4877710523">Notebooking Miracles in Life&#8212;Mind Map Radiant Thinking</a>, but in case you're wondering, "<a href='http://d.hatena.ne.jp/higepon/20080811/ 1218456629'>Three things I was missing after studying how to study - Bearded Pon OS or make it Mona-</a>" I'll also read "The Mind Map" introduced in the book. I just ordered it.
 
 <iframe src="http://rcm-jp.amazon.co.jp/e/cm?lt1=_blank&bc1=000000&IS2=1&bg1=AAFFAA&fc1=000000&lc1=0000FF&t=nishiohirokaz-22&o=9&p=8&l=as4&m=amazon&f=ifr&asins=4478760993" style="width:120px;height:240px;" scrolling="no" marginwidth="0" marginheight="0" frameborder="0"></iframe>
 
 *1297512295* Pomodoro rest time is not fixed at 5 minutes.
 I heard some incorrect explanations here and there, such as "Pomodoro Technique is to chop the work every 30 minutes and repeat 25 minutes of work and 5 minutes of rest," and I found an explanation book "<a href="http://www.amazon.co.jp/gp/product/4048689525?ie= UTF8&tag=nishiohirokaz-22&linkCode=as2&camp=247&creative=7399&creativeASIN=4048689525">An Introduction to Agile Time Management: The Pomodoro Technique</a>". I was wondering if such a misunderstanding would not happen if you read the book "Agile Time Management: An Introduction to the Pomodoro Technique</a>".
 >>
 You can force a break with a timer, but once you get used to it, it's better to wait for yourself to say, "Oh shucks!" it is better to wait for yourself to get the feeling that you are ready to go. (It's not a bad idea to have a timer running with a time guideline). Maybe even 3 minutes will turn you on at first. But later in the day, when your Pomodoro count starts to record double digits, you will gradually extend your break time. You can take larger breaks strategically, such as "Let's walk to the nearest convenience store for a while," or "My work efficiency is getting worse today, so let's do it tomorrow," and you will know how you are doing by the time you take a break.
 <<
 
 <a href='http://blog.shibu.jp/article/43362434.html'>Diary of Shibu: Pomodoro Technique to Improve Monitoring</a>
 </body>

[Hatena Diary 2011-02-12 https://nishiohirokazu.hatenadiary.org/archive/2011/02/12]