Hatena2014-10-10
code:hatena
 <body>
 *1412872816*Master of Technology Management (Professional) Degree after completing MOT at Tokyo Tech
 [f:id:nishiohirokazu:20141010001952j:image]
 
 Frequently Asked Questions
 
 Q: What did you learn?
 A: We can't talk about this in a single blog post, so please see <a href="http://www.mot.titech.ac.jp/dept_mot/mot_lecture/t_table/t_table_h26_s/">the timetable</a>, etc.
 
 
 Q: What is it like?
 A: It was interesting because we had a 50-50 mix of students who went on to undergraduate school and working people (a little more working people), and we did group work in class. The group work was an experiment in management with members from different backgrounds. And about half of them were working people from different industries. How could it not be interesting?
 
 
 Q: How did you get started?
 A: Do you remember the Drucker boom that occurred about four years ago when the book "If a female high school baseball manager read Drucker's 'Management'" was released? At that time, I browsed through the novel version and the original Drucker book at a bookstore and found the latter more interesting, so I bought that one.
 As I read on in this way, I realized that the blog post I happened to read earlier and thought, "I never had that idea, it's interesting," was actually just a thin cup of tea, like Drucker's second-best brew. This situation can be likened to programming, "I happened to read a blog post on the topic and thought, 'I didn't know there was such a way to implement that! but you could have easily come up with that if you had read the official manual. You should read the manual. I thought that the principle of "it is better to get closer to the source of information" is the same even if the field is different. Here is the source:<a href="http://www.amazon.co.jp/gp/product/447800210X/ref=as_li_ss_tl?ie=UTF8&camp=247&creative=7399&creativeASIN= 447800210X&linkCode=as2&tag=nishiohirokaz-22">Drucker's Famous Books 8: Post Capitalist Society</a>.
 
 When I mentioned that I wanted to study this field thoroughly at the Tokyo Institute of Technology (Tokyo Tech), Mr. Jun Kuikei, an alumnus of MIT and with whom I occasionally spoke, recommended the Tokyo Tech MOT program to me.
 
 
 Q: Are you changing jobs?
 A: I have no plans to do so. I heard that some people take MBAs or MOTs to get an advantage in changing jobs. I entered Cybozu with the above "I want to learn" motivation, so I didn't have that idea. Also, I have come to understand what a good company Cybozu is through my MOT studies, so I am less inclined to change jobs. Even if I could do what I want to do outside of the company, there are various options other than quitting the company (<a href='http://mydeskteam.com/casefile/1295/'>working in two companies, a "double job"</a>, or <a href=' http://www.sankeibiz.jp/econome/news/131106/ecd1311060600003-n1.htm'>Cybozu's Human Resource Strategy: "Self-reinstatement leave system" that allows employees to return to work after 6 years. (1/4 page) - SankeiBiz</a>), and taking the initiative in experimenting with such flexible work styles are also good points of the current company.
 
 
 Q: Are you glad you did it?
 A: Sure!
 </body>

[Hatena Diary 2014-10-10 https://nishiohirokazu.hatenadiary.org/archive/2014/10/10]