Hatena2009-06-15
code:hatena
 <body>
 *1245051882*Fantasy before today's drawing
 If the coordinates are calculated using double, it is difficult to determine whether or not the shapes overlap completely, so the process of assuming that the same shape is identical becomes tedious. If there is no error in the coordinates, it is very easy to hash the coordinates. If you only have integers and integer ratios, you can use rational number objects. And if you get something like sqrt(2), sqrt(2)^2 is 2, so you can treat it as a 2-dimensional vector like a complex number. The golden ratio G is also okay because it is 1/2 + sqrt(5)/2 if you decompose it.
 
 But the problem is that the width of a regular pentagon perpendicular to the axis is a double root sign like sqrt(10 - 2 * sqrt(5)) / 4. Let's see, the root disappears when it is squared to the fourth power, so I should put this constant as P and treat it as a 4-dimensional vector of 1, P, P^2, and P^3?
 
 Well, writing it down helps me to organize my mind. At the beginning, I thought I would treat the numbers containing G as polynomials with rational numbers as coefficients, and then normalize them to the highest degree.
 
 *1245075239* Painting of the Day
 I was down at the time of the meeting and started to feel better after midnight....
 
 To id:TOKOROTEN
 <img src="http://gyazo.com/42ecdf91aaf5cceb28030df6c3dd5397.png">
 I started saying that it looked like a fractal when I showed it to him, and this is what happened when I tried to verify it.
 <img src="http://gyazo.com/a8681ba0e1dd274108228c2310eff00e.png">
 This is good.
 
 
 I was told by id:kajuntk that the Alien Book problem should be based on an elementary school textbook or something like that, and I was able to draw what I had conceived yesterday after implementing the rect.
 <img src="http://gyazo.com/a5243a4ca397f3798c520d7de29d3d84.png">
 
 
 Also, this is handwritten in Inkscape.
 <img src="http://gyazo.com/f5e207d4bdbba85b97d223c2cb3899b8.png">
 
 
 interjection expressing surprise, pain, fear, or disgust
 <img src="http://gyazo.com/e2cd26620481d342a151a4261acb506a.png">
 
 This is a normal one. The diagonal lines are interesting, but only a very perverse person can huff and puff with this, so I guess I'll have to reject it.
 <img src="http://gyazo.com/17ef9be660b7d7c0a416d0aea7b8ef9a.png">
 
 *1245094773* Silver on acrylic
 f:id:nishiohirokazu:20090616043929j:image
 
 Hmmm, no. With my skill, it is not mirror-like. If this is the case, it would be better to buy a mirror-finish tape and put it on the surface to make it look more mirror-like.
 
 
 I wonder if it is possible to plating only a part of the acrylic surface. I'll do some research. Oh, right, silver mirror reaction. I'm sure I learned that. <a href='http://www.mie-glass.co.jp/C-3.htm'>Mirror trivia (electroless plating and silver mirror reaction)</a>. I understand the theory, but just plating with silver mirror reaction would be vulnerable to corrosion and rubbing... Is a protective layer necessary on top of the plating? I wonder if spraying lacquer on it would be enough.
 
 
 Incidentally, I used sterling silver foil from my household hands. You might think it is expensive to use sterling silver, but it costs only about 40 yen, including the crumpled up silver foil I got from a mistake. The acrylic sheet I bought for this experiment was about 87 yen, so it was more expensive.
 </body>

[Hatena Diary 2009-06-15 https://nishiohirokazu.hatenadiary.org/archive/2009/06/15]