Do not tear down the fence until you know why it was erected.
Never tear down a fence until you know why it was erected."
Also known as [Chesterton's rule

Parable from The Thing by author and essayist G. K. Chesterton
>IN the matter of reforming things, as distinct from deforming them, there is one plain and simple principle; a principle which will probably be called a paradox. There exists in such a case a certain institution or law; let us say for the sake of simplicity, a fence or gate erected across a road. The more modern type of reformer goes gaily up to it and says, "I don't see the use of this; let us clear it away." To which the more intelligent type of reformer will do well to answer:"If you don't see the use of it, I certainly won't let you clear it away. Go away and think. Then, when you can come back and tell me that you do see the use of it, I may allow you to destroy it." 
There is a fence that straddles the road and to someone who says, "I don't know what it's use is, so let's tear it down," another person replies, "If you don't know what it's use is, you shouldn't tear it down."

The reason I answered that was because "fences don't grow by themselves". Someone had a reason why it would be good for someone else. Until we know it, we will never know if that reason is reasonable.
>Some person had some reason for thinking it would be a good thing for somebody. And until we know what the reason was, we really cannot judge whether the reason was reasonable.

Logically correct up to "we can't determine if a reason is reasonable until we know the reason," but there's a leap to "don't break down the fence."
For example, let's say an old lady who liked pink painted a road pink without permission and died without telling anyone about it. Here we have a "pink road" without knowing the reason. Since the person who knows the reason is dead, the reason for the pink will never be revealed in the future. Then, must the people who are left behind keep the road pink forever? No way.
The strange conclusion is that Chesterton has replaced "I can't determine whether the reasons are rational" with "Surely there must be reasons why the status quo should be maintained.

It is reasonable to weigh the advantages and disadvantages of each option to decide whether or not to change things. If a fence that you don't know why it was built can be maintained with zero maintenance costs, then keep it. If it costs 1 million annually to maintain, is it reasonable to pay 1 million annually for that "reason that was there when it was built but is no longer known and may or may not be reasonable"? The decision would be.

The cost of redoing it will also affect the decision. If you tear down a fence, find out you need it, and can rebuild it for a million dollars, then tear it down; if you don't need it for a year, then you are better off. If it costs 100 million to rebuild it, you should think carefully.

relevance
　[Consistency is the last refuge of the unimaginative.]
