Good to see thinking developing regarding Will/Can/Must and project adoption.
summary
　Project proposals are [Will/Can/Must]. It is important that this Must be voluntarily set.
　The project with the largest "Want to adopt" (Will) in Nishio will be adopted. The strength of the Will is determined by the compatibility between the proposal's Will/Can/Must and Nishio's Will/Can/Must.

[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon]Will/Can/Must and hope thoughts develop regarding project adoption.
[nisbot.icon]What "Must" is that "Must"?
[nishio.icon]What the person thinks he or she "should" do, rather than what an outside party says he or she "should" do, and the new value that will be brought to society by doing so.
[nisbot.icon]What "should" is that "should"?
[nishio.icon]Listen first.
[nisbot.icon]Yes
[nishio.icon] "The proposer can make X," "Making X solves problem Y," and "Customer Z will be happy if problem Y is solved" are all hypotheses, where "can make" is a can about individual ability, "solve" is a can that the problem can be solved technically, and "Z will be happy" is a type of Must Z is happy" is a type of Must, which means that "people are happy" or "it brings value to society.
[nisbot.icon]「Must」
In [nishio.icon] "Strong/Interesting/Important/I want to cooperate", "strong" means "the proposer has high technical skills" and "interesting" means "the proposal will bring benefit to Nishio personally in the form of interest". I was not aware of this when I wrote this, but if the proposal brought benefits other than fun, I would have said "sounds useful," "I want to use it," or "I want to have it. This is a weak Must in the sense that it provides value to Nishio personally, while "important" is a strong Must because it means "I feel that solving this problem will be beneficial to society. However, there is an unspoken assumption that Nishio's Can is "I can cooperate.
[nisbot.icon]「Must」
[nishio.icon]Ultimately, Nishio's Will to "adopt" the largest project is adopted.
[nisbot.icon]「Will」
[nishio.icon]Be careful with the word Must, as it tends to cause interpretative sway. A proposal is a trio of what you want to create (Will), what you can create (Can), and what benefit you should create (Must, what benefit you will provide to society). Providing benefits to society is not essential in unexplored juniors, but in a broad sense, it provides benefits to the person and the mentor, so it can be said that "the customer is just very narrowly focused" and "providing value to the customer is still essential.
[nisbot.icon]「Must」
[nishio.icon]The End
[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon]I found themes that seemed relevant, and it would have been nice to have specific language on how they were relevant. Mostly accomplished.
[nisbot.icon]
 > Be careful with the word "Must" as it tends to cause interpretation sway. A proposal is a trio of what you want to create (Will), what you can create (Can), and what benefit you should create (Must, what benefit you provide to society). Providing benefits to society is not essential in unexplored juniors, but in a broad sense, it provides benefits to the person and the mentor, so it can be said that "the customer is just very narrowly focused" and "providing value to the customer is still essential.
 Is there anything else about this "Must"?
[nishio.icon]Spontaneity is required. It is important to think about what you should do and decide for yourself, rather than doing what your parents or teachers tell you you "should" do.
[nisbot.icon]
 > Be careful with the word "Must" as it tends to cause interpretation sway. A proposal is a trio of what you want to create (Will), what you can create (Can), and what benefit you should create (Must, what benefit you provide to society). Providing benefits to society is not essential in unexplored juniors, but in a broad sense, it provides benefits to the person and the mentor, so it can be said that "the customer is just very narrowly focused" and "providing value to the customer is still essential.
 What kind of "Will" is this "Will"?
[nishio.icon]It's what we want to create and the future we want to see coming.
[nisbot.icon]What do you value?
Since only a limited number of people can have the experience of looking at 120 applications for [nishio.icon]Unexplored Junior, turning the findings into words and turning them into information that can be distributed will make the world a better place in the long run. So there is value in turning unspoken sensations into words.
[nisbot.icon]
 > Be careful with the word "Must" as it tends to cause interpretation sway. A proposal is a trio of what you want to create (Will), what you can create (Can), and what benefit you should create (Must, what benefit you provide to society). Providing benefits to society is not essential in unexplored juniors, but in a broad sense, it provides benefits to the person and the mentor, so it can be said that "the customer is just very narrowly focused" and "providing value to the customer is still essential.
 Is there anything else about this "Will"?

https://keicho.netlify.app/#talk=od9i88sUzzGfEoJeZ8ig