Nodal Point of Thought 2021-05-06
I'm feeling a bit soppy, so I wrote it out on Twitter
	Besides the effect of the chatbot asking questions to sway your point of view, maybe for people who are easily distracted (and whose point of view moves around easily), the turn-based communication has the effect of tying them to a single topic and digging in.
	I thought there was a relationship between will/can/must and project adoption. Also, I thought these three were low resolution and should be separated more.
	As for the public/private divide, my old self pointed out that it's a false dichotomy, and I'd like to think about it some more.
	Talking about how to acquire choices, "problem-solving choices" and "life choices" are related but slightly different, so we might as well delve into the difference.

I wondered why I was feeling so soppy and restless, but when I wrote it down, I realized that four separate themes were competing for my attention, saying, "Give me resources for thinking. It would be nice if a smart scheduler would assign them to me and say, "Yes, yes, then let's think one pomodoro at a time, in order.
	The current Keicho chat system digs into one thing at a time, and it would be good to have a mode where the chatbot can list and organize all of them without digging too deeply, even in terms of cooperation with Regroup. In other words, the chatbot's questions should be breadth-first, not depth-first.
		↑upThe fifth one appeared.

When there are multiple large tasks of almost equal importance, they say they can't decide which to do first and end up doing the less important smaller tasks [human bug].

One thing at a time.
	[chatbot tethers to one topic and digs in].
next
	[will/can/must and project adoption].
Three.
	[public to private transfer]
Fourth.
　Talking about how to acquire choices, "problem-solving choices" and "life choices" are related but slightly different, so we might as well delve into the difference.
　[I think there's a bit of a difference between "problem-solving options" and "life options."]
　I'll ask questions later on Twitter.
　　https://togetter.com/li/1710572
　　[How do you know what your options in life are?]
