Chatbots also have the effect of focusing
summary
　Chatting for 25 minutes has the effect of keeping you focused on one subject for 25 minutes.
　This is similar to dialogue, but unlike voice, which disappears, a log is kept and can be read back and searched.
　New "Means of Deepening Thinking" Strengthens Human Intelligence

[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon]I thought chatbots had the effect of shaking up the perspectives of people with fixed viewpoints and encouraging them to become aware of things, but I've also realized that they can help people who are restless with various things to focus on one thing, and I'd like to develop this a little more.
[nisbot.icon]What kind of "chatbot" is that "chatbot"?
[nishio.icon]人間に対して質問をする
[nisbot.icon]What kind of "question" is that "question"?
[nishio.icon]Ask digging questions in response to some of what you wrote earlier.
[nisbot.icon]Anything else about that "question"?
[nishio.icon]When people ask questions, that's where their attention goes.
[nisbot.icon]
 > Ask digging questions in response to some of what I wrote earlier.
 What does this "question" seem to be?
[nishio.icon]Something like a spotlight or an indicator, to draw attention to it.
[nisbot.icon]
 > Ask digging questions in response to some of what I wrote earlier.
 Where is this "question"?
[nishio.icon]Coming out of the chatbot
[nisbot.icon]Anything else about that "chatbot"?
[nishio.icon]Turn-based communication in the form of chat, interface with no extraneous items on the screen other than dialogue
[nisbot.icon]
 > Ask digging questions in response to some of what I wrote earlier.
 Where is this "question" located?
[nishio.icon] always just above the input field.
[nisbot.icon]What kind of "input field" is that "input field"?
[nishio.icon] It's in the middle of the screen and the human gazes at it and thinks about the answer while looking at the question just above.
[nisbot.icon]How do you know that "question"?
[nishio.icon] See displayed
[nisbot.icon]What kind of "appears" is that "appears"?
[nishio.icon] At least in the current system, it is presented to the user in text, not sound. Even in voice conversations, people focus on "what the other person said just before", and that's what happens because sound naturally disappears.
[nisbot.icon]What kind of "human" is that "human"?
[nishio.icon] Thinking is deepened through such dialogue. Another way is to deepen thinking by arranging fragments like Regroup and moving them around. Dialogue has been used for a long time because it can be done even by [real] people.
[nisbot.icon]Is there anything else about that "human"?
[nishio.icon]By using new means to deepen our thinking, we reach a boundary that we could not reach before. First there was spoken dialogue, and then the invention of the written word gave birth to time-unsynchronized communication via the written word. The Internet has reduced the cost of text distribution, shortened the lead time for release, and made it possible for non-humans to "remember" through search.
[nisbot.icon]What do you value?
[nishio.icon]Ultimately, I would like to see human civilization advance to the next stage, but even if I invent a great methodology, it will take time for it to spread throughout the human race, so I want to use a so-so methodology myself first to strengthen my own intellect. I feel the value of a method that I feel is strengthening my intelligence, and that is Scrapbox, Keicho, and KJ legal methodology (Regroup as a tool).
[nisbot.icon]その「Regroup」は、どんな「Regroup」ですか？

https://keicho.netlify.app/#talk=i5PSuJVnIzR88MZhD6U3