How to resolve the "private/public divide" to suit your needs

[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon]It would be good to know how to resolve the "[private/public divide]" to suit your needs.
[nisbot.icon]What kind of "private/public divide" is that "private/public divide"?
The problem that the link between what is written in [nishio.icon]private and what is written in [nishio.icon]public is not working.
[nisbot.icon]What kind of "private" is that "private"?
[nishio.icon]I can't write publicly for reasons I can't disclose.
[nisbot.icon]What kind of "public" is that "public"?
I have a need to share [nishio.icon] promptly with others, and I'm not happy with it being forwarded once a day after writing in PRIVATE, and it's probably a hassle to forward it manually after writing it.
[nisbot.icon]Anything else about that "private"?
[nishio.icon]I created a program to discover links between projects, considering them to be independent from public, but I felt that this was not the case either. I still think it is better for the project to be an integrated one that includes the contents of public.
[nisbot.icon]Anything else about that "public"?
[nishio.icon]When making a naive transfer from public to private, if you make additions on the private side, they will be overwritten. Example: Put a link to a private PDF on the book's introduction page.
[nisbot.icon]Where is that "private"?
[nishio.icon]Listen first.
[nisbot.icon]Yes
The [nishio.icon] transfer overwrites it because the title is the same. why not just put the key emoji in the title of the private page?
[nisbot.icon]「private」
It would be nice if there was a UserScript that could easily create this key page in the [nishio.icon]private project.
[nisbot.icon]「private」
Put a link to the original page using the page with the [nishio.icon] key icon.
[nisbot.icon]「private」
[nishio.icon]Looks good.
[nisbot.icon]「private」
[nishio.icon]The End
[nisbot.icon]What would you like to see happen in this conversation?
[nishio.icon]It would have been nice to know how to resolve the "private/public split" to suit my needs: overwrite transfer from public to private, public pages are not updated in the private project, and provide a means to easily create key pages. This seems to be a good idea.
[nisbot.icon]How do you know its "private"?
[nishio.icon]I know because I make it myself.
[nisbot.icon]
 > It would have been nice to know how to resolve the "private/public split" to suit my needs: overwrite transfer from public to private, don't update the public page in the private project, and provide an easy way to create key pages.
 Where is this "PRIVATE" located?
Since it contains the contents of [nishio.icon]public, searches, etc., will be performed on this page. You can write directly in public, or you can create a key page in private and paste it into public.
[nisbot.icon]What do you value?
[nishio.icon]I want links to occur between content that cannot be made public and the various pages I have written for public projects, so that awareness and reminders of private content can occur.
[nisbot.icon]
 > The content of public will be included, so searches, etc. will be performed against this page. You can write directly in public, or you can create a key page in private, write it, and then paste it into public (there is no support here now, but it is good because it is infrequent in the current operation).
 What do you hope will happen regarding this "private"?

https://keicho.netlify.app/#talk=EZggoCfwr1FUP9aB7mXV