How do you know what your life choices are?
[Life Choices].

>[nishio https://twitter.com/nishio/status/1390326819652456456]: loose invitation: about the choices you have made in your life that you think "this choice made your life better afterwards" "How did you know about that choice? " Please tell us.
	>[nishio https://twitter.com/nishio/status/1390326969540087809]: context: a thought I had while preparing a talk for middle and high school students. If you don't know the choices, you can't make those choices and the quality of your decision making will go down. Then knowing "life choices" should lead to a better life. So how do we know what those "life choices" are?
	>[nishio https://twitter.com/nishio/status/1390328676550529024]: the reason why I want to ask so many people is because in my experience, I can't compare or categorize because I only lived it once. My hypothesis is that "life-changing options are not disclosed in a way that is easy to understand, 'this is a life-changing option'".

>[nishio https://twitter.com/nishio/status/1390327672509669376]: In my case, "applying for Unexplored Youth" is the option that changed my life, "the president of my part-time job told me about it". I went to that part-time job because there was a local research group with interesting contents, so I attended it, and then there was a reception, so I attended that as well.
	>[nishio https://twitter.com/nishio/status/1390328178644635661]: too long ago to remember if this was really an internet search. Maybe it was introduced in some sort of online hobby circle, or maybe a classmate put it up in a chat room. I don't even remember it any longer, I didn't think at the time that it would affect the rest of my life.

>[ukkaripon https://twitter.com/ukkaripon/status/1390328557818105860]: applying to unexplored, applying to foreign companies, applying to the Ministry of Education, Science and Technology, making unexplored junior, all my friends around me did something similar. I decided to give it a try because my friends around me were doing similar things. So I thought, "I will make friends who are taking on various challenges.
	>[nishio https://twitter.com/nishio/status/1390329348863905792]: "You can do that too!" I'm sure you'll be like.

>[maltonn_ https://twitter.com/maltonn_/status/1390328563627225092]: I got into programming because I happened to find a free book on my kindle in my spare time. A more concrete example.
> Participation in SecHack365
> ↑ I learned about SH365 at an LT group event.
> ↑I found out about the LT meeting itself through Twitter with a good friend of mine! I found out about it through the process of "Let's meet off-line with people I'm good friends with on Twitter!
>↑I don't even remember why I started Twitter.
	>[nishio https://twitter.com/nishio/status/1390329173986529283]: thanks for the example, which seems familiar to the intended audience!

>[minamiwo https://twitter.com/minamiwo/status/1390328803390459911]: 2400bps, word of mouth string from MNP 4 or 5, when autopilot could still read it in real time? <RT Also, wterm -li
	>[nishio https://twitter.com/nishio/status/1390329629622226948]: I guess that's a bit like a "hobby community" in the way it's conveyed to today's middle and high school students
 >[minamiwo https://twitter.com/minamiwo/status/1390332347761913859]: Thank you very much for translating this into easy-to-understand language. In my case, I was fortunate to have a good group of people to meet, some of whom could be my mentors, and I was able to swim around with no malicious intent if I could connect to them (I know it is risky from a security point of view nowadays).

>[tkgshn https://twitter.com/tkgshn/status/1390329204625920001]: following people of interest on Twitter, I guess!

>[teramotodaiki https://twitter.com/teramotodaiki/status/1390329282770006021]: The choice I am glad I made was "creating a company". The reason I chose this option was "because I had a good teacher at a technical college who connected me with a company" and the reason I chose this option was "because my parents recommended it to me because of its good job placement rate". This may be a bit similar to Mr. Nishio's example.
	>[nishio https://twitter.com/nishio/status/1390330374580961282]: why did that technical college teacher connect you to the intern? (I think there is something else in front of me because I didn't connect all the students)
	>[teramotodaiki https://twitter.com/teramotodaiki/status/1390335575312404484]: i think it's a great good question, but my memory is a bit fuzzy...
 > ・He had been coming in and out of the lab without permission since he was a freshman.
 > ・Belonged to club activities
 > ・Officer from the company where I interned happened to come to the club.
 > I want to go to the internship program! I want to go to the internship! I think a total of 4-5 people went to that company.

>[a2see https://twitter.com/a2see/status/1390329662895656963]: It was definitely around 1994-5 that I came across PC communication and started working as an online personality, but my memory is a bit fuzzy on how I learned about it. I think I bought a PC-98 Canbe (Win 3.1) with a part time job and read a lot of PC related magazines (I was looking for free software CD-ROMs) and that's how I learned about it. twitter.com/nishio/status/...
	>[a2see https://twitter.com/a2see/status/1390330937326465031]: I didn't have any friends around me to talk about PCs back then, so it was probably magazines. I read books, but I think I also bought a lot of magazines every month. I think I must have lived my childhood with the rush of the first issue of game magazines.

>[kaityo256 https://twitter.com/kaityo256/status/1390331213471092750]: In my case, too, the choice that made my life better was "applying for Unexplored Youth" and "that choice was told to me by a junior in the same lab". I don't know how that junior learned about it. ...... twitter.com/nishio/status/...
 >[nishio https://twitter.com/nishio/status/1390331828062457861]: did this junior talk about unexplored youth without regard to anyone else? Or did you pretend to be a catalyst for Mr. Robota to talk about such things?
 >[kaityo256 https://twitter.com/kaityo256/status/1390332527852679173]: When I was in my D1 year, a junior who joined our lab as an M1 student asked in our lab ML, "I heard that this year we are going to start a project called "Unexplored Youth Program". I was a member of the laboratory where people who liked programming gathered. I was the one who responded to the question.
	>[xoinu https://twitter.com/xoinu/status/1390346389687717892]: he's a junior who was a great help to me back then, I knew him through others too. I'm glad you think so. In the beginning, I thought that I might be able to get money without having to work part-time, so I approached a senior in my lab, and it was a good memory that I really went through with the project, and when I opened the lid, it was a terrific world.
	>[xoinu https://twitter.com/xoinu/status/1390350221310189570]: actually, I've had contact with @nishio since high school, so it's interesting to think about that and feel like I've connected the dots.

>[piro_or https://twitter.com/piro_or/status/1390331616958967811]: I think "creating and publishing my own Web site" was the beginning of my connection to a world not bound by geographical boundaries. (Not even the term "website".) Things like "let's make a website" were often talked about in magazines and other mass media at the time, and I learned about them passively. (Probably a different answer than I expected.) twitter.com/nishio/status/...
 >[nishio https://twitter.com/nishio/status/1390332307991515137]: What happened next with the website?
 >[piro_or https://twitter.com/piro_or/status/1390333391799603200]: I was living in Osaka at the time, but I made "hobby friends" who lived in faraway places such as Ishikawa and Kanagawa prefectures. I think this broke the stereotype that "socializing is something you do with people within a distance you can meet and talk to. On the other hand, I have developed a bad habit of neglecting my efforts to keep a close relationship. ......
 >[nishio https://twitter.com/nishio/status/1390334006500024325]: I see, so the distant friend you made was the catalyst for something else to happen next?
 >[piro_or https://twitter.com/piro_or/status/1390335118468812805]: I traveled to Tokyo alone to attend an "off-line meeting" with the idea of making things together and going to a doujin event and meeting for that purpose. The realization that I could go where I wanted to go if I wanted to expanded my options again (until then, I had no choice but to have my parents take me to places that crossed prefectural borders).
 >[nishio https://twitter.com/nishio/status/1390336125080723457]: I see, so that's how your world expanded and the positive feedback started to turn around?
 >[piro_or https://twitter.com/piro_or/status/1390336533870252035]: yes, I feel that way now that I think about it. Until then, I think I was a typical internalizer, just picking and choosing within the options given to me from the outside, while complaining about the mumbo-jumbo. ......

>[TERRAZI https://twitter.com/TERRAZI/status/1390332836956184576]: I know this may be off for Mr. Nishio and middle and high school students. When I was a child, I was so frustrated at an arcade that I tried to hit the table, but a stranger, a delinquent, said to me, "Why don't you just hit the table? The arcade is a place to relieve stress. Even if you hit it a little, it won't break, and you won't get angry.
 >[TERRAZI https://twitter.com/TERRAZI/status/1390333686663442433]: Common sense dictates that it is not a good idea to hit the arcade table. However, the brother said, "It's OK to hit the table. I was shocked.
 >[TERRAZI https://twitter.com/TERRAZI/status/1390334210498387969]: I was the oldest son and the oldest of my generation in my family, so I was always reserved to younger children. Because of this, I was reserved to my parents and everything else. I was convinced that I should be patient. It was a Yankee brother who taught me that I didn't have to put up with anything.
 >[TERRAZI https://twitter.com/TERRAZI/status/1390335048436502528]: then I no longer want to hit the table even if I feel sorry for myself. It's not that I don't hit the table because I shouldn't, it's that I can hit the table but I don't. I like the game. I like the game. Then I realized that I didn't have to be afraid to do other things that I wanted to do, and I became more proactive in many things!
 >[nishio https://twitter.com/nishio/status/1390335099510525952]: At first I wondered what you were talking about, but I see that you were given the opportunity to change your way of thinking. Did you ever see that person again?
 >[TERRAZI https://twitter.com/TERRAZI/status/1390335433171632131]: that was the last time. It was at that moment that I was freed from a kind of spell of my eldest son.
 >[TERRAZI https://twitter.com/TERRAZI/status/1390336785125822467]: you were limiting your own choices. Even if I wanted a snack myself, I would give it to my sisters. I thought I shouldn't have asked for them or said I wanted them. That's a bad example of "I was able to put up with it because I was the eldest son." This led to a negative attitude toward everything.

>[wkwkk_soprano https://twitter.com/wkwk_soprano/status/1390332936013058051]: In my case, "volunteering abroad for about 9 months" was an option that I think improved my life. I think I learned about it because of a combination of things: 1) I heard a lot about studying abroad as an undergraduate, 2) I had friends who went abroad to volunteer, and 3) I heard that NGOs can be a good place to work. twitter.com/nishio/status/...

>[suu____ https://twitter.com/suu____/status/1390333381901045765]: I think the reason I came up with the option of taking NAIST and switching to the information science department was because I took a class at NAIST when I was in high school. In fact, I did find out that Nara Institute of Science and Technology had an information session and went to listen to it twitter.com/nishio/status/...
 >[nishio https://twitter.com/nishio/status/1390334608164614146]: am I understanding correctly that your undergraduate degree was not in informatics, but you changed universities after your master's degree, and the way you found out about the university was through a high school outreach program?
 >[suu____ https://twitter.com/suu____/status/1390334738125058050]: yes it is!

>[kumarobo https://twitter.com/kumarobo/status/1390336167183147009]: The choice came suddenly in front of me, rather than me knowing about it. In that sense, I am not talking about "how I knew", but what "made the decision to choose that option smooth" was that I usually had an evaluation function set up in my mind. *It took me an hour or so to make the decision to apply after learning of the current open position. twitter.com/nishio/status/...

>[hack_tnr https://twitter.com/hack_tnr/status/1390336590761758721]: My choice was to learn about technology events such as Maker Fair 13 years ago and travel to Tama Art. I got to know about this event when I met an exhibitor at Design Festa and he told me, "You seem to like this event. If I had not said, "I like this part of your work," I think my life would have been different.
 >[nishio https://twitter.com/nishio/status/1390337393664790530]: Am I correct in understanding that you attended an event and told someone who was exhibiting at that event, "I like this part of your work," and you hit it off, and then that person told you about another event, "You I think you might like this event" and then he told me about another event.
	>[hack_tnr https://twitter.com/hack_tnr/status/1390341442099310592]: yes, it is correct. Sorry for the confusing text.

>[geinin https://twitter.com/geinin/status/1390336877723406341]: I have encountered 8-bit machines and the BASIC language. In the beginning, I thought, "If I can make my own games, I can play as much as I want. (It was just a tool for fun.) I got hooked on programming and started my life as an engineer. twitter.com/nishio/status/...
 >[nishio https://twitter.com/nishio/status/1390338376759349254]: Am I correct in understanding that what started out as fun later became work?
	>[geinin https://twitter.com/geinin/status/1390340320404013060]: thanks Reply Exactly. If I could add a little more, there is one aspect of my work that I enjoy. (^O^)

>[kze_yoshi8 https://twitter.com/kze_yoshi8/status/1390337054303657991]: I know this is probably out of context, but I went to college. I knew about that option, but it was very financially difficult and I didn't know what was ahead of me if I went to college. But I made that choice because it was something ugly, like a stubbornness that I couldn't allow myself to go to college, but in the end it made my life better. twitter.com/nishio/status/...
 >[nishio https://twitter.com/nishio/status/1390338500151545857]: what happened afterwards with going to college?
 >[kze_yoshi8 https://twitter.com/kze_yoshi8/status/1390340156758978562]: it's the people I meet. There are many people I could not have met without going to university, such as my husband and the person who introduced me to my current job. I also believe that my interest in programming bore fruit and became one of my main focus because I was able to study at the university.

>[shoya140 https://twitter.com/shoya140/status/1390337221228699651]: The choice was to enter a software development contest during my sophomore year of college, which I found out about through a friend's Facebook post. The friend and I were at different universities and the first time we connected was at a business contest information session I was invited to by another friend at the same university. japan.cnet.com/article/350131...
 >[nishio https://twitter.com/nishio/status/1390338902909538304]: I assume you mean that you made friends from different universities at an event that your college friends invited you to. (I don't think you made friends with everyone who attended the event.)
	>[shoya140 https://twitter.com/shoya140/status/1390343668696064007]: I don't remember what we talked about or how it came about (which wasn't particularly important), just that we talked at a reception at an event and I applied to be friends! >[shoya140 ]. I don't remember what we talked about or how we got to know each other (it wasn't particularly important).

>[HAKKE_sabage https://twitter.com/HAKKE_sabage/status/1390338801944301568]: Definitely, it was buying a 3D printer. I think the first time I found out about 3D printers was from a YouTube video, although it's not very common.
 >HAKKE_sabage https://twitter.com/HAKKE_sabage/status/1390339582927917059]: Another big thing was that I was invited to an event by someone on Twitter. I was hesitant because of my lack of confidence at the time, but then I thought, "If I'm going to change my life, I have to do something big, even if it means making a mistake.
	>[nishio https://twitter.com/nishio/status/1390341095213522945]: What prompted the person to invite you to open the event?
	>HAKKE_sabage https://twitter.com/HAKKE_sabage/status/1390342041830182913]: I originally met this guy through a game I was doing with a 3D printer, and he was making a lot of things with it. The first time I saw the 3D printer, I thought to myself, "This kid is going to grow in the future, so I'm going to support him while I still can.

>[t0yohei https://twitter.com/t0yohei/status/1390338807686254597]: Getting a job as an engineer I was desperate and attended a job fair and happened to hear about an engineering position. I didn't want to be in sales, so it didn't work out at all and I was lost. I was in the business administration department at university, so I was job hunting based on the premise of sales twitter.com/nishio/status/...

>[yamasii https://twitter.com/yamasii/status/1390340122739048453]: there's a lot to this and it's interesting to think about it again.
> ・Choice that I think made my life better afterwards by choosing this option -> Majoring in Cultural Anthropology.
> How did you know about this option? twitter.com/nishio/status/...

>[yomoyomo https://twitter.com/yomoyomo/status/1390340534519046147]: reminded me of Paul Graham's writing at practical-scheme.net/trans/hs-j.html As one might expect, it conveniently says, " It doesn't go into how to know your "life choices," but it does hint at "look for smart people and hard problems" and "spend lots of time on things that interest you, not chasing big ideas" twitter.com/nishio/status /...

>[sekikazu01 https://twitter.com/sekikazu01/status/1390341196078145536]: good thing: I started programming
> how do i know: > how do i know: > how do i know: > how do i know: > how do i know
> - My high school math teacher was an uncle who loved programming and happened to be offering that class.
> - Dean (career counselor) knew I liked games and recommended me
> - I was intrigued by the news that engineers were being sought after and decided to take the course.
	>[nishio https://twitter.com/nishio/status/1390342034813116420]: I understand that Dean knows that you like games, and that your math teacher has a programming class separate from your math class, and that you Am I correct in my understanding that you took a programming class?
	>[sekikazu01 https://twitter.com/sekikazu01/status/1390485009111281665]: yes, that's correct!

>[kaname https://twitter.com/kaname/status/1390341733163048962]: When I was in high school (in the 1980s), I was struggling with my career path and happened to walk into a used bookstore where I saw a technical book called "Introduction to Library Science" for sale at a discount. I realized that I was interested in information processing from a media perspective, and decided to apply to a university where I could study that subject. And here we are now.
	>[kaname https://twitter.com/kaname/status/1390344543694823426]: one more thing, when I was an undergraduate student studying library and information science, my advisor told me (it must have been Shannon's communication theory thesis lecture time) that if I wanted to go on to higher education, I should go to a more I was admonished that I should study the fundamentals of information science more broadly and deeply, so I decided to apply to an independent graduate university without a department. And here we are.

>[nishio https://twitter.com/nishio/status/1390342624947490819]: here's a summary so far togetter.com/li/1710572
	>[nishio https://twitter.com/nishio/status/1390343978466250752]: I'm steadily gathering examples of "friends with common hobbies and interests", "online personalities", "people I happened to meet, books I read, stories I heard", "I was just having fun. I was just playing around" are emerging.
	>[tkgshn https://twitter.com/tkgshn/status/1390344021344587778]: this is very abstract, it's like a move/difference of various physical and community concepts!
	>[nishio https://twitter.com/nishio/status/1390344907986849792]: いい表現！

>[zoriorz https://twitter.com/zoriorz/status/1390342652478967810]: Your choice was to change jobs with your current employer, and the way you found out about it was by attending an event hosted by the company and talking to their employees and recruiters there. I learned that I was eligible to apply for the job after attending an event hosted by the company and talking to the company's employees and recruiters.
	>[nishio https://twitter.com/nishio/status/1390342869852905472]: How did you get involved in that event?
	>[zoriorz https://twitter.com/zoriorz/status/1390343515326976006]: I think there was a problem that I had to preach about in order to attend that event, and it was buzzed about in the hatchet.
---25

>[hkawai3 https://twitter.com/hkawai3/status/1390450845775319040]: I also thought it might be the "Unexplored Youth Application"... but I thought that a more influential thing was that I started to make my own OS. So I thought about how I started to make my own OS. twitter.com/nishio/status/...
	>[hkawai3 https://twitter.com/hkawai3/status/1390450848317149185]: i loved fm-towns when i was in high school and i didn't want to lose to the PC-9801 series. I had already established my position as a computer expert among my friends when I was in high school, and my friends asked me which computer I would recommend. And I ended up saying TOWNS a lot (laughs).
	>[hkawai3 https://twitter.com/hkawai3/status/1390450849751597058]: a friend of mine bought a TOWNS and then asked me if this is really better than 98. (lol). I repeat my insistence that TOWNS is definitely better in terms of hardware, and finally I say boldly (at the gibberish level), "I can run 98 software on TOWNS" and start developing an emulator.
	>[hkawai3 https://twitter.com/hkawai3/status/1390450851295088649]: so it took a while but it works anyway. Lots of people downloaded it. ...and I came to the intuition that it would be faster to rebuild the OS to make the emulator better, so I started making my own OS from there.
	>[hkawai3 https://twitter.com/hkawai3/status/1390450852616232960]: I used to build language extensions and libraries, and even then I felt the OS specs were in the way and thought "maybe I should just rebuild this from the OS". So for me it's just a rehash of an idea I've had for several years. And the OS homebrew was supported by so many people.
	>[hkawai3 https://twitter.com/hkawai3/status/1390450853941710851]: So I made an OS called OSASK, but I ran out of money in the process, so I applied to Unexplored Youth and wrote a book called "30 Days to Make Your Own OS! I joined Cybozu Labs, and here I am.
	>[hkawai3 https://twitter.com/hkawai3/status/1390450855304826882]: Why did I decide to try to make my own emulator and OS, which was not very common at that time... I wonder why. To begin with, I don't see any difference between writing applications and writing system software. It is the same as making a game. If I don't like it, I just make it.
	>[hkawai3 https://twitter.com/hkawai3/status/1390451522752815105]: In the end, I just did whatever development I wanted and published it on the web, That's all there is to it. That's what I think.
	>[hkawai3 https://twitter.com/hkawai3/status/1390454594208079872]: I also think my unrequited love for TOWNS was good. Even when I would have given up if it had been for myself, I could not give up when I thought that I was doing it for the honor of TOWNS and to reward the wonderful developers. ...So I love Fujitsu, and I am sure that if I had had the opportunity first, I would have joined Fujitsu.
	>[nishio https://twitter.com/nishio/status/1391666930084290560]: what made you love FM-TOWNS so much?
	>[hkawai3 https://twitter.com/hkawai3/status/1391703286223360001]: the reason I liked it was that it was cheaper than competing models for good hardware specs. The picture was beautiful and the sound was good. And the reason I got to know TOWNS was because it was introduced in a monthly magazine called "Oh!FM". FM was because my uncle gave me an FM-8.

>[uchan_nos https://twitter.com/uchan_nos/status/1390463853192880128]: one, I think, is that I sent an email to Mr. Kawai when I was in middle school inquiring about the latest version of OSASK. I found this option on my own. I found OSASK on a website called "Vector" and the version seemed to be out of date, so I contacted the author. twitter.com/nishio/status/...
 >[uchan_nos https://twitter.com/uchan_nos/status/1390464695304261632]: The other thing is that during my first year of college, I decided to choose "Information Engineering" as the department I would pursue in my second year. At first, I thought that the Department of Electrical and Electronic Engineering would be good for me, but I received advice from a senior student to the effect that "I think the Department of Information Technology would suit Uchi", and my mind was moved in that direction.
 >[uchan_nos https://twitter.com/uchan_nos/status/1390465442804690944]: oh, I forgot one serious option. I think it was before I met OSASK, my father told me about Linux and bought me a book that came with a Red Hat CD-ROM. If it hadn't been for this, I might not have been interested in the "OS" thing.
	>[nishio https://twitter.com/nishio/status/1391672288961974274]: I was wondering what happened after I emailed Mr. Kawai in middle school to get acquainted with him, and the event that led the senior to say that he thought the information engineering department would be a good fit. I was curious about the following.
 >[uchan_nos https://twitter.com/uchan_nos/status/1391717602603372547]: After I met Kawai-san, I worked with the OSASK community for a while on documentation and application creation, and then I was told about OSC I was told about OSC and went to visit. There I met Akkie (who later went on to work for the parent company of OSC) and others.
 >[uchan_nos https://twitter.com/uchan_nos/status/1391718058066997248]: After attending OSC several times, I had only been in the OSASK community, but Mr. Kawai encouraged me to visit other I was only in the OSASK community before, but Mr. Kawai encouraged me to visit other communities. I learned then that there are many OSS communities.
 >[uchan_nos https://twitter.com/uchan_nos/status/1391718817840074755]: So you are a high school student. I wanted to make my own OS, and when I talked to Mr. Kawai, he told me that he was writing "An Introduction to Making Your Own OS in 30 Days! In exchange for letting me read the raw manuscript, I agreed to help proofread it. Midway through the book, I took off from the manuscript reading and proofreading work because I started studying for the exam in earnest.
 >[uchan_nos https://twitter.com/uchan_nos/status/1391719551662923780]: I'm a college student and joining the Robotics Technology Society, and during a chat with a senior at summer camp my freshman year, I asked for advice on choosing a department. The senior, knowing that I like both programming and electronics, said that programming would suit me better, although I'm not sure why.
 >[uchan_nos https://twitter.com/uchan_nos/status/1391720134159388675]: (In hindsight, the senior was in the information engineering department, so he may have been promoting his own place.) So in my second year of college, I entered the information engineering department I was a sophomore in college, and I went on to pursue a career in programming. In my second year of college, Mr. Kawai invited me to become a tutor for the Sepcan OS homebrewing group.

[https://gyazo.com/eb0af52aab8f22c0e91035bb2c106165]

>[oz_infj https://twitter.com/oz_infj/status/1390372590154260481]: "Crossing Spain without getting a job" ⇒I learned about the world heritage of the road through religious studies at university. ⇒Made friends from many countries ⇒I learned to speak Spanish ⇒This experience led me to a company that I couldn't get into if I had been job hunting at university and I got a job ⇒I became strong in IT ⇒Headhunted by a German company ⇒They attended my trip twitter.com/nishio/status /...
	>[nishio https://twitter.com/nishio/status/1391653927104380934]: I was a little confused about this, but in the timeline, when did you "travel across Spain"? I was thinking that I learned about it in a college class, traveled across Spain, and then got a job, but I'm not sure because there is a "travel attendant" at the end.
 >[oz_infj https://twitter.com/oz_infj/status/1391654897351680006]: your perception of the timeline is correct. I had to force the last part in because I didn't have enough characters. I made friends in each country, and when I went to visit them during my vacation, "they let me stay in their homes and showed me around, so I was able to spend more time there than I would have if I had traveled alone." This is the meaning of the phrase.
 >[nishio https://twitter.com/nishio/status/1391656230909661186]: is this what you mean by causality left to right? pic.twitter.com/xf43AB2RUT
 	[https://gyazo.com/fbb8d8ac6cd9194df4d2f12bd0f7240f]
 >[oz_infj https://twitter.com/oz_infj/status/1391656704224292864]: correct. Sorry I didn't communicate it clearly. Thank you for summarizing.


>[dmikurube https://twitter.com/dmikurube/status/1390350470552580097]: Considering that my life now is almost entirely based on my connection there, it's my participation in ICPC. I found out about it when I heard about the experience of a senior member of my high school club who joined it at his new school (the only thing I can remember about why I joined that club is that I was planning to join the chemistry club, but this looked more interesting when I was in the first grade...)

>[nanasess https://twitter.com/nanasess/status/1390352097544085505]: for providing Emacs icons to the head family. I learned about it by participating in MacEmacsJP and other technical MLs.
	>[nishio https://twitter.com/nishio/status/1390352768808873989]: am I correct in understanding that you joined the ML, found out "that icons were needed" and provided them? What happened next by providing them?
	>[nanasess https://twitter.com/nanasess/status/1390355419361472513]: yes, you are correct in your perception. My Emacs connections expanded, I started to use Emacs more, my skills improved, and I got more work. I have had a lot of help from many people, but the experience of contributing to a well-known piece of software has also given me confidence.

>[keno_ss https://twitter.com/keno_ss/status/1390366505791987717]: I participated in the Yatsugatake Freshman Seminar in my first year of college. I only found out about it by chance, when I saw a notice on the bulletin board of the university. I was bored in the classes at a local university, but I was stimulated by the seminars with people who liked mathematics and by the good books they taught me, and I decided to pursue such a career.

>[legoboku https://twitter.com/legoboku/status/1390377173022699521]: I was invited by my university's robot development club to participate in an event called Botball, a robotics competition sponsored by NASA in the United States, on an invitation only basis. After that, I became interested in foreign countries and languages and started working abroad. The trigger was when I attended a drinking party with my labmates and met someone from that robotics circle and was invited to be in charge of programming.
	>[legoboku https://twitter.com/legoboku/status/1390378365866045443]: My labmate and his robocircle met through an on-campus exchange overseas internship program (internship at a European company). I went to the Silicon Valley area for the U.S. Robocon in my junior year of college, which was my first time abroad. He thought it would be interesting to go abroad, so he also participated in an international internship program during his first year of his master's degree. That helped him improve his language skills, and he decided to work abroad at a later date.

>[Waroe https://twitter.com/Waroe/status/1390378743001092098]: what I learned that life is easier after graduate school (master's degree) How to know what your options are Casual musings from a friend who is in the same school but clearly smarter than you.

>[ina_ani https://twitter.com/ina_ani/status/1390419475506204674]: I don't think I made a choice, but rather, I think I went through a lot of trials and found the ones that looked good, and here we are today. It's a synthesis of countless fine choices, and I'm not sure which one is the most promising. (Interesting to see the response twitter.com/nishio/status/...

>[hatone https://twitter.com/hatone/status/1390419795338665985]: In my first year of high school, I appeared on a TV show called the High School IT King competition, which made my life better after that. A senior in a club I liked at the time told me about the option. I really didn't think that my skills living in Hokkaido would allow me to go on TV or to a national competition, so it was a catalyst that made a big difference.

>[koshian https://twitter.com/koshian/status/1390430171056861186]: "Meeting UNIX/Linux" was my first experience to know that there is a world where hard work is rewarded. How I found out was when I was given an account on a server that was co-managed by my circle mates twitter.com/nishio/status/...

>[jmuk https://twitter.com/jmuk/status/1390435347247472641]: I think one thing is that I participated in the RHG reading group. The reason why I joined is because I knew the organizer, Mr. Takahashi, and the reason why I knew him is that we had met in our hobby SF reading community. twitter.com/nishio/status/...

>[anohana https://twitter.com/anohana/status/1390438194391384065]: I guess my big choice was coming to the US for work ← I learned about that choice from my part-time job at a TV station CG center ← theatre-related contacts ← I joined the theater club in high school. I guess it goes back to twitter.com/nishio/status/... twitter.com/nishio/status/...

>[cafenero_777 https://twitter.com/cafenero_777/status/1390438560914935810]: I joined a nearby Savage on BBS, got a part-time job at one of the participants' family members' place, and helped them start a new web-based business. I remember that something long-hop happened when I think about it now. twitter.com/nishio/status/...

>[itawasa https://twitter.com/itawasa/status/1390440380156416003]: by choice, I studied physics and was able to reach the end of the frontiers of academia. How did I get to know it? Was it roughly from Newton magazine or science-related mooks? I don't know how I came to know about it, maybe from Newton magazine or a science mook. I don't know how I got to know him. twitter.com/nishio/status/...

>[inuro https://twitter.com/inuro/status/1390441153166671872]: When I dissed the quality of a certain company's maps on Twitter, I was told "If you're going to go that far, you should do it yourself" and moved my whole family to the US.

>[hsbt https://twitter.com/hsbt/status/1390442929412403201]: I was a part-time lecturer at a college of technology, and I took one class to talk about Ruby and ruby-math, which I thought was interesting. I started to work on OSS and Ruby. twitter.com/nishio/status/...

>[SIHO_o https://twitter.com/SIHO_o/status/1390443467734614016]: 2 years ago. The choice →I looked for a lacquer artist on the Internet and decided to learn lacquer at his lacquer studio. What is this beautiful thing?" twitter.com/nishio/status/...


>[y_okady https://twitter.com/y_okady/status/1390480528080441346]: I started a futsal club in college with a friend of mine, and soon after I entered the university, I went to visit an existing soccer club and met the friend, I went to visit an existing soccer club right after I entered the university and met the friend. If I hadn't gone to visit that soccer circle that day, I wouldn't have had this option. twitter.com/nishio/status/...
	>[nishio https://twitter.com/nishio/status/1390489559994048514]: What did starting a futsal circle lead to afterwards?
	>[y_okady https://twitter.com/y_okady/status/1390491890617704449]: We went to each other's weddings afterwards, and 20 years later we still keep in touch with each other, and I met my wife in a futsal circle. I met my wife in a futsal circle, and I guess you could say that it was the choice that defined half of my life!

>[toyoshi https://twitter.com/toyoshi/status/1390452337773211652]: In junior high school, I was invited by a classmate to a workshop to build an electric car. I think the reason why I was invited to that workshop was because people around me knew that I liked crafts. I feel that it is important for people around you to know your current interests twitter.com/nishio/status/...

>[garyu https://twitter.com/garyu/status/1390456021454262277]: While stationed in the U.S., someone I knew through a web diary community messaged me and asked me to apply for a job at their company. I was offered a job, and I learned that there is an "option to work in the U.S." for me. twitter.com/nishio/status/...

>[keigoi https://twitter.com/keigoi/status/1390463399893422082]: I attended FLOPS 2006, an international conference on functional and logic programming languages, where I met Ogasawara-san, also from Nagoya, and after returning home, he and some volunteers formed the OCaml-Nagoya study group. After returning to Nagoya, I formed the Nagoya Study Group and started a group on functional types and proofs in Nagoya. At the same time, he joined a study group on area theory in Tokyo, where he got acquainted with Masahiro Sakai, Takeo Imai, and others, and started working on TaPL translation (I think?). twitter.com/nishio/status/...
	>[keigoi https://twitter.com/keigoi/status/1390464079739768833]: How did you know about FLOPS: I was in D1 at the time, and I was on the TYPES mailing list, so I went to my advisor and asked to go, or maybe I did a poster I may have given a poster presentation. I think I found out about the sphere theory study group through "Hatena Diary" or Mr. Sakai's blog "Hibirute".
	>[keigoi https://twitter.com/keigoi/status/1390464706716991493]: is it an option or nothing...

>I learned about technical colleges through TV's Robocon, which my parents recommended to me because I was interested in science and programming. I was interested in science and programming because of a magazine called "Kodomo no Kagaku" (Children's Science).
	>[oogFranz https://twitter.com/oogFranz/status/1390467541110198272]: I can only thank my parents for this, and I wonder if they would be interested? They gave me a lot of things during my illness that I would have been interested in...

>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/1390470325280800770]: 購読してもらっていた雑誌の記事でしょうか。 twitter.com/nishio/status/…
	>[nishio https://twitter.com/nishio/status/1390476507378688001]: what did the magazine article lead to?
 >[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/1390476643412496384]: and a hands-on learning experience? We were looking for members to join a
 >[nishio https://twitter.com/nishio/status/1390493823571152897]: what is that hands-on learning experience like? Is it like a science event for middle and high school students? What happened afterwards as a result of your participation in it?
 >[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/1390494753121214466]: exactly like a science event for middle and high school students. Participating in it gave me a goal to "travel to the US".
>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/1390472086980726784]: Maybe it depends on the person, but choice doesn't seem to exist. I can't think of many opportunities where I have been given a choice myself. I think it is mostly determined by your birth, upbringing, and surroundings. However, I feel that I have been able to decide for myself the direction in which I want to go.
	>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/1390475683831238656]: since you said "in later life", this tweak is about my younger years. After I got my degree and license, some choices arose. Whether it was quitting public service or returning to Hokkaido, I chose to do so. twitter.com/tweeting_drtak...

>TJO_datasci https://twitter.com/TJO_datasci/status/1390468177054769152]: I had just been fired from my post-doctoral position at Komaba and could not find a new position, so I googled "I want to think about finding a job at a company, but how am I going to do it at 35 years old? I've been thinking about job hunting for the first time in my life at the age of 35," I googled and found Akariku, a famous job hunting support and career change service for PhDs. twitter.com/nishio/status/...
	>[TJO_datasci https://twitter.com/TJO_datasci/status/1390469403897040898]: The first interview I had at that time was with a global consumer goods company (I was not hired). I remember I was astonished that the salary they offered me as a model salary was much higher than what I was making as a post-doc, even though they "took into account that I was 35 years old with no experience. After that, I made a full-fledged decision to work for a company.
	>[TJO_datasci https://twitter.com/TJO_datasci/status/1390472836779712512]: The Akarik representative who was very helpful at the time recommended me to accept the offer and I decided to join the company at my previous position. The CTO at the time, whom I met there, gave me a new position and title, saying "Ozaki-san, you can call yourself a data scientist, right? I owe the greatest debt of gratitude to both of them.

---50

>[magoroku_seven https://twitter.com/magoroku_seven/status/1390467698912419843]: When I was in high school, I happened to read a small article in my local newspaper, "Today's Person", which introduces someone every day, and I found out that Mr. Kutaragi, the creator of PlayStation, was introduced. I learned that Mr. Kutaragi, the creator of PlayStation, was a graduate of the University of Electro-Communications.

>[amecomin https://twitter.com/amecomin/status/1390469803345776644]: I guess you could say that I learned about it, or rather, I did, but I shifted to another way to go to high school (another course)... I think it gave me time to think about myself a lot, and I think it gave me a chance to develop my strengths that I couldn't learn in school (which is also connected to my current job). twitter.com/nishio/status/...

>[patty_ohare https://twitter.com/patty_ohare/status/1390472907906637829]: In my case, it's not so common, but I studied abroad in the US after graduating from a Japanese university and stayed there. If I had stayed in Japan, I would have had a hard time in a society with a large gender gap. I can't remember when I learned about the choice, but it was when I was a child. Maybe I learned about it from a biography of a great person or something. twitter.com/nishio/status/...

>[TomiyaAkio https://twitter.com/TomiyaAkio/status/1390474376991150086]: twitter.com/nishio/status/... Not really one big decision. I'm not saying it's one big decision, but when in doubt, I'll choose the one that looks interesting (even if it's hard). One big decision I made was to change my field of study from undergraduate to graduate school of particle theory at Osaka University. I found out about the graduate school by doing a lot of research.

>[kzktkhs111 https://twitter.com/kzktkhs111/status/1390475592403849220]: In the spring of my first year, I was planning to withdraw from JSPS and go to Ethiopia as a Japan Overseas Cooperation Volunteer (I passed the first examination), but when I went to report it to a professor who was not my supervisor, he told me that it would be easier to get a visiting position in an overseas lab if I had a fellowship. I was told by a professor who was not my supervisor that if I had a fellowship, it would be easier to be accepted as a visiting researcher in an overseas lab. twitter.com/nishio/status/...

>[arcanum_jp https://twitter.com/arcanum_jp/status/1390476611737186305]: Is it the existence of vocational training schools? When I was working as a sales representative for a machine tool trading company, I was in agony because I didn't want to work in a job where I didn't have to create anything by myself. She told me that she entered a vocational training school and was offered a job. There was also an information and communication department, so I went to the training school on the same day.

>[IWAN_NAOK https://twitter.com/IWAN_NAOK/status/1390480288485187584]: Choice: Start curling at the same time as entering university (→I did) Trigger: High school classmates said to me, "I'm thinking of curling when I enter university. I'm thinking of playing curling when I enter university. (and I ended up going to the same university as them) twitter.com/nishio/status/...

>[bohebohechan https://twitter.com/bohebohechan/status/1390480422283276288]: When I was in junior high and high school, I didn't have multiple options at all, and although I entered an advanced school, if my grades were good, I would go to a national university within my commuting distance, I was so stuck that I didn't want to go to school and ended up dropping out. twitter.com/nishio/status/...

>[__fumie0000 https://twitter.com/__fumie0000/status/1390480715872043008]: very good question, and the replies are wonderful as a collection of thought-provoking examples! twitter.com/nishio/status/...

>[risay https://twitter.com/risay/status/1390482078198767620]: high school, I guess. For the first time, I was given clear responsibility for my academic preparation, with parents off-limits from the entrance orientation after I was accepted. I think it changed my perspective on life. I didn't know it was that kind of school. The only reason I knew was because my neighbor's sister who moved to a new place went there and my mom was fascinated by the private school and promoted it twitter.com/nishio/status/...

>[ayamiya125 https://twitter.com/ayamiya125/status/1390482515035443202]: there are several, but "how did you know about that option?" are all Google searches. I guess it shows how thin my relationships are that it doesn't look like it was something someone said to me twitter.com/nishio/status/...

>[kkaigai https://twitter.com/kkaigai/status/1390483009304895490]: Choice: In my second year after graduation, when I was assigned to investigate SELinux at work (involuntarily), I realized that the internal implementation was terrible, so I made a patch to replace spinlock with RCU. I made a patch to replace spinlock with RCU and threw it to the community (voluntary). I found out: A senior colleague of mine at work was throwing patches to IA64 Linux ML and suggesting features. twitter.com/nishio/status/...

>[signs0302 https://twitter.com/signs0302/status/1390484723160342530]: Joining a club called "Science Incarceration" for the purpose of participating in interdisciplinary academic conferences →I failed the university entrance exam so that I could escape by transferring to another university. I was bored because I happened to see a poster at an information session. I failed to transfer after that, but my research on taste in my second year got a buzz and was highly evaluated, so I got carried away and entered a doctoral program twitter.com/nishio/status/...
	>[signs0302 https://twitter.com/signs0302/status/1390485456492523522]: Since then, I've been on a roll and had a lot of good experiences with unexplored, bear foundation, etc. Thanks to those who appreciated my poor research back then!

>[kadoyan https://twitter.com/kadoyan/status/1390485020993736705]: Before I turned 30, I was feeling depressed about my job at my company, and when I talked to the president of another company I was working for, he said, "Why don't you go freelance?" I left the workforce and became a freelancer. Until then, freelancing was not an option for me.

>[takieisuzu https://twitter.com/takieisuzu/status/1390485939340791808]: It all started with a friend who was a great help...!

>[nimdanaoto https://twitter.com/nimdanaoto/status/1390489946234908672]: hmmm, I guess I went to a high school that did Super Sciences Highschool. I wanted to do science-related studies when I chose high school, so even if I went to a regular high school, I wanted to go to a place that had a special science education. I still don't know if it would have been a better life than going to a technical college. twitter.com/nishio/status/...

>[yokochie https://twitter.com/yokochie/status/1390489763392626689]: Good thing: The existence of a technical college and entering a technical college Chance: When I was in junior high school, I was friends with a technical teacher and he told me about it in my third year. I didn't know anything about it until then. twitter.com/nishio/status/...

>I uploaded my work on social networking sites and the person who sent me a message saying how nice it was was the president of my former employer and that he was looking for a job. I sent him my portfolio and received a job offer without an interview. I made my choice. twitter.com/nishio/status/...
	>[m_sigepon https://twitter.com/m_sigepon/status/1390492023711358980]: I thought he was just complimenting me and I let it end there, but nothing happened after that. I sent her a message, thinking that she seemed to be running some kind of company and I should ask her if she was looking for a job. At that time, they did not have a website and were not recruiting.

>[tt_clown https://twitter.com/tt_clown/status/1390474834170327040]: Looking back on my life, I feel like "all is well that ends well". In hindsight, there are some choices that I made at the time that led to good things later on, but those choices are (seemingly) lame, like "I tried to be a net game cripple" or "I threw away my PhD program".
	>[tt_clown https://twitter.com/tt_clown/status/1390474834170327040]: Looking back on my life, I feel like "all is well that ends well". In hindsight, there are some choices that I made at the time that led to good things later on, but those choices are (seemingly) lame, like "I tried to be a net game cripple" or "I threw away my PhD program".
	>[tt_clown https://twitter.com/tt_clown/status/1390474835394928644]: My wife was admonishing our one-year-old, "Daddy happens to be successful, so that's good, but I wouldn't recommend dreamers too much." and I thought, "I'm in the dreamer's bracket? I thought, "I'm a dreamer. I can only say, "I just kind of went along with it and that's how it turned out. In that sense, I wasn't really chasing a dream. ......
	>[tt_clown https://twitter.com/tt_clown/status/1390474836565102592]: I've been more and more aware of "how much time I have left" lately, and when I do, I think "10 years to get to where I am now... ...but I could have shortened it by 5 years. I sometimes feel regret that I wasted too much time, but I also feel that the future would have been totally different (and not necessarily better) if I actually did that. All is well that ends well.

>[chibatching https://twitter.com/chibatching/status/1390493593488400384]: I was stressed at SIer because I couldn't do any technically interesting work, so I started developing Android apps as a hobby. I think it was my first time to publish an Android app to the store. twitter.com/nishio/status/...
	>[chibatching https://twitter.com/chibatching/status/1390493595203899392]: Since we had English support from the beginning, the total number of users was quite small, but there were some overseas users. Among them, there were some overseas users who occasionally e-mailed me with various questions or feature requests, and I answered their questions or gave my opinion on their feature requests without much concern.
 >[chibatching https://twitter.com/chibatching/status/1390493596265054208]: The SIer in my day job was recruiting participants for an overseas language training program because he wanted to strengthen English throughout the group at the so-called meiko & department. My boss recommended me to apply for the program because there was a certain quota of applicants. I was fed up with the life of traveling all over the country to support Desma, so I immediately jumped at the chance to apply and was lucky enough to be hired.
 >[chibatching https://twitter.com/chibatching/status/1390493597288468481]: Just before I left for a month-long homestay language study program in Boston, I received another question from an overseas user. I told him that I might be late to reply because I was going on a business trip to the U.S., but when I got settled in Boston, I replied to his question and we had a little chat.
	>[chibatching https://twitter.com/chibatching/status/1390493598362136579]: "I live in Mountain View, why don't you come over here?" And. At that time, I somehow got the Google+(!) from the other person's email. and it says Google for the place of work.
	>[chibatching https://twitter.com/chibatching/status/1390493599305854977]: Seriously... I thought, jokingly, "I'd love to go if you have time, can you show me around if I go?" I replied, "Of course. I thought it might be a social call, but I knew it would be a rare opportunity, so I made a plan to go to San Francisco from Boston on a Saturday or Sunday when the language course was closed and pushed ahead.
	>[chibatching https://twitter.com/chibatching/status/1390493600258019329]: I thought about what I would do if I couldn't meet him, but I thought I'd just go sightseeing and go home, and I was desperate enough to go. I'm not sure what to do about it, but I'm not sure what to do about it either.
	>[chibatching https://twitter.com/chibatching/status/1390493603638648836]: I actually got to meet him, see SF, Mountain View, and the Google HQ office! I had a great time with them and had a beer at the bar with them.
	>[chibatching https://twitter.com/chibatching/status/1390493604573978625]: As we talked about various things in poor English, I was asked, "Why don't you come to Google?" I can't speak English properly, so I could only reply with something like, "Well, I'd like to go if I could,
	>[chibatching https://twitter.com/chibatching/status/1390493605526077441]: It made me strongly aware that I wanted to pursue a career in programming. After all, I had left the SIer about 6 months after returning home from training and changed my job as an Android engineer.
	>[chibatching https://twitter.com/chibatching/status/1390493606448746500]: Unfortunately, I still don't have the ability to work at Google or speak English, but I've been able to make a decent living as an Android engineer. I don't really know what will be the catalyst for my career.

>[dokon https://twitter.com/dokon/status/1390494976094576643]: I was listening to a lecture at the front of the room when I heard that a professor from another school was in trouble because of a cancellation for a certain seminar. I said, "I'm interested," and the next month I was invited to a seminar in the U.S. where students from all over the world would come to attend. To be honest, it was like I went there to be humiliated, but it was a very good experience for me.

>[m_sigepon https://twitter.com/m_sigepon/status/1390494485801357314]: When I was in junior high school, I was in the brass band, but in my second year I wanted to quit because the advisor was not a good fit. I joined the brass band because I didn't want to be in the sports club, but the only other club I could join was the sports club. I talked to my homeroom teacher and she came to my house and convinced me to quit. twitter.com/nishio/status/...
	>[m_sigepon https://twitter.com/m_sigepon/status/1390495508100108290]: I don't think many teachers would come to my house and convince my parents to quit something. That's how I ended up taking an oil painting class instead, through my father's teacher. If I had not said I wanted to quit, I would never have entered the path of beauty. Quitting something is also a chance to start something.

>[kawaz https://twitter.com/kawaz/status/1390449528705228803]: I'm a book lover and a miscellaneous reader, so I read every genre of comics and novels that came to my attention. In terms of encounters, I would say bookstore shelves. There was no internet at that time.

>[nishio https://twitter.com/nishio/status/1390497594904702980]: I decided to put it all together in Scrapbox because the volume was getting too much. I just counted and there were 70 responses. How did you know your life choices? scrapbox.io/nishio/%E4%BA%...

--- 70

>[ukkaripon https://twitter.com/ukkaripon/status/1390497386888237060]: 色々な体験談が集まっていて素晴らしいのだが、特に Paul GrahamのWhat you'll wish you'd knownがビビっときた。 A key ingredient in many projects, almost a project on its own, is to find good books.なのでもっと本読もう。 英語：paulgraham.com/hs.html 日本語：practical-scheme.net/trans/hs-j.html twitter.com/nishio/status/…

>[NetPenguin https://twitter.com/NetPenguin/status/1390498851736326144]: that I got into Java. I learned about Java by helping a friend with an i-application he was making. At the time, I thought "what kind of language can't create an executable file ......", but I started using it because of its convenient threading and networking features. twitter.com/nishio/status/...
	>[NetPenguin https://twitter.com/NetPenguin/status/1390500448394571778]: I could use Java -> assigned to a Java-related team at a company where I graduated -> blessed with a team boss and colleagues -> blessed with projects -> about my boss Changed jobs -> changed jobs (several times) -> up to now
	>[NetPenguin https://twitter.com/NetPenguin/status/1390501793222651905]: One more thing, in middle school we were given a textbook on programming. I was interested in programming and bought a computer with bytes when I was in high school. I got really interested in programming and wanted to do it, so I got a part-time job and bought a computer when I was in high school.
	>[NetPenguin https://twitter.com/NetPenguin/status/1390501794233552896]: My summer vacation disappeared into part-time work (buying a computer). Winter vacation also disappeared into part-time job (purchase of CD-ROM drive).

>I was a sophomore in high school, and I had a good friend who was an adjunct instructor who helped me with my career path, and I didn't think about it. I think both of them were important crossroads for me twitter.com/nishio/status/...

>[_yshrsmz https://twitter.com/_yshrsmz/status/1390495846236495873]: When I was in elementary school, I participated in a homestay in Australia organized by the town. Since then, I've been somewhat interested in English until now. twitter.com/nishio/status/...
	>[_yshrsmz https://twitter.com/_yshrsmz/status/1390496237896433667]: Just being able to speak English increases the amount of information you are exposed to by far. We all do it through compulsory education, so it's very unwilling to make this a differentiating factor, but it's a reality of the Japanese IT industry.
	>[nishio https://twitter.com/nishio/status/1390496575483351041]: What did your interest in English lead to after that?
	>[_yshrsmz https://twitter.com/_yshrsmz/status/1390500082483535873]: I work developing web services. The technology I use for development is universal, so I have more information in English. By being able to speak English, I can access more information, and as a result, I can become an "IT engineer who can get paid reasonably well".
	>[_yshrsmz https://twitter.com/_yshrsmz/status/1390501352229412865]: Of course, being able to speak English increases the amount of information you are exposed to, and this is not limited to the IT industry, but is true in any industry!　I believe it was through my parents who read the town's newsletter that I found out about the homestay!

>[yskddk https://twitter.com/yskddk/status/1390499775292731392]: that I graduated from high school, got a job, and a few years later went to night college and got a degree. I frequently visited my high school math teacher because I didn't understand the higher math I was encountering on the job, and he recommended that I go to night college. Thanks to this, the connection between the real world and the study of higher education became clear to me, and I was able to think about things with a focus on providence twitter.com/nishio/status/...

>[riywo https://twitter.com/riywo/status/1390499877147217924]: Living abroad←A person I became friends with on Twitter introduced me to someone working abroad. I had only vaguely thought "I'd like to go there," but after learning more about visas from this person, I realized that I couldn't go unless I set my sights on living there. Thanks to him, I found a good environment for my child and a good job.

>[_ko1 https://twitter.com/_ko1/status/1390504746419560452]: I don't remember anything about why I wanted to do programming (I just remember that I wanted to do it so badly).

>[ryushi https://twitter.com/ryushi/status/1390504867257479171]: when I graduated from high school, I wanted to work with computers. I assumed that the industry was young and that years of experience, regardless of content, would be the core value-added of that job, so I figured I should start my career as soon as possible. twitter.com/nishio/status/...
	>[ryushi https://twitter.com/ryushi/status/1390505784895696896]: The first time I touched a computer in my life was in the computer room of my junior high school. I did not do much programming, but talked and played games with my friends in the air-conditioned room, I learned a little N88-BASIC and tried something called Turtle Basic, but the knowledge I gained at that time was almost useless.
	>[ryushi https://twitter.com/ryushi/status/1390505785868750852]: On the other hand, my experience at this time was the basis for my desire to work with computers.
	>[ryushi https://twitter.com/ryushi/status/1390506306486693888]: As I recall, in eighth grade, computer labs were suddenly built throughout the local public middle school, and as part of a subject called "Technology," something like using a computer to do something. I felt like I was touching a computer as part of a class on woodworking or something like that. I think it was like touching a computer as part of a class on woodworking or something like that.

>[ikemo https://twitter.com/ikemo/status/1390506259858690049]: moving to a company that does team development I didn't know what I really wanted to do →After reading books and googling, I found Google's "Effective Teams I found Google's "What is an effective team? →I realized that all I had been doing was just "workgroups". →I decided that I wanted to work for a company that develops with a "team".
	>[ikemo https://twitter.com/ikemo/status/1390805448224239617]: I found a past tweet and put it up. twitter.com/ikemo/status/1...
 	>[ikemo https://twitter.com/ikemo/status/1086073310549397504]: i saw Google's "effective teams" document the other day and was kind of shocked. rework.withgoogle.com/en/ guides/unde...
		>[ikemo https://twitter.com/ikemo/status/1086073635578605569]: The first part of this has a definition of "team", but I have never belonged to a "team" that fits this definition. I have only belonged to "workgroups".
		>[ikemo https://twitter.com/ikemo/status/1086598652179566595]: "Experience demonstrating teamwork" has always bothered me as a staple of the interview process, but teamwork in a situation where you are not even a team is difficult, if not impossible. It's not impossible, but it's very difficult. It's pretty hard to be disadvantaged by it.
		>[ikemo https://twitter.com/ikemo/status/1089402070669524992]: in a team, it is a natural act to encourage others, but in a workgroup it can be an overreach. That's why it's so challenging.
		>[ikemo https://twitter.com/ikemo/status/1089517978184372225]: I did a lot of research and thinking in my spare time and couldn't come up with any ideas that I could manage in the current situation.
		>[ikemo https://twitter.com/ikemo/status/1089520447970918401]: Well, there's no way you can figure out in a few hours what you couldn't figure out in months, and that's why you're looking for a new job, because it's difficult. I dare say that the only thing I can do is to "do what I can do little by little," but is it worth spending 10 years of my life to do that? So....
		>[ikemo https://twitter.com/ikemo/status/1089526079738368000]: I'm thinking about this not because I have any unfinished business with my current company, but because I wanted to prepare my own answer to what I should have done.
		>[ikemo https://twitter.com/ikemo/status/1089526617938944000]: It's not that I didn't do anything, I did a lot of things myself when I was consulted.
		>[ikemo https://twitter.com/ikemo/status/1089528919034814464]: I have to admit that I don't like some of these conclusions, but I may have to say, "Let those who don't try go. I was surprised to find these words in Drucker's "Management of Nonprofit Organizations".

>[hidey https://twitter.com/hidey/status/1390512834413404160]: I think I applied for a junior high school science class that was held at the National Olympics Memorial Youth Center during summer vacation, where students stayed for a week or so. (I forgot the official name & it was in the days when there was no internet, so I couldn't find it even if I looked it up. I've heard that twitter.com/nishio/status/...
	>I don't think they do it anymore, but I participated in the first one, and I think they did it every year for a few years. I think it was held every year for a few years (probably), but I remember it was quite a gorgeous experiment with a lot of public subsidies due to the background of the times.
	>[hidey https://twitter.com/hidey/status/1390512836854517768]: Well, I just think it's too reckless to lecture to junior high school students about how light has the properties of both waves and particles. I don't think so, but I feel that a slight change in trajectory as a child has a lot of influence over time, so I guess this is it...
	>[hidey https://twitter.com/hidey/status/1390512837781381124]: I don't know how I found out about it... I think it was an ad in the newspaper or something... maybe my parents found it and told me about it.

>[Isa_rentacs https://twitter.com/Isa_rentacs/status/1390512840725852160]: I think the biggest one was where I went for my MS internship, but I don't remember how I found out. ... I think I was just looking for a place that was looking for something, but there were a lot of people around me talking about long-term internships, so maybe that's part of the reason. twitter.com/nishio/status/...

>[MoyuruAizawa https://twitter.com/MoyuruAizawa/status/1390514449446961156]: I guess I became a SWE. At first, I joined a contracted development company with the intention of becoming a so-called "IT worker" (and fortunately, it was a white company). I thought it would be nice if I could get into a major CS game company after building up my skills there, but I ended up in a web company and my salary went up steadily and I became happy. twitter.com/nishio/status/...

>[hogedigo https://twitter.com/hogedigo/status/1390515482474725379]: that I chose the Go language. I'm almost eating on it now. It all started when I complained about the slow spin-up speed of GAE/Java to Mr. K. at an event reception and he told me "Go is fast". That was just 9 years ago. twitter.com/nishio/status/...

>[hrjn https://twitter.com/hrjn/status/1390516405263421440]: I think it was applying for the "Dream Gate" project sponsored by the Ministry of Economy, Trade and Industry to increase the number of entrepreneurs. It was a great opportunity for me to get to know such and such people, many of whom are still my friends today. I think it started when I saw a poster on the bulletin board of my department and applied for the program. twitter.com/nishio/status/...

>[Zimaming https://twitter.com/Zimaming/status/1390517104651096068]: it's like I arrived at it by thinking from the data and knowledge I got from reading various books I didn't see the options themselves anywhere twitter.com/ nishio/status/...

>[riko https://twitter.com/riko/status/1390517348168200200]: thinking back, it's usually at a bar or a live music club that I get to know "it", not at school or at work. If I had lived a normal life seriously, it would have been a totally different life. twitter.com/nishio/status/...

>[send_ https://twitter.com/send_/status/1390518751947153413]: I was working as a data manager at a CRO and writing code to improve operational efficiency when a senior colleague at work advised me to become a software engineer. About 15 years later, I made about 5 times the annual salary I was making at the time.

>[motohasystem https://twitter.com/motohasystem/status/1390521447487983620]: I tried my hand at building my own drone. At the time, I had to make the missing parts by myself using a 3D printer, so I learned how to use it, and after that, I taught classes at school and started my own company. I learned how to use a 3D printer and needed to make the missing parts to make a drone.

>[BlizzieAgain https://twitter.com/BlizzieAgain/status/1390522677392150529]: I owe my current YouTube streaming activities to playing the Specter Watch game. And the kicker was that my younger brother, who was in elementary school at the time, was playing the Yokai Watch game. Other content that I started to have a relationship with "because my brother was playing or watching it" often had a positive impact on my later activities.

>[megkurotsubaki https://twitter.com/megkurotsubaki/status/1390512540891848712]: having been a patent attorney. Someone at the institute where I worked part-time when I was in college told me about it. She recommended me that it was fun to work as a patent attorney, that I could do it at home, that some of the alumni of the institute were patent attorneys, and that it was easy to work as a woman, even after marriage and childbirth. I think it's a good opportunity to learn about your options, like a part-time job at a university twitter.com/nishio/status/...

>[megkurotsubaki https://twitter.com/megkurotsubaki/status/1390513533167673345]: I was aware since college that I was better suited for niche jobs anyway, so I kept my antennae up in various directions. I was just trying to keep my antennae in all kinds of directions...

>[n_gsx1300r https://twitter.com/n_gsx1300r/status/1390508784993271811]: When I was a junior in college studying the physical properties of metals, I wanted to learn about computers, so I went to the computer section of a bookstore and I was in my third year at university, studying the physical properties of metals and wanted to learn about computers, so I went to the computer section of a bookstore and started studying for the "Elementary System Administrator Exam". twitter.com/nishio/status/...

>[kawaz https://twitter.com/kawaz/status/1390449528705228803]: I'm a book lover and a miscellaneous reader, so I read every genre of comics and novels that came to my attention. In terms of encounters, I would say bookstore shelves. There was no internet at that time.

>[ethnin_y https://twitter.com/ethnin_y/status/1390462427855081473]: this is a very chummy thing. It was at a welcome party for new students when I started college (about 15 years ago). I still keep in touch with the people I met there, and I belonged to the organization that hosted the welcome party and got a job with the mother organization. I met my wife at work, and we are blessed with a daughter!

>[hariguchi https://twitter.com/hariguchi/status/1390469919712505859]: Emigration. classified section on the web in April 1995. I used Mosaic on Sun 4. I forgot how I got to know San Jose Mercury News started the web version of the newspaper. I believe it is the world's first WWW newspaper.

>[arcanum_jp https://twitter.com/arcanum_jp/status/1390476611737186305]: Is it the existence of vocational training schools? When I was working as a sales representative for a machine tool trading company, I was in agony because I didn't want to work in a job where I didn't have to create anything by myself. She told me that she entered a vocational training school and was offered a job. There was also an information and communication department, so I went to the training school on the same day.

>[Kkkknows https://twitter.com/Kkkknows/status/1390479550602043392]: skipped school when I was in high school. I made a habit of going to Junkudo and reading books on bookshelves I didn't visit often. I made a habit of walking in places I didn't know. Thanks to this, I found a lifelong hobby, it doesn't take me long to understand the depths of what I hear from experts in various fields, and I don't feel rushed when I get lost in foreign countries.

>[MistyMika2020 https://twitter.com/MistyMika2020/status/1390486596105883651]: when I was applying for high school, I went to the "International Studies" program that was newly established for returnees at the time. (How did you find out about it?) It was highly recommended by my mother's friends who had their children enrolled in that high school. I heard about it through word of mouth, but the stories I heard were so sparkling to me as a junior high school student, and I longed for a very fulfilling high school life.
	>[MistyMika2020 https://twitter.com/MistyMika2020/status/1390487667054321666]: I did homestays, hosted international students, but most importantly, I met global returnee classmates from different backgrounds at an impressionable time. I met my classmates at a very impressionable time in my life, and it has had a great impact on my life since then. Their stories about their academic families, English, French, Brazilian, Indonesian, Filipino, Hong Kong Venezuelan,
	>[MistyMika2020 https://twitter.com/MistyMika2020/status/1390489532579995653]: In my school years, I visited friends scattered all over the world, backpacked around the world with friends fluent in 5 languages, and worked in interior design. She moved from a job as an interior decorator for foreigners to a major foreign company. She left her career to follow her husband, who went to work at a university abroad, and spent the next 10 years in two different countries.
	>[MistyMika2020 https://twitter.com/MistyMika2020/status/1390490716124553218]: during that time, childcare, childbirth, bilingual education. I struggled to maintain the Japanese language skills of my children who grew up abroad, but I think it would have been even harder had I not known the real voices and struggles of returnees in high school. even after returning to Japan after 10 years, the global perspective that my family gained and the
	>[MistyMika2020 https://twitter.com/MistyMika2020/status/1390491883831402498]: The Japanese family friends I have met in this overwhelming away-from-home place are an asset for life. I dream of visiting the children I have met who are active all over the world when I leave Japan. It is interesting to know that some second-generation Japanese-American children from supplementary schools in the U.S. have come to Japan to study.

>[gatto_man https://twitter.com/gatto_man/status/1390489674175578112]: that I chose to study in the US for the elimination reason that I didn't want to study for an exam. It wasn't that I could speak English or wanted to learn anything. I learned that I could get by if I jumped in. I ended up not graduating and am returning to school after 17 years. I remember looking on the internet to find out why I found out about it *in 2000.

>[pure_chantaman https://twitter.com/pure_chantaman/status/1390495986401742849]: we were able to find options because we were open about our interests. In the end, I think there is only so much information one person can know, so I try to let those around me know.

[How did you know your options in life? 100-150]
[How did you know your options in life? 150-200]
[How did you learn about your life choices? 200-250]