Recruitment and Fans
The original story of [culture fans and culture fit are not the same].

[https://gyazo.com/d40b4f32762298714f0aba20170a6695]
[Recruitment Marketing Serial #3: Lead Nurturing in Recruiting | Introduction to Recruitment Marketing https://www.wantedly.com/companies/wantedly/post_articles/160843]

>[tnsm0223 https://twitter.com/tnsm0223/status/1110471481291489280]: i'll read it on my way home. Recruitment Marketing Serial #3: Lead Nurturing in Recruiting | Introduction to Recruitment Marketing by wantedly.com/companies/want... #wantedly

>[tnsm0223 https://twitter.com/tnsm0223/status/1110508552165036032]: I've been doing a lot of graduate interviews recently, and I'm getting the impression that the "[fan]" group, as this article calls it, is growing. While this is gratifying, there are certain cases where it doesn't go both ways given the matching at this point in time. pic.twitter.com/QMGKQ2NF3K

>[tnsm0223 https://twitter.com/tnsm0223/status/1110510020079157248]: Rather than being primarily concerned with "I want to work freely in a diverse environment," why do we need groupware to create a society full of teamwork? Why do we need groupware to create a society full of teamwork? It is easier to imagine a future in which we can work together to achieve our ideals if you tell us how you are trying to work from the perspective of "Why is groupware necessary to create a society where teamwork abounds?

>[tnsm0223 https://twitter.com/tnsm0223/status/1110512683894206466]: the determination to "create a society full of teamwork" instead of hanging on to "I want to work in a company full of teamwork". I wonder if this is the difference. I think "free work style" and "a workplace where diverse personalities can make the most of their abilities" are the current state of society (= customers) that we should change. The people in the company are not at all attached to these aspects.

>[tnsm0223 https://twitter.com/tnsm0223/status/1110515931812265986]: According to "Fanbase", core fans seem to be comrades who help companies in times of distress. However, as long as fans are "service recipients", I don't think the relationship between company ⇔ customer will change. How do we exchange value with fans (= customers)? If we don't take the viewpoint of "how to exchange value with fans (= customers)," it will be difficult to imagine working together with them.

>[tnsm0223 https://twitter.com/tnsm0223/status/1110517040941391872]: If I am a fan of a company, what can I do for my potential and actual customers to make them happy while also What can I do for my potential and actual customers to make them happy and increase my company's profit? This is the kind of perspective that is needed. Take a critical look at the company. Propose what issues need to be addressed. I think that is what Mr. Tabata is talking about when he says, "Be rightly dismissive.

>[tnsm0223 https://twitter.com/tnsm0223/status/1110517852430229504]: For example, I'm a fan of Tenshizhu Brewery, but I'm not going to think about the problems with their business model and try to solve them by getting involved in management or making sake. I am a fan of Tensho Shuzo, but I don't want to be involved in the management or the brewing of sake in order to solve the problems of the business model. At that point, I am probably just a "fan" and a "good customer. I wonder if the determination to seriously try to fulfill the company's ideals is what creates "mutual love".

>[tnsm0223 https://twitter.com/tnsm0223/status/1110545960826859522]: To add a bit more, I guess the "corporate ideal" is "what we should do (what society wants us to do)". If my "what I can do" and "what I want to do" overlap here, I think I can enjoy working here. It is said that "Will, Can, Must," and I think it is really important to reconcile these three.

>[nishio https://twitter.com/nishio/status/1137656667544227840]: 
>Readiness to "create a society full of teamwork" instead of hanging on to the idea of "working in a company full of teamwork. I wonder if this is the difference here.
> "I want to work in a company full of teamwork" gives me a passive feeling that "the company is already full of teamwork and I am a beneficiary. Cybozu's "a company full of teamwork" is the exact opposite, as it is an active attitude of "overflowing teamwork in our company and client companies to create a society full of teamwork" twitter.com/tnsm0223/statu...