Wipe out spammers
>[nishio https://twitter.com/nishio/status/1390878846430236673]: idea to wipe out spammers, interesting twitter.com/tweeting_drtak...
	2016-01-20
 	>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/689816175157510144]: one policy in our industry, if you try to do it right, the cost is out of the blue. If we don't do it right, we can't hope to be effective.... I was unexpectedly there with all the people involved, so I said without preparing a memo, "If we leave the design to the market, the cost to the government will be minimal and the effect will be greater than the actual cost..."...
 	>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/689817249868312576]: "You're going to let them sell and buy!" No, that's a hurdle, so we allow exchanges. That's all, in this day and age, transactions can happen on their own online, and if the need is great enough, someone will create a system of exchange." I was surprised at the quirkiness, but the fact that the method was quite efficient came through just by verbal explanation.
 	>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/689820185771974656]: we agree that it is "too radical and difficult to achieve, but an efficient and effective method". The situation is that it needs to be realized but the cost is too high to move forward, so after negotiations, we decided that we can proceed with the study. As long as we keep it in the report, some municipalities may find it useful when things really get out of control.
 	>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/689822427686154240]: Being involved in this aspect of policy may be one of the best parts of being a government researcher, or perhaps the raison d'etre. In our industry, there are economists in health economics, but in many cases, economists are not involved in other policies, so there is a possibility that interesting issues in mechanism design remain untouched.
 	>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/689824629922267136]: i'm not an economist, but [mechanism design], all sorts of interesting stuff. Things like "second-price auctions" are eye-opening. The "King Solomon's Dilemma," where goods are transferred to the highest valued person without exchanging money, was also astonishing. en.wikipedia.org/wiki/%E3%83%A1...
 	>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/689825734706143234]: a similar story that I've been thinking about for a long time is the spam mail problem. This is caused by the fact that the cost of sending mail is virtually zero, so charging for mail should solve this problem. The problem is that the current e-mail technology is not suitable for billing, but this can be solved by making it so that the reader "only reads e-mail with money attached".
 	>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/689826799094620162]: If it's between people you know, there's no point in taking money from them, so you can just attach the same amount when replying. As a result, people who trust each other can still email each other for free, while spammers will have to pay for each message or they won't even read it, so there will be no point in sending spam...supposedly.
 	>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/690164454827261953]: even in preventing targeted emails to government offices, "If the email you receive doesn't have a separately purchased 100 yen worth of currency attached to it. If it is a legitimate email, you should be able to refund the 100 yen... as "I won't read it". However, there must be some reason why such a method does not work. I can't find it in my research, though.

>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/1390879763565223937]: yes. As an idea, it is interesting. And then it evolved and became blockchain...and so on. It's a case of everyone coming up with the same idea. twitter.com/tweeting_drtak...
	>[nishio https://twitter.com/nishio/status/1390883231403175937]: hmmm, using a blockchain is like using a chainsaw to break a disposable chopstick... the person receiving the email is Amazon-like Why not sell "email sending rights" in the form of an online store, and people who want to send out emails can buy a one-time inquiry window mail address that is valid for 10 minutes with a credit card, and process refunds when they reply?

>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/1390884240632389632]: ah, yes. Blockchain for this purpose is OVERKILL, and for now, I think hashcash is simple. This is also a waste of electricity, but I guess it's a balance against the cost of realizing electronic stamps virtually. twitter.com/tweeting_drtak...
	2017-02-15
 	>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/831860689991933954]: While we're on the subject of currency, I'd like to ask for your wisdom. The world is plagued by spam mails, but this is probably because the cost of sending mails is minimized. If that is the case, wouldn't it be a solution if we declare that we don't read e-mails from first-time visitors without a "postage stamp" on it?
 	>[xharaken https://twitter.com/xharaken/status/831862673784475651]: To solve that problem, the sender of the mail can do a calculation with some complexity (for example, ask for one nonce that hash(hash value of the body of the mail, the nonce)<2^10) and put it in the header.
 	>[xharaken https://twitter.com/xharaken/status/831862740410982401]: (or rather, this is the genesis of the proof-of-work adopted for the blockchain ^^)
 	>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/832018053495808000]: hashcash, I was surprised. I did not know that. It's a simple, self-contained, elegant solution. wikipedia describes the problems, but there could be a number of solutions, such as loosening the restrictions depending on the opponent, or making them stronger for spammers. It would be quite useful in government offices. I hope it will be used.
 	>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/832018689306161152]: I guess the only problem is that this calculation is a waste of power and brings no benefit to society. But I guess it is a real solution considering the cost of stamp payment methods. bitcon and hashcash are interchangeable? Maybe it would be better if we could. en.wikipedia.org/wiki/Hashcash
		>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/832210155374669825]: I asked Haraken about a monetary topic he had started, and he was kind enough to share his knowledge with me. I thought he must have some wisdom, so I asked him about something I've wondered about for a long time. I asked him a question that I had been wondering for a long time: "To prevent spam mails, why don't we just charge for the mails we receive? I'm sure he would have some wisdom to share. twitter.com/tweeting_drtak...
		>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/832211045137592320]: this can be implemented in many ways. What I had in mind was spam and phishing addressed to government offices, and in order to avoid that, I said that emails addressed to government offices should be thrown away without reading them unless they have a "stamp" on them. If it is a legitimate mail, the person who reads it can refund the money. There is a cost to implementing electronic stamps, but the cost of the stamps should be recoverable.
		>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/832212012704804864]: So, when I mentioned this to people around me in the past, their response was "That's not a good idea, haha! I couldn't understand why it was a bad idea, even though it sounded like a good one.... I asked Mr. Haraken about it, and he told me that the idea was the PoW itself, which developed into the blockchain! He said.
		>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/832212984214597632]: I was so surprised that I googled it and was taken aback by the exact idea of hashcash. I was surprised to see the exact idea of hashcash, which is to add a nonce to the body of an email, and then attach the nonce to the email. twitter.com/tweeting_drtak...
		>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/832214038385881088]: government email, now they are adding random suffixes to email addresses to prevent spam, but such You didn't have to bring in a terrible design in terms of human interface, but it was a hashcash that didn't work. twitter.com/tweeting_drtak...
		>[tweeting_drtaka https://twitter.com/tweeting_drtaka/status/832215558430957568]: It's amazing how a good person can develop the same anti-spam measures and even create bitcoin... I was surprised to see that even the same anti-spam measures can be developed and even bitcoin is born if a good person thinks of it. I stopped at stamps and could not even get to hashcash.... (I might have been a few steps ahead of the person who laughed at me...)

>[nishio https://twitter.com/nishio/status/1390885227635953664]: it would be nice to have a process like SETI@home to help advance science.