How do you know what your options in life are?" Attempt to organize the
[How do you know what your options in life are?]
[https://gyazo.com/8cbca2f70943ab6a61dc07bc14e20313]

First, I tagged it like this and tried to KJ method it
[https://gyazo.com/93c516f9e090d588b6461e2c5cfcb7a0]

I almost sorted it out, but then I realized it was in the wrong form to begin with.
(baseball) good hit
[https://gyazo.com/b188134cf02511bb54751479d87e83bb]
The "subjective well-being" in the diagram was after "life choices" in both cases, but I failed to copy and paste it.

If I labeled them and then organized them, they would be full of similar labels, so I had to start over.
I made the sticky more like a sticky that made use of the original post.

[https://gyazo.com/fff9a3d1d7aaf0c538d511a6eb114f41]
Hmmm, I think we're going about this the wrong way too.

We're doing exactly what's on the right side of [Do Not Classify].
Need to organize groups with an emphasis on connecting stories.

It was pretty hard and finally got decent at Take 3.
Why was it difficult, because the original data formed the story at that point.
Sticky notes have strong bonds from the start.
In cases like this, if you "categorize" and separate the bonds, the meaning is lost.
The correct answer is to move the "combined group".
It's like using the KJ method, where you've already organized a one-step group and you're starting at the second step.

Story-driven grouping
[https://gyazo.com/57cbcbb496f920bc9d16dcbb15078377]
Did you have to separate them into stickies if you wanted to keep the original group of posts?
There were →. The original text is tightly coupled but the timeline is messed up, organizing it from left to right.


Proposal to split branches
[https://gyazo.com/154b46d29f0566dee0f71b310c575f94]
concrete example
before
[https://gyazo.com/333b3bb41223ade8a47e99473de7a241]
after
[https://gyazo.com/e303daf5eb67863d28008468be3b7532]
after2
[https://gyazo.com/829d2207652177a15ccc65f973ee0498]
duplicate




[https://gyazo.com/8f0c249215305aedf348cc276364ed6d]


[https://gyazo.com/65fae7298169c59ea6faacd7e0ceeb15]

[https://gyazo.com/fdae89ae52ec727b6ac537a122164b5a]


I just finished putting in my first 100 entries.
If the group maintains the original storyline, not much recombination happens.
I wonder how many stickies there are on this.
[https://gyazo.com/d4362bc1cdcb412fed0b423f0556421a]

