How did you know your options in life, 150-200?
from [How do you know what your options in life are?]
How did you know your options in life, 150-200?
>[tujimura_haruna https://twitter.com/tujimura_haruna/status/1390718002052538369]: How I found out about it When I was chasing Ryuji Akiyama, I became friends with a security guard at Jimbocho Kagetsu and he told me about the Utagumi at Yoshimoto NSC. I found out that there was an Utagumi at Yoshimoto NSC, and he told me about it. I have more friends.
	>[tujimura_haruna https://twitter.com/tujimura_haruna/status/1390718695203250180]: By the way, there was no singing class in the singing class, but there was a class for graduates called "singing graduation", but the singing class was canceled from the next year. The first time I went to the school, I was in a situation where I had to pay the entrance fee and the camp fee in order to make more friends, but in that sense, I think I got my money's worth.

>[tokeikun https://twitter.com/tokeikun/status/1390713429602619392]: I participated in a residential language program at Stanford University during the summer of my freshman year. The program was offered by a different organization than the one offered by the university, but I participated in it after learning from the guidance in my English class that I could earn 3 credits for the program even though it was during my summer break.

>[otahi https://twitter.com/otahi/status/1390771083683405824]: i am "a graduate student at another university". The way I found out about the option is that "a colleague of mine who works at a pizza delivery place happened to be a student at the university where the graduate school was located. I was not told of that option by that coworker and must have looked it up online.

>[amy_cherriee https://twitter.com/amy_cherriee/status/1390751968021258240]: "I turned down a job offer from a large company. I was able to make up my mind after my pilgrimage to Spain. I spent two weeks walking in a foreign land, talking to people from different backgrounds about life and facing myself. I learned about the trip in a bookstore I wandered into →.
	>[amy_cherriee https://twitter.com/amy_cherriee/status/1390754281351880709]: It was exactly when I was contemplating my future. I found myself in the travel section and on a hunch I picked up a book about the pilgrimage to Spain. As soon as I read it, I was immediately moved. I decided to take a leap of faith and booked a ticket to Spain on the spot for two weeks later. I am glad I followed my intuition. →Michael
	>[amy_cherriee https://twitter.com/amy_cherriee/status/1390754898958946310]: meeting wonderful people and perspectives on life in a foreign country gave me advice and tips that helped me think and decide for myself. I became a social outsider by turning down a job offer and becoming a freelancer for a time, but I never felt that I made the wrong choice. And my life has become better because of this choice.

>[Shanghai00001 https://twitter.com/Shanghai00001/status/1390708350007001094]: I ran for expat in Shanghai in the 90's, and from there I spent 20 years of my dense life in Shanghai. I always had my antennae up for opportunities within the company because I wanted to work overseas.

>[87kan87 https://twitter.com/87kan87/status/1390693225149698049]: while I was a student, I worked part-time in the international relations department of the university I attended. I think my most recent job change was made possible thanks to that being valued as work experience.
	>[87kan87 https://twitter.com/87kan87/status/1390695348000206848]: I didn't have a degree in the field required by the application requirements, but I was able to pass the screening process with a combination of credits from my minor and my part-time job. I think).

>[DandeKatze https://twitter.com/DandeKatze/status/1390689605461045252]: one time when I quit a club, I was told by someone I knew that "you won't lose much by making that choice," and when I went to graduate school, I was given a "First I think it was written in a booklet I got from the university.... I think it was written in the booklet that I received from the university when I entered graduate school. It is not very helpful, though.

>[ssengoku https://twitter.com/ssengoku/status/1390677209313026053]: I belong to Mikoshi Kai and have carried the mikoshi at a fair amount of festivals, but the reason for this was because my brother, who is a barber, invited me to join.

>[kshinkee_JP https://twitter.com/kshinkee_JP/status/1390660367466958853]: The choice that made my life better: Jeet Kune Do, a martial art How I got to know it: Youtube channel Why my life got better: Because through Jeet Kune Do, I started to understand the logic and reason of things little by little. Through Jeet Kune Do, I am starting to understand the logic and reason behind things and it is becoming a reference point for my value judgments.

>[Mas_row https://twitter.com/Mas_row/status/1390665535990370308]: that I knew that I could go on to graduate school at another university if I took an exam, and I did. This was told to me by a senior member of my club in college. I wasn't particularly close with my senior, but we happened to have lunch together, and I think that was the topic of conversation that he told me about.

>[tako_xx_tsub0 https://twitter.com/tako_xx_tsub0/status/1390658958239571973]: [Option] Enroll in a local private middle school [What made it better] It was a middle school with dorms, so people from different regions and genuine locals. I spent three years in a mixed environment of people from various regions and genuine locals. I think I learned how to behave, what to say, and what to do here. I saw a poster on a bus.

>[WLv0sattyann https://twitter.com/WLv0sattyann/status/1390658570018955264]: Background Graduation was postponed for various reasons I had enough credits, so I had a lot of free time Turning point I was at a university I was attending, and I took a class at a nearby design university for free How I found out about my options I went to the student affairs office to ask if there was any interesting classes because I had some free time and they told me.
	>[WLv0sattyann https://twitter.com/WLv0sattyann/status/1390660332125769729]: How it has improved is that I now know how to enjoy art and design, and I am able to connect with the people who create it. I am now able to connect with people who create. I am also able to create things on my own.

>[uak_math https://twitter.com/uak_math/status/1390658335968399367]: to go to another major, I dropped out of my original college, took another college entrance exam, and started freshman year. I knew it was an option, but I was talking to my parents and thought, "Oh, that option is possible.
	>[uak_math https://twitter.com/uak_math/status/1390665351189331972]: originally architecture, but now I want to get a teaching license in math. The options were: (1) Transfer to another school: not possible in the system because I was late in consulting with the university. (2) Graduate and enroll in a bachelor's program: not realistic because I was not mentally attending the program. (3) Drop out and enroll: Financially difficult. (4) Earn credits at a correspondence university: financially reasonable
	>[uak_math https://twitter.com/uak_math/status/1390665975599489025]: I talked to my parents about trying to do my best in path (4) and they said, "What about (3)? Why did you remove it as an option without consulting me?" I was asked, and that's when the option I thought I didn't have surfaced.

>[328mami_0110 https://twitter.com/328mami_0110/status/1390637558229438466]: ★Selected a science course when entering high school ⇒Got good at math and bad at social studies, so I didn't want to go to a liberal arts school ↑Passed the junior high school entrance exam and was accepted to an integrated junior and senior high school with a science course in the high school. ↑ Awakened to the joy of math at a private math cram school I think it all started when my parents let me take the junior high school entrance exam.

>[4th_legacy https://twitter.com/4th_legacy/status/1390681314316021760]: I strongly agree with what was said in the thread, "The choices are not disclosed in an easy-to-understand way. It seems to me that they are disclosed in such a way that you either have your own action switch (motivation, passion) or you are attracted by sensation (not thought) for no reason. I'm not sure if you can notice it without being aware of your own senses and switches.

>[dalcurrypaste https://twitter.com/dalcurrypaste/status/1390575372987559936]: I read a biography of Edison when I was a kid. According to the book, Edison asked "Why?" about everything to the extent that he was called "Why Why Boy." I have been copying him ever since. Since then, I have tried to imitate him and ask "Why? I have since tried to imitate him and ask "why? I think the quality of my life has changed for the better than if I had never thought about it.

>[_hayaton https://twitter.com/_hayaton/status/1390574608529563648]: all choices. Reason: because they're alive.

>[_matsuki https://twitter.com/_matsuki/status/1390571071875604481]: career options after leaving the second company. I had already decided early on when I was going to leave the company by raising my hand in the voluntary retirement program, so I publicly announced it, so I've been talking to others. I chose 1. to start my own business (at the invitation of a colleague from my first company) and 2. to work as a freelance PM on overseas projects (through a friend). Then shifted to the world of HR, human resources, and education and training.

>[LifeSoothing https://twitter.com/LifeSoothing/status/1390602120013877252]: When I was in the dark after failing in my job search, I stopped by a bookstore to browse and saw a book called "Interpreter-Translator Journal" and thought to myself, "I remember that I earned translation credits in college, and I wonder if I'll ever get a job as a translator. I was lost in my job search when I stopped by a bookstore to browse and saw a copy of the "Journal of Interpretation and Translation" and thought to myself, "I remember that I took a translation course in college.

>[mirarala https://twitter.com/mirarala/status/1390604024400039940]: When I was a regular high school student, I learned about the AO entrance exam and it changed my life. I had been thinking that I would choose a career path that matched my level based on the results of mock exams and university deviation score charts, but when I couldn't give up on the school of my choice and looked at information on entrance exams, I realized for the first time that there were entrance exams other than academic achievement tests, and I was able to challenge the school of my choice.

>[KENOSIN1 https://twitter.com/KENOSIN1/status/1390608299637235713]: When I was in junior high school, I looked at a map of the world and learned about it. As a young person, the world and its history were vast and unknown to me, while my knowledge and experience were very limited. Therefore, I was conscious of knowing as many options as possible and choosing among all the options I could explore. Now that I am older, I am always aware of the number of options available to me and try to make the best choice locally and quickly.

>[cat_maroon https://twitter.com/cat_maroon/status/1390609395847942147]: When I was in high school, I was sent to the University of Sydney as a representative of my country on a cultural exchange with a scientific theme. This experience is the reason why I still cannot give up on science, even though I am surrounded by geniuses.

>[yukke1293 https://twitter.com/yukke1293/status/1390612152717697028]: I don't know if it's a good idea to bring up school experiences in something for middle and high school students, but I did programming (HTML) in a high school class, which led to my current career choice. It led me to my current career choice.

>[kumayu333 https://twitter.com/kumayu333/status/1390650575423885313]: I did an internship abroad! I was looking for something to do when I saw it on someone's post on Facebook and applied. The first time I met this friend was in a college dormitory. The reason I joined a college dorm was because I wanted to meet someone interesting!

>[yuya_presto https://twitter.com/yuya_presto/status/1390654399542796289]: The big thing was that while my seniors went on to major manufacturers, SI, consulting, etc., I went on to a web venture, and the impetus for that came from seeing a classmate I was involved with in extracurricular activities building a web service using Rails. The next reason was because I saw my classmates who were involved in extracurricular activities creating their own web services using Rails. The second reason was that my parents bought me a reference book for Basic Information Technology Engineer (I passed the exam in the second year of high school).

>[rllllllho https://twitter.com/rllllho/status/1390774411939049473]: There are many choices I've been invited to or participated in on a whim that turned out to be a turning point in my life, rather than a choice I made on my own. Maybe it's important to try various actions on a whim twitter.com/nishio/status/...
	>[nishio https://twitter.com/nishio/status/1390776915523358722]: I like the term "[choice to make]", it fits what I wanted to say twitter.com/rllllho/ status...

>I met a girl who was transferring to a high school right after high school and found out about the overseas education. I studied abroad for a short period of time and found it to be a good fit for me. My homeroom teacher graduated from a graduate school and my friends were planning to go to various countries, so I was able to talk to them about it and there were information sessions at school about going to universities abroad, so I was able to make my choice. twitter.com/nishio/status/...
	>[xx_kayslife_xx https://twitter.com/xx_kayslife_xx/status/1390733475230138375]: When I think about it, maybe the fact that I chose a foreign language course had something to do with it. I chose it because I liked Germany and I was interested in studying abroad.

>[chisakarato https://twitter.com/chisakarato/status/1390720334983274496]: quit my job and moved to Rwanda to start a Thai restaurant. The reason I learned about that option was because my friend who lives in Rwanda told me to come to u and that he thinks a Thai restaurant would be a good idea. twitter.com/nishio/status/...
	>[chisakarato https://twitter.com/chisakarato/status/1390721679568031745]: But actually, the choice I think has changed my life more than this is divorce. The reason I knew I had a choice, the very first step, was when I went to a weaning class run by the city and saw a poster that said, "Isn't that a 00?" I saw a poster that said, "Isn't that a zero? I made a phone call to make sure it wasn't, and then choice became a reality.

>[gsy_design https://twitter.com/gsy_design/status/1390716898627649537]: I have been a ronin, dropout, transfer, study abroad, leave of absence, all of them were good experiences with deep learning. I value discomfort and enthusiasm, and gather information until I am satisfied with the results. (It takes courage to choose a different option from others, but I think it is important to be able to say with pride that it is the path you have chosen, not that you have no choice. twitter.com/nishio/status/...

>[carasuma https://twitter.com/carasuma/status/1390716536105553920]: interesting to see the variety of rips. Looks like it's for a performance for middle and high school students, but I'd like to hear that performance too! twitter.com/nishio/status/...
	>[carasuma https://twitter.com/carasuma/status/1390718905824407552]: I thought about my case, but it didn't look like much: "I did a lot of part-time customer service work when I was a student" ↑ "I found out about it from a job magazine". But if it weren't for this, I wouldn't have been able to find it interesting to talk to various new people.

>[7atts https://twitter.com/7atts/status/1390706657727074304]: I studied English properly when I was a student, among many other things. If I hadn't learned to speak English, I might never have met wine, and I would never be in my current position at my current job twitter.com/nishio/status/...
	>I wanted to be able to talk with children who could not communicate in Japanese. When I was young, I hated to lose, and I had the talent to work hard to reverse that defeat. I think about the present...

>[irohacolor1 https://twitter.com/irohacolor1/status/1390700985123622916]: this thread is interesting. One of the best things about my life choices was learning about color. The first time I learned about choices was from a flyer for a vocational school at Halloween. No, I was interested in personal color before that in the first place. I guess that's how I found out about it on the internet and bought a book... twitter.com/nishio/status/...

>[tbpgr https://twitter.com/tbpgr/status/1390692166830153728]: the choice to "start output on a blog" led to various later opportunities. I learned about that option in the book "Passionate Programmer". twitter.com/nishio/status/...
	>[tbpgr https://twitter.com/tbpgr/status/1390693454988992513]: ・Twitter scouting after seeing my blog postings led me to my previous job ・Blog postings led me to become a CodeIQ contestant and to give questions for 4.5 years Blogging + CodeIQ made it easier to connect with a variety of people, and influenced whether or not I met the people I met afterwards.

>[otchy https://twitter.com/otchy/status/1390690877882863620]: good question. As I recall, there were a few times in my life when I jumped in with the mentality of "this sounds interesting and awesome, but it sounds too hard, too tough, too impossible? I was just jumping in with the spirit of "I can handle it, I'm not going to do it unless I'm pushed" and it turned out for the better. twitter.com/nishio/status/...
	>[otchy https://twitter.com/otchy/status/1390691166165684233]: So I don't feel that I learned of the choice itself through something, but rather that it appeared by chance. I am proud to say that I had the courage to take the plunge.
	>[otchy https://twitter.com/otchy/status/1390692535509524481]: we learn from past experiences, so the last couple of times at a crossroads in life, we say, "Oh, here it comes! That's the one. That's the one I'm going to jump into. I'm ready!" (I will consult with my family in reality. I know they won't be against it, but...)

>[Xyo https://twitter.com/Xyo/status/1390747925496565760]: interesting thread. In my case, 1) hobbies and tastes (after seeing my father make plastic models), 2) where I went to high school (decided after talking to my cram school teacher), 3) where I got a job (advice from my professor. The rest is self-investigation) It seems to be true for most people, but they are gradually becoming more passive → active. The younger you are, the greater the third-party intervention and coincidence factors are likely to be. twitter.com/nishio/status/...
	>[Xyo https://twitter.com/Xyo/status/1390748455920803841]: I can't really put it into words, but it seems to me that the short-term and long-term perspectives may differ in their thinking. For example, if you can say that something easy to see, such as a short-term investment, has changed your life, you can definitely say that the choice has had a + impact on your life, but what about the long-term view?
	>[Xyo https://twitter.com/Xyo/status/1390749352780451840]: for example, I can say that my high school placement definitely worked out well for me, but it is conceivable that I could have chosen a different pattern of schooling and still have a satisfying life. As mentioned earlier in the thread, no one knows if the choice was a real factor in my satisfaction, since life only happens once and there is no comparison.
	>[Xyo https://twitter.com/Xyo/status/1390750412689399809]: In the long run, if we are in a state where we may not have a perfect score, but we are not dissatisfied with our current situation and are satisfied, we may conclude that the choice we made at that time had a positive impact. I feel that while it is important to lay out the options and make the choice that seems best, it is equally important to be in a state where you feel this way after the choice is made.

>[duchess_nope https://twitter.com/duchess_nope/status/1390729671675990020]: getting a job in NYC. I was in my senior year of college and saw a presentation by a designer who ran a company in NYC at a design event and thought it was a good idea. And they were like, "Oh, ok," and met with me, and hired me. twitter.com/nishio/status/...
	>[duchess_nope https://twitter.com/duchess_nope/status/1390730796751855619]: if I hadn't been brave enough to call then, I wouldn't be here now, and I'd definitely be smoldering in the local countryside.

>[tabuuuuuuchi https://twitter.com/tabuuuuuchi/status/1390702534499520514]: The choice that made my life better was to work as a designer. I was shocked to see Aztecs' CD jacket at a CD store, then a classmate of mine from junior high school told me about the job of an illustrator, then I read a book (Hello Work for 13 year olds) and learned about designers as a profession close to me. twitter.com/nishio/status/...
	>[tabuuuuuuchi https://twitter.com/tabuuuuuchi/status/1390703938693832707]: In the end, I could have chosen it as a job, but only after I left home and saved up the money for technical school myself, as my parents wanted me to work for a general company So, it was quite a detour. If I had not known the options, I would not have had so much trouble with my family. I work long hours and for a thin salary, and I am not sure if I am happy in the eyes of others.
	>[tabuuuuuuchi https://twitter.com/tabuuuuuchi/status/1390705470415904769]: It is clearly a turning point in my life in that sense, but this job, where every experience leads to an output, is very rewarding. I am glad to know and to have chosen this job.

>[mihiguch https://twitter.com/mihiguch/status/1390694829948948481]: I found out that the current position in the US was looking for people when I had a drink with a guy from that team when he was in Japan. If I hadn't had that drink, I don't think I would have applied if I had the sanity to think 'I can't get this position' twitter.com/nishio/status/...

>[BPM43210 https://twitter.com/BPM43210/status/1390688741635760129]: very interesting good thread. Regrettably, I can't think of anything I can write about. I truly believe that in the 43 years since I was born, I have peaked at birth and have just been on a downward spiral, slowly and sometimes rapidly accelerating. Today is rock bottom. Tomorrow will be even worse. twitter.com/nishio/status/...

>[inko_x https://twitter.com/inko_x/status/1390656449890512900]: I was just drawing pictures and posting them on my website, but then I got up the courage to participate in exhibitions and events. Since then, I have met a lot of different people and my horizons have broadened. I also started tweeting, which is a big deal. twitter.com/nishio/status/...

>WcMvUgcHLz0w50m https://twitter.com/WcMvUgcHLz0w50m/status/1390651622301208579]: When I was about 20 years old, I had to go to prison for 4.5 years. I started studying for Gyoseishoshi Lawyer because it seemed easy and there were no essays or interviews, and I passed the exam.

>[RCJHIKARU https://twitter.com/RCJHIKARU/status/1390637958076588032]: I spent my days in agony wanting to change my life and become a great person, and when I happened to find LEC, a prep school for qualifications, I jumped in and asked about it. I was told that there was such a thing as a "Gyoseishoshi shoshi" (administrative scrivener). I was not sure about it at all, but I thought it was my last chance, so I gave it a try and got the best and biggest chance I could. twitter.com/nishio/status/...

>[hiroyuki_JGC https://twitter.com/hiroyuki_JGC/status/1390614447270481921]: I chose a job with a reputation for hard work and power harassment when I graduated. Thanks to that, I developed the physical and mental strength to endure a workaholic lifestyle. When I thought about my future in terms of finding a job, I wondered if I would have a hard time later on if I took it easy from the beginning. That was the kicker. Thanks to your help, I am able to eat as well as anyone else even after leaving finance. twitter.com/nishio/status/...

>[X09630589 https://twitter.com/X09630589/status/1390613864090279936]: I found out about administrative scriveners when a sister I played with on a matching app said she was studying for one. Thanks to her, I'm here now. twitter.com/nishio/status/...

>[usjapan7 https://twitter.com/usjapan7/status/1390751779218870274]: タラレバ研究 twitter.com/nishio/status/…

>[kartofeli https://twitter.com/kartofeli/status/1390751973033406464]: 大人の人生の選択肢も広がるツリー なんだか希望が湧く twitter.com/nishio/status/…

>[ayako666 https://twitter.com/ayako666/status/1390782444920528900]: Escape abroad. I've been thinking since I was a high school student that I wanted to get far away from my toxic parents and that I felt uncomfortable living in Japan for a long time and that I would go somewhere foreign when I came of age. twitter.com/nishio/status/...

>[ideee5 https://twitter.com/ideee5/status/1390935562400387074]: I went to university to study physics (failed medical school) I went to graduate school to study informatics (learned about a statistical mechanics x information lab through a lab tour) I quit a think tank after 4 months of grad school (was easily inspired by a trip to Silicon Valley sponsored by Recruit Co. (I was inspired by a trip to Silicon Valley organized by Recruit Co. when I was a graduate student).

>[shota_coffee https://twitter.com/shota_coffee/status/1390933146103812096]: choice: worked as a freelancer abroad as a student. How I found out: I was invited by a classmate I met when I was job hunting. I remember how hard I studied, saying I could do it even though I couldn't even make a good website.

>[tomoya_nonymous https://twitter.com/tomoya_nonymous/status/1390927974694674434]: This is a part-time job I had in 2014 helping with Kazuhisa Uchihashi's Daxophone exhibit, which started out as a college I got the job offer from my senior at university, so it was half by chance. I decided to intern at YCAM because of that, and if I hadn't gone to YCAM, I wouldn't have gone to Geiko for graduate school, and I wouldn't have gone to SFPC either twitter.com/nishio/status/...
	>[tomoya_nonymous https://twitter.com/tomoya_nonymous/status/1390928832220176386]: Well, on the other hand, I applied to TeamLab when I was looking for a new job after I quit my part-time job. I also did a lot of research on the internet when I was looking for a new job, so I don't think it was all a coincidence.
	>[tomoya_nonymous https://twitter.com/tomoya_nonymous/status/1390929899490213892]: on the contrary, it was a complete waste of time in my life! I think it's more difficult to find something that was a complete waste of time in my life. Well, I feel like I had a better option than working as a bridal sound guy at my previous job at the lab, except that it would have been a good story to tell.
