How did you know your options in life, 100-150?
from [How do you know what your options in life are?]
How did you know your options in life, 100-150?
>[amingb https://twitter.com/amingb/status/1390496123060588552]: Choice・・To learn 3D software Blender Choice Result・I was able to respond to digitization ahead of others in figure work Reason for knowing・I had been interested in 3D itself for a long time. I had been interested in 3D for a long time, but I was able to continue because the performance of the software was good and the information in the instructional books and on the web were substantial. The reason why I couldn't continue with other software was because I didn't have enough of them.

>[NS944A https://twitter.com/NS944A/status/1390501212915601409]: There are many things to do, but overall, try to get out of your normal range of activities. It's not a good idea to just leap out recklessly, but if you have a stable foothold, try to be a little adventurous.

>[Usao_INB https://twitter.com/Usao_INB/status/1390506969207771137]: that you joined the SDF. Liked Gundam -> read Space Warriors -> became interested in the SDF, learned about the Airborne Corps. They allowed me to qualify for large size, large special, lift, etc. Also, I'm awfully healthy compared to my age.

>[takusamar https://twitter.com/takusamar/status/1390508890907844611]: Being a programmer as a new liberal arts graduate. I saw a DM (paper at the time) that arrived in the winter of my third year of university and applied for the job out of curiosity, thinking, "This company is a joke in a good way...". The written test was only logical thinking and an essay, and did not ask for any programming experience. The interview was casual and the atmosphere seemed to suit me, so I turned down all the other companies and decided to apply there.
	>[takusamar https://twitter.com/takusamar/status/1390510925069750276]: After I joined the company, they taught me the basics of computers without any experience and I was able to pass the old Type 1 (now Applied Information) in my second year. I'm glad I trusted my instincts and chose the company instead of the size or name recognition at that time. I changed jobs after four and a half years, but I am grateful to have had such a wonderful experience with this company. nippon-control-system.co.jp/saiyo/index.ht...

>[send_ https://twitter.com/send_/status/1390518751947153413]: I was working as a data manager at a CRO and writing code to improve operational efficiency when a senior colleague at work advised me to become a software engineer. About 15 years later, I made about 5 times the annual salary I was making at the time.

>[amarill50195716 https://twitter.com/amarill50195716/status/1390519153245655053]: Hi, I am a college student. I was able to quit 體育会 and start a new challenge while I was still a college student because of the crisis I felt due to the fact that I saw my future. And now I am leading an exciting life. It all started when a friend of mine talked to me about quitting. ......
	>[amarill50195716 https://twitter.com/amarill50195716/status/1390519747784056833]: Then I started talking to working people and students who had never been involved in college before about life. In this way, I was able to look at my life objectively from multiple perspectives and apply the concept of leaving the club, which was not a part of our athletic department, to me.
	>[amarill50195716 https://twitter.com/amarill50195716/status/1390521493625335814]: my friend is a member of the same athletic team. He also quit and went to study abroad; both of us are now good friends who enjoy talking about the future. I've been able to find a job where I'm happy with the place I'm working! lol I think I have a certain amount of survival bias lol.

>[charuman https://twitter.com/charuman/status/1390530916552822784]: When I started job hunting in my third year of college, I was like everyone else around me, focusing on banks and other large companies. Now it's gone because Kokushikyo was established, but I learned that there are options other than big companies when a senior who was auditing a class for international students called "Future" at Waseda at the time told me "I'm going to a company called Future, but it's good". twitter.com/nishio/status/...
	>[charuman https://twitter.com/charuman/status/1390530918121570308]: Well, I was kind of drilled into a lot of things there, and here I am. I was only there for one year, but I want to say good job to myself for making the decision to go to a company with 200 employees. By the way, I had a job offer from a certain metropolitan bank, but when I went to the head office to tell them that I declined the offer, I thought that adults are really scary.

>[mayulatte2000 https://twitter.com/mayulatte2000/status/1390523566513291271]: choosing Viola in the orchestra section . -*¨*-. I was crying because I was bullied in the club and an upperclassman who happened to know me in the library asked me if I wanted to play the same instrument as me. I was crying because I was bullied in the orchestra club, and an upperclassman who happened to know me in the library asked me to play the same instrument as me.
	>[mayulatte2000 https://twitter.com/mayulatte2000/status/1390525749531054086]: I was 12 years old and didn't even know the viola existed, let alone the violin. From there, I went to high school with an orchestra, I would have bought an instrument with my first bonus when I entered the workforce... and then my son would have been able to play for me... and his life would have been different if I hadn't met the older generation at that time.

>[rkarsnk https://twitter.com/rkarsnk/status/1390524885668012032]: I was depressed because the Windows95 for EPSON PC I had at home at the time was expired and I couldn't update it from 3.1. I was depressed because I couldn't update from 3.1. I tried Plamo Linux, which runs on PC-98 compatible machines. I was depressed because I couldn't buy Windows95 for PC and couldn't update it from 3.1.

>[blu3mo https://twitter.com/blu3mo/status/1390526208052326404]: I think the most important thing is that I started participating in FLL (like a robot contest) with my classmates when I was in 4th grade. The source of information is usually limited to parents or teachers twitter.com/nishio/status/...

>[s1shimz https://twitter.com/s1shimz/status/1390526216449314816]: In my case, I graduated from high school and became a national public servant instead of going to college. The reason is that if I had gone on to higher education, I would have been in the midst of the employment ice age with scholarship repayments on my back, whereas at that time, a good number of high school graduates were also employed, so I didn't have that much difficulty finding a job. (continued)
	>[s1shimz https://twitter.com/s1shimz/status/1390526681018814465]: The reason I chose that option is because I needed a scholarship to go to college, and when I was thinking about finding a job, my career advisor recommended that I go to college because "every year some people become national civil servants I chose that option because I needed a scholarship to go to university, and when I was thinking about getting a job, my career advisor recommended that I should go for it because "every year several people become national civil servants.

>[TakigawaCritica https://twitter.com/TakigawaCritica/status/1390528699666079744]: ◆"I chose a vocational school. I was taught by my homeroom teacher in high school. To be precise, I was taught the following, which led me to make a good choice. 1) There are "accredited (or unaccredited) schools" in vocational schools. Unaccredited schools do not offer a diploma. (2) You can tell the level of a school by participating in a trial enrollment and seeing the teachers and participating students.
	>[TakigawaCritica https://twitter.com/TakigawaCritica/status/1390530877046759425]: The first time I was taught this knowledge was when I asked my homeroom teacher about going to a vocational school. I was taught in the course of personal career counseling, so I am aware that there was no situation in which all students were taught this knowledge uniformly.

>[daisukesato https://twitter.com/daisukesato/status/1390529090269192194]: I remember "reading the code for a whack-a-mole game written by the teacher in my high school information class. It was a script with a few hundred lines, but I remember feeling the infinite possibilities. Then I went to the computer lab and learned a lot from them.

>[yayoi_west https://twitter.com/yayoi_west/status/1390531165719650304]: I learned about programming from my cousin's husband, I found Competitive Pro while surfing the net, Master of Information Science was taught at the Information I was taught at the Olympics, etc... twitter.com/nishio/status/...

>[5ducks5 https://twitter.com/5ducks5/status/1390533969414959107]: I am impressed by this short and tremendously core question. By the way, I had no other choice, so I just kept on plugging away and doing the best I could with what was in front of me. In other words, just luck. twitter.com/nishio/status/...
	>[Shigelangelo https://twitter.com/Shigelangelo/status/1390542551619231749]: somewhat glad you and duck have something in common. I don't know what the future holds anyway. Life is random." And then I found myself here. That's my life. I'm so occupied with what's in front of me that I just don't have time to think about anything else.
 >[5ducks5 https://twitter.com/5ducks5/status/1390545681442476032]: I really didn't have a crossroads in my life, I didn't have a choice!

>[IwanoriCOMB https://twitter.com/IwanoriCOMB/status/1390540996585291782]: I guess I've had a myriad of what you call choices in my life, but now that I'm past it, it all just seems inevitable. I don't see it as an inevitability. What are the choices in the past?

>[honten https://twitter.com/honten/status/1390544172554211337]: "Being able to come out to Tokyo for college" I guess it was knowing that high school was a progressive school and that it would be more interesting to go to Tokyo than the countryside.

>[sue1242 https://twitter.com/sue1242/status/1390522836649869317]: When I was exhausted from cleaning up the mess of poor quality control by previous managers, unreasonable reprimands from various departments, and coordinating the work of related departments, I heard some boss say, "I heard that the world is achieving results by using big data, so let's promote it in our company. I heard my boss say, "I heard that big data is achieving results in the world, so let's promote it in our company, too.
	>[sue1242 https://twitter.com/sue1242/status/1390522839426424834]: The company I used to work for was IT illiterate and would not be able to fully utilize such technology, and the organization was too big to change its old ways. I could see that, so after some study, I changed my job to become a data scientist without hesitation. Before I changed jobs, I was having a hard time at work, but now I enjoy my job.
	>[sue1242 https://twitter.com/sue1242/status/1390522840890298369]: My boss, who originally proposed the use of big data, was aware of the fact that quality records from manufacturing sites had been accumulated and had become big data, and if he analyzed them, he would be able to make significant improvements. I think it was a good decision for me to change jobs. No amount of data that is not collected for the purpose of analysis is good for anything.
	>[sue1242 https://twitter.com/sue1242/status/1390523295754178562]: thank you only for telling me that "data scientists" exist. If I had continued working at the company I started working at when I was a student without finding what I wanted to do, a job that was often unreasonable, I would have been mentally ill by now.

>[kusikurage https://twitter.com/kusikurage/status/1390519479977738244]: Good choice: I broke up with my ex-boyfriend. How did I know: I woke up when my best friend cried. I realized that it's better to break up with him.) I'm not sure if this is really a proper answer. ...... twitter.com/nishio/status/...
	>[kusikurage https://twitter.com/kusikurage/status/1390520486799429635]: To add, it may be closer to "the brainwashing was lifted" by the shock of "my normally stout-hearted best friend crying". Until then, I had been thinking, "It must be painful, but I don't want to leave and be alone," i.e., I had fallen into the typical narrow-mindedness, and could not recognize other options even though they existed.
	>[kusikurage https://twitter.com/kusikurage/status/1390521343787954176]: Here, the "means by which we became aware of the existence of alternatives" is "the objective gaze of others" or "others who are trying to reach out to us It can be said to be "the objective gaze of the other" or "the other person who is trying to reach out to you. Building relationships with such others may be the best defense against narrow-mindedness. I think this is also the reason why closed relationships tend to be ill.

>[nishio https://twitter.com/nishio/status/1390531349304332288]: chat about the trigger [I think "problem-solving options" and "life options" are a bit different].
	>[nishio https://twitter.com/nishio/status/1390532582345822211]: I looked at 100 cases and saw that "the style of asking people is a chicken-and-egg problem of how to find people who will answer you first. Regarding the "I was able to learn from people when I shared my interests" and "I attended an event based on my interests and hit it off with someone I met there" are rather common.

>[nao_namaz https://twitter.com/nao_namaz/status/1390556288170352643]: not to rip because it's off topic, but after "you can't choose if you don't know" comes "you can't/won't choose if you know". In my case, I knew about the choices that resulted in a better life, and I was blessed with the flexibility and financial resources of my parents, but due to my own stereotypes, prudence, and lack of action twitter.com/nishio/status/...
	>[nao_namaz https://twitter.com/nao_namaz/status/1390556602575491074]: many patterns of unconsciously shying away or getting lost, and ultimately the low probability of fulfillment of other options and the words of friends pushed me back. >[nao_namaz
	>[nao_namaz https://twitter.com/nao_namaz/status/1390558169714335745]: I think that the "I tried it because I knew it" pattern that is often seen in the rip-offs of the original thread is "I have the mentality (energy, I think the "I did it because I knew" pattern that we see in many of the original threads is because people have the mentality (energy, aggressiveness, courage) to do it if they know about it, and they also have high antennae to know about the options.
	>[nao_namaz https://twitter.com/nao_namaz/status/1390560601357918214]: "The type of person who tends to overlook choices is likely not to dive into new choices even if they learn about them. I guess my hypothesis is that "having the mentality to dive in is more necessary for actual effective choice-making than knowing the options".

>[jnishi https://twitter.com/jnishi/status/1390560648782782466]: I think I worked part time at a drug discovery venture when I was in school. I wanted to know more about the R&D venture, and a classmate of mine from my freshman and sophomore years told me that he was working there part-time. I thought it would be interesting if he was doing it, so I said, "Hey, you, join me in six months when you retire from club activities and have more time," and I did. twitter.com/nishio/status/...
	>[jnishi https://twitter.com/jnishi/status/1390560650275954688]: Then he was asked to "bring one other person" and involved a classmate from his department, who then involved another classmate. The last one was so inspired by his experience in a drug discovery venture that he started his own company without even waiting to graduate from graduate school. I joined the company as a founding member.

>[masuidrive https://twitter.com/masuidrive/status/1390553049073012739]: I guess starting an open source project with PukiWiki. I read "Kyan and Bazaar" and became interested in the open source development style. I wonder if my interest in the open source development style after reading "Kyan to Bazaar" would be "learning about the options". Learning how to develop and communicate with people I've never seen face to face in that project has been the foundation of my work since then twitter.com/nishio/status/...

>[Fumiya_Kume https://twitter.com/Fumiya_Kume/status/1390550692734005251]: "Attending IT study groups" and "making the decision to move to Tokyo" made my life better. To abstract it, "when an opportunity came, I went and grabbed it anyway" made my life better. twitter.com/nishio/status/...
	>[Fumiya_Kume https://twitter.com/Fumiya_Kume/status/1390551207731630083]: It is easy to be specific and say something like "I joined Seckhac365", "I released an app for Windows Phone", "I joined a certain company". I think this is about right.

>[okanyanen_curry https://twitter.com/okanyanen_curry/status/1390541583943077888]: I stopped taking antipsychotics for depressive symptoms. The side effects were messing up my life, but I was able to stop and get back on track. I learned about the option of quitting because I met a future self who was suffering from different side effects of the same medication. I decided to stop carrying the pain into the future, even though it would be temporary. twitter.com/nishio/status/...
	>[kanawang_ https://twitter.com/kanawang_/status/1390550200087834629]: "I decided not to carry it into the future" It resonates with me. I thought it was a great decision, courage and continuity. Wo mother, you are wonderful once again.
	>[okanyanen_curry https://twitter.com/okanyanen_curry/status/1390552114066305025]: Thank you KANA! I am glad that it is clear to me now!

>[20BENI20 https://twitter.com/20BENI20/status/1390553424224088071]: Immediately after breaking up with my girlfriend of 8 years, I started dating someone I had known for about 3 months and met twice, who lived in another prefecture. With unprecedented immediacy, I notified my workplace of my transfer, moved to Tokyo at about the same time as my partner's situation, and began living together about four months later. It is delicate to mention a love story in context...but it was definitely a "choice that turned my life around".
	>[20BENI20 https://twitter.com/20BENI20/status/1390553954375798784]: I was able to choose this option because of the philosophy that "residence, age, and relationship do not matter, people are always one-to-one individuals" and "the moment that has passed cannot be returned". I made this choice because of my experience and the influence of my mother. It was a big decision to change my entire workplace and place of relocation, but I was able to connect with a partner that is irreplaceable.

>[Earwax97409510 https://twitter.com/Earwax97409510/status/1390483171066613763]: It may not stick in the target group of middle and high school students, but it is an option...to raise the standard of living. The reason why I bought a condominium is because of a flyer.

>[ryudo_k https://twitter.com/ryudo_k/status/1390472349816819716]: I am currently running a restaurant, and I feel that my experience of being in and out of various bars as a customer has been useful. The first time I started going to a bar was when a senior college club alumnus took me there. I don't think it was out of a strong desire to go there, but I think it was this one place that started it all.
	>[ryudo_k https://twitter.com/ryudo_k/status/1390473534678265858]: college is in the arts, my club is table games, and my senior year is not in the food or beverage industry, so I did not make any conscious choice at any point. I just went out for a drink. I simply went out for a drink, but I now feel that without realizing it, it was the beginning of a route that led me to the life I lead today.

>[yamadatanaka_ https://twitter.com/yamadatanaka_/status/1390478590379053056]: I went to college. I had planned to go to a vocational school for auto mechanics, but my high school teacher strongly recommended me to go to college. I learned that there was an option to go to college as a way to "increase my options.

>[fshin2000 https://twitter.com/fshin2000/status/1390568245233549312]: interesting story so I'll respond. When I was attending Digihari, I was approached by an instructor during a special class, which led to a new job at his company and the current process. I only talked to him for an hour, but he called me. twitter.com/nishio/status/...
	>[fshin2000 https://twitter.com/fshin2000/status/1390569206194663430]: There are many other opportunities, such as the opportunity to join Pepabo or to help BASE. I assume the continuity of daily life, and sometimes there is a discontinuous timing, and that is what we call opportunity. I guess that's what I mean by choice.
	>[fshin2000 https://twitter.com/fshin2000/status/1390569639680233473]: Even KMD is a pretty fateful choice. I've been doing Mobatsui, I'm friends with Mr. Feng, and I met Dr. Sunahara at TechLion in various layers, and the timing was also because I had time after the company was transferred.

>[tomokidaigo https://twitter.com/tomokidaigo/status/1390568459294035969]: I went on a trip to Ayers Rock. As a result, I became able to speak English by studying to improve my English skills, and to improve my interpersonal skills for the trip, I played with friends of friends, did matching apps, and invited people I didn't know well to play with me.
	>[tomokidaigo https://twitter.com/tomokidaigo/status/1390569118521122818]: I first became aware of Ayers Rock when I saw the cover of a CD I liked in junior high school called "Traveler" by Ketsumeshi. I was so excited that I looked up Ayers Rock and saw it and said, "There is a huge rock! I was so excited and looked up Ayers Rock and thought "I want to go there someday". I was so excited and looked it up and found Ayers Rock and thought "I want to go there someday". pic.twitter.com/gaL8k0Kb99
	>[tomokidaigo https://twitter.com/tomokidaigo/status/1390569519362428931]: I looked them up on my PC at the time, so it was the internet. By the way, "Sakura" and other songs by Ketsumeishi were popular when I was in junior high school, and I started to like and listen to them.

>[ykokubo09 https://twitter.com/ykokubo09/status/1390561616542900224]: It was seeing the podcasts and speaking engagements that engineers my age were doing. I was having a hard time at work at the time, but I saw that people who were transmitting their work seemed to be having fun and shining brightly. I studied from there and my output became a book (only one of the co-authors) and my life changed. twitter.com/nishio/status/...

>[minokiti https://twitter.com/minokiti/status/1390616719912161281]: I was a freshman in college during the Ice Age, I think. I wanted to draw on the computer, so I went to a trial course at Digihari and found out about a job that would lead me to my current job (not as a writer, but as a web director or a production person). (I got hooked on it, and without even going to college, I was building websites, experimenting with programming, creating 3D worlds, and so on. Inquisitive mind...? twitter.com/nishio/status/...

>[rue_826 https://twitter.com/rue_826/status/1390616142218031112]: having worked part-time for an ISP, I found out about the previous job I was involved with, and when a junior colleague invited me to go to a company information session, I went and got myself accepted! .... twitter.com/nishio/status/...

>[tomoya0x00 https://twitter.com/tomoya0x00/status/1390614813307392003]: When I was in junior high school, I built my own PC with my New Year's money I had saved up (we didn't have a PC) & started programming in HSP because I got into collecting MIDI and wanted to make a MIDI player. I started programming with HSP because I wanted to make a MIDI player, and I learned how to twitter.com/nishio/status/...
	>[tomoya0x00 https://twitter.com/tomoya0x00/status/1390615372978483203]: did you ask your teacher about making your own PC OR did you see it in a bookstore...or maybe Windows Forest for HSP?

>[aiandrox https://twitter.com/aiandrox/status/1390611147678654471]: programming: I guess it was finding Progate on "learning programming" or something. Then I found something like "You can become an engineer in 3 months with no experience!" In a way, I'm grateful to the influencer because I found something like that and was taken for a ride. 3 months was not enough. twitter.com/nishio/status/...

>[_okohs https://twitter.com/_okohs/status/1390608190530678784]: I guess it was choosing a technical college. How did I know -> A teacher from the technical college came to the school for a school information session (maybe my parents were there too), but I guess it was the open class that I found interesting. It was the day of my birthday, and I thought "I can skip school on my birthday with my perfect attendance award! I found the atmosphere of the class, the loose school culture, and the large amount of equipment interesting twitter.com/nishio/status/...
	>[_okohs https://twitter.com/_okohs/status/1390616742917918725]: Looseness episode: I saw a student reading a weekly magazine on his desk during class. I said, "Oh, someone is reading a manga during class..." The teacher who showed me around "It's Tuesday, so I guess it's an early-selling magazine..."

>[takekujira_ https://twitter.com/takekujira_/status/1390606654849363968]: I decided to do ion trapping. When I mentioned to my senior labmate that the research I was doing at the time was tough and that ion trapping, which I had learned about in a paper, sounded too fun to be hard, he said, "Well, why don't you just do ion trapping! I was told, "Well, why don't you do ion trapping? Until then, I had never thought of switching laboratories as a Ph.

>[ICEBERG42113450 https://twitter.com/ICEBERG42113450/status/1390602539486388226]: my sister told me "I think your brother is a good administrative lawyer" but it didn't hit me at the time and I left it alone for years ... One day, while walking by the park, I suddenly thought "I should take the administrative scrivener exam". twitter.com/nishio/status/...

>[MasatoshiEsqui2 https://twitter.com/MasatoshiEsqui2/status/1390595121402503170]: My life got better after divorcing my ex-wife. I listened to the song many times. I've listened to the song many times, but at the time it certainly pushed me to say, "Now is the time. I guess this is not what you are asking me.

>[serima https://twitter.com/serima/status/1390582986018418689]: I participated in KING, a business contest for students in my 5th year at a technical college. I was smoking out on my graduation research and surfing the net, and happened to find the blog of the management staff on Ameblo, and that's when I learned about Busikon (it's a long time ago, so my memory is a little hazy).

>[kame_a_shi https://twitter.com/kame_a_shi/status/1390580891374604294]: Hello. I was introduced to my current company by my former boss who said, "A colleague of mine from my old company was working at that company. I guess it took me a while to get there, but I spilled the beans to my supervisor that I was changing jobs but was worried about the company that offered me the job.

>I was in middle school when I started Capoeira. I wanted to change my attributes because I was bullied just because my parent was a teacher. I got off the train and signed up immediately because I saw a sign from the train window that said "Capoeira Class" (I was 13 at the time, so I called my parents) twitter.com/nishio/status/...
	>[momomo_moz https://twitter.com/momomo_moz/status/1390573566224068615]: From there, I met breakers and fell in love with breakdancing. I took the entrance exam to Tondabayashi High School, which was the most liberal high school in Osaka at the time, and was taught that "with freedom comes responsibility" during my school life.
	>[momomo_moz https://twitter.com/momomo_moz/status/1390574217981140993]: how did you know that option? Hard to say, I don't think I would have found it if I had been on the other side of the car window at the time, I don't think I would have passed it if I had put it off for a later time, I just had a gut feeling and let it take over.

>[miwarin https://twitter.com/miwarin/status/1390623768364556288]: too many choices, I wonder which one... I went to an information science university because I learned about the game development industry from the liner notes of the FF5 soundtrack →I learned about PC-UNIX and wanted to try it →I couldn't install FreeBSD/98 on my PC98 →I could install Plamo Linux/98, which came with Software Design I was able to install it (continued)
	>[miwarin https://twitter.com/miwarin/status/1390623921393655810]: I tried to use the included Mew →I bought a book by Kazuhiko Yamamoto, the author of Mew (play with lists) →I went to listen to Kazuhiko Yamamoto speak at some OSS event in Akiba I went to listen to Kazuhiko Yamamoto speak at some OSS event in Akiba →Kazuhiko Yamamoto used NetBSD, so I tried to use NetBSD →I joined JNUG →at netbsd.org people were there up to now

>[tako_xx_tsub0 https://twitter.com/tako_xx_tsub0/status/1390658958239571973]: [Option] Enroll in a local private middle school [What made it better] It was a middle school with dorms, so people from different regions and genuine locals. I spent three years in a mixed environment of people from various regions and genuine locals. I think I learned how to behave, what to say, and what to do here. I saw a poster on a bus.

>[Mas_row https://twitter.com/Mas_row/status/1390665535990370308]: that I knew that I could go on to graduate school at another university if I took an exam, and I did. This was told to me by a senior member of my club in college. I wasn't particularly close with my senior, but we happened to have lunch together, and I think that was the topic of conversation that he told me about.

>[wakatono https://twitter.com/wakatono/status/1390681340580745222]: It's been about 35 years ago... w The choice that made my life better: I went to the University of Electro-Communications. How I learned about that choice: The amazing (from my point of view at that time) people I met in high school when I was an amateur radio player were members of the University of Electro-Communications club (JA1ZGP).
 >[wakatono https://twitter.com/wakatono/status/1390682537828052997]: When I entered the University of Electro-Communications, there were a lot of interesting people in my freshman class and on the executive committee of the alumni association (some of whom I am still friends with). I met a lot of interesting people in my first year class and in the executive committee of the alumni association (some of them I still keep in touch with), and then I met a lot of junior students who were also interesting, and from those relationships I started riding motorcycles, developed an interest in communications, Minix, and development using X68000, and progressed in my geek interests.

>[yugui https://twitter.com/yugui/status/1390683673410691074]: went to AWDwR reading group ← read on ruby-list ← learned about Ruby ← was looking for an OO web development language ← learned about web programming Taught by a math teacher ← Talked about the dynamic contents in the official CLAMP website ← Got to know CLAMP ← My friend was an avid fan

>[yujiro_san https://twitter.com/yujiro_san/status/1390683858698342410]: What I learned from working as a waitress at a luxury inn for only one year is connected to my current job and way of life. When I was wondering what I should do for a job, the proprietress of an izakaya (Japanese style bar), which is run by an elderly person, told me that anyone can do what anyone else can do, and that I should just take a chance and try something difficult.

>[Pooh3Mobi https://twitter.com/Pooh3Mobi/status/1390682124148101124]: - I realized that taking the advice of others, including family members, was not good for me. These two things became the basis for my path. After graduating from a university in the information field, I was unable to find a good job, so I went to an Android vocational training school a few years later, and later got a job and moved to Tokyo.
	>[Pooh3Mobi https://twitter.com/Pooh3Mobi/status/1390683986020638728]: It was a great opportunity for me. Next, I came to Tokyo to work for a customer, where I was about to be sent to a non-Android project for a long period of time, but I didn't like it very much, so I asked the customer of the two previous projects if I could get a job, and he said he had one, so I was able to keep my Android background.
	>[Pooh3Mobi https://twitter.com/Pooh3Mobi/status/1390684228921094148]: To sum it up, I think it's about taking chances by not giving up. I think it is important not to give up.
