Happy if I can find a solution.
I used to think that "[enthusiasm] is necessary" and "[enthusiasm] is a scarce resource," but I was unclear what that "enthusiasm" was.
I was able to explain the principle of project disappearance this time without using the vague concept of "enthusiasm.

 See any issue Y
  Sometimes it looks like someone else Z is holding it, sometimes it doesn't.
 I think, "That should be solved with Method X."
 　Coming up with a solution = hypothesis
 Want to test that hypothesis (generation of [want to do])
 Try to make X
 　If Y is not resolved
 　　Satisfied with "we know this method doesn't work" because the goal was to test a hypothesis, not to solve it.
 　　Not necessarily another solution.
 　If Y is resolved
 　　The solution I created solved the problem! Hooray!
 　　If Z is known
 　　　I'm not really interested in whether the resolution of that Y makes Z happy.
 　　If you don't understand Z
 　　　I'm not really interested in whether or not anyone will be happy by the resolution of that y

関連
　I once organized [people who wanted to solve a problem and people who wanted to test a hypothesis].
　[I agree with the viewpoint that "wanting to know is the source of desire" of "I want to know what's in it, not what I want to make," and this is a variation of that.
　The flow of this explanation is clearly influenced by [Thought Node 2021 Unexplored Junior], but the idea was not in and of itself
　　It's like a series of considerations had parts floating around and they connected well.
　　[solving problem Y with means X to make customer Z happy] or something like that.
　Looking back again at what triggered it, I think it was the stimulus from the meeting we had in the morning.
　　It was a story about matching people with technical skills to organizations that had challenges
　　Even if the issue is clear and I am having trouble coming up with a solution, I personally am willing to go as far as "coming up with a solution," but I am not motivated to actually solve the problem, and I wonder why that is.
　　Perhaps it is because they have learned negatively from the experience that projects with this type of beginning often disappear: [learned helplessness].
　　To avoid that, it would be nice to have a clear Z.
　　　One way is "Z is myself": [first make something that meets your needs].
　　　Another way is to confirm the presence of Z early in the project and bring it to a state where you can observe that the solution is making Z happy
　　　So you avoid [customer churn].
　　　　Unlike in business, the customer in this case is not "whether they will pay" but "whether they will be happy."
　　　　The creator gets a sense of accomplishment by making Z happy.
