Nodal Point of Thought 2021-05-14
If [re-split stickies] can be done, the granularity of [auto-split] should be larger.
 Re-split stickies: [✅Click on sticky to import multiple lines
	Maybe we shouldn't force the splitting of the sticky as a later stage of excessive shattering in trying to split an input that can't be split properly with a case particle, so we can re-split the sticky.
	　Trade-off with the cost of manual re-splitting
	The "maximum length limit" is a hard limit, so if you loosen it up and say, "Let's allow longer," you're lengthening what could naturally be shortened.
 	We need a mechanism to weigh the cost of splitting against the cost of not splitting...


[https://gyazo.com/c431f0de87eb348657062c063898948f]

There are many different kinds of intellectual activities, and when you abstract them and put them all together, it's too abstract.
Maybe we should do a drawing for each of the various activities and compare them.
Figure shows an image of reading a book and making reading notes
	A: It is not possible to internalize an entire book due to limitations in human input speed.
	B: I forget more and more of what I read, so I can't retain it in my brain
		This can be observed by having them read books without taking notes and writing down what they remember at random times.
		Even the last page cannot be properly restored.
	Even though the information you just put in disappears that fast, for some reason, some information becomes long-term memory.
		Long-term memory is pulled by external stimuli.
		　[https://gyazo.com/c9435238c7355320d271d36f3edf73cc]
 		This seems somewhat faster than reading
		Long-term memories are more likely to be created the longer a fragment has remained in temporary memory.
			So it's easier to retain if you make reading notes than if you just read a book.
			Effects of reading notes being re-input
			by processing [Craik&Tulving 1975].
　Reuse
	 As for what is in the brain and "remembered", it takes time to output it again.
	 For those that are out there and found through searches and recommendations, it takes time to input them again.
 	search (e.g. for someone using a search engine)
 		Match by word occurrence alone, the longer the sentence, the easier it is to match because there are so many words.
 		The longer the sentence, the higher the cost of input after the match.
		 Easy to input again when converted into compact reading notes.
		 	but the process of cutting them into compacts causes them to be disconnected from their context
			 If you feel this is a loss and you're frightened, it's a long-winded note.
			 In fact, sometimes it's a loss.
			 It would be nice if the link to the original large fragment is retained when a compact fragment is created
			 	Don't worry, you can throw out more and more context, but if you need to, you can follow the links back to the ones that retain the context.
	I'm thinking of Regroup's sticky re-split feature.
 	Maybe we should keep the link to the source when we import.
 		It could be Keicho chat, Scrapbox page, etc.
 	It would be nice if the sticky re-split kept a link to the original sticky.
