Mismatch between competence and job description
>[kis https://twitter.com/kis/status/1393217241630400515]: If I were to do freelance work, I would probably charge 1.5 million yen per month at the lowest, but I can't write code in a month that someone making 500,000 yen per month can write in a month. I can't write the code in a month that a 500,000 yen/month guy can write in a month. Instead, I can write code in a month that a 500,000 yen/month person cannot write in a year.
	>[nishio https://twitter.com/nishio/status/1393224501282762753]: half of this is correct, the other half is that talking about the amount first is not good for reasons such as "the amount depends on the situation" or "it makes people aware of the pecking order and creates an emotional backlash". I think this is not a good idea for a number of reasons. There are type A jobs and type B jobs in the world, and there are people who are good at A and people who are good at B. There are few people who are good at B, so they get a high price in the market. twitter.com/kis/status/139...
	>[nishio https://twitter.com/nishio/status/1393225751801958400]: If you hire someone who is good at type B work in a place that only does type A work, they will not be reimbursed twice as much as someone who is good at type IME work. The other side is that "they only hire people for type A work. The other side thinks, "Of course they're not productive, they're just type B people.
	>[nishio https://twitter.com/nishio/status/1393226906657427464]: The original story was about the unit price of programmers, but it is the same story as "I hired an MBA holder but he is useless" or "I hired a Tokyo University student but he is useless". It's a situation where there is a mismatch between the abilities of the person and the work they are hired to do.
	>[nishio https://twitter.com/nishio/status/1393232109322395651]: Conversely, if you try to get a Type A person to do a Type B job, what happens is that, assuming no difference in intelligence or enthusiasm, the Type B person If we assume that there is no difference in intelligence and enthusiasm, then we need to spend the same amount of time on knowledge acquisition as the Type B person has spent on knowledge acquisition so far. Whether that is six months or three years depends on the nature of the knowledge. And it is difficult to estimate before acquisition.
	>[nishio https://twitter.com/nishio/status/1393233984956428290]: well, this is a case where the difference between type A and type B is a difference in knowledge, and knowledge acquisition can change from A to B. There are many cases where this is valid but it is not generally valid.
