Deepen mutual understanding with Scrapbox
The new corona epidemic made it difficult to operate a "physically get together and have a good time," and it became harder to deepen mutual understanding (to know what kind of people we are to each other) among the members.
Can you do something about this?

Unexplored Junior has created a Scrapbox project for the entire project starting in 2021, and we discussed how to make it better by using it.

　Have all participants use "their page" in Scrapbox
　　Introduce yourself more and more to the link.
　　→I can identify people who share common interests with me.
　　You can add it in stages.
　　　I don't know what to do when they're all added to the empty state at the same time.
　　　If existing members write their introductions ahead of time and link to each other, newcomers can see them and copy them.
　　　"I'll warm up the place first."
　　　The experience of writing your own introduction and discovering connections with seniors who share common interests once you have made the link.

　The theory that lots of output by each member is essential for mutual understanding
　　The reverse is easy to imagine, dozens of hours of listening to lectures in silence will not deepen mutual understanding with other members.
　　How do I get a lot of output?
　　　Rules that allow you to write anything and use the page freely.
　　　Just "feel free to do whatever you want" isn't enough.
　　　　In the meantime, create a "chat page" so people can write without reading the context.
　　　Would be nice to have specific examples of "anything."
		> Feel free to write anything you want!
  > You can also add pages as you like
  > e.g., meeting logs for each project, etc.
  > If you are not sure where to write, please use the `[chat page]`.

　Scrapbox's "making links will make you happy in the future" is not for those who haven't actually experienced it.
　　The concept of "links in Scrapbox" is difficult to understand in the first place.
　　　"The person linking doesn't know the linked page, they discover it by linking to it" is a far cry from the concept of linking in HTML, etc.
　　　Words such as [linking], [tagging], and [bracketing] are being explored, but it is difficult to understand when coined words are used to explain actions that have never been experienced.
　　liken it to an act experienced
		>If you put [link] as if you were highlighting keywords, the pages will be connected to each other and become more interesting!
  	>You can make more and more links to other people's pages even if they are written by other people.

	[Create a recommendation introduction page].

　Minimize rules.
　　You can't set a lot of rules and expect people to abide by them.
　　Increased fear of "am I violating the rules?" inhibits output.
 　Dr. Shiozawa's "Do not erase" rule
 　　It seems to be the only rule of the Shiozawa Seminar.
 　　Originally hired, but changed.
 　　[The "don't erase rule" is too strong.]

　The scope of information distribution should be clear.
　　It gives us peace of mind by stating, "What you write here will not be released to the world without your permission."
　　Until now, Unexplored Jr. has been communicating the rule that "things related to other creators must not be disclosed without permission.
　　　Except in cases where the person has already made the information available to the public and in cases where prior permission has been obtained from the person in question.

	Regarding "Unexplored Junior created Scrapbox project for the whole from 2021.
	　There was a Scrapbox project to share information among mentors since 2017
	　Some mentors used individual Scrapbox projects for each individual creator.


reference data
	New student training at the University of DigiHari 2021
		>On the first day, they had everyone access the same page called "Where I'm from" and write "Where I'm from is ____" [src https://www.facebook.com/695894081/posts/10159333649309082/?d=n]
		>Spectacular to see how many people are writing in real time!
		This in itself is something that's often done with Scrapbox guidance.
　>Unexpected chaos ensued. I don't know if it was intentional or by mistake, but a student appeared to edit the name of the page itself, "Where I'm from. A split occurred in pages like "Where I'm from," "Where I'm from," and "Where I'm from is Tokyo."
　>Rules that everyone can make any page they want.
　>If you dare to write your name, put your icon on it.
　>We did not make any strict editing rules, although there should be some conflicts in the descriptions. We instructed that if there was a conflict, the parties concerned should discuss and resolve it, and that they should create a separate page or list their differing opinions. However, we did not want to start a fight, so we set up an "Editorial Advisory Center" and told people to use it as a court of law when the time came. But this center was rarely used. The community was self-governing.
　[* Students who share an interest are readily identifiable].
	　>Each page is connected by links. Students who share the same interests can now be easily identified.

	　>One of the training assignments conducted for new students in 2021 [src https://prtimes.jp/main/html/rd/amp/p/000000086.000027275.html]
　>In April 2021, Kitamura of Nota Corporation will conduct an online course on the use of Scrapbox for more than 300 new students of the university's class of 2021.
　>Explains that anyone can create a wiki site easily without specialized knowledge of HTML or CSS, as it is possible to create pages, input text, set links, and decorate text.
　>New students actually operated Scrapbox to create their own self-introduction pages. Even new students who had never used Scrapbox before were able to easily create a self-introduction page.
		>Created a "DHU Super Wiki" on Scrapbox by connecting approximately 300 new students online for five days from April 12 to April 16 [src https://prtimes.jp/main/html/rd/p/000001938.000000496.html].
			>As the new coronavirus continues to rage and shows no signs of abating, the training was conducted completely online as in the previous year.
			>In order to think about their studies for the next four years, the 2021 Freshman Training Program was designed to allow students to experience online collaboration, where students co-write and edit each other's work using "Scrapbox" (scrapbox) provided by Nota Corporation, and through the pages they create, [* ① (1) learn about their classmates, (2) learn about the university, and (3) learn about the faculty and staff], through the pages they created.
			>Many of the project members who were in charge of new student training last year are back again this year.
			>After 313 new students created their self-introduction page (My Page), they were divided into four groups or 40 teams and worked on interviews with faculty and staff members, writing introductory articles, compiling a university history, creating an unofficial school song, and creating designs, resulting in over 2,600 pages.

　[/shiology/05222-180810 #exchange of wisdom at scrapbox drinkup]
　　>shio seminar uses it with over 100 members.
　　>The only rule is "never turn it off.
  > Each person comments on each other's arguments. When I get comments, I want to erase and fix them, but I don't.
  > Your words are your life. Once uttered, words never disappear. So take responsibility for your words.
  > And when we get a comment, instead of deleting it, we duplicate the page and modify it.
  > By the way, in [shio.icon] classes, all students take notes with indelible pens (fountain pens). The writing instruments for exams are also fountain pens. Pencils and erasers are not allowed. Because in society, you don't write documents to be handed to others in pencil.

　[/shiology/05633-190919 Procedures for running a class completely with Scrapbox-only (Started operation in Musashino City Endowed Course "IT and Rules Now and in the Future")]
　　Challenges of what to do in a situation where participants have mixed IT literacy
　　>I would like to have a Scrapbox for all the reaction papers and reports that students submit each time.
　　 The purpose of wanting to do so would be this idea: [to give karma].
　　 >The word "class" means "to impart karma. It is not a "lecture" (to teach righteousness), which is a one-way transmission of information, but a "class".
		[* Create Scrapbox project with student number].
 		>Students create a public project in Scrapbox using their student ID number (student number)
 		>If you write your reactions and reports each time there, the faculty can read them.
 		It is easy to access each project by using the student list page based on the student's student ID number.
 		Related [/masui/using-scrapbox-in-class].
　　Scrapbox at this time [/mkk].
		　[/shiology/04785-170603 I prefer Scrapbox for both class texts and resumes]

　[/yujif/Scrapbox-based classes].
　>Beginning of class
  > Have Scrapbox write out the current image for the theme.
  > Instructors can also recognize what they are looking for on the part of the students and the level of achievement of each.
  > Course participants may find themselves editing at the same time
  > If we all take notes together, the result will be a comprehensive notebook.

　[/loiloonline]
