How to use Notion in Pixiv
[How to use Notion in pixiv - pixiv inside https://inside.pixiv.blog/2021/05/20/120000]
	>Consolidate document storage
  > The most worrisome aspect of operating Notion with a team is the decline in [the sense of ownership] of Notion.
  > Because Notion documents have a hierarchical structure, knowledge of "where documents should be placed" inevitably tends to become knowledge, and it gradually becomes impossible to decide where to place documents mechanically. If there are more opportunities for people to get confused about where to place documents, it is easy for them to give up on creating the documents themselves and not keep the information.
  > After this continues for several times, the decline of the sense of self becomes unstoppable, and people gradually distance themselves from Notion, and eventually a psychological hurdle is established: "I don't understand Notion well.
  > So, we have a place where you can put documents as you see fit. The only rule is "all information that would be relevant to other members should be shoved in here. This makes a big difference in the ease of creating documents.
>A series of documents becomes information.
 > As knowledge of where to place which documents becomes more open and can be mechanically discerned, the team will gradually develop a perception that "[information not in writing is not information]" and documents will be actively created.
 > At first, documentation was done after the discussion had started, and the communication was "I wrote down the current flow," but then the MTG started making articles to write the minutes in advance if they were going to be written anyway, and then the agenda was written if there was already a place to write it. The agenda started to be written if there was already a place to write it.
 > Eventually, unnecessary no-agenda MTGs were no longer conducted, the minutes of the MTGs began to properly form the appearance of documents, and the decision-making process was comprehensively articulated. As a result, by looking back at the sequence of documents, it became possible to see "when and how discussions and decisions were made" in chronological order.
 > This is a very big advantage, because this document itself becomes an "output log of the entire team in chronological order," which can be used as it is for "organizing what has been done, sharing information between departments, regular reporting, and escalation.

>[antibayesian https://twitter.com/antibayesian/status/1395272747979198464?s=21] This is really good and I basically do the same. Whenever we say "let's summarize internal knowledge", there are always people who say "appropriate hierarchical structure and searchability by tags", but first let's spit out the information. Nowadays, tools such as notion have a search function, so searchability can be done later.
	>Searchability is really good for later, and if you use document titles and the search function, you can handle 300 or so documents in your experience. The other question is whether it is possible to organize the information properly before we know what kind of information will be accumulated until we do it. The biggest problem is that the information is not accumulated in the first place; you can organize it after you have accumulated 1,000 or 2,000 documents.
