Wiki is a good place to introduce yourself.
In situations where a large number of people are newly meeting each other, having a wiki (Scrapbox) create a self-introduction page rather than creating a self-introduction channel in chat and introducing themselves all at once will enrich the self-introduction information by an order of magnitude and promote mutual understanding.
[Increasing member output promotes mutual understanding].

Number of words on the self-introduction page created in Scrapbox as of the 12th day (5/28) after the project was created.
 table:Number of letters N=20
  Median Mean Standard deviation
 	747	884	556
	We're still slowly adding members, so we'll check back in a while when things stabilize.

For chat (2020)
　Sporadic spontaneous self-introductions by new participants were made early in the meeting.
　It was long, and the mentors (half-intentionally to liven it up) commented on it.
　Number of words in the first 10 self-introductions (not including comment exchanges)
  table:Number of letters N=10
   Median Mean Standard deviation
  	103	119	61.4

　On the day of the face-to-face event, an announcement was made to write your introduction in the introduction thread, and a large number of introductions were circulated.
　There is a sense of convergence to a shorter pattern compared to the early introductions.
　　About 1 to 3 lines
　　I'm X. I'll be playing X. I'll be playing X. Please take care of me.
　　Is it because of the last minute people?
 　Were you drawn to the image of a verbal self-introduction?
 Lots of self-introductions are played, so it is difficult to comment or start a conversation even if you are interested in the previous self-introductions a little earlier
　Number of characters in the last 10 self-introductions
  table:Number of letters N=10
   Median Mean Standard deviation
  	94	87.8	31.7

Non-Quantitative Impressions
　Because of the order of magnitude amount of self-introductions, I've learned for the first time the origin of the handles of people I've mentored with for several years, and I'm like, "Oh, I didn't know that!" Or something like that.
　Scrapbox's ability to comment on a line allows me to write in my introductory statement, "What, you're XX? Me too!" type of conversation is occurring.
　Scrapbox's personal icon specification triggers the act of putting up "images that represent you
　　In the chat room, few people put up images in their introductions.
　　There are many pages with multiple images because if you put one up, you feel the same way about two or three.
　Actively linking the technology you use in your project connects people who use the same technology.
　　Experience of discovering connections with others by writing self-introductions.
　　This is true even in verbal self-introductions, where you might have a conversation in your spare time, saying, "You mentioned something earlier, didn't you?
　　　The self-introduction channel was not associated with a "speaking in front of everyone" situation, or perhaps the chit-chat did not start there.
　　　In the case of chat, DMs are close, and the extent to which DMs were made is not observable.
　　　In a physical place, local conversations can leak out and trigger another conversation, but that doesn't happen in a chat DM, the place needs to be designed in such a way that chit-chat happens in a public place.
　　　Scrapbox functions like a physical local space where each page
 Cons: 
 　As of Day 12, there are 47 Scrapbox participating members and 21 have written self-introductions
  　Some people put off creating an introduction page because the psychological hurdle is raised when they see someone writing a lot of self introductions.
  　But even if we consider them as zero-length introductions, the amount of self-introductions still increases over the chat.
　Introducing it to an existing community doesn't seem to work.
　　It seems to me that the compulsion from the management to write self-introductions at the right time for newcomers to the project was necessary for the introductions to be written.
　　Frequent opportunities to view Scrapbox for project progress is also necessary to maintain retention
　　　If the main work was done elsewhere, using Scrapbox as a place only to put introductions, I bet there would have been people who never opened Scrapbox again after putting their introductions in Scrapbox.
　It is important that there be a shared belief on the team that "participating members will be looking for positive interaction" at the start of a new project.

Written 12 days ago (5/17)
　[Scrapbox to increase mutual understanding].

2021-06-11 Day before the event
	>At this point, there are 47 members participating in Scrapbox, and 21 of them have written self-introductions
	Situation 14 days after this point
	72 members
		49 have profile pages
			3 different profile pages in the system
			14 creators + 12 mentors + guests
			　Three of the mentors had not made it as of 5/30, so Nishio urged them to do so.
			　Nishio created it because one person had not created it as of 6/4.
			　Therefore, all guests without a profile page.
		No profile for 23 people
			Nishio cooked for 18 people this morning.
			This brings the page count to 515.
