The rule against erasing is too strong.
Current Form
>Scrapbox is a collaborative notebook. If someone writes a comment on your text, please do not erase the original text as much as possible. You will lose the meaning of the comment.

	Dr. Shiozawa's "do not erase" rule was initially adopted, but changed.
	　[/shiology/05222-180810 #scrapbox drinkup で知恵の交換]
　>shio seminar uses it with over 100 members. The only rule is "never erase".
　当初: 西尾流の表現
 	>Please don't erase what you wrote.
  	>For example, when you ask a question and get an answer, some people seem to think "I've solved it, let's erase it", but you should not erase that exchange because it is useful to others!
  	>If you want to organize the information in a messy way, you can "Duplicate" (duplicate) or select and "New Page" instead of deleting the information.
　Discussion on the opinion that "Do not erase" is too strong.
　Back to the original context
　　There's got to be a reason why the rules were born.
		Original context:.
  　[/shiology/05222-180810 #scrapbox drinkup で知恵の交換]
  　　>shio seminar uses it with over 100 members.
  　　>The only rule is "never turn it off.
    > Each person comments on each other's arguments. When I get comments, I want to erase and fix them, but I don't.
    > Your words are your life. Once uttered, words never disappear. So take responsibility for your words.
    > And when we get a comment, instead of deleting it, we duplicate the page and modify it.
    > By the way, in [shio.icon] classes, all students take notes with indelible pens (fountain pens). The writing instruments for exams are also fountain pens. Pencils and erasers are not allowed. Because in society, you don't write documents to be handed to others in pencil.
 　To supplement the context, "I don't erase my writing when others comment on my writing."
 　　If you erase it, that "comment made by someone else" becomes meaningless.
 　　In other words, it ruins the effort of the person who made the comment.
　　　So don't erase it.
　It is necessary to convey this purpose in language that does not feel harsh
	like this
		>Scrapbox is a collaborative notebook. If someone writes a comment on your text, please do not erase the original text as much as possible. You will lose the meaning of the comment.
