Actual warfare in modern times
I had the opportunity to discuss what "actual warfare in the modern era" looks like, and I summarized some of the things I researched at that time.

	Automatic rifles invented in the 1880s
	1914 [Lanchester's Laws] published.
		A time when automatic rifles were being adopted by the military.
		point (e.g. of a statement)
			We've gone from "a situation where each soldier takes aim at an enemy soldier" to "a situation where we shoot randomly and kill the enemy in a stochastic manner."
			It became easier for the side with the greater number of people to gain the upper hand than in previous wars.
		In other words, I'm assuming a situation where a large enough group of infantry to be statistically manageable collides with another group of infantry, and they start shooting up the place.
			Is that kind of fighting the main thing in the modern world?
	1960 Che Guevara, "[Guerrilla War]."
		A book on how to fight with a small and poorly armed army
		Guevara led a small, under-armed army to a successful Cuban Revolution.
		This indicates that the main combat situation did not turn out to be the one that Lancaster's model had envisioned
	Computer networks begin to be created in the 1960s.
		The Internet was created in the 1980s.
		As a result, "attacks conducted without physical proximity" via the Internet were created
 		[Cyberattack data from the Ministry of Internal Affairs and Communications in 2017: https://www.soumu.go.jp/main_content/000495298.pdf]
 			Japan Suffers Targeted Cyberattacks on JAXA and JAEA

	1995 Tokyo [Sarin gas attack on the subway https://ja.wikipedia.org/wiki/%E5%9C%B0%E4%B8%8B%E9%89%84%E3%82%B5%E3%83%AA%E3%83%B3%E4%BA%8B%E4%BB%B6]
		Incidents of chemical weapons being used in the capitals of developed countries.
		It has been demonstrated that great damage can be done by cult groups that are inferior in numbers and technology compared to the military.
		In 1999, "[Super Limit Warfare]" was written by a Chinese military researcher.
			point (e.g. of a statement)
				The boundaries between "war and non-war," "war zones and non-war zones," etc. will disappear.
				Internet and securities markets will also become battlegrounds.
	2001 [The terrorist attacks on the United States https://ja.wikipedia.org/wiki/%E3%82%A2%E3%83%A1%E3%83%AA%E3%82%AB%E5%90%8C%E6%99%82%E5%A4%9A%E7%99%BA%E3%83%86% e3%83%ad%e4%ba%8b%e4%bb%b6]
		Outwardly, the cult group did this on its own.
			The U.S. government has issued a report alleging Saudi Arabia's involvement.
			Clashes are occurring without explicitly taking the form of a war between nations.
			It is common for the side with the inferior force to choose surprise.
				Preparing for surprise attacks in the form of terrorism became important for national security.
	Beside this trend, the idea of "the boundary between war and non-war disappears" of super-limited warfare develops.
		2003 The Political Work Regulations of the People's Liberation Army of China are amended.
			[public opinion warfare], psychological warfare, and legal warfare.
			This includes actions such as controlling public opinion on the Internet
			Interesting that you describe it as a "war".
	The 2004 "[W]ar of Wisdom."
		Conquest and occupation are prone to casualties in your own army.
		An unmanned attack would cause no casualties and be politically inexpensive.
		A scenario in which the enemy leader's reputation is destroyed in a public opinion battle and then assassinated by a drone.
			Pose as terrorists and carry out surprise attacks.
		2021 Domestic Politicians Protest Against [Critical Land Regulation Bill].
