Get rid of the persona.
Raw feedback is more important than persona.

>[kur https://twitter.com/kur/status/1397924292134793218]: I think a lot of people involved in [product design] know about the concept of "[persona]", but when working on [design thinking] or [design research] When working on [design thinking] or [design research], I want you to put personas out of your mind. What are you going to do with the raw information you have at hand from interviews if you dare to cut them down?
	>[kur https://twitter.com/kur/status/1397927860778594317]: I think it's amazing how well known "personas" are, though. Even people on the business side and developers who are not designers know it as a concept, even if they have never created or used it. I think it's better known than "design thinking" if I'm not mistaken. I don't know.

>[storywriter https://twitter.com/storywriter/status/1397984960238157826]: Exactly! The point of UX design is to "understand the complex in its complexity" ("Let the chaos speak for itself", [Jiro Kawakita]). Defining a persona to the extent of "my persona is a decision-maker who is considering adopting xx" is like shouting out "I don't know anything about my customer.

>[watch_dog_timer https://twitter.com/watch_dog_timer/status/1398229725760278532]: Persona methods, if used for proper setup and review perspectives through personas, are fine. However, it is usually used by consultants or someone with a loud voice to create a fictional entity that does not exist in reality, and to approve the best service (W) that satisfies all the desires of the persona.
	>[watch_dog_timer https://twitter.com/watch_dog_timer/status/1398230727699812352]: [raw feedback] is important to avoid dancing around a fictional persona. Ethnography] in design thinking is more of a process to discover something that is sure to stick, even if it is just one person. It is more valuable to value the raw feedback.

>[kur https://twitter.com/kur/status/1398252434498023428]: While we must always be careful that our personas are not for our own convenience, it is also necessary to define the target user when considering a product. The phrase "anyone can easily ________ by using this product" is a danger signal.

>[kur https://twitter.com/kur/status/1398570652383158273]: I know a lot of people mix up persona and [typology]. I was googling to see how to explain it, and I found an explanation on the New Zealand Digital Agency's site. It is good. / Typologies | NZ Digital government digital.govt.nz/standards-and-...
	>[kur https://twitter.com/kur/status/1398570874123419653]: I wonder why the concept of typology doesn't seem to be popular in Japan.

relevance
	[Product/User Fit]
