Verified Twitter account
I heard that the certification process, which had been stopped for a while, has been re-partitioned and resumed.
	>Starting May 20, 2021, we’ll begin rolling out verification applications to everyone. 
 	https://help.twitter.com/en/managing-your-account/twitter-verified-accounts

I looked at the conditions and said, "Huh? Maybe we can make it work?" I'll give it a try.
	https://help.twitter.com/ja/managing-your-account/about-twitter-verified-accounts

>To be awarded the Blue Badge, an account must be trustworthy, prominent, and active.
	>Reliability
	 >You can choose one of the following three methods to verify your identity.
		 >Official Website: Send a link to an official website that mentions you (or your organization) and your Twitter account.
		 >Identification: Present a photo ID issued by a public institution, such as a driver's license or passport.
		 >Official Email Address: Enter the official email address containing the domain associated with the selected prominence category.
　　I thought this was an AND condition, but it's an OR. Then it's easy.

>Notability
	>Companies, Brands, Organizations: Accounts representing prominent organizations and related secondary accounts (e.g., accounts of companies, brands, non-profit organizations, and their leaders and other prominent executives)
	This is the difficult part.
	　>Two of the following requirements must be met
  > Presence in information that reflects general awareness, such as Google Trends, public stock trades, credible Wikipedia articles that meet the criteria for encyclopedic prominence, and databases such as GlobalGiving.
  > At least three references indicating that the project has been covered by a news organization that meets the criteria listed in the "News Organization" category below within six months of the date of application.
  > Followers within the top 0.05% of active accounts in the account's region.
  Not one, but two must be met.
  The Unexplored Corporation has a Wikipedia article [https://ja.wikipedia.org/wiki/未踏 Unexplored - Wikipedia].
  How many active Twitter accounts are there in Japan?
  　>Twitter has 45 million monthly active users in Japan [src https://service.aainc.co.jp/product/echoes/voices/0014].
  　Are these values correct?
　　　That would be 22,000 people, not enough.
　　Then there are only 3 reports left within 6 months.
　　　Depends on how relevant this needs to be.
　　　I'm not sure if "reference to a project being done by the Unexplored Corp." is sufficient.
　　　If that's what you're looking for, there should be a time when it's accomplished.
