a
>[oxomckoe https://twitter.com/oxomckoe/status/1400455798413688832]: I once thought "Tokyo is a horrible place" when I was an assistant at Hokkaido University. When I was doing logistics for an international conference, we were sent a simultaneous interpreter. At first, I thought that I could at least interpret because I was a researcher, but interpretation is not easy and it didn't work. I was not a good interpreter, and I could not do simultaneous interpreting without training.

>[oxomckoe https://twitter.com/oxomckoe/status/1400456508664545297]: It was an international conference of academia, so there was a lot of jargon, but when I gave them the materials in advance, they did a wonderful job of simultaneous interpretation. The interpreters were all women, and they were all full-time housewives. They were all full-time housewives who had graduated from the University of Tokyo or ICU. It was a celebrity job.

>[oxomckoe https://twitter.com/oxomckoe/status/1400457783451869206]: there are people from Tokyo University, ICU, and TUFS (some ICU and TUFS students even completed their graduate studies at Komaba) who are full-time housewives. I will leave the gender issue aside for the moment in this case. Anyway, as a person from a remote area in northern Hokkaido, I was shocked and awe-struck to see people with such a strong academic background working as full-time housewives and having celebrity part-time jobs. I was shocked and in awe.

>[oxomckoe https://twitter.com/oxomckoe/status/1400459080502628365]: again, I'll leave gender issues out of this as they are not my area of expertise. These women got into top-notch universities with relatively little to spare, are normally well-educated, but have no interest in grubbing up a career, and are partners with horribly well-paid husbands who read, polish their language skills, and raise their children. It was higher for me than the clouds.

>[oxomckoe https://twitter.com/oxomckoe/status/1400461174861230090]: It was impossible. It was an impossible world, for me. As a researcher, I might be able to surpass their husbands (if they were researchers). But I couldn't imagine having a wife who was not career oriented with that high education and language skills. In other words, I would never win. It sent chills down my spine to wonder what kind of world this was.

>[oxomckoe https://twitter.com/oxomckoe/status/1400465258469224456]: the first time I saw white people in the first place was when I got to college, that's me. I studied hard in a land where the sun only shines a couple of days a month, I wasted away and got into North University, that's me. I was so worried and anguished that I even thought (someone bring me a machine gun, I can't float in this world anymore if I don't zero it out once).