I don't know if I'm right.
	[/blu3mo-public/ I'm not good at interfering with others without knowing if I'm right].

What does "interfere" mean?
　For example, if a junior high school student came to me and said, "I'm not sure if I want to enter N High School or not, please decide.
　　Which do you think is better?" I won't even answer
　　I have a good sense of N High School under my skin, but I'm not sure enough to influence other people's high school experience.
　　　I don't think I'll ever do this, no matter how detailed I get.
　　　Not feeling "well-informed enough" even about the high school you left
　　　Oh, I see, the question "Which is better, option A or option B?" can only be answered by someone who has experienced both.

therefore
>A theory that I am not comfortable taking the risk of interfering with others in a situation where I am not sure if I am right.
I'm sympathetic to this.

But I don't share the first half, "I'm not very good at confidently disseminating information."
　This block, I found it difficult to make sense of what you were saying in the first place.
　　[/blu3mo-public/I'm not good at interfering with others without knowing if I'm right#60c5f37612862600003a0b36]
　I read the link [/blu3mo-public/ "a society that benefits those who can transmit information with confidence"] and interpreted it to mean "I am not good at transmitting information with confidence".

So, this is a mix of different concepts on a single page?
　Or, it appears to be a different concept due to Nishio's belief that information dissemination and interference are two different things.

Why am I able to "confidently disseminate information"?
　No? Are you confident in the information you're giving out?
　　It's like the parameter of confidence was never there in the first place...
　　When I send something out, I ask myself, "Am I confident in this?" I don't think I think about it...
　For example, let's say you run a certain code and get a certain error message.
　　The "I got this error message when I executed this code" is an observed fact.
　　　It doesn't matter if you're confident or not.
　　　If you think the latter is better than the world in which it is not shared versus the world in which it is shared, then publish it.
　　　When it comes to the behavior of code like this, it's usually a matter of choosing to publish it without any room for worry.
　When you write this code to avoid an error
　　If that's true, then confidence is still irrelevant.
　　Don't know if it's the best way.
　　I don't know if it works in other users' environments.
　　If it solved my problem, then "this solved my problem" is true.
　"This is the kind of design that would be good."
　　Example: [private/public split].
  You're obviously not sure about this, hence the "shouldn't the output be in..." ending.
  This is ultimately about how much you trust the literacy of your readers.
  　Even if someone else's article affirms, for example, that you should enter, it is clear that this is an interpretation, not a fact.
  　So even if it is written in such a way, I would interpret it as "this is a statement that the author thought so".
  　So the way it is written also comes down to "a statement of fact that 'I thought this'".
 I suppose it could be interpreted this way."
 　Example: [software abuse].
 　I think it's the sharing of the fact that "I thought, 'This is how it could be interpreted.
　in other words
　　Q: Why am I able to "confidently disseminate information"?
　　Implicit in this question Q is the assumption P that confidence is necessary to disseminate information.
　　In Nishio's subjective view, "P is false" because he transmits information even if he is not confident about it.
　　But I imagine other people's viewpoints would say, "That's because Nishio is so confident."
　　So the next question is, "What is [confidence]?" is the next question?

I'm getting sleepy, so I'll call it a day.

[Correctness]
　I first put this link here because I thought it was going to be about the definition of correctness, but so far it hasn't come down to that yet.
