Nada 2021 Reference Materials
　Lecture materials: [Nada School Saturday Lecture 2021].
　Q&A: [Nada 2021 Q&A].

　Reference materials (including announcement text)
 	Information on the lectures given at the Nada School Saturday Lecture Series in 2014 can be found here.
 		[Nada School Saturday Lecture 2014]
 		You can see the slides with the addition of what I said in the audio, and the questions and answers that your seniors asked when they were in middle and high school seven years ago.
 	[The Intellectual Production of Engineers]
 		This is not meant to be a "read the whole thing," but rather as an example of the "[roll the snowball and make it bigger]" process [- what I talk about in my lectures becomes a book four years later].
 		　PS: "What I talked about in my lectures became a book four years later" is wrong, and the correct interpretation is that the column I wrote for my previous book started the snowball rolling, and it grew bigger and bigger, involving serials and lectures.
 	[A vein of skill, a mountain range of people].
 		Chapter on unexplored projects in the book "[Veins of Technology, Mountains of People]" published by IPA in 2004.
 		Nishio was about 21-3 years old.
	[Opportunities for decision-making are a dime a dozen.]
		Essay written in response to a request to write about decisions
	 Written in December 2017, published the following year
	[Ah, Nada High School... the "after" of Japan's most studious children https://gendai.ismedia.jp/articles/-/545]
		Weekly Modern article, 2010, Nishio not involved.
	[Knowledge, Capitalism, and the Technologist Condition]
		The missing chapter 0 of "The Technology Behind Coding."
	　Written in 2012
	[Lecture at Toyota Technological University].
		2019
		PDF. The world is unequal / The benefits of inequality / Skills cannot be acquired without practice / Changing the rules of the game
	[How do you know what your options in life are?]
	　For this talk, I asked questions on Twitter and got responses from hundreds of people.
	　>About the choices you've made in your life that you think "made this choice better for the rest of your life," "How did you know about that choice?" Please tell us.
	[How to come up with good ideas].
 	>The goodness or badness of the variation depends on the line that needs to be crossed.
  > Which situation are you in now?
		relevance
			[average orientation is the worst environment].
			[value of choice].
	[quantity of options and quality of decision-making].

Additions after the lecture
　[post-capitalist society].
　　[Commodity cash]
 　[Cash is weak capital.]
　[trade-off between use and exploration].

　[If AI doesn't take your job, you'll get three less days off a month].
　　[The parable of the Tayupinko people].
　　[AI will not take jobs.]
