misdelivery of books
>[museoftoday https://twitter.com/museoftoday/status/1405096433124970497]: I think Yoichi Ochiai talks about things in a way that is difficult to understand for most people, so in the end it doesn't stick in anyone's mind. I think it's a good thing.

>[ochyai https://twitter.com/ochyai/status/1405097563515019269]: totally not talking hard on purpose, but maybe there are just a limited number of people doing art, research, business and education at the same time! ... twitter.com/museoftoday/st...

>[nishio https://twitter.com/nishio/status/1405374059831914499]: The world is full of "easy stories at a low cost", and people who have only been exposed to such baby food have weak jaws. If you serve them normal food, they will say, "Oh, my God! It's not edible! When I serve them normal food, they say "It's not edible!" twitter.com/ochyai/status/...

>[hayamiz https://twitter.com/hayamiz/status/1405375577050083330]: I think this is less about baby food and more about the chef's whim, like a baffling combination of Japanese, Indian, French and Russian food all at once.

>[nishio https://twitter.com/nishio/status/1405376293881860101]: ah. Like walking into a new Japanese/Western cuisine restaurant, expecting orthodox French food, and then an unfamiliar dish comes out and you're like, "What's this?" or something like that?

>[ochyai https://twitter.com/ochyai/status/1405382558196527105]: i think it's a distribution error twitter.com/nishio/status/...

>[nishio https://twitter.com/nishio/status/1405383753753522181]: the concept of "misdelivery" is actually not well understood.

>[ochyai https://twitter.com/ochyai/status/1405385116185108481]: The books are not distributed to the bookstores where they should be (e.g., none of the business books go to the bookstores where they could be sold, and a few of them hit the shelves at an AEON mall in the suburbs). It's a mistake, like a book not making it to the right shelves.
>p-press.jp/blog/sell/8.ht…

>[nishio https://twitter.com/nishio/status/1405386368402948101]: I see, it's like the phenomenon that a message doesn't reach "the target where something useful happens when it is delivered" but "the target where nothing useful happens". I wonder if it is like that.

>[ochyai https://twitter.com/ochyai/status/1405403958781255684]: Also, messages can be delivered to the wrong place, messages can not be replayed, messages can be categorized in the same stack as different messages, etc. It also includes such things as messages being delivered to the wrong place, messages not being replayed, and messages being categorized in the same stack as different messages.