Unexplored Junior 2021 Boost Conference
Unexplored Junior tried a new way of boosting meetings in 2021, which was very well received.
I think it would be beneficial for the world to publish this experience in writing, so I will gradually organize it in the future.
Nishio knows too much detail to explain it succinctly yet. For now, I'm going to write down everything I remember and think of, and then I'll try to sort it out.

åéŸ¿
 >[teramotodaiki https://twitter.com/teramotodaiki/status/1403907925819621376]: This unexplored junior arrangement is going too well. In the second year of online, you invented a new way to hold the most recent online event.
 >[73_ch https://twitter.com/73_ch/status/1403948834187726857]: unexplored jr boost conference, it was great to see a good separation of what is better to do asynchronously and what is better to do synchronously.
 >[blu3mo https://twitter.com/blu3mo/status/1403964467336015884]: unexplored junior boost conference, how to create a place for communication(?) was super very good!
 >[YoshifumiSeki https://twitter.com/YoshifumiSeki/status/1404022509742166017]: I liked the format of the Junior Boost Conference. I think this is due to the fact that everyone has a certain level of intelligence and motivation, and since it's basically volunteer work, it's okay to leave out those who don't follow along, but the performance was still very good and enjoyable.
 >[shokai https://twitter.com/shokai/status/1403655682918813698?s=21] The day before the meeting, the project concept and progress video had already been shared on scrapbox, and many questions had been asked. On the day of the meeting, after a brief demonstration and Q&A session, the density of the meeting was amazing!
 >[ukkaripon https://twitter.com/ukkaripon/status/1404095894576791554]: I don't have any writing skills, so I think it would be good for junior unexplored applicants, people who organize similar online events otherwise, and even for the original Unexplored if someone could put it in writing and publish it. I think it would be good for people and, if you want, for the original Unexplored.

What is [Boost Conference]?
ã€€In human resource development projects where multiple projects are adopted at the same time and the project implementation period lasts several months before the results are reported, a meeting is held at the beginning of the project where the adopters make a presentation on the contents of the project.
ã€€See [Boost Conference] for a detailed explanation.

What we did this year
ã€€In a nutshell, "asynchronize self-introductions and presentations."
ã€€Participants first create a self-introduction page.
ã€€Boost meeting 1 week prior to the meeting.
ã€€ã€€Each creator shoots a 10-15 minute presentation video
ã€€ã€€Uploaded to YouTube as Unlisted
ã€€ã€€Paste into Scrapbox
ã€€Participants must be present on or before the day of the event.
ã€€ã€€Watch the video
ã€€ã€€Leave questions and comments using Scrapbox's Tree Board-like usage.
ã€€ã€€[nishio.icon] Bullet points with your own icon set like this

Conversation at a presentation
ã€€(While listening to a 1x presentation synchronously)
ã€€A: It's frustrating that I'm so used to being able to look back at what I want to look back at that I can't look back at what I was saying.
ã€€B: Yes, I wouldn't miss it for a second!
ã€€A: A presentation that is supposed to be able to be looked back on is going to change the structure of the presentation in the first place.
ã€€C: The year before last, we shared slides in advance
ã€€D: I don't think Mr. C shared the context of Mr. A's talk. The Unexplored Junior's Boost conference was in a format where you could watch the presentation videos in advance. In other words, you could watch it at 1.5x speed or something and rewatch the parts you were interested in, and then just do the Q&A on the day of the conference.
ã€€B: & write questions in Scrapbox in advance style
ã€€E: It looks like a flipped class.
ã€€F:. Flipped class + Scrapbox.
ã€€G: Video is good because you don't have to be nervous and make mistakes in your presentation on the day of the event!
ã€€H: I think this is a big factor. I don't think there are any more cases where people stay up all night the day before to prepare presentation materials, and then on the day of the presentation, they are in such a hurry that they can't think straight and the Q&A session is a bit awkward. Asynchronous presentations also reduce the amount of time lost.
ã€€F: The disadvantage is that it is difficult to follow the discussion and Q&A conversations without watching the videos
ã€€G: Seems difficult to get people to watch the video in advance
ã€€B: I can use the advance viewing more time-efficiently, because I can play it back at double speed.

Explanation of a certain place
ã€€Presenters will post videos on Scrapbox in advance, participants will watch them in advance and write questions and comments in Scrapbox, and on the day of the event, only synchronous things like questions and live demos will be done.
ã€€The fact that the presentation is on video allows participants to watch it at any time, play it back at double speed, and listen back to parts they didn't understand well.
ã€€Reduced the amount of time participants were held up, while allowing more time for questions.
ã€€ã€€In addition, by having the questions gathered in advance in text format, there was no more "waiting for someone to show up to ask a question" and the Q&A time was used more efficiently.
ã€€Q: Don't you know who wrote it?
ã€€ã€€A: Create a profile page and icon notation
ã€€ã€€Q: æ€§å–„èª¬é‹ç”¨ï¼Ÿ
ã€€ã€€A: It was pointed out early on that "you could fabricate statements," and that's what we're working on 5/18.

2020å¹´
	table:Schedule
		ï¼‘æ—¥ç›®
 	13:30 About Unexplored Junior (Dr. Ukai), Self-introduction, Greetings (Dr. Takeuchi)
 ã€€14:00-18:00 7 individual project presentations (10 min presentation, 15 min Q&A)
  20:00	æ‡‡è¦ªä¼š
ã€€2nd day
 ã€€13:00 Self-introduction (of alumni who participate only on the second day)
  13:20-17:35 8 individual project presentations (10 minutes for presentation, 15 minutes for questions)
  19:30 Online get-together
2021å¹´
	table:Schedule
		ï¼‘æ—¥ç›®
		13:00 Management Announcement
		13:20-17:20 10 individual project presentations (20 minutes for questions)
ã€€2nd day
		10:00 Management Announcement
		10:10 - 11:30 4 individual project presentations (20 minutes for questions)
		13:00-14:30 Guest LTs (6) + Announcements
		14:30- 30 min. social event + free time afterwards
ã€€Some of the active creatives seemed to be having a blast until 7pm.

Changes we knew about in advance
ã€€Last year it took 8 hours and 15 minutes for 15 projects, this year 5 hours and 20 minutes for 14 projects.
ã€€ã€€I could put in a guest LT in my spare time.

Changes observed after the fact
ã€€Asynchronous self-introductions were unexpectedly exciting.
ã€€ã€€[Wiki is good for self-introductions]
ã€€ã€€It is unlikely to develop with comments on self-introductions, either in chat or voice.
ã€€ã€€ã€€If you are physically assembled, this will occur during the break time chit-chat after introductions, etc.
ã€€ã€€ã€€Individual differences are great.
ã€€ã€€ã€€Holding the event online made it harder to do.
ã€€Asynchronous text-based question comments were more crowded than expected.
ã€€ã€€At first I was worried that I wouldn't get any comments at all, but when I opened the lid, I got more comments than I could fit on a single page by the day before.
ã€€ã€€During the question and answer period of the day, participants added their thoughts and comments as they listened to the responses, and in the end, each project received about 10,000 words of feedback.
ã€€Scrapbox exceeded 600 pages at the end of the Boost conference.

Personal Concerns
ã€€[Tool Culture Issue]
ã€€I wonder if only the easy-to-understand "I used Scrapbox" and "I let the video come out first" stories will be heard by one person.
ã€€ã€€If you only introduce tools and imitate methods as if that were a silver bullet, it won't work.
ã€€ã€€Especially the second half of [Wiki is a good way to introduce yourself].
ã€€ ã€€100% of this year's adopters created profile pages, and conversations occurred on the profile pages, which helped with mutual understanding.
ã€€ ã€€23 out of 46 guests did not do the "first thing to do" profile page creation.
ã€€ I'm not sure we can reach critical mass without a certain amount of people with a high "sense of ownership."

It would be better to have an explanation of "why we did it" for all of them, including detailed measures.
ã€€[Purpose over rules.]
ã€€As of 4/26, Mr. Ukai consulted with the mentors on the policy of "recording and uploading the video in advance, and only conducting Q&A and exchanges".
		Last year was the first online event due to COVID19, so we did the same 15-minute presentation and 10-minute Q&A as the offline event.
		ã€€But it was too much of a burden to do two full days of video viewing compared to offline viewing.
		We want to increase opportunities for interaction.
	Nishio identified this as an application of [flipped learning] to the presentation
	ã€€We had a separate discussion on 4/2 about [remote speakers can be recorded], so I thought it made sense.
	ã€€[Effect of double-speed playback]: No significant difference in comprehension, but satisfaction is highest at 1.4x.
		There was some concern about whether the creators would be able to film the presentations, but they assumed that they would use Zoom's recording function and not edit them, so they thought, "We have practiced presentations in previous years, so why not just film them?
		I wonder how the viewer being asynchronous will affect it, unknown.
			If you have any insights on how to make it more exciting, please share them with us.
	Mr. Teramoto makes the comment that "making comments to Scrapbox makes it easier to discuss even asynchronously".
	ã€€Until this comment was made, it was assumed that questions would be collected via Google Forms.
	ã€€ã€€I had done it before with sli.do [slido style].
	ã€€OneNote, Scrapbox, and Notion were three ideas in the air.
	ã€€ã€€People don't know much about it except what they use most often.
	ã€€Mr. Teramoto's assertion (with a reservation that he is not sure if OneNote or Notion can do the same thing)
	ã€€> 1. 100 or so people can use it normally
   > 2. see other people's cursors
   > 3. a style of mentioning with more indentation below the lines written by others, so that it is always easy to overlook even if the discussion gets heated up, like mention X to mention Y to mention Z....
   > 4. it is easy to create a separate page for off-topic topics and write about them there
   > 5. retrace links when looking back later
		Nishio was not part of the discussion at this time.
ã€€5/16 Cormorant drafted an announcement for adopters assuming Scrapbox will be used and asked mentors to review
ã€€ã€€Scrapbox groups are created.
ã€€ã€€Mr. Teramoto does a lot of maintenance.
ã€€ã€€ã€€Email instructions to Scrapbox page
ã€€ã€€ã€€Pinned "Introduce Yourself Template" as "The First Thing I Want You to Do."
ã€€ã€€ã€€Like this: [what I want you to do first].
ã€€ã€€ã€€At the time, there was a separate page for rules, but we put it together.
ã€€ã€€ã€€(More people don't read when pages are split, and some people didn't notice the explanation of the icon notation because it was written two hops ahead.)
ã€€ã€€ã€€Separated the project page and the page to put the video of the boost meeting (foreshadowing B).
ã€€ã€€ã€€Teramoto-san created pages for each project.
ã€€ã€€During this process, Nishio lists the Scrapbox of his adopted projects in the past
ã€€ã€€ã€€I used it for the first time at the 2017 Unexplored Junior Camp.
ã€€ã€€ã€€ã€€It's become a chat log storage place.
ã€€ã€€ã€€PRIVATE PROJECT OPERATION on the adopted project in 2017.
ã€€ã€€ã€€2018-2020 changed the operation to make public project with difficult to guess project name.
ã€€ã€€ã€€Teramoto has also been using Scrapbox since 2018 to summarize the minutes of adopted projects.
ã€€ã€€ã€€ã€€Nishio didn't recognize it.
ã€€ã€€Teramoto: "Wouldn't it be interesting if various projects were linked across the board?" Nishio: "It would be good to [link] around the self-introductions of graduates."
ã€€ã€€ã€€Example: `I thought about porting a prototype I made in [Scratch] to [Unity], but after some consideration I decided to do it in [Web App] and created it in [Vue]. It is hosted by [Firebase Hosting] for free. We use [SkyWeb] for videoconferencing. It's like `.
ã€€ã€€ã€€They decide to take the initiative by introducing themselves first.
ã€€ã€€At that time, I thought "Scrapbox is for asynchronous communication until the day before, and on the day of the event, I will use Mattermost, a Slack clone, because Scrapbox does not have reactions and emojis, etc., which makes it less exciting" (Foreshadowing E).
	5/17
		>nishio I think it would be nice if the upperclassmen are already participating and the place is already warmed up at the stage when new students enter, just like in a normal lab operation. Therefore, before announcing to this year's creators, I would like to announce to the graduates and have them create a self-introduction page.
  > If you have each alumnus write about a project he/she did, and use the keywords in it as a link, it would be good to suggest alumni who did related things.
	ã€€Nishio published a summary of best practices that he is aware of at this time: [Scrapbox for better mutual understanding].
		>nishio I think the benefits of using Scrapbox need to be clearly communicated to the people who use it, and that is "write your introduction and make it a link to connect with various people".
  > I would like both Teramoto-san and I to experience the gradual improvement as information accumulates, but it is not feasible at this stage.
ã€€5/18 Configured Mattermost to flow update notifications (Foreshadowing C)
ã€€5/19 "Recommended Books" page is created by Mr. Ukai
ã€€ã€€'We'd love to hear your reasons for recommending us!' and multiply your interventions to increase content
ã€€5/23 Discussion of operating rules among mentors on Scrapbox
ã€€> nishio: if we have a discussion, why don't we stop putting it in the rules and cut it out to a separate page for discussion?
  > That would be more beneficial than descending as a rule for unknown reasons.
ã€€ã€€Result of discussion: [rule not to erase is too strong].
ã€€ã€€Inspired by this(?) A discussion arose from adopters as to whether or not to classify "book recommendations"
ã€€ã€€ã€€This one bothered me personally quite a bit.
ã€€ã€€ã€€ã€€One option is to "leave it to autonomy."
ã€€ã€€ã€€ã€€On the other hand, "more rules" is a streak of evil.
ã€€ã€€ã€€ã€€ã€€The more rules you can't understand at a glance, the more you'll lose the ease of writing.
ã€€ã€€ã€€ã€€ã€€How to classify books is a difficult problem, no easy-to-understand rules can be created.
ã€€ã€€ã€€ã€€[We talked about the high probability that classification criteria created before the whole picture is known are wrong.
ã€€ã€€ã€€That discussion led to the question, "Is recommended sci-fi even an option?" and I agreed because I thought it would lead to an increase in content if we made it "yes".
ã€€ã€€ã€€And by the way, I made the intervention that "there's no need to limit it to books."
ã€€ã€€43 books as of 6/18
ã€€ã€€ I'm overlaying icons on recommendations written by others when I recommend them too.
ã€€ã€€ Design to Be" and "Design for Whom?" received 4 votes, and the game BABA IS YOU received 3 votes.
ã€€5/28 Self-introductions were unexpectedly exciting, so I put together a comparison with last year's chat.
ã€€ [Wiki is good for self-introductions]
	6/6
	ã€€Video upload deadline
	ã€€Commenting on uploaded videos.
	ã€€I felt differently about being the first to comment on my own adopted project, so I asked other mentors to do so.
	ã€€Some videos are difficult to comment on.
	ã€€ã€€The original intention was to "present to the mentor on Zoom and record it" ([Foreshadowing A https://scrapbox.io/nishio/%E6%9C%AA%E8%B8%8F%E3%82%B8%E3%83%A5%E3%83%8B%E3%82%A22021%E3% 83%96%E3%83%BC%E3%82%B9%E3%83%88%E4%BC%9A%E8%AD%B0#60cbe4e8aff09e0000a1cfd7]recovered)
	ã€€ã€€Then tools such as Loom were introduced, and it was agreed that they would look better.
	ã€€ã€€The case where the asynchronous style of "creator takes a video of the presentation and the mentor comments on it" was not a good choice here.
	ã€€ã€€ã€€Typical "large task with an unclear definition of completion."
	ã€€ã€€ã€€ã€€Deadlines are looming ever closer.
	ã€€ã€€ã€€If the mentor sees the finished video and has a slight concern, it will be difficult to make the decision to "throw it away and take it back".
	ã€€ã€€ã€€ã€€Even if there is something that bothers them a little, they say, "It's not worth having them reshoot it," and it doesn't get corrected.
	ã€€ã€€ã€€The cost of a creator presenting and a mentor commenting and modifying the presentation is cheaper than the cost of modifying it after the video is taken
	ã€€ã€€ã€€ã€€Or the cost should have been reduced by "making the first video messy with the intention of throwing it away," but this was not a common understanding between the mentors and creators.
	ã€€ã€€ã€€ã€€For example, "Should I add subtitles?" was asked by a creator. At first I didn't understand what he meant, but there may have been a misunderstanding that we had to make YouTuber-like videos.
	ã€€ã€€ã€€Maybe we should have made it synchronous, at least up to video ver. 1.
	ã€€ã€€ã€€ã€€In other words, practice the presentation to the mentor, look at it and give feedback on corrections, and repeat the cycle several times before recording.
	ã€€ã€€ã€€The pressure for the mentors was that there was less than a week between the final decision to adopt and the deadline for video submissions.
	ã€€ã€€ã€€ã€€Would have preferred several meetings if possible.
	6/7
		Scrapboxä¸€éƒ¨æ¶ˆå¤±äº‹ä»¶
		ã€€(PS: The change on the Scrapbox side may make it easier to revert in the future in the event of an incident like the one I wrote about here.
		ã€€ã€€>[shokai https://twitter.com/shokai/status/1406522656900403201?s=21]: it might be a good idea to make a PAGE HISTORY whenever you delete more than 10 lines at once!
		ã€€Half of the page content disappears due to an operational error.
		ã€€I was able to restore the project's video postings and descriptions in Page History in Scrapbox itself.
		ã€€ã€€However, only the one from about 30 minutes ago was saved, and dozens of lines for two people who commented after that time were lost.
		ã€€Restored from the update notification log that had been sent to Mattermost (recovered foreshadowing C).
		ã€€ã€€If we hadn't run the log through Foreshadowing C, it would have been completely lost.
		ã€€ã€€Fragmented notice, so it's hard to connect them together and put them back together.
		ã€€ã€€It took about three of us to edit it collaboratively, and the restoration was completed in about 15 minutes.
		ã€€One user was experiencing "frequent selection problems," which were resolved when he changed browsers.
		ã€€I suspect that Grammaly's browser extension and Scrapbox may be incompatible.
		ã€€There was another incident where an entire page was erased in addition to this one.
		ã€€ã€€Can be restored from Stream
		ã€€ã€€I didn't know that, so I imported the backup JSON into a new project and restored it from there.
	6/8
	ã€€There was a mentor who made it "this week's homework" to comment on everyone's videos, and I thought it was a good idea to encourage comments, so I copied him (I avoided using the word "homework" because I thought it might make it sound obligatory).
 	ã€€>I would suggest that you watch the other creator's videos and comment at least one word on the marks you see.
   >Everyone wants people to be interested in their projects, and if they don't watch the video first, the question and answer period at the boost meeting will be boring.
	6/11
	ã€€Day before the event
	ã€€ã€€Comments that people who are usually too distracted by the operation to comment and give feedback were glad to have plenty of time to give feedback.
	ã€€Comments were more voluminous than expected.
	ã€€ã€€It doesn't fit on one screen.
ã€€ã€€ã€€ã€€>nishio åˆå¾Œ11:37
    > The amount of feedback is definitely off the charts.
    > The question is what can we do tomorrow that will work...
    > Mentor's job tomorrow is becoming not at all obvious w
    > I'm sure the ingenuity of all the mentors will be tested.
    > I'm glad I'm not the top hitter...(Hey!
	ã€€ã€€As for my own adopted project, I sorted it and wrote this
 	ã€€ã€€>ğŸ™‹ is organized by [nishio.icon] to make it easier to hear orally
    > 	è¥¿å°¾ã®MCæ–¹é‡
    > The preliminary questions are organized and sorted so they basically go from top to bottom.
    > Mentors will share Scrapbox on screen and ask questions to the creators.
    > Any questions related to what we're talking about, please write them on the Scrapbox screen share where you're looking,
    > I don't notice if you write outside. No comment screen.
    > Questions/comments that you don't need to respond to right now can be left off the screen.
ã€€ã€€ã€€The basic premise was that it was up to the mentors to decide how to use the 20 minutes, and I did it because I wanted to, without any particular discussion, but in retrospect, I should have told the other mentors, "This is what I am going to do," and some may have wanted to copy me. (Foreshadowing D)
ã€€ã€€ã€€ã€€Oh, I was telling them at 2:00 a.m. on the same day w
    > 1:45 a.m. I used a summarized question text and rearranged the comments at the mentor's discretion because it was hard to find the questions that day.

	6/12å½“æ—¥
ã€€ã€€I left it long enough to try to write it later, so I'll start with the messy stuff.
ã€€ã€€Initially, it was assumed that chat would be used during synchronous activities, but unlike previous years, no flow rate was generated (foreshadowing E recovery).
ã€€ã€€ã€€1:30 "How can we make everyone feel involved?" and "I can't stay focused in this state."
ã€€ã€€1:30- Discussion by some mentors [comment screen https://machikado-career.com/2020/04/15/commentscreen/] might be good
ã€€ã€€1:45
ã€€ã€€>Mattermost, Scrapbox, raise your hand with Zoom, and Tslami distributed to three
ã€€ã€€Decision to stop Mattermost
ã€€ã€€>If you want to ask a question synchronously, you raise your hand, otherwise you write it in Scrapbox.
ã€€ã€€In response to this, "Will you disperse the comment screen as well?" Concerns
ã€€ã€€>I'd say we've decided on a place for questions, but we've lost the place for chit-chat.
ã€€ã€€I should have directed the chit-chat to the Mattermost chit-chat channel."
ã€€ã€€[nishio.icon]As I was writing this, I realized what the screen configuration was for the participants in the first place, I'm participating in both Mattermost and Scrapbox from my phone, so it doesn't prevent me from watching Zoom...
ã€€ã€€Composition of Mr. Yasukawa
ã€€ã€€[https://gyazo.com/d6d96d93cf6c56f3f0b5dfabb9966ff2]
		1:58 è¥¿å°¾ã®æ–¹é‡
		ã€€>"I've organized and sorted the questions in advance so we basically go from top to bottom, and the mentors will ask the creators questions by screen-sharing the Scrapbox. If you have a question related to what we are talking about, please share the Scrapbox screen and write it where you see it, so we don't notice it if you write it outside. Anything that isn't right now can be off the screen."
			In other words, an announcement that we won't even look at Zoom's raised hands, and that we will be consolidating to Scrapbox.
ã€€ã€€Scrapbox "off-screen writing area" problem
ã€€ã€€Scrapbox is being updated with a bang, but I think it will look "lonely" because they don't show it there on Zoom.
ã€€ã€€ã€€But I have a theory that scrolling with Zoom screen sharing will make people who were gazing at the screen trying to read the text get drunk.
ã€€ã€€ã€€ã€€Maybe a smaller font would have reduced scrolling and shown live input?
ã€€ã€€14:00- Comment screen was tried by some mentors
ã€€ã€€ã€€If you don't have a paid version, you'll overcapacity the number of people.
ã€€ã€€ã€€Not suitable for long questions.
ã€€ã€€ã€€14:20 "Put in a comment screen in management and share screen from management?"
ã€€ã€€ã€€ã€€I want to share the screen from my own hand, and it's too much work to give verbal instructions every time I want someone to scroll."
ã€€ã€€ã€€It's hard to read long sentences flowing slowly on the comment screen.
ã€€ã€€ã€€ã€€Not good for long sentences.
ã€€ã€€ã€€ã€€Demonstrations and reactions like "wow" and "wow".
ã€€ã€€ã€€ã€€ã€€In the first place, "oh" and "wow" don't occur very often during questioning, do they?
ã€€ã€€ã€€ã€€If a user "posts as a question" will it stay on the screen?
ã€€ã€€ã€€Scrapbox doesn't allow for chit-chat.
ã€€ã€€ã€€It's nice to see the comments flowing, but it's a shame to see the questions drift away.
ã€€ã€€ã€€ã€€ç†æƒ³ã¯Mattermostã‹ã‚‰æµã™ï¼Ÿ
ã€€ã€€ã€€ã€€Flush from Scrapbox, then?
ã€€ã€€ã€€ã€€Exporting to CSV after the fact is possible (paid version feature)
ã€€17:00-
ã€€ã€€Mr. Ishimaru's "Stream out to the side style."
ã€€ã€€ã€€[https://gyazo.com/1b4052b9f8f8e636bacccfffe385ce90]
ã€€ã€€ã€€A solution to the Scrapbox "off-screen writing" problem has been invented!
ã€€ã€€ã€€I thought that the phenomenon of people fiddling with other pages during the meeting was visualized...
ã€€ã€€ã€€ Should it have been shared in advance?
ã€€ã€€ã€€ Maybe you could use that to narrow down the search by putting a string in the search window on the Stream screen?
ã€€6/13äºŒæ—¥ç›®
ã€€ã€€[nishio.icon]I wondered why the text in Scrapbox was so small, but I just set it to 150%.
		äº¤æµä¼ç”»
		ã€€Moveable breakout room
		ã€€One page in Scrapbox has a list of breakout room numbers, and the topics being discussed in the breakout room are written there.
		ã€€ã€€This showed a big difference in the amount of information from room to room.
 6/14
  >nishioI sympathize with the point that "it worked so well that I want to spread the method widely," but it seems dangerous to copy only the tools because it relied on the ad-lib of the mentor quite a bit.
	 >The mentor was the chairperson or MC, and there is a big difference between the mentality of "we're all going to do things the way the management decides, and if it doesn't work, it's the management's fault" and "I'm going to do it the way I want to do it, regardless of what the other mentors are doing".
	 	I think it worked in the right direction that the mentors of Unexplored Junior basically did not align themselves with those around them, but rather did things the way they thought best (using comment screens, or not).
 ã€€Opinion at about 2:00 p.m. on the first day: "It's just mentors and creators talking."
 ã€€ã€€This is an opinion that implicitly considers "that's not good"
 ã€€ã€€Nishio's opinion is.
 ã€€ã€€ã€€That's not a bad thing.
 ã€€ã€€ã€€They've been telling us for weeks that this was the configuration.
 ã€€ã€€ã€€å‰æ—¥ã«ãã‚Œã‚’æƒ³å®šã—ã¦æº–å‚™ã—ã¦ã„ã‚‹([ä¼ç·šDå›å https://scrapbox.io/nishio/%E6%9C%AA%E8%B8%8F%E3%82%B8%E3%83%A5%E3%83%8B%E3%82%A22021%E3%83%96%E3%83%BC%E3%82%B9%E3%83%88%E4%BC%9A%E8%AD%B0#60cc2d35aff09e0000961f5a])
 ã€€ã€€ã€€Not something to discuss on the day.
  ã€€A thought I've had time to think about.
  ã€€ã€€I consider boost meetings to be "a place for others to learn about the creators and the project," so I implicitly choose to "maximize the amount of creators' comments."
  ã€€ã€€So I'm summarizing and shortening the pre-question text.
    Giving creators time to think in advance also gives them more time to speak.
		I think it had a positive effect on the shared perception that "we don't have to be unified."
	  On the other hand, if you tell people that "this is the strongest way," the force to unify with that "strongest way" will work, and individual exploration will be suppressed. This would be counterproductive.
	  æ–‡è„ˆ https://twitter.com/teramotodaiki/status/1403907925819621376?s=21
ã€€ã€€A good theory is to only unify "upload videos first," "discuss in Scrapbox," etc., and leave the day's progress to discretion.

é–¢é€£
ã€€[Discussion while listening to presentations on Scrapbox]
ã€€Easy to write comments while watching videos posted on Scrapbox.
ã€€ã€€https://twitter.com/shokai/status/1403717699985940485?s=21
	[Working Backwards]
