灘2021質疑
[灘校土曜講座2021]の質疑
Not an exact transcription, but added and edited for clarity when read back.

Q: If you were to grade your teacher's life today on a scale of 100, what would it be?
A: What would you get if I asked you what your score would be on a 100-point scale?
Q: I want to know if you already consider it 100 points, reasonably good, or not so good.
A: I see. There are things I want to do in the future, things I have missed doing in my life.
　I don't count the things I've missed out on in my life because there's no benefit in thinking about them now.
　What you want to do in your future life is the "future" you'll be doing in the future, so "how many points is your life now?" doesn't count when you ask.
　Then, if you ask me, "What is the score of your life now? I think it is 100 points.
　I don't think a simple comparison can be made because I think it depends on what criteria each person uses to score when asking others.
　I'm happy with my life now, and I'm ready to do what I want to do with my life in the future.
　(PS: I think this is inappropriate in the first place, "scoring life on a 100-point scale"!
　　You implicitly see life as a "100-point test," but I don't think that metaphor is appropriate.
　　For example, if you were to look at the contents of your wallet right now and ask, "On a scale of 1 to 100, what is this wallet worth?" I don't want to be asked "What is this wallet worth on a scale of 100?
　　If we hadn't spent the money we've spent in the past, we might have had more money, but that argument is futile because it doesn't produce anything.
　　Assuming it's a perfect score of 100, it doesn't mean there's no more money in your wallet after this.
　　Generalizing, there are a number of things in the world that are not appropriate to be compared to a "100-point test".
　　　One reason it is not appropriate is that "there is no upper limit."
　　　Another reason is that we can't improve?
　　　　In the case of math problems, you can assign a score based on whether or not you were able to solve the problem, and if your score improves after taking the test repeatedly, you can judge that your understanding has improved, but since you only live once, assigning a score is meaningless.

You all may think it's normal to not get questions at times like this, but it's the "limited range of observation" and "the average around you is not always correct" kind of thing!
　Logically, you're losing money, and it's ongoing.
　The more questions you ask about what you are interested in, the more likely you are to get information that interests you, so of course it's in your best interest to ask questions!
　Those who are proactive at times like this will have the best chance.

Q: Are there any skills that will be useful in society while studying for the exam math?
A: Yes, there are so many.
　There are people in the world who say "math is useless," but that's all just because "people who know enough to make math useless" aren't making it useful.
　The math skills you are developing now are extremely useful!
　Why? Because it's hard to become obsolete.
　For example, if you learn a programming language that is popular now, in 20 years, the knowledge of the language itself will be obsolete because the trend of programming languages will have changed.
　Math doesn't rot after 20 years, so it's very cost-effective.
　I think everyone here is here because they have good logical thinking skills, but if you make proper use of your logical thinking skills, it will also be very beneficial for living in society.
　So, I have a great weapon. I wanted to say that it would be a waste if you have a good weapon but are stuck in an octopus and lose it without knowing your options, so you should look at the world more broadly and have "another axis," and exam math is extremely useful.
 (Added) Supplement to the story that knowledge of programming languages is obsolete.
 　Twenty years ago when I was 19 years old, I used Visual Basic, and after it was adopted by Unexplored Youth, I used Delphi and Java.
 　JavaApplet has since been superseded by Flash, and that Flash has been superseded by HTML5, so "the knowledge of those programming languages themselves" has become obsolete. Let's call this "knowledge with low level of abstraction tends to become obsolete.
 　On the other hand, experiences such as "how to display high-dimensional data on a two-dimensional screen" and "how to map a click on a two-dimensional screen to a point on a high-dimensional space" are still useful even if the programming language used changes. Let's call this "knowledge at a high level of abstraction is less likely to become obsolete.
 　This is a more abstract concept, which leads back to the mathematical knowledge of "vectors" and "matrices". Being familiar with the concept of "high-dimensional vectors and matrices" was useful even in the era of natural language processing, when "meaning is a vector with hundreds of dimensions," and it was also useful during the boom of neural networks.
 　Abstract knowledge is sometimes called "useless" because it is not always useful on its own.
 　　Useful" often means "solving a concrete problem," and requires working down a highly abstract problem to a less abstract "concrete problem.
 　[Intellectual production techniques of engineers] p.44 [(1.5.3) Learning from pattern books].
 　[https://gyazo.com/0cf7975d0334b2783f693ec7eeae9dc7]
 　[灘校土曜講座2014] p.133, 134
 　[https://gyazo.com/b23af4901ad675966549a548e28e8b54][https://gyazo.com/52086041b0c7a16e8f7e39a0fb387a9f]
　　It becomes difficult to be useful if only abstract knowledge is "rootless knowledge" or "a box on the floor with only the top taken from it".

Q: What do you think about the importance of knowledge
A: I think it is very important.
　Why? Because there are things that people without knowledge can't do.
　You said, "If you have a choice, but you don't know what that choice is, you can't make the choice." Knowledge is what makes the choice.
　For example, if you don't have knowledge of mathematics, when you want to solve a certain problem, you can't solve it because you can't notice things like, "If you make this a complex number, you can do it.
　In the same way, for example, if you want to go to a certain university, you can't go there because you don't have enough grades in math.
　Knowledge influences whether or not you can come up with a choice and whether or not you can take that choice.
　We are becoming a society where knowledge is the most important asset.
　　Drucker's book "[post-capitalist society]" is interesting.
　　You may think, "It's a capitalist society" and "money is the most powerful thing," but money can't buy knowledge.
　　Money can be spent on hiring knowledgeable people and setting aside time to learn, but the key "process of acquiring knowledge" can only proceed if the individual learns.
　　Meanwhile, it is becoming easier for knowledgeable people to secure money
　　Talking about knowledge being a more valuable resource than cash, Dr. Masushima's slides were interesting and I'll add them to the reference material later.
　　(see [commodity called cash])
　　Simply put, cash is a weak resource and knowledge is a strong resource.
　　There are a lot of people who see it that way, for example, the University of Tokyo is steering the venture support.
　　　追記: 
　　　May 17, 2021 [New President Fujii of the University of Tokyo holds inauguration meeting to increase the number of companies the university is involved in through entrepreneurship education | Education | NHK News https://www3.nhk.or.jp/news/html/20210517/k10013035311000.html]
	　　>He stated that the University of Tokyo is currently involved in the establishment of approximately 400 companies, and that he hopes to increase the number of companies to 700 by 2030.
				April 19, 2021 [Open Innovation Promotion No.1 Investment Limited Partnership managed by the University of Tokyo IPC increased the total amount to over 24 billion yen｜University of Tokyo IPC Press Release https://prtimes.jp/main/html/rd/p/000000052.000025017.html ]
					>The University of Tokyo... The University of Tokyo (the "University of Tokyo") and its wholly-owned subsidiary, the University of Tokyo Collaborative Platform Development Corporation ("Todai IPC").... Total fund amount exceeds 24 billion yen... Large investments of up to 2 billion yen will be possible in the future.
		A channel is being developed for Tokyo University students to take their expertise and start their own businesses to make money through venture financing.
		Until now, it has been a beast of a road with a few strong people running through it, but now that the organization is supporting ventures, the road is being paved and a [highway] is being built.
		What is the highway for? The world is in a state right now where new things are being created, new resources are being created, and new businesses are being created by people who have extra money but no knowledge to pay for people who have knowledge.
		So I have the feeling that "knowledge is by far the most important, more important than money". I'm not in the majority yet.
　　Drucker's "Post-Capitalist Society" is interesting and anyone interested should read it, and if it's not in the library, ask your teacher to include it.

You can have the questions texted to me later and I can text them back.
　However, in the case of text, it is difficult to ask "What do you mean by that? The probability of a mismatched answer is likely to increase because it is difficult to ask "What do you mean by that?

Q: Do you think there will still be a high demand for IT-savvy people 10 years from now, when we will be working?
A: I don't know if it will still be expensive in 10 years.
	I'm thinking it's too expensive for me.
	The reason why I think so is that as the birthrate declines and the population ages, the percentage of people who have to take care of the elderly will increase in proportion to the number of people who work.
		(SEE [3 less days off per month if AI doesn't take jobs])
	If the amount of work does not change, it will be hard, but what to do then is to use computers to improve efficiency, such as computerization and automation. If we don't do that, everyone will end up working in the black.
 Therefore, there is a growing need for people who can handle this situation. I believe that the current population is decreasing and that IT personnel will still be needed 10 years from now.
 I'm a little unsure if this is a "do I need to do programming" question. The so-called NoCode-like option of solving things by popping them in the cloud could be more developed. But whichever way it goes, I think everyone's logical thinking skills will definitely be needed, so I think it would be good to work on them.

Q: What exactly is IT learning?
A: Hard to answer in one word.
	Search Google, find friends who seem to be good at IT, or go to places where people who seem to be good at IT are, and broaden your observation of things!
	There are so many choices. There are an awful lot of choices, some of which you want to do and some of which you don't.
	It is not like there is a curriculum that says, "Let's do this," and if you do 100% of it, "Congratulations, you are now an IT professional. If you don't want to do it, I don't think you need to study. I think you can push your math skills very hard.
　追記
　　It's not that there are no curricular things at all, for example, there are things like this
　　　>"CS50.jp," a Japanese translation of Harvard University's free online introductory course on learning Python and JavaScript programming and computer science, is now available free of charge.
  　 [https://smbiz.asahi.com/article/14357035 Programming class at Harvard University, U.S., Japanese translation available free of charge, anyone can listen to it | Tsuginojidai]
  But when you take the denominator of the IT workforce, what percentage of people have studied this curriculum, maybe less than 10%.
  Exam math has defined boundaries, but "math" is a much broader body of knowledge, and no one knows everything.
  Similarly, IT is a broad body of knowledge, and no one knows it all.

Q: What is the "third option" when you are torn between "do or don't do"?
A: When you think, "It's a choice between 'do it or don't do it,'" you have implicitly fixed "X to do" as one kind of thing. However, there is "something I want to achieve by doing X," and X is not the only way to achieve it. If we think like this and come up with another means Y, it becomes "do X, do Y, or don't do X."
　(I tried to improvise and use specific examples to explain, but they were not very good examples, so I decided not to transcribe them. If I come up with a good one, I'll add it.)
　(This is a good question to get the presenter thinking)
　(A related keyword is [wrong choice of two], but this link is not very organized.)
　I think the quality of decision-making can be improved by simply thinking, "Is this really the only option, or are there other options?

Q: I understand the need for verbal output, but at this point I am not able to verbalize what I want to ask, so I am asking this question. Anyway, I'm just throwing the ball out there.
A: 
　At least I threw the ball very well.
　And the results are very good because they got the message across.
　When you think, "I don't know, I can't say it well," write it on paper itself rather than thinking in your head, "I don't know, I can't say it well..."
　As you write down more and more words that come into your head, they will gradually accumulate because what you put on paper will not disappear.
　　Gradually, as you accumulate more and more of them, they become more and more numerous, and after the fact, they connect, and you say, "That's what I wanted to say.
　This expression of the question, "I can't verbalize well what I want to ask," maybe you thought that a nicely organized question has to be panned out from the beginning, but it is not. Most things in the world are not born with 100% perfection; they are born in a terrible state at first, and from there they improve and get better.
			[灘校土曜講座2014#599e71a7aff09e000045613a] p.104 あたりの話
	[In the chapter on output in "The Art of Intellectual Production of Engineers," it is more important to "[write it down and make it disappear]" than to use sticky notes or not.
		p.145
			[https://gyazo.com/57f95d35915018526f2f4203e80a0558]
		p.204
			[https://gyazo.com/30e15626707be35b442d91cd4c738316]

Q: How do you think we should try to do what we want to do when there are things we have to do and things we want to do at the same time?
A: First of all, is that "must do" really "must do"?
	For example, "I have to do my summer homework."
	　Is it really bad if I don't do my summer homework?
	　What specific bad things happen?
	You get into college and you say, "I have to get credits."
　　You have to earn credits to graduate.
　　What's the problem if you can't graduate?
　　I mean, "graduating and getting a degree" is something you value, and you're choosing to take action to "get credit" as a component to get it.
　It's supposed to be a straightforward form of "you want credit, so you do what you have to do to get credit," but you make the mistake of thinking that there's an unconditional rule that says "you have to do it," as if it's a descent rule.
　You come to high school because "you want to come to high school," and if you don't want to come, you can skip high school and go to Sannomiya to do karaoke. You might be disciplined, though. It is your freedom to do that.
　　You are agnostic as to what the future holds for you depending on the choices you make, you may or may not be cited, your parents may or may not be angry with you, you are the one who takes on the consequences of your choices.
　When people see the fact that I skipped college and went to graduate school, they misunderstand that I must have studied very seriously and got good grades. In reality, I was doing all the things I wanted to do, and if I didn't do what I was "supposed to do," I would have had no credits and would have had to stay in school.
　　(PS: This is another case where you learned about the options from the people around you who gave you information about them.)
　That is also life, your choices, not "I have to do it" but "you do it" or "you don't do it".

About Feedback
　We distribute paper, but if we write on paper, we will have to scan it and send it to you, so let's go digital. We want to make these things paperless.
　Was it Google Classroom? I'd ask them to write down questions and things they wanted to write, and then the teacher would compile them and email them to me, and I'd respond via email, and then the teacher would post my response?
　I will update the Scrapbox as needed, so I will add what I said I would add to the reference materials later. I'll post the presentation materials on the same page.
　I recorded this lecture and will send the URL to the professor later. The world is in the age of time-shifting. It is not an age where everyone has to gather in one place synchronously to have an experience, but it is becoming more and more possible to experience things in a staggered time.

Q: I understand that active choices are better than passive choices, but how can I weigh the pros and cons when the underlying thought is "if I act and fail, it's my fault" and acting can have a negative impact compared to "doing nothing"? I want to know which to avoid: "I should have done it" or "I shouldn't have done it.
A: If you do nothing, it is zero, and when you do something, there is a probability that it will be positive or negative, in other words, it is a probability distribution. This probability distribution cannot be accurately predicted before action.
　To a certain extent, there will be something like, "Is it like this?" But no one can know whether it is the right answer or not. If there is a possibility of losing money and you can't stand the loss, then don't do it.
　If you keep choosing not to act, you will always have zero, while there are many things in the world that "won't cost you much if you fail". For example, even trying to join a research group was a negative possibility, like feeling awkward. I didn't really care too much about it.
　But I don't know which is greater, the negative possibility or the positive possibility, so there is a range of ways to say this. If it works out, it would be interesting, and I think it would be better to copy the option with the higher possibility of it working out.
 So, in the section of the Engineer's Guide to Intellectual Production that talks about prioritizing tasks, there is a graph of probability distributions related to this, and there are some that have a broad distribution and some that have a sharp distribution like this
 	[https://gyazo.com/92afa53cb25cdddf3fb35c4712abd988]
 		[The Engineer's Art of Intellectual Production] p.58 [(2.2.3) What are the major and minor relationships when there are uncertainties?]
 A has a distribution with high uncertainty and a wide base; B has a distribution with low uncertainty and a sharp distribution.
 Since B is higher in terms of expected value, it seems reasonable to choose B in the short term. However, this cannot be said to be rational when considering the effect of knowledge gained through action.
 What I mean is that when the uncertainty of the outcome is represented by a probability distribution, this probability distribution is not a fixed distribution given by descent, but reflects the knowledge of the actor. the wide base of A is an indication of a lack of knowledge about A.
 If we only make choices that have a definite effect, we lose the opportunity to gain new knowledge. It's called [the trade-off between utilization and exploration]. Actions to gain knowledge (exploration) and actions to benefit from the lack of knowledge gained (utilization) are incompatible. So we have to strike a good balance, but if we choose actions based on the expected value based on the current knowledge, we will be biased toward utilization and neglect exploration. So not only the high expected value but also the uncertainty of the outcome must be positively evaluated in choosing options.
 If you only choose things that have a certain value, you will not be able to find a balance, and you will only be able to take advantage of things that already have a known value. Therefore, it is better to challenge new things just for the fun of it, or rather, for the fun of it all.
 (I realize that this could be misunderstood differently than what I am trying to say here.) I spoke very crudely without clarifying the premise of the discussion. I am not trying to say that we should be brave enough to do something that might be negative. There are people in the world who say "you should take risks" and let others take risks without taking risks themselves, like the "so-called influencers" who recommend to their followers that they should buy virtual currency, but no matter what logic such people use to say "you should do it," if you If you think it's a loss, you don't have to do it.
 The reason is that there are a lot of fraudulent people who say such things, the type of people who say them because others are being talked down to and he will benefit from their actions.
 The basic premise is that you should use your own logical thinking skills, think about other people's arguments without taking them for granted, and do what you are comfortable with and think is good. I don't want to impose as a descent norm that you should "take risks."
 To summarize what I wanted to talk about, "choose the option that seems to have the highest expected value" This is the basic premise. But often there is a blind spot: "We tend to forget the effect of knowledge acquisition. So, adding the excitement of the possibility of gaining new knowledge to the expected value will balance it out.
 Let's talk about another case of "no big losses but possible big gains". In the previous figure, the probability distribution was symmetrical, but in reality this is not the case.
 Especially in the case of a string of beads, try something small first, stop if it doesn't work or looks like it won't work, and if it works, scale it up and do more. [This style is called "small start," where you start small and gradually increase the size.
 You can try a little, gain some knowledge, and stop if you think it's not good enough. So the amount of loss is small. On the other hand, if you do well, the return is huge. That is one way to do it.
 So I think that if you try a few things that won't be a big loss if you fail, you will be able to make many other good choices from the knowledge you gain from them.
