灘校土曜講座2021
	2021-06-19 講演
	Administrative note: [Preparation for Nada 2021 lecture].
	Tried the style of sending references in advance: [Nada 2021 references].
	質疑: [灘2021質疑]

---- 講義資料

Designing the way we learn - Increasing the number of problem-solving options
　灘校土曜講座 2021-06-19
　西尾泰和

今回の目的
　Change your future life for the better.
　Life is created by individual choices.
　　We are not recommending a particular option.
　　Everyone's situation is different, and so are the choices available to them.
　　I hope you all choose to be proactive and make your own decisions, and that your choices will be better.
　Before I introduce myself, let me first explain an important concept.
　I'll talk about slido here too.
　We'll all post something, I'll ask you to post your age.
　Raise your hand and tell the teacher if you were able to do it.
　Support those around you who are not able to do so.

My range of observation is limited.
　Tend to mistakenly believe that what you see is all there is
　You can't see things in the distance very well.
　The ones further away don't even know they exist.
　[https://gyazo.com/0a1bb365533f8b6a96867ba6de48c5a1]


[Opportunities for decision-making are a dime a dozen.]
　Often, past decisions create opportunities for future decisions
　[https://gyazo.com/d4aa8d124e36c0daa0d2ea9added16f4]
　Often, choices that have a major impact on life seem trivial at the time of the decision
　　A story about the timing of a dramatic "decision" in your life.
　　Made because readers like it.
　Only a small portion of the beads can be observed from another person's point of view.
　　[https://gyazo.com/f681386e973f66609952da7704adff44]
　　To paint a little more detail:.
 		[https://gyazo.com/14843016a485838222a1bbf18376297f]

自己紹介
　I don't want to talk too much around high school and college.
　It's lame to be in your 30's talking about the high school you went to.
　[Ah, Nada High School... the "after" of Japan's most studious children https://gendai.ismedia.jp/articles/-/545]
  People who identify with organizations they have belonged to in the past.
  　Is that the peak of your life?
  	Is the subsequent activity below the median for that organization?

　This time, I have no choice but to do it because it would be better to understand the continuity from "everyone now" to "me now".
　　Expressed not by "what year in the West" but by "how old was he?"
　(Age 12) Entered Nada Junior High School
　(18)京都大学工学部情報学科入学
　(20)Adopted by Unexplored Youth
　(21)NAIST博士前期課程入学
　(22)同 博士後期課程進学 (23)学振特別研究員(2年間)
　(24) Completed doctoral program, had one year left on a JSPS Postdoctoral Fellowship, so did a one-year postdoctoral fellowship.
　(25)Joined Cybozu Labs, Inc.
　(29)東工大 技術経営専攻(社会人大学院生)　→(33)修了
　(32)前回の灘校土曜講座
　(33)一般社団法人未踏 理事(現在に至る)
　(34)Unexplored Junior Mentor (to date)
　(36) Intellectual Production Techniques of Engineers Publication
　(39)今！

	I looked at what would be written in a general resume, etc.
	[https://gyazo.com/e849b8fb44a2bbd30ce45c51b989bf00]
	In fact, there was an important turning point that hasn't shown up here.


19 years old.
	Participated in a study group held in Osaka
		I happened to see this on the web.
		At a reception, I was invited to attend the national conference of the Japanese Society for Artificial Intelligence.
		At the time, minors attending conferences on their own dime were rare (I didn't know that).
		I was offered a part-time job at Venture (Untrad).
		[https://gyazo.com/e80433f709ebbacfe6fba4483c0164c6]
			[A vein of skill, a mountain range of people].
		That's when I was told that the unexplored youth application process had begun.

Age 23.
	Drinking party for unexplored graduates
	He told me about Cybozu Labs, which had just been established at the time.
	[https://gyazo.com/4463665d395321c553434cfdba9f2030]

　I mean, if I hadn't joined a study group when I was 19.
　　Not adopted by the unexplored
　　Not employed by Cybozu Labs and
　　He is not a member of the board of directors of the Unexplored Incorporated Association and is not a member of the board of directors of the
　　Not even an unexplored junior mentor.

What about the publication "The Intellectual Production of Engineers?"
　Invited by a colleague at Cybozu Labs to give a one-hour talk on programming languages (28)
　I've posted the materials of that speech on the Internet.
　The editor of the magazine asked him if he would like to write an article for the magazine, and he accepted.
　It was so well received that we decided to turn it into a book.
　　The Technology Behind Coding."
　　Studied technology management at Tokyo Institute of Technology at the time → Leave of absence
　　　Understanding customer needs is important.
　　　　→Collected "Moya Moya" that the assumed readers are having.
　　　I wrote a chapter 0 about the management perspective that I thought was very important.
 　　[Knowledge, Capitalism, and the Technologist Condition]
　　　but cut because readers can't keep up.
　　　Later, it became necessary to write a column to fill the margins of the paper, and part of the column was published from the manuscript of Chapter 0
　　After publication of "The Technology Behind Coding" (31), the column was so well received that the magazine began serializing it.
　　　The year after publication was the last Nada High School Saturday class.
　　　The questions deepened the discussion, which was interspersed throughout the book "The Intellectual Production of Engineers.
　　The serialization was so well received that it was published in book form.

[Opportunities for decision-making are a dime a dozen.]
　Often, past decisions create opportunities for future decisions
　Often, choices that have a major impact on life seem trivial at the time of the decision
　I attended a research group I happened to see on the web.
　Attended a drinking party with unexplored alumni.
　Lecture materials were posted online.
	My range of observation is limited.
		I didn't know about Antrad.
		I didn't know about the unexplored youth.
		I didn't know about Cybozu Labs.
	Only a small portion of the beads can be observed from another person's point of view.
		I don't put in my bio that I "participated in a research group."
		I wouldn't put on my resume that I was invited for a drink."
		I don't put on my resume, "I was approached when I posted my materials online."

The Intellectual Production of Engineers
	Choices that have a major impact on your life seem trivial at the time of the decision.
		[https://gyazo.com/a8f514cd409a0180e4454cd2ff1623c3]
		p.227
		We do not know at this time what value the options in front of us at this time will have in the future
	Only a small portion of the beads can be observed from another person's point of view.
		[https://gyazo.com/6f987c6d1791f15f9af1a8a56d8553a9]
		p.6
	My range of observation is limited.
[https://gyazo.com/cdbb400483ecbd48e16820b35a55f575][https://gyazo.com/187c56943f03010b6c06b2c8b25a6ba0]
		p.213 Note other places where the keyword "blind spot" is used.
	Past decisions create opportunities for future decisions.
		[https://gyazo.com/4a45c00cab28dde6e55f235a2e978e5e]
		序文 p.x
　　Reactions to outputs "outside of yourself" provide new information input.

Exam Math and Life
　I think you all are good at this as far as exam math goes.
　The examination mathematics is
　　The problem to be solved is explicitly given.
		Scale of assumptions that can be solved in a given time
		Options for how to solve problems are defined and clearly stated in the curriculum.
　Problem solving in life is
　　You decide which problems to solve.
　　The scale of the problem is unknown.
　　Problem-solving options are not explicitly stated.

Problem-solving options are not explicitly stated.
　Some people say things like, "I didn't know that was an option, that's not fair."
　　The assumption that "choice is explicitly given" is false.
　　Different people know different options, this is the observed fact.
　Some people think of it as equality.
　　For example, many adults believe that equal educational opportunities for children are preferable
　　	→義務教育
　For example, information is inexpensive to replicate.
　　Deliver information on open positions such as Unexplored Junior to as many people as possible.
　　The status of widespread distribution of "information on options."
　　But this depends on the low cost of reproduction of "information"
　Most resources are limited.
　　For example, you can't get everyone who wants to get into Nada into Nada.
　　It is not possible to adopt all applicants for the unexplored juniors (the ratio of applicants is 9 times).
　　For a total of 6 million in financial assistance for high school students
　　　If distributed to all 3 million high school students, 2 yen per person
　　　If we distribute to 12 selected people, 500,000 per person.
　　　The former produces nothing = poor cost-effectiveness.
　　　There are resources that come from unequal distribution of limited resources.
　There exists an experience that only a limited number of people can have.
　　You guys are in the midst of an ongoing experience of "attending Nada High School".
	　At the same time, you are in the midst of missing out on the ongoing experience of attending a co-ed high school.
　　You're missing out on the experience of attending a full-time high school and at the same time you're missing out on the experience of attending a correspondence high school.
　Which experience is more valuable?
　　This is uncertain: no one can foresee exactly what will be needed in the future.
　　If demand is equal, the market value will be higher if supply is lower.
　　Experiences without barriers to entry tend to have low market value = create barriers to entry to create high-value experiences

[quantity of options and quality of decision-making].
　We want to improve your future life decisions.
	To learn what influences the quality of decisions, a study of 83 management decisions made in a year and a half at a company with 1,380 employees asked the same management team eight years later about the quality of those decisions.
	More of the three options are "good decisions" eight years later than two options.
　On the other hand, in another experiment, when there were 6 options and 24 options, 24 options were more "impossible to choose."
　　In other words, choose the "do nothing" option.
　Techniques that can be used tomorrow
　　If you have two options and you're wondering, "Do it or don't do it," or "Do A or B," add a third option.
　　If you have a lot of choices and you're wondering "which one is the best", just toss a coin and narrow it down to a few.
　　　If you're worried about it, you're evaluating it to be as good as it looks at this point in the forecast.
　　　The downside of unconsciously postponing a decision is significant.

How do we increase our options?
　I've found it beneficial to increase the number of options when there are few.
　So how do we increase it?
　I asked questions for this talk and got answers from hundreds of people.
	　>About the choices you've made in your life that you think "made this choice better for the rest of your life," "How did you know about that choice?" Please tell us.
　　There are three main categories.

Get choices from those around you.
　[https://gyazo.com/26b25bb43cfc8ee90f9b1f2fe258c454]
　　Ask people around you to teach you.
　　Know what people around you are doing by watching what they do.
　These two get their information from the "people around them who know about options they don't know about".
　Need "people with different experiences" around you.
		Often "around me" are gathered "people like me".
		>"Homogeneity" is one of the key words to describe Nada High School.
			[Ah, Nada High School... the "after" of Japan's most studious children https://gendai.ismedia.jp/articles/-/545]
		Bringing people in from outside the school to speak is a solution to this problem.
	Example: High school teachers are not aware of the high need in the company despite the high demand.
		[https://gyazo.com/2b7d59bf5a2dbab24e567775add6e7b1]
		The following is a summary of the data from the survey: [Data from the analysis of the current status of human resources development in science and engineering https://www.meti.go.jp/policy/innovation_corp/entaku/pdf/data.pdf], Ministry of Economy, Trade and Industry, Industrial Science and Technology Policy and Environment Bureau, Office of University Collaboration, p.59 (Highlighted in red by Nishio).
	e.g. [which countries are driving the world economy today].
 	[https://gyazo.com/ca5e2c4d90d8318850e0d907725c7280]
		Japan, the U.S., and Lebanon are the only countries where the percentage of people who say "the U.S." has increased between 2008 and 2017 when asked "Which country is driving the global economy today?", and both the amount of increase and the percentage itself are greater in Japan than in the U.S. Japan believes that "the U.S. is leading the way" more than the U.S.
 	Japan is the only country in the original data where the percentage of "China is leading" has not increased.
		If you think of yourself as thinking about China in a way similar to the average in Japan, that is a very extreme way of thinking in the rest of the world.
　What you think is "normal" when you look at your surroundings is often not "normal" due to the bias in the scope of observation
　　How to solve this problem

Actively go outside the range of observation
　[https://gyazo.com/d5158dbd4ec1e1b06ebb5a35a7a24ad3]
　Realize that your scope of observation is limited
　Extend your range of observation by moving
　What are the specifics?
　　Transcend the "boundaries" of countries, regions, schools, etc.

[There is more than one summit.]
	[https://gyazo.com/ef544646bab765c46c3ec4be032320fc]
　Some of you may think that you are superior people.
　　In fact, as an observed fact, the top level in some measures such as exam math
　　But looking only at that one measure, it's a small world.
　How about IT utilization skills?
　　There are schools in the world that have been distributing iPads to all students for years.
　　There are high schools where class communication is on line, and students are using home-made bots to automate various tasks.
　　N High School started the "Regular Course Premium Course" this year.
			Oculus Quest2 を生徒に配布
			Students become avatars and take classes in a classroom in VR space.
		 VR time shift function (playback asynchronously)
　　I doubt this initiative will increase the percentage of N High School students going to Tokyo University, but I'm sure this experience will be beneficial in areas related to VR.
　As you can see, the world is a diverse place, and there are a wide variety of people of the same age who have had "different experiences" from you
　　To gain the unknown, one must be willing to appreciate the unknown

Impact of the new Corona
　Many events are coming online.
　　Opportunity for rural middle and high school students to bridge geographic gaps
　On the other hand, the "get middle and high school students together for a camp" type business is having a hard time.
　　Difficult to create opportunities to physically get together and have a good time
 　Challenging to what extent the online community can replace
 　Offline, just being present gives you a sense of presence, but online, a person who does not actively communicate is as good as "non-existent".

能動的に発信
　Humans are incapable of seeing the inner life of others.
　I can only see the output.
　[https://gyazo.com/14a3b4b035eb5eb61ef4be37d17050a4]
　　In order for them to give you information that matches you, they need to know what you want to do.
　　Need to have the skills to put into words and output
　Acquisition of skills requires practice.
　　Catching skills can be developed by trying to throw the ball, experiencing it not flying where you want it to, and correcting it.
　　The skill of verbalizing and communicating can also be developed by trying to communicate, experiencing that the message is not conveyed as expected, and then correcting it.
　　[For every adoption, there is a double rejection.]
　　　[Trial and error is hard to see.]

Those who did not have a choice.
　Some said they "didn't have a choice" in this survey.
　Some may not have really had a choice, as choices are not given equally.
　You assumed that "choices are given to you," and you didn't take action to obtain them.
　Have you avoided making choices of uncertain value by assuming that "the future value of an option is known at the time of the choice?"
　　A choice that has a clear and widely known value is competitive because many people will try to choose it.
　I hope that when you look back on your life in a couple of decades, you will not say, "I had no choice" or "I just ran on the rails that others had drawn for me.

Live your life independently
　Living to fulfill the expectations of others will not fulfill your own.
 　What do you want to do with yourself?
 　What do I want to be?
 　You have to think for yourself.
 　　No one but you can do it.
　　If you cannot verbalize it, it is difficult for others to help you
