I want to give the new version of Regroup a different name.
Regroup is a reimplementation of "grouping," which is inconvenient on paper and can be done electronically, hence the name.
In the new implementation, we felt that the grouping was not good as it is now, and that the current grouping was not the core of the functionality, so we considered giving it a different name.
Next action: Write down the current functionality and clarify what is essential.

[nisbot.icon]What would you like to see happen in this conversation?
I want to give a new version of [nishio.icon]Regroup a different name.
[nisbot.icon]What kind of "Regroup" is that "Regroup"?
[nishio.icon]A tool to write down and organize the contents of your mind
[nisbot.icon]What is the "content" of that "content"?
[nishio.icon]Fragments of thoughts and things that are on my mind.
[nisbot.icon]What "fragment" is that "fragment"?
[nishio.icon]Or words that haven't been deepened to the point where they can be properly explained.
[nisbot.icon]What "word" is that "word"?
[nishio.icon] probably related to what you're thinking.
[nisbot.icon]What kind of "thinking" is that "thinking"?
[nishio.icon]I'm looking for something because I have a problem I want to solve and I don't see a solution.
[nisbot.icon]What "solution" is that "solution"?
[nishio.icon]Not found yet
[nisbot.icon]What kind of "found" is that "found"?
[nishio.icon]ðŸ‘Ž has been found
[nisbot.icon]
 > I want to give the new version of Regroup a different name.
 Is there anything else about this "Regroup"?
[nishio.icon]Originally, the focus was on grouping, hence the name, but the more I used it, the more I felt that grouping was not the essence.
[nisbot.icon]What is the "essence" of this "essence"?
[nishio.icon]I'm tentatively reading it now as a tool for organizing my head, but it doesn't really fit that well.
[nisbot.icon]What kind of "tool" is that "tool"?
[nishio.icon] A tool for moving and thinking about fragments that have been exported or imported.
[nisbot.icon]Anything else about that "tool"?
[nishio.icon]I think it's important to have the freedom to move it two-dimensionally.
[nisbot.icon]
 > Tools to move and think about the fragments you have exported or imported
 Where is this "tool" located?
[nishio.icon]Right in front of you
[nisbot.icon]
 > Tools to move and think about the fragments you have exported or imported
 How do you know about this "tool"?
[nishio.icon]At first, it was an image of the KJ method, and it was a system of writing out with this tool, making stickies, grouping them and bundling them, but as I made and used the previous version, I came to understand it better and Keicho helped me with the writing out part, especially the grouping and folding functions. I don't use it much.
[nisbot.icon]What do you value?
[nishio.icon]It's good to have a clear head, probably a lot of extra features now.
[nisbot.icon]What kind of "head" is that "head"?
[nishio.icon]Thinking things
[nisbot.icon]
 > At first, it was the KJ method, and I used this tool to write things out, make stickies, group them, and bind them together, but as I made and used the previous version, I understood it better, and Keicho helped me with the writing part.
 Where is this "tool" located?
[nishio.icon]It's like a receptacle that catches the fragments that come out of your head without spilling.
[nisbot.icon]Anything else about that "head"?
[nishio.icon]If you keep it in your head, it's a blur, so you want to write it down, empty it out, and let it focus on other activities.
[nisbot.icon]Where is that "head"?
[nishio.icon]The first one.
[nisbot.icon]
 > If you keep it in your head, it's a blur, so you want to write it down and empty it out so you can focus on other activities.
 Where does this "head" come from?
[nishio.icon]Born
[nisbot.icon]
 > At first, it was the KJ method, and I used this tool to write things out, make stickies, group them, and bind them together, but as I made and used the previous version, I understood it better, and Keicho helped me with the writing part.
 What do you hope will happen regarding this "tool"?
I'm thinking of making a new version of [nishio.icon], but I feel like it's not a good idea to drag the old name around, and I need a good word to describe what I'm going to make.
[nisbot.icon]What needs to happen to the "tool" for that to happen?
I guess [nishio.icon]I guess it's about cutting down on functionality.
[nisbot.icon]What "function" is that "function"?
[nishio.icon]Currently, I've put in too many things that I thought would be nice to have, and it's a mess, so maybe I should write it down and organize it.
[nisbot.icon]
 > If you keep it in your head, it's a blur, so you want to write it down and empty it out so you can focus on other activities.
 How do you know this "head"?
[nishio.icon]ðŸ™
[nisbot.icon]
 > I guess it's about cutting down on functionality.
 Is there anything else you can tell us about this "feature"?
[nishio.icon]Writing out the functions to keep: make it a sticky, move it two-dimensionally, draw on it with a pen, zoom, make the sticky bigger, need a different form from the current implementation regarding grouping, making it a block that can be moved together is beneficial, the ability to fold it is insufficient
[nisbot.icon]Where is that "feature"?
[nishio.icon] It's in the source code, some of it is in the manual, maybe not all of it.
[nisbot.icon]
 > Write down the functions to be kept: make stickies, move them two-dimensionally, draw on them with a pen, zoom, make stickies bigger, need different form from current implementation regarding grouping, make them into blocks that can be moved together would be beneficial, fold function is insufficient.
 What does this "feature" look like?
[nishio.icon]It's like stationery, you can use it to help you think, but now it's scattered all over your desk, including the ones you don't want to use, and it's making your desk harder to use.
[nisbot.icon]What kind of "thoughts" are those "thoughts"?
[nishio.icon]The process by which humans create new things
[nisbot.icon]
 > Write down the functions to be kept: make stickies, move them two-dimensionally, draw on them with a pen, zoom, make stickies bigger, need different form from current implementation regarding grouping, make them into blocks that can be moved together would be beneficial, fold function is insufficient.
 How do you know this "function"?
[nishio.icon]The problem is that there are so many that we can't keep track of them.
[nisbot.icon]What "problem" is that "problem"?
[nishio.icon]Too much stationery.
[nisbot.icon]What kind of "stationery" is that "stationery"?
[nishio.icon]Tools to help organize your thoughts
[nisbot.icon]Where do these "tools" come from?
[nishio.icon]I've added more and more features as they came to mind.
[nisbot.icon]Where is that "feature" located?
[nishio.icon]In my head, in the source code, and in the manuals
[nisbot.icon]Where is that "head"?
[nishio.icon]I should write it out because I'm barely getting it right.
[nisbot.icon]
 > Tools to help you organize your thoughts
 What does this "tool" look like?
[nishio.icon]Stationery
[nisbot.icon]Anything else about that "stationery"?
[nishio.icon]It needs to be stable and usable, right now Regroup's pen function is broken, so to speak, and the pen is left out of ink, which is not good. For stress-free use, it should be a small number of well-maintained stationery.
[nisbot.icon]Where is that "stationery" located?
[nishio.icon]Let's write it down and organize it.
[nisbot.icon]What kind of "do" is that "do"?

https://keicho.netlify.app/#talk=ChV0JCfXeqvHtbyp5JcB