Ankle and calf stretches
[https://gyazo.com/7208518d3adb1b60a06a1c9258e997d5]


A. The one you see most often.
　The back ankle was done in A2, but with variations.
　There are two patterns: pattern p, in which the state is knocked down and the knees are pressed with the chest, and pattern q, in which the arms are pressed with the arms.
　The left side feels, dare I say it, hard on the back of the heel, but it doesn't feel like it's stretched too much.
　 It was A2p, but when I changed it to A2q, I got a stronger sense of growth.
　 I assumed it would be better to put my upper body forward, but I guess not.
　On the right, I just put my chest against my thighs and it feels like my calves are stretching without any particular effort.
　There are two patterns: pattern x with the buttocks on the heels and pattern y with the crotch open.
　　A2 had buttocks on heels, A1 and A3 cannot, different
　　When the right leg is opened, the left is painful in the hip joint
　　Toe stand is a bit of a stretch and a bit of an either/or with that toe stretch.

B
　Conscious of maintaining posture and unable to roll forward much
　It looks better to me if the back foot is turned inward because it's easier when the back foot is turned outward.
　　Originally, the calf is taut on the outside.
　Stabilize your upper body by putting your hands on the wall or holding the sofa railing.
　Upper calf, just below the knee, feels stretched.
　　In A, it was the lower half, so maybe the muscles that act on it are different.

C
 Difficult to heel in this condition
 Variants of this include raising the catching position and raising one leg
 　C2 is the one shown in [Illustration - Building Muscle in the Lower Body "Doesn't Make You Fat" and "Doesn't Make You Tired"].
 　C3 is a waist up from A. It was introduced in [Bend the ankle and the fingers warp].
 　　I do this, but it works the [hamstrings], not the calves.

D
 There are two patterns: pattern 1, where only the toes are on the stairs, etc., and pattern 2, where the heel is on the floor with the block on the floor.
 　I thought D1 was stretched tight with weight, but when I compare the two, D2 seems to be more stretched.
 　Maybe D1's fear of having to maintain his posture so he doesn't roll over causes his muscles to exert themselves and try to contract stiffly.

Gastrocnemius and soleus muscles
　[下腿三頭筋]
　　One is [soleus muscle].
　　 From the top of the lower leg
　　The other two are [gastrocnemius] (lateral and medial)
　　 From the femur
　　The end point is [Achilles' heel].
　[https://gyazo.com/feee42e1ebc2c2befa60cc9645282061]
　In A, the knee is bent, the gastrocnemius is relaxed, and only the soleus is stretched
　In B, conversely, the knee is extended, so the gastrocnemius is propped up first.
　　Especially hard on the outside, habit of walking?

Based on this, I think A is the only one that contributes to solving the problem of "stiff ankles and difficulty maintaining posture when squatting"

関連
　[Ankle bends, toes bow]
　[足首の可動域]
