Selective Marital Status and Innovator Theory
A series of interesting tweets by [Yoshihisa Aono] about [selective surname selection] and [innovator theory].
	Early Majority: The
		What is needed is rationality.
		Reiterate that the essence of the problem is the "emotional and financial burden associated with unwanted family name changes".
	Late Majority:.
		Need to "prove majority."
		lobbying action
		Media Surveys
	laccolith
		Emotional Appeal Needed
		Campaign to unseat opposing legislators

>[aono https://twitter.com/aono/status/1408961407312269312]: selective married couples from a marketing perspective. This issue has been pointed out for a long time, but has not been able to cross the chasm: it was raised once around the year 2000, but was unable to break through the barrier and was left by the Diet members.
> What broke the stalemate was the challenge by Kyoko Tsukamoto and others in the judicial arena: the decision by the Supreme Court to dismiss the case at the end of 2015 was widely covered in the media, and more people began to believe that if they did not act on their own, things would not change. I am one of them.
> After doing my own research on the reasons for the lack of progress, I understand that we are not marketing to the early majority segment. What this demographic needs is rationality. Therefore, I decided to reiterate that the essence of the problem is the "emotional and financial burden associated with unwanted family name changes.
> This argument allowed me to take advantage of my characteristics labeled as a male and an economic person. In addition, the logical correctness of the argument spread as recognition as Attorney Sakka rationally proved the "legal deficiency" of not being able to choose only at the time of marriage between Japanese nationals, despite the fact that one can choose whether to change one's family name at the time of divorce or at the time of an international marriage.
> As the rationale for selective surname selection was communicated to the early majority, more and more people began to express their support for it. This was especially noticeable among the younger generation, who are less imprinted with values and more willing to learn and understand. Every time I saw the response on the Internet, I felt that we were crossing a chasm.
> However, to move the Late Majority segment, "proof of majority" is necessary. This is where the petition action worked to a great extent. Petitions were adopted one after another in municipalities across the country, and each time they were picked up by the media, making it visible and widely known that there was already a majority in favor of selective surname selection.
> The media surveys have also been effective: around 2015, there was still a strong view that the "yes's and no's" were close, but as the Early Majority segment moved, various surveys revealed the reality that the majority was in favor of the proposal, and this was a factor in moving the Late Majority segment The early-majority voters have been the driving force behind the late-majority voters.
> The last is the laggard segment. Rationality does not work with this group, and they are suspicious of anything the majority says. What is needed is an emotional appeal. It is necessary to move their hearts and minds with candy and whips. The majority of the people in this group are not rational, but they are skeptical of what the majority says. You will be fine as you are now." Along with the candy, a whip approach is needed that says, "Many people are in trouble because you are still opposed to the selective surname system. It is time for this phase. I would like to finish it off by wielding the whip of a campaign to unseat the members of the House of Representatives who oppose it in the fall election.
> The above is the issue of selective marital status from a marketing perspective. Learning about business will help me in my social activism. We have finally crossed the chasm. Let's keep up the good work, and we are only one step away from the realization!
