A case study of a new sprout growing from a text that was dead due to social triggers.
Former title: [Social Triggers] Bringing [Dead Text] Back to Life

>[tkgshn https://twitter.com/tkgshn/status/1409159554831581185]: (I see Nishio's Scrapbox every day)
>I shared my tweet yesterday about the "systematization of the unknown" in the "Encyclopedia of the Unknown" without linking it to Nishio's past notes (I've been manually creating a lurking bot) [Hatena2010-06-11].

Philosophy not to [dead text warehouse
　But if the dead text is still sedimented with an old update date and time, there's no real harm done.
Get a hit on your search.
　[One pocket principle.]

[Import Hatena Diary to Scrapbox].
　This is an old experiment
[Import Hatena Diary to Scrapbox with past dates].
　Here is what actually took place in this project

Actual connections between "living topics" and past "dead texts" were discovered.
　What should happen at this time
　It's not good to have pages that don't have a proper title appear in the top updated list.
　[cut to a separate page if you want to line link to a longer text].
　Depends on whether you can give it an appropriate title.
　　If you can attach it, we can make it a living page.

This case had the apt title [Systematization of the Unknown].
　A search for this keyword yielded two blog posts.
		[Hatena2010-04-18]
		[Hatena2010-06-11]
　I copied the necessary parts and created a new page.

I noticed it later.
[Import Hatena Diaries to Scrapbox with past dates#6090e723aff09e0000fb61a4]
>Secure Override Operation
> When you update the script and convert it back, it's sad when you overwrite it and lose the human-written text.
> This anxiety prevents us from "keeping it updated".
> Don't change the machine-generated page, just create a page with a good title that can be duplicated when you want to change it.
　I originally assumed that this imported one would not be edited, I forgot.
　Thanks to the fact that it was a machine-generated "page with no proper title," it avoided editing itself.
　You titled this page "A case study of a socially triggered dead text brought back to life," which is incorrect.
　　I thought the dead text was not brought back to life?
　　Dead text is given a title that is easily recognizable as "It is dead text," thereby preventing direct human editing
　　　Scrapbox doesn't have such a feature, but I'd rather it be uneditable.
　　The dead text gave birth to a child.
　　　Dead text" was perceived as a metaphor for [dead fish], but mismatch
　　　Dead fish don't have babies.
　　　It's like [a new sprout growing from a dead tree] #dead tree
　　Changed the title to "A Case Study of New Sprouts Growing from a Socially Triggered Dead Text".
　[/rashitamemo/ the writer kills the information once and the reader resurrects it].
　　Books are dead text
　　The seeds in it can take root and sprout in the fields of the reader's heart.
　　　Dead texts are not brought back to life.
　　Some people chop up dead texts and put them on a shelf, that's not budging.
