shingles
I guess I better keep track.

2021-07-03
　I wake up in the morning and there's some kind of bump on the back of my lower back.
　of no concern at all
　I wondered if it was a mosquito bite, so I asked my wife to take a look and she said, "If it's a mosquito, it's under your clothes, but you got 10 bites all together, and if it's shingles, you'll have nerve pain for life if you don't treat it early," so I went to a doctor near our house.
　The doctor glanced at me and said, "It's shingles, I'll give you medicine for a week. Typical symptoms, apparently.
　Two days ago, I had an unusual severe headache, and in the evening I couldn't write the program anymore, so I warmed my eyes and neck and rested, now I think it might have been the effect of the virus growth.
　　https://www.healthcare.omron.co.jp/resource/column/topics/83.html
　　My shingles were neither painful nor itchy, and this time they were hard to see from myself behind my waist, so maybe they had occurred earlier.
　　　Sometimes the pain comes first. It depends on the person.
　　The connection is not clear at this time, but the same drugs would be prescribed to kill the virus.
　　Next time you have a similar headache, it might be a good idea to tell them "I've had shingles after a headache".
　Valacyclovir tablets 500 mg, 2 tablets after each meal
　　>Inhibits the growth of herpes simplex virus and varicella-zoster virus by inhibiting their DNA synthesis.
　　Concentration in the kidneys leads to kidney failure, so more water is recommended.
　>It takes about two and a half days for the virus to stop multiplying with antiviral drugs.
　 https://style.nikkei.com/article/DGXMZO22064740Q7A011C1000000/?channel=DF140920160927&page=2
　 >The biggest problem with shingles is the risk of residual effects called "postherpetic neuralgia. This is pain that appears three months after the onset of shingles and can last up to 10 years or more, with excruciating pain. Postherpetic neuralgia is more likely to occur in people with severe rashes, in the elderly, and when treatment is started too late.

Talk about not knowing the definition of rest.
　https://twitter.com/nishio/status/1411169164748722189?s=21


The story of a 14-hour videoconference that was all done separately and horizontally.
　https://twitter.com/nishio/status/1411320119972663301?s=21

2021-07-05 Mon.
　I kind of overslept and saw a complex sci-fi story in a shallow sleep, but when I woke up, I forgot about it.
　　In my dream I was thinking, "If we do this here, the structure would be interesting..."
　I wonder if people who stay in this state of mind become science fiction writers.
　I don't usually feel like I'm a very continuous shallow sleeper.

　What should we do about the meeting tomorrow, Tuesday?

2021-07-06
　Meetings were normally attended.
　Then he went back to sleep.
　By going to the hospital immediately on the first day of onset and starting medication in the morning, the symptoms seem to have passed.
　I think I'll be fine as long as I take my meds for the week properly.

2021-07-11
　The shingles itself is over after taking all the medicine, but that's not the case, my belly button, side, thighs, etc. sometimes hurt and make me feel bad.
　　It's like the nerves that feel pain are so sensitive that even a simple stroke on the skin can trigger them.
