社会的比較過程
[social comparison process]に対して西尾が仮に当てた訳語
[https://gyazo.com/de03231ee26afc285f1750a4af14343f]

>This article extends the findings in synchronous room-based electronic brainstorming about the impact of [social comparison process] on productivity and creativity in a web-based context of asynchronous electronic brainstorming. Social comparison was manipulated with a feedback informing group members of their respective contributions on the electronic brainstorming task through a shared table regularly updated by a facilitator. In another group, although participants had the possibility to identify each contribution within the newsgroup, they did not receive any feedback in a shared table. Results showed that both group productivity and group creativity are better in the social comparison feedback condition than in the other condition. It appears that social comparison process has a positive impact on productivity and creativity in a web-based context of asynchronous electronic brainstorming, but only when participants have access to a shared table facilitating the comparison among group members. This finding provides some useful recommendations for learning facilitators to improve productivity and creativity in the context of computer-supported collaborative learning over the Internet. It also invites to future innovative technological developments to improve participation in online groups.

[Improving productivity and creativity in online groups through social comparison process: New evidence for asynchronous electronic brainstorming]
[asynchronous electronic brainstorming]
[electronic brainstorming]
Michinov, N. and Primois, C., 2005. Improving productivity and creativity in online groups through social comparison process: New evidence for asynchronous electronic brainstorming. Computers in human behavior, 21(1), pp.11-28.
[Full Text https://www.researchgate.net/publication/222417377_Improving_productivity_and_creativity_in_online_groups_through_social_comparison_process_New_evidence_for_asynchronous_electronic_brainstorming]

Festinger, L. (1954). A Theory of Social Comparison Processes. Human Relations, 7, 117 - 140.
[PDF https://www.semanticscholar.org/paper/A-Theory-of-Social-Comparison-Processes-Festinger/7f8baa24bdbefb0c5b1a0a98a52fa34defad8258]
