Don't panic, but keep going.
>[https://twitter.com/drinami/status/1120597025492328448?s=21 @drinami]: one thing I sometimes tell students is "don't panic, but keep going."
	[稲見 昌彦]

>There are winners of various contests and presenters at international conferences around me, and I see world-class superheroes on the Internet, even if I don't like them, and when I compare them, I worry that I am nothing, and I feel impatient.

>If you are lucky enough to find a field in which you are truly interested, just keep going. If you can't see the future, just keep trying with what's in front of you that you've been given.
> Perhaps the deeper you learn, the more you may be tormented by the anxiety that there are great predecessors in every field who set the gold standard at a young age, and that you will never achieve anything by that age.
> But don't panic. Just as you become accustomed to walking along a street where you lost your way many times in the beginning, as you become accustomed to walking, you begin to see the plants and trees along the roadside and the faces of the people you pass by. And at some point, you will realize that there are still unexplored areas that your predecessors left undone and that can be solved with tools that are different from those used at that time.
	[認知の解像度]
	[can be solved with different tools than in the past].

> On the other hand, if you are in a hurry and aim for a reversal, you will not be able to see your surroundings well because you have no time to spare, and your desperate solution may actually be surprisingly similar to the template, and you will be cooked up by the adults who are aiming for a panicky person.
> Everyone longs for a job like laying a new highway in the wilderness, and it's beautiful. But giants of knowledge often leave in search of new wilderness. That is where the opportunity lies. Because time is equal for everyone.
> Some scenery can be seen by walking slowly along the road that the giants ran through. If you walk the road many times, you will see things left undone. There are still many things that are necessary and important in hindsight, such as putting up street lights, building drive-ins, planting trees, and cleaning up the streets.
> Dr. Sutherland, the founder of CG and VR, said that there were no longer any important issues in this field and moved on to asynchronous computer research, but looking at the current prosperity of the field, there was still much work to be done.
> Even if you are feeling uneasy about many things right now, don't panic, don't rush, and keep going, and you will surely be able to see the scenery. So, I want you to believe in yourself and keep moving forward.
> Not to anyone in particular, but a series of tweets about what I've been thinking the past few days.
> From the reactions, I see that everyone else had the same difficulties as I did...


