brainstorming
from [思考の結節点2021-07-03]
brainstorming
[Brainstorming]-related stories, I don't think I have it all together in a way that I can tell people right away.
　Brainstorming began with "people gathering in a room to verbally waiver and a record keeper recording all ideas.
　　1957 [Utilizing creativity].
　With the advent of computers, it was argued that doing it orally was inefficient.
　　The claim that anonymizing the speaker is beneficial (and subsequent research has not yielded very positive results).
　	1992 [Electronic Brainstorming And Group Size]
　This is a study that [Electronic Brainstorming] is better than brainstorming with audio in groups with a large number of people.
　Research results accumulated to show that the Nominal Group Technique, in which each person writes his or her opinion independently in advance of the discussion, is better.
		1991 [Productivity Loss in Brainstorming Groups: A Meta-Analytic Integration]
		1993 ["Computer Brainstorms: More Heads Are Better Than One"]
　Personally, I don't share much sympathy for this kind of research.
　　On the "not much difference when there are six people, but there is a difference when there are twelve" kind of result
　　　There's a sense that you shouldn't be brainstorming with that many people in the first place.
　　　　[2 pizza rule]: the idea that the maximum number of meeting participants should be 5-7
　　　I think in my own experience, the brainstorms that have yielded good results are often two or three people.
　　Research tends to be good or bad based on the amount of new ideas
　　　Often, when you use it to solve a real problem, you get a lot of ideas and then have trouble choosing between them.
　　　　[Jam experiment] The phenomenon of having too many options to choose from.
　　　　Opinion that brainstorming ideas should discover "assumptions that a lot of people fall into" and destroy them [SHIFT: The Art of Innovation].
　　　In real-world brainstorming [ideas that are not realized have no value].
　　　　Related: [value of ideas], [knowledge must be validated by practice].
　　　　I get the feeling that there is an "atmosphere" among related researchers that it is okay to measure the value of ideas by numbers because it is difficult to measure the value of ideas by "implementing ideas" in short-term experiments, but I feel that this is a typical example of [setting wrong KPIs].
　　　Evaluation of the novelty of an idea; ideas that cannot be realized appear more novel
　　　　[LEGO creativity experiment]
	Not in the direction of "good idea generation methods" but in the direction of "good communication methods" or something like that.
	　Participant Satisfaction
	　[Making the Most of Creativity] p.273
			>If the idea is adopted, report it to the people at the meeting and encourage them
			>Distribute a brief letter of appreciation from the beneficiaries of the proposal to all