Social Trigger 2021-07-10
Discussion of [social trigger
　[Why publish a personal project?]
		> [Social triggers] provide an opportunity to read back
  　>It is useful to compare the way you thought before and the way you think now and see what has changed and what has not
  　>I could write in a paper diary and look back at it every day for the last 6 months... I'm not a daily journal-keeper... I don't even read it back seriously and consistently.
  	> I'd like some kind of read-back trigger for those who do.
   　>"A reference to a past article" is a signal that the article remains worth mentioning over time.
   　>Other than that, I also think the [Facebook "This Day in the Past"] feature has value as a trigger.
		In other words, "tasks that cannot be performed spontaneously and regularly are triggered from outside" structure
　　　There is no reason to limit that "task" to "reading back".

There's a bit of a leap here.

　[public-private transfer] does not create a social trigger
　　[private-public transfer] produces
　　Destination must be visible
　Even PRIVATE can create social triggers if you invite people to join you.
　　Why public transfer?
　　Because you implicitly value triggers from a broad and unspecified audience rather than from a limited one.

There's one more jump here.

　Conclusion.
　　It would be interesting to machine translate this project into English or Chinese.

As long as you go back and fill in the gaps and write in Japanese, that is a trigger from the "limited number" of people on the Japanese side, so you might as well translate it into Chinese, English, and so on, which is the top native population for now.
　The third place, Hindi, I can't read at all.
On the other hand, it might be interesting to translate it into a language with fewer speakers

What I left out.
　[/intellitech-en/Intellitech: how to boost your creativity]
　I've translated the book [The Art of Intellectual Production of Engineers] halfway through and left it alone.
　I used to go to a manga cafe once a week to translate, but the new Corona made it impossible, and I didn't have any deadlines or anything, so I just stopped.
　　If it stops, it's a dead fish.
　　Can't we move it with a social trigger?
　I really want to put the content of the Japanese version of the book into this Scrapbox, but I can't because the publisher is against it.
　　I tried to do it in English for now, with the book content in Scrapbox.
　　　The challenge of representing the form of the book in Scrapbox and the challenge of translating the book into English combined to make it difficult.

design
　This project -> English version of Nandemoiri Project
　　Machine-translated items are marked with a machine-translated icon
　　　If the page already exists and is not marked with a machine translation icon, it should not be overwritten."
　　Add an announcement at the end of the page with CSS
　Translation Projects
　　Add an icon indicating that this is a book translation project

One more thing I forgot to mention.
　I tried this.
　　[/rashitamemo/Scrapbox allows others to "koo" the cards].
　There were fresh surprises.
　　When I first switched over, I was just like, "Oh, I remember when I wrote this.
　　Not much of a surprise here.
　　　Well, it works as a social trigger in the sense that it creates an opportunity to go back and read past articles.
　　I forgot to put it back in sort order and worked on writing the page, then went back to the listing page.
　　Implicitly, I was expecting to see "the page I just edited" and "the page I edited before that" side by side here.
　　　Since it was a one-person project, this expectation was always fulfilled, and I didn't even realize I had such an expectation.
　　　But in reality, while I was working, someone else visited and looked at some of the pages.
　　The image of a fog box
　　　https://ja.m.wikipedia.org/wiki/霧箱
　　　We don't name particles and identify them individually.
　　　We don't know "who saw it."
　　　Just (charged particle|someone) can see the trajectory of the path

relevance
　[Scrapbox Englishization Project]
