diversion
The word "diversion" is laced with negative interpretations, but I think you should delve into more specifics instead of stopping your thinking there.


Triggered Articles
　[/blu3mo-public/ diverting people's knowledge].


　Copying someone else's work and publishing it under your name:.
　　NG because it is an infringement of copyright.
　Cite the source clearly and cite the appropriate amount of information: (e.g., "The following is a list of the authors of this article")
　　The copyright law explicitly says it's OK.
　　[published material may be cited].

　There are sometimes book authors who vaguely claim that "it is also bad manners to recapitulate the contents of a book in your own words" while citing examples of things that are clearly NG.
　　NG in terms of manner" is like saying "I can't give you a reason why it's not okay, but I don't like it."
　　　If not, show me the evidence.
　　　[It is bad manners to impose manners.]
　　Vaguely saying "it's not a good idea" will suppress even unproblematic behavior.
　　　I wish these claims would go away, especially since it is a [crime against civilization] to hinder the intellectual production of others.
　　　This is my personal "I hate myself" statement.

　The problem that summaries made in the course of the study do not meet the citation requirements, at least not at the time they are made.
　　I know, this is an important question, and I have a solution for now, but it's not something I'm certain of.
　　Prescription 1: Mere statements of fact are not copyrightable.
　　Prescription 2:.
　　　Statements that are not mere summaries of facts, in other words, are merely the author's interpretation.
　　　When you're trying to put this interpretation in your summary, you might want to ask yourself why you're trying to put it in.
　　　　Especially when you're disagreeing or questioning something, you can write your opinion or question and the citation requirement will be fulfilled.
　　Prescription 3: Copyright law is basically a parenthetical, so it's not NG unless the copyright holder says it's NG.
　　　As for the partially decriminalized case, for this purpose, it doesn't meet the requirements.
　　　 https://ja.m.wikipedia.org/wiki/日本の著作権法における非親告罪化
　　　When I look back and think about what I do, I don't always do it in a way that's 100% OK.
　　　If the author gets mad at me, I'll just apologize and act like I'm sorry.
　　　　[The principle of "Don't ask permission, apologize.
　　Prescription 4: Do it in the U.S. and claim fair use.

---
 What does the term "diversion" mean?
 　I get stuck when I try to translate it into English.
 　When I looked in the dictionary, I could only find a translation of "to distribute goods illegally" or
 　I'm applying the word "diversion" to this broad concept [Galapagos concept].
---
 [Is information distribution diversion?]
 　We had another discussion on "diversion" in 2019.
