2021 Cleanup.
前回2018年
　[paper storage], [paper document organization tools], [paper document organization methods].

Looking back after 3 years
　Paper made [paper document organizer] is good.
　　The best part is that it can be folded and compacted when there is "free space" after rearranging or replacing the contents.
　　If a storage tool fails to "adapt" to changes in the quantity ratio of the items being stored, the tool itself becomes "bulky trash".
　　　Occupies a large amount of space
　　　It is important to be able to fold it up when it is no longer needed.
　Three can fit against a square box of [Muji pulp board boxes https://www.muji.com/jp/ja/store/cmdty/section/S00809].
　　Not in the previous version, but now [drawer https://www.muji.com/jp/ja/store/cmdty/detail/4548076249276] has been added.
　demerit
　　If left in a place with an open top for 3 years, dust will accumulate.

Fundamental.
　Operated for 3 years and eventually "left in place" because there was "no use" for most of them.
　　No need to keep it in the residence.
　　Send to [miniclass
　　　You can keep a box of book kits for $275 a month.
　　　　If you "put it out" online, they'll get it the next day, and if you "take it with you," they'll bring it in the next day.
　　　Last time I sent 3 boxes to Minicra 3 years ago and took them out once in 3 years.
　　　I did +3 boxes of book kits this time and +2 boxes of normal
　If you make a box with miscellaneous items, it will be left untouched.

　Paper also has the "test of time."
　After three years, you may wonder why you kept this stuff, or conversely, you may say, "Oh, interesting that you kept this stuff, let's put it all in this box.
　　You should keep the year, month, and date on it.
　　　Some of it was written right the first time, but some of it was cut out and not written.
　　　When I made it, I thought, "You don't need it because you can tell by the title of the activity," but after three years, I don't know when that was.
　　　　Of course you can look it up, but it's a pain in the ass to look it up, so just write it down.
