Young people who want to keep their internal value low

>[yontengoP https://twitter.com/yontengoP/status/1419266092791308289]: I was scared of a lot of things when I heard the story and
>In the end, I was surprised to find myself saying "I see, that's true..." and I wrote a NOTE!
>Young people who "want to keep their value within the company as low as possible.
	[Young employees who "want to keep the value of their existence in the company as low as possible" | Yontengo P｜note https://note.com/yontengop/n/ne3db96c946d0]

>[yontengoP https://twitter.com/yontengoP/status/1419250043958169602]: a young man who "wants to keep his value within the company as low as possible"? I'm listening to an employee."

>[yontengoP https://twitter.com/yontengoP/status/1419268495162761219]: No, seriously, I think that some people might say, "Young people these days lack motivation, enthusiasm, and drive! I know that this is a bit of a stretch, but after listening to the conversation and thinking about it, I think that the other side is doing the right thing.

>[yontengoP https://twitter.com/yontengoP/status/1419269243179180039]: I thought this young guy was much smarter and wiser than me, who started working 24 hours a day on weekdays and holidays as a new graduate without knowing what I was doing. I thought this young guy is much smarter and wiser than me, who worked 24 hours a day on weekdays and holidays like an idiot.

>[yontengoP https://twitter.com/yontengoP/status/1419270683087949824]: If there really are many young people who have this value (= do minimal work inside the company, achieve results outside the company and go elsewhere), then the company's training and motivational talks for new graduates would not be understood at all if they are not revised and improved at a rapid pace. If there really are a lot of young people with this value (i.e. they want to do minimal internal work and get results outside the company), then the training and motivational talks we do for new graduates would have to be revised and improved at a rapid pace to be understood.

>[yontengoP https://twitter.com/yontengoP/status/1419304722494681091]: Also, I know this is a different direction from what we're talking about here, but isn't the idea of "one's existence value ≒ how one is in the company" or "one's existence value ≒ how high one's market value is" old-fashioned? I've also received some comments that "my existence value ≒ how I am in the company" or "my existence value ≒ my market value" are old fashioned. I have also received opinions that "my value ≒ how I am in the company" and "my value ≒ how I am in the market" are old-fashioned, and I think that's true. (I can't find my value outside of work...!).

>[nishio https://twitter.com/nishio/status/1419493066176561154]: Some people may be appalled when I say that I want to lower my internal reputation, but when I think about "whether to use my limited time and energy to enhance [internal reputation] or to enhance [external reputation]," the former was a rational choice until the illusion of "[lifetime employment]" was created, in which the company would survive and continue to employ you for the long term. The former was not a rational choice until the illusion of "lifetime employment" was created, in which the company would survive and continue to employ you for a long period of time.

>[nishio https://twitter.com/nishio/status/1419494032498040832]: Only when there is a combination of "lifetime employment" where the company keeps you employed and "[seniority]" where it is more beneficial to stay in one place, the strategy of "increasing internal evaluation without increasing external evaluation" becomes reasonable. The strategy of "increasing internal evaluations without increasing external evaluations" becomes reasonable.

>[nishio https://twitter.com/nishio/status/1419498506784362501]: So, as to the main question of the original article, what should the company do, the cost of "seniority" is higher than before due to the increase in healthy life expectancy and the decrease in the birth rate. The cost of "seniority" is higher than before due to the increase in healthy life expectancy and decrease in birth rate, so it is not possible to reduce employee turnover in that way. There are ways to reduce employee turnover by, for example, allowing flexible work arrangements and making it easier for employees to return to the company.

>[nishio https://twitter.com/nishio/status/1419501902534897675]: I'd just like to add here that "the cost of seniority is higher than it used to be", which makes it difficult to maintain seniority except for companies that have established a stable source of income. It is difficult to maintain seniority except for companies that have established a stable source of income. There are companies that do maintain it. Some companies are sacrificing lifetime employment to "restructure older workers whose seniority has become too costly.

>[nishio https://twitter.com/nishio/status/1419502735867531273]: Well, even if we could maintain lifetime employment and seniority, the "laggard ratio increases due to changes in population distribution" as we were talking about before, and in the long run See [chasm and population].

>[nishio https://twitter.com/nishio/status/1419503375226269701]: The time until extinction varies greatly depending on the state of the income base, so it is not irrational to choose to continue with the idea that you will be fine in the short term (=while you are alive). It is not irrational to continue to do so.