scrapbox-keicho
A [listening chat system] that runs on Scrapbox, by [/takker].
It can be used without any hindrance. Great.

2021-06-28 [/takker/popupMenu asking Keicho for a selection].
2021-06-30 [extension to use Keicho with /blu3mo-public/Scrapbox].
	[Extension to use Keicho with Scrapbox].
2021-07-29 [PopupMenu asking Keicho for a selection].
	[Ctrl+Enter in Scrapbox to have Keicho ask a question].
	[/takker/scrapbox-keicho]
	>A hotkey & multi-line & feedback button support is now available [takker.icon].
		[running Keicho on /villagepump/Scrapbox#6103a646aff09e0000ddb533]
2021-07-30
 [/villagepump/discuss with Keicho what to do today (original)]
 Hope you can verbalize why [/villagepump/scrapbox-keicho is interesting].
 	copy [I wish I could verbalize why scrapbox-keicho is interesting].
 	>[/nishio/nisbot.icon]What kind of "new experience" is that "new experience"?
  > That's what I'd like to know, but for now, what I've learned so far is that "multiple humans" is the unusual part, so maybe it's better to get involved in other people's logs instead of using them this way, I'll try it!
	[/villagepump/discuss with Keicho what to do today (interrupted)]

Filling in Keicho
Keicho starts with the objective question in normal mode, but now that we have a UI that runs on Scrapbox, we can experience a way to start that is not so.
　[/villagepump/discussing with Keicho what to do today (interrupted)#6103b420aff09e0000e087c3]
　I honestly thought it was going to be more "non-conversational chaos," but surprisingly it wasn't.
　　So I thought it would be a good idea to add an API that would make it easier to pour.
　　　But I felt that it would be better to use the phase-in mode to flow in rather than batch flow in (and wait a long time for a response), so that the flow-in side can provide feedback on the progress.
　I continued with the thought that "surprisingly conversational" might just be too little conversation.
　[/villagepump/discussing with Keicho what to do today (interrupted)#61056b8baff09e000021f53c]
　consideration
　　If B joins the conversation after A has spoken, the current bot does not distinguish between humans, so it will ask B questions about keywords that A has already delved into, with an attitude of "of course you've thought this through regarding this keyword, right?
　　B can't answer the question well because he hasn't actually thought it through (although he thinks he knows it from reading the logs) with respect to that keyword.
　Maybe it's important that the question is asked and answered so that it emerges in a tangible form on the surface of our thinking.

[running Keicho on /villagepump/Scrapbox#6103a646aff09e0000ddb537]
	It's okay to have a conversation from Scrapbox with the logs, because Keicho's side has the same memory as on Scrapbox, but if the page is written on Scrapbox side, Keicho's side has no memory, so I'm not sure what to do.
 　The use case could be both.
 　　I'm writing in Scrapbox and I'm stuck on the line I'm writing and I need a question on the line I'm writing.
 　　I'm writing in Scrapbox and I've finished a piece of writing, but I want to improve it, so I want you to ask me questions wherever you like.
 　　　A possible workaround for this would be to start with all of the Scrapbox content in "listen first" mode.
 　[nishio.icon]On this one, I thought it would be natural to express which range you want the bot to know by selecting a range and starting
 　　Just a bad idea to make the selection a single statement.
 　　　The quotes are per statement, so if you make a statement that has one page, you'll get a one-page citation every time you make a statement.
 　　So if some large area is selected the first time, it seems like it needs to be handled as "put it in phase mode and make it a one-line statement at a time".
 　　Conversely, if you can do that, I think you can suddenly start Keicho from all selections on any page in the past and "quote the line you are most interested in and ask a question".

