Conversation after pouring memories on Scrapbox into Keicho
from [running Keicho on /villagepump/Scrapbox].
Conversation after pouring memories on Scrapbox into Keicho

It's okay to have a conversation from Scrapbox with the logs, because Keicho's side has the same memory as on Scrapbox, but if the page is written on Scrapbox side, Keicho's side has no memory, so I'm not sure what to do.
　The use case could be both.
　　I'm writing in Scrapbox and I'm stuck on the line I'm writing and I need a question on the line I'm writing.
　　I'm writing in Scrapbox and I've finished a piece of writing, but I want to improve it, so I want you to ask me questions wherever you like.
　　　A possible workaround for this would be to start with all of the Scrapbox content in "listen first" mode.
　[nishio.icon]On this one, I thought it would be natural to express which range you want the bot to know by selecting a range and starting
　　Just a bad idea to make the selection a single statement.
　　　The quotes are per statement, so if you make a statement that has one page, you'll get a one-page citation every time you make a statement.
　　So if some large area is selected the first time, it seems like it needs to be handled as "put it in phase mode and make it a one-line statement at a time".
　　Conversely, if you can do that, I think you can suddenly start Keicho from all selections on any page in the past and "quote the line you are most interested in and ask a question".

[nishio.icon]Let's give it a try!
Listen first.
https://keicho.netlify.app/#talk=vqdsChYjEFQvnIADU3V3
[/nishio/nisbot.icon]Yes
It's okay to have a conversation from Scrapbox with the logs, because Keicho's side has the same memory as on Scrapbox, but if the page is written on Scrapbox side, Keicho's side has no memory, so I'm not sure what to do.
[/nishio/nisbot.icon]「Keicho」
The use case could be both.
[/nishio/nisbot.icon]"Use Cases"
I'm writing in Scrapbox and I'm stuck on the line I'm writing and I need a question on the line I'm writing.
[/nishio/nisbot.icon]「Scrapbox」
A possible workaround for this would be to start with all of the Scrapbox content in "listen first" mode.
[/nishio/nisbot.icon]「Scrapbox」
On this one, I thought starting with a range selection would be a natural way to express which range you want the bot to know about.
[/nishio/nisbot.icon]"Bot"
Just a bad idea to make the selection a single statement.
[/nishio/nisbot.icon]"Statement"
The quotes are per statement, so if you make a statement that has one page, you'll get a one-page citation every time you make a statement.
[/nishio/nisbot.icon]"Statement"
So if some large area is selected the first time, it seems like it needs to be handled as "put it in phase mode and make it a one-line statement at a time".
[/nishio/nisbot.icon]"Statement"
Conversely, if you can do that, I think you can suddenly start Keicho from all selections on any page in the past and "quote the line you are most interested in and ask a question".
[/nishio/nisbot.icon]「Keicho」
the end
[/nishio/nisbot.icon]What would you like to see happen in this conversation?
I would like to try to have a conversation after pouring over existing sentences that are not in conversational form on Scrapbox in phase mode.
[/nishio/nisbot.icon]What kind of "Scrapbox" is that "Scrapbox"?
Unlike chat, it's a bulleted wiki, so users seem to be in a different state of mind when they write.
[/nishio/nisbot.icon]
 > > I'd like to try to pour in existing sentences that are not in conversational form on Scrapbox in a dialogue mode and then have a conversation with them.
 Is there anything else you can tell us about this "Scrapbox"?
Especially with wikis that are co-edited by multiple people, there are cases where the text that flows into the wiki is written by multiple people.
[/nishio/nisbot.icon]What do you value?
This is an unanticipated use, but that's why I want to find some potentially interesting and useful use for it.
[/nishio/nisbot.icon]
 > > I'd like to try to pour in existing sentences that are not in conversational form on Scrapbox in a dialogue mode and then have a conversation with them.
 How do you know about this "Scrapbox"?
I already have a few bullet points written down, and I'd like to move the conversation forward by having the bot ask questions about them.
[/nishio/nisbot.icon]
 > > I'd like to try to pour in existing sentences that are not in conversational form on Scrapbox in a dialogue mode and then have a conversation with them.
 What do you hope will happen regarding this "Scrapbox"?
If Scrapbox had an API that could be written to programmatically, it would be possible to realize a bot that would ask questions on its own without a human being having to activate it...
[/nishio/nisbot.icon]What needs to happen to "Scrapbox" for that to happen?
API needs to be added
[/nishio/nisbot.icon]With regard to "Scrapbox", can it?
I don't think I can.
[/nishio/nisbot.icon]
 > > If Scrapbox had an API that could be written to programmatically, it would be possible to implement a bot that would ask questions on its own without a human being having to activate it...
 Where is this "Scrapbox" located?
Beyond the barriers that make participation difficult from the perspective of autonomous bots.
[/nishio/nisbot.icon]What kind of "bot" is that "bot"?
Unlike humans, they can be active 24 hours a day.
[/nishio/nisbot.icon]
 > > If Scrapbox had an API that could be written to programmatically, it would be possible to implement a bot that would ask questions on its own without a human being having to activate it...
 Where does this "Scrapbox" come from?
It comes from Nota. I'm not the one making it, so I can't add an API to it.
[/nishio/nisbot.icon]
 > > If Scrapbox had an API that could be written to programmatically, it would be possible to implement a bot that would ask questions on its own without a human being having to activate it...
 Where is this "Scrapbox" located?
On a server in Nota. Oh, and if you sign up for on-premise, it might come in the form of a Docker image and you can put it on the server of your choice.
[/nishio/nisbot.icon]
 > > If Scrapbox had an API that could be written to programmatically, it would be possible to implement a bot that would ask questions on its own without a human being having to activate it...
 What does this "Scrapbox" look like?
Communities that marginalize people with certain handicaps.
[/nishio/nisbot.icon]
 > > Beyond Barriers to Participation from the Perspective of Autonomous Bots
 Is there anything else you can tell us about this "bot"?
They are expected to behave like ordinary homo sapiens, and since they can't do that, they can't join the community.
[/nishio/nisbot.icon]
 > > Beyond Barriers to Participation from the Perspective of Autonomous Bots
 Where is this "bot" located?
They're on a different server than Scrapbox.
[/nishio/nisbot.icon]
 > > Beyond Barriers to Participation from the Perspective of Autonomous Bots
 Where is this "bot" located?
In other words, they are in a location that is not directly accessible, and maybe that is the problem?
[/nishio/nisbot.icon]
 > > Beyond Barriers to Participation from the Perspective of Autonomous Bots
 What does this "bot" look like?
People who can read, but whose handicap blocks their means of participating in conversation.
[/nishio/nisbot.icon]What kind of "handicap" is that "handicap"?
I can't open a browser and write (and I was thinking, after writing all this, if I look at the communication when I paste one line and imitate it, can I write one line like I want to do this time?)
[/nishio/nisbot.icon]
 > > Beyond Barriers to Participation from the Perspective of Autonomous Bots
 What do you hope will happen regarding this "bot"?
Now, the user can only write in the open text area and cannot decide where to write himself. While in a bulleted wiki, I am only able to add a flat line at the end. It would be nice to be able to write anywhere at any time, just like a human being.
[/nishio/nisbot.icon]What needs to happen to the "bot" for that to happen?
So the world (Scrapbox) side is inconvenienced but not changed, so the self (bot) side needs to change? I wonder if it will be possible to achieve cursor movement on the browser, or if it will be possible to mimic network communication when adding a line to an arbitrary position.
[/nishio/nisbot.icon] With regard to "bots", can it be done?
Both seem like a lot of work, but it could be done.
[/nishio/nisbot.icon]
 > > So the world (Scrapbox) side is inconvenient but won't change, so my (bot) side needs to change? I wonder if it will be possible to achieve cursor movement on the browser, or if it will be possible to mimic network communication when adding a line to an arbitrary position.
 How do you know these "bots"?
(Exit)

Impressions [nishio.icon].
　Not much of a "question for what you've poured in" kind of thing.
　The keywords selected are "Scrapbox", "bot", and "handicap", so it looks like we've narrowed it down to the core of the topic.
　　You've rather narrowed it down too much and are repeating the same questions for the same keywords.
