Stockdale's Paradox
The paradox that [optimists] cannot continue to believe in an optimistic outcome.
https://ja.wikipedia.org/wiki/ジェームズ/stockdale
 I was a prisoner of war, but I kept believing I would be freed.
　>Served in the U.S. Navy in the Vietnam War and spent eight years as a prisoner of war.
　>I never lost faith in the outcome. Not only will I get out of here, but I'll be victorious in the end and be able to say that this experience was the defining event of my life and that it was the most valuable experience I've ever had" (Visionary Company 2 - The Law of Leap Forward).
　　What person could not do it?
　　>"They are optimists. Yes, they are the ones who filialize that they will be out by Christmas. Christmas is coming, and it will be over. Then they think they can get out before Easter. Then Easter comes and goes. Next comes Thanksgiving, and then Christmas again. Disappointment piles up and they die." (Visionary Company 2 - The Law of Leapfrogging)

This is only a seeming paradox because the meaning of the word "optimist" is ambiguous.
　Those with [disprovable] [optimistic] observations that "they will be liberated by Christmas" will have their optimism hurt by having it [disproved].
　'Eventually you'll be liberated and be able to say it was a good life experience' is a claim that cannot be disproved while you're still alive."
　　This one who thinks, without evidence, that "it will work out in the end" can also be called [an optimist].

[Faith is better when it is irrefutable.]

In [adversity], can you believe that "this is a [God-given test] and that you will overcome it in the end, and that you will grow afterwards?
　"[God] only gives us trials that we can overcome."-Acts of the Corinthians.
　[Job]

When you can't get approval from others.
　I am the one who is ultimately approved
　There is something wrong with the person who does not approve.
　There have been many such cases in the past.
　Can you believe it?

orthographical variants
　[optimistic] [optimistic] [Stockdale paradox].
