Nodal Point of Thought2021-08-06
time management
　The impact of apathy is significant.
　　[Motivation is a valuable resource.]
　What is the source of energy?
　　enjoyable
　　interesting
　　　[KJ method for "interesting"]

What is the difference between interesting and fun?
 Funny: headstrong?
　Fun is the more primitive emotion.
　Need to do the KJ method of fun.
　面白いはinterestingが混ざってる
　　When you did the KJ method, which is interesting, you must have done a head-to-head analysis.
　Games are fun.
　　There is not much "fun" in watching cartoons, why?
　　Because of the content we're receiving passively?
　　Is fun proactive?

In English?

What is sociable?
　People who don't care what others think of them.
　I know you think you're not social, but some people don't think so.
　　https://twitter.com/nishio/status/1423589549754654725?s=21

世界大百科事典 第２版「社交」の解説
>Literally, it means the association between people, social intercourse, and the world, but from a sociological point of view, it is taken as the starting point from which society is formed. For example, the sociologist G. Gimmel, in his work on the process by which groups and societies are created through the interaction of individuals, or social formation process (socialization Vergesellschaftung), postulated a pure type in its form, and applied the concept of "sociability Geselligkeit" to it. G. Gürbig also considered "sociabilité," or social negotiation, as a component of social reality.
 I'm not sure.
　The definition of "sociable" is vague.

Someone with different tastes?
　Who doesn't have a preference in the first place?
　　People who complain about the world all the time don't seem to like it.
　　But that person recognizes that "some people like this kind of thing."
　　cognitive distortion

>Although often equated with sociability, the English words sociality and sociability are sometimes applied to sociability as separate concepts.
 https://ja.wikipedia.org/wiki/社会性
　社会性と社交性の関係は？

小学校
　"Lunchtime, everyone, play nice."
　Even though I want to read a book alone!

入手難易度の違い
　入手難易度は主観的
　Differences are the foundation of business

I enjoy writing software.
　Glad to know it's being used.
　It's interesting to see them used in unexpected ways.

diet regime
　If it doesn't work, they run away and go somewhere else.
　Frustration when expectations are not met because they expect to get it easily.

uninteresting story
　Not my experience.
　interesting person
　boring person

商売
　It's not about having fun.
　It would be fun to sell.
　　Happy? Not happy?

Program
　I'm "happy" but not "happy" when someone uses a program I made and left alone unexpectedly.
　The end of the story?
　　Is "Oh, I used to" not "fun" because it's not a proactive action?
　If I make it, I'm not interested in what happens afterwards.
　　It's not the end of the world if you make it.
  People who do not want to operate
  　Tend to release in a way that does not operate
　Doesn't software die if you don't keep maintaining it?
　　They will die in the long run, but how fast depends on technological options.
　　iOS apps will die quickly if they don't keep up with OS updates.
　　Static HTML+JS lasts longer because browsers cannot easily discard past specifications too soon
　　Maybe they don't want to do maintenance, so they prefer low maintenance cost methods.

Is the organization also a product?
　Maintenance costs are high.
 Operation of the organization, people like it.
 　Not everyone you like is the right person.

Teacups are not maintained, why?
　Because the required specifications have not changed?

No maintenance costs for the creator
　Woks and knives, users pay maintenance costs.

high brand
　High value for money by maintaining it all the time.

Is there software for which users pay maintenance costs?

If something is fun to make, it's done collecting when you're done making it.
　There is no reason to pay the cost to operate it.
