What would you like to see happen by creating Kozaneba?
[nisbot.icon]What would you like to see happen in this conversation?
I want to talk and organize because I noticed a blurring of what should be done by creating [nishio.icon]Kozaneba.
[nisbot.icon]What kind of "Kozaneba" is that "Kozaneba"?
[nishio.icon]Digital stationery for organizing thoughts, sequel to what I've been reading about Regroup and Movidea.
[nisbot.icon]What kind of "Movidea" is that "Movidea"?
[nishio.icon]Regroup was complicated because it was created through trial and error, so it was rebuilt from scratch.
[nisbot.icon]What kind of "Regroup" is that "Regroup"?
[nishio.icon]I created this to electronically support the process of organizing your mind while moving information fragments around.
[nisbot.icon]
 > Regroup's trial-and-error approach made it so complicated that we had to rebuild it from scratch.
 Is there anything else about this "Regroup"?
[nishio.icon]The lack of test code made it difficult to add functionality when the project reached a certain scale, and since it was not designed for easy testing, it was also quite difficult to test it once it was in that state. It was difficult, so we had to rebuild it with thorough testing.
[nisbot.icon]
 > Regroup's trial-and-error approach made it so complicated that we had to rebuild it from scratch.
 How do you know this "Regroup"?
[nishio.icon]I'm preparing an interim presentation right now, and I've already told you about Regroup, and I don't think you need to know about it in the future.
[nisbot.icon]Where is that "Regroup" located?
[nishio.icon]👎Regroup
[nisbot.icon]What kind of "get ready" is that "get ready"?
[nishio.icon]Thinking about the presentation. The above is why I reworked it, but when I tried to write an explanation of why I created Kozaneba in the first place, I realized that this was a blur in my mind.
[nisbot.icon]Anything else about that "Kozaneba"?
[nishio.icon] I was thinking, "I'm going to make a tool that I want to use," but that's not consistent with the idea that the flow is difficult for new users to understand, so let's rework it.
[nisbot.icon]What kind of "flow" is that "flow"?
[nishio.icon]I tried to make it so that people who visit the website for the first time can understand how to use it without me standing next to them and explaining it to them.
[nisbot.icon]What kind of "tutorial" is that "tutorial"?
A step-by-step explanation of what [nishio.icon]Kozaneba is for and how to use it
[nisbot.icon]Where is that "Kozaneba"?
[nishio.icon] Now released for test users, accessible but not widely announced
[nisbot.icon]What kind of "announcement" is that "announcement"?
[nishio.icon]Trigger for unspecified people to use it where I'm not looking, so I have to introduce Sentry or something before then, which I haven't done yet.
[nisbot.icon]What kind of "Sentry" is that "Sentry"?
[nishio.icon] A tool for users to know when an error occurs at their end that I did not anticipate.
[nisbot.icon]What do you value?
[nishio.icon]That's the point. I initially developed Regroup with the idea of "making a tool that is easy for me to use," and when I tried to tell people how to use it, I thought, "No, it's too hard to tell people how to use it with the current system," so I redeveloped it. Obviously, what people find valuable has changed since the beginning. I haven't been able to dig deeper into that, but if I put it into words for now, it seems that they feel value in "being used by many people.
[nisbot.icon]What kind of "tool" is that "tool"?
[nishio.icon]Oh, well, I've gone from doing it on paper myself to doing it on Regroup, and I think it's a useful tool, but maybe I want to make sure that it's not a "one-size-fits-all" assumption that a lot of people are using it.
[nisbot.icon]Anything else about that "tool"?
[nishio.icon]When people other than myself start using it, they use it in ways I did not expect, and my thinking sometimes develops from that stimulus. For example, running Keicho on Scrapbox. I see, the buds that are born can grow by the hands of others, and you want to create opportunities for growth for Kozaneba.
[nisbot.icon]What kind of "I" is that "I"?
[nishio.icon]The entity that created the tool
[nisbot.icon]Where is that "tool" located?
[nishio.icon]While it's in your hands while you're using it alone, when you put it in a form that others can use, it leaves your hands and moves in many different places and in many different situations.
[nisbot.icon]
 > The entity that created the tool
Where is this "tool" located?
[nishio.icon]Now we have it in hand.
[nisbot.icon]What does that "tool" look like?
[nishio.icon]I realized from talking to you that this is a metaphor for "child". The more you travel, the more you grow.
[nisbot.icon]What kind of "do" is that "do"?
[nishio.icon]👎.
[nisbot.icon]
 > Where can I find this "tool"?
How do you know about this "tool"?
[nishio.icon]I'm a creator, but I don't know all of its possibilities. Others use it in unexpected ways that lead to knowing it better.
[nisbot.icon]What do you hope will happen regarding that "tool"?
[nishio.icon]It is good when it is used by others to make it better. This is also good for the purpose of my own use. Two blurred stories came together!
[nisbot.icon]What needs to happen to the "tool" for that to happen?
[nishio.icon]It needs to be publicly available, it needs to be used by a variety of people with different background knowledge, and the information associated with its use needs to be fed back to the author
[nisbot.icon] With regard to the "tool", can it?
[nishio.icon]We will proceed with that policy!

https://keicho.netlify.app/#talk=tnF4HbhGXeVG1eFrWeQC