pProject
this way
　When did you start trying
　　[pRegroup]?
　　What was the trigger?
　　>2019-06-08
  > pKeicho
  > Project note on the listening chat system (Keicho)
  > Context: [project task management with Scrapbox].
		2019-05-22 [Scrapbox to manage project tasks].

　How things have changed.
	2021-03-11
 	>Task management for projects with Scrapbox
 	>2021-03-11 see [updated status indicator should be a pictogram at the beginning of the title].
  > Looks good, so I'm going to move closer to this in the future.
　In [pRegroup] and [pKeicho], tasks are cut out into individual pages.
　　Seemed like a good idea at first glance, but it seems like a garbage dump that went bust.
　　What went wrong?
　　2021-06-18
　　>[Network of demand requests] needed to be created.
  > That should have been a priority over managing task status in Scrapbox.
　Around 2021-08-10
	　I didn't pin it on.
　While actively tinkering with the project, he was "[floating] near the surface."
	　　When it sinks, you say, "Huh? Where was I?" and then it becomes
　　>~This is a hub page for personal notes on the project
　　 and started pinning it down.
　　Specifically, translation projects

　For translation projects, the title was in Japanese.
　　Later exchanges with reviewers were [pIntEn], but not much use was made of them.
　　The work logs were in the "one page, dated and written in a row" format.
　this
　　In [pMovidea], it's basically one page a day in the form of a "Date Movidea Development Diary.
　　　When the volume is small, I sometimes add to it without changing the page.

consideration
　What is and is not a task
　　Specification fragments
　　It would be nice to have this feature."
　　　This is not a task, but you describe it as if it were a task.
　　　Over time, a pile of "tasks that I'm not sure why I need to do"
　　If you have a lot of tasks, you may be prematurely tasking things that should not yet be tasked
　past, present and future
　　Keep a diary of your work.
 　　easy to write
　　It has the advantage of being able to look back on it later.
　　Basically, "past."
　　　The "future" is mixed in there.
　　　Should we just dwell on the future part?
　　Short-term future-past cycle
　　　The pattern of writing down "what I will do today" or "I'm going to do this now" and then executing them.
　　　　At the time of writing, it's in the future, soon to turn into the past.
　　　　There is merit in writing this.
　　　　Clarify by declaring what you will do.
　　　　When you try something and it doesn't work out, you change the policy. At this time, there is a log that says, "I tried to do X, there was a problem called Y, I changed my mind to do Z.

pKeicho Reflection
　Maybe "[the project page] has to be reworked periodically.

2021-08-20
　I had multiple pProjects pinned to the top, but they were less beneficial for the area they occupied.
	So I made a design change to create [pProjectIndex] and pin this one, and the others can be skipped from here.

Examples of others
	[/blu3mo-public/pKineto]
