2021-08-13Keicho→Keichat Diary
 Keicho's guggrability is too low.
 Combined with the word chat, keichat?
 Then [nisbot.icon]'s name is Kei.
　What if Kei tweets?
　　Sometimes he asks me questions.
　Grab the link in the tweet and ask "Is this X the same as that X? Are they different?" and asks.

I've been neglecting to take screenshots of the explanations because I've tweaked a lot of the UI, but the functionality is looking STABLE and I'll take them back while I'm fixing Keichat.
I don't know if there were any particular UI features that I wanted to rework.

Oh, I see, there was talk of casual access control being breached.

Review [pKeicho
　It's involved in [pProject], but there's a sense that we're in a rather dysfunctional situation.
　2021-03-29 [Kanban in Github Project, imho].
	I tried Kanban, thought it wasn't good enough to separate the location of the information, and then tried to do Kanban on Scrapbox!
	The fact that the task is on a page, and it remains on the page after it's completed, makes the list of links from the main page futile.
	　The Problem of Too Large Links
	Lump the finished product on a separate page, far away and let it sink, or
	Still, too many links.
	　The page that was created by writing on pKeicho and then cutting it out is "from pKeicho" and keeps the link.
	　What is the solution to this?
	　　Just rename and sink the current pKeicho and create a new pKeicho.
	　　In this case, we were just talking about changing the name from Keicho to Keichat, just in time.
	　　Just create a new [pKeichobot] and sink pKeicho.
　Maybe "[the project page] has to be reworked periodically.
	Made it, then what do I do?
	　[https://gyazo.com/6ea9b2e5b786499b072d82081af57145]
　If we copy and paste the contents, the incoming link will disappear and we'll only have the outgoing link.
　　[https://gyazo.com/4dab94671b058653aa3d63baaa6ef5d7]
　　This time, I didn't think much of it and made it as a new creation, but I could have used Duplicate.
　　In that case [Duplicate functions as an operation to delete an incoming link
　I tried.
　　All the links are now showing up without abbreviations.
　　Forty-three.
　　Uh, maybe we should do this when we can line up Scrapbox pages in Kozaneba?
　　　I was thinking of using it to organize the KJ method page, but I think more people would be more sympathetic to the situation where the project page got messed up with links and you want to organize it.

