There is no job without anxiety.
[https://twitter.com/anatomygiraffe/status/1427529310160572416?s=21 Meku Gunji, giraffe researcher (@AnatomyGiraffe)]
>Whenever I give a talk to junior high and high school students, I always ask them, "Weren't you worried about going into a maniacal field? or "Weren't you worried about choosing an unstable job?" I am always asked questions like "Weren't you worried about going into a maniacal field? I feel that "[how to deal with one's own insecurities]" is a very important skill, although I feel that it does not receive as much attention as the ability to build relationships with others.
	>I think it is important to know the root of anxiety within oneself and to deal with it well, because it is impossible to make all kinds of anxiety disappear.
 > Today's middle and high school students may be sensitive to "[social instability]" because they are the sons of the generation during the ice age of employment.
 >As for "anxiety about choosing an unstable occupation," I had quite a few classmates who changed jobs within a few years of starting their careers, so I thought, "There seems to be no such thing as an absolutely stable occupation anymore. If that is the case, I thought that doing something fun would be closer to my happiness.
 >As for "anxiety about going into a maniacal research field," the more people there are in research, the more competition there is, so I didn't feel "anxious because I am a maniac. Rather, I have an image that [royal] fields seem to be more difficult... I think that a niche and maniacal field would have been more suitable for my personality.
 >I am also often asked "What are some of the difficulties you have faced in your research? This is because the joys of research are often difficult for a third party to relate to, whereas the difficulties of research are often "easy to understand," such as hard work and human relations.
 > I'd rather hear about the fun than the hardship~!
 >By the way, I have given a relatively wide range of lectures, from private elementary and junior high schools to public junior high schools, from JST-subsidized projects to events at local children's centers, etc., and this is a question that is asked universally everywhere. I have never been asked by adults, so there may be a common view among working people that "[there is] no job without anxiety.

[more competition in select major areas].
[Anxiety]
