divergence and convergence
>[koh_izuremo https://twitter.com/koh_izuremo/status/1431440169773592580]: Scrapbox is becoming established as a place to throw in more and more thoughts that pop into my head, but in my case, they are spread out all over the place. I don't have much of a sense of convergence. So sometimes I feel like writing long sentences, and even though I have a lot of material here, I feel like I'm going to get stuck in my head. No, it's not just my imagination.

>[rashita2 https://twitter.com/rashita2/status/1431447710016540679]: I think there is no need to force convergence, or rather an attitude that is neither divergent nor convergent, but it's a long story so I'll get back to it somewhere else.

>[koh_izuremo https://twitter.com/koh_izuremo/status/1431480305701904390]: I'm starting to want to write longer sentences from time to time, and I'm a little nervous that I've never tried to write by looking at some thought fragments side by side. I've never done that before. Maybe it's similar to the feeling of freewriting in an outliner, categorizing, and then stopping at the end of it. Oh well, I'll worry about it after I try it. lol

>[rashita2 https://twitter.com/rashita2/status/1431486874560827397]: I think that having some experience in thinking and creating fragments would be of some use in writing (even if I don't refer to those fragments directly), I have a feeling that this is the case.

>[nishio https://twitter.com/nishio/status/1431453735096512512]: The terms "divergence" and "convergence" are vague expressions that include various concepts. I think that "a place where associative links are stored and will never decrease" and "a place where only a part of the links are copied from the network and further removed" should be two different things, because it would be a waste to throw away the associative links that we have taken the time to collect. I think. Even in the latter place, new links are often created in the middle of the work, so it would be nice to have a tool that makes it easy to write them back.

I have been using paper stickies as a "one-dimensional place" for a long time, and wrote about them in detail in "(5.2) How to organize too much information" in "The Intellectual Production Techniques of Engineers". Then, I decided that it was inconvenient to use paper stickies, so I started to create [Regroup], which has now been taken over by [Kozaneba].
