It is a false dichotomy to divide references into good and bad.
>[tomoyaman https://twitter.com/tomoyaman/status/1429657648991854594]: there are two kinds of people in this world.
>"It is in the other's interest to argue."
> and those who think
>"Arguing is an attack on the other side."
> and those who think.
>Hell when the two intersect. (Miscellaneous dichotomies)

>[nishio https://twitter.com/nishio/status/1429660592441233408]: Both of these are the same in that they care about the interests of the "other" person. If there is room for improvement in the opinions published in the world, the improvement should be published for the sake of the world.
 >[elf https://twitter.com/elf/status/1429663944205996035]: yeah right
 >I feel that this is not understood unless there is a certain understanding of the culture of open source and its community activities, for example, and that there are many more people who have this kind of misunderstanding (who try to judge either interest or attack), and basically, there are so many things that these people don't understand. I think.

>[nishio https://twitter.com/nishio/status/1429661607173394437]: When you see a technical article written incorrectly, and you point out that it is incorrect, it is not "to attack the writer" or "to give the writer knowledge There are people who think that it is a good thing for the world that incorrect information is corrected. I think there are a rather large number of them.
	>[koizuka https://twitter.com/koizuka/status/1429662520772481024]: yeah yeah, I act like "if there's a problem with people reading it being taken off their feet, I want to fix it", but I don't really attack the person who wrote it or anything. People make mistakes, you know.
	>[drken1215 https://twitter.com/drken1215/status/1429671236829782021]: even though I know this, when someone points out an error, my first reflex is to try to see the other person's good or bad intentions ....... Usually, right after that, I can see that the other person has neither good nor bad intentions. ......
	>[keno_ss https://twitter.com/keno_ss/status/1429949323966500866]: I guess it's more about road maintenance than trail maintenance.... I think it's more about road maintenance rather than trail maintenance...like pulling over pebbles when you find them so that cars and bicycles can drive comfortably.

>[nishio https://twitter.com/nishio/status/1429662297195094019]: people who assume that making a reference is "communication to a human being" are asking this type of reference, "Is it an attack? Is it good faith?" but this is a [false dichotomy].
	>[tomoyaman https://twitter.com/tomoyaman/status/1429668435479339008]: ah, this is certainly assuming "a place that is not observed by others".
	>[nishio https://twitter.com/nishio/status/1429669103120257028]: I see, I was imagining a public place, so on the other hand, I was thinking "even if someone sends me a DM after I make such a reference, I'm not really interested in that person per se, so I was thinking "I don't necessarily want to communicate with them" or something like that.
	>[tomoyaman https://twitter.com/tomoyaman/status/1429673918600597506]: My stance is almost the same as Nishio's when it is a public place, but I still think it is context dependent, for example, if I get a response from someone else with the same content I think it is difficult for me to react when I receive a response from another person with the same content. I can respond because it is Nishio-san, but at least for me, the other person (context) is a factor that cannot be ignored.
[self-conscious bug that thinks it's an air rip]