Keichobot, a chatbot that brings out your ideas
This is a chatbot that helps people to draw out their "ideas that have not yet been clearly verbalized" and put them into words.
　[Watch the lecture video (7 minutes): https://scrapbox.io/nishio/%E3%81%82%E3%81%AA%E3%81%9F%E3%81%AE%E8%A9%B1%E3%82%92%E8%81%9E%E3%81%84%E3%81%A6%E3%81%8F% E3%82%8C%E3%82%8B%E3%83%81%E3%83%A3%E3%83%83%88%E3%83%9C%E3%83%83%83%E3%83%88Keichobot] 2021-12-07

Specifically.
　The program [kei.icon] (Kei) and a human chat with each other
　Kei extracts key phrases from human statements and asks questions about them
　When people are asked questions, they think more concretely, from a different perspective, and their thinking develops.
　Repeating this will turn vague thoughts in your brain into an observable chat log!
　Often in this process, I realize that I have assumed something or made an oversight by thinking only from a particular point of view!

[** how to operate]
	[* Getting Started]
		[https://gyazo.com/52921e6c31e22a1c74ae45091b0df943]
 	Accessing https://keicho.netlify.app/ will bring up a chat-like screen
 	　There is no account registration.
 	Kei begins by asking you, "What would you like to see happen in this conversation?" Kei first asks you, "What do you hope to get out of this conversation?
 	　You answer it and the conversation begins!

	[* Usage]
	　Type a sentence in the input field and break the line to make a statement.
 	The program will select keywords from your statements that you might want to dig into and ask you questions about them.
 　　The first time may take about 10 seconds.

	[* End]
	　There is no end to the dialogue.
　　You may disregard and leave the program question at any time.
　　Open the menu by clicking on the three-line button in the upper left corner and select "Share...". This will give you the URL of a page (log screen) where others and your future self can view your logs.
　　	[** [https://gyazo.com/81aa4447b7241516db313f08429ecbff]]
　　	 [** → [https://gyazo.com/90c14cec93f9f27851de804dc8a4db90]]
　	  [** →[https://gyazo.com/0d9f7d7ee8480210e9d36f71ea301e97] ]

[** Tips on how to make the story more interesting]
　One of the tricks to expand a conversation between humans is to [Answer, Add, Ask].
　This is "not only answer their question, but also add additional information and then return the question to them.
 　In this chat, Kei is the one who asks the questions, so you don't have to Ask.
　　You not only answer the question, but you can expand the conversation by adding further information.
　If Kei's question is out of line with what you want to talk about, you can direct Kei's attention by adding more information than answering the question, or by ignoring the question and talking about what you want to talk about Kei will decide that the words that come up repeatedly are important to you.

[* When to use it]
　It's like when the author wants to organize his thoughts about something, he walks around and talks to Kei on his smartphone and says something like, "I want to organize about X" and interacts with him!
　　For example, when you are struggling with how to achieve a particular goal in a program you are developing, you might ask, "What would you like to see happen?" Or, "It would be nice if we could come up with a policy on how to implement the
　[Example of Keichobot Conversation Log] shows how the author uses this system

Other Functions
　[Paste log to Scrapbox]
　[Keichobot:Advanced Usage].
 object-oriented mode
 　Kei asks general-purpose questions, but it may be easier to imagine how to use the system if it is specialized for a specific purpose, so we created a purpose-specific mode as an experiment!
  [Writing support mode]
  [Reflection support mode]
  [proposal support mode to make].

[** FAQ]
 Handling of written submission data
 　No third party will read the URL unless you give them the "Show URL to share".
 　　Specifically, the 20-character randomly generated ID attached to the URL is used to identify the dialogue
 　Example: `https://keicho.netlify.app/#talk=yAJxKTwc1ryiUTUbihUA`
 　The developer (Nishio) can read
 　　I intend to use it for machine learning training data.
 　　If there are many people who do not like this, we will consider offering it as a paid plan.