I would like to think about a non-chat form of Keichobot

[/nishio/kei.icon]What would you like to see happen in this conversation?
[/nishio/human.icon]I would like to think about a non-chat form of Keichobot
[/nishio/kei.icon]What kind of "Keichobot" is that "Keichobot"?
[/nishio/human.icon]Originally called a chat system to encourage verbalization, some users used it for Scrapbox instead of chat, which made me think that there could be a form that is not a chat system.
[/nishio/kei.icon]What kind of "chat" is that "chat"?
[/nishio/human.icon]While Kozaneba is called "digital stationery for organizing thoughts," this one is a chatbot for "drawing out thoughts.
[/nishio/kei.icon]Anything else about that "chat"?
[/nishio/human.icon]I was originally positive about chatting because it has the effect of drawing information out of humans through repeated exchanges between programs and humans, or focusing humans on a single subject for a certain period of time, but there are some disadvantages, so we should explore other forms of chatting. However, there are some disadvantages, so it would be better to explore other forms than chat.
[/nishio/kei.icon]Where is that "chat" located?
[/nishio/human.icon]The image of being in front of the user and interacting with them. The new form is not like that.
[/nishio/kei.icon]
 > I was originally positive about chat because it has the effect of repeatedly interacting with programs and humans to extract information from humans, or to focus humans on a single subject for a certain period of time, but there are some disadvantages, so we should explore other forms of chat as well.
 Where is this "chat" located?
[/nishio/human.icon]The current chat is like going to a chat room when you have a purpose and saying, "I have this kind of consultation.... The new form is not like that, but rather, the bot side talks to you, or when you reload your timeline in your spare time, the bot is tweeting there.
[/nishio/kei.icon]What does that "chat" look like?
[/nishio/human.icon]Face-to-face communication with physical restraints
[/nishio/kei.icon]
 > The current chat is like going to talk to someone when you have a purpose and saying, "I have this kind of consultation..." The new form is not like that. The new form is not like that, but the bot side talks to you, or when you reload your timeline in your free time, the bot is tweeting there.
 How do you know about this "chat"?
[/nishio/human.icon]Somehow made it into a form of chat, no deep meaning.
[/nishio/kei.icon]What kind of "shape" is that "shape"?
[/nishio/human.icon]How communication should be. Do different human needs for bots take different forms?
[/nishio/kei.icon]What do you value?
[/nishio/human.icon]The fact that it is a form of chat has no deep meaning, so it is not good if we get caught up in it and overlook the benefits of the new form. In short, I feel that the value lies in the fact that software facilitates intellectual production, and that the means should not be limited to chat.
[/nishio/kei.icon]Where does that "chat" come from?
[/nishio/human.icon]This is rather clear, and it is obvious that reworking ELIZA with today's technology would create value, because even the technology at the time was valuable.
[/nishio/kei.icon]
 > The fact that it is a form of chat has no deep meaning, and it is not good if we get caught up in it and overlook the benefits of the new form. In short, I feel that the value of the software is that it encourages intellectual production, and that the means should not be limited to chat.
 What do you hope will happen regarding this "chat"?
[/nishio/human.icon]As for chat, it seems to have stabilized in a certain ecological niche, and there is currently no opportunity to break through the barriers. It would be nice if bots were forced to adapt to a different environment than chat, thereby providing an opportunity for new evolution.
[/nishio/kei.icon]What needs to happen to "chat" about it?
[/nishio/human.icon]We should stop chatting once
[/nishio/kei.icon]
 > The fact that it is a form of chat has no deep meaning, and it is not good if we get caught up in it and overlook the benefits of the new form. In short, I feel that the value of the software is that it encourages intellectual production, and that the means should not be limited to chat.
 Is there anything else you can tell us about this "form"?
[/nishio/human.icon]Twitter bots that push notifications, Twitter bots that tweet without human interaction, Twitter bots that read multiple people's Scrapboxes and tweet their thoughts, services that return questions when you pass articles such as Scrapbox, task management system task decomposition support bot.
[/nishio/kei.icon]What is the relationship between that "bot" and "chat"?
[/nishio/human.icon]It's been tightly coupled, but it should be detached.
[/nishio/kei.icon]
 > The fact that it is a form of chat has no deep meaning, and it is not good if we get caught up in it and overlook the benefits of the new form. In short, I feel that the value of the software is that it encourages intellectual production, and that the means should not be limited to chat.
 Where does this "form" come from?
[/nishio/human.icon]Things that humans want others to do, but when actual humans do them, they are not done unless both parties benefit, and there are forms of communication that are possible because one party is a bot.
[/nishio/kei.icon]What is the relationship between that "form" and "chat"?
[/nishio/human.icon]For example, in a chat, I can start a chat because I want to go for a walk now, without the other person's convenience, and I can take as much time as I want to reply, or I can go into a convenience store, but the bot will reply without making the human wait.
[/nishio/kei.icon]Is that "bot" the same as "chat"? Is it different?
[/nishio/human.icon]Right now, a bot is just a program that acts as such a chat partner, but essentially it is a system that can read a coherent text, find keywords, and produce output based on that information.
[/nishio/kei.icon]What happens to the "chat" when its a "bot"?
[/nishio/human.icon]Chat has transformed from a tool for communication between equal individuals to a stationery tool that a single person can use to organize his or her thoughts.
[/nishio/kei.icon]
 > Right now, a bot is just a program to deal with that kind of chat, but essentially it is a system that can read a coherent text, find keywords, and output based on that information.
 What kind of "bot" is this "bot"?
[/nishio/human.icon]Programs that interact with the environment through input and output
[/nishio/kei.icon]
 > Right now, a bot is just a program to deal with that kind of chat, but essentially it is a system that can read a coherent text, find keywords, and output based on that information.
 Is there anything else you can tell us about this "bot"?
[/nishio/human.icon]Now they are moving passively in response to stimuli from the user or losing their memory every time, but maybe it would be better if they move actively or keep their memory?
[/nishio/kei.icon]
 > Right now, a bot is just a program to deal with that kind of chat, but essentially it is a system that can read a coherent text, find keywords, and output based on that information.
 Where is this "bot" located?
[/nishio/human.icon]Right now I'm trapped in a chat system. I want to unleash it into the wider world.
[/nishio/kei.icon]
 > Right now, a bot is just a program to deal with that kind of chat, but essentially it is a system that can read a coherent text, find keywords, and output based on that information.
 What does this "bot" look like?
[/nishio/human.icon]Well, you're human.
[/nishio/kei.icon]
 > Right now, a bot is just a program to deal with that kind of chat, but essentially it is a system that can read a coherent text, find keywords, and output based on that information.
 Where do these "bots" come from?
[/nishio/human.icon]Humans developed intelligence because using it was advantageous for reproduction, but that "advantage" was not limited to objective things like obtaining food, but also included subjective things like winning the appreciation of stakeholders necessary for reproduction
[/nishio/kei.icon]
 > Right now, a bot is just a program to deal with that kind of chat, but essentially it is a system that can read a coherent text, find keywords, and output based on that information.
 How do you know these "bots"?
[/nishio/human.icon]I don't know, I don't understand, stupid people can't understand what the end result will be, and in a development process that stupid people try to understand and control, the ceiling is set by the creator's ability, so we should let that go.
[/nishio/kei.icon]
 > Right now, a bot is just a program to deal with that kind of chat, but essentially it is a system that can read a coherent text, find keywords, and output based on that information.
 What do you hope will happen regarding this "bot"?
[/nishio/human.icon]I hope it evolves into a form that humans never expected.
[/nishio/kei.icon]What needs to happen to the "bots" for that to happen?
[/nishio/human.icon]It needs to change by contingency, not by human design of how to change it.
[/nishio/kei.icon]With regard to "bots", can it?
[/nishio/human.icon]We have to design it so that it can be changed by contingencies.
[/nishio/kei.icon]
 > I hope it evolves into a form that humans never expected.
 How do you know this "form"?
[I don't expect it, so after it changes, I look at it and say, "Oh, I see, this is the way it's supposed to look.
[/nishio/kei.icon]Is that "form" the same as "chat"? Is it different?
[/nishio/human.icon]Obviously not.
[/nishio/kei.icon]
 > Because you don't expect it, you see it after it changes and say, "Oh, I see, this is the way it's supposed to look.
 What does this "shape" look like?
[/nishio/human.icon]Well, it's an organism, and we'll know after it changes if it can adapt to its environment.
[/nishio/kei.icon]
 > Because you don't expect it, you see it after it changes and say, "Oh, I see, this is the way it's supposed to look.
 What would you like to see happen with respect to this "form"?

https://keicho.netlify.app/#talk=hDuC4X3C0bTlxMJgLoXc