Covers tuition expenses for employees
>Amazon.com, the largest U.S. Internet retailer, announced on April 9 that it will pay full college tuition for 750,000 hourly employees working at its distribution centers in the United States. As competition for human resources intensifies ahead of the year-end sales season, the company is expanding its benefits package to help secure manpower.
> The program covers college tuition, fees, and textbooks after 90 days of employment, starting in January. The program will apply to degrees at hundreds of educational institutions in the country. The program will also cover related costs such as programs for high school diplomas and English language certification for employees whose native language is not English.
> There had been a program in place to cover 95% of tuition costs for hourly workers, but this was reviewed as competing retailers are expanding their support in the education sector.
> U.S. discount store giant Target began a program in September to pay all tuition fees for college students who work part-time and other jobs. In July, Wal-Mart, a major U.S. retailer, announced that it would pay 100% of tuition and book fees for college students.
https://www.nikkei.com/article/DGXZQOGN100BX0Q1A910C2000000/

>[fladdict https://twitter.com/fladdict/status/1436185219162206254]: how to read it....I guess it's a matter of judgment, but I wonder if it's a precursor to the "corporations taking on welfare and becoming mini-states" direction. I read it as....
	>[fladdict https://twitter.com/fladdict/status/1436191090034372620]: largely, "competitive use of cash" became an issue as international tax policing became stronger. So, investing resources in acquiring talent came up as an option, including a basis for maintaining competitiveness and lobbying against society and government...I wonder if this is the case.

>[nishio https://twitter.com/nishio/status/1436272003858657289]: I guess it's not like I started suddenly, but more like I'm gutting it out because if I don't do it, I'll lose.
>> The company has always had a program that pays 95% of tuition for hourly workers, but has reviewed it as competing retailers are expanding their support in the education field. twitter.com/fladdict/statu...