Motivation System2013-09-14Unorganized Ideas
from [Motivational Systems2013-09-14Facebook].
Motivation System2013-09-14Unorganized Ideas
	[https://gyazo.com/48d4e95e3be528f6df0e715a39b1c902]
　Are you working in a team?
　　Are the results of that task dependent on others?
　　Is there anything that would be a problem for others if not done quickly?
　Highly stressed?
　　Do you feel anger at your situation?
　　Take a step back and observe your perceptions and feelings.
　　Calmly assess your situation.
　Unmotivated to work on changing something?
　　Unclear how to judge whether the results of changes are good or bad
　　Cannot refactor without testing.
　　I don't know if the change will improve things.
　　I'm not sure if I'm getting what I want to get.
　　Difficult to undo if changes are not successful
　　　That's why I hesitate to make changes.
　　　Cannot refactor without version control
　Is that "doing" action?
　　Deciding" and "thinking" are not actions.
　　Reading a book" is also rather gray.
　　What content does any part of my body move during the execution?
　　　at the time of the image, but I'm not sure this method of judgment is appropriate.
　　　If you're tired, you might as well "go to bed."
　How do you explain when you delegate that task to someone else?
　　Expressed in easy-to-understand language
　　What exactly do I need to do?
　　What it does it for.
　　You're not motivated because the instructions on the TODO list are difficult to understand.
　I look at social networking sites while working.
　　Does the task require an Internet connection?
　　　→NO -> Let's go to an environment with no Internet access.
　　　→ YES → Can we proceed partially without an Internet connection?
　　　　Can we prepare using an internet connection now so that we can proceed with some of the
　　　　Example: For example, if you need to do some research and work on the Internet, why not finish the research first so you can work offline the rest of the time?
　Let's divide the task
　　I'll just do the preparation first.
　　Write down anything that might be relevant to the task
　　What is missing to do the task?
　Isn't this a task that no longer makes sense to do?
