Segmentation of experience
(Translation by Nishio) Conceptualization and expression are separate from experience and feeling. Experiences and feelings have a meaning that is separate from conceptualization and expression. This is called "felt meaning. The conceptualization or expression may or may not be appropriate for that "felt meaning. What is the relationship between this conceptualization or representation, or to put it another way, "structuring with symbols," and the "felt meaning"? There are a variety. In the chapters ahead in this book, I will take a closer look at the function that "felt meaning" has in cognition by scrutinizing these relationships.
[https://gyazo.com/b43abb82a94b14a1759b2e6df255a25b]



--- source
[Experiential Processes and the Creation of Meaning] p.79-80
[https://gyazo.com/3ce7c9c29d8657e582a06b2aacbb601e]
[https://gyazo.com/450f1c4e65de4e9df9d4d7fa9635d64a]

original
>It is evident that all these views imply our problem: the sense in which experience or feeling has meaning apart from conceptualization and expression, such that the latter two could possibly be adequate to it. (7)
>(7) We can restate this problem as follows: what relationship or relationships exist between a felt meaning and a symbolic formulation? We shall investigate the function of felt meaning in cognition precisely by investigating such relationships, and we shall find them various.

The original text isn't very coherent, but you're trying to translate it, and it's not very clear.
　Experiences and feelings
　Conceptualization and representation
　They're separated.
　Meaning away.
　Conceptualization and representation
　May be appropriate.
　　[nishio.icon]May not be appropriate
　Felt Meaning
　Structuring with Symbols
　What kind of relationship?
　in cognition
　Feature
　There's a lot going on.
　By scrutinizing
　scrutinize

[https://gyazo.com/b43abb82a94b14a1759b2e6df255a25b]
(Nishio's translation) Conceptualization and expression are separate from experience and emotion. Experiences and feelings have a meaning that is separate from conceptualization and expression. This is called "felt meaning. The conceptualization or expression may or may not be appropriate for that "felt meaning. What is the relationship between this conceptualization or representation, or to put it another way, "structuring with symbols," and the "felt meaning"? There are many different ones. In the chapters ahead in this book, I will take a closer look at the function that "felt meaning" has in cognition by scrutinizing these relationships.

[Segmentation of [experience].
