Transcription in Programming
The term "[sutra]" for "learning to type in sample code by yourself instead of copying and pasting it" in programming was used at least as early as 2005.
Mr. Kakutani's is the earliest recorded.
The inventor is unknown because the expression was already in use as an accepted expression among several programmers at this point.

 >[kosaki55tea https://twitter.com/kosaki55tea/status/1429052902945943554]: Today someone pointed out to me that my name appears on the "sutra" page of wikipedia. What's that? Rock.
 	[https://ja.wikipedia.org/wiki/写経 Shakyo - Wikipedia]
 	 >"[Programming language is "Shut up and copy sutras" - Kernel Hacker, Toshihiro Kozaki (4) https://cybozushiki.cybozu.co.jp/articles/m000319.html]". Cybozu.com. Viewed January 31, 2021.

 >[nishio https://twitter.com/nishio/status/1439079549266919436]: ugh! But I'm sure there are books that mention sutra copying as a way for programmers to learn before this article.
 　In this article, Nishio interviewed Mr. Ozaki, who described it as "sutra copying" in the hope that it would be understood without explanation, and while I understood that one word, I also asked a question of elaboration because there would be readers who would not understand.

 >[kis https://twitter.com/kis/status/1439080992531124230]: I think Kakutani-san or someone like him might have said this long ago, since at this point it's commonplace to call program inputting a transcript. (I have an image of "the one who popularizes such a strange word")

 >[kis https://twitter.com/kis/status/1439081294479036419]: https://kakutani.com/20050723.html#p01
 	[https://kakutani.com/20050723.html#p01 This summer, sutras are coming, earthquakes are coming - Kakutani HTML-ization plan(2005-07-23)]
   > > ■1 Flage & Jellyfish This summer, sutra copying is coming.
   > "Futenai Linux Programming" by "Futenai" Aoki is a flageolet at Shosen Book Tower. Distributed and Web Programming with dRuby" by Kent Beck of Nasu is a jellyfish*1.
   > 
   > The reason I introduced sutra support tools the other day is, among other things, that books by these charismatic figures of the Ruby world are coming out one after another. I've heard that there will be a Ruby book coming out in August*2. This summer, we are going to see a lot of sutras (in the style of Jun Miura).

 >[kakutani https://twitter.com/kakutani/status/1439084691768840194]: When I worked with @t_wada around 2004-2005, we used to call it "sutra copying" when we typed sample codes by hand instead of copy-pasting. I think it started when @t_wada called it "sutra copying" to describe an episode in which he typed the sample code of "TDD by Example" by hand with "a feeling like praying" while going to his previous site...

 >[kis https://twitter.com/kis/status/1439086158361759747]: as far as I can tell, this is the oldest thing on the blog (and probably on the internet), but babie's comment makes it sound like it was already said around here!
 >I'm glad that the image was right.
		[https://kakutani.com/20050715.html#p02 "Kung Fu Hustle Collector's Edition", "Futsunan Linux Programming: The royal road of gcc programming you can learn from the mechanism of Linux" - Kakutani HTML-ization Project (2005-07-15) )]
  	>"Futsun Linux Programming: The Royal Road to gcc Programming, Learning from Linux Mechanisms".
   > The highly anticipated Aoki's product, whose book shadow is "normal," is now available for pre-order on Amazon. I installed Debian on my X40 to copy this book. I can't wait.
				>babie (2005-07-22(Fri) 02:18)
    > Here is another sutra study method.
    > ○ Kakutani (2005-07-22(Fri) 02:36)
    > Scripture is important, you know?

 >[kis https://twitter.com/kis/status/1439092091238305794]: So this is the episode where t_wada hand typed the code for TDD by Example and "understood it by heart, not by words".
		https://www.ogis-ri.co.jp/otc/hiroba/others/OORing/interview43.html
		[https://gyazo.com/99518821f7ed6ec3548f75799f12d9a7]
		>[kakutani https://twitter.com/kakutani/status/1439092905579216898]: that's it.
　　This is 2009