Inverted Lecture Style at the 54th Meeting of Young Scientists in Information Science
In September 2021, when Nishio gave an invited lecture at the 54th Meeting of Young Scientists in Information Science, he proposed the "style in which presenters share their videos in Scrapbox in advance," which was well received at the "Unexplored Junior 2021 Boost Conference.
After discussion with the Executive Committee, the meeting was held in the following style with a few adjustments
	table::
		Invited Lectures Video shared in advance No playback on the day of the event Discussion between the presenter and two organizers will be shown.
		General Presentations Video will be shared in advance and replayed on the day of the presentation.
		Lightning Talks No video sharing in advance
	Communicate on Scrapbox during presentation time
　Playing the video on the day of the event was a new experiment.
　　Can create additional value for active participants without detracting from the experience of participants who envision a traditional presentation event

As far as Nishio is aware, this is the third case of [Scrapbox sharing style in advance of presentation video], following junior and [talk.cpp].

Whether to play the video on the same day
 Preliminary Executive Committee Discussion
 　Cannot ask participants to commit as much as unexplored juniors.
 　There will be people who will not see the video before the day of the event.
 　→ Video will be played on the day of the event.
 　　This is where it differs significantly from previous attempts
 　　Example [/talkcpp/talk.cpp].
   	> [* No video will be shown on the day of the event], presenters will verbally + screen-share answers and other supplementary discussions based on questions and comments in the Scrapbox
 　Although the scheduled playback speed was 1x, a phenomenon was observed on the day of the presentation where the presenter requested "playback at 1.5x speed".
 　　A viewer commented that 1.5x playback results in less distracting filler such as "uh
	Comments from participants on the day of the event
 　A format that does not play video is viable even if the audience does not watch the video beforehand if the content is a discussion.
 　However, it is usually difficult to design lectures that entertain both "viewers" and "non-viewers".
 　Maybe we need a "strong style" that says "video must be viewed in advance."
 In fact, the last two cases were both strong-style
 　Participant feedback after the Unexplored Junior Boost Conference
 　 >[YoshifumiSeki https://twitter.com/YoshifumiSeki/status/1404022509742166017]: I liked the format of the Junior Boost Conference. I'm sure it's because everyone has a certain level of intelligence and motivation, and since it's basically volunteer work, we can leave those who don't follow us behind [*], but the performance was still very good and enjoyable.
 	　Related Design philosophy of Junior Unexplored: [A place to develop the top 1% who are actively working].
 　　[nishio.icon]Ultimately, this is about the design philosophy of what kind of place you want to create.
 　Because of the event style of recruiting through Compass and having an unspecified number of participants, we observed people making assumptions based on associations with other events.
 　　Participant Comments
  　　I didn't realize the work needed to be done prior to the day of the event.
  　 There was an assumption that I only needed to devote my time on the day of the event.
  　[nishio.icon]This is a newly created style of holding the event, so maybe we should emphasize it more until there is more awareness of this kind of style.
　Is the style of playing the video at the time of the event boring people who watched the video beforehand?
　Not surprisingly.
　　Participant Comments
　　　Might as well watch it twice.
　　　　Sometimes I miss announcements when I'm posting on online communication tools (chat, Scrapbox, etc.).
　　　　View the presentation in advance to understand the content, and on the day of the presentation, communicate with the audience while viewing in real time.
　　Impressions of Nishio
　　　I took the strong style approach of watching all the videos in advance and commenting on them.
　　　I thought the second one would be boring, but it wasn't.
　　　Excess cognitive resources can be allocated to communication on Scrapbox.
　　　　Example: The
　　　　　Teaching people who don't realize that icon notation can be produced with Ctrl+i.
　　　　　Point out when the management stops the video without realizing that there is more to the video.
　　　[nishio.icon]It's a management-friendly style.
　　　　In real-time lectures, there is often a situation where "the management pays the labor cost but receives little benefit," because the cognitive resources are taken up by the management and the audience is unable to listen to what they wanted to hear or ask questions.

Communicate on Scrapbox during presentation time
　Can be co-edited in real time.
　The psychological barrier for the writer to respond in text form is as low as [announcement parallel chat].
　　And I thought I was, but maybe some people found it hard to write? I can't observe that.
	The fact that Scrapbox is a medium for honest additions, unlike chat, allows presenters to react after the fact.
　　Plus, the fact that the presentation is a video playback allows the presenter to participate in the communication in real time as well.
　　　Questions of those who heard the presentation were answered during the presentation.
　A participant expressed concern that Scrapbox's collaborative editing may not work well with read-outs, etc., and may cause accessibility issues

Regarding 1.5x playback
　Several participants said they always watch lecture-based videos at 1.5x.
　　>Usually you have to choose between "1x listening in real time" or "1.5x viewing after the fact in the archive", but this format is very good because you can "watch 1.5x in advance" and participate in real time discussions!
　　>1.5x viewing makes it easier to stay focused.
numeric data
　95 event participants (+ organizers, etc.)
　Scrapbox participants 61
　Pages created in Scrapbox 64 pages
　38 people who created a self-introduction page in Scrapbox according to a prior request.
 Total number of characters in self-introduction page: 11993
  Average number of characters: 316
  　The default generation is about 10 words, with a lot of people who write a little more and less than 100 words, and a few who actively write a lot or generate a lot of conversation.
　Total number of characters on the presentation page: 48642
　Invited Lectures 17431
　Special Lecture by Young Scientists 13229
　Normal announcement 3351 / 4076
　	LT 4867
　Night Session 5688
　　(Ref: This page is 2~3000 characters)

relevance
	[Remote speakers may be recorded].