Abstinence is a rich man's pleasure
>[ASCIIART_NOVEL https://twitter.com/ASCIIART_NOVEL/status/1448101556851642371]: a long time ago in Hiroshima with a monk
>"There is no original [ascetic] teaching in [Buddhism], do you know why?"
>"Is it because Buddha denied asceticism in the Ascetic Forest?"
>"That's part of it, but it's also because in the old days, if you did things like abstinence and temperance because of the food situation and sanitary conditions, you would die. Abstinence was a pastime for the rich."
>I told him.

>[ASCIIART_NOVEL https://twitter.com/ASCIIART_NOVEL/status/1448102627963666432]: "It is usually only after the world becomes affluent that religions that do not originally have ascetic teachings, not only Buddhism, suddenly make asceticism a virtue. It is usually only after the world has become affluent. People start asceticism because they want to think that they are special religious dignitaries who dare to lead an inconvenient and painful ascetic life in an age of affluence. Celibacy is the quickest and easiest way to practice asceticism.

>[ASCIIART_NOVEL https://twitter.com/ASCIIART_NOVEL/status/1448103307856154628]: "I don't need to help or care for others just because I suffer. So many people who are celibate for the sake of superiority over others are cruel and terrible people. You see it in non-religious communities as well. People who say that because they're having a hard time, they're superior to others."

>[ASCIIART_NOVEL https://twitter.com/ASCIIART_NOVEL/status/1448103864494813184]: "It's a trend that you see in things like being eco-friendly, slow-living, vegan, and so on. I'm not saying all of them are like that, but those who can choose an inconvenient and restrictive way of life are the rich or the powerful. That's why the Buddha hated asceticism and asceticism."

>[ASCIIART_NOVEL https://twitter.com/ASCIIART_NOVEL/status/1448104399629262848]: He was a monk who spoke politely to me as a student.

関連
　The "I'm superior because I'm suffering" mentality may also be related to [slave morality].
