I would like to discuss with you the direction in which the Micra project is going.

[/nishio/kei.icon]What would you like to see happen in this conversation?
[/nishio/human.icon]I would like to discuss the direction in which the Micra project is going.
[/nishio/kei.icon]What kind of "mikura project" is that "mikura project"?
[/nishio/human.icon]Experiment to set up a micro server in the company and create a virtual office.
[/nishio/kei.icon]What kind of "micro server" is that "micro server"?
[/nishio/human.icon]A place where employees can enter and tinker anytime they want.
[/nishio/kei.icon]What kind of "employee" is that "employee"?
[/nishio/human.icon]Members who belong to the same company but have less chance to get together physically due to remote work or are geographically distant from each other.
[/nishio/kei.icon]What kind of "remote work" is that "remote work"?
[/nishio/human.icon]When doing work, do not assemble in a specific place.
[/nishio/kei.icon]What kind of "specific" is that "specific"?
[/nishio/human.icon]office or whatever it's called.
[/nishio/kei.icon]What kind of "office" is that "office"?
[/nishio/human.icon]If you're working alone, it's important not to be uncomfortable, but it's a little different if you have a lot of booths lined up with one uncomfortable person, so the office should have some extra value
[/nishio/kei.icon]Anything else about that "office"?
[/nishio/human.icon]For example, while you get up from your seat to walk to the restroom, you see a slide of a presentation event taking place in the communication area and become interested in it, or some other "unexpected interaction" like that.
[/nishio/kei.icon]
 > If you're working alone, it's important not to be uncomfortable, but it's a bit different if there are lots of booths lined up with one uncomfortable person, so the office should have some extra value
 Where is this "office" located?
[/nishio/human.icon]The before corona would have been in the naively physical world, the after corona accelerated the discussion of moving it into virtual space.
[/nishio/kei.icon]
 > If you're working alone, it's important not to be uncomfortable, but it's a bit different if there are lots of booths lined up with one uncomfortable person, so the office should have some extra value
 Where is this "office" located?
[/nishio/human.icon]Think about offices between people, excluding from the discussion of virtual offices the work done by one person because it is completed at home work.
[/nishio/kei.icon]What do you value?
[/nishio/human.icon]I kind of want to make it flow smoothly for something that is stagnant.
[/nishio/kei.icon]
 > Think about offices between people, excluding from the discussion of virtual offices the work done by one person, since it can be completed at home.
 What would you like to see happen regarding this "office"?
[/nishio/human.icon]We want to be able to enjoy the benefits that used to occur when we were physically gathered without having to physically gather.
[/nishio/kei.icon]What needs to happen in the "office" for that to happen?
[/nishio/human.icon]That is not very clear. I feel that "simply having people enter a virtual space isn't enough," and that we need "to be able to modify that space one by one."
[/nishio/kei.icon]With regard to the "office", can it?
[/nishio/human.icon]The introduction of microphones was intended to
[/nishio/kei.icon]
 > Think about offices between people, excluding from the discussion of virtual offices the work done by one person, since it can be completed at home.
 How do you know this "office"?
[/nishio/human.icon]Experience, because you cannot know without observation, it is necessary to first create a new "office" and observe it, even if it is not 100% perfect from the beginning
[/nishio/kei.icon]Where does that "office" come from?
[/nishio/human.icon]I'm making it now, but an unexpected event needs to occur from the interaction of multiple people, and this needs to be unexpected to me, so I have to create a place for it to occur and wait for it to occur with probability.
[/nishio/kei.icon]
 > We cannot know without experience and observation, so it is necessary to first create a new "office" and observe it, even if it is not 100% perfect from the beginning
 What does this "office" look like?

https://keicho.netlify.app/#talk=VgIVJMzoQLtXfOj9zBRT
#KeichobotLog