talent pool
[Cabinet Office Survey on Factors Affecting the Mobility of Innovation Talent].


---
[Is it possible to determine salary by "marketability"? | What is a "company you would like to work for" in the opinion of readers - DHBR×Cybozu style https://diamond.jp/go/pb/dhbrcybozu/]
[In order to value employees who work freely, we abandoned the salary table──Dai Tamesue and Yoshihisa Aono, "Essentially, what do people live for?"| Cybozu Style https://cybozushiki.cybozu.co.jp/articles/m001285.html]


---

>[aono https://twitter.com/aono/status/1084606668183224322]: I read in one of today's newspapers that "the reason why workers' wages are not rising despite profits is because many companies are concerned about the future and want to keep money on hand", The correct word is "management", not "company". There is no Mr. Company. Let's focus on [flesh and blood].

>[shunta_umeki https://twitter.com/shunta_umeki/status/1084642322594258946]: there is no such thing as a good or bad company,
>There are just good managers and bad managers ^_^!

>[Hiroki_Komazaki https://twitter.com/Hiroki_Komazaki/status/1084610572627267584]: So, since we can't just leave it to the market, I think that either increasing corporate taxes or raising the minimum wage would be a possible way to increase wages and expand the economy. I think that increasing corporate taxes or raising the minimum wage are possible ways to increase wages and thus expand the economy.
>Because the former is tied to international competitiveness, it would be better to increase the minimum wage, which remains low internationally.
>Mild maximum wage increase would have limited impact on unemployment rate. twitter.com/aono/status/10...

>[aono https://twitter.com/aono/status/1084656416080551938]: raising the minimum wage is a direct way to go. In addition, I think the bad aspects of membership-based employment are showing, so I think it would be good to increase human resource mobility by incorporating elements of job-based employment. I feel that [no side jobs] and [no transfers without consent] will support individual independence. twitter.com/Hiroki_Komazak...

>[JICRochelle https://twitter.com/JICRochelle/status/1084918057791713280]: indeed, we need to rethink capitalism today. I recently wrote this article on the "economic growth addiction", which is related but for your information. newsweekjapan.jp/rochelle/2018/...

---

>[ikedanob https://twitter.com/ikedanob/status/1440124051607855104]: The reason why the Japanese economy has been stuck in stagnation for the past 20 years is because of a policy that no administration has done. It is to revise the Labor Standards Law to allow for layoffs and to make employment more fluid. No amount of bribes will stop the decline without addressing the labor market, which is the bottleneck of the Japanese economy. twitter.com/Terry_set_trap...

>[tomoida https://twitter.com/tomoida/status/1440125367134552067]: we should be promoting the abolition of the retirement system, not the extension of the retirement age. If the switch from job-based pay to job-based pay is not made, workers will not be paid more. twitter.com/ikedanob/statu...

>[ikedanob https://twitter.com/ikedanob/status/1440130656478982148]: This book from 2009 is still active and selling well, and has even been translated into Chinese. Here I wrote that the Japanese economy will enter a prolonged stagnation if excessive worker protection is not stopped and metabolism is not promoted, and unfortunately that prediction came true.
>The Courage to Abandon Hope: The Economics of Stagnation and Growth ikedanobuo.livedoor.biz/archives/51301...

>[ikedanob https://twitter.com/ikedanob/status/1440137645103800324]: I have no hope for Mr. Takaichi, who inherited Abenomics that ruined the Japanese economy, but Mr. Kono, who believes in growth through renewable energy, is irredeemable. Mr. Kishida, who denies shareholder capitalism, is out of the question. Now is the time to have the courage to "give up hope" and live without relying on the government.

>[TKAZ15392397 https://twitter.com/TKAZ15392397/status/1440352069001494536]: The stricter the restrictions on layoffs and wage reductions, the more cautious companies will be about raising wages because wages are a stiff fixed cost. At the same time, allowing non-regular labor with freedom of dismissal makes liquidity a one-way street in the direction of lower wages, which further depresses wages. Wages will rise if there is a major shift in the upwardly rigid labor market structure, since there is a labor shortage due to the declining birthrate and aging population. twitter.com/tomoida/status...

>[ytandou https://twitter.com/ytandou/status/1440490896496025602]: This kind of talk is impossible without a major change in the compensation curve and employment practices by deciding compensation based on the degree of professional education (degree and university rank) before demonstrating expertise in the Japanese company structure where salaries are increased by internal hierarchy, It is impossible without a major change in the compensation curve and employment practices by determining employment based on performance. This would be easier said than done, since it would suddenly be applied to existing employees. twitter.com/TKAZ15392397/s...

>[ytandou https://twitter.com/ytandou/status/1440490898391920642]: If we are going to do this in a risk-averse society, we will have to come up with a good sales pitch to make it so that people can retire early at age 45 and live the rest of their lives in comfort. It will be impossible without a good sales pitch. I wonder if Japanese companies would pay that kind of salary in the first place.
>However, in cutting-edge fields, the inability to hire good employees from outside the country due to salary bottlenecks is already happening....

>[TKAZ15392397 https://twitter.com/TKAZ15392397/status/1440539559809351686]: exactly. Because it will take time, Japan's deflationary spiral will continue unless we get hungry and start a 30-year effort to transform the situation. No matter how much monetary easing is done, Abenomics' experiment has proven that as long as wages are structurally rigid upward in employment practices and the human resource market, we will never escape deflation. twitter.com/ytandou/status...

>[aono https://twitter.com/aono/status/1440845845780316166]: I understand that the cause of deflation is not "finance" but "organization", and I am suddenly motivated from a Cybozu point of view. I will do my best! twitter.com/TKAZ15392397/s...

>[aono https://twitter.com/aono/status/1440855814810443783]: (Continued) I wondered why US companies are more aggressive in adopting new IT than Japanese companies, and was surprised to hear the common answer, "Because it will be an advantage when I change jobs", when I interviewed some of the staff at US companies. I was surprised to hear the common answer, "Because it will give me an advantage when I change jobs. I was surprised to hear the common answer, "Because it will give me an advantage when I change jobs." The mobility of human resources stimulates positive initiatives. On the other hand, the adverse effects of "recruiting only new graduates, seniority-based system, and lifetime employment inducement" are significant...

>[TKAZ15392397 https://twitter.com/TKAZ15392397/status/1440854373240737797]: Mr. Kuroda is my senior in high school and I know him rather well, but he was worried that wages did not rise easily even with so much monetary easing, the so-called He was worried that the so-called Phillips Curve effect has not emerged. I told him that the peculiarities of Japanese labor laws and labor practices, as well as the preservation of zombie companies by monetary easing, were preventing productivity and wages from rising. I told him.

>[aono https://twitter.com/aono/status/1440857359442530307]: I see. When I talk with the staff of U.S. companies, they tell me, "If we introduce new IT, it will be an advantage when we change jobs. That's why they take on challenges. On the other hand, Japanese companies "hire only new graduates. On the other hand, Japanese companies "hire only new graduates and induce lifetime employment through a seniority system," which results in low mobility of human resources and a weak mindset among IT staff to take on new challenges.