Taking a risk or not taking a risk is a false choice
[https://gyazo.com/c04697a19de1d599bc8da437ee11bb78]

---
>[fladdict https://twitter.com/fladdict/status/1451359570085908638]: "Average people are excessively loss averse," so wouldn't life be a hell of a lot easier if we took two steps further [risk] than those around us? ...and that's what we talked about.
	>[fladdict https://twitter.com/fladdict/status/1451360037079715865]: [loss aversion bias] causes humans as a species to tend to be excessively, more risk averse than is appropriate risk-return. In other words, too little challenge, too much adventure. So far, this is a common story in behavioral economics.
	>[fladdict https://twitter.com/fladdict/status/1451361002742714374]: digging further beyond that... if the average person is excessively risk averse, there is an excess of return left in place. There is a high probability that there is an excess return. So, there is a possibility (depending on the field) that the yield of risk-taking behavior "exceeds the logical performance by the amount of loss aversion behavior of others".
	>[fladdict https://twitter.com/fladdict/status/1451361789141159942]: So, the act of taking a little bit more risk than the average is a "fair value" plus a "premium for the best of the group" plus "everyone's loss aversion The "leftover premium" and so on are loaded in various ways, so it's even more profitable than the world says....
	>[fladdict https://twitter.com/fladdict/status/1451363815673585665]: So, then, if we are going to take risks, how should we take risks...?
	> but I think there are a few tricks to this as well.
	>[fladdict https://twitter.com/fladdict/status/1451364938807537667]: the most important thing to do with this is to "break the action down into smaller pieces and turn many". The more small bets you make in large numbers, the closer you get to the logical value. On the other hand, big big gambles have a lot of ups and downs. For the same expected value, it is more correct to turn many small actions.
	>[fladdict https://twitter.com/fladdict/status/1451365742037794818]: why is "a large number of smaller bets more important than a large number of larger bets, even though they have the same expected value?" This is the type of thing that doesn't really make it into the textbooks or anything, but I'm thinking it's because the cost of hedging risk is different...
	>[fladdict https://twitter.com/fladdict/status/1451366375507652611]: a large, one-shot bet (blurring) has to be prepared for a jackpot, a big miss, and a half-way house scenario as a risk hedge. Since each scenario is totally different, the cost of dealing with risk hedging is extremely high.........................
	>[fladdict https://twitter.com/fladdict/status/1451367868168237060]: On the other hand, a myriad of small gambles in a row (no blip) will have neither upside nor downside, since performance depends on the median. In other words, the number of possible scenarios that can then be assumed is limited. Risk hedging costs are extremely low. For the same expected value and frequency, an accumulation of small swings is in principle preferable.

>[nishio https://twitter.com/nishio/status/1451370086149746689]: "Of course it is, and of course 'the majority doesn't realize it or doesn't act on it,' so the world favors those who understand and act."
	>[nishio https://twitter.com/nishio/status/1451370522634162178]: around here: [average orientation is the worst environment].
	>[nishio https://twitter.com/nishio/status/1451370878579593216]: It's not directly equal to this story, but on the contrary, I took this story too much for granted and didn't verify it with the code...
	>[nishio https://twitter.com/nishio/status/1451379756067221505]: For example, you have 100 agents and an "investment opportunity" that returns a normally distributed return with a randomly determined mean and standard deviation. The "good" evaluation function is a function that takes the mean and standard deviation.
	>[nishio https://twitter.com/nishio/status/1451380348999192578]: this valuation function is simply expected value + coefficient x standard deviation. What relationship arises between coefficient and return when shuffling agents and selecting investment opportunities over and over again?
	>[nishio https://twitter.com/nishio/status/1451381451321057287]: this would seem to maximize the performance of the agent that always chooses the one with the largest expected value. I'm not sure why that is, because the choices are taken in the order they're shuffled, the earlier the better, so at the point of random shuffling, you're getting the results of a race to take the choice.
	>[nishio https://twitter.com/nishio/status/1451382375057747972]: time for a meeting, so we'll continue later (or not).

>[hrjn https://twitter.com/hrjn/status/1451400887792902150]: I think "understanding" is very important, but somehow it's a bug of some kind that the world tends to end up in miscellaneous discussions about doing/not doing things or taking risks/not taking risks. I think it's a bug.
	>[hrjn https://twitter.com/hrjn/status/1451401174171611140]: I've heard that the discussion is all about the so-called "how" and not about the "what" and "why" of what should be done and what should be accomplished.

>[nishio https://twitter.com/nishio/status/1451410171830235136]: painted a picture
	[https://gyazo.com/c04697a19de1d599bc8da437ee11bb78]
	>[nishio https://twitter.com/nishio/status/1451411525508296707]: There is a majority A who avoids risk and has small returns, and there is a B who chooses high risk high return, and there is an idiot B' who sees B's high return and tries to imitate him but is not smart enough and does high A' sees B's stupidity and stubbornly avoids risk again. It's all about the "take the risk or don't take the risk" dichotomy.
	>[nishio https://twitter.com/nishio/status/1451411891859775489]: hmmm, this diagram doesn't express the increase in returns for C thanks to A and B...
	>[nishio https://twitter.com/nishio/status/1451412632070541316]: When I say this, some people think something like "teach me how to do that C." But if you teach that to A or B, it's only a disadvantage for C because they tend to fail by half-hearted imitation and resent you. But if you teach it to A and B, they tend to make mistakes by half-heartedly imitating you, and they will resent you, so it is only a disadvantage for C.

Taking risks or not taking risks is [a false choice].