Copy&Paste between Worlds
I was able to Copy&Paste between worlds.
[https://gyazo.com/9232a70499465d09800a27f8530e336b]
copy source
	[https://www.planetminecraft.com/project/tokyo-skytree-tallest-tower-in-japan-hq-/ Tokyo Skytree, tallest tower in Japan. HQ !! Minecraft Map]
 [https://gyazo.com/0d022853f06d0cad125817c0393f91e4]
background
	[https://gyazo.com/6cd6cb3cf14f85e46ca4d52043648371]

Unfortunately, the antenna on the tip is broken.
Maybe the original was made using flat ground lower than Y=64 to Y=256, the upper limit of altitude, and this one was lost because it was placed at Y=64 on a normal map.
	> The tower is almost 250 blocks-tall, that is close to the maximum height.
		I knew it

This is annoying, it's hard to "make it one size smaller" with a microblock.

how to
	I thought about using [Structure Block @ Micra], but the maximum size in JE was 48x48x48
 Using [WorldEdit
	 >WorldEdit can work with “schematic” files to save or load your clipboard to disk.
	 > To save your current clipboard to file, use `//schem save <filename>`.
	 > To load a saved schematic, use `//schem load <filename>`.
	 https://worldedit.enginehub.org/en/latest/usage/clipboard/
　What we did.
　　Start server locally
　　　I have WorldEdit in the plugin.
　　　Replace world with the above distribution world
　　Select the area to be copied with `//wand` wand and `//copy -e`, `//schem save <name>`.
	　　The file is generated like `minecraft_server/plugins/WorldEdit/schematics/<name>.scheme`.
　　Place this file in a similar path on the multiplayer server where you want to paste it
　　　`//sheme load <name>`, `//paste` to.

important point
　You should look at the direction when copying with F3 to see which direction it will be pasted from your point of view and make a note of it.
　　Failing that, I pasted it and overwrote the existing one.
　　The block itself can be restored with `//undo`, but the teleporter that was destroyed at this time was created with the Slimefun4 function, and even if only the block was restored, it would not function as it was, so it needed to be rebuilt!

[Micra].