The seafood market becomes all about crabs.
Stories:.
 Various marine products are sold at the marine products market. Tourists visit the market because it is interesting to see products that are not usually seen in supermarkets.
 A belief grows in some quarters that "selling crabs is supposed to be profitable." Whether this belief is true or not is irrelevant.
 Some shopkeepers change their products to crabs. The surrounding store owners see this and think, "Selling crabs seems to be profitable.
 The belief that "selling crab is profitable" creates a feedback loop that spreads throughout the market, and the product becomes all about crab.
 Travelers are not attracted to crab-only markets, so they stop visiting.

I forget where I saw it or the source.

関連
　Shimachu nitrization
https://twitter.com/kaorun/status/1453163729076441092?s=21
>[kaorun https://twitter.com/kaorun/status/1453163729076441092]: The problem with Shimachu's conversion to Nitori is that Shimachu is supposed to become more competitive by acquiring Nitori's private brand products, but the national brand The problem with the #Nitoriization is that Shimachu is supposed to be more competitive by getting Nitori's private brand products, but instead they are pushed out and the national brand products disappear from the shelves, reducing customer choice and making the stores less attractive. #Nitori #Shimachu

>[kaorun https://twitter.com/kaorun/status/1453164545971609601]: If the gross profit margin is improved by streamlining operations and using PB products, but the attractiveness of the stores is diminished as a result, isn't this a typical losing pattern for Japanese companies during the deflationary era? Isn't this a typical losing pattern for Japanese companies in a deflationary era?
>In large stores, it would be easier for customers to understand and evaluate the competitiveness of PB if the Shimachu zone and the Nitori zone are completely separated.

>[kaorun https://twitter.com/kaorun/status/1453168230671917059]: One of the attractions of a home improvement store is the entertainment of shopping, where you can choose from a large number of products and compare them with each other. I think that Nitori's value will shine through if it is not forced to inject its identity as a store where everything is cheap and different from others, but rather if it is allowed to exist side by side with that identity.