"Intelligent life other than humans"?
>[stdaux https://twitter.com/stdaux/status/1453199174648823811]: when I see the expression "[intelligent life forms] other than humans" I ask myself, "Are humans intelligent?" question comes to mind.

>[nishio https://twitter.com/nishio/status/1453208794368937986]: It is not a dichotomy of intelligent or not intelligent, but a continuous gradation with degrees of intelligence, and humanity is only treating itself at its own level of intelligence to put itself in the intelligent life form. Human beings are only treating themselves as intelligent at their own level in order to be included in the intelligent life forms. So from the point of view of a more intelligent life form, it's possible that humanity is not an intelligent life form and can be slaughtered like a cow.
	[https://gyazo.com/682299d9557926e2487d3d780320f5b5]

>[nishio https://twitter.com/nishio/status/1453209325485248513]: Just as there is a minority of humans who insist, "Don't kill dolphins because they are [intelligent]! I believe that there is a minority of life forms more intelligent than humans that would say, "Don't kill dolphins because they are [intelligent]! I think there is a minority that says, "Don't kill dolphins because they are [intelligent]!

>[nishio https://twitter.com/nishio/status/1453210158906023940]: The "we should protect them because they're intelligent" line doesn't work because the majority thinks they're "not that intelligent compared to us", so they suck on sticks thrown by aliens and So, it would be better to go along the line of "It's against the spirit of [animal protection] to kill such a cute pet! It might be easier to protect the human race if we go the route of "It's against the spirit of [animal protection] to kill such a cute pet!

>[nishio https://twitter.com/nishio/status/1453211534297993220]: If they perceive you as a dog that bites, they will shoot you before you even get close, so I wonder if it would be better to first show them that you have no intention of attacking, then draw out their desire to protect you, and then have them perceive you as "surprisingly smart. (I'm thinking of how to deal with [aliens] who are actually more intelligent than humans and don't consider humans intelligent] if they come to earth.

>[nishio https://twitter.com/nishio/status/1453212249674424324]: If a human being who is obsessed with a movie that features a human being as the main character does resistance activities against aliens, the other humans who are appealing to their obedience will say, "Hey, stop it! And then the other humans who are appealing to their obedience say, "Hey, stop it!

[INTELLIGENCE]
