Those who seek diversity do not respect the values of those who do not seek diversity.
>nishio https://twitter.com/nishio/status/1453345403164786694]: Some people say, "Those who seek diversity don't respect the values of those who don't seek diversity? But the diversity-seeking group says, "A world where 99 values are respected is better than a world where only one set of values is respected," not a world where all values are respected.
	>[nishio https://twitter.com/nishio/status/1453346155589369861]: I don't respect the 100th value, "I prefer a world unified by one set of values to a world with 99 different values".
	>[nishio https://twitter.com/nishio/status/1453356562081218573]: it's a kind of straw man argument to transform your opponent's argument into "an extreme that he/she doesn't claim" before you break it down.
		[ストローマン - Wikipedia https://ja.wikipedia.org/wiki/%E3%82%B9%E3%83%88%E3%83%AD%E3%83%BC%E3%83%9E%E3%83%B3]
			> It is easier to refute an opponent's opinion if you misrepresent it, distort it without quoting it correctly, or take only part of it and exaggerate it.

>[nishio https://twitter.com/nishio/status/1453570896157822988]: I was thinking about illustrating yesterday's diversity story, but it's quite difficult, and the reason is that it looks like one story, but there are two overlapping layers I've been thinking about it, but it's not clear yet.
	>[nishio https://twitter.com/nishio/status/1453573925309345797]: The first layer is a layer of abstraction, where "the current situation is A, and I want to change it to B" and "contradiction occurs at the extreme Z in that direction" are independent of each other, and the latter cannot be denied by the former. The first layer is a higher level of abstraction: "the current situation is A and I want to change it to B" and "a contradiction occurs at the extreme Z in that direction" are independent stories.
	[https://gyazo.com/064d50ff41b41a98814b5bef66b78524]

>[nishio https://twitter.com/nishio/status/1453575138390142979]: the other layer is... oh, this is not a good idea to be vague. The black people are not necessarily identical.
	[https://gyazo.com/05459d4259498644ac4946739d841a57]
	>[nishio https://twitter.com/nishio/status/1453576653137866752]: there are people who have the traditional "married couples with the same surname" view who say "I prefer to have the same surname, but others can have different surnames" and those who say "I prefer that others also have the same surname", and the latter are harmful because they are trying to reduce other people's options.
	>I mean, the above diagram is misleading, is that why you were bothered by it?
	>[nishio https://twitter.com/nishio/status/1453578473969049608]: these two opinions are different, the former is in the scope of support in "selective" married couples, but the latter is an obstacle, so the two positions are clearly drawn apart I have to, and it's a mistake to portray them as if they were one person.

>[nishio https://twitter.com/nishio/status/1453700808709574659]: i tried to redraw it
	[https://gyazo.com/b87e078f841115a91faf400fb46572e8]
	>[nishio https://twitter.com/nishio/status/1453702774374350850]: after redrawing it, I realized that if we disregard the ratio of the number of people, opinions are not diversifying. You're increasing the "possible options" by confining "one of those opinions that reduces the options for others."
	>[nishio https://twitter.com/nishio/status/1453704902790696963]: you mean diversity of opinion and diversity of options are two different things.
	>[Contain opinions that reduce options and increase options].
