Calibration Session Partial Open Experiment
Experiment to publish the first 10 minutes of [calibration meeting] 2021-10-28

Just before this video started, I was asked, "Do you want to start recording now? Or later?" "Let's start now!" This was the exchange of "Let's start now!
[https://youtu.be/YFaqfXrIIxw]

	[Tomoya Tachikawa.icons] Calibration meeting
		What is calibration?
		We run error correction programs during communication.
		They intentionally avoid "taking what the other person says" and "saying what they think."
		I am aware of the problem that if we keep repeating this, the channels of communication will become buggy.
		Let's calibrate that communication by doing the "take what is said here as it is said" and "speak what you think as you think."
	[nishio.icon]Mr. Tachikawa, you make it sound like those rules came first and this meeting started, but that's not the reality.
		Mr. Tachikawa wanted to chat first.
		As the chit-chat is repeated on a regular basis, we ask, "Why does Mr. Tachikawa want to have this chit-chat meeting?
		After trying to verbalize it, this is what we're doing for [calibration], and it's "[a posteriori].
		　PS: The background is summarized in [Calibration Meeting].
	[Tomoya Tachikawa.icon].
		The history of this calibration session has been three years already.
  We got some very interesting results out of that.
  I want to make it more powerful.
  What is power-up?
  　How can we make it more `"interesting"`?
  I'd invite another person to come over and the three of us would talk.
  We can use clubhouses and other places to allow all kinds of people to come in.
  Chatting while circling around Shinobazuno Pond
  I did a lot of things.
  The hypothesis we arrived at
  　We are all inherently low-context communicators with each other.
  　Low-contest communication first.
  　Eventually, the low-context exchanges were accumulated over a very large period of time, resulting in a very high-context exchange between the two of them.
    For example, when Mr. Nishio says something is interesting, I say, "That's interesting! That's it," and so on,
    I don't think you get that [nishio.icon]`"interesting"` has quotation marks on it.
    	Related: [KJ method for "interesting"].
    [Tomoya Tachikawa.icon]Yes, yes, yes. That's exactly what this is now, the beginning of high context communication.
    I don't know what the others are talking about and what the two of you are getting excited about.
   I realized that this closed high context between two people is actually a lot of fun.
   I noticed that the quality of the place changes completely when there are two people and when there are groups of three, four, or five people.
  For me personally, I feel that intense one-on-one dialogue is more valuable than group dialogue,
  I wonder if it is possible to create a mechanism to receive some kind of stimulus or feedback from the outside while maintaining this intense dialogue.
  [nishio.icon]I see, so you want to generate communication that is not tethered to the one-to-one while maintaining the status of a one-to-one dialogue.
	  That's why we decided to do this experiment.
 	 As for my observation, "I want to do an experiment where the first 10 minutes of the video will be open to the public," and I said, "I don't really know why I want to do this, but the experiment sounds `interesting', so let's do it.
  [Tomoya Tachikawa.icon]The experiment that I had other people participate in, there's nothing wrong with that individual, but it kind of settled in a different direction than what I expected and hoped for.
  Clubhouse, for example, had a lot of people coming in. We started by listening to their stories. It was like we were hosting a lecture.
  That in itself was a lot of fun, a lot of fun, but it turned out to be not what I was expecting.
  [nishio.icon]To use an analogy, it was like playing beach volleyball with about five people.
  	But what these two are doing together is table tennis.
  	I'm hitting a very fast serve and doing rallies.
  	I found that if I opened the place where I was doing this rally to allow others to come in, I could not do the rally.
  [Tomoya Tachikawa.icon]Yes, I realized after I did it that if you want to play table tennis and you bring other people, it's not going to be table tennis.
  On the other hand, "we'll talk now, but we won't let others join the conversation" doesn't feel right.
  　([nishio.icon] and Mr. Tachikawa seems to feel, I don't sympathize, but I took it as an observed fact.)
  　　(For example, at the 54th Meeting of Young Scientists in Information Science, I, as an invited speaker, and two members of the executive committee gave a trilogy talk, and the others wrote their responses in Scrapbox, and I and the executive committee looked at the Scrapbox and picked up the topics as needed).
  So, I think it would be interesting to have a dialogue first, and then release the video afterwards, if people see it and say, "So that's the kind of dialogue you had.
  Why only the first 10 minutes?
  　About 95% of what we talk about is not the kind of talk you want people to hear.
  [nishio.icon]No, I don't know if there is anything in the first 10 minutes of this story that I can share with people, but I have to feel it to know it, so I felt it.
  [Tomoya Tachikawa.icon]We haven't talked about anything strange so far, have we?
  [nishio.icon]I'm not talking about anything weird.
   But as far as whether it's interesting to watch, I'm not sure.
   Well, that's [for the market to decide], not for us to decide.
 [Tomoya Tachikawa.icon] In turn, I started by saying that I was enjoying some chatting, and then I realized that no, this was calibration, or should I say that I realized that this was calibration, or did I give some appropriate reason after the fact?
  [nishio.icon]It would be an afterthought.
  　I didn't call it calibration at first.
  You must have been released from the disposition to continue on to the next one. something
  
  You didn't read it, the most, it must have only been the first.
  [Tomoya Tachikawa.icon]After about six months, Nishio-san said, "What is this association?
  [nishio.icon]About the sixth time we talked about why on earth Mr. Tachikawa wanted to have an interview with me every month, month after month.
  　[Tomoya Tachikawa.icon]I didn't understand why we were together until the sixth time.
  [Tomoya Tachikawa.icon]In the beginning we were expecting low context, and now we are no longer communicating with high context.
  [nishio.icon]Is it true that at the beginning of that "I was expecting a low context"?
 　 I'm afraid that's not true.
 　 You had that context, a conversation with someone with whom you shared the basic premise of "non-discriminatory communication."
  [Tomoya Tachikawa.icon]Yes, we did share that kind of context.
  [nishio.icon]
   Don't let words you don't understand slip through your fingers.
   Like, "When I think someone's interpretation is wrong, I go in without discovery."
  [Tomoya Tachikawa.icon] That's why it was so good.

After that.
　[Nodal point of thought 2021-10-28].

Post-publication discussion/reaction
　[Facebook https://www.facebook.com/1505859477/posts/10223092687254670/?d=n]
		For the first 5 minutes or so, Mr. Tachikawa was giving a long explanation about this episode by himself for the viewers, and the "ping-pong rally" hadn't started.
		The second time around, it seems like a good idea to aim to get it into top gear as soon as possible, without explanation.
		Thoughts after transcribing the text
  	When I and Mr. Tachikawa often include explanations to third-party spectators who are not present when they think "this does not convey the message," but it is strange because it is like "passing the ball around to the spectators" when you want to "[ping-pong rally]". If you think it is not conveyed to the third party, you can explain it later with text rather than verbally on the spot.
 	 It is better to leave time management to the machine, for example, set a conference presentation timer that rings three times at 4, 7, and 10 minutes, and when the bell rings at 10 minutes, fold up the talk and stop recording.
 	 A situation where the ball is on one side all the time is not a rally (= it is not right for one side to keep talking for a long time). If the "commentary on a non-existent third party" is eliminated, the time it takes for the ball to pass to the other side would be reduced, but experimentation is required.
		[Decisiveness is cultivated by training oneself to focus on one's emotions.]
			It explicitly says at this point that "interesting" is included in the "emotion" of "focus on emotion" in this. So there is synergy with the "let's dig into what is interesting" idea.
			[Tomoya Tachikawa.icon] I think you are using "focus on the emotion" and "properly subjective" in almost the same sense.
			[nishio.icon]I feel like there is a difference
		[Calibration Session Partial Open Experiment 2].

relevance
　[Instead of speaking to many, speak to one and let the many hear you].
　[Appointments with people are compulsory].
