Parable of the Ropes
　Fiber is weak as it is.
　By twisting together to form a rope, it becomes stronger and can be used to tie various things together.

　The words that came out of the conversation were fluffy fibers
 Strength comes from repeated checking and updating on words and concepts.
 Image of making a rope that lasts.

--- log
T: Reading [summary https://scrapbox.io/nishio/%E6%80%9D%E8%80%83%E3%81%AE%E7%B5%90%E7%AF%80%E7%82%B92021-10-28], it is very emotional.
T: I am deeply moved that this is how thought deepens....
N: Transcribing the conversation itself was not very useful, but it was useful to build up a digest
N: It is especially interesting to clarify the key words that are used repeatedly in the conversation and connect with them
T: I imagine that by repeatedly checking and updating about words and concepts, it will be strong enough to be connected,
N: Image of making a long-lasting rope
T: Also, since the definitions are clearly stated, it's easy to go back to them and reassemble the story if the definitions are updated in the middle of the process.
T: I think that if the definition is messy, when a change or modification of the definition occurs, the whole story up to that point will fall apart.
N: I wonder if they're actually [clarifying definitions].
T: What?
N: I think defining a word in words goes in circles, and in our case the concept is supported by shared examples
N: There are concrete examples, concrete episodes first, and then the concepts are abstracted and born later.
N: So unlike a concept defined in words, the meaning is properly shared or [calibrated by example].
T: We share the meaning as a 'concept' through a common experience of the thinking process, and we confirm it with some concrete examples, and then we say, "Ah, this concept is OK.
N: I see, "[a common experience of the thought process]".
N: Is it [communalization]?
N: For example, this time, we said, "Let's call it '[information dissemination gacha]' for now," but afterwards, when it was pointed out that "gachas know in advance what the SSR is," we said, "Ah, then it's not the same as a gacha.
T: Well, I don't think that is very important, so I think we should just leave it as "a mess where you don't know what you are going to get". I think that's probably very important.
T: If the conclusion is a cross-section of the thought process, then [sharing the conclusion is not important], and sharing the process is essentially "[sharing the thought]".
N: I think the "gacha where you don't know what you're going to get" is now "[a] grab bag, isn't it?" I think.
N: "[The conclusion is] a cross-section of the thought process."
N: Increasing 2 hours of oral conversation to 4 hours does not double the utility, but rather, it is a process of aligning the "flow" of the 2 hours of process sharing, and then later on, through text, "Isn't that what this is about?" or "Isn't that related to what we were talking about at that time?" I think it is important to do this.
T: In my opinion, it makes more sense to lay it down a bit than it makes sense to do it in writing.
T: But the letters have the advantage of remaining. The good thing about the whiteboard is that the moment you write on it, it starts maturing, and you can pick it up and move the conversation forward further.
N: It makes sense to sleep on it, but I think it needs to be in writing for [the expression to become fixed and ropey].
T: [Fixed representation], isn't that the point? That, at the moment, the best way to do that is with letters.
