I want to put Twitter in Kozaneba.
Another way to say it: I want to organize my Tweets in Kozaneba
It's hard to use existing tools if there are multiple people or if they're spread out over time.
　If it's just one stream of replies, you can easily summarize it on Togetter.
　It's a bit of a challenge when the story is branching out.
　　I'll put it in Scrapbox and move it around and do something with it.
　You can search Togetter for tweets under a common hashtag and put them in chronological order.
　It's hard to make the case that it's none of the above.

concrete example
　Something about some of the people in the timeline who are interested in intellectual production mention [Zettelkasten].
　I searched Twitter and found a lot of statements and found the discussions there interesting.
　Obsidian, card method, "TAKE NOTES!", Luman, and other adjacent keywords can be found.
　　Some tweets do not contain those keywords but are chronologically related
　　Some tweets are connected by replies.
　　Some tweets are a series of tweets by certain people.
　　As I'm picking up those things, I'm not sure if they're relevant or not.
 　Togetter no longer collects them.
　　If you want to "collect things that seem to be related first," that is the KJ method, and Kozaneba, an offspring of the KJ method, is probably the best suited for this.

>[rashita2 https://twitter.com/rashita2/status/1451165079559303171]: This act described in "TAKE NOTES!" -> "It is quite fun to search all over the file for connections between discussions and a wealth of materials and ideas, This would be the equivalent of Umesao's "card-curling".

>[rashita2 https://twitter.com/rashita2/status/1451165364616790021]: zetterkasten either preserves one's stream of thought, or assembles that stream through cards, which results in it being preserved. Either way, if "one's train of thought" does not exist, there is no way to preserve it.

>[rashita2 https://twitter.com/rashita2/status/1451166972830384132]: By the way, in terms of organizing information using cards, there is an excellent method called PoIC.
>◇PoIC
>scrapbox.io/poic/

>[rashita2 https://twitter.com/rashita2/status/1451167105689157635]: In addition to the strength of the method, the discussion is excellent.

>[rashita2 https://twitter.com/rashita2/status/1451168775156297740]: "Unfortunately, many explanations of Zetterkasten on the Internet are not good. This has led to many misunderstandings about the function of Zetterkasten, as I wrote before."
>『TAKE NOTES!』

>[rashita2 https://twitter.com/rashita2/status/1451170217850142732]: shake
>"The finished composition always needs to be checked, but the truth is that this will inevitably change again and again if you are working from the bottom up in Zetterkasten. Every time you need to change the structure, you have to step back, look at the big picture, and make the necessary changes, while keeping an eye on the connections in your notes.

>[rashita2 https://twitter.com/rashita2/status/1451170981230219267]: This is also equivalent to Umesao's "Kuru Card" -> "By flipping through the Zetterkasten, you may discover that an idea contributes to another You may discover that it also contributes to other topics you had not considered before."
>『TAKE NOTES!』

>[rashita2 https://twitter.com/rashita2/status/1451173208950861832]: "This is where it is important to create a place to order your notes specifically for the project. An outliner is useful for assembling a rough structure, but this also allows you to maintain the flexibility that is so important."
>『TAKE NOTES!』

>[rashita2 https://twitter.com/rashita2/status/1451173279142604802]: "The structure changes as the argument develops. When the composition does not change much, it is safe to call it a "table of contents". However, even at that stage, it is safer to view it as a guideline for the structure, not a final rule. It is never unusual to change the order of chapters at the last minute."
>『TAKE NOTES!』

>[rashita2 https://twitter.com/rashita2/status/1451173408075436038]: this book has a good understanding of Outliner as well. I predict that Tak.'s new book would be a good read as well.

>[rashita2 https://twitter.com/rashita2/status/1451176227419557889]: To summarize briefly, the book begins with an explanation of the Zetterkasten card method, and in parallel attempts to deconstruct some "myths" about "writing. In parallel with this, the book attempts to deconstruct some "myths" about "writing". For example, the "blank slate principle," the "straight line (planning) principle," and the "hold out until the end principle" are deconstructed.

>[HAT0406 https://twitter.com/HAT0406/status/1451333941303005184]: I have to admit that there were a lot of things that bothered me about "TAKE NOTES!", like the structure and translation, but whether it's Zettelkasten or Kyoto University style cards, I think the "one place I feel that the lifehack of "accumulating a clean copy of your ideas" is worthwhile.

>[rashita2 https://twitter.com/rashita2/status/1451347260571205632]: Umesao separated the cards and kozane. Zetterkasten also has a separate box for projects from the main card box. This point is very important. The box defines the context. The cards can be rewritten to match the context. It is not possible to use the same cards for everything.

>[HitnoteApp https://twitter.com/HitnoteApp/status/1451415270665318407]: I think the part about Zetterkasten notes having to be atomic and autonomous is often overlooked! I think it is often overlooked that Zetterkasten's notes must be atomic and autonomous.

>[HitnoteApp https://twitter.com/HitnoteApp/status/1451416032522817541]: or rather, I don't recall if there is a description of this story in the Zetterkasten book. If not, then the reader is missing a major point.

>[HitnoteApp https://twitter.com/HitnoteApp/status/1451426291614306304]: It is not difficult to create an atomic note, but it is difficult to create an autonomous note. However, if this is not possible, I feel that Zettelkasten will be just another box.

>[HitnoteApp https://twitter.com/HitnoteApp/status/1451514739297701894]: I guess a simple Zetterkasten without literature notes is fine for the general public, except for researchers, students, non-fiction writers, etc. I guess a simple Zettelkasten without a bibliography would be fine.

>[rashita2 https://twitter.com/rashita2/status/1451523046339006466]: I feel that the card method is the only one that sounds right, although the sheet or page method is also viable in principle. It has the strongest sense of object.

>[otagaki https://twitter.com/otagaki/status/1451524535660867585]: I was teaching a class how to assign card IDs in Zettelkasten and it didn't seem right. I then assigned IDs to WorkFlowy to check it out, but that's it, it's a paradigm relationship and a syntagm relationship, and you have to keep that in mind to assign it properly in Outliner.

>[otagaki https://twitter.com/otagaki/status/1451546978291052545]: After all, the structure of Zetterkasten is not a hierarchical structure (hierarchical relationship between abstract and concrete) that can be expressed in an outliner.

>[HitnoteApp https://twitter.com/HitnoteApp/status/1451550391691137024]: I think a parent-child note function is necessary to make it look like Zetterkasten. It would be better to be able to create parent-child relationships endlessly, but that would lose the listability, so it's a bit of a quandary.

>[pokarim https://twitter.com/pokarim/status/1451551535058407430]: you mean the Zetterkasten book?
	[TAKE NOTES!]

>[otagaki https://twitter.com/otagaki/status/1451557709627592713]: In addition, an aspect that cannot be expressed in an outliner is that, in looking over Zetterkasten, one can pick up multiple cards, linked or unlinked, that are separated from each other. In addition, as an aspect that cannot be expressed in the outliner, in looking over the Zetterkasten, a new topic or comment card can emerge from the cards that are separated, with or without links.

>[otagaki https://twitter.com/otagaki/status/1451686134350635012]: I thought yesterday's series of tweets solved the mystery about the structure of Zetterkasten's unique identifier (Unique ID), but surprisingly, no response. twitter.com/otagaki/status...

>[HitnoteApp https://twitter.com/HitnoteApp/status/1451740362641338368]: Edit -> Select -> Link -> Create Index Page I thought of something like that, but it doesn't feel right that the traditional merge would be Edit -> Select -> Link -> Merge. I'm not sure if there is another word that fits better than "link". I wish there was another word that would fit better than "link".

>[HitnoteApp https://twitter.com/HitnoteApp/status/1451740716242128898]: merging is not a sub-concept of linking... I wonder what higher-level concepts are common to index page creation and merging.

>[rashita2 https://twitter.com/rashita2/status/1451766714002141185]: integration, sort of. Indirect integration and direct integration. twitter.com/HitnoteApp/sta..

>[otagaki https://twitter.com/otagaki/status/1451768638734626818]: regarding Zetterkasten's rule of unique IDs, all cards are topics, and all connected cards are tweaks and derivations to the previous card. It's simple when you think about it, but generalizing like that doesn't explain why 1/1a1 exists!

>[rashita2 https://twitter.com/rashita2/status/1451771210325368838]: There is more than one kind of relationship between information shown by edges (lines connecting nodes). Then it is doubtful if there are two kinds. On the other hand, if you model it, it can be expressed in one kind, or in two kinds. So, the "precision" of the representation may differ depending on the intellectual operations that are performed.

>[rashita2 https://twitter.com/rashita2/status/1451771464126894082]: I mean that it may not be true that "the more elaborate the better" (big is better than small).

>[rashita2 https://twitter.com/rashita2/status/1451771584687968256]: just like a real size map does not work as a "map".

>[rashita2 https://twitter.com/rashita2/status/1451772086393847813]: Of course there are "games that elaborate on the relationships between information", but what I personally want is an intellectual tool that "facilitates certain intellectual operations". I am not interested in games that are not "games", but rather intellectual tools that "facilitate a certain intellectual operation". Therefore, we must consider how much "precision" is necessary for such intellectual operations. And even in writing, there are multiple levels of intellectual operations.

>[dd_otsu https://twitter.com/dd_otsu/status/1451820204413972480]: it seems like a year has passed without finitization, although various links are connected in Scrapbox. It was worth reading just to know that even Zetterkasten sometimes uses project-specific boxes and index cards!

>[dd_otsu https://twitter.com/dd_otsu/status/1451823133875265545]: I think the only text in which Luhmann mentions Zetterkasten and which can be read in Japanese is "Luhmann on Learning and Himself".

>[rashita2 https://twitter.com/rashita2/status/1451913923247050760]: "Being repeatedly re-dyed in the thoughts of others has taught me many lessons, which have become an important accumulation that has made me who I am today. There, I would like to superimpose my simple thoughts and wishes that I left behind ten years ago, and now I would like to live a computer life that is unique to me. "
>Great statement.

>[rashita2 https://twitter.com/rashita2/status/1451922888739606534]: Although his name is not mentioned as often as Umesao, Watanabe, or Toyama, I personally prefer Gen Itasaka's books on intellectual technology. There is something human in his books.

>[rashita2 https://twitter.com/rashita2/status/1452215866037182464]: "hogehoge-san arrived at method A through trial and error" is actually more important than method A. I think it is more important than "Method A".

>[rashita2 https://twitter.com/rashita2/status/1452217465950195716]: I guess it would be closer to say that Luhmann had a "big theme" than he had a "classification".

>[rashita2 https://twitter.com/rashita2/status/1452220877051809794]: for example, like this. Of course, this would mean that this is the resulting classification name, but without at least this kind of "big theme", all cards would be a continuation of the ground from 1. pic.twitter.com/cXixjt6dup

>[rashita2 https://twitter.com/rashita2/status/1452247564837744642]: Tile system also has a numbering system and a date classification system. pic.twitter.com/46maA7Ncjp

>[rashita2 https://twitter.com/rashita2/status/1452254988969730050]: simple numbering reveals the total number. Systematic branching can handle several major themes in parallel. Furthermore, the latter involves the work of positioning cards with intention. Each has its own efficacy.

>[rashita2 https://twitter.com/rashita2/status/1452446735087779844]: If there is a list of "things to do today" and a list of "things to do this week", I get the feeling that the former can and should be encompassed by the latter. But with the attention object model, that's not always the case.

>[rashita2 https://twitter.com/rashita2/status/1452446829291839489]: "(hyper)link" is useful in such cases.

>[rashita2 https://twitter.com/rashita2/status/1452447385582391298]: In the unified field model, there is a list of years, and within that a list of months -> weeks -> days, nested within each other. This is very smart, but not always easy to use, which is the difficulty.

>[rashita2 https://twitter.com/rashita2/status/1452448507609042946]: Sometimes, quite simply, the end of the week doesn't match the end of the month. So, it would be cleaner in terms of categories to do the nth week.

>[rashita2 https://twitter.com/rashita2/status/1452448904490881031]: for example, do this. (although I don't really appreciate it in October because of the overlapping week/month breaks). pic.twitter.com/PDm89zTpFL

>[rashita2 https://twitter.com/rashita2/status/1452449327855505415]: or you can do this (not that anyone will be offended). pic.twitter.com/gjIfhF98Ck

>[rashita2 https://twitter.com/rashita2/status/1452450532337934336]: kakau's curly bracket might be a better fit for week number groupings. pic.twitter.com/NfcsmRXw9r

>[rashita2 https://twitter.com/rashita2/status/1452451344975949826]: It would probably be the "best solution" to have meta-information in every line and to be able to display the extracted results by various views, but it is not likely to be the "best solution" in any way. I think it would be the "best solution", but it is not likely to be the "optimal solution" in any way.

>[rashita2 https://twitter.com/rashita2/status/1452466842086166530]: Even when we are derailed, or rather when we are derailed, that is when the "line" is created.
>My idea while reading a certain book.

>[rashita2 https://twitter.com/rashita2/status/1452482513553674240]: to have "flow" is to have inclination. So, in order to write, you need to be off-balance.

>[rashita2 https://twitter.com/rashita2/status/1452486279656996870]: If you try to write top-down with an outline of "like it" things in "like it" order, you will have a hard time. There is no slant to anything there.

>[rashita2 https://twitter.com/rashita2/status/1452503550940958727]: zetterkasten numbering is "positioning" and "contextualization".

>[rashita2 https://twitter.com/rashita2/status/1452503939442642948]: In this sense, posting tweets on Twitter is also "positioning". So, for example, there are two types of connections on Twitter: connections that make a series of tweets, and connections that "cover" one's own tweets with (self-)quoted RTs. Interesting similarities.

>[rashita2 https://twitter.com/rashita2/status/1452504407321432065]: Well, I think that the business books have been so focused on "quick results" that the know-how of "slowly developing memos" has been relegated to the corner of the book. I think "TAKE NOTES!" could be the antithesis of that.

>[rashita2 https://twitter.com/rashita2/status/1452504806103216130]: "Achieve results immediately" is combined with "run through the shortest distance to a predetermined goal," which is also quite different from the "TAKE NOTES! NOTES!" is also quite different from agile intellectual activities.

>[rashita2 https://twitter.com/rashita2/status/1452579612022562819]: With Obsidian mobile, if you check the "Open daily note on startup I'm not sure if it's a good idea, but it's pretty close to what I'm hoping for. twitter.com/haruna1221/sta..

>[rashita2 https://twitter.com/rashita2/status/1452840502420672515]: The next challenge would be the joining of the card method and outline processing.

>[rashita2 https://twitter.com/rashita2/status/1452907341423144960]: ◇Junction between Card Method and Outliner - Tadanori Kurashita's Idea Studio
>scrapbox.io/rashitamemo/%E…

>[otagaki https://twitter.com/otagaki/status/1452986459841916929]: I'm writing based on Zetterkasten, which I've started to nouchaku, but I'm finding that the card needs to be complete and not just a hairy scribble. I'm finding it confusing to try to think of something at the level of a scribble with a unique ID.

>[rashita2 https://twitter.com/rashita2/status/1452990115245027330]: It's the one that says cards and memos are different.

>[otagaki https://twitter.com/otagaki/status/1452991452804526082]: Zettelkasten is quite stumped by value conflicts if you are used to process-type out writing. If you are not doing memo -> literature card and memo -> argumentation card (= permanent card) on a regular basis, Zettelkasten will not respond to you.

>[otagaki https://twitter.com/otagaki/status/1452992618116390916]: Also, Zetterkasten will not be a complete sentence by storing completed cards and connecting them, but by looking at them to develop ideas and prevent omissions. It will be something that will help you to develop your ideas and prevent omissions.

>[otagaki https://twitter.com/otagaki/status/1453151254633336836]: examining Luhmann's card
>↓Expand (Increase the value at the end of the identifier. (e.g. 1/1 ↓ 1/2, 1/1a ↓ 1/1b)
>→ Extended (Add a to the end of the identifier if the preceding is a number or 1 if it is a letter of the alphabet. Example: 1/1→1/1a, 1/1b→1/1b1)
>1-digit cards (1, 2, 3 ...) are themes and indexes
>#Zettelkasten #Zettelkasten

>[otagaki https://twitter.com/otagaki/status/1453151256646598658]: ↓expand is an enumeration of individual topics (they do not have to be in order. (The "Birth of Momotaro" can come after the "Extermination of ogres").
>→ Extended extracts the individual information on the card from which it was derived and describes it. It is like a supporting sentence.
>#Zettelkasten #Zettelkasten

>[rashita2 https://twitter.com/rashita2/status/1453154762623315973]: In my personal opinion, numbering in Zetterkasten itself does not seem to have a strong contextual meaning.
>Giving a unique ID.
>Implication that the topics are connected.
>These two roles are all that is needed.

>[rashita2 https://twitter.com/rashita2/status/1453155162197934080]: So, there are two types of numbering, and if we call the basic 1.1 to 1.2 system the main stream, then 1.1a is an offshoot (or The nuance of the terminology here causes confusion. The nuance of the terminology here causes confusion, i.e., 1.1 to 1.2 is the main stream of the topic.

>[rashita2 https://twitter.com/rashita2/status/1453155450027872259]: but the true essence of this method should have been to take notes (cards) in a non-top-down manner in the first place. If so, it should be impossible to determine which topic is "mainstream". So, this "mainstream" has nothing to do with the top-down thematic setting, but is just a term of convenience.

>[rashita2 https://twitter.com/rashita2/status/1453155824520478724]: Then how to branch out is the order. The order in which I wrote those cards. So, basically, I position the cards from 1.1 to 1.2. However, there are times when I want to position a card I made at some point between 1.1 and 1.2. In such a case, we create a different route from 1.1a. That's how it works.

>[rashita2 https://twitter.com/rashita2/status/1453159138054193152]: using fractional things is possible with numbers alone, but the longer they are, the harder it becomes for the human eye to follow the flow. What was ingenious about Lewman was that he used another permutation flow, the alphabet, and combined it with numbers to produce infinite spatial possibilities "between" the two cards.

>[rashita2 https://twitter.com/rashita2/status/1453159531496677377]: the point that while contextualizing information, it is possible to add information "in between" as much as you want later. I think this is the beauty of numbering in Zetterkasten.

>[rashita2 https://twitter.com/rashita2/status/1453172281203519494]: One of the assumptions of the various card methods and outline processing is that human ideas do not come to us in any sort of contextual order. It is one of the assumptions of the various card methods and outline processing that human ideas do not come to us in some contextual order.

>[rashita2 https://twitter.com/rashita2/status/1453201903572029450]: I have the impression that it can handle rather large objects. Smaller ones are more like an outliner. twitter.com/genbu60/status...

>[otagaki https://twitter.com/otagaki/status/1453260666354208770]: the proliferation of cards in Zetterkasten is based on expansion, and the expanded group of cards is just numbered sequentially for when they are finally put away in a card box I guess it is just a matter of sequential numbering the expanded group of cards for when they are finally put away in a card box.

>[otagaki https://twitter.com/otagaki/status/1453263046814670853]: I could be wrong again, but I reached this kind of situation in my academic writing class today.　#Zettelkasten #Zettelkasten pic.twitter.com/1wYX2ZdOZm

>[otagaki https://twitter.com/otagaki/status/1453264282213396481]: #Zettelkasten #Zettelkasten numbering rules pic.twitter.com/vDtM3Gj5Rw

>[pokarim https://twitter.com/pokarim/status/1453267168469164033]: The way Zetterkasten card numbers work, the numbers themselves reflect a branching structure, so the overall structure is a tree structure, The overall structure is a tree structure, but it is a little different from the tree structure of a typical outliner such as WorkFlowy.

>[pokarim https://twitter.com/pokarim/status/1453267893144203266]: In WorkFlowy, an item can be followed by at most two nodes: a single indented child node or a subsequent node at the same level (a little brother, so to speak), In Zetterkasten's card numbering system, it is possible to create a myriad of directly succeeding nodes from a single node.

>[pokarim https://twitter.com/pokarim/status/1453268525322280970]: So the basic structure of Zettelkasten's card number is the same as an outliner-like tree that suddenly allowed the creation of children indented two or more levels. It seems to me that the basic structure is the same. Of course, the way the structure is used may be quite different.

>[pokarim https://twitter.com/pokarim/status/1453270897272532994]: the point seems to be that the Zetterkasten card number, basically a mechanically generated ID, has context woven into the ID.

>[pokarim https://twitter.com/pokarim/status/1453285175211790339]: In a Wiki, the name or keyword is the ID. In Zetterkasten, the context of creation becomes the ID, so to speak.

>[pokarim https://twitter.com/pokarim/status/1453296719966478339]: the fact that the card number and ID of the Zetterkasten are determined by the context in which they are generated makes it seem like a flow in the "stock and flow of information tools". I feel it somewhat like a flow in the "stock and flow of information tools".

>[genbu60 https://twitter.com/genbu60/status/1453310273545125888]: I see what you mean, Obsidian can handle larger ones.
>I will revisit Obisidian again from that perspective.

>[rashita2 https://twitter.com/rashita2/status/1453312423532777475]: the point is that Obsidian can use headings. They can handle things that have internal structure = big things.

>[rashita2 https://twitter.com/rashita2/status/1453312654915694595]: the main site keeps the most recent logs, but that's OK.

>[rashita2 https://twitter.com/rashita2/status/1453314142845030400]: If you are going to operate the card method, your reading notes should not end with highlighting, etc., but rather a summary of them in your own words. It is indispensable. In other words, it takes quite a bit of time.

>[rashita2 https://twitter.com/rashita2/status/1453316863450968067]: Although there is only one type of link format itself, wiki links can be described as "embedded in text". In other words, they can show context. Conversely, to demonstrate the power of hyperlinks, it is good to be aware of "writing in text". twitter.com/pokarim/status...

>[rashita2 https://twitter.com/rashita2/status/1453317525618393091]: In the case of paper, additive numbering was easy to use to give a unique ID, but with digital data, there is no need to be concerned about that. But with digital data, there is no need to be concerned about this. But with digital data, there is no need to be particular about it. If the sequence of cards has the function of clearly indicating "this is about this subject," it can be directly indicated in the text.

>[rashita2 https://twitter.com/rashita2/status/1453317798973771781]: In this case, there is no need to "branch out to add in between later". Simply show how the new card relates to the existing card you want to reference.

>[rashita2 https://twitter.com/rashita2/status/1453317953814810626]: that way, when I want to refer to "the subject" later, I can retrieve it with context included.

>[rashita2 https://twitter.com/rashita2/status/1453318184602275840]: the important thing to remember is that the card method is not a memorandum. It is a device that encourages us to dialogue with our past selves about a subject, and the "context" is there to help us do that. It is not intended to "categorize" or "arrange" information.

>[rashita2 https://twitter.com/rashita2/status/1453318714829406211]: since we don't "classify" or "place", main stream or offshoots are not particularly meaningful either. Simply anything is fine, as long as you can add information to that "context" later.
>See also
>twitter.com/rashita2/statu…

>[pokarim https://twitter.com/pokarim/status/1453321715702894592]: Looking at the Wiki from Zetterkasten's side, I still feel that the need for ID by name as a prerequisite for linking is a very strong restriction, for better or worse. I feel it is a very strong restriction, for better or for worse.

>[rashita2 https://twitter.com/rashita2/status/1453342248016355340]: On the other hand, and this is something I've been doing regularly every week lately, I copy and paste my tweets into my editor and add titles (headings) to them and suddenly I start to clam up. This is in line with the point made in "Outline Processing for Writing" that if you put a heading on what you have written, it becomes an outline.

>[rashita2 https://twitter.com/rashita2/status/1453342603903070215]: In other words, this point goes to the difference between what is often referred to as "stock and flow". It is not whether or not something is preserved, but whether or not something that can be named "it" is generated within you.

>[rashita2 https://twitter.com/rashita2/status/1453354383144411141]: For now, I have settled on developing a two-sided strategy for my memo processing, one in the network direction and one in the outline direction.

>[HitnoteApp https://twitter.com/HitnoteApp/status/1453635867239538690]: In Japan, when we talk about Zetterkasten, the Kyodai-style card is usually cited, but what is interesting is that in the same book, Umesao confesses that he is not good at writing. However, what is interesting is that in the same book, Umesao confesses that he is not good at writing (I am not sure if he really means it or not). This is in contrast to Luhmann, who never bothered to write and maintained high productivity.

>[HitnoteApp https://twitter.com/HitnoteApp/status/1453638493574361091]: I wondered if something essential to Zetterkasten could be found in that difference. I also wondered if there is something that people who think of Zetterkasten as another version of Kyodai-style cards are overlooking.

>[rashita2 https://twitter.com/rashita2/status/1453862953212518402]: I'm going to come up with a card.
>The inspiration memos I have accumulated in Obsidian are randomly displayed on a page to be reviewed, and repeatedly read at appropriate intervals until they are published. choiyaki.com/p20211018/

>[pokarim https://twitter.com/pokarim/status/1454015667460395011]: the characteristic of Zetterkasten is that the cards can be arranged in one dimension in an order that is not chronological itself, even though the structure is linked by multiple types of links I think.

>[pokarim https://twitter.com/pokarim/status/1454018948425412613]: In Zetterkasten, card numbers = IDs are ordered in a row. Without that order, it would be difficult to find a card based on its ID. However, it is hard to believe that the order is only to increase the efficiency of random access by ID.

>[rashita2 https://twitter.com/rashita2/status/1454022151535611910]: We are considering "chains of logic more complex than outlines."

>[pokarim https://twitter.com/pokarim/status/1454022858590461953]: "TAKE NOTES!" can be read as arguing that with digital Zetterkasten, there is no need to insist on a simple all-ordering of all cards. It reads as if it is claiming that with digital Zetterkasten, there is no need to insist on a simple all-ordering of all cards. But I doubt it. twitter.com/pokarim/status...

>[otagaki https://twitter.com/otagaki/status/1454058965961089029]: I was writing the paper while doing the Zetterkasten imitation, but there was quite a leap from the cards to the actual paper. If I had done that with Zetterkasten, I would have run out of time. I still think it's a good idea to start working on it from scratch as a preparation.

>[HitnoteApp https://twitter.com/HitnoteApp/status/1454059067370979330]: What I found interesting in "The Art of Intellectual Production" was the assertion that "we write things down to forget them." I think it is interesting to note that the same thing was said in Zetterkasten's book. I found the same thing in Zetterkasten's book. I've been trying to put that into practice lately.

>[rashita2 https://twitter.com/rashita2/status/1454227843185930240]: However, I felt somewhat caught up in erasing it with this, so I made a page in Scrapbox with my "intention" in writing. I feel like I can safely erase it from my brain memory now. pic.twitter.com/xXj5t1g5qI

>[rashita2 https://twitter.com/rashita2/status/1454228256605949957]: at this point, link to it anyway. Same mindset as Zettelkasten. Make a "connection" with your past pages. That has a double effect. First, as a context (positioning) in your brain. Secondly, in developing access routes to information using that context as a cue.

>[HitnoteApp https://twitter.com/HitnoteApp/status/1454253924727152647]: Isn't Zetterkasten more Twitter-like than Wiki-like? I think Wiki is just a way to organize information and does not lead to the production of ideas. On the other hand, Twitter is more like a series of tweets, where ideas come to you.

>[HitnoteApp https://twitter.com/HitnoteApp/status/1454254486331879424]: If this is correct, then Zetterkasten may be misunderstood. The reason is that of the two types of links on the card, the numbered link is the more important one, and that one tends to be neglected.

>[HitnoteApp https://twitter.com/HitnoteApp/status/1454257768810962945]: I don't fully understand that part... I am not sure if my knowledge of the Zetterkasten numbering method is good enough to begin with.

>[rashita2 https://twitter.com/rashita2/status/1454264630323204096]: I think we should make a distinction between a tool called a wiki and a wikipedia-like usage.

>[rashita2 https://twitter.com/rashita2/status/1454265679863967745]: Zetterkasten cards are not meant to create an outline, so the "structure" (or what appears to be a structure) that stands there does not have much meaning. Rather, the "structure" is created in the references to other cards described in the cards. It gets complicated when this gets mixed up.

>[rashita2 https://twitter.com/rashita2/status/1454266109612355588]: In "Take Notes" it is also suggested to use an outliner when outlining. With digital data, it seems that we can mix and match without distinction, but it would be better to recognize that we are processing different forms of information.

>[rashita2 https://twitter.com/rashita2/status/1454269072271556610]: For example, if you were to create a slip-box in an outliner, it would look something like this. If something you want to put "in between" comes up later, you can just put it in between. If there's a direct contextual relationship, you can indicate that with a link pic.twitter.com/n4E2ef4wkK

>[rashita2 https://twitter.com/rashita2/status/1454269341927542784]: put everything in "one row".
>However, while these pieces of information are "connected," they are not outlines. Or it may be an outline of some sort, but it is not an outline for a specific deliverable.

>[rashita2 https://twitter.com/rashita2/status/1454269780848889860]: Of course, as the small-scale, short-term method was introduced at the end of "Outline Processing for Writing," it could be "a card method for creating an outline for a specific deliverable. It could be a "card method to create an outline for a specific deliverable". However, that is a somewhat different approach from the card method of expanding the network of knowledge.

>[rashita2 https://twitter.com/rashita2/status/1454270914040791042]: The depth of indentation is used in the illustration, but when you do so, you can imagine how "parent-child" or "contextual" the difference is, but it "pre It undermines the original concept of "writing cards with no intended structure, just connections".

>[rashita2 https://twitter.com/rashita2/status/1454271534210551808]: But this is also related to the fact that Luhmann did not see a top and bottom in various (social) systems (he discarded the hierarchy between systems). This is also related to the fact that Luhmann did not see hierarchies in various (social) systems. There is a natural correspondence between his thought and method.

>[rashita2 https://twitter.com/rashita2/status/1454271765698342918]: Of course, it is quite possible that the card method is completely different from Luhmann's philosophy, and that would be interesting to explore.