Pikmin Bloom
[Pikmin Bloom Deco]

2021-11-07
>[nishio https://twitter.com/nishio/status/1454983260342145029]: I've got it!
	[https://gyazo.com/676a0de4bcda55a27acce5d242bc2c92]

>[nishio https://twitter.com/nishio/status/1454984852604743685]: they ask you to put in your username, but don't think you're given any information at that point if this will expose you to others or not.

>[nishio https://twitter.com/nishio/status/1454985634871795724]: petals are consumed over time, so I guess I should start planting flowers and go out, I was planning to go to the bank so I should get ready to go out!

>[nishio https://twitter.com/nishio/status/1454987465018658817]: apparently there is a "[fog of the world]-like" element too!

>[nishio https://twitter.com/nishio/status/1455002704841826309]: Apple's health care app says I've walked 4000 steps, but Pikmin only recognizes 600 steps, what's going on?

>[nishio https://twitter.com/nishio/status/1455005584063746049]: I don't think we should expect too much from the world fog element, since it was implemented in such a way that the area visible changes depending on the zoom level. It's like the density of fog changes depending on the traversing rate of each block in a wide area map, and the block size changes depending on the zoom level.

>[nishio https://twitter.com/nishio/status/1455026654380642309]: I can see the flowers planted by others, but I can't see the IDs of others, and it's a system that creates a vague "feeling that others are also there" with no individual identification.

>[nishio https://twitter.com/nishio/status/1455066502550351874]: to capture the world fog story, though, what world fog users expect is a "it's hiding in the fog, let's go there to clear it up" system, Pikmin Bloom zooms out, the fog boundary goes further and further outward. For example, if you decide "I'll only use the default zoom level," you can use it like the fog of the world.

>[nishio https://twitter.com/nishio/status/1455066744427466752]: in summary, you mean "fog of the world minus the zoom feature".
>Well, of course, it's "plus pikmin", so that's the difference in emphasis.

>[nishio https://twitter.com/nishio/status/1455086774061977603]: I'm at level 7, the only thing that seems to work so far for friends is that I can send them postcards that pikmin sometimes pick up, back in the old Ingres days, my wife I sent my wife a card for a spot I applied for.

>[nishio https://twitter.com/nishio/status/1455096335959347206]: picmin flowers, wiped out, so I guess I'm closing up store today.

>[nishio https://twitter.com/nishio/status/1455099766208032769]: I wonder how long the flowers you plant will last, a week, a month.... It wouldn't be infinite, because the map would be filled with flowers.

>[nishio https://twitter.com/nishio/status/1455149338762510342]: i'm too eager to do pikmin blooms, i think i'll put on my pikmin blooms and do a ring fit adventure on a rainy day!

>[nishio https://twitter.com/nishio/status/1455157073411403777]: can't you work outside your home while planting flowers and moving around (absurd)?
>If the meeting only requires audio, I can manage (...)
>I'd like to work on my computer...
>Yes, a rickshaw with a power supply.

>[nishio https://twitter.com/nishio/status/1455334155785412609]: I went to bed after plucking the picumin completely, but when I woke up the leaves had grown back. I thought they had to be walked on to grow, but it looks like they simply grow over time, so I guess I can pluck them before I go to bed.

>[nishio https://twitter.com/nishio/status/1455337133024038914]: Wife: "If you make the big flower bloom, you will get a goody bag or something" I: "What? I "What?
	>[nishio https://twitter.com/nishio/status/1455337746025775105]: Actions taken by an efficient kitchen to improve efficiency early on often have the opposite effect, which is what the old gamers called "[premature optimization is] the root of all evil" (not true).
	>[nishio https://twitter.com/nishio/status/1455338019121086467]: Wouldn't it be useful to find the nearest Big Flower? I walked around the Big Flower and made it bloom, but simply lost the chance to make it bloom again until it died...

>[nishio https://twitter.com/nishio/status/1455340399715749890]: My wife told me that the Big Flower by our house had bloomed, so I looked at it, and on my screen there were 20 more, I thought I should restart the app, but no I thought about restarting the app, but then I thought, "Wait, wouldn't it be better to go plant 20 more? I don't know if it bloomed right after I planted 20 or after I planted one.
	>[nishio https://twitter.com/nishio/status/1455341515450900482]: From the implementer's point of view, if the current status of the flower is sent by push to all people who can see the flower, it would be a big problem, especially in urban areas where people are crowded. I guess this is why the system is not sharing the current status of the flower in real time to avoid this.

>[nishio https://twitter.com/nishio/status/1455342586181259264]: I used the detector as soon as it became available, because it shows the time to recover, so I thought it would recover in time, but this is one recovery per day, so I should use it when I go to a different environment than around my home. I'd better use it when I go to a different environment than my home area.

>[nishio https://twitter.com/nishio/status/1455344578496647168]: deleting did not reduce the "number planted so far" and "number of steps" counters (I thought that's how I would implement it, so I tried it and it was still the case).
	[https://gyazo.com/2771afcedad99d1ea8c72d535c615275]
	>[nishio https://twitter.com/nishio/status/1455344801155457027]: there is some terminology confusion between "delete location" and "delete history", but only location information is being deleted

>[nishio https://twitter.com/nishio/status/1455403955488374786]: the front side of my right ankle hurt so bad I had to put a compress on it
	>[nishio https://twitter.com/nishio/status/1455407966694219781]: pikminbloom is at level 10, but the physical body level hasn't caught up

>[nishio https://twitter.com/nishio/status/1455413517385748485]: Since the degree of friendship is increased by nibbling, the strategy is to bias the degree of friendship by sorting by degree of friendship and selecting dispatched members from the highest degree of friendship.

>[nishio https://twitter.com/nishio/status/1455416085373620229]: if the cooldown time for planting flowers is 5 minutes, it would be inefficient to go around one big flower, it would be better to find a cycle that can be done in 5 minutes. It would be better to find a cycle that can be done in 5 minutes. Flower decay is faster than expected yesterday. Also consistent with today's observations, it's going to be difficult to cumulatively bloom the Big Flower over several days.
	[https://note.com/stmsy/n/n990ee163ce5a A Guide for Those Getting Started with Pikmin Bloom｜stmsy｜note]
 >[Inetgate https://twitter.com/Inetgate/status/1455435948368416770]: In Hibiya Park, where there are plenty of Ingress portals and Pokémon GO PokéStops, just go around the park and the first big one you encounter There is a good chance that it will be just enough to get you back to your original position from the Flower.
	>[nishio https://twitter.com/nishio/status/1455447297802719240]: In that sense, apart from the 5-minute cooldown for flower planting that belongs to the individual, the "Once the Big Flower blooms, you cannot contribute to the Big Flower's blooming again until it dies after 24 hours. In that sense, apart from the 5-minute cooldown for flower planting that belongs to the individual, the binding of "once the Big Flower blooms, you cannot contribute to the blooming of the Big Flower again until it dies after 24 hours" may be significant. Famous parks, already in bloom, can't contribute.
	>[Inetgate https://twitter.com/Inetgate/status/1455448811820630022]: Ah, I happened to be in the office in Akasaka, Minato-ku yesterday and walked from Jimbocho to Iidabashi via Sakuradamon on the way home, and the big flowers I was walking from Jimbocho to Iidabashi via Sakuradamon on my way home, and I happened to be at the office in Akasaka, Minato-ku yesterday.
		>Big Flower needs a little more observation.
	>[nishio https://twitter.com/nishio/status/1455453359721234434]: maybe the empty state is "300 left" and just passing by without caring, 50 flowers will bloom and "250 left" will be in germination state. From there, there are 5 times more to go.

>[nishio https://twitter.com/nishio/status/1455456297596252161]: I walked around the house for a little over an hour, made 5 big flowers bloom, and took advantage of the errands that came back in a minute to pile up the friendliness to the top pikmin, resulting in 7 were canned and a gift was generated.

>[nishio https://twitter.com/nishio/status/1455457161539047426]: the pikmin I sent on a gift errand are back, but well, they were covered quickly. Since they are roadside x red, that's just as well, I guess. I'll have to avoid "Pikmin that don't need to be raised anymore" from here on out.

>[nishio https://twitter.com/nishio/status/1455457987087134720]: ah, the seal text is place name dependent? This is a flag that people will start to play "make sentences by arranging sticker pikmin" or something like that...

>[nishio https://twitter.com/nishio/status/1455459200524423173]: painful mistake of wearing yellow x waterfront...
>Is there any way to eliminate the pikmin that don't need to be raised in a straightforward manner...
>Or conversely, you can put in your favorites the ones you want to grow...

>[nishio https://twitter.com/nishio/status/1455459600665169924]: petals have already been stocked for about 2 hours, and my physical resources are becoming more of a bottleneck than petal resources. This makes "resting on the bench for 5 minutes with flower planting on" a valid option.

>[nishio https://twitter.com/nishio/status/1455471220942462976]: we now have 13 Deco Pikmin of 8 different types.
>There are three different letter seal picmins.
	[https://gyazo.com/5d7f03d263bb19db8e1bf7e0a4b74e7a]

>[nishio https://twitter.com/nishio/status/1455898209826459655]: "I'm so tired I don't even feel like pikmin," I thought, but I didn't want to waste the date without using my once-a-day detector. I came out to go to the post office for deco pikmin, and after a short walk I felt better and started walking a lot, so my fatigue is due to poor circulation from lack of exercise

>[nishio https://twitter.com/nishio/status/1455911373158768646]: released the 4th color Pikmin!

>[nishio https://twitter.com/nishio/status/1455919751402717185]: By the way, when I walked 8,000 steps to the convenience store on my way home from taking out the trash, I felt "warm" as soon as I entered the store, so my body is cold. I felt "warm" when I entered the convenience store.
>I wish my clothes could be made of feathers.

>[nishio https://twitter.com/nishio/status/1456113473742540805]: It was a nice day and I felt like playing micromanipulation in the daytime, so I came to the front of the station, where Pikmin flowers were planted all over the place, but even there I could I could plant my own flowers there. I guess there is only a 5 minute cooldown with myself, regardless of how it looks.

>[nishio https://twitter.com/nishio/status/1456116371524255748]: I took a bus that stopped at random, buses are not allowed while moving fast, but when they stop at a bus stop or intersection, you can usually plant flowers.
>Pikmin who went out for a snack "What? What's going away from me at a great speed?

>[nishio https://twitter.com/nishio/status/1456119704385323010]: I'm at my first station. Let's have lunch. There was a ramen shop, so I think I'll go here, but I'm torn between having ramen, the restaurant's mainstay, or tsukemen. I like tsukemen, but it's a "we've started serving tsukemen too" kind of thing. The main ramen is soy sauce or salt, but only the tsukemen is thick seafood and pork bone.

>[nishio https://twitter.com/nishio/status/1456128490038706177]: I came back hungry with two flowers nearby, decided on tsukemen!
>I harvested the pikmin that grew up without realizing that the trigger for the end of flower planting allows for a level increase. I should have done a level check first because a new mission after the level increase could be a pikmin harvest.

>[nishio https://twitter.com/nishio/status/1456136035910316036]: if I want to plant a large seedling in an additional slot, and I select the additional slot and choose "plant seedling", if a regular slot is available, it goes in that one. It seems. My wife lamented.

>[nishio https://twitter.com/nishio/status/1455460331984068613]: In the first place, if you order by friendliness, the canned deco pikmin would be at the top. I can exclude them based on their appearance because they are easy to recognize. I think it would be more versatile to put the training targets in favorites.

>[nishio https://twitter.com/nishio/status/1456247765290274825]: I want to go for a night walk in Pikmin Bloom, because I need to walk 4000 more steps to level up, but I get a message that something is wrong with the server.

>[nishio https://twitter.com/nishio/status/1456248174163611653]: oh, wait? Rather, thinking in reverse, why don't I just go for a normal walk since the pedometer data is used to make progress even if I don't run the app?

>[nishio https://twitter.com/nishio/status/1456251983849918469]: Well, I might miss the bonus if the server is not working well when I raise the level, so I'll call it a day off for now.
>The pain in front of my right ankle subsided after applying a compress, but my right hip, which hurt the next time, still hurts.

>[nishio https://twitter.com/nishio/status/1456279351922593802]: i got mushrooms at level 15!
	>[nishio https://twitter.com/nishio/status/1456280855316365321]: is this... a cross between color matching and a daily count limit.... I wonder if it's better to send 4 purple Pikmin to the purple mushrooms I see now, or not send them now and walk around tomorrow to find mushrooms of the corresponding color to the 15 or so red, blue and yellow Pikmin I have...
	>[nishio https://twitter.com/nishio/status/1456282701376278534]: send in small purple mushrooms with 4 purple and 6 red, red is 4 good friends. mushrooms have 6300 HP, Pikmin's attack power? Destroyed the mushroom in 3 minutes and 5 seconds, one star, score 1436. the reward is 2 blueberries and a postcard.
	>[nishio https://twitter.com/nishio/status/1456283052762546184]: all the other mushrooms I saw on the map are gone! I was seeing yellow ones, so I was going to send them there with all yellow and compare!
	>[nishio https://twitter.com/nishio/status/1456298325481693206]: when I came out of the bath, the same kind of mushrooms were back. I'm trying to fight it, but I feel like it's only one star if you've just reached level 15 because, well, it's balanced for higher level people to enjoy. At the very least, you have to have 10 4-star pikmin... and then you can challenge 5 friends...
	>[nishio https://twitter.com/nishio/status/1456299482295853056]: Oh, the same kind is not "the same kind as the one you destroyed", but "mushrooms B and C disappeared when mushroom A was destroyed, but reappeared after some time". It means "mushrooms B and C disappeared when mushroom A was destroyed, but reappeared after some time. Is there a cooldown time?

>[nishio https://twitter.com/nishio/status/1456411913437396992]: I feel like the implementation of the mushrooms being displayed in the otsukai column and "3 otsukai are available" on the top page is an exposed implementation convenience.
 >[nishio https://twitter.com/nishio/status/1456424616763691033]: And don't keep showing up on the top page saying "I have an errand" even when the pikmin are too tired to send any more today.
 >[nishio https://twitter.com/nishio/status/1456425576378494979]: wow, I see, I was using the flow "the whistle from the pikmin assembly scene, when there is an otsukai, a button appears and you get the otsukai screen from there". But now that the unattainable mushrooms are treated as otsukai, the otsukai button always appears, so I guess I can't use it to determine if there are any otsukai or not...those mushrooms are so annoying!

>[nishio https://twitter.com/nishio/status/1456418043463045137]: I happened to see a mushroom that someone else was hitting, so I sent reinforcements, but the timer on my side started at the beginning of their attack, so on the bonus. I guess I didn't gain much. It will be a short time before the pikmin come back though.

>[nishio https://twitter.com/nishio/status/1456827343100542981]: one more step shaken, rebooted and not filled...
	[https://gyazo.com/2a34f71e52f13e3d54c1995aa29fddf9]

>[nishio https://twitter.com/nishio/status/1457297016904585218]: I don't know what switches the pikmin bloom between state A, which is reflected in the number of steps after a few seconds delay when you wave your arm, and state B, which is not. Is it something to do with planting flowers, because from state A, I went outside and said "I'm almost leveled up, let's walk", turned on flower planting, and after a while I noticed it was in state B.
 >[nishio https://twitter.com/nishio/status/1457298772917035014]: As for how to get out of state B, I have already confirmed that it is not possible to get out by restarting the app or by ending flower planting, and so far the most that seems to be the case is "a few minutes after the end of flower planting minutes after the end of flower planting". I wonder if state B might be extending the frequency of step count updates to 5 minutes or something. That's why it doesn't seem to reflect the number of steps.
