Calibration Session Partial Open Experiment 2
The subject of this issue is "What is [fun]?" This time, the theme is "What is [fun]?
　When you are immersed in something enjoyable, don't you feel that it is not "enjoyable" in real time, but it becomes "enjoyable" after the fact?
　Isn't the feeling of "fun" that occurs beforehand something else?

[https://youtu.be/LBub-GT-mjI]

　What is Fun?
　　[nishio.icon] "You seem to be having a lot of fun lately regarding this experiment" What did you see that made you think it was fun?
　　[Tomoya Tachikawa.icon] Over the past week or two, there has been an overwhelming increase in "I want to do this kind of thing" from Mr. Nishio, "[I'm] getting on board.
　　[nishio.icon]A third party infers that the other person's inner life is "[fun]" by observing [getting on].
　　　I see them being [active], and I say, "That looks fun."
　　　When "fun" is important, it is not important whether it looks "fun" to others, it is important that the person himself/herself is "fun".
　　[Tomoya Tachikawa.icon]Did you feel that Nishio-san was "having fun" during the past two weeks?
　　[nishio.icon] I didn't think it would be "fun."
　　　Subjectively, I'm just chatting about an idea that came to me.
　　　Not even subjectively "on board".
　　　　I'm thinking about it while I'm not conscious of it and throwing it into the chat because a new idea came to me.
　　　　"[Immersed]".
　　　　　When you are immersed in a theme, you are merging with it and becoming one with it ([subject-object union]), so you don't look at it from the outside ([subject-object separation]) and think, "This is fun.
　　[Tomoya Tachikawa.icon] Fun, interesting, getting on, cannot be observed by the person himself in real time.
　　　And "what he thinks is important" is not wrong either, two seemingly contradictory stories mixed together.
　　　You don't know it's "fun" until someone else points it out.
　　[nishio.icon]Not that others are.
　　　You don't observe yourself during the enthusiasm, so you don't realize that you are in a state of enjoyment, and you look back afterwards and say "[after the fact]" and "[it was] fun.
　　[Tomoya Tachikawa.icon] "[Looking forward to] plans" and "Looking forward to" are subjective.
　　[nishio.icon]未来だね
　　[Tomoya Tachikawa.icon] I look forward to the day before the excursion, but on the day of the excursion, I leave for a time.
　　[nishio.icon] More specific "There's a flower like that! Butterflies are flying!" occupy your mind.
　　[Tomoya Tachikawa.icon] Solving a riddle in Osaka, while I was doing it, I thought, "Wow, this is fun.
　　What made you think [nishio.icon]?
　　[Tomoya Tachikawa.icon]There were well thought out craft puzzles that I thought were fun when I was doing them.
　　[nishio.icon]A counterexample of how sometimes you realize how much fun you're having while doing it.
　　[Tomoya Tachikawa.icon] It was a long time, I wonder if it has to do with time.
　　[nishio.icon]You mentioned that you weren't aware of the fun all the time for a long time, but that there were moments when you suddenly thought it was fun, and I suspect there were triggers that he was unaware of.
　　　You can have fun while you're playing a game, but you can't afford to have fun while you're fighting hard in a real-time strategy game.
　　[Tomoya Tachikawa.icon]To have fun, you need to be able to afford it.
　　　Athletic club activities, I think I had fun after I retired.
　　[nishio.icon] "Life should be fun" is the basic premise, but if "fun" is observed after the deed is done, how to make life fun is a very difficult problem.
　　[Tomoya Tachikawa.icon] It is not fun now to have plans to look forward to in the future. Fun is not observable in advance, and it can be depressing. A schedule to look forward to is also "fun" in advance, not depressing.
　　[nishio.icon]After the fun schedule is over, will it really be "fun"?
　　[Tomoya Tachikawa.icon] It would be "fun," but the quality seems a little different.

The story after this.
　Aren't "fun" and "enjoyable" two different things?
　What about "interesting" and "fun?"


Preliminary Considerations and Policies
　今回の方針: 
　 The Concept of Interesting
　 Do not care for third parties who are not there,
　 Start the rally as soon as possible
　Last time, the verbal commentary to a third party who was not present prevented the transition to a "[ping-pong rally]-like situation," which is explicitly prohibited.
　Share the theme at the start point in advance.
　　This smoothes the transition to the rally.
　　When the video is published, you can write "This is a 10-minute conversation about this topic.
　　　The viewer can understand what will be discussed in advance, rather than being shown something he or she doesn't understand.
　　　　Improves the viewer's receptivity
　　The theme was supposed to be "interesting," but due to a conversation we had in the hours leading up to the start of the event about how much fun we've been having lately, I mistakenly chose "fun" as the theme.
　　　Well, no harm done.
 Derivative Subjects
 	[Decisiveness is cultivated by training oneself to focus on one's emotions.]
 		It explicitly says at this point that "interesting" is included in the "emotion" of "focus on emotion" in this. So there is synergy with the "let's dig into what is interesting" idea.
 		[Tomoya Tachikawa.icon] I think you are using "focus on the emotion" and "properly subjective" in almost the same sense.
 		[nishio.icon]I feel like there is a difference
 	[Tomoya Tachikawa.icon] "What is lying?"
 	　Nishio still hasn't pieced together how this is connected.
