Obsession with Euclidean spatial cognition
Space is represented in three directions: front, back, left, and right, up and down.
　The physical body of Homo sapiens
　Bringing you into a virtual world free from ties
　　Similar to sticking to a handwritten resume.
　Appropriate means should be chosen depending on the purpose.

>[shokai https://twitter.com/shokai/status/1458164430953271297]: isn't WiKi with lots of different pages still more Metaverse-like than an online conference system with 3D avatars?
	>[nishio https://twitter.com/nishio/status/1458165651000868866]: If you use a browser extension or something to show the icon of the person who is currently opening the page on the Scrapbox page, you could call it a metaverse. It would be a meta-verse, because we can see and communicate with the people who are there.
		>(By that logic, Google Docs is already a metaverse)
	>[shokai https://twitter.com/shokai/status/1458168007356649475]: scrapbox is already a metaverse since the cursor is visible
	>[nishio https://twitter.com/nishio/status/1458168117511688193]: yes it was!

>[nishio https://twitter.com/nishio/status/1458168061400211457]: people who are not free from the legacy communication means of voice are going to say "this is not a metaverse", but if you communicate by voice If you communicate by voice, people who can't hear will need subtitles, and it's terrible for people who can't see to express themselves by their position in 3D space, and if it's from text, they can use speechreading.
	>[nishio https://twitter.com/nishio/status/1458168577597468673]: Huh? No kidding, isn't "[character metaverse]" more new-agey than the "so-called metaverse" which is tightly coupled to a 3D physical body metaphor?

>[nishio https://twitter.com/nishio/status/1458170620638732289]: "People today confuse the metaverse with 3D virtual space, but if you go back to the origin -" I tried to argue that it was a 3D virtual world from the origin ( 1992 Neal Stephenson)
	>[nishio https://twitter.com/nishio/status/1458171892687273985]: we have to create a whole new word now. Because the structure of the space is not Euclidean but network-like [netiverse]!
	>[nishio https://twitter.com/nishio/status/1458172162225836035]: "Old people stuck in Euclidean spatial perception, don't come to Netiverse!"
