I can't write steadily.
A journal I wrote when I was working on the first book I ever wrote in my life.
　At that time, I wrote that I hoped to be able to run a full marathon in the future, but 14 years later, now that I think about it, I am not yet able to run a full marathon...
　I realized differently after I wrote, "I seem to have become selective about the races I compete in that produce results in the shorter races."
　　I'm not in a race, [- I'm running in a direction where no one else is running] I'm running on a road where no one else is running.
　　Let's put it on another page: [Running on a road where no one is running].

[Hatena2007-12-08]
	>Jython Book Writing Diary
	> I think it was a mistake to try to imitate the type of person who writes continuously and persistently when I don't have [the ability to continue] in the first place. What would happen if I were to suddenly run a full marathon now and try to follow a veteran runner? I think that's what happened.
	> I would like to be able to run a full marathon in the future, but for now it's not possible. And the constitution can't be changed overnight. So you should solve the problem in a way that works for you.
	> In other words, I can't write in a way that builds up [tips and tricks] now, and I should do something more barbaric. By "[barbaric] things," I mean that when I was asked to make a calculator, I made a function calculator that can define functions because just making a calculator is not interesting, or when I was asked to make a rock-paper-scissors agent, I thought that if the rules are random OK, the algorithm might not win even if I tried, so I ran with the story and made a one-liner, Or, when asked to talk about Jython in 5 minutes at the head of a session in the early afternoon when you feel sleepy, you make Fibonacci audible with MIDI to wake up the audience. Why don't you do a few more cases of that kind of savagery and write about it? And then, after you've done those wild things, why don't you make a chewed up commentary on it?
	> I mean, you're already emulating class inheritance with hashes, outputting Fibonacci music to files, and doing other pretty barbaric things...
