waste of time
Some of the things described by the words "[old], [old man], [old age], [aging]" are not really age-related, and I haven't come up with a word to describe them until now.
I think "[Busy], [Busy people], [Busy harm], [Busy harming]" is a good idea.

I read that as "sunstroke."
　I don't understand what you mean by "the other side."
　To begin with, the word "Busyman" is not "Kajin" but "Hijin" (a person of leisure).

The log of the beginning ----.
>[wozozo https://twitter.com/wozozo/status/1460587081021886472]: timeline is full of barmuda dis
>[xCherrycaRAMELx https://twitter.com/xCherrycaRAMELx/status/1460526383763845121]: I know the Barmuda phone is getting a lot of bad press, but when it was announced, it was so disparaged by gadget enthusiasts on Twitter. I don't know, I've often heard people say that no one would buy a Barmuda phone, but when it goes on sale, people around me usually buy it, so I don't know.

>[nishio https://twitter.com/nishio/status/1460598556432109573]: DISing a product you won't buy if it improves doesn't make the world a better place...
>When I see people who feel good doing that, they look like people who feel good smoking [opium] in an opium den (I've never seen that).
	>[nishio https://twitter.com/nishio/status/1460600031333924870]: oops, DISing homo sapiens who won't buy it if it improves doesn't make the world a better place, shut up and mute it!

>[nishio https://twitter.com/nishio/status/1460620511440879618]: I've been thinking about "how not to [become] old" and although I thought "[old]" might not be appropriate because there are cases where people are young and yet old. I hadn't found an alternative. Today I realized that "[Busy]" could be it.
	>[nishio https://twitter.com/nishio/status/1460621421722300418]: people who are passionate about creating something are not "busy" enough to DIS something that others have created because they are busy, but in reality There are a lot of people who can't be enthusiastic about such actions, and those people are "harmed".

>[nishio https://twitter.com/nishio/status/1460621733384179713]: still a little rough around the edges, but this is the first good bud I've seen in a while!

>[nishio https://twitter.com/nishio/status/1460623512431779841]: As the phrase "[the pain of birth]" suggests, creating something involves suffering, and many people want to avoid suffering. As a result of avoidance, they become "bored. The fact that suffering increases with physical weakness also encourages this tendency, creating a correlation between "old age" and "leisure time.

>[nishio https://twitter.com/nishio/status/1460623968021274624]: whether the label "spare time" is appropriate for this concept is open to consideration. Because "someone who is forced to do so many things they don't want to do that they use up all of their time and energy in life and are unable to do projects that they can be [enthusiastic about]" is clearly a type of "spare time."
	>[nishio https://twitter.com/nishio/status/1460627126931976195]: I put "[making things]" in opposition to "spare time" because I enjoy making things, but not only that, for example, sports and music are also in opposition to "spare time". I think.
	>[nishio https://twitter.com/nishio/status/1460627896049934336]: maybe they are pleasures combined with suffering, and those who avoid suffering will not get the pleasures either, so they will be tainted with easy opiates

relevance
	

>[Nao000_com https://twitter.com/Nao000_com/status/1460634661432946691]: i was thinking the same thing
>Personally, I feel like "the devil" in my spare time twitter.com/nishio/status/...
	>[nishio https://twitter.com/nishio/status/1460795777937141766]: "[The devil is in my spare time]" twitter.com/Nao000_com/sta...

>[UFO84 https://twitter.com/UFO84/status/1460722525302714370]: I feel that describing this as "[suffering]" could be misleading to some. I think "[bitterness]" might be more personal in the sense that some people can enjoy including it twitter.com/nishio/status/...
	>[nishio https://twitter.com/nishio/status/1460797377812459521]: sure. It's like pouring bitter coffee over sweet ice cream [affogado] twitter.com/UFO84/status/1...

>[nittakeshi https://twitter.com/nittakeshi/status/1460771536739045377]: The "Mere Old Man" sometimes gave useful advice, but the characteristic of the "Mere Old Man" who does harm is that he is jealous of the "Mere Old Man" who cannot be enthusiastic and gives up to protect himself. The order of the "Mere Old Man" is that he is jealous of the "Mere Old Man".
>Those who could be enthusiastic but have given up are not harmed, but those who are not enthusiastic but have achieved w may be harmed.
>Education experience dependence? twitter.com/nishio/status/...
	>[nishio https://twitter.com/nishio/status/1460795667090067456]: "[jealousy to protect yourself for not being enthusiastic and giving up]" It became clear twitter.com/nittakeshi/sta...


Creative Learning Learning and Education in Creative Society
　https://twitter.com/matsudotsuyoshi/status/1461114721323470848?s=21
