know one has enough
[Lao Tzu's Dao Te Ching, Chapter 33]
> The knower is wise, the self-knowing is clear.
> The winner is strong, the winner is strong.
> [Knowledgeable] people are wealthy. The strong doer is willing.
> "Long live the one who loses his place. Long life for the dead.
>
> "He who knows man is wisdom, and he who knows himself is clarity.
> He who wins over others is strong, but he who wins over himself is mighty.
> He who knows what is enough will be rich, and he who is strong in action will have ambition.
> He who has not lost his place has long been with us, and he who dies but is not lost has long been with us.
	[Lao Tzu Moral Sutra - Wikisource https://ja.wikisource.org/wiki/%E8%80%81%E5%AD%90%E9%81%93%E5%BE%B3%E7%B5%8C]

A is good, B is better." repeated four times.
　It's good to know that [satisfaction] is a good thing, and it's even better to keep working on it.

The death and deathless part.
　>Once a person dies, he returns to life and becomes a hermit in another remote land.
 https://kotobank.jp/word/尸解-72332
I've heard that there are people who interpret it to mean "I'm serious...".
　For example, there is an implicit conflict axis of "who wins and who doesn't win over others."
　On that oppositional line, you say, "It's better to be the one who wins over others," and then you say, "But it's even better to win over yourself."
　　We're doing a [dialectical] transcendence of conflict.
　　　Related: [dialectical development] [false dichotomy].
　I think Lao Tzu wrote all four with that composition in mind.
　So the context of "what loses its place doesn't live long, what doesn't lose its place lives long, and it's nice to live long, but..."
　In this context, to me it reads, "I don't care if the physical body outlives or not, it's even better to leave behind [an idea that does not perish after death]."

relevance
　[I am the only one who knows.]
　[The wise man is immortal.]
　[Only performance endures.]

Expansion of pertinent judgment
	[Lao Tzu] [Moral Sutra].
　[longevity] [immortality] [death but not perish] [death but not destruction] [death but not immortality] [immortality]