Frequently used items box
　Phenomenon: I put a label on the box that says "Frequently Used Items" but
　Often not used.

　I hadn't opened it in a while and said, "Oh, here it is."
　Not in scope when looking for something.


　The label "frequently used" doesn't give a clear picture of what's inside.
　Label it too abstract and you can't see what's inside.
　　Physically invisible to begin with.
　　The label needs to be an appropriate summary of the contents
　　　Same as page title in Scrapbox
　　　If the contents are not organized in a messy way, it will be difficult to title it.

"Frequently Used Items."
　Observation Fact: Not used often
　why
  発生過程
  　In a situation where I had to move things due to a major renovation, I foresaw that if I put pens, wallets, and other "frequently used items" in the right place, I would have to look for them later, so I decided on one box and put them there.
  　And it wasn't appropriate to label it as "frequently used."
  　These boxes "are closed, you can't see what's inside, and they're costly to open."
  　　Not a good idea to have it in the bedroom instead of at the desk where you actually use it, not at the cost of opening it.
  　　High cost of getting in and out.
  　Then the really well used ones were taken out of there and used and not put back in the box.
  　

The Box of Stuff That's Straying from Classification."
　When other things are sufficiently classified and the classification system is sufficiently internalized.
　Create a box to put things in when you see things and have trouble finding a box to put them in.
　This should only be done when there's not enough to go in here, and the boxes are mass produced with no idea what's in them.
　If a beginner superficially imitates the techniques of an advanced tidier, it will only make things worse.



Because you don't put what you use back where you found it.

Reducing the number of likely locations is a good idea.
Increase the efficiency of your search
Design of spaces with good search performance for physical objects
Don't look for pens in the fridge.

I thought about it.
