Eugene Gendlin's Metaphor Concept
In [Eugene Gendlin's] [Experiential Processes and the Creation of Meaning], the concept of [metaphor] is introduced as one of seven ways of working in Chapter III, "How [felt meaning] works.
It is one of the latter, divided into parallel functional relationships/creative functional relationships.
	Parallel functional relationships are [direct matching],[reaffirmation],[clarification].
	Creative functional relationships are [metaphor], [understanding], [association], [phrasing].

Although "metaphor" is used as a translation of "metonymy," Eugene Gendlin's argument holds equally true whether it is "life is like a journey" or "life is a journey," so the distinction between direct and metaphorical is not necessary. Here we use "metaphor. If we dare to translate it into Japanese, I think it would be appropriate to say "to compare".

The "felt sense" will likewise be referred to as "[felt sense]."

Metaphors create new meaning.
　Ordinary symbols are directly related to habitual felt sense.
　Metaphors are not directly involved in the habitual felt sense of the symbols used
　　Apply that habitual felt sense to new areas of experience.
　　This creates new meanings and new tools of experience.
　The "red rose" [symbol] literally [symbolizes] what it is.
　　Symbolization of old meanings
　If we say here, "My lover is like a red rose," here a new symbolization of meaning occurs
　　What is happening in this process?
　　Use "reaffirmation" and "direct matching" in the first half of the explanation here.
　　The old felt sense of the predicate symbol (red rose) is invoked by "reaffirmation"
　　Another area of experience is also invoked by the main part symbol (my lover), which is also a felt sense
　　Neither has ever been further differentiated or "clarified", a "mass of felt sense", an "undifferentiated mass"
　　By matching these two masses, a new aspect of the mass emerges

The area that follows, "How can we distinguish between metaphor and understanding?" is also interesting, but I'll write about it another time.

Table of Contents
  A: Parallel functional relations of perceived meaning in cognition
   DIRECT REFERENCE
   2. RECOGNITION
   3 Clarification (EXPLICAT10N)
  B: Creative functional relationships ("specific" and "non-parallel")
  	METAPHOR
  	2 understanding (COMPREHENS10N)
  	3 related (RELEVANCE)
	  4. phraseology (CIRCUMLOCUT10N)
