It would be good to get organized on the concept of metaphor.

[/nishio/kei.icon]What would you like to see happen in this conversation?
[/nishio/human.icon]It would be nice to get organized on the concept of metaphors.
[/nishio/kei.icon]What kind of "metaphor" is that?
[/nishio/human.icon]The creation of metaphors accelerates the linguistic process.
[/nishio/kei.icon]Is there anything else about that "metaphor"?
I've been re-reading [/nishio/human.icon][Eugene Gendlin's metaphorical concept] to see if it seems relevant, but I haven't quite made the connection for myself yet.
[/nishio/kei.icon]Where is that "metaphor"?
[/nishio/human.icon]I feel like I'm floating in the air right now, I'm not hungry.
[/nishio/kei.icon]
 > I've been re-reading it because I thought it might be related to Eugene Gendlin's concept of metaphor, but I haven't quite made the connection for myself yet.
 How do you know this "metaphor"?
[/nishio/human.icon]Metaphors are born, you see what is born, this is a metaphor.
[/nishio/kei.icon]Where is that "metaphor"?
[/nishio/human.icon]What this "my use of the word metaphor" refers to is the image of a fish that is in a sea of non-verbalized things and sometimes comes up near the surface of the water, but with this metaphor, I'm not sure how it connects to "accelerated verbalization".
[/nishio/kei.icon]What does that "metaphor" look like?
[/nishio/human.icon]何か別のもの
[/nishio/kei.icon]
 > I've been re-reading it because I thought it might be related to Eugene Gendlin's concept of metaphor, but I haven't quite made the connection for myself yet.
 What "concept" is this "concept"?
[/nishio/human.icon]Eugene Gendlin's concept of metaphor is one of the seven ways of working of the felt sense, a creative functional relationship
[/nishio/kei.icon]What kind of "Eugene Gendlin" is that "Eugene Gendlin"?
[/nishio/human.icon]A philosopher who discussed the experience process and the creation of meaning from it
[/nishio/kei.icon]What kind of "creation" is that "creation"?
[/nishio/human.icon]意味が新しく作られる
[/nishio/kei.icon]What "meaning" is that?
[/nishio/human.icon](that's a very abstract question)
[Most people do not understand "making meaning" in relation to their own experiences. When he says, "I tried to put something into words that I couldn't express in the common usage of words, so I expressed it as a personal metaphor," this is an imagining of meaning by metaphor, or in Merleau-Ponty's terms, an "emerging language" that has not yet been institutionalized.
[/nishio/kei.icon]Is there anything else about its "meaning"?
[/nishio/human.icon]Would it be easier to convey the idea that you cut out a part of the experience and assigned a new word to it, rather than describe it as having created meaning?
[/nishio/kei.icon]What do you value?
[/nishio/human.icon]This discussion is a verbalization of the "process by which useful things are produced," and if we can clarify this point, we may be able to find ways to support it. If we can support it, it will be beneficial because it will improve the intellectual productivity of humankind. Personally, I would like to let people produce intellectually without human intervention, but whether this is possible or not remains to be seen.
[/nishio/kei.icon]
 > Most people do not understand "making meaning" in relation to their own experience, and a more obvious way of expressing this is when they try to put into words something that they cannot say well, and since it could not be expressed in the common usage of the word, they express it as a personal metaphor. This is an imagining of meaning by metaphor, or, in Merleau-Ponty's terms, an "emerging language" that has not been institutionalized.
 What do you hope will happen regarding this "metaphor"?
[/nishio/human.icon]Now, I was thinking that the concept of metaphor that I had been using and the concept of metaphor that Eugene Gendlin was using were not well connected, and I wished they could be.
[/nishio/kei.icon]What needs to happen to the "metaphor" for that to happen?
[/nishio/human.icon]I just realized that this is the process of creating a new meaning by the reaction of the two felt sense chunks as Eugene Gendlin described in the metaphor process. So first we divide those two symbols into "yumetapha" and "nimetapha. Then we form the metaphor "Nimetapha is Umetapha". Then a new aspect would be born.
[/nishio/kei.icon]With respect to "metaphor", can it?
[/nishio/human.icon]やってみよう
[/nishio/kei.icon]
 > I just realized that this is a process where new meaning is created by the reaction of two felt sense chunks as Eugene Gendlin described in the metaphor process. So first we divide those two symbols into "yumetapha" and "nimetapha. Then we form the metaphor "Nimetapha is Umetapha". That would create a new aspect.
 Where does this "metaphor" come from?
[/nishio/human.icon]Nimetapha comes from a sea of unspoken experience, and Umetapha is not told where it comes from.
[/nishio/kei.icon]What kind of "verbalization" is that?
[/nishio/human.icon]It's a mass of felt sense being carved and mapped to a symbol.
[/nishio/kei.icon]What kind of "felt sense" is that "felt sense"?
[/nishio/human.icon]created by experience and fluttering around without being symbolized.
[/nishio/kei.icon]What kind of "symbol" is that "symbol"?
[/nishio/human.icon]Anything, just a random string
[/nishio/kei.icon]
 > I just realized that this is a process where new meaning is created by the reaction of two felt sense chunks as Eugene Gendlin described in the metaphor process. So first we divide those two symbols into "yumetapha" and "nimetapha. Then we form the metaphor "Nimetapha is Umetapha". That would create a new aspect.
 Is there anything else about this "Eugene Gendlin"?
[/nishio/human.icon]Hmmm, not really now.
[/nishio/kei.icon]
 > Nimetapha comes from a sea of unspoken experiences, and Umetapha is unspoken where it comes from.
 Is there anything else you can tell us about this "verbalization"?
[/nishio/human.icon]In Nimetapha, the sea and fish were distinguished, but in Yumetapha, the carved sea is the fish.
[/nishio/kei.icon]What kind of "umetapha" is that "umetapha"?
[/nishio/human.icon]Two different symbols are connected by an equal
[/nishio/kei.icon]Is there anything else about that "symbol"?
[/nishio/human.icon]Nimetapha is not a yumetapha? I feel like it's a process of yumetapha generation.
[/nishio/kei.icon]What is the relationship between that "umetapha" and "metaphor"?
[/nishio/human.icon]Yumetapha is talking about after the metaphor is born.
[/nishio/kei.icon]Is that "yumetapha" the same as "metaphor"? Are they different?
[/nishio/human.icon]No, Umetapha is referring to the use of old symbols after coming up with the idea of using them to express a new experience, and he calls it a metaphor, while Nimetapha is talking about the front part of how he came up with the idea.
[/nishio/kei.icon]What happens to the "metaphor" during that "yumetapha"?
[/nishio/human.icon]The metaphor is already done, so it won't change.
[/nishio/kei.icon]
 > No, Umetapha calls it a metaphor, referring to the use of an old symbol after one comes up with the idea of using it to describe a new experience, while Nimetapha is talking about the front part of how one comes up with the idea.
 Is there anything else you can tell us about this "umetapha"?
[/nishio/human.icon]Since this is the second half, should I delve into the nimetaphors in regards to what I want to do? Useful for an explanation of what happens objectively when a metaphor is created in Nimetapha.
[/nishio/kei.icon]What is the relationship between that "nimetapha" and "metaphor"?
[/nishio/human.icon]Nimetapha looks at the process of catching a big fish
[/nishio/kei.icon]Is that "nimetapha" the same as "metaphor"? Are they different?
[/nishio/human.icon]No, the result of the Nimetapha is the symbol used in the metaphor.
[/nishio/kei.icon]What happens to the "metaphor" during that "nimetapha"?
[/nishio/human.icon]新しく見出される
[/nishio/kei.icon]
 > No, the result of the Nimetapha is a symbol that is used because it could not be metaphorical.
 What kind of "nimetapha" is this "nimetapha"?
[/nishio/human.icon]Nimetapha has been likened to "pulling up a big fish with a hook," a process of combining small metaphorical symbols and pulling out new symbols that have not yet been revealed by the relationships between the symbols.
[/nishio/kei.icon]What is between that "nimetapha" and "metaphor"?
[/nishio/human.icon]Each hook is a you-metaphor, and each one hammered in creates a new aspect to the mass of felt sense.
[/nishio/kei.icon]What is the difference between that "umetapha" and "metaphor"?
[/nishio/human.icon]What is between the individual youmetaphors and metaphors in the nymetaphors... The metaphor, a giant fish, is enclosed by the aspects created in the individual youmetaphors
[/nishio/kei.icon]What happens to the "nimetapha" during that "metaphor"?
Feedback occurs on [/nishio/human.icon]nimetapha to make it even stronger.
[/nishio/kei.icon]Is there anything else about that "nimetapha"?
[/nishio/human.icon](図を描いた)
　[Eugene Gendlin's and Nishio's metaphors]

https://keicho.netlify.app/#talk=sXcyKIrASwfnJaBG7OaX
#KeichobotLog