I want to put Keichobot in context.

[/nishio/kei.icon]What would you like to see happen in this conversation?
I want to put [/nishio/human.icon]Keichobot in context
[/nishio/kei.icon]What kind of "Keichobot" is that "Keichobot"?
[/nishio/human.icon]Listen first.
[/nishio/kei.icon]Yes
[/nishio/human.icon]Groupware facilitated the distribution of written information.
[/nishio/kei.icon]"Groupware"
[/nishio/human.icon]However, it is only "written information" and this is a weakness of the current groupware.
[/nishio/kei.icon]"Groupware"
[/nishio/human.icon]The problem is that the "blurbs that can't be put into words well" in particular don't circulate until they are put into words. Because it is easy to see "what is put into words," it is misinterpreted as if it is the entirety of opinion.
[/nishio/kei.icon]"A blur that cannot be put into words well."
[/nishio/human.icon]It is often the responsibility of individuals to verbalize and transmit their moya-moya, but many individuals feel that they are not good at it. The advantage of an organization is to increase productivity as a whole by having those around you cover for the individual's unskillfulness.
[/nishio/kei.icon]"Moya Moya"
[/nishio/human.icon]The human-powered solution to this is "listening," and discussions on good listening methods have been held, with names like "listening" and "coaching" being given to it.
[/nishio/kei.icon]"Listening"
[/nishio/human.icon]This can create a quality experience if the listeners are trained to "not impose their opinions," etc., but using [live people] is expensive.
[/nishio/kei.icon]"Opinion"
[/nishio/human.icon]So replacing this with software, instead of losing quality, creates another advantage: you can use it whenever you want.
[/nishio/kei.icon]"Benefits"
[/nishio/human.icon]For example, it can be used while taking a walk early in the morning, or while taking a bath late at night.
[/nishio/kei.icon]"Early morning"
[/nishio/human.icon] It is based on Clean Language, a coaching technique. In this method, the listener asks only questions and does not express his or her own opinion.
[/nishio/kei.icon]"Listener"
[/nishio/human.icon] In this method, listeners are trained to use only the words used by the speaker and not to change them to other words based on their own interpretation. However, this is something that requires training for humans, who are prone to self-interpretation, but software is rather good at it.
[/nishio/kei.icon]"Listener"
[/nishio/human.icon]I was going to talk about how it works, but that's not the context, so we'll do that another time.
[/nishio/kei.icon] "Context"
[/nishio/human.icon]Oshimaa
[/nishio/kei.icon]"Listener"
[/nishio/human.icon]The End
[/nishio/kei.icon]What would you like to see happen in this conversation?
[/nishio/human.icon]I want to organize about the context of Keichobot
[/nishio/kei.icon]What is the "context" of this "context"?
[/nishio/human.icon]Why were you born and why do we need you?
[/nishio/kei.icon]
 > In this method, listeners are trained to use only the words used by the speaker and not to interpret them arbitrarily and change them to other words. However, this is something that requires training for humans, who are prone to interpretation, but software is rather good at it.
 What kind of "listener" is this "listener"?
[/nishio/human.icon]People who are not able to put their mumbo-jumbo into words, and when they hit on the words of others, they are influenced by them and prevent themselves from forming their own thoughts.
[/nishio/kei.icon]What do you value?
[/nishio/human.icon]That such people can put their moya-moya into words.
[/nishio/kei.icon]What kind of "moyamoya" is that "moyamoya"?
[/nishio/human.icon]A mass of "feelings" (felt sense) that have not yet been put into words that come from what the person has experienced.
[/nishio/kei.icon]
 > What such a person can do to put his/her bewilderment into words.
 Is there anything else you can tell us about this "blur"?
[/nishio/human.icon]Treasure trove, if it is covered by what is already in words, no moyamoya remains, so in the moyamoya lies knowledge that the organization has not yet acquired.
[/nishio/kei.icon]What is the relationship between that "word" and "moyamoya"?
[/nishio/human.icon]Can't tell others if it remains a blur.
[/nishio/kei.icon]How do you know its a "blur"?
[/nishio/human.icon]You can tell by feeling somewhat uncomfortable or unsettled.
[/nishio/kei.icon]
 > Can't tell others if it remains a blur
 What do you hope will happen regarding this "blurring"?
[/nishio/human.icon]When you can express that in words, you say, "Yes! This is what I wanted to say!" and you'll be happy.
[/nishio/kei.icon]What kind of "word" is that "word"?
[/nishio/human.icon]Things that express feelings
[/nishio/kei.icon]
 > Can't tell others if it remains a blur
 Where does this "blurring" come from?
[/nishio/human.icon]Comes from personal experience
[/nishio/kei.icon]
 > When it can be expressed in words, you say, "Yes! This is what I wanted to say!" and you'll be happy!
 Is there anything else you can tell us about this "word"?
[/nishio/human.icon]In order for the person to be able to express himself/herself and be happy, it is enough if the expression can be understood by the person himself/herself first, and the process of making it into an expression that others can also understand can be done after the "language that only the person can understand" has been created.
[/nishio/kei.icon]Where is that "word"?
[/nishio/human.icon]Near the surface of the blur
[/nishio/kei.icon]Where is that "blur"?
[/nishio/human.icon]Well, maybe in the mind.
[/nishio/kei.icon]
 > In order for the person to be able to express himself/herself and be happy, it is enough if the expression is first understood by the person himself/herself, and the process of making it into an expression that others can understand can be done after the "language that only the person can understand" has been created.
 Where is this "word"?
[/nishio/human.icon]From the surface of the blur, "words that only the person can understand" emerge and are passed on to others. Whether or not others can accept or understand it is a relationship between the words and that other person, not something the narrator should worry about beforehand
[/nishio/kei.icon]Is that "word" the same as "moyamoya"? Is it different?
[/nishio/human.icon]No. Words are born from mumbo-jumbo.
[/nishio/kei.icon]Where is this "blur"?
[/nishio/human.icon]If you divide the mind into the surface and the deep, it's in the deep.
[/nishio/kei.icon]
 > No. Words are born from mumbo-jumbo.
 What does this "blur" look like?
[/nishio/human.icon]The sea, like the primordial sea in Mesopotamian mythology, is a sea of fertility, a sea that gives birth to many things, itself chaos, clean fresh water flowing into it, giving birth to diverse gods, which in turn shaped the world.
[/nishio/kei.icon]
 > No. Words are born from mumbo-jumbo.
 How do you know this "word"?
[/nishio/human.icon]You can tell by the way the words come out and it feels right.
[/nishio/kei.icon]Where do these "words" come from?
[/nishio/human.icon]Words are acquired through learning with "institutionalized" meanings. However, when we are faced with "moyamoya" that cannot be explained in words, there are no appropriate institutionalized words to express the moyamoya. Therefore, existing words are used to express the new experience, and this is Eugene Gendlin's metaphorical creation of meaning.
[/nishio/kei.icon]What happens to the "moya-moya" at that "word"?
[/nishio/human.icon]If the words and the fuzziness are "compared" and they feel right, the fuzziness is expressed in words and disappears. On the other hand, if the feeling of discomfort still remains, the fuzziness is broken down into smaller pieces by comparing the words and the fuzziness and digging into what is the same and what is different.
[/nishio/kei.icon]What is between that "word" and "blurred"?
[/nishio/human.icon](This is a difficult question...)
[/nishio/human.icon]Sometimes a probability spontaneously arises from a state of blur, but it is inefficient to leave it to luck and wait for it to happen. In Mesopotamian mythology, fresh water flows in, and in the case of my sea and fish metaphor, casting a net, or in the current implementation of Keichobot, the software is trying to increase the probability of words being produced from the moyamoya by asking clean questions
[/nishio/kei.icon]What happens to the "word" during that "blur"?
[/nishio/human.icon]Words acquire new meaning
[/nishio/kei.icon]What would you like to see happen regarding that "word"?
[/nishio/human.icon]It is not beneficial just to create new meanings for words or new meanings for words. That is like a child thinking of a cool special move name. It becomes beneficial when the new combination of created words and meanings brings about an economic benefit to the thought
[/nishio/kei.icon]What needs to happen to the "word" for that to happen?
[/nishio/human.icon]In the case of a word that is understood only by an individual, the use of the word as a tool for thinking needs to cause an increase in the efficiency of thinking. In the case of words that are used by multiple people, the words need to reduce the cost of communication. (Of course, it is preferable if this indirectly improves the efficiency of the organization's thinking and the thinking of individual members of the organization.
[/nishio/kei.icon]Can you do that with respect to "words"?
[/nishio/human.icon]This is a challenge. Some words will be, some will not. It is not something that "does," but rather some of the many that are generated "become. At least through repeated calibration meetings with Mr. Tachikawa, the phenomenon of the actual creation of that kind of thought-economy language has become an observable fact.
[/nishio/kei.icon]What does that "word" look like?
[/nishio/human.icon](Oh, I see, I wonder what it is, this is a very important question. I can't think of an answer right away, but if I could answer this, it would be a good way to end the day. My first thought was "this is exactly what the word is", but I don't think that says anything.
[/nishio/human.icon] I thought "like a cog". An explanation as to why it is a cog has yet to emerge, but that will come later.
[/nishio/kei.icon]
 > In this method, listeners are trained to use only the words used by the speaker and not to interpret them arbitrarily and change them to other words. However, this is something that requires training for humans, who are prone to interpretation, but software is rather good at it.
 Is there anything else you can tell us about this "listener"?

https://keicho.netlify.app/#talk=I4ZXOqWcCNNP4Gw7Vnas
#KeichobotLog