Big Five (e.g. car makers, TV companies, etc.)
[/villagepump/bigfive]
[https://gyazo.com/402548b1e5706eb584b6c8b2e546cda8]
extroversion

Total score (elementary score): "6" ★ Stage: Very low (Number of question items: 6 Maximum 30 points)

Determining if mental energy is directed outward.
High people are able to interact with others in a positive manner. Feelings are outgoing.
Good communication skills.
Keywords: outgoing, talkative, cheerful personality
■ [Those who are very low]: Tend to have a strong introverted personality. Tends to be interested in one's inner self and focuses on what one likes to do. Not good at interacting with others. They do not socialize with a wide range of people and may tend to keep to themselves. When acting, they think things through, but may be hesitant to actually act. You do not need to force yourself to change your introverted nature, but it would be desirable to place yourself in an environment that suits you. Try doing something you are passionate about, such as something artistic or creative, or actively doing something that interests you. Make the most of your introverted nature. If you want to change your personality, try to increase your opportunities to interact with people in a positive way.

emotional stability
　

Total score (elementary score): "29" ★Stage: Very high (Number of question items: 6 Maximum 30 points)

Determines if the person is mentally balanced and stable.
Keywords: emotional stability, not brooding, emotional stability
◇[High]: The emotional stability is very high. Usually, they are emotionally stable and have few extreme emotional ups and downs. They feel secure in their interactions with others. They do not get frustrated and take it out on others or things, nor are they emotionally distraught, which gives people around them a sense of relief. They are able to maintain emotional stability even when they are having a bad day, and are skilled at controlling their emotions.

integrity

Total score (elementary score): "14" ★Stage: Normal (Number of question items: 6, maximum 30 points)

Professional, ambitious, and hardworking. Judges the type that does not like to do things halfway and acts thoroughly.
Keywords: thoroughness, accuracy, hard work, professionalism
* [Ordinary]: Basically, they are honest, diligent and hardworking. I am a person who follows the rules and regulations of the group. Although sometimes you may be lazy, such as doing only what you like, it is good to make an effort with the intention of challenging yourself in order to develop yourself. Doing things with integrity is important to gain the trust of those around you, and it may be a good idea to review your daily life, have the habit of persevering with things, and devote yourself to things that you can work on.

cooperativeness

Total score (elementary score): "6" ★ Stage: Very low (Number of question items: 6 Maximum 30 points)

Determines the type of person who can work well in teams with those around them.
Highly adaptable people are the type who can adjust to their surroundings and get along well with others.
Keywords: teamwork, camaraderie, group behavior, cooperative behavior
■ [Very low]: Self-oriented rather than cooperative, perhaps a little uncooperative. They tend to put themselves before others or the environment, or to be highly individualistic, and may at times be self-centered. Although they may be difficult to approach because they dislike taking orders from others, they have a strong independent spirit that allows them to act without being misled by others, and they are the type of person who accomplishes things on their own. They have the autonomous ability to carry out something from themselves rather than being ordered by others. It may be a good idea to maintain a balance between cooperativeness and individuality according to the environment and one's role.

openness

Total score (elementary score): "26" ★ Stage: High (Number of questions: 6, maximum 30 points)

◆Points: To determine whether the candidate is intellectually curious, tries new things, and increases his/her experience and knowledge.
Keywords: intellectual curiosity, intelligence, desire for novelty, inquisitiveness, openness to experience
◇[Higher]: They have a tendency to be open to new things and things to do. They have strong intellectual curiosity and are interested in improving their knowledge and skills. They are also able to come up with original ideas and value the experience of constantly seeking new and stimulating challenges. People with a high degree of openness tend to be problem solvers and good at finding new possibilities. They tend to be interested in new tools and information.

self-gap

Total score (elementary score): "6" ★ Stage: Very low (Number of question items: 6 Maximum 30 points)

Feelings of inferiority, lack of self-confidence, etc.
■Key words: self-gap, inferiority complex, worthlessness
◇[Very low]: The person does not feel a gap in himself/herself and tends to value his/her own personality very much. In addition, they have confidence in themselves in life. It would be good for them to find the role they should play and what they can do, and to further build on their strengths.