Encourage misunderstandings and early retirement.
>[YuzoKano https://twitter.com/YuzoKano/status/1463994102811271170]: i think the restructuring in the 50s is getting much more serious. I look at resumes almost daily and there are probably half of them over 50.
>Annual income is also rising, and many candidates are very difficult to hire because of their lack of expertise.
>And because of the big-company disease, "We can input big-company know-how into your venture." the claim that "the know-how of large companies can be input into the venture.
>[YuzoKano https://twitter.com/YuzoKano/status/1463994712935710726]: I don't have management experience, so they won't go so far as to build the know-how of a large company by themselves.
>And since he was going from a large company to a small one, he asked for a higher annual salary.
>It doesn't work because the idea is large company >> venture and from my point of view.
>[YuzoKano https://twitter.com/YuzoKano/status/1463995280848678915]: you need to explain the benefits of hiring someone with a high annual salary from the small company's point of view.
>The logic is, "I was at a big company and now I'm going to a small company (after restructuring), so of course I should be paid that much. You guys need to be adults in a big company, don't you?" I can see this in their eyes.
>[YuzoKano https://twitter.com/YuzoKano/status/1463995932505108481]: I think this attitude will not solve the mismatch.
>I think what the restructuring group of large companies in their 50s needs to seriously rethink is their own market value in the absence of a large company brand.
>The labor market is flooded with similar candidates. I don't see that.
>[YuzoKano https://twitter.com/YuzoKano/status/1463996565354278914]: management experience, brilliant career, professionalism.
>If that is not the case, it would be better to switch heads and become someone who can work with his hands as well as the younger people.

>[shin_semiya https://twitter.com/shin_semiya/status/1464251909468876803]: this is not 100% on the part of the middle aged either!
>We conduct seminars and "career review counseling" for the targets of the outcasts in the early stages of restructuring at large companies!
>But a company that has been losing money can't offer you the opportunity you deserve.
>(continued)
>[shin_semiya https://twitter.com/shin_semiya/status/1464252585099988993]: "It would be a shame for you, who are amazing, to rot away without being able to utilize your abilities."
>"Why don't you use the skills you developed at a large company in a venture or other business?"
> and you're tickling their pride while agitating them.
>At the same time as this, another HR person says, "We're going to reduce your salary and you're going to be asked to do some stabbing dandelion work."

>[shin_semiya https://twitter.com/shin_semiya/status/1464253120217698315]: "The union did a pretty good job and we are still making a lot of concessions in terms of treatment."
> and I will not forget the Imperial Union AGE.
>I mean, "I've already talked to the union, so there's no point in crying about it."
>The counselor I mentioned earlier adjusted his expectations, saying, "Not that they decide as quickly as younger people," but "The venture is small, so the slots are quick.

>[shin_semiya https://twitter.com/shin_semiya/status/1464253601283383300]: it will be filled, right? The early bird gets the worm, and if you hesitate for a year, that's how long the slots in the good places get filled."
>and you urge them to make a decision quickly.
>The counselor whispers, "I'm an ordinary guy, but I'm going to make it big in my venture business! The counselor's whispered dream is similar to the dream of a Naro novel.
> or rather, the very thing.

>[shin_semiya https://twitter.com/shin_semiya/status/1464253866808004619]: The subject who thought he could do TUEE, "My pride won't allow me to do sashimi dandelion work, and if I can be active in a great way, I'll just change jobs! I'll change jobs!" And you are encouraging them to apply for early retirement.
>By the time you realize you've been duped after a year or so of job searching, all avenues of retreat are closed and you can't withdraw your resignation.

>[shin_semiya https://twitter.com/shin_semiya/status/1464418572080275462]: I was going to say "otherworldly reincarnation of Naro novels" but it's pretty close.
>Even people who can't do anything serious enough to be the target of an eviction will be made to think they can TUEEE me.

>[shin_semiya https://twitter.com/shin_semiya/status/1464426274303066113]: kimo is
>"Transferred to a department with a shitty job where I'd be treated worse and my pride wouldn't allow it."
>"I'm going to retire early, get extra retirement pay, change jobs, and use my amazing skills to TUEEE me.
> to make it seem as if there are only two options.
>It's called "double binding" and it's a talking technique used when you want to set someone up.
	[False choice of two].

>[shin_semiya https://twitter.com/shin_semiya/status/1464426770732515330]: I know some of the ways to push people not to take the option of "don't sign early retirement, but I'll still look for a new job", but that's pretty tough. I know some of them, but it's pretty tough.
>An ordinary person who soars would sign it.

>[nishio https://twitter.com/nishio/status/1465954409804746758]: sense of sophistication in how to [terminate] unneeded instances efficiently
>I got the same feeling when I heard that they divided the legal entities by what was necessary and what was not, so that each entity could operate on an independent budget.
	[move the good stuff].
