Existence and Time
>"Being and Time" ("[Sein und Zeit]", 1927) is the main work of the German philosopher Martin [Heidegger].
> The goal of this book is stated in the preface as follows. The goal of this book is to answer the question of the meaning of being in concrete terms. It is the goal of the following essay to interpret time scholastically as the ground that makes possible the comprehension of all existential content in general.
[https://ja.wikipedia.org/wiki/存在と時間 Existence and time - Wikipedia]


[https://ja.wikipedia.org/wiki/目的論 Objectivism - Wikipedia]
>In the so-called modern philosophy centered on Europe (Germany and France) after Martin Heidegger, existence itself is also produced by one's own interest (the way one faces the world).

World = Within = Present as Being
>Heidegger insisted that any analysis of immanence must always begin with the "event itself," that "we are in the world. According to him, the existence of the present must be seen and understood "a priori" on the basis of the unified structure of being, "In-der-Welt-sein" (world-within-being). He begins his analysis by focusing on the multiplicity of the structural occasion of "world-in- being" and divides it into three structures: "worldliness of the world," "co-existence," and "existence within the world" (Part 1, Chapter 2, Section 12).

interest
>Heidegger argues that the wholeness that unifies the entirety of each structure of world-in- being obtained through the above existential analysis is "concern (care, Sorge)" (Sorge), but since "concern" here is merely a preparation for the goal of developing the question of being, it is ontologically implied as well It must be something that is According to his ontological analysis, the present being, in its average everydayness, is "fallen" (Verfallen), disclosed, non-projective, but projectively "understood" (Verstehen), and brought into relation to its own possibility of being in the world, in the co-being of the being with other beings and the world. On the other hand, the non-presence of the world is not a thing that is present. On the other hand, the being in the world that is not present has its mode of being defined by its "instrumentality" (Zuhandenheit) and objectivity. Therefore, it is necessary to clarify the ontological linkage between interest, instrumentality, and objectivity in order to further the argument.
