The Story of Your Life (Spoiler Alert)
[heptopod says].

>The story is told in the form of linguist Dr. Louise Banks speaking to her unborn daughter on the day she becomes pregnant with her daughter.
> 
> Dr. Banks was asked by the military to assist in communicating with an alien with a radiosynthetic body that has initiated first contact with humans.
> 
> They were referred to as heptopods (seven-legged) and had two languages. Heptopod A, a speech language, was characterized by free word order and a deep hierarchy of clauses embedded in the center of sentences, making it difficult but not impossible to understand. On the other hand, heptopod B, a writing system, had a two-dimensional structure that was completely different from that of speech languages, allowing multiple sentences to be written with a single giant symbol, and also making it impossible to extract a single semagram without changing the meaning of the entire sentence. This means that when writing in heptopod B, the writer must know the ending of the sentence at the beginning of writing.
> 
> This phenomenon is understood by the successful contact of the physics group, which had been difficult to make. The heptapods, who did not understand basic physics, understood Fermat's principle. This principle describes the refraction of light in such a way that "light knows where it needs to go from the beginning and chooses its path to minimize the time it takes to get there. Although Fermat's principle and other variational principles were counterintuitive ideas to mankind, they were among the fundamental physical principles for heptopods.
> 
> Dr. Banks understands from the information of the Physics Group and the phenomena of Heptopod B that their method of time perception is simultaneous ([Objectivism]), not sequential (causal) as is the case with humanity. In their perception, cause and effect, premise and conclusion are interchangeable, and there is no difference between the future and the past. Conversely, mankind's causal theory is incomprehensible to heptopods, which is why basic physics has been incomprehensible to mankind for so long.
> 
> Dr. Banks becomes able to think in a heptopod-like manner by practicing heptopod calligraphy. This gives her knowledge of future events, and she glimpses happy days with her yet unborn daughter, a breakup with her husband, her daughter's growth, and an accidental bereavement with her daughter.
> 
> Dr. Banks cannot change his behavior, knowing that tragedy awaits him in the end. This is because heptopod-like thinking creates the impulse that one who knows the future must not tell anyone about it, but must act in accordance with the future as he knows it. Knowing that she must leave her husband and daughter in the future, she is determined to pay attention to everything along the way and not miss a single detail. Throughout the story, future events are mentioned in the future tense, interspersed with communication with the heptopod in the past tense, as Dr. Banks "recollects" the future as well as the past.
> 
> The heptopods left Earth suddenly one day. It was never revealed why they came to Earth and why they left.
[https://ja.wikipedia.org/wiki/あなたの人生の物語#プロット Story of your life - Wikipedia]

>Mysterious spaceships appear around the world, and linguist Louise Banks (Amy Adams), physicist Ian Donnelly (Jeremy Renner), and U.S. Army Colonel Webber (Forest Whitaker) begin investigating.
> 
> Louise and Ian join the quarters commanded by Webber and others. There, their mission is to discover the purpose of the flight of two extraterrestrial "heptopods" in the spaceship. After much trial and error, they begin to decipher the written language of the heptopods, which is drawn as if sprayed with ink. In parallel, Louise is plagued by flashbacks of scenes featuring her daughter dying of illness and herself as her mother. It feels like a memory of the past, but she has never had a daughter.
> 
> When Louise asked the heptopods what their purpose was in their script, the response could be interpreted as "they came to Earth to give humanity 'weapons = tools'". The Chinese military, seeing this as a threat, closes the communication lines and begins preparing for war with the heptopods.
> 
> Louise and Ian rush to confront the heptopod again, but some officers, seeing the aliens as a threat, plant a bomb in the spaceship, which explodes during the confrontation, opening the battle between heptopods and humans. Louise and Ian, saved by the aliens' gravity control, decipher the heptopod's last message, a huge, complex message that says, "If the world cooperates and combines the messages given by each spacecraft into one, humanity will receive something from the heptopods," but they can no longer communicate with the world's researchers. The communication lines had been cut off and a war with the heptopods was about to begin.
> 
> Louise boarded the saucer alone in a capsule-like object dropped from the sky. There she learned the real reason the heptopods came to Earth. They are giving them a gift so that they can be saved from humanity in 3000 years. Louise also learns that heptopods are timeless and that the scene she was flashing back to is her own future. The "tool" that the heptopods wanted to give to humanity was the heptopod's written language itself. The heptopod written language is a non-linear ideographic script with no tense, and requires advanced computational skills and a non-linear conception of time to handle. As Louise learned the heptopod language, she was able to perceive the future as heptopods do.
> 
> With the outbreak of war imminent, Louise calls Shang Shang, a senior general in the Chinese army, and tries to persuade him. When told of his wife's dying message, which no one was supposed to know, Shang agreed to be persuaded, the war was stopped, and the communication lines with researchers around the world were once again connected. Sensing that the world was united, the heptopod spaceships disappeared one after another like smoke into the sky. After the heptopods left, Louise had her first meeting with Shang Shang at the party and obtained the cell phone number and his wife's message that she needed to persuade him.
> 
> On the side of the retreating camp, Ian proposes marriage to Louise. Louise accepts the proposal, knowing that her subsequent breakup with Ian and the inevitable fate of her unborn daughter's untimely death are inevitable.
[https://ja.wikipedia.org/wiki/メッセージ_ (film) Message (film) - Wikipedia]

[存在と時間]
