What is Philosophy?" by Ikutaro Nishida
from [Introduction to Philosophy].
[What is [philosophy]?"
 Philosophy is the study of the "worldview" of what the world is like and the "lifeview" of what life is like, what human beings do, and how they should live their lives.
	[Philosophia]: love knowledge.
  Sophia (knowledge) included technical intelligence. Purification began with Plato.
 [Plato] classified knowledge into two categories.
 	[episteme], KNOWLEDGE
  [doxa], opinion
  The knowledge that philosophy pursues is episteme, and that
  Plato did not define philosophy itself. It was Aristotle who first defined it.
 [Aristotle] used philosophia in the sense of what we now call "scholarship."
  Philosophia includes physics and other sciences.
  The next volume of physics, [Metaphysica], which is what we now call philosophy, was called "[first philosophy]," the study of existence itself.
  	>His writings were arranged by Andronicus around A.D. 30, when a group of writings pertaining to the foundation and root of his quest was placed after the group of naturalistic writings classified as the Ta Physika (rare: τὰ φυσικά, ta physika, the book about nature (about)). Since the group of works did not have a definite name, the early Aristotelian school called this group of works the ta meta ta physika (τὰ μετὰ τὰ φυσικά, after (the book about) nature). This was shortened and became established as "metapysica" (R: μεταφυσικά, R: metaphysica), which became the root of each Indo-European word in later periods, for example, the word "metaphysics" (metaphysics) in English.
  		[https://ja.wikipedia.org/wiki/形而上学 Metaphysics - Wikipedia] #Metaphysics
  In other parts of the book, he also said that philosophy reveals the highest principles and causes.
  It is not clear what Aristotle thought of the relationship between existence and cause. Perhaps he thought that true existence is the true cause.
 Aristotle considered philosophy thoroughly and purely as a theoretical matter.
  On the other hand, there are those who have come up with philosophies that answer practical questions. They are Stoa and Epicurus.
   [Stoa] believed that the purpose of philosophy was [the pursuit of] virtue.
   [Epicurus] believed that the purpose of philosophy is [the rational acquisition of happiness].
   Although the purpose is different, the philosophy is similar in that it is not simply a search for knowledge for knowledge's sake, but a way of handling life.
   Of worldview and lifeview, Aristotle focused on the former, Stoa and Epicurus on the latter.
  Later, a philosophy of religious salvation and enlightenment appeared ([Procrustes]).
   And the purpose of philosophy became "to know God," [theology].
 mediaeval philosophy
  Very strong Christian influence.
