Temporary memory while reading
一時記憶の容量不足
The process of following the letters and taking the meanings, and the process of collecting the meanings taken and assembling the understanding.
Lack of parallel resources
The resulting quote is a short phrase taken out of context
　If you don't understand it, all you can do is quote it.

Making a reading notebook.
　Don't let [the raw brain] do the "remembering."
　Reduce re-entry costs by digestion of input and output
　Paper notebooks are used as the physical implementation method for this
　　Is this appropriate?

How to make a reading notebook
　紙
　　Cannot search
　　The cost of writing neatly is high.
　　　because of ...
　　　　Cut corners and have dirty handwriting, which increases the cost of re-input.
　　　　Summarize the text without proper citation and with a short-sighted view
　　　　　Related: [Don't let homo sapiens abstract you].
　　　　If the style is to write from the beginning, the source is not clearly indicated, so it is difficult to trace back to where it was written afterwards.
　　　　　In contrast, the way to take care of this on paper is to "first create a heading for every 10 pages".
　Take notes on your iPad
　　Can be selected and copied after writing, or moved and organized
　　The problem of typing text is a hassle, for example, if the book you are reading is in PDF and open on your MacBook, you can simply copy-paste
　　　Effects of Clipboard Sharing Between Apple Products
　　　With paper books, there's no way around it.
　　　　Shoot and OCR?
　　　How about Kindle?
　ScrapboxとKozanebaの比較
　 Searchable
　 　Kozaneba is not yet searchable
　 The problem of unknown provenance is avoided by "make the container first" operation as with paper notebooks.
　 Illustrations are drawn on an iPad and screenshots are posted.
　 　It's more work, but there are fewer situations to paint, so it's tolerable.
　 　The iPad side is also a good place for picture-driven notes.
　 Can copy after writing, Scrapbox has less freedom of movement.
　　　Often there are concerns about how to express what you want to express with less expressive tools.
　　　　Oh, is there an option here [Kakau]?
　　[drawback of constant font size].
　　　Short keywords with "lumped meanings" are more important components in assembling understanding than longer sentences that are not summarized.
　　　However, in a system where text size is constant by default, longer text takes up more screen real estate and attracts the eye.
　　　Well, but can this be accepted as a first step and then copied to Kozaneba for manipulation?
