semantic triangle
[https://gyazo.com/a0f55ccc824cd30a69967d9142020dc0]
>Ogden's most enduring of her research articles is her co-authored (with [Ivar Richards]) "[The Meaning of Meaning]" (1923), which has been reprinted many times. The book straddles the boundaries of linguistics, literary analysis, and philosophy, but draws attention to the concept of "signification" created by en:Victoria Lady Welby (Ogden was a student of hers) and the semiotics of [Charles Sanders Purse]. in 20th century Anglo-American philosophy, "[ meaning of meaning]," an important step in the "linguistic turn," presented principles for understanding the function of language and explained the so-called "triangle of meaning." It includes the peculiar phrase "Gostak distimu dosh.
[https://ja.wikipedia.org/wiki/チャールズ Kay Ogden Charles Kay Ogden - Wikipedia]
[Charles Kay Ogden]
[Ogden]

[https://gyazo.com/1b75e8e48816aafbaa3dd22cc0bab256]
	[Meaning of Meaning] p.56
	The annotation reads, "See chapter 5, p. 160."

What was the point of this diagram?
　There is no direct connection between a symbol, e.g., the word "dog," and an object, e.g., a creature seen on a street corner.
　The simplification that there is a direct semantic relationship between words and things is the cause of the difficulty
So the diagonal is solid, but the base is dotted, there is no direct relationship here, which is what I was trying to say.

Chapter 5
　Definition of [True Symbol
　　>A true symbol is a symbol that correctly records proper instructions.
　　A set of words that usually takes the form of a proposition or sentence
　Distinguish between "false propositions" and "[incorrect propositions]."
　　I wonder what the word for "incorrect" would be in the original text.
　　　INCORRECT because TRUE and CORRECT are used in the original diagram.
　　>An incorrect symbol is a symbol that, in the world of a given story, gives the appropriate interpreter a different indication in the mind of the speaker than what is being symbolized.
　　[https://gyazo.com/71649d88bc8e92715bf07eb1e2140591]
		[nishio.icon] To say that a symbol Y is an incorrect symbol is to say that it is a symbol in such a way that the instruction X, which is symbolized in speaker A's mind to Y, and the instruction Z, which is generated in the mind of interpreter B when he hears Y, are different.
		　Since the interpreter does not appear in the discussion of whether a symbol is true or false, we know that "false symbols" and "incorrect symbols" are two different concepts
		　True is a relationship between the symbol and the indicative, so in that sense we can see that it's a completely different concept than the correctness of the symbol.
