Phenomenology as non-logical steps
from [phenomenology as an illogical stage].
Phenomenology as non-logical steps
Gendlin, E.T. (1989). Phenomenology as non-logical steps. In E.F. Kaelin & C.O. Schrag (Eds.), Analecta Husserliana: Vol. 26. American phenomenology: Origins and developments (pp. 404-410). Dordrecht, Netherlands: Kluwer. From http://previous.focusing.org/gendlin/docs/gol_2165.html

(DeepL)
	As an undergraduate, I developed a way to communicate with religious people and atheists, Marxists and McCarthyists, behaviorists and Freudians.
	My method was to accept their entire system for now and express what I wanted to argue in their language.
	Then he explains, "I am not agreeing with all of this. I was simply postponing all other arguments in order to make one point. I realized that any system can be shaped by any one point.
	Because "that" point had different implications that I deferred to.
	The difference was obvious. But what is the same thing? In what respect does "it" remain "that" point beyond the formulated one?
	In my case, once I had a "point", I had to form "it" into another form, and then into yet another form." "It" was not a common denominator with little or nothing in common. Rather, "it" has a strange "order" that reacts differently to different formulations. Not only do "it" react in the same way to different systems, but also to different purposes, backgrounds, and even allegiances to particular groups.
	If anything, I found it more interesting that there is no consistent pattern that incorporates all of the "dots" as they are.
	When there is a point. I wait for the words to come out. If I am interrupted at that stage, I may forget what I was trying to say. When that happens, I will be looking for different ways to get "it" back. Oh ...... Okay. ...... So that's what I was trying to say!" And. It had an implied language, but not a set of words.
p.405
	The same was true of remembering forgotten dreams. How does one come back to a dream event buried in the strange murkiness left behind in the dream?
 I did not want to think only in concepts. I did not want to think only in terms of concepts; I wanted to think with everything.
 When I entered the University of Chicago, I signed up for the most advanced seminar. In my first class, Richard McKeon wrote three columns on the board. The left column is dialectics. The middle column is Functional Patterns. On the right side is the familiar Reductionism to Primitive Units. Next to it are the words "definition" and "demonstration." Definition," "Demonstration," and "Principle." And they explained how they work in their respective columns.
 I was excited. This is my method!" I was excited. After class was over, I ran up to him and asked, " Can you translate, can you say the same thing in all three columns?" No," he said." It's always a different point." I replied, "I know. If you say it in different words, it will mean different things, it will be a different point. But what do you cross with?" He denied crossing over." The same word is nothing more than an utterly empty commonplace. They only have meaning within their respective systems."
 I already knew why he said that, but still knew that I could move sideways from one point to another. But I had no way to figure out why he could do it. It took me 10 years to figure out how.
 During that time, I recognized myself as a phenomenologist. In the other first class, Jean Wall taught us new works by Sartre and Merleau-Ponty. I read Husserl and Binswanger. The phenomenologists were the other half of my method. They knew that "a point" was more than its formulation.
 However, the phenomenologists did not solve my puzzle either. Nor did they ask why each formulated it differently. What Merleau-Ponty found in "function" and "precision," Sartre, Hegel's opposite, did not find. From the beginning, Husserl simply separated knowing, feeling, and will. They did not consider how the conflicting approaches could all be "lifted". They could not handle the differences as I could.
 I still need to talk about my third major source of information. Joachim Wach (who worked for the old Husserl) led me to Dilthey, which was not yet translated at the time. I lived in Vienna until I was 12, so I knew German.
p.406
 Dilthey is still underappreciated. He brought creativity to my problem. Understanding is creative. Saying "the same point" in different ways is creative. And for Dilthey, to experience is to understand. Dilthey said, "In principle, anything human can be understood. We can understand it if we go its way and let it make itself in us. But then it makes itself in us again. That is further creation. We understand "it" better than we understood "it" when it was there.
 Dilthey freed us from the need for separable objects of understanding. But he wanted a Kantian list of the kinds of empirical connections ("Strukturzusammenhänge"). I found that impossible. Each kind of progression (each kind of step) can further produce others, so they become its instances. But this "instance" is the order I was looking for.
 The phenomenologists correctly stated that statements can have mere logical meaning or they can "bring out" something more. But the phenomenologists, like other philosophers, disagreed among themselves. The "phenomenon" seemed to them to be merely an assertion." We knew there was more to "it," but how?
 That "more" can be found by examining the progression of how to proceed. If it does not logically follow from the last step, but it can follow the next step, how does it follow? It is moving from "more than logic," i.e., from "what is lifted up." It can only be seen in the progression.
 Phenomenology is a progression of certain thought steps. In my subsequent paper, I tried to strengthen and modify phenomenology by abandoning "mere description" and pointing to "progression." In Nathanson's Empirical Phenomenology, there are ten neat "signposts" that distinguish phenomenological sequences from other sequences.
 In Experiencing and the Creation of Meaning, seven types of progression are presented. Each encompasses and sequences the others. I pursue that order.
 We do not lose the power of logic. But we are more specific and precise than logic allows. The difference lies in the way we move. From sentences come not only logical movements, but also a variety of illogical ones.
 It is not relativism, but the exact movement of each "kind" of transition.
 These "kinds" are not just 10 or 7 kinds. They can even create new kinds. They differ only in some respects. But some kinds allow us to think beyond formal order and disorder.
p.407
	At this time, Carl Rogers was developing client-centered therapy in Chicago. His therapists did not impose interpretations. I had to see it, but that was my problem. They trained me. Soon I wrote a paper reconstructing their theory, not therapy, but can you distinguish this? Does the experience of therapy not come from the therapist's theory? No, it does not. It is much more complex than that. Freud called it "work through". He knew that his approach would have an impact, but it would not create complexity.
 Rogers' therapist responded to "emotions," he said. But they did not mean only emotions such as anger, fear, or guilt. They reacted to the whole complexity." When she does that, you feel helpless."
 The client sits there in the fuzzy complexity of that feeling of "helplessness". The next step comes not from the notion of helplessness, but from its complex quality. 'I'm not helpless, but I have this strange certainty that my way won't work.' And from there, one step further, "Oh ... ... It will work, but ... ... Hmmm."
 These steps can be understood as one of my transitions.
 At this point, Rogers describes his main unresolved problem. That is, how could he check his new consciousness against his "biological experience" in order to confirm that the repression had been lifted? He wanted the truth in correspondence. I had another way.
 Instead of looking for experiences before they are symbolized, we can compare different kinds of steps, i.e., different kinds of steps to go further. Steps such as those just described can be distinguished from other steps. This became the "experience scale," which is still being studied; I described it in the February 1986 issue of American Psychologist. Successful outcomes (defined variously) are correlated with steps such as. The logical mode, the mode of describing events, and the mode of expressing emotions alone will fail.
 This study has garnered some attention. Rogers reconstructed his theory in "Becoming a Person," citing my book. I received an award from the American Psychological Association's Division of Psychotherapy (1970). I founded the journal Psychotherapy and edited it for 13 years.
 I subsequently developed a method of teaching these steps that is now called "Focusing". This is because therapy often does not teach this mode. Politically, I am in favor of letting go of "expert" knowledge. Phenomenology clarifies what is initially vague so people can find it. This teaching is both public and (in this one respect) improves the training of experts.
 Focusing consists of phenomenologically laid out steps to obtain (certain) phenomenological steps, as are Focusing (1981) and Let Your Body Interpret Your Dreams (1986). Focusing has been published in eight languages.
p.408
	Such "success" kept me running around for a while. I gave keynote speeches at the A.P.A. in Japan, gave lectures all over Europe and Japan, and wrote the same thing over and over again. But I could not bring about the change in phenomenology itself that I wanted. I have to explain that.
 Did I expect to change the entire field? In my mind, high expectations and very low levels coexist, and I am amazed at what I can do. I can't give in to either. The gap between the two makes me laugh.
 Why didn't the phenomenologists follow my lead and examine the transitions? Today, the emphasis is on illogical transitions, which only glorifies disorder. Phenomenological transitions have not yet been evaluated and must now come back under another name. Let me tell you a little about myself.
 I had heard that Heidegger was a Nazi, so I did not read him until 1963. Then, through those who had read Heidegger, I learned how much I had learned from him. in 1964, Cixent Mihai brought me (from Regnery) a useless translation of "Die Frage nach dem Ding". I reworked all the text and wrote an "Analysis." I sent the book to Heidegger. I wrote him this. In the "Analysis" I explained all the points I did not understand at first. He replied. You have written a very perceptive and insightful afterword. This will make my work more accessible in your country," he replied.
 He was always kind to me in these matters. And/or he saw that I showed him that I grasped his mores way of thinking. He never disagreed with it.
 I further developed a new model, using many models at once. My new "process model" retains both logical forces and illogical movements.
 I collaborated with physicist Jay Lemke on a new research project. We applied my new research to particle anomalies. This became the "Critique of Relativity and Localization" in Mathematical Modeling.
 Many philosophers avoid physics for fear of bringing reductionism into philosophy. They also avoid human experience for fear of bringing psychology into it. The "ontic" ones are afraid of bringing alien explanations into philosophy.
 But Heidegger knew better. Everything must be brought into philosophy and questioned how it is conceived, so that it may be different.
 He rejected the word "feeling" (as I have found that therapists usually do not respond to what "feeling" implies)." Befindlichkeit," "mood," "thowness," and "dwelling" are "understanding beyond what cognition can reach." (B&T I-5) To bring into thought does not mean to put a topic under thought as its basis. Rather, no topic is exclusive to that category. Anything can reconsider itself as a "happening." In his words, the kinds of "transitions" I am studying are different ways of "letting be" and "happening."
p.409
	Of course, there is no final list of methods. Each way opens up more ways, both in ourselves and in others. But some ways also allow us to learn, be present, and speak out a great deal.
 However, Heidegger's "dwelling" and "befindlichkeit" were misunderstood. People did not understand how the complexity of the situation ("throwness") was implied in the "mood" and how one would think with it. They did not imagine that the thought of dwelling could be discovered and implemented. It is like a puzzle.
 Part of the blame for this lies with Heidegger. He moved dramatically away from phenomenology and attributed happenings to "history." In doing so, he addressed the problem of "phenomena" inseparable from language and history. But many misunderstood it and thought as if all experience was an old idea. But that "history" seems to come from over there, not from us. Heidegger did not mean it that way. History happens by dwelling. He was always calling for "thinking - dwelling".
 If everything is the old form, where does "[dwelling]" go? Dwelling is like going further up from the top of the mountain than just standing on the old form.
 The "phenomena" appeared to be independent. Now all experiences appear to be totally dependent and derived.
 My phenomenological reforms were not addressed. Of course, I believe the following. 'That is why phenomenology is rejected today. The general assumption of a neutral, uninterpreted "phenomenon" had to fail. But the style has changed to the assumption that all experience derives only from implicit premises that are destructible only by discontinuity. Either way, it misses the illogical transition.
 There is no need to abandon what has already been formed. When we understand the exact complexity of the formed, that is exactly when we have transcended the form. When we cannot understand a book, we have to quote it. To understand it is to think within its form, which is more precise than the form.
 	[nishio.icon][Understanding is thinking within a mold].
 Order-for-further-moves is more complex and intricate than any principle of coherence, whether logical, empirical, psychological, or historical. Empirical findings, treatments, and histories are more ordered than formed forms. There are many different types of precise feedback.
p.410
	Experience has often been said to be richer and wiser than fixed forms. Unfortunately, it has also been called disorder. Both only mean that it is not a logical order. Literature confuses greater order with lesser order.
 [Foucault] is a brilliantly self-imposed [Nietzsche], but for Foucault our Dionysian experience is nothing but inchoate resistance, disorder.
 [Derrida's] movements are not arbitrary. But he ends each movement in an immovable contradiction that is both metaphysical and replaceable. It could be a step toward studying the order of non-arbitrary, illogical movements.
 In Foucault and Derrida, the denied order still reigns. Their overthrow, they say, must be disorder. In other words, the old order is still the only one.
 Here we need to remember that "Dionysian" experience, when functioning with the formed kind, creates more order. It is not merely the absence of formed order. Nor is it a mere product of an implicitly imposed formed order.
 From the side of Nietzsche's bodily wisdom, through Schleiermacher and Dilthey, Merleau-Ponty and Heidegger, comes the intermittent realization that this larger order can think and study itself.
 These thoughts are not just vague sensations. The movement of precise understanding transcends cut and form. The word describes this kind of precision. Order for movement is more than a set of kinds. But let us say some set of kinds, such as.

