投資
I was thinking about what I saw when I heard that there is a negative image about [investments].

Maybe the expanded meaning of the word "investment" has become vague and "unfamiliar.
It might be easier to think of it more specifically as [capital investment] like "a factory buys new machine tools," or going back further to "sending a ship out to trade makes a lot of money, but you have to load food before the ship leaves the port" or "you can get money later, but you need money now. Maybe it's easier to understand if you think about it.

話の枝1
 This "give me the money now so I can get it later" structure is the same MO used by scammers, so it's no wonder they feel the same way.
 The key question is, "How much future profit can we expect?"
 And as for investments with no barriers to entry (anyone can participate), those with high expectations are taken first, so the information that reaches those at the end of the information chain is naturally of low expectation.
 　Related [Shoeshine boy].

話の枝2
 The mechanism for this "exchange of present money for future profits" is the stock
　　Separate ownership of a business that generates money.
　　You will be supporting that business to create something of value to society.
 　On the other hand, "I'll buy it because the price is about to go up" doesn't support the betterment of society.
　In my narrow sense of "investment".
　　Includes: stocks, bonds, rental income portion of real estate investments, REITs
　　Not included: commodity futures, foreign exchange, FX, land value portion of real estate investments
　　and parted.
　　Are stocks also divided into a dividend portion and a value portion?
　　　No, it isn't.
　　　If a company does not pay dividends in the short term and uses the money for capital expenditures, the company's value will increase in the long term and its stock price will rise.
　　　Company can grow, real estate can't.
　　　　In that sense, the business of renovating and increasing the value of real estate is very similar to the stock market.
