Reflections on the Poster Session with oVice

[/nishio/kei.icon]This mode supports looking back. What would you like to reflect on?
Reflections on the poster session using [/nishio/human.icon]oVice
Please press the "Good", "Bad", and "Things I want to try" buttons in the [/nishio/kei.icon] input field.
[/nishio/human.icon]よかったこと
[/nishio/kei.icon]What good things have happened?
Unlike [/nishio/human.icon]Zoom's breakout room, you can see who is where without leaving the place, even if you are dispersed.
[/nishio/kei.icon]What kind of "Zoom" is that "Zoom"?
[/nishio/human.icon]By default, everyone is in one room and all speech is shared. If you do a breakout room, the communication format is split into multiple rooms.
[/nishio/kei.icon]What kind of "breakout room" is that "breakout room"?
[/nishio/human.icon]The problem is that when a small group of people are put in a breakout room, they feel uncomfortable, like they are trapped in a small room
[/nishio/kei.icon]Anything else about that "breakout room"?
[/nishio/human.icon]よかったこと
[/nishio/kei.icon]What good things have happened?
[/nishio/human.icon]The psychological hurdle to entering and exiting the booths has been lowered because there are no clear boundaries to the booths.
[/nishio/kei.icon]What "hurdles" are those "hurdles"?
[/nishio/human.icon]It was observed that many people seem to have psychological resistance to entering Zoom or breakout rooms
[/nishio/kei.icon]Where is that "breakout room"?
[/nishio/human.icon]Zoomの中
[/nishio/kei.icon]Is there anything else about that "Zoom"?
Since you can't see what's going on inside until you enter [/nishio/human.icon], for example, the fear that you alone might be surrounded by waiting presenters and forced to communicate with them could occur.
[/nishio/kei.icon]What kind of "fear" is that?
[/nishio/human.icon]よかったこと
[/nishio/kei.icon]What good things have happened?
[/nishio/human.icon]The "mark of intention not to be spoken to" was defined in advance.
[/nishio/kei.icon]What kind of "mark of intention not to be spoken to" is that "mark of intention not to be spoken to"?
[/nishio/human.icon]oVice's functionality allows you to add pictograms to the personal display icon, use it.
[/nishio/kei.icon]What kind of "oVice" is that "oVice"?
[/nishio/human.icon]A system in which personal display icons move around on a two-dimensional space, and voice connections are made only with those who are nearby.
[/nishio/kei.icon]What kind of "personal display icon" is that?
[/nishio/human.icon]Some people used their own faces, others left the system's automatic generation.
[/nishio/kei.icon]What kind of "auto-generation" is that?
[/nishio/human.icon]悪かったこと
[/nishio/kei.icon]What bad things have happened?
[/nishio/human.icon]I took a seat at random, and the desk in the prime spot just inside became empty.
[/nishio/kei.icon]What would you like to see happen in such a situation?
[/nishio/human.icon]It would be a waste if it were not used effectively, so we decided to call it a chat space.
[/nishio/kei.icon]What kind of "chat space" is that "chat space"?
[/nishio/human.icon]I thought it would be good to have a free space where there are no restrictions, as individual booths are a place where topics are restricted because they are associated with individual posters.
[/nishio/kei.icon]What kind of "booth" is that "booth"?
[/nishio/human.icon]Good things
[/nishio/kei.icon]What good things have happened?
[/nishio/human.icon]I pasted the video into the booth and played it on repeat.
[/nishio/kei.icon]Anything else about that "booth"?
[/nishio/human.icon]Someone was visiting the booth's and watching the video, and I marked him without talking to him, so I left him alone.
[/nishio/kei.icon]How do you know its a "booth"?
[/nishio/human.icon]悪かったこと
[/nishio/kei.icon]What bad things have happened?
[/nishio/human.icon]Screen sharing, for example, cannot be made a fixed object, so it disappears when you leave the booth.
[/nishio/kei.icon]What would you like to see happen in such a situation?
If you [/nishio/human.icon]take video in advance, it won't disappear, but it's hard to advance or stop slides as needed and requires a lot of preparation man-hours in advance.
[/nishio/kei.icon]
 > Screen sharing, etc. cannot be made a fixed object, so it disappears when you leave the booth.
 Where is this "booth" located?
[/nishio/human.icon]画面全体に散らばってる
[/nishio/kei.icon]
 > Screen sharing, etc. cannot be made a fixed object, so it disappears when you leave the booth.
 Where is this "booth" located?
[/nishio/human.icon]悪かったこと
[/nishio/kei.icon]What bad things have happened?
[/nishio/human.icon]The range in which the voice is heard is much smaller than the physical metaphor, so there were times when it was unclear whether the other person could hear or not.
[/nishio/kei.icon]What would you like to see happen in such a situation?
[/nishio/human.icon]悪かったこと
[/nishio/kei.icon]What bad things have happened?
[/nishio/human.icon]If I play a video on repeat in my booth and I am there, it is painful to hear the sound all the time, is there a way to mute it only for me? In the physical world, it's hard to hear the sound in the first place, even if you play it, because of the crowds, so do you have to explain it with subtitles, etc.? Maybe I should have done that.
[/nishio/kei.icon]What would you like to see happen in such a situation?
[/nishio/human.icon]It would have been nice to have a video without sound.
[/nishio/kei.icon]What kind of "video" is that "video"?
[/nishio/human.icon]The video now is a recording of the presentation, so I'm talking the whole time.
[/nishio/kei.icon]Anything else about that "video"?
[/nishio/human.icon]When I was doing poster sessions in the physical world, I printed them out and put them on the wall so they didn't make noise and people could read at their own pace, but the area available for reading was limited due to wall space
[/nishio/kei.icon]What kind of "poster" is that "poster"?
[/nishio/human.icon]Well, we customarily called it a poster session, but no one did posters like we did in the physical world.
[/nishio/kei.icon]Anything else about that "poster"?
[/nishio/human.icon]The area available per person was scarcer than in the physical world, so several people who thought static exhibits were not enough at all ran in the direction of creating moving images.
[/nishio/kei.icon]Where is that "video"?
[/nishio/human.icon]I was able to put it on YouTube because it does not contain private information, but some people were hesitant to put it there.
[/nishio/kei.icon]What kind of "person" is that "person"?
[/nishio/human.icon]You're a tightly coupled person for an unpublished project at headquarters, my project is quite loosely coupled, so I rather made a video after the poster session with the intention of mentioning it on social networks, etc.
[/nishio/kei.icon]How do you know that "video"?
[/nishio/human.icon]Videos of such people cannot be embedded in oVice, so you have to put a link and click a few times to get the content, which is a big difference from YouTube videos that just play when you get close.
[/nishio/kei.icon]What do you hope will happen regarding that "video"?
[/nishio/human.icon]Removing information that is tightly coupled with the head office from the videos is not appropriate because it is a direction contrary to the purpose of the association, which is to share information between the head office and the lab. The video side remains the same, but the system needs to change so that any video can be posted.
[/nishio/kei.icon]What needs to happen to the "video" for that to happen?

https://keicho.netlify.app/#talk=JFb2tXudYjED5m9besM5
#KeichobotLog