It would be good to be able to verbalize support tools for reading difficult books.

[/nishio/kei.icon]What would you like to see happen in this conversation?
[/nishio/human.icon]It would be good to have a language about support tools for reading difficult books.
[/nishio/kei.icon]What kind of "reading" is that "reading"?
[/nishio/human.icon]Those who have a superficial view of the difficult text will "slip their eyes" and be left with nothing, but I want to make sure that some kind of felt sense is formed instead of that.
[/nishio/kei.icon]What kind of "eye-slip" is that?
[/nishio/human.icon]Reading too fast, some people have to read slowly if they cannot read and understand something at normal speed, but they cannot consciously switch gears to a slower speed
[/nishio/kei.icon]What kind of "gear" is that "gear"?
[/nishio/human.icon]A "gear" that switches speeds, needs to be switched depending on the situation, different from the gas pedal and brake.
[/nishio/kei.icon]What kind of "speed" is that "speed"?
[/nishio/human.icon]The speed of following the text exceeds the speed of understanding, then understanding is skipped in the middle of the text and you receive input that skips around, which is more difficult to understand than reading slowly.
[/nishio/kei.icon]Anything else about that "speed"?
[/nishio/human.icon]If you just want to slow down, you can do that without any support tools. You can copy or read aloud. What's not enough is to enhance temporary memory.
[/nishio/kei.icon]Where is that "speed"?
[/nishio/human.icon]ðŸ‘Support Tools
[/nishio/kei.icon]What kind of "support tool" is that?
[/nishio/human.icon]Reading slowly takes time and reduces the range of memory persistence in the length of the input text. This makes it impossible to find relationships between long-distance descriptions. The reading becomes localized and superficial. This is like extracting a phrase that strikes you and writing it down without regard to context.
[/nishio/kei.icon]
 > If you just want to slow down, you can do that without any support tools. You can copy or read aloud. What it lacks is temporary memory enhancement.
 Is there anything else you can tell us about this "support tool"?
[/nishio/human.icon]Therefore, support tools need to have the ability to extend the duration of memory.
[/nishio/kei.icon]Where can I find that "support tool"?
I think [/nishio/human.icon]Kozaneba is mostly that. I've never taken it that way before, I've never explained it, but the reason I naturally activate Kozaneba when I'm reading esoteric philosophers or trying to sort through unfamiliar descriptions is because I implicitly understand its usefulness.
[/nishio/kei.icon]
 > So support tools need to have the ability to extend the duration of memory.
 Where can I find this "support tool"?
[/nishio/human.icon]Now it's basically what you use on your PC.
[/nishio/kei.icon]
 > So support tools need to have the ability to extend the duration of memory.
 How do you know about this "support tool"?
[/nishio/human.icon]What features are missing for Kozaneba to become a reading support tool: chopping and not too many
[/nishio/kei.icon]What do you value?
[/nishio/human.icon]I want to go further by strengthening my cognitive functions. I use Kozaneba when I read difficult books. It will be easier if I can compensate for the missing functions. If I can translate something into language and improve Kozaneba, my cognitive function will be strengthened even more. This is the value.
[/nishio/kei.icon]
 > What features are missing for Kozaneba to become a reading support tool: chopping and not too much
 Where do these "support tools" come from?
Add functionality to [/nishio/human.icon]Kozaneba
[/nishio/kei.icon]What kind of "Kozaneba" is that "Kozaneba"?
[/nishio/human.icon]I can move fragments, draw lines between them, and organize them.
[/nishio/kei.icon]
 > What features are missing for Kozaneba to become a reading support tool: chopping and not too much
 What do you hope will happen regarding this "support tool"?
[/nishio/human.icon]Hope it works well
[/nishio/kei.icon]What needs to happen to the "support tools" for that to happen?
[/nishio/human.icon]You have to try it out and test it out.
[/nishio/kei.icon]
 > Add functionality to Kozaneba
 Is there anything else you can tell us about this "Kozaneba"?
[/nishio/human.icon]Well, there are some bug fixes and stuff, so we'll have to rework it again for a while.
[/nishio/kei.icon]
 > If you just want to slow down, you can do that without any support tools. You can copy or read aloud. What it lacks is temporary memory enhancement.
 How do you know what this "speed" is?
[/nishio/human.icon]Indeed. That would be a nice feature to have in the support tools too.
[/nishio/kei.icon]What are those "support tools" like?
A [/nishio/human.icon]jet engine? With [flesh and blood humans], the speed of understanding is slow, and yet reading too fast makes the tires spin, so you had to slow down, but if the speed of understanding itself increases with the assistance of tools, the bottleneck is eliminated, so the whole thing can go faster?
[/nishio/kei.icon]Where does that "speed" come from?
Maybe the [/nishio/human.icon]tool itself could be a pacemaker to control the speed while watching comprehension.
[/nishio/kei.icon]What do you hope will happen regarding its "speed"?
[/nishio/human.icon]It is good to be at the appropriate speed. It is difficult for people who have not learned how to do this, and even if they have, it is burdensome, for people who are subjected to the cognitive load of reading to simultaneously observe their own cognition from a third-party perspective and control it to an appropriate speed. Computers should manage this.
[/nishio/kei.icon]What needs to happen to "velocity" for that to happen?
I need a method to measure whether [/nishio/human.icon]it's too fast or too slow.
[/nishio/kei.icon]
 > It is good to be at the appropriate speed. It is difficult for people who have not learned how to do this, and even if they have, it is burdensome, for people who are subjected to the cognitive load of reading to simultaneously observe their own cognition in a third-party way and control it to an appropriate speed. Computers should manage this.
 What does this "speed" look like?
[/nishio/human.icon]I don't know
[/nishio/kei.icon]
 > Add functionality to Kozaneba
 Where is this "Kozaneba" located?

https://keicho.netlify.app/#talk=sNnv7YRu1F9rYvdOIqPo
#KeichobotLog