Study Session 1 on "Experiential Processes and the Creation of Meaning
Study Group on "Experiential Processes and the Creation of Meaning
 2021-12-10
 Purpose of this time
　　The "unspoken mumbo-jumbo" is a way of organizing how "unspoken mumbo-jumbo" works in cognition, and it is a path that requires as little prerequisite knowledge as possible until chapter 3 of "[Experiential Process and Meaning Making].
　　[nishio.icon] subtitle of the original book, "A Philosophical and Psychological Approach to the Subjective."
　　　Good subtitle, and a very subjective approach to the mumbo-jumbo.
　　　[https://gyazo.com/cc01debb333881e198b2040e204593fd]


Eugene Gendlin.
　Author of "Experiential Processes and the Creation of Meaning"
 [https://en.wikipedia.org/wiki/Eugene_Gendlin Eugene Gendlin - Wikipedia]
 	Eugene T. Gendlin (1926 – 2017) 
 	　American philosopher
 	　D. in philosophy after studying with clinical psychologist Carl Rogers (1958, University of Chicago).
 	　1962 Experiential Processes and the Creation of Meaning
 	　Later gave birth to the psychotherapy technique [Focusing] (1978) and the general thinking method [Thinking At the Edge] (2004).
 	　	[Focusing (psychotherapy) - Wikipedia https://en.wikipedia.org/wiki/Focusing_(psychotherapy)]

[Carl Rogers]
	[https://en.wikipedia.org/wiki/Carl_Rogers Carl Rogers - Wikipedia]
	1902 - 1987
	Professor of Psychology at the University of Chicago (1945-57)
	Founder of Client-Centered Therapy
		"Client-Centered Therapy" (1951)
		>In a 1982 survey of 422 psychologists in the U.S. and Canada, Freud was ranked as the most influential psychotherapist in history (Freud ranked third)
		Later called [Person-centered therapy - Wikipedia https://en.wikipedia.org/wiki/Person-centered_therapy], Person-centered Approach Person-centered approach
		I won't go too deep into the relationship with human-centered design in design or learner-centeredness in pedagogy this time.
	who was about the same age as Abraham [Maslow] (1908-70).

What is the experience process?
	[* experience process] and the creation of meaning."
　Concepts that Carl Rogers used in practice in doing psychotherapy.
　Eugene Gendlin organized.
　The Japanese translation is stiff, but the English is Experiencing

What does it mean?
	"the process of experience and the creation of [* meaning]."
 There are several dimensions.
　 Relationships among linguistic symbols
  Relationship between the symbol and the object
  　For example, the symmetrical relationship between the symbol "canine" and the "four-legged thing you often see on the street".
  Besides this, there is the dimension of "experience."
  　[nishio.icon]The translations of the terms "experience" and "experience" are shaky, but both are Experience.
 Dimensions of Experience
 　What is
　 It is easy to understand when we think of "when symbols [* do not] properly symbolize the meaning we experience."
 　>waving, pointing, talking at length, coming up with metaphors, giving examples, silence to find words
 　 [nishio.icon]In other words, there is a fuzziness, excitement, and discomfort that I can't quite put my finger on.
 　This state is described as "We are experiencing a meaning
　　　Another way to say "we feel a meaning" means the same thing
　　>We notice that "symbols that usually seem to contain our meaning do not seem to be appropriate to this present sense of meaning.
　　　[nishio.icon]When I try to express in words what I'm moping about, it doesn't seem to match.
  > In other words, meaning is not just a matter of things or symbols or their relationship... It is also something that is felt and experienced.
  　Q: "Are there verbalized and non-verbalized meanings?"
  　A: There is a meaning that is not verbalized. You have all experienced the feeling that "there is something before it is verbalized," and that is what we call "felt meaning," as I will explain below.
  　　And we'll focus on that later.
　　Since this paper deals with this kind of "meaning," I will use the expressions "felt meaning" and "experienced meaning.
　　The Japanese translation is considered "felt meaning."
　　　It comes up many times after this as a single lumpy phrase, "felt meaning."
	　　How does perceived meaning work in cognition?" is the theme of the book.
  [nishio.icon]The Japanese translation process has broken it up into different symbols, making it difficult to understand the relationship between the symbols.
  	[https://gyazo.com/2643404f720ed119f010011e5201dac9]
		  Gendlin clearly states that experienced meaning = felt meaing.
		  In later Thinking at the Edge, felt sense is often used, which translates to "[felt sense]."
		  In Japanese, the connection between symbols is not clear, so it is good to understand the connection in English
		 	(aside)[Thinking at the edge of the edge].

"Felt Meaning."
	This is the main theme of this book
		Chapter I. [* Experienced Meaning] Issues
			right here, right now
		Chapter II: Examples of [* perceived meaning] at work in cognition
		Chapter III: How [* perceived meaning] works
	　　Destination of this study session
	Chapter I. The Problem of Experienced Meaning > 2. The Problem in Psychology > c.[Segmentation of Experience].
		[https://gyazo.com/b43abb82a94b14a1759b2e6df255a25b]
		(Translation by Nishio)
			Conceptualization and expression are different from experience and emotion.
			Experiences and emotions have meaning apart from conceptualization and expression.
			We call this "felt meaning.
			Conceptualizations and expressions may or may not be appropriate for their "felt meaning."
			What is the relationship between this conceptualization or representation, otherwise known as "structuring with symbols" and "felt meaning"?
			Various. (There are seven)
			In the chapters ahead in this book, I will take a closer look at the function that "felt meaning" has in cognition by scrutinizing these relationships.

Necessary functions in cognition
　Chapter II, "Examples of Perceived Meanings at Work in Cognition," gives various examples.
　If I trace it here, it's going to be "just a verbatim degraded copy of a list of examples on paper," so I'll skip it.
	The second half of B. is the hub of important concepts, so I'll just introduce that part.
  [https://gyazo.com/80284e1f5b6233c8c4c7c41dd18dbaa2]
  about the "felt meaning" fulfilling a specific function, necessary for cognition.
  	1. Problem Solving
   	[Dewey's concept of "[suggestions]".
   	[nishio.icon]When you are thinking about solving some problem, it suddenly "occurs to you" (we've all experienced it, right?).
   	 This "idea" seems to involve "felt meaning".
   	　When I was thinking about the idea, I thought, "Oh, why don't I do this? and it is symbolized after the fact.
   	 For example, on a math test in middle school or so, there are problems that can be solved by expanding and organizing, and there are problems that cannot. In the latter case, I wonder for a while "how to solve it," and then I come up with something like "Oh, I did something like this in a problem I solved before.
   	 　Here's a "Something Before Language" right here.
   2. reproduction and segmentation
   　Recreation = "felt meaning" is also used in the process of "forgetting and remembering".
   　 [nishio.icon] "Oh, I was going to say something, but what was it?"
   　 　There is a sense in which "what I was going to say" exists.
   　 　But that hasn't been symbolized yet.
   　 　I want to verbalize this, which is only pointed to by the messy symbol of "what I was going to say."
   　　Same composition as "come up with a solution."
   　ARTICULATING
   　[nishio.icon]I think the English word articulate is distorted when translated into Japanese. The word is used both in the situation "this product can be broken down into its parts" and "he can speak fluently and consistently on the subject.
   　[https://gyazo.com/51362e1e8edf043d3d18fd8f9b726eeb]
   　The composition is similar to the use of the same kanji for "Wakaruke" and "Wakaru" in Japanese.
   　The [segmentation] here is contextualized by the linguist [Saussure] (1857-1913), "The world is segmented by ignoring some differences and focusing on some differences, and the way it is segmented varies from one national language to another."
   　The world is divided into groups, and these groups are divided in different ways.
   　Specific example: In Japanese, grandchild is one of the "grandchildren", but in Chinese, there are four different ways.
							sūnzi, sūnnǚ, wàisūnzi, wàisūnnǚ
							(Japan also used to have a distinction between "inner-grandchildren/outer-grandchildren")
						Other examples
						　Uncles and uncles, ancle
						　Brother and Brother and BROTHER
						　The colors of the rainbow, and how many colors it is divided into, vary from country to country.
						　[Sapir-Whorf hypothesis]
						　　Hypothesis that the presence of a separating vocabulary influences cognition.
				Saussure, "Divided by Language."
					Not only that, but humans are making sense of ongoing, blurred experiences by separating them.
				　= understood by segmentation
				　This idea assumes that there is a "blur" before segmentation, and so on.
			Psychotherapy
			　>Psychotherapy is an area where [segmentation of experience] is constantly taking place.
			　[nishio.icon]I feel this is a succinct and to the point expression, but it doesn't ring a bell if you don't have an image of "psychotherapy"?
			　　For example, a client comes in and says, "I'm having a hard time with my heart.
			　　I don't understand why they say, "I'm having a hard time with my heart.
			　　At least two things can be said
			　　 There (in the client) is a subjective "hard feeling".
			　　 He can't even put into words what it is and why it exists.
			　　in other words
			　　　An ongoing experience of spiciness (Experiencing) is present and not yet symbolized.
			　　Psychotherapy facilitates this segmentation.
			　　　Why prompt?
			　　　It is known empirically in the field of psychotherapy that this reduces subjective distress, etc.
			　　　　I don't know why it's valid since it's "empirical."
			　　　[Cognitive therapy] also does a "write down on paper what you feel" kind of thing.
			　　　I think that by putting subjective things into words and putting them outside of yourself, you'll be able to treat them "objectively/third-party/[* like] someone else/distance/[disassociate]" from them.
			　Q: What is the difference between "segmentation" and "verbalization"?
			　　A: Segmentation is the division of the world
			　　Q: But you do put it into words, don't you?
			　　A: It will come up later, but the "symbols" here are not necessarily language. That's why I didn't call it "verbalization."

[Client-Centered Therapy]
	Chapter II: Examples of how felt meaning works in cognition > B. > 3. psychotherapy p.104
	>In client-centered therapy, the client's felt experience is specifically explored in his or her own words.
	>Other methods provide diagnostic concepts emanating from the theoretical collation framework of the therapist
		>However, upon closer examination, we find that another school of therapy places the same emphasis on the client's own direct discovery of feelings and experiences within the client that are generally predicted by the diagnosis.
		'Diagnosis is a conceptual scaffold' [https://ja.wikipedia.org/wiki/ジークムント, Freud Sigmund Freud - Wikipedia].
			>Like scaffolding for a building under construction, it will be removed as useless when the actual building is completed.
			　What is important is that clients are able to express in their own words what they are experiencing and feeling
			　Diagnosis is just a scaffold to help with that.
			>A diagnosis may be made in a day from the material of an interview or a projective test ([nishio.icon] e.g. Rorschach test). However, it takes a long time for the client himself to discover and grasp his internal feelings and experiences, and it must be based on feelings, not on concepts.
			>The treatment must be based on his own unique experience, not on conceptual generalizations. For this reason, every form of treatment consists of an individual's effort to experience more deeply and to grasp and symbolize his own felt experience.
			 He has to figure out his own mumbo-jumbo and put it into words himself, instead of making diagnoses or judgments based on conceptual generalizations.

Chapter III: How [felt meaning] works
　The story that there are seven styles in which the felt meaning works with the symbols.
 A: Parallel functional relations of felt meaning in cognition
  1.[DIRECT REFERENCE
  RECOGNITION
  EXPLICATION
 B: Creative functional relationships ("specific" and "non-parallel")
 	METAPHOR
 	2. understanding (COMPREHENSION)
 	Related (RELEVANCE)
  4. phrasing (CIRCUMLOCUTION)

Parallel functional relationships
　[nishio.icon] "Parallel" is defined as "a one-to-one correspondence between the felt meaning and the symbol."
　　I think we can roughly understand "simple patterns" now.
　　It's easier to understand after seeing the "non-parallel" examples in the second half than to discuss definitions here.
 Direct Reference ([DIRECT REFERENCE])
 　For example, when you know it, but you forget it and can't find the words.
 　　For something I can't remember, I ask myself, "Was it A? No, it wasn't. Was it B? Yes, yes, B."
 　　This "unspoken blur" and "A" are directly matched against each other.
 　　'I was going to say something, what was it?' "A?" "No, no." "B?" "Yes, yes, that!"
 　　The symbols "A" and "B" are what I was going to say.
 　　[https://gyazo.com/fa84b53d99aa7415926aa1bc623432df]
 　　 　F is "felt meaning" (felt meaning)
 　　 Not limited to linguistic symbols
 　　 　It's very difficult to explain [nishio.icon] in language here or to communicate over video conferencing....
 　　 　p.127 Examples: kinetic symbols, visual symbols, actions, objects, situations
 　　 　[nishio.icon]Imagine bowling, for example.
 　　 　　That, that move.
 　　 　　 (and when I mentioned it, it became the linguistic symbol "that move")
 　　 　[nishio.icon]For example, someone talking about how "attention is like a spotlight to me," and then he remembered something and looked dazzled.
 　　 　　This is a symbol of "situation
 　　 　The role of symbols here is to point to "felt meaning," so they do not have to be linguistic symbols if they can do that
 　　 　　You can point to it with the word "dazzle," you can squint your eyes in a dazzling manner, or you can move your hand to cover your eyes
 　　 　　[nishio.icon]It's obvious to those who have experienced it, but it's difficult to communicate it with linguistic symbols to those who haven't...
 　　 　　Not "dazzling."
 　　 　　　That's what I see in my clients and think on my own, not a symbol that points to a "felt meaning" in them.
 　　 　　If the client expresses "hand movements as if trying to block out the light," this is a symbol
 　　 　　　A trained clean-language coach would no doubt ask, "What does that (pointing to a movement) look like?" He or she would ask, "What is that (pointing to a movement)?
 　　 　　　　Precedence over linguistic symbols
 　　 　　　　　The symbols of movement have a stronger connection to "what has not yet been put into words" than the linguistic symbols.
 　　 　　　　This is currently not at all possible with Keichobot, and there is no way to make it possible.
　Recognition ([RECOGNITION])
　　Only the symbols seem to be ahead of the others.
　　For example, read the words in a book
　　　Only symbols are written here, no humans.
　　　Seeing the symbols, meaning is evoked and felt.
　　Symbols work to evoke "felt meaning" in our minds.
　Clarification ([EXPLICATION])
　　RECOGNITION presented symbol first.
　　　EXPLICATION is a movement where "felt meaning" becomes "symbol".
　　A situation where you want to explain in words what you feel but haven't found the words yet.
　　　Resolve this.
　　　(Note: Of course, this is not limited to linguistic symbols, but for the sake of simplicity, I use linguistic symbols as examples.)
　　　I said it!" EXPLICATION is happening when you say
　　RECOGNITION and EXPLICATION are just opposite
	　　[https://gyazo.com/786c5e5789c690b226f98318faf1077b]
  　　RECOGNITION evokes the symbol's felt meaning.
  　　EXPLICATION evokes symbols of felt meaning.
	　In [nishio.icon]RECOGNITION, "the meaning felt by seeing the symbols was recalled from memory."
	　In the same way, in EXPLICATION, "the symbols that match the felt meaning were selected from memory".
　　　Note: I'm talking about simple "parallel" relationships here, so I'm dealing with cases that could easily be described in existing terms.
　　　　Not so in the second half of the case.
　Summary of [3 parallel relationships
　　[https://gyazo.com/ec4ff0ee4d1a39c2e2b2e94ab8616b4e]


　[nishio.icon]If you use the example at the direct matching, the story is actually a story that "clarification was done through repeated direct matching".
　　>"I was going to say something, what was it?" A?""No, no.""B?""Yes, yes, that!"
　　[https://gyazo.com/329aed890cdaff0b5a77bf70a82bd927]
　[nishio.icon] direct matching may match part of F, prompting [segmentation] in that case
　　Is that an A?""No, it's both an A and not an A..."
　　[https://gyazo.com/0eac140d3ae45a843a79870458eaf3b4]
　[nishio.icon] In other words, there are three patterns in the direct matching results
　 [https://gyazo.com/06a5d988709d0d5165cea0a6ec081d03]
　　　(RECOGNITION is a dotted line that was not drawn.)

Creative Functional Relationships
　[nishio.icon]Finally, the main topic!
 METAPHOR
 2. understanding (COMPREHENSION)
 Related (RELEVANCE)
 4. phrasing (CIRCUMLOCUTION)
 A state of "felt meaning without parallel symbols."
 　[nishio.icon]In short, there are experiences that seem to lack "just the right words to describe

Metaphor ([METAPHOR])
　[Eugene Gendlin's Metaphor Concept]
　It's translated as a metaphor, but the discussion has nothing to do with whether it's a metaphor or a direct metaphor.
　　Better to think of it as "parable."
　　Here we call them "metaphors" as they are in English.
　　Strictly speaking, the term "metaphor" refers to the creation of new meanings from existing symbols, as in "simile" and "metaphor.
　Example
 　My lover is like a rose."
 　[nishio.icon]"Time is money."
 　　Is time really money?
 　　　That's not true.
  　　You can't save time.
  　Using the symbol "gold" to refer to something that is not the original meaning of the word "gold."
 　[nishio.icon]"Public key cryptography is like a padlock."
 　　I'm not trying to say that public key cryptography is made of brass.
 　　I don't mean to imply that "only one person who owns the padlock can lock it."
 　　I'm saying that you don't need the "key needed to unlock the door" when you lock it.
　In every example, the symbol is used in a way that is different from its original meaning.
　A situation where the meaning felt in the existing symbols cannot be accurately expressed.
　　So we create new bonds to symbols that are not normally connected and express them.
　　[https://gyazo.com/2cbb5bf6041b0c7ce470ad6387c512dd]
　Represented by multiple symbols but not and or
　　It's not "public key cryptography and padlocks," nor is it "public key cryptography or padlocks."
　　Not a logical combination of existing symbols
　　[https://gyazo.com/631d5af4374c1b5f8d1a097783291d9b]
　　[nishio.icon]Nishio's image of what happens in a person who receives a metaphorical symbol is this.
　　　(1) No overlap between the "felt meaning" RECOGNITIONED from symbols A and B presented as related
　　　(2) So, I'm trying to find an overlap by expanding on it.
　　　(Overlap is still a little uncomfortable because it sounds like and.)
　　　Eugene Gendlin describes it as "the collation of the felt meaning evoked by the existing symbols to the mass of felt experience, and a new aspect of the mass emerges."
　　　　[nishio.icon]If you match a blur to a blur, a wall will form in between.
　　　　　A sense of trying to communicate something similar in a different way of expression.
　　　Like an average?
　　　　It only looks that way because the figure is one-dimensional.
  　　[https://gyazo.com/aa2b2901f867664ce3a25350150e000c]
　　　　If we consider it in multiple dimensions, the average is c
  　　It will be only one way c
  　　　Not this one.
  　　Rather, it could be d put into A, ignoring the component of B in some axis y direction.
  　　　It can be e depending on what you focus on and what you ignore.
  　　>For example, if you read a certain poem over and over again, you get different meanings.
  　　 This could be interpreted as an "unstable process," but Eugene Gendlin interprets it as "creative."
　The Role of RECOGNITION and Direct Matching in Metaphor
　　RECOGNITION where the "felt meaning" is called out from the symbol.
　　Direct Match "Is Time Money?" No!
　　Metaphor: "Time is gold" "(direct collation) Eh, time is not gold. What is this person trying to say... well, that time is as precious as gold!" Interpretation as

Understanding ([COMPREHENSION])
　[nishio.icon]This is translated as "understanding," but I think it is confusing to use the same translation because the next section talks a lot about understanding.
　　I was confused too.
　　[Misconceptions about COMPREHENSION
　　This is a nuance rather than "understanding."
　　　[* [https://gyazo.com/597c57be0ed5a8e2d79b304141fb0691]]
　　　(This is an example of non-parallel symbol usage and does not literally mean "fully understood.")
　　I will refer to it verbally below as "COMPREHENSION."
　It already has a felt meaning and we want to symbolize it.
　　But none of the existing symbols fit perfectly with what I want to say.
　　So combine existing symbols.
　　This is COMPREHENSION
　　[nishio.icon] "Isn't that the same explanation you gave at METAPHOR?" You thought? Correct!
　　　>To invent a metaphor to express a prior felt meaning is "comprehension." (p.117)
　　　It clearly states that creating a parable is COMPREHENSION.
　　　　[nishio.icon]I don't want to use the translation "understanding" because of this too.
			[https://gyazo.com/73018abef8816d7d394a9c55c94a5b89]
　　　　COMPREHENSION on the left, METAPHOR on the right
　　[nishio.icon]So, for example, "understanding" in "reading a book and understanding what it says" or "seeing a metaphor and understanding what it means" is different from COMPREHENSION. Caution.
　Example
　　Tradition is to keep the fire burning."
  [nishio.icon]"Does that mean it's important to protect them so they don't disappear~?"
 　"[Tradition is] the preservation of fire, not the worship of ashes."[Gustav Mahler](composer, conductor)
  [nishio.icon] "I see [full understanding.icon], instead of worshipping the ashes (=classical music), which are by-products of the fire and no longer change, we should strive to keep the fire (=composer), which is currently creating new light, alive, and that is how we preserve tradition, That's how we keep the tradition alive.
 　　The "felt meaning" created in Nishio by reading the metaphor has become a new symbol by COMPREHENSION
 　　　New symbols are emerging, like "light."
		[https://gyazo.com/9374b02591336b874c484a6b67e4bdd7]
　>In the process of understanding, a given felt meaning is directly collated and many kinds of relevant symbols are selected (p.150).
　[richer if you can put it into words in batches].
　>When you are able to put into words what was not put into words, it is not the same as what was not put into words, but something richer, clearer, and more firmly understood.
　　[To express is to be aware.]
　　>"For the subject who speaks, to express is to be aware. He does not express himself merely for the sake of others. He expresses in order to know for himself what he is aiming at" ([Merleau-Ponty], Takahashi (trans.), Issues in Phenomenology).
 Relationship between METAPHOR and COMPREHENSION
 	The composition is similar to the relationship between RECOGNITION and EXPLICATION
 	[https://gyazo.com/7c314d6a8f49bec6ea942aec0bd28e9f]
 	A felt meaning that is already called by RECOGNITION is symbolized by EXPLICATION.
 	similarly
  METAPHOR makes the already created FELT MEANING into a symbol by COMPREHENSION
  RECOGNITION/EXPLICATION is a parallel relationship and therefore the same symbol.
  METAPHOR/COMPREHENSION is a creative (non-parallel) relationship, so it can be different symbols
 	Related: [Relationship between metaphor and understanding (record of brain model modification)].

Related ([RELEVANCE])
　So far we have defined the relationship between "one" felt meaning and one or more symbolizations "about" it
　Consider the case where the symbol becomes understandable (UNDERSTAND) because of "other" felt meanings.
　Here's what they say in everyday conversation
　　>To understand, we need "past experience".
  >"[Context]" must be understood.
　By "related," I mean "such a related, felt meaning that the symbolization is thereby made intelligible."
	　>relevant felt meanings, from out of which symbolization is understandable
	　[nishio.icon]Understand is used for this "understanding", which is different from the COMPREHENSION translation "understanding"
 >A set of symbols comes to be understood with the help of many other experienced meanings, not just the one felt meaning they represent (p. 158).
　Example: "A beginner learns a saying; after more than 20 years of experience, he understands the meaning of the saying in a different and more complete way, but when he tries to teach it to his student, he cannot find a better expression (=symbolization) for its meaning than the first word he learned 20 years ago."
 　[nishio.icon]A common one in math books.
 　 When I first saw the definition of a certain mathematical concept, I didn't know what it meant.
 　 I read various examples and explanations and think, "I see what you mean.
 　 I took another look at the definition, thinking, "Why didn't you just write that?" and that's exactly what it said.
 Two perspectives: [meaning determines relationship or relationship determines meaning].
 　It is possible to say that METAPHOR/COMPREHENSION is also a RELEVANCE, just as it is possible to say
 　But instead of doing so, Eugene Gendlin argues, it is better to see it as two perspectives (p. 159).
 　[nishio.icon]I drew it on the picture.
	 	[https://gyazo.com/171d4d8ba4426f107acf6081a10aa9fd]
	　　The METAPHOR/COMPREHENSION perspective dictates the relationship between a felt meaning and other felt meanings
	　　The perspective of RELEVANCE is the connection between other felt meanings that define the felt meaning we are now focusing on.
	　　That the direction of the arrow is reversed.
	　I'm sure we've all had the experience of understanding a newly seen symbol (e.g., a formula in a textbook) because we knew something about it.
	　　Cases where the same symbol is seen by another person (e.g., a classmate who did not attend class properly) and misinterpreted or chimped out.
 	[Whether meaning determines relationship or relationship determines meaning (v1)]
	[RELEVANCE(v1)]

phraseology ([CIRCUMLOCUTION])
　The choice of the word [nishio.icon]CIRCUMLOCUTION is not good, says the author himself.
　　In addition, I chose "phrase" as a translation.
　　I think this is getting confusing.
　　Basic premise: I'm not talking exclusively about linguistic symbols.
　　　How about the translation, "parlance?"
　CIRCUMLOCUTION
　	A roundabout or indirect way of speaking; thus:
  	Unnecessary use of extra words to express an idea, such as a pleonastic phrase (sometimes driven by an attempt at emphatic clarity) or a wordy substitution (the latter driven by euphemistic intent, pedagogic intent, or sometimes loquaciousness alone).
  　Necessary use of a phrase to circumvent either a vocabulary fault (of speaker or listener) or a lexical gap, either monolingually or in translation. 
  　　A technical word, such as hyperkalemia or hypoallergenic, can be glossed for general audiences with a circumlocution, such as "high potassium level" or "less likely to cause allergies" (respectively).
 　I guess the latter example is closer.
 　　I used the symbol "hyperkalemia" to express what I wanted to convey, but since it may not be understood, I used "high potassium level" again to express the same thing (in Japanese, it is "hyperkalemia" ← This postscript by Nishio is also an example of CIRCUMLOCUTION).
 　After giving a certain explanation to convey something, then add more explanations for the same thing.
 　　Not limited to words, but may also use diagrams and gestures
 　　Express the same "felt meaning" with different symbols.
 　　[https://gyazo.com/4c1be7c19297429975f33fbf8bbfe0e0]
　　　　This is another example of CIRCUMLOCUTION
　　　　　After expressing it with the symbol of a word, the same thing was expressed with the symbol of a figure.
　　　[nishio.icon]I think this is more of a paraphrase than a "phrase".
　The first half of this explanation, "the same thing" and "different expressions", is converted to "related things".
　　The "same thing" is, of course, inclusive.
　　CIRCUMLOCUTION is occurring that connects a number of related things like this document.
　　This clarifies "what I wanted to convey.
　　　= Creatively shaping and modifying perceived meaning
　　　The "two viewpoints" diagram from earlier.
　　　	[https://gyazo.com/9a4a6bcb7d7a6a64d6334b525d154d1f]
　　　　Modifying the meaning by increasing the number of associations.
　　　　(This is another example of increasing association.)
　　　[nishio.icon] e.g. "I bought a new phone yesterday - oh, I'm talking about the one I don't carry around."
　　　　Even if the word "phone" conjures up an image of a cell phone, it's modified.
　　　Here's another real-life example
　　　>I think that by putting subjective things into words and putting them outside of yourself, you will be able to treat them "objectively/third-party/[* as if it were someone else]/with distance/[associate]".
　　　This is just a direct record of my thought process.
　　　The first verbalized symbol was "objectively."
　　　Then I felt like I wasn't saying what I wanted to say.
　　　I'm adding some symbols.
　　　So, I took out five and looked at them, and then chose the third one, "as if it were someone else's business".
 RELEVANCE and CIRCUMLOCUTION
 　Both create relationships.
 　RELEVANCE has a certain felt meaning that already exists, and it is influencing the felt meaning that is now being created.
 　　Past experiences help us understand now.
 　CIRCUMLOCUTION now the felt meaning invoked by the symbol is influencing the felt meaning of the past
 　　The language of the present reinforces the explanation of the past.
 　[https://gyazo.com/f0978f54fca3cf6775ce207df143d246]

Creative Functional Relationship Summary
	ver.3
	　[https://gyazo.com/72c5dfaa9c9747d4af30f65b1d7cd0ba]
 　In the previous version, I drew "somewhat more than one" in the bottom two, but I drew only one other, because what is essentially important is that it is "not one" and "other".
 　FR is given, FG is now modified and created, that is the difference in the horizontal axis
　[Creative Functional Relationship Summary (Record of Revisions)]
 [Creative Functional Relationship Summary (ver.2)]

　ver.4
  [https://gyazo.com/5eb9647f274671fe7dbb7768af14d735]


[clean language]:[withhold interpretation of symbols].
　I realized that this framework could be used to better explain the clean language mechanism I presented last time.
　[https://gyazo.com/8c032e6ed13e52ab073564458706f3d4]
　　When a person tries to put into words something F that he/she can't say well and says A, it's not a parallel EXPLICATION of course because it's "not well said"!
　　　The meaning is distorted.
　　　Symbols are not being used as they should be.
　　So the FA that RECOGNITIONed by the person who heard it is of course not F
　　Let's stop the RECOGNITION there.
　　　This is the fundamental idea of Clean Language
　　[https://gyazo.com/5c088381cbf99bc1b93d9f59a0c2784a]
　　Focus only on the phenomenon of "the other person said A."
　I understand why the rule is "don't change the words the speaker used."
　　Using the word A used by the other party can point to F, even if the word came from a non-parallel process
　　　What that F is is not clear to the listener, but it's not a practical problem.
　　CIRCUMLOCUTION is generated by asking a question to F
　　　CIRCUMLOCUTION is the creation of RELEVANCE between experienced meaning
　　　F becomes clearer as RELEVANCE increases.
　　　[https://gyazo.com/9a4a6bcb7d7a6a64d6334b525d154d1f]
　He previously explained Keichobot's behavior as "clean language and that's the way the rules are."
　　I can now explain without attributing it to "it's a rule."
　　Since this is the kind of mechanism that encourages verbalization, we should not RECOGNITION the symbols uttered by the user.
　　　That's why Clean Language coaches are trained to "never interpret a client's words without their permission."
　　　No need to understand user symbols, even when software acts as a coach
　　　Since the goal is to encourage this process, we only need to know what the symbols represented as a phenomenon are and what symbols are represented as being between them!
　　"COMPREHENSION of how Clean Language works! [fully understood.icon]"

[Phenomenology as an illogical stage]
 Materials I would use if I had more time.
 I don't have it, so I don't use it.

question
　Q: I thought Keichobot "doesn't change the words used by the speaker" because "it's too difficult to change software-wise".
　A: Quite the opposite. When I went to study Clean Language, I learned the rule that the listener should not change the speaker's words. At the time I didn't understand the principle of why this was so. I thought, "I'm not allowed to change or interpret the speaker's words...hmmm, that's a lot of work for a human, but isn't that something software is better at?" I thought. So I made it, and that's how it went.
　Q: About this diagram
　	[https://gyazo.com/73018abef8816d7d394a9c55c94a5b89]
　Does the information that Mr. A wanted to convey not necessarily match the information that Mr. B understood?
　A: They do not necessarily match.
　　For example, "When I read a text of a poem many times, a different meaning comes out" or "When I read a book I read when I was young and read it again after a long time, I received from it a meaning that I did not notice when I was young.
　　This process is non-parallel and creative, so new meanings are being created, and they don't necessarily correspond to what Mr. A thinks they mean.
　Q: What does it mean that Mr. B COMPREHENSIONED...
　A: First of all, as a basic premise, Mr. B is not COMPREHENSION in this figure.
　　COMPREHENSION on the left, METAPHOR on the right
　　I'm confused because it's the opposite of everyday conversational usage, but as the label Gendlin gave, "the process of seeing a symbol and thinking of its meaning" is METAPHOR, not COMPREHENSION.
　　So, when Mr. B sees the symbols that Mr. A produced and "something vaguely comes into his brain," what comes into his mind does not necessarily match what Mr. A wanted to convey.
　　　In order to bring this closer, it is necessary to have a process whereby Mr. B outputs his vague fuzziness in words, and then Mr. A looks at the output and directly matches the vague fuzziness that came to his mind with "what I wanted to say" to see if he says, "Yes, that's what I wanted to say" or not.
　　>Not necessarily a match.
　　Rather, they do not match in most cases.
　　The reason why the parallel symbols are almost identical is that they have been rubbed together in people's conversations, so they have converged in a way that they are all connected to the same thing in everyone's brain.
　　When I see the symbol "canine," I don't think of a red, thorny plant, nor do I think of something metal with a rounded tip that I put in my mouth when I eat.
　　Young humans who have not yet converged on the word "canine" for "a four-legged animal that meows".
　　Learning results in convergence.
　　As we communicate and fail and succeed, we're choosing to "connect symbols and meanings" that are more successful.
　　This is what Merleau-Ponty calls "[institutionalized language]," refined language
　　We tend to think only of those refined words, but the "just-born words" that were just said before they were institutionalized, before they were mumbled and poorly said, are not parallel, they are distorted, they didn't come straight down.
　　Therefore, Gendlin's idea is that we need to pay attention to the non-parallel when we think about verbalizing such things.
　Q: If the blur is explicit, do you put it out on COMPREHENSION?
　A: That "explicit" in "the blurring is explicit" is uncomfortable for me.
　　Moyamoya = felt sense, I think.
　　The felt sense evoked by the word is somewhat clear
　　Moyamoya's felt sense is not yet clear.
　Q: Do we need to make full use of the four relationships in order to verbalize such mumbo-jumbo?
　A: Yes.

[Study Session 2 on "Experiential Processes and the Creation of Meaning"]
