about the "felt meaning" fulfilling a specific function, necessary for cognition.
from ["Experiential Processes and the Creation of Meaning" Study Session 1].
about the "felt meaning" fulfilling a specific function, necessary for cognition.
	1. Problem Solving
 	[Dewey's concept of "suggestions
 	[nishio.icon]When you are thinking about solving some problem, it suddenly "occurs to you" (we've all experienced it, right?).
 	 This "idea" seems to involve "felt meaning".
 	 For example, on a math test in middle school or so, there are problems that can be solved by expanding and organizing, and there are problems that cannot. For the latter, I'd worry for a while about how to solve it and then do something like, "Oh, I did something like this on a problem I solved before.
 2. reproduction and segmentation
 　The process of "forgetting and remembering" also uses "felt meaning."
 　 [nishio.icon] "Oh, I was going to say something, but what was it?"
 　 　There is a sense in which "what I was going to say" exists.
 　 　But that hasn't been symbolized yet.
 　　Same composition as "come up with a solution."
 　ARTICULATING
 　[nishio.icon]I think the English word articulate is distorted when translated into Japanese. The word is used both in the situation "this product can be broken down into its parts" and "he can speak fluently and consistently on the subject.
 　[https://gyazo.com/51362e1e8edf043d3d18fd8f9b726eeb]
 　The composition is similar to the use of the same kanji for "Wakaruke" and "Wakaru" in Japanese.
 　The [segmentation] here is contextualized by the linguist [Saussure], "The world is segmented by ignoring some differences and focusing on some differences, and the way it is segmented varies from one national language to another."
 　Specific example: In Japanese, grandchild is one of the "grandchildren", but in Chinese, there are four different ways.
					sūnzi, sūnnǚ, wàisūnzi, wàisūnnǚ
					(Japan also used to have a distinction between "inner-grandchildren/outer-grandchildren")
				English: brother is an example of something that is divided in Japanese but not in English.
				On the other hand, there are ox and bull, which are examples of things that are not separated in Japanese but are in English.
	Psychotherapy
	　>Psychotherapy is an area where [segmentation of experience] is constantly taking place.
	　[nishio.icon]I feel this is a succinct and to the point expression, but it doesn't ring a bell if you don't have an image of "psychotherapy"?
	　　For example, a client comes in and says, "I'm having a hard time with my heart.
	　　There is a subjective "hard feeling" there, but he can't put into words what it is and why it exists.
	　　　An ongoing experience of spiciness (Experiencing) is present and not yet symbolized.
	　　Psychotherapy facilitates this segmentation.
	　　　It is known empirically in the field of psychotherapy that this reduces subjective distress, etc.
	　　　In [cognitive therapy], we do things like "write what you feel on paper," but I think that by putting subjective things into words and putting them outside of yourself, you will be able to treat them "objectively/third-party/[* as if they were other people]/with distance/[associate]" to them.
