I've read Merleau-Ponty's commentary on Husserl's phenomenology and want to see how well I can explain it without looking at it.

[/nishio/kei.icon]What would you like to see happen in this conversation?
I've read [/nishio/human.icon]Merleau-Ponty's commentary on Husserl's phenomenology and want to see how much I can explain without looking at it.
[/nishio/kei.icon]What kind of "hussar" is that "hussar"?
[/nishio/human.icon]A philosopher famous for his phenomenology, who, according to Merleau-Ponty, brought the discussion of language, which was not so mainstream in the genealogy of philosophy.
[/nishio/kei.icon]What kind of "Merlot Ponti" is that?
[/nishio/human.icon]Merleau-Ponty is also famous for his philosophy on language, the contrast between institutionalized language and the language that is being born.
[/nishio/kei.icon]Is there anything else about that "Merleau Ponti"?
[/nishio/human.icon]Now I want to talk about Hussar.
[/nishio/kei.icon]What do you value?
[/nishio/human.icon]I would like to verify the extent to which you understood Husserl by answering the question
[/nishio/kei.icon]Is there anything else about that "hussar"?
[In the early stages, I was interested in the unified nature of language, but in the later stages, I came to believe that a person's attempt to use language to express himself or herself constitutes a unified system.
[/nishio/kei.icon]
 > Merleau-Ponty is also famous for his philosophy about language, the contrast between institutionalized language and the language that is being born.
 Where is this "Merlo Ponti" located?
[/nishio/human.icon]ðŸ‘Žãƒ¡ãƒ«ãƒ­ãƒãƒ³ãƒ†ã‚£
[/nishio/kei.icon]
 > I would like to verify how well I understand Husserl by answering the question.
 How do you know this "hussar"?
[/nishio/human.icon]è§£èª¬ã‚’èª­ã‚“ã ã‚“ã§ã€‚
[/nishio/kei.icon]What kind of "read" is that "read"?
[/nishio/human.icon]Chopped and arrayed in Kozaneba, this as an experiment in support of the process of reading.
[/nishio/kei.icon]
 > I would like to verify how well I understand Husserl by answering the question.
 What do you hope will happen regarding this "hussar"?
[/nishio/human.icon]Now that we know a lot about Husserl, let's read Heidegger next, I hope.
[/nishio/kei.icon]What needs to happen to the "hussar" for that to happen?
[/nishio/human.icon]Hussar won't change, so I hope I can answer your question
[/nishio/kei.icon]With regard to "hussar", can it?
[/nishio/human.icon]I'd like to do a test to see if I can answer that question.
[/nishio/kei.icon]
 > Hussar will never change, so hopefully I can answer your question.
 Where is this "hussar" located?
[/nishio/human.icon]ã¾ãšèžã„ã¦
[/nishio/kei.icon]ã¯ã„
[/nishio/human.icon]Let's see, if we consider that language is the accidental result of various events in the past, it would be incomprehensible and chaotic for it to become a unified semantic system.
[/nishio/kei.icon]ã€Œãƒ•ãƒƒã‚µãƒ¼ãƒ«ã€
[/nishio/human.icon], and not so much by humans trying to express what they want to say, but by humans trying to express what they want to say, thereby approaching a unified system.
[/nishio/kei.icon]ã€Œãƒ•ãƒƒã‚µãƒ¼ãƒ«ã€
[/nishio/human.icon]Well, I can't explain it anymore, you don't understand much.
[/nishio/kei.icon]ã€Œãƒ•ãƒƒã‚µãƒ¼ãƒ«ã€
[/nishio/human.icon]ãŠã—ã¾ã„
[/nishio/kei.icon]What would you like to see happen in this conversation?
[/nishio/human.icon]I wanted to verify how much I understood, but it was still difficult to explain without seeing anything
[/nishio/kei.icon]What kind of "verify" is that "verify"?
[/nishio/human.icon]If you understand enough, the words will come out, if not, you don't understand yet.
[/nishio/kei.icon]
 > Hussar will never change, so hopefully I can answer your question.
 Where is this "hussar" located?
[/nishio/human.icon]That's before Merleau-Ponty.
[/nishio/kei.icon]What do you value?
[/nishio/human.icon]You're asking why I'm trying to understand Husserl, because Eugene Gendlin's ideas were very much in line with my practical purpose, which was to focus on how to put the unverbalized into language, so I was studying that, I ordered the Merleau-Ponty text he was referring to, and I read it, and it was a commentary on Husserl and then a development of Husserl, so I decided to experiment with that as a test bed, and I experimented with using Kozaneba to go through the process of reading and understanding a difficult book.
[/nishio/kei.icon]What does that "hussar" look like?
[/nishio/human.icon]It's a source, I don't know if it's useful per se, Eugene Gendlin and Merleau-Ponty both developed a lot of Husserl's story as a premise, so it would be good to know where the Husserl origin is.
[/nishio/kei.icon]Where does that "hussar" come from?
I was interested in it because [/nishio/human.icon]Eugene Gendlin introduced it to me, and I had originally passed on "phenomenology" thinking "hmm, I don't know, it doesn't seem useful for my life," but now I'm finding that it's actually quite relevant with respect to my current interests. I've come to realize that it's actually quite relevant to my current interests.
[/nishio/kei.icon]
 > You're asking why I'm trying to understand Husserl, because Eugene Gendlin's ideas were very much in line with my practical purpose, which was to focus on how to put the unverbalized into language, so I was studying that, and he was introducing me to Merleau-Ponty's writing. I ordered and read the Merleau-Ponty text that he was referring to, and it was a commentary on Husserl and then a development of Husserl's commentary, so I decided to experiment with that as a test bed and try to use Kozaneba to go through the process of reading and understanding a difficult book.
 What "language" is this "language"?
[/nishio/human.icon]Language used as a means of expressing what you want to express
[/nishio/kei.icon]What is the relationship between that "language" and "Hussar"?
[/nishio/human.icon]Husserl paid a lot of attention to language, rather philosophy is the beneficiary of language.
[/nishio/kei.icon]Is that "language" the same as "Hussar"? Is it different?
[/nishio/human.icon]é•ã†
[/nishio/kei.icon]
 > Husserl paid a lot of attention to language, rather philosophy is the beneficiary of language
 Is there anything else you can tell us about this "language"?
[/nishio/human.icon]è¨€èªžãŒå“²å­¦ã‚’åŒ…ã‚€ï¼Ÿï¼Ÿ
[/nishio/kei.icon]What happens to "hussar" when its "language"?
[/nishio/human.icon]The philosophy he does is itself done using language, a process that Merleau-Ponty argues should be repeated
[/nishio/kei.icon]What is between that "language" and "hussar"?
[/nishio/human.icon]ã†ãƒ¼ã‚€ã€ã‚ã‹ã‚‰ãªã„
[/nishio/kei.icon]
 > The philosophy he does is itself done using language, a process that Merleau-Ponty argues should be repeated
 Where can I find this "Merlo Ponti"?
[/nishio/human.icon]Between Husserl and Eugene Gendlin
[/nishio/kei.icon]What is the relationship between that "Eugene Gendlin" and "Hussar"?
[/nishio/human.icon]So Eugene Gendlin himself tried to formalize philosophically the concepts that Carl Rogers was using practically, and then he realized that half of it was phenomenology, and he put one foot in Husserl!
[/nishio/kei.icon]Is that "Eugene Gendlin" the same as "Hussar"? Is it different?
[/nishio/human.icon]é•ã†
[/nishio/kei.icon]
 > The philosophy he does is itself done using language, a process that Merleau-Ponty argues should be repeated
 How do you know this "Merlo Ponti"?
[/nishio/human.icon]Maybe you should read the rest of the article and figure out Merleau-Ponty's argument.
[/nishio/kei.icon]What is the relationship between that "Merleau-Ponty" and "Hussar"?
[/nishio/human.icon]Yes, so far I don't see the difference between Merleau-Ponty and Husserl's arguments, I don't think they are equal, but what is the difference
[/nishio/kei.icon]Is that "Merleau-Ponty" the same as "Hussar"? Are they different?
[/nishio/human.icon]It should be different, but I can't tell the difference right now.
[/nishio/kei.icon]
 > Yes, so far I don't see the difference between Merleau-Ponty's and Husserl's arguments, I don't think they are equal, but what is the difference?
 Where does this "Merlo Ponti" come from?
[/nishio/human.icon]How did I know that? The engineer's intellectual production technique mentioned it.
[/nishio/kei.icon]
 > Yes, so far I don't see the difference between Merleau-Ponty's and Husserl's arguments, I don't think they are equal, but what is the difference?
 What does this "Merlo Ponti" look like?
[/nishio/human.icon]ã‚ã‹ã‚‰ãªã„
[/nishio/kei.icon]
 > The philosophy he does is itself done using language, a process that Merleau-Ponty argues should be repeated
 Where is this "language" located?

https://keicho.netlify.app/#talk=ryIQ1Vrjd2rXf1wKg8s4
#KeichobotLog