Kozaneba:dwell-think
I tried an experimental and unusual approach (not doing it verbatim, but picking up keywords roughly first) for sentences that are related first: [Kozaneba:thing].

2021-12-25
Okay, now that I've had some time to reflect on this.
Experiments that tried the "don't do it verbatim, pick up keywords roughly first" approach, and what was observed was
　I get anxious when I don't understand.
　When nothing is picked up, I get the feeling that I just skipped over something because I didn't understand it, or that I need to read it more properly.
When doing it verbatim, this feeling didn't occur to me, I would just go on and on, one line done, another line done, and so on.

I don't know what speed is appropriate to read a text that cannot be understood by reading it at normal speed.
So maybe it would be better to default to the slowest method and speed it up if you can figure it out.

If you are going to do this, you should either abandon reading and understanding the text and simply aim to pick up keywords that appear at a high frequency.
　In addition, this can be done by the program


1 Pomodoro
The key word is "handed down."
1 Pomodoro
[https://gyazo.com/70685798a4b7f03656fdb201792c0179]
1 Pomodoro
[https://gyazo.com/314e5d20fb089a86f751cda48db7e9dc]
I ran 3 pomodoros and finished the first 8 pages.
605 items
 I guess it's from this amount of minutes that I start to stress about the speed.
　If we continue to add to it, the stress will increase, so we'll organize one pomodoro.

[https://gyazo.com/65671695324f13bdbe5b5059d35a5001]

2022-01-11
1pomo
[https://gyazo.com/cde05b5b6698c5ff0a91bbd369af911e]
According to the quantity-based estimate, we'll finish chopping in two more pomodoros.
1pomo
[https://gyazo.com/218a9e9af93e052f1f417bbd2a5c5a85]
1pomo, I was able to proceed to the end anyway.
[https://gyazo.com/98a3e9c65115bb92c26028685c070c3b]
The trouble with this sentence is that it is full of [non-parallel symbols].
The word should not be taken to mean what the word means in the present day, so he specifies.
When "thinking itself also belongs to living, in the same sense as building, but in a different way" in
 A: Thinking
 B: Building
 C: Living
is a nonparallel symbol
A is not defined in the text, it is indicated by the text development

C is the fundamental trend of existence, in which mortals exist for its own sake."
D: The mortals
　This means approximately the same as "human

The essence of B is to make C effective."
　There's a little bit of Nishio's interpretation in there.
　　The essence of building is to make it live."
　　Only when you are able to live in it, can you build it."

"B. It produces in the way that it does."
	E: Produce

E is to let it appear, to make it something that continues to be present and present."
	F: Things that continue to exist in the present

B is to bring the four directions to this one, the bridge, which is a single thing, and to bring the thing as a place to the front, which is already F, and only then will this F be vacated by this place."
 G: Four-directional world
 H: Object
 I:Bridge
 J: Location
 K: Passing vacant
	B is to bring G to this one, I, which is H, and to bring H, as its J, to the front, which is already F, and only then will this F be Ked by this J

Oh, there's a vexing thing about doing this in text itself, too.
[https://gyazo.com/9c6b31999d93a30d2b8a7ac96f26b8e3]
　To paraphrase in Nishio's words, though it distorts the point so far a bit
　　C: To live" is approximately "a way of being.
　　B: to build" is "to produce somethings that allow people to exist in a good way."
　　Thinking itself belongs to living in the same sense as building, but in a different way.
　　　A: Thinking" itself also belongs to "C: Dwelling: the way of being that one is" in the sense of "producing something that allows one to exist in a good way," but in a different way (in that it does not create a physical dwelling place).

A place vacates the four directions in a double sense: it allows the four directions to enter and it also arranges the four directions. A place both allows the four directions to enter and arranges the four directions."
	J Ks G in a double sense: J allows G to enter and also sets G in order.
　Incidentally, as noted in the paragraph here, a "bridge" is a "dwelling place" but a "narrowly defined residence" is not a "dwelling place". Again, we have to consider symbols separately from "the meaning that the symbols refer to in the present day.

The essence of what we call a building, a place, a thing."
　L: Building
　J': object as a place
"Let's name those things that allow a place to dwell as J...L."
　In the essence of "J's" lurks a relationship between J and space, between J and the people who stay there.
	M:Space
Raum (space) is K'ed, or "brought together by a certain J, that is, by a kind of H, that is, I."

"The gathering is in the way of allowing a dwelling place in the four realms."

The fundamental trend of C is to labor, and to labor is when you harbor something positive...when you harbor something and bring it back to its essence."
　Nishio's commentary: "Thinking" that is not defined in the text, but expressed in the behavior of the text, is a type of "laboring" that returns the symbol to its original meaning rather than to the meaning that the symbol refers to in the present day.
　I'm telling this story after explaining that the ancient word Bauen suggests that to build is to live, and that it means not only to build, but also to care for (labor) the crops.

impressions
　By the end, you may be asking yourself, "Can I understand this?" "Even if I could understand it, would it be useful?" and "Even if I could understand it, would it be useful?
　I was not able to grasp it when I got to the end, and that was a pity, so at least I wanted to understand the meaning of "thinking itself belongs to living, in the same sense as building, but in a different way", and when I asked the "question", I understood it so that I could solve it smoothly.
　A third-party description of the actual phenomenon is
　　After three hours of careful reading from the beginning over the course of two separate days
　　I understood it by reading it backwards and diagonally.
　Do you understand what to pick up and what to skip by calling it carefully?
　Subtle as to whether it would be useful for Kozaneba's development

2022-01-13
　I've figured it out over time.
　Heidegger's approach was to return to the original meaning of a word and look at its relationship to other words as a concrete way of working with it.
　　Original meaning, not modern meaning
　One specific approach I took to laboring was to look at the words Heidegger used and see how they relate to other words, without interpreting them arbitrarily.
　　Not the dictionary meaning, but the meaning Heidegger was trying to express.
　So both are "laboring = thinking".
　　Both [information architecture] and architectural architecture are architectures.

---
2022-01-14
[https://gyazo.com/0163f599b1803b684fa8216e3f8b5d8a]


[https://gyazo.com/5825db96ab0b687e270fed7e785167a6]
[https://gyazo.com/50675ac55a26d4fc34e186947d16b3a2]
[https://gyazo.com/4d10b09319c3d4a6441033d9cac057da]
[https://gyazo.com/e791fea8fda964c8421a82f596d9bc4c]
[https://gyazo.com/425eff4c49617ed194df0ead4e24b825]

>Listen to the language as it is handed down.
>Inherent labor is something positive, and it arises when we leave something in its prior essence, when we hide it and return it to its essence. That is, it is when we take something out of hiding and return it to its essence, or, in line with the word "free," it is when we einfrieden it. To dwell, to be led to peace, is to be enclosed and to abide in das Freie, that is, in the free open space where all things are free to labor and display their true nature. The fundamental trend of dwelling is to labor in that way.
[https://gyazo.com/cc1b87f9ae705b289ec996e3025569df]
