Computer graphics, media art, tea culture, and Zen.
Computer Graphics, Media Art, Tea Culture, and Zen
[https://gyazo.com/7f6e657f9eb761a358673b66cef83699]
[Computer graphics, media art, tea culture, and Zen. [Yoichi Ochiai]

[https://gyazo.com/1eebf9f57f16dc66e2b1121a3f5ccd73]
2021-12-16 #SIGGRAPHASIA2021
I took rough notes at the venue.
2021-12-20 Additions.

Table of Contents
　Materializing computer nature
　　Computer Graphics and Media Art
　Stationary nomads
　　Sustainability and Media Art
　tea culture
　　Media Art Alternatives
　the familiarity of a tea-ceremony scene
　　Apu and sora, once in a lifetime
　Mingei and Symbiosis
　　[Tools for Conviviality]
　To Life
　　Alternatives to Man and Nature

[Nam June Paik]
	https://ja.m.wikipedia.org/wiki/ナム, June Paik

What is "materialization"?
　https://ja.wikipedia.org/wiki/荘子
　Theory of the Chiral Object
　[Butterfly Dreams]
　　[nishio.icon]I was reading Heidegger's "[what is technology]" recently, so I thought he was talking about the "materialization" of that one, maybe they have the same root, but I guess I should think of them as different things first.
　transformation of material things

media art
　Technological developments in photography and imaging
　 →The Birth of Media Art
　Conscious of the newly emerging medium

Gap between the material world and the image in the mind
 Process of rendering into matter to image
 　dig out a stone
 　mural
 　animation
 　Aerial Display
  　Make the air glow
 　　acoustic levitation
　Creating a display that touches the air is halfway between a touchable substance and an untouchable image.
　Can interact with animals and plants
  Matter and Image

Material and Image, Changing Perceptions of the After Corona
　Image as an extension of corporeality
　The image is the second body
　　[nishio.icon]Avatar-like or videoconference camera images
　 　That would be presence.
　 　Not content.
　　It's a different context than projection equipment or appreciation of a work of art.

"nomads in residence."
	stationary nomad
	Nam June Paik
	　There was an oil crisis and other times when people thought about the relationship with the environment.
 [Random Access Information]
 Music and dance 500,000 years old, painting 20,000 years old.
 　They weren't settled until agriculture was born.
　 Music: Art that people can take with them
  　[without gravity].
  The Big Picture
  　Heavy and inconvenient to carry
 To solve energy problems
　 Keep the body moving and the idea moving.
　 Stationary nomads
  The body is fixed.
  　I'm sure you've all felt it keenly over the past two years.
　　　But something unfulfilling, a problem of physicality.
　More and more visual works are being created.
　　Until now, it has been mechanical.
　Waterproof, LED, heightened resolution 4K, 6m, 1mm pitch, video outdoors
　≪Brewing monoliths≫.
　To make it work as an installation without having to physically construct it.

Post-Covid, Nam June Pike Thinking
　Sustainability, the new everyday, physicality and video, NFT, changing media arts

Visual works are becoming more physical.
　Draw a horizontal line to the horizon.
　　30 transmissive displays
	To the extent that you feel physicality.
		big
		Images that blend in with the space.
	Human move and maintenance, but difficult
 Set up without going to the site
 　Things can be customs cleared, human mobility is difficult.
　Sending works and things electronically

The rise of the NFT market
　Moving non-physical art on electronic space
　We are approaching a sedentary nomadic population.
　Reasonable change from physical galleries and auctions to electronic ones

Media Art and Sustainability
　two
 　1: Sustainability per se
 　　Frequently broken
   plow (esp. horse or ox-drawn)
    Float it so that it reflects the surroundings.
    Easily broken
   3 exhibits, 10 spares, 8 broken.
   　Contrary to Sustainability.
   How can it be unbroken?
 　  →NFT and saved.
 　2: Environmental Impact
　　　small is beautiful
　　　　Schumacher
　　　　human-centered economics
　　　　　Buddhist economics
　　　Stationary nomads
　　　　Settled in the vicinity

Maybe there is a clue in the tea culture.
 bamboo tea spoon for making Japanese tea
 bamboo duster (with the leaves still attached at one end)
 It can be made by laying bamboo on a thatched roof for 100 years.
 I can get it from an abandoned house.
 	>Susudake is bamboo that has been collected from the attics and ceilings of old thatched-roof houses, and has been smoked over 100 to 200 years by the smoke from hearths, giving it a distinctive brownish-brown or candy-like color.

Seeing Tea Culture as an Alternative to Media Art
 courteous
 　The gesture of serving itself is a performance
 Chajin is a curator and performance artist
 　What to put in a tea room = curation
 　Create an experience to narrate something
 　　Close to media art
　Conscious art of what media to use.
　Use of the classic medium of "message with assortment of videos"
　Tea room made of gunpla runners
	Rikyu's waiting-an vase
	Natural products for local production for local consumption

the familiarity of a tea-ceremony scene
	steadfastly sticking to one's principles
	Same taste
		>This expression is used to mean that although the tea ceremony and Zen may seem to be different, the conditions sought are the same. Chanoyu is connected to Zen. Originally, the tea ceremony is a path that arose from Zen. ([Practical Japanese Expression Dictionary https://www.weblio.jp/content/%E8%8C%B6%E7%A6%85%E4%B8%80%E5%91%B3])
　ninja working in the field of Zen Buddhism
　tea used for tea ceremony

500 year old teacups
　Highly sustainable

National Museum of Emerging Science and Innovation
　I didn't build a tearoom, but I represented a tearoom.
	Make a bamboo grove with silver and place hanging scrolls and ikebana.
　Nature in the computer,
　　Nature Outside
　tea ceremony
 Kegon (sect of Buddhism)
 Computer Culture
 I think they're close.
 Ikebana is an installation
 　Ikebana and Robot Arm
　teacup
　　I'll try to get the weight right and serve it in aluminum.
　　Putting the digitally made object face to face with the craftsman.

aesthetic sense in Japanese art emphasising quiet simplicity and subdued refinement
　Can be explained without using Buddhist terminology.
　[https://scrapbox.io/files/61babbd4a17386001d0f93a5.jpeg]
　　Wabi: Rough and random decadence
　　Sabi: forms appearing by time, things that come up with time
　　Beauty found in the process of harmony
　　Repeatedly approaching Nature

folk art movement
　Beauty with Life
　Look for art created by someone who is not a specific artist.

Mingei and Symbiosis
　What's missing with Zoom
　[IRIICHI]
	　https://ja.wikipedia.org/wiki/イヴァン and IRIICHI
	[Tools for Conviviality]."
	　[Convivial]
	Conviviality, Festivity and Co-Exultation
	　If there is not enough, it will not be possible to efficiently satisfy the needs that are generated among the members of society.

Soetsu Yanagi
	https://ja.wikipedia.org/wiki/柳宗悦
	Traditional beauty in objects made by unknown artisans in their daily lives
	Rediscovering Mingei through Technology
	　Lion puppet about the size of a pinky finger
	　When viewed with a zoom camera, there are DETAILS that are not captured by the human eye.

I want my digital data to last.
	platinum print
	Dedicated to Daigoji Temple
		https://ja.wikipedia.org/wiki/醍醐寺
		>Year of foundation: 16th year of Sadakan (874)
		last 1000 years
	Cannot be printed commercially.
		Printed by hand
		The process of doing it is very convivial
 Japanese paper
 	Long-lasting because it does not change pH
 	cellulose lump
 	I treat paper very well knowing that my grandmother took the time and effort to make it.
 	convivial
　Make it together at the SIGGRAPH venue, or make it at home.
　　In addition to writing papers and making SOTA stuff.
　　How can we create something CONVIVIAL?

To Life
 fashion show
 	patchwork
 	Long-lasting clothing culture
 	old rag from the Tohoku region
 	Clothes that have been handed down for 200 years
 		shame
 		In recent years, it has been re-attracted
 	Gathering sustainability stuff from all over the place

Daigoji Temple
	Trees were broken by the typhoon.
	Exhibit of digital objects growing from stumps
	　transmissive display
	Collaboration with the voice of sutra reading
　LEDs will be a natural material in the future.
　Surprisingly, it fits in with tradition.
　A culture of using and enjoying different mediums
　　I think it will survive like the tea culture.

Saint-Exupery
　[Human land].
　Machines are disappearing from human consciousness.
　Every technology approaches nature.
　　Digital becomes natural too.

A non-human-centered landscape of life
　Transcendence of value and worthlessness
　　Related: [hua gong] [matter matterless].
	Sustainability without subjectivity
	　Something that lasts even when people are gone.
	world fair
	　We need to regularly make things that can only be made with computer science expertise.
	folk art
	　Expo 1970
	　High economic growth, industrial products, uniformity
	　Review of the beauty of handwork that deviates from uniformity
	At the next Expo.
	　They could all be wearing uniform goggles.
	　But I think something less uniform will be reviewed.

Kegon (sect of Buddhism)
symbiosis
folk craft

Buddhist philosophy
	computational nature
	It could be done without the religiosity.
	[nishio.icon]You mean to pull out the oriental thought that has its roots in Buddhism and replant it in "nature with computers" in the same way as the computerized expression of Wabi and Sabi?
	　Yes, because there were no computers in Buddha's time.

---
question

Feeling that something is unfulfilled
　convivial 
　Yanagi looks to folk art as a method to regain
　Not "what we believe" but "what people use."
　beauty for your use
　The Beauty of Use
　I'm missing something in Zoom.
　　Must we revert to "stuff"?
  mindfulness
  　Derived from Zen practice
  　Calm yourself down.
  folk craft
  　It's not what I practice.
  　see through a tool
  　　The unfulfilled is fulfilled.
  　self-serving
  　For example, do foodstuffs at home
  　　There's a dish for that.
  　　Something I like, something I think is beautiful, rather than something that is functional.
  　　Hand craftsmanship, digital fabrication

Regress to things that have fulfilled conviviality?
	I think so

Metaverse, a world devoid of corporeality, this is not coming?
　No, convivial is a resolution issue.
　　The problem with the current Metaverse is largely a lack of resolution.
　　OK as long as the display progresses.
　It's important to have a system that doesn't specialize only in things that you think about with your mind, like logic.
　　To what you feel in your body
 　Early Twitter "Now" = physicality
 　　It is not the meaning that it flows in the timeline, but the body
  　　[nishio.icon]Maybe it's because the action was sharing what you felt without thinking too much about it in your head.
 　　　If you come close to it, you will create a coexistent experience.
 	　Approaching meaninglessness, non-logicality, and physicality
 	　　Ai zu ku, toast to bump it.

Direct, unequivocal action on an objective?
　Indeed, it diminished.
　　For example, it doesn't produce added value for the purpose of moving conference rooms.
　Q: Is it necessary to add more things that do not add value to the objective?
 A: Value-added can have better space with added value.
 　No need to stick that in the meeting.
 　There is no need to include the "non-value-added conviviality" of "travel" in the meeting.
 　　Or making tea at home.
 　A form of craft that is closely related to daily life
 　　Digital or non-digital.

Discussion of physicality
	What's the point of being mobile if you don't stay home and move?
	Settled nomads place comfortable objects around them.
	　What I work for, what I live for, what I like ([nishio.icon] is this a quote?)
	They've been saying that since Nam June Paik.
	　Marginal costs are lower, allowing for creations that are not for convenience purposes.

Q: I'm starting to understand a little better what you meant by Digital Nature. Why did you name your lab the way you did?
	When 26-7
	I was thinking of going with Computational Nature.
		Too long.
		I decided to go digital.
	Original nature ←→ Nature without mass Simulated nature
	by cutting out information on top of the digital signal.
　Nature that is not in rocks but in living things.
　Massless nature affects original nature.
　　Natural objects as a whole
  meta-nature
  	Every single level of the metaverse has different laws(?).

Q: I don't understand how digital and nature get attached when you are older, do students understand this?
	[Object Oriented Onntology]
		https://en.wikipedia.org/wiki/Object-oriented_ontology
		Philosophy influenced by object-oriented
		>In metaphysics, object-oriented ontology (OOO) is a 21st-century Heidegger-influenced school of thought that rejects the privileging of human existence over the existence of nonhuman objects.
		Deconstructing Nature and Calling the New Nature Digital Nature
		I understand students who are studying.
		　Philosophy or physical theory.
			Students may need to study it to understand it.
 	nature
 		Not in relation to humans.
 			[nishio.icon]Instead of a "man v. s. nature" composition, we have a "man v. nature" composition.
 		Nature as a system that includes humans
 		Then it's not surprising that digital is included there.
 		　And the nature that contains the digital is a little different from the nature we've seen before.
 		When you reach the age of PhD or so, you reach a point where you can say "I'm not a PhD.

---- afterwards
>[nishio https://twitter.com/nishio/status/1471523101469196288]: I wonder if it means that the conflict structure of "art without mass (e.g. songs) v.s. art with mass (e.g. large paintings)" has reached the Aufheben of "digital data without mass" + "displays (= things with mass) large enough to feel physicality". I wonder if this means that we have reached the Aufheben of "displays (= things with mass)"...

>[nishio https://twitter.com/nishio/status/1471525395904462848]: I'll have to go back and read the lecture video or slides a bit, my notes are not enough information. In particular, the keyword "hwagon" in "hwagon, symbiosis, and folk art" does not sit well. I think "physicality" is a stronger pipe connecting the first half and the second half.

>[nishio https://twitter.com/nishio/status/1471526074203127809]: #Kozaneba
>[https://gyazo.com/23296422fb19d86f165fb99c9a8636eb]

>[ochyai https://twitter.com/ochyai/status/1471531867044483078]: I'm so sorry I skipped Kegon because I didn't have time. I'm sorry I skipped Kegon because of lack of time....
>> Formation of Chinese Hua Yan through fusion of the Hua Yan Sutra and Zhuangzi
	[https://neieiko.web.fc2.com/tzs/tz4r.html "The Transcendence of Eastern and Western Thought" recounted in Part 4]
	>[nishio https://twitter.com/nishio/status/1471545658872299520]: I think it is more important to know "which aspect of Miraikan's exhibition you feel the concept of Hua Yue" than "the concept of Hua Yue" itself. I think it is more important to know "which aspect of the Miraikan exhibition you feel the concept of Kegon".
		>[ochyai https://twitter.com/ochyai/status/1472062123270635523]: oh I see!
		>[https://www.asahi.com/and/article/20191204/7900625/ Pondering a Future in which the Boundary between Nature and Computers Dissolves A new permanent exhibition under the general supervision of Yoichi Ochiai opens at the National Museum of Emerging Science and Innovation (Miraikan) | Asahi Shimbun Digital Magazine & and]
  >[https://bijutsutecho.com/magazine/news/exhibition/13512 Yoichi Ochiai's recent and new works are all here! ∽mountain, purple and clear ∽everything is indispensable ∽computing machine nature" exhibition will be held｜Bijutsu Techo].
  >[https://newspicks.com/news/2383238/body/ [Yoichi Ochiai and Chiaki Hayashi] Digital Nature can be explained in Buddhist terms]

I started reading the Hua Yan material that Mr. Ochiai gave me.
[Kozaneba: The Formation of Chinese Hua Yan through the Fusion of the Hua Yan Sutra and the Zhuangzi].

>[nishio https://twitter.com/nishio/status/1472065599740473348]: we, when a thing "is", implicitly assume that it "will continue to be", but that is just a "mental model of how the world works" that we learned while growing up in the old physical nature. It is just a "mental model" learned while growing up in the old physical nature. The assumption that things "continue to be" does not hold true in a "state where all five senses are digitally covered", which is an extension of covering our vision with HMDs.

>[nishio https://twitter.com/nishio/status/1472066708378910721]: The laws of the "old physical world" including "what is" is "always" need not be true in the "new digital world," and it is natural to assume that the worldview of people of the future living in that world will naturally differ from the worldview of people of today. It is natural to assume that the worldview of people of the future, who live in such a world, will naturally differ from the worldview of people of today. For example, objects do not have fixed entities, but only appear as needed.
	>[nishio https://twitter.com/nishio/status/1472068165199069186]: In modern terms, "3D models in VR space are downloaded and placed as needed from asset stores containing vast amounts of data. In the words of a futurist who was born and raised in a digital world, "an individual object is a manifestation of the Absolute, segmented in various ways, and has no fixed substance".
	>[nishio https://twitter.com/nishio/status/1472069730295238662]: This "worldview that is commonplace for people of the future" is actually, surprisingly, almost equal to the "vacuum view = all individuals have no fixed substance" and the "director-less view = the reason of eternal, infinite, and absolute existence becomes self-segmented and manifests itself in various individuals" in the Kegon sect. The "view of the vacuum" in Kegon Buddhism is actually almost the same as the "view of the infinite, eternal, and absolute truth that is self-segmented and manifests itself in a wide variety of individual objects. This is why the worldview of Hua Yan is the worldview of computer-based nature.
	>[nishio https://twitter.com/nishio/status/1472071399485636608]: and I was told this after thinking this far. The latter link, "山紫水明∽事事無碍∽計算機自然" in "山紫水明∽事事無碍∽計算機自然" is a concept that corresponds to the pervasive connotation view that comes after the sense of vacuum and the director-free view, so it looks like my thinking is going in the right direction >[ochyai https://twitter.com/ochyai/status/ 1472062123270635523]

Summary.
　Regenerated in your own words.
　　[Hua Yan Summary]
　Using Kozaneba's network and original in-sentence keywords
　　[Summary of Kozaneba, Huayan Kozaneba].
