I thought about chit-chat at SIGGRAPH ASIA 2021.
Tweet after a conversation about whether or not to come to the physical office for lunch.

>[nishio https://twitter.com/nishio/status/1470803040500609024]: I agree with the argument that not gathering in a physical office reduces the probability of new buds that do not fit into the "current business framework", and I think it is a problem that needs to be solved. On the other hand, I don't think it's Toyota-esque to say, "So let's go back to meeting in the physical office.

>[nishio https://twitter.com/nishio/status/1470803930301202432]: "[Toyota-style]" here means a way of thinking such as "repeated improvement is good", "when you change something and a problem occurs, you should not easily choose to "undo" it", "if you change something and it gets worse, you should think of ways to further improve it, and undoing it is a thought stop". If you change something and it becomes worse, you should think of ways to improve it further.

>[nishio https://twitter.com/nishio/status/1470805054806687745]: By moving to a fully remote work environment, we are now closer to our ideal state, and even if it is "not ideal yet, or if it was better before on certain axes," I still feel that it is not a good idea to try to go back to the previous state because of that. I feel that it is still a bad idea to try to go back to the previous state, even if it is "not ideal yet" and "the previous state was better from a certain point of view".

>[nishio https://twitter.com/nishio/status/1470806010638245889]: On the other hand, this kind of activity has the effect of generating new seeds of thought, since it was a lunchtime chat that generated the seeds of this kind of thinking.

>[nishio https://twitter.com/nishio/status/1470808606539132928]: this should be a higher resolution observation. Just "having lunch and chatting" doesn't meet the requisite. I'm a full remote worker, and it sprouted because I chatted with someone who had recently been asked to come to work, and the same thing would not have happened if I had talked to someone from the same company. So the key factor is "unusual people."

>[nishio https://twitter.com/nishio/status/1470809690619924481]: So, if we take as a given the situation that "there are a relatively large number of full remote workers", then we need to think about "how to generate interaction with other departments"? I don't know if we need to think about "how to generate interaction with other departments".

>[kyasbal_1994 https://twitter.com/kyasbal_1994/status/1470812196720758784]: Curiously, we have also seen attempts to have people communicate with new people at random, but in many cases they just say hello and ask about each other, which may not be enough to be "unusual". In many cases, they simply say hello and ask about each other, which may not be enough to be "unusual".

>[nishio https://twitter.com/nishio/status/1470930485438476289]: So you need to match people with moderate relationships who are neither "the same person as usual" nor "nice to meet you"?
>If someone who just met me said, "I've been coming to work lately," even I would reply, "I see," or something like that.

-----

>[kohide_I https://twitter.com/kohide_I/status/1471629843561615361]: remote or office, what is the optimal hybrid ratio? I'm seeing more and more topics like,
>Before you do that.
>I think it would be better to do the obvious things first, like stop wasting time on useless meetings, don't send passwords by email, use chat rooms for text communication, and keep documents. These days I'm thinking

>[hrjn https://twitter.com/hrjn/status/1471641793913835520]: I came into work yesterday and was in a conference room for more than half the day and philosophized about the meaning of being in an office.
>[hrjn https://twitter.com/hrjn/status/1471642324505862145]: I felt like I wouldn't have the collaboration of being in an office or if I was stuck in a conference room.
>I think most things can probably be explained by the halo effect, paralinguistic communication.
>[hrjn https://twitter.com/hrjn/status/1471642941261479938]: this halo effect or paralinguistic communication is something that humans have spent x decades since birth to optimize, so the weirdness of not having this or There must surely be some inconvenience.
>I think this should be covered somehow.
>[hrjn https://twitter.com/hrjn/status/1471643809121734658]: I guess someone who can systematically examine these areas would be strong, but I'm not sure (spoon-fed
>[hrjn https://twitter.com/hrjn/status/1471644780094377988]: on the other hand, it is possible that engineering jobs and the like are worth being in the office because they are jobs that are created by consulting with each other about what is going on. This is something that goes against most intuitions, though.
>This corollary is also found in the Microsoft paper, which shows that adhoc telecans are increasing, especially in the engineering profession, due to the forced migration to Corona WFH.

>[nishio https://twitter.com/nishio/status/1471644004106510336]: It's true that being in a conference room all the time is the same as being in a video conference all the time >I don't have the collaboration of being in an office or being in a conference room all the time. I don't think it's the same as being in a conference room all the time.

>[nishio https://twitter.com/nishio/status/1471645482418319360]: It has to do with the idea that if you have a "festival" at the office, people there will be more likely to "talk to strangers" on the assumption that they are there for offline communication. It has something to do with what you said [nodal point of thought 2021-10-28#617a718faff09e00007dae33]: if you have a "festival" in the office, people will be more likely to act "talk to strangers" on the assumption that they are there for offline communication.
	>[nishio https://twitter.com/nishio/status/1471645806478643200]: if you come to an office and other people are busy working or meeting in a conference room all the time, random conversations won't happen there!

>[nishio https://twitter.com/nishio/status/1471646363322839041]: The need to have festivals instead of videoconferences is related to yesterday's lecture [Computer Graphics, Media Art, Tea Culture, and Zen...]. This is related to yesterday's lecture [computer graphics, media art, tea culture, and Zen] that "[festivity] is important in restoring [conviviality]".
>This "[festival]" is a broader concept, it doesn't mean let's have a lot of parties.

>[nishio https://twitter.com/nishio/status/1471647243719823361]: what kind of "festivity" must be fulfilled in order for "festivals" to contribute to regaining conviviality?
>The case of "a festival suddenly occurring on a social networking site where communication is very restricted" that Dr. Goto taught me before, I think this is a very good case.
>[Naturally occurring festivals].

>[nishio https://twitter.com/nishio/status/1471648314898923523]: ah, well, "X must become a "[tool for conviviality]"
>This X is where social networking sites, "metaverse", groupware, and offices in virtual space are assigned to.

>[nishio https://twitter.com/nishio/status/1471651599693004805]: "[drinking communication]", in short, [drinking together] drinking parties used to be a typical festival. On the other hand, with today's sense of the word, "Okay, we're going to have a drinking party to communicate with our employees!" is a typical bad old man's idea. What is the change here?
	[drinking together = symposium].

>[nishio https://twitter.com/nishio/status/1471652461131997184]: In other words, "festivity" is not a property that belongs to the event itself, separate from the individual participants, but appears as a collection of the subjectivity of each participant. The composition is similar to [psychological safety], psychological safety is "everyone is not afraid" and the requirement for festivity is "everyone is having fun."
	[Conviviality]

>[nishio https://twitter.com/nishio/status/1471655154651111425]: Is it important that the participants are participating by [voluntary] intention? In the sense that forced participation in a drinking party is not fun.
>Is it important that participants recognize the event as a rare event? Is a festival an extraordinary event and not a festival if you do it every day?
>Neither seems to be a requirement.
	[Hale = extraordinary]

>[nishio https://twitter.com/nishio/status/1471655583736823809]: I feel that a necessary condition is that the participants feel that their participation is worthwhile. The two factors mentioned earlier contribute positively to this "feeling of value".
>However, since this "feeling of value" is subjective, it does not necessarily work if it comes down to "I'll hold this kind of festival event and you can enjoy it".

>[nishio https://twitter.com/nishio/status/1471656294188986368]: Another factor that may contribute positively is "I can add my own touch". If something is made by others and tailored to you, it may not match your personal values. If you can modify it yourself, you can modify it to the form you prefer.

>[nishio https://twitter.com/nishio/status/1471656732548276224]: on the other hand, this behavior itself wouldn't occur if I didn't feel the event was worth it.
>"modify it to fit your values", after all, there was less entertainment in the past, so the majority thought "drinking alcohol" was "fun" (or there was more peer pressure, so the side that didn't enjoy it had to put up with more of it).

>[nishio https://twitter.com/nishio/status/1471657774325301249]: I was talking to a guy at a trade show from a company that offers a metaverse solution, and I feel it is essential that "participants be able to modify the place I think it's essential for the participants to be able to modify the space. Because it is not "[their place]" if they can't tweak it themselves and are given something that someone else has created.

>[nishio https://twitter.com/nishio/status/1471658366233903104]: is it necessary for an event to be "our event" to be customizable on similar principles?
>I think this requirement is too strong.
>Even if the physical office can be modified at will, few people modify public spaces. Most people are given a space at their disposal and are happy to modify it.

>[nishio https://twitter.com/nishio/status/1471658984541405184]: Events, by their very nature, are "not just for you, but affect others", so the psychological hurdle for modification is high. Oh, for example, in this case, by saying "you are free to choose how you move around the venue", you are creating a part of the event that can be customized according to your own values.
 >[nishio https://twitter.com/nishio/status/1471660191473364992]: "This case" = "Unexplored Junior Creator to SIGGRAPH ASIA"
 >The management decides what to see and what to move on to next, leaving it up to the self-determination of each individual participant, rather than descending from heaven. This allows participants to customize the event according to their own values and experience it as their own rather than a descent event.

>[nishio https://twitter.com/nishio/status/1471664611145711617]: back to the topic, what does it take for groupware (and future metaverse as groupware) to be a tool for conviviality?
 >[nishio https://twitter.com/nishio/status/1471665868119904256]: First of all, the basic premise is that Metaverse is of course groupware, unless it's a "lone world", in which case it is designed to be used by multiple people (=group). It is software that is supposed to be used by multiple people (=group), unless it is a "one-man world.

>[nishio https://twitter.com/nishio/status/1471680978020335619]: I'm waiting in line for a parallel ping-pong experience, and the physical space cannot be filled immediately when demand arises due to limited resources. The "waiting time" is "wasted" time for the purpose, but people don't like to waste their time, so matching people in this state (continued)
 >[nishio https://twitter.com/nishio/status/1471681618717048835]: "Mutually contented events" called "[chats]" are "spontaneously", "according to one's own values", "incidentally", "created" among these people. The matching for chit-chat is then used as the basis for the event. The reason why matching for chatting is not good when it is done for its own sake is because it is not a state of "wasted time," "waiting time," or "[boredom]".
 　The value of "relieving boredom" for chatting is based on the premise that you need to be in a state of boredom, and without meeting that necessary condition, matching "chatting is good, so let's do it" will not work well.
 　[Chat is for mutual consumption].

>[nishio https://twitter.com/nishio/status/1471682533914202113]: The reason why tobacco rooms become a place of communication among smokers is because they are bored while smoking. On the other hand, in the present age, there is a large and inexpensive supply of "ways to pass the time alone without using others". So we can kill our spare time without resorting to the reciprocal exchange of "becoming content with each other".

>[nishio https://twitter.com/nishio/status/1471683139907223552]: In other words, "participants' sense of the value of the event" generated the behavior of "[becoming] content with each other" in the past when the supply of entertainment content was scarce. occurred, but when the supply became excessive, it ceased to be the driving force behind the occurrence

>[nishio https://twitter.com/nishio/status/1471683702438903809]: [courtesy 2.0]: "taking each other's time" is anathema when the value axis of "it is good not to take the other's time" occurs in a related story to [courtesy 2.0]. "taking each other's time" is avoided

>[nishio https://twitter.com/nishio/status/1471684527198445570]: The direction of moving the videoconferencing system closer to the physical office is nonsensical because it goes from "a state where the physical office was creating waste due to depletion of physical resources" The reason why this direction is bad is because it is trying to "introduce waste" after the physical office has become "waste-free" from "a state in which the physical office was generating waste due to the depletion of physical resources". People who are used to videoconferencing will stop using it, saying, "This system is inefficient.

>[nishio https://twitter.com/nishio/status/1471685329849810946]: Human beings want to avoid leisure time, and [mutual contentment] occurs because they want to eliminate "[leisure time]" that is inevitably imposed by the constraints of physics. Therefore, to revert back to the previous state after a system that does not generate "spare time" has been created is like trying to climb a river against the flow of water flowing into the lower part of the river.

>[nishio https://twitter.com/nishio/status/1471693490975571969]: To return to the topic at hand, in an age when there is a large amount of inexpensive content to pass the time, it is impossible for "chatting to pass the time" to be actively favored, so we need to replace it not with a system that encourages chatting, but with something more efficient in terms of the information transmission function that chatting once had. Therefore, it is necessary to replace the information transmission function of chatting with something more efficient, rather than a system that encourages chatting.

>[nishio https://twitter.com/nishio/status/1471702406488805377]: This is interesting because it applies to the context we were just talking about: instead of being "bored" by walking around the city alone, by playing the images you see in VR space, you are matched with people who are "bored in the already created past model of VR space, and want to see what it looks like now. By playing the visible images in the VR space, it matches with people who are "bored in the already created model of the past in the VR space, and want to see what it looks like now", and mutually content each other to relieve the boredom.
>#SIGGRAPHAsia2021
>[https://gyazo.com/ae73df40dc30771dbffe0a2cce0512c4][https://gyazo.com/04eb2f41f7a2323986f41a85bf5de095]
　People on the side of walking in the real world can hear voices from the VR space and can see objects placed on the side of the VR space by AR glasses.

>[nishio https://twitter.com/nishio/status/1471703360370012161]: I wonder if time-binding chats will be replaced by asynchronous communication on Scrapbox or groupware
>Synchronous chatting cannot be established unless there are people free at the same time, so it is difficult to establish a synchronous chat unless there are people free in close physical proximity due to physical constraints, so it must be an asynchronous chat.
	>[shokai https://twitter.com/shokai/status/1471723903848693765]: doing this kind of thing, I'm not chatting or doing almost anything else except this!
 > [https://blog.notainc.com/entry/2021/12/16/090000 About the "Engineer Tea Party" initiative - Nota Developers' Blog]

>[nishio https://twitter.com/nishio/status/1471704838543388672]: I guess we live in an age where one person can operate two bodies, two people can operate one body, and the implicit assumption of one body per person is breaking down.
>I wonder if two people who share a body will chit chat.
	context
		[https://sa2021.siggraph.org/jp/attend/emerging-technologies/18/sessions Emerging Technologies - SIGGRAPH Asia 2021]
			Two bodies in one
				>multiple bodies (here 2 robots arms) controlled by a single user
				[https://gyazo.com/46d5360dbfaadb81100e87de3cad2670]
				https://sa2021.siggraph.org/jp/attend/emerging-technologies/18/session_slot/626
			Two people, one body.
 			>mixes two people into one robot arm
 			[https://gyazo.com/aef56682ee8cf4c9410466b4910da0b1]
				https://sa2021.siggraph.org/jp/attend/emerging-technologies/18/session_slot/633

>[nishio https://twitter.com/nishio/status/1471709648504107015]: the ongoing phenomenon of "write about what interests you, read about it, think about it further and write about it", creating your own content and You're in a state of self-consumption, what's there to do in your spare time?

>[nishio https://twitter.com/nishio/status/1471710499461296129]: Maybe I hate being "bored" so much that I've experienced so much boredom in my life that I've taken defensive measures against it. I guess I'm in this state of mind.
>As a thought experiment, if my internet connection were taken away at this very moment, I would write in a local notebook, and if my phone were turned off, I would read a book.

>[nishio https://twitter.com/nishio/status/1471710894396960770]: when I was younger I used to carry around a bunch of paper books, but that has been absorbed by my iPad. People sometimes ask me if I'm not heavy for having the biggest iPad, but compared to paper books, almost anything is lighter.

>[nishio https://twitter.com/nishio/status/1471712633804177415]: In that sense, if I click on a particular page on my phone and it takes more than a second to load, I can't wait and switch to another window, I'd like to see a window waiting to load put aside in the AR space, so that I can tell if it's finished loading or not just by looking at it without switching apps.

from [SIGGRAPHASIA2021]
OLD TITLE: Thoughts on SIGGRAPH ASIA 2021
