death
from [Butterfly Dreams].
I've washed through the occurrences of "monika" in Zhuangzi, and there are not many places where "monika" is used as a nominal symbol.

The Japanese translation is taken from [Kodansha Scholarly Library: Zhuangzi Complete Modern Translation


https://ja.wikisource.org/wiki/荘子/齊物論
>The butterfly and the chou are necessarily separate. This is called materialization.
	>There is surely a difference between the two. This is what is meant by materialization (the transmigration of one thing into another).

https://ja.wikisource.org/wiki/荘子/天地
>Xu Yue says: "I am a man! He is a man of wisdom and intellect, and he is sensitive because of his nature, and because he is a man. He is forbidden to do so, and he does not know why he does it. And the heaven is his?  What is the husband's position in the world? Notwithstanding, there are families, ancestors, and fathers, but not all of them are fathers. The north side is the disaster, the south side is the bandit.
	>I am sure that you will be drawn by external things, change, and abandon your constant and unchanging self.

https://ja.wikisource.org/wiki/荘子/天道
>The old saying goes: "Knowing that you are a heavenly musician, your life is a heavenly activity, and your death is a materialization.
	>He says, "He who knows the enjoyment of the heavens is one with the operation of the heavens as long as he lives in this world. He who knows the enjoyment of the heavens, as long as he lives in this world, he is one with the operation of the heavens, and when he dies and passes away from this world, he is one with the transmigration of all things.

https://ja.wikisource.org/wiki/荘子/刻意
>The saint's life is an act of heaven, and his death is a materialization.
　Same as above

https://ja.wikisource.org/wiki/荘子/達生
>The work is not a rectangle, but a finger and a thing, and therefore the mind is not funny, and therefore the spirit is not one.
	>The craftsman of the olden times, the master craftsman of the older days, is as if he had found a compass or a metal plug when he wielded his skill in making something. His fingertips are in perfect unison with the wood and gold, and his mind is free of any measuring devices.

https://ja.wikisource.org/wiki/荘子/知北遊
>The old people were not inside the body, and the new people are not outside the body. The person who becomes a thing is one who does not become a thing. Anka anka anka anka anka anka anka, anka anka anka anka, anka anka anka, anka anka, anka.
	>People of the past were flexible and changeable on the outside, while they remained firm in their inner self and did not change. The opposite is true of today's people. Their inner selves are constantly changing as they are drawn to things, while their outer selves are always trying to maintain their appearance. One who changes flexibly in response to the things of the outside world is, in fact, a person who does not change his inner self at all. He is calm when he changes, calm when he does not change, calmly adapting to things, and yet never losing sight of himself.

https://ja.wikisource.org/wiki/荘子/則陽
>The world and things never end, never begin, never end, never begin, never begin, never end, never begin, never begin, never begin. The day and the thing are converted, but they are not converted at all!
	>The ancient sage King Jue Sang-soo took his place at the center of the causal cycle of the phenomenal world and let everything happen and change as it happened. He went through the cycle of cause and effect together with all things, and there was no end, no beginning, no moment, and no time. Thus, he who changes with things day by day is in fact a being whose inner self does not change in the slightest. Let us try something and put ourselves in this situation.

[Zhuangzi]
