Kozaneba training
from [Kozaneba: The Formation of Chinese Hua Yan through the Fusion of the Hua Yan Sutra and the Zhuangzi].
>[nishio https://twitter.com/nishio/status/1472076008216236032]: now that we know we are going in the right direction, let's continue our Kozaneba training!

>[nishio https://twitter.com/nishio/status/1472085955368878081]: I half-jokingly called it "Kozaneba training", but let's go walking while thinking about whether this is [training] or not, get some daylight! I'm going to get some sun.

>[nishio https://twitter.com/nishio/status/1472087848006582273]: the word "shugyo" came about under the influence of the term "actual practice" of Zen meditation as a process leading to enlightenment, but it's not samatha or vipassana. It's more like sweeping the precincts of a temple or something. But whereas sweeping the precincts is a repetition of the same thing day after day, [Kozaneba] is always about "what is not yet understood or put into words," so the same thing is never repeated. Understanding here is Eugene Gendlin's [COMPREHENSION], so it is closely related to putting it into words
	[Vipassana Meditation]

>[nishio https://twitter.com/nishio/status/1472089533990961154]: In order to obtain something that has not yet been put into words, I first accept the symbols as they are, without distorting them with my interpretation, and continue to manipulate them, I feel that I am doing something different from my daily life in this process. I wonder if it is similar to "Shomikaze".

>[nishio https://twitter.com/nishio/status/1472090876940005381]: hmmm, I think it's more of a scientist mindset than a purpose to improve oneself through practice. I want to know how the phenomenon of understanding is happening. So I bring a document that I can't understand by reading it diagonally, and observe the process of my understanding it.

>[nishio https://twitter.com/nishio/status/1472091582384209920]: it is preferable to be externalized to observe. The reason is that human temporary memory is easily broken, so if you do a "let's take a walk and think about something else" like I'm doing right now while reading a difficult text, it will be broken. Putting the thought process outside the brain allows it to resume without breaking when interrupted.

>[nishio https://twitter.com/nishio/status/1472092311375204358]: I started using this [externalization of thoughts] when I met the KJ method 7 years ago? I started using this [externalization of thoughts] after I came across the KJ method 7 years ago, so I read it as "KJ method", but it seems to be different from the way the world uses the term "KJ method". It is more like the Kozane method, but that is not appropriate either.
	10 years ago: [tried the KJ method].

>[nishio https://twitter.com/nishio/status/1472092756877389828]: I have made grouping -> Regroup -> Kozaneba by dealing with the inconvenience of the experience I have had with paper by digitizing it. So the closest word to describe this process is "using Kozaneba". I guess the abbreviation is "Kozaneba training".

>[nishio https://twitter.com/nishio/status/1472095542495031296]: The reason why I don't feel comfortable with the word "asceticism" is because I don't share the idea that the purpose of asceticism in Buddhism and other religions is "to free oneself from negative feelings about the non-permanence of one's biological existence by merging with a permanent being. I want to be free from such negative feelings by merging with a permanent existence.

>[nishio https://twitter.com/nishio/status/1472097729765847041]: I perceive the physical [protein body] as a rather "old computer" and do not have the feeling that it is my own. The collection of information on the Internet is rather closer to the feeling that it is my body. For example, taking a bath to clean your body is like vacuuming the filter of an air purifier: you don't want to do it, but if you don't do it, you do it because the performance will deteriorate.
	[Humans are fragile parts that only operate for a mere 100 years or so.]
	[flesh is cache].

>[nishio https://twitter.com/nishio/status/1472099859746664448]: there is a place on the internet where I have a compilation of my writing, but it is not a body, merely a tool that facilitates access There is a feeling that it is not a body. Just recently I saw some of my slides cut out and circulated under no name, and strangely I didn't feel angry or "taken".

>[nishio https://twitter.com/nishio/status/1472101718435721216]: the feeling that "it is a natural physical law in this world that such things happen".
>Good things are copied and often distorted in the copying process.
>In that sense, it's interesting that you don't feel like your stuff is being taken away from you, but rather that it's a waste of information.

>[nishio https://twitter.com/nishio/status/1472102728923226114]: Let's say you have a tree that produces delicious fruit. You take the fruit and bring it with you, but after you eat it, that's it.
>It is more valuable to know where the tree is located, and even better to take a branch and plant it in your own garden to grow it if possible.

>[nishio https://twitter.com/nishio/status/1472104027538489344]: But even if the source has been cut or distorted, the search engines know all about it, so they can look it up. But even if the sources are abridged and distorted, the search engines know everything, so they can look it up.

>[nishio https://twitter.com/nishio/status/1472104492137316352]: In Zen, there is a saying, "If you sit for an inch (3 centimeters, the time it takes for a candle to burn 3 centimeters), you will become a Buddha for an inch. I guess it's true.
	[A moment of sitting is worth a moment of Buddha's time]

>[nishio https://twitter.com/nishio/status/1472106170215444483]: I was walking around tweeting on my phone and my hands got cold, my protein body is totally clunky and not good, I can't wait to get a brain implant so I can just think! I want to be able to do internet just by thinking.

summary
>[nishio https://twitter.com/nishio/status/1472125064741289985]: The "totality of information" on the Internet is a [permanent transcendent] different from [mortals] = humans in [garments of flesh]. anonymous meme] and become a "[boundary invisible part]" of the Permanent Transcendent, thereby leaving the world of life and death and attaining [nirvana] (the state of enlightenment).
