Kozaneba: The Formation of Chinese Hua Yan through the Fusion of the Hua Yan Sutra and Zhuangzi
from [The Formation of Chinese Hua Yan through the Fusion of the Hua Yan Sutra and Zhuangzi].
Kozaneba: The Formation of Chinese Hua Yan through the Fusion of the Hua Yan Sutra and Zhuangzi
[https://gyazo.com/ddc91e6448121794e81d5d84d9a73575]

Long, one-word phrases are repeated.
　Example: "Eternal, Infinite, and Absolute Reality."

Extremely helpful and clearly written.
　This "easy to understand" is the problem.
　　For example, "eternal, infinite, and absolute reality" is used over and over again without abbreviation or indication.

>[nishio https://twitter.com/nishio/status/1472065599740473348]: we, when a thing "is", implicitly assume that it "will continue to be", but that is just a "mental model of how the world works" that we learned while growing up in the old physical nature. It is just a "mental model" learned while growing up in the old physical nature. The assumption that things "continue to be" does not hold true in a "state where all five senses are digitally covered", which is an extension of covering our vision with HMDs.
	>[nishio https://twitter.com/nishio/status/1472066708378910721]: The laws of the "old physical world" including "what is" is "always" need not be true in the "new digital world," and it is natural to assume that the worldview of people of the future living in that world will naturally differ from the worldview of people of today. It is natural to assume that the worldview of people of the future, who live in such a world, will naturally differ from the worldview of people of today. For example, objects do not have fixed entities, but only appear as needed.
	>[nishio https://twitter.com/nishio/status/1472068165199069186]: In modern terms, "3D models in VR space are downloaded and placed as needed from asset stores containing vast amounts of data. In the words of a futurist who was born and raised in a digital world, "an individual object is a manifestation of the Absolute, segmented in various ways, and has no fixed substance".
	>[nishio https://twitter.com/nishio/status/1472069730295238662]: This "worldview that is commonplace for people of the future" is actually, surprisingly, almost equal to the "vacuum view = all individuals have no fixed substance" and the "director-less view = the reason of eternal, infinite, and absolute existence becomes self-segmented and manifests itself in various individuals" in the Kegon sect. The "view of the vacuum" in Kegon Buddhism is actually almost the same as the "view of the infinite, eternal, and absolute truth that is self-segmented and manifests itself in a wide variety of individual objects. This is why the worldview of Hua Yan is the worldview of computer-based nature.
	>[nishio https://twitter.com/nishio/status/1472071399485636608]: and I was told this after thinking this far. The latter link, "山紫水明∽事事無碍∽計算機自然" in "山紫水明∽事事無碍∽計算機自然" is a concept that corresponds to the pervasive implication view that comes after the sense of vacuum and the director-free view, so it looks like my thinking is going in the right direction!
		[https://www.asahi.com/and/article/20191204/7900625/ Pondering a future where the boundary between nature and computing melts A new permanent exhibition under the general supervision of Yoichi Ochiai opens at the National Museum of Emerging Science and Innovation (Miraikan) | Asahi Shimbun Digital Magazine & and]
		[https://bijutsutecho.com/magazine/news/exhibition/13512 Yoichi Ochiai's recent and new works are all here! ∽mountain, purple, clear, ∽everything is indispensable ∽computing machine nature" exhibition will be held｜Bijutsu Techo]

>[nishio https://twitter.com/nishio/status/1472076008216236032]: now that we know we are going in the right direction, let's continue [Kozaneba training]!
	[https://gyazo.com/1d48ad63f05c7b301a7a914b720d5f51]

bug fix
	before
		[https://gyazo.com/1f5cc0c1c1cf04aa3e7cfeb5d555dc65]
	after
		[https://gyazo.com/f3de7b665e564b2e141318085d9c89a2]

I see, so the next step is that you need to bring it into the phenomenal world, and that is the change from the Kegon sutra to Kegon Buddhism.

>"Eternal, Infinite, and Absolute Reality" is used over and over again without abbreviation or indication.
　There are many other dangerous phrases.
	"Infinite creative energy/life."
	"a hypertemporal, infinite, absolute dimension."
	Meditation (zen meditation) practice."

[Jugenmon]
[distorting the parallel to make it one-dimensional].

[https://gyazo.com/8629e43bd2cfa4e02c7fd1a2c2e674ce]
http://repo.komazawa-u.ac.jp/opac/repository/all/18394/KJ00005090537.pdf

If you take something written in a language that cannot be written without making it one-dimensional and then take away the [repetition for one-dimensionality], you get a little closer to [the language of heptopods].
Not all time frames will be the same, but...
[https://gyazo.com/410483964aeb1db00e00865bfc9f0aac]
It folds up like this.
Example
	[https://gyazo.com/b67589a27283df2598c2da2a3551f52c]
		Original text:.
	 	>The everyday self opposes the world as object to the self as subject because of discriminative knowledge. The world and the self are dualistically opposed.
	[https://gyazo.com/c80e4288b60aa8738456799d1dbe5cad]
　　There were two paragraphs to the right of this one.
　　　Turns out it is associated with the left-most block.
　　　I folded it because
　　before
　　[https://gyazo.com/d3670acb7b504dc597605d9b370416fe]
		after
			[https://gyazo.com/beac5c9a5ede6cedd696c97e6409d958]
	　big picture
　[https://gyazo.com/5eee75b0c3671df8d0c9b0f7df549ff2]

[Sapir-Whorf hypothesis]

Test to try to explain in your own words
　[Hua Yan Summary]

[Kozaneba is a bamboo scaffold].
When I wrote [Summary of Hua Yan], I lost interest in completing [Kozaneba: The Formation of Chinese Hua Yan through the Fusion of the Hua Yan Sutra and the Zhuangzi].
　There is no such thing as "[completion]" to begin with.

Why is there resistance to abandoning the scaffold?
　That's because there's still more information than I wrote in the "summary".
　We just have to get it out of them.
　(Ideally, of course, you can save it even if you don't get it out all the way in the future, and then take it out again later when you need it.)

The [Hua Yan summary] is "a summary in my own words for verification of understanding.
　As a result, the link between your words and the original keywords is lost
　Need a summary utilizing original keywords.
	[Summary of Kozaneba, Huayan Kozaneba].

When I put it all together so far, it makes sense.

full Kozaneba
https://kozaneba.netlify.app/#view=AJdEX3iBhaIKT67arqYR
