Kegon Summary
>[nishio https://twitter.com/nishio/status/1472422079593336847]: I think I understand the concept of "[huayan]", so I will try to explain it to verify my understanding.
>First of all, this "Hua Yan" does not refer only to "[the Hua Yan Sutra]" but to the Hua Yan philosophy, which was developed from the Hua Yan Sutra born in India and entered China.

>[nishio https://twitter.com/nishio/status/1472422454174044163]: The difference is that the Kegon Sutra described a process in the world W1 that is different from the material world W0, whereas the Kegon philosophy considered the process of going from W0 to W1, gaining awareness there, and then returning further to W W0 and then return to W0.

>[nishio https://twitter.com/nishio/status/1472424144755392513]: With respect to this material world W0, things are either "there" or "not there". What "is" continues to be for a while, then breaks down and becomes "not," and when it is gone, it remains "not" forever. This is the view of the world that we, who were born and raised in the material world, have unconsciously, naive physics.
>On the other hand, the Kegon Sutra doubted it.

>[nishio https://twitter.com/nishio/status/1472425817242497027]: Both the Indian-derived Hua Yan Sutra and the ancient Chinese [Zhuangzi] had in common the idea that there is not a dichotomy between being and not being. From this comes the thought about what is beyond the opposition of "is" and "is not.

>[nishio https://twitter.com/nishio/status/1472426876237131782]: In addition, this "something beyond the opposition of being and not being" is not "what happens if we assume such a thing" but "I saw such a thing when I meditated, and I became such a person. I saw such a thing when I was meditating and I became it", not "what happens if I assume such a thing".

>[nishio https://twitter.com/nishio/status/1472427528472379396]: I've been using easy words to describe "there is" and "there is not", but then when I say "there is something beyond the conflict between "there is" and "there is not"", the second "there is I should split "is" a little higher in resolution because the "is" is confusing because of the "is not". There is "[immaterial existence]" that transcends the opposition between "[material existence]" and "[material non-existence]."

>[nishio https://twitter.com/nishio/status/1472428435448680449]: We moderns may be disappointed with this "immaterial existence" because we are overwhelmingly [people of the future] compared to them, but that is because in their time there were not even black-and-white projectors, let alone VR goggles. In their time, there were not even black-and-white projectors, let alone VR goggles (a fairly new invention around 1900).

>[nishio https://twitter.com/nishio/status/1472430940857434112]: To go back a bit and talk a bit more about the physical laws of the material world, a "material being" cannot have more than one thing in the same place because it occupies space. There can only be one material being, so if more than one person wants it, they will fight over it. This is the naive worldview of those born and raised in the material world.

>[nishio https://twitter.com/nishio/status/1472432439297716225]: How did you feel "immaterial existence" in the age without VR goggles, first of all, you probably "saw a very realistic image created by your brain". When you think about it, it makes sense to do "posture, breath, don't think, and ignore all stimuli from the outside world" as a means to see it. You are creating an immersive environment.
	The basics of [zen] = [zen body, zen breath, zen mind

>[nishio https://twitter.com/nishio/status/1472435714302562307]: So, people who repeatedly "do a full dive into the VR space created by their own brains" in the days when there was no TV, realize that "this thing that appears and disappears and exists in the same position They realize, "This thing that appears and disappears in the same position, looks a lot like a material existence, but it is something else. Then they think, "Then what is this?" Then they think, "Then what is this?

>[nishio https://twitter.com/nishio/status/1472437209081200641]: After thinking about it, "There exists a Something "reason" that transcends the conflict between material existence and non-existence, and a part of it is manifested in this way. And then I realize, "I am a part of it." I realize that I am a part of it.
>This is where monotheism differs greatly from the idea of monotheism. In monotheism, the transcendent personality "God" who creates the world makes human beings, so God and human beings are separate, but in monotheism
	>[nishio https://twitter.com/nishio/status/1472437636170391553]: In the Buddhist view, a transcendent being without personality branches off and appears as all things, including oneself, so naturally one considers oneself to be part of the transcendent being.

>[nishio https://twitter.com/nishio/status/1472439298503081989]: So, those who are convinced by experience that everything and everyone, including themselves, is just a temporary manifestation of a split "reason", what next? What will they think about next?
>I believe that everything is fundamentally connected as one, and that I am included in this "everything".
	>[nishio https://twitter.com/nishio/status/1472441338369277955]: Then, just as you see a butterfly and have an image in your mind that "there is a butterfly", the butterfly sees a human and "there is a human". Just as I have a butterfly in the VR space in my mind, I am in the VR space in the butterfly.
	>When we focus on one thing, that thing has other things in it. And every thing can be its subject.

>[nishio https://twitter.com/nishio/status/1472442016969953280]: Here's the connection to "[butterfly dream]". I had a very realistic VR immersive experience in a dream, and I was experiencing the world from a butterfly's first-person perspective and felt like I was a butterfly completely, but when I woke up from the dream, I was a human. Was the human dreaming about a butterfly, or was the butterfly dreaming about a butterfly that was so real that it felt like it was a human? This is a story about
 >[nishio https://twitter.com/nishio/status/1472442545796169730]: So, this is indistinguishable, and there is no need to distinguish between humans and butterflies, since they are both just temporary manifestations of a split "reason" in the first place.

>[nishio https://twitter.com/nishio/status/1472443465875488771]: So, after thinking this far, you come back to the material world, and you see two people A and B fighting over the ownership of one thing. You see that and think, "Ah, A and B are both rooted in the same being, but they fight because they don't understand that, and I wish everyone would take a full VR dive.
	>[nishio https://twitter.com/nishio/status/1472443862660837378]: then there are people who say things like "I'm afraid of dying". I look at them and say, "You think of yourself as something that exists materially, so you find special meaning in the end of that existence, even though it is only a temporary manifestation of reason. Wouldn't you be less afraid if you had the experience of becoming one with reason?" So I think.
　Related: [matter unhindered].

>[nishio https://twitter.com/nishio/status/1472446015966167046]: And so far, the idea was "let's all be zen" since VR was not yet available, but when full-dive VR becomes possible with the advancement of technology, anyone can easily generate, annihilate, duplicate, superimpose, and become someone else's viewpoint. However, if full-dive VR becomes possible with the advancement of technology, anyone can easily generate, annihilate, duplicate, and place things on top of each other, and become someone else's point of view.
 >[nishio https://twitter.com/nishio/status/1472446817044660225]: the lower the cost, the more people will take that path, so the more people will reach enlightenment in the Huayan sense. Since they reach it without explicitly allocating costs to the practice of enlightenment, they become "enlightened" when they realize it. When the digital natives are enlightened, it will look ridiculous for the unenlightened old man to cling to material existence!

>[nishio https://twitter.com/nishio/status/1472449602016395264]: 
> >[nishio https://twitter.com/nishio/status/1472242305088499717]: the 3D printer talk can be confusing if you're not careful. The boundary between the "world of reason" and the "world of things" doesn't match the boundary between "old nature" and "computational nature," but people are so quick to jump to simple dichotomies.
> An addendum on this: it is not that the VR space is a "world of reason". The old physical world and the virtual world on a computer are both "worlds of things" that humans perceive with their senses, but the natural laws of these worlds are different, so it is easier to imagine the "world of reason" when experiencing the virtual world.
	>[nishio https://twitter.com/nishio/status/1472450248220225537]: that when using a 3D printer, the two arrows "reason -> thing" and "digital existence -> physical existence" are occurring at the same time, which may easily confuse the reader. thing.