crude
[https://gyazo.com/f510ecbf66f38569452624a6f05525f2]
	[Amazon https://amzn.to/32CDR5d]

A turn-based game where the first to guess the combination of three face-down cards wins.
　Six suspects, six different murder weapons, and one piece from each of nine different crime locations are listed below.
　The six players are shuffled and dealt the remaining cards, three at a time.

Only at the crime scene, you have to actually get to the crime scene by moving the frame with the roll of the dice to deduce the crime scene.
　If you make a final guess and guess it, you win, and the final guess also specifies the squares where you can do that.
　Can call others to the murder scene where you are.

first play
　I played it twice, and both times the winners arrived at the same guess at the time they made their final guess, so to some extent, if the players are good at solving puzzles, the winner will be determined by the dice roll of the last move.
　　Especially in the second one, I was far away when I found out, so my action towards the final guess was exposed, and I was intercepted using a callout, while the other player won!
　I checked the answers after the second one, and surprisingly, there were some minor errors.

The first step in the game is to listen to the problem conditions and think about what to note down.
	[https://gyazo.com/d23ca7014cc38ef62c7248fe0b1f1552]
　1: "I don't have" information shows that a particular person has none of the three cards.
　2: The "I have this" information in my guess shows that a particular person has that card.
　　Not sure if they have any other cards.
　　You can see that others don't have that card.
　3: The "I have" information in others' guesses shows that you have at least one of the three cards.
　　I'm alphabetizing this one.
　　[https://gyazo.com/92f0823f22f1aa724479759931c58c91]

　　By recording this, if subsequent guesses reduce the number of options to one, it will be confirmed and the mark of 2 will occur.
　　　This sometimes sets off a chain of events.
　In addition to this I kept a chronological log of "who guessed how and who answered".
　　But, in principle, it should be possible to recover from this log in the event of an inconsistency during the game, but there is not enough time to do so.
　　Also, I should have recorded information about what I showed him.
　　　When I got two hits on my opponent's guess, I didn't know which one was the one I had shown him.

[board game].
