The next step is to get rid of the "hazy" feeling.
from [野中郁次郎×青野慶久]
	[Ikujiro Nonaka, Professor Emeritus, Hitotsubashi University, and Yoshihisa Aono, Cybozu-style https://cybozushiki.cybozu.co.jp/?p=1422]

>I interpret "[tacit knowledge]" as a kind of hazy idea or feeling inside of me, but if I try to express it in words instead of keeping it to myself, there may be people who can "sympathize" with me. I interpret this to mean that if you repeat this, you may generate wisdom that you could not have conceived on your own.
> And actually, I think this repetition is the very seed of communication and [innovation] within the company....
>That interpretation is fine. As you said, tacit knowledge is hazy. The key is to put it into words and express it, so as to dissolve that haze... It is very important to "co-create" by putting your feelings (tacit knowledge) into words (formal knowledge) to stimulate the feelings (tacit knowledge) of others and to sympathize, resonate, and resonate with them. We have some feelings, and while sharing tacit knowledge with people, or drawing out tacit knowledge from others, we create new knowledge.
	[SECI model] [Moyamoya].

>(Aono)I once posted a review of our strategy on a bulletin board that all employees could see. In my mind, I wrote, "I decided to do this, and as a result, this is what I did." I explained it logically, with the intention of saying, "You all understand, don't you? Then one employee asked me, "What do you think about that, Mr. Aono?" I was asked, "What do you think about that, Mr. Aono? Then I thought, "Maybe I didn't use enough words to express my sympathy," and I honestly wrote, "I'm frustrated. I want to win. I'm frustrated. Then everyone said, "I understand. Words like "I regret" and "I want to win" didn't mean much to me. I thought they were [subjective] things that I thought on my own. However, that was the word that everyone was looking for. By uttering it, people started to give me ideas. At this time, I realized that "logic alone cannot turn the cycle," that some words were needed to inspire everyone's feelings, and that unless I uttered those words (my tacit knowledge), the next collaboration would not be born. When I experienced this, I felt that I was able to experience a little of the theory that Dr. Nonaka was talking about. I thought, "Oh, this is it. Innovation will never happen by logic alone. I thought that we can create something new by taking our feelings (tacit knowledge) and putting them into words (formal knowledge), having people share and "empathize" with each other, and from there, through dialogue, bouncing our words off each other.
>That is exactly right. We cannot talk about our [experiences] all the time, but we can compensate for each other's shortcomings by talking to each other. The key to creating knowledge is to read the different relationships, which I call Context... The [SECI spiral] is about sharing context... It is very important to see the world from a relational perspective... In order to see the world from a relational perspective, it is necessary to constantly turn "tacit knowledge," which is difficult to express in such language and text, and "formal knowledge," which is somehow expressed in words, into a spiral.
	[Subjective.]
	[RELEVANCE]

Putting [subjective] mumbo-jumbo into words is important for multi-person organizations to create knowledge as an organization.
Hopefully [Keichobot] can help with this.
