conviviality
[Conviviality.] In Japanese, it is translated as [independent conviviality], [conviviality], [conviviality], [conviviality], [conviviality], or [conviviality]. [Ivan Ilyich] applied the word to express what he wanted to say, knowing that it has a different meaning from the common meaning of English words (banquet mood).
[https://gyazo.com/ec296776c973ca02673c14e4fd1ab070]

It would be easier to explain the "tools for conviviality" for physical objects first and then abstract them.
This is succinctly summarized in "Tools for Conviviality," p. 39.
	>People do not just need to have things. Above all, they need the freedom to create the things that make their lives possible, to give them shape according to their own taste, and to use them to care for and tend to others. Prisoners in rich countries often have more goods and services available to them than their families, but they have no say in how the goods are made, nor do they decide what to do with them. Their punishment is that they are deprived of my so-called conviviality. They are relegated to the status of mere consumers.
	> I choose the term conviviality to articulate the exact opposite of industrialist productivity.
	In other words, "[mere consumers]" are "deprived of conviviality," and the state in which they have the "freedom to create things" is the state in which they have "conviviality.
　Therefore, a "tool for conviviality" is a tool that gives us the "freedom to create things.
　　For example, I saw a story once about "two kids wanted to play a game of karuta and there was no one to read out the karuta, so I wrote a program to read it out in [Scratch]," which is creating things to take care of themselves, and Scratch is a tool for conviviality.
  They are not trapped in the belief that "we can't make it, we can only buy it and consume it."

And regarding this "thing," Ilijic includes "faith" and "education" as "things" as well. (Here, it is abstracted one step further.)
 For example, when schools are "places where mass-produced, packaged, homogeneous education is given in a descent manner," Ilijichi believes that they are "deprived of conviviality and made mere consumers of education. This is not good, Ilijic said earlier in "[A Society of] De-schooling.
 　Conversely, a child who has programmed in Scratch, as mentioned earlier, is in a good state of conviviality

I think many people would not be able to translate this "freedom to create things" into "self-reliant symbiosis". It is necessary to supplement the context.
 Ilijic was originally a Catholic priest, but left church activities in 1969 because of his opposition to the 1961 papal dispatch of missionaries to South America.
 This is not good when the church is a "place where mass-produced, packaged, homogenous faith is given in a descent manner. Especially when this is combined with financial support, which generates dependency among the local people.
 Ilijichi reacted to this and later used words such as "de-schooling" and "conviviality" in the process of verbalizing why it was not good.
 [https://gyazo.com/ec296776c973ca02673c14e4fd1ab070]
　　In this context, it's "independent" in the sense that it's not dependent on a descending arrow, and it's "symbiotic" because it lives in connection with the people around it.
　　For an explanation of conviviality "as an individual freedom realized in human interdependence and as such constituting an inherent ethical value" (p. 40): "Conviviality is the freedom of the individual to be free, to be free, to be free, to be free, and to be free.
　　 Because they do not depend on descent, but live in harmony with those around them through interdependence and mutual help, they are free from the imposition of "mass-produced, packaged, homogeneous faith" by descent, and they have their own ethical values through this form of interdependence rather than the imposition of ethics and values by descent. This state of interdependence, rather than the imposition of ethical values in a descent
		A convivial society is "one in which modern science and technology serve politically interconnected individuals rather than the people they manage" (p. 17).
		 In other words, a society where science and technology are used for the benefit of the people on the bottom right, not the top left square.

Convivial society "a modern society in which tools are responsibly marginalized" (p. 18).
　If we don't limit it, mass production will take place and the composition on the left side of the figure will be created.
　　[https://gyazo.com/ec296776c973ca02673c14e4fd1ab070]
　This "tool" means a device or technology that can be mass-produced, not the kind of tool that humans use by hand

In light of all this, consider "festivity": the
　This "festival" is not a festival to be experienced as a "mere consumer" who "goes to see a festival run by others.
　It is a festival "of our own making.
　What we create for is to enjoy the people around us (enjoy together = [synergy]).

digression
　An interesting expression "convivial army" appears on p. 34
　　These are guerrilla soldiers.


---References
 [Tools for Conviviality]
 [Study on Ivan Ilyich's "Festivals" - Tracing the Sources of "Conviviality" (PDF) https://gssc.dld.nihon-u.ac.jp/wp-content/uploads/journal/ pdf05/5-8-20-kataoka.pdf]
　　After I had figured out "freedom to create things," I couldn't figure out why it was related to "festivals," so I looked it up and found this document
　　Reading this, I understand why the term "self-reliant and symbiotic" was translated as "self-reliant and symbiotic.
　　Reading this, I still don't think it makes good sense to describe this concept as "festivity."

---Trigger
　[computer graphics, media art, tea culture, and zen...] In [Q&A https://scrapbox.io/nishio/Computer_Graphics,_Media_Art,_Tea_Culture,_and_Zen#61bac9e3aff09e00007c4951] in [Q&A https://scrapbox.io/nishio/Computer_Graphics,_Media_Art,_Tea_Culture,_and_Zen#61bac9e3aff09e00007c4951], you said, "Even though we can talk on Zoom at With Corona and get the work done, I feel that there is something missing. Even though we can talk on Zoom in With Corona and get the job done, I feel that something is missing, and the thing that fills it is conviviality".
　　I didn't quite understand "Yanagi turned to folk art as a means of restoring conviviality."
　　The reason why I didn't understand it was because I perceived "conviviality" as a "let's have a festival" kind of thing.
　　I didn't get the whole "you don't need to bring conviviality to a videoconference, you can make tea at home, put or make art" thing.
　　　"A festival where the tea ceremony is broadcast live via videoconference?" I thought.
　　The key concept is "not to be a mere consumer of mass-produced goods, but to create your own goods to entertain yourself and your family.
　　I can understand why you said "putting up art" and then rephrased it as "making."
　　　If you simply buy something and put it down, it has a strong industrialist consumption feel to it.
　　I also figured out "Focus on Mingei."
　　　Mingei is the beauty of everyday objects created by unknown artists for daily life
　　　Convivial production, not mass production

---Question
>"X must become a 'tool for [conviviality].'"
> To this X is assigned a social networking site, a "metaverse", groupware, or an office in virtual space
	[I thought about the chat at SIGGRAPH ASIA 2021#61bc7d1aaff09e000082faec]
	I began to wonder if the concept of conviviality might be useful in this area to talk about the "good" and "bad" of groupware and metaverse. I'm beginning to think so.
　　At this time, I still recognized "conviviality" as "festive."
　I connected positively on this one.
　　>My idea that "virtual offices should be able to make their own changes, not simply enter and use a world that someone else has created" is, in other words, "being placed in the position of a mere consumer of something someone else has created is a deprivation of conviviality, of the freedom to give it shape according to one's own taste. It is a state of being deprived of the freedom to give it shape according to one's own taste." [src https://scrapbox.io/nishio/Kozaneba:%E3%82%B3%E3%83%B3%E3%83%B4%E3%82%A3%E3%83%B4%E3%82%A3%E3%82%A2%E3%83%AA%E3%83% 86%E3%82%A3#61d6d96baff09e00009367b7]
			[their place].
		>Yes on "Should groupware be a tool for conviviality?" [src https://scrapbox.io/nishio/Kozaneba:%E3%82%B3%E3%83%B3%E3%83%B4%E3%82%A3%E3%83%B4%E3% 82%A3%E3%82%A2%E3%83%AA%E3%83%86%E3%82%A3#61d6dba5aff09e00009367b8]
  	> kintone is definitely a tool for creating a convivial information system
  	>Instead of making users "mere consumers of mass-produced information systems," give them "the freedom to create the information systems they use in their work, to give them shape according to their preferences, and to use them to care for others.
		>Minecraft Multiplayer Server as a service for remote work in With Corona to complement the "something missing even if you can have the meetings you need via videoconference" [src https://scrapbox.io/nishio/Kozaneba:%E3%82%B3 %E3%83%B3%E3%83%B4%E3%82%A3%E3%83%B4%E3%82%A3%E3%82%A2%E3%83%AA%E3%83%86%E3%82%A3#61d6ede6aff09e0000344275]
			>Micra is a tool for conviviality.
   >The freedom to create what you want to create, the freedom to change the shape as you see fit, and the freedom to create things "to help others" due to the multiplayer nature of the game.
　Is Zoom a convivial tool?
　　Convivial tools in the sense that "users can choose whom they want to talk to and what they want to talk about.
　　If all you do is "attend meetings given to you by descent" instead of "creating the conversations you want to create," then you are a "mere consumer" of the meetings
　　　Having tools in hand that can be used for conviviality, but not using them for conviviality.



---Past Logs
2021-12-17[nishio.icon]The reason why the Japanese language is not well translated is that the corresponding concept in Japanese is not an idiom made up of a bunch of foreign kanji, but rather "It's a festival, wasshoi! I think that's why.
　2022-01-06 Not at all. The author himself went out of his way to specify that the word is also used to mean "party mood," but that's not what he meant at all.
　See [Kozaneba:Conviviality].

[convivial]
>Borrowed from French convivial, from Latin convīvium (“a feast”), combined form of con- (“together”) + vīvō (“to live”).
>Having elements of a feast or of entertainment, especially when it comes to eating and drinking, with accompanying festivity 
　[nishio.icon]I looked it up in the dictionary like this, but it clearly stated "that's not what it means," so it didn't make any sense at all.

relevance
　[Tools for Conviviality]
　[Collective Creativity: Toward a Convivial Anthropology]

orthographical variants
	[Combiviality]
