Kozaneba:Conviviality
[https://gyazo.com/0512d808ef160414683dc454db877c73]
---

[https://gyazo.com/ecacabd129f0a27df63b02ad8b3ba7f7]

Ivan Ilyich
It's not a "banquet mood," he says.
　Spanish eutrapelia
　Moderate enjoyment
	>Ilyich: "Couldn't we forestall confusion by applying the term convivial to tools rather than people?"
		looking as if it were impossible to prevent

脱学校の社会
Energy and Fairness
脱病院化社会
Tools for Conviviality
shadow work
gender
H2Oと水

Convivial Society
. a society in which modern science and technology serve politically interconnected individuals rather than the people they manage."
'A modern society in which tools are responsibly marginalized.'

Spanish
eutraperia
eutrapelia

英語
宴会気分
Meaning directed by OED
Serious Meaning
Restrained enjoyment
節度
　-ian (e.g. Italian, etc.) (attaches to name of country)
　Aristotle.
　Thomas Aquinas
　神学大全
　　2.2.186.5
　　Creative playfulness gained through practice
　　Answer #3.
　　節度
　　　Elimination of all enjoyment
　　　　instead of
　　　Personality ties
　　　　distract a person's attention away from
　　　　It is destructive to the
　　　enjoyment
　　　　The morality of eliminating only
　　友情
　　(sense of) joy
　　More inclusive morality
　　used after a phone number to indicate that it is a switchboard number
　　tool
　　Personality ties
　　　in
　　　　Restrained enjoyment
　　　　Elegant playfulness
　　Can be destructive.
　　Hugo Lerner.
　　Humans in Play."
Catholic priest

産業主義時代の終焉
packaging
学校化
言語・神話・儀式・法の変化
産業主義的生活様式
諸職業
大衆教育の市場商品化
健康保険への強制加入
public transportation system
Industrialization of any service agency is also
Effects similar to overproduction of goods
Relationship between humans and tools
人間生活の多元的均衡

Scientific Discoveries
機能の専門化
価値の制度化
Concentration of Power
官僚制
機械
付属物
human
能力
管理
自発性
範囲
拡大
Other Individuals
機能
自由
要求
Limited only by

規模の限界
機械が奴隷
A New Kind of Slavery

https://twitter.com/nishio/status/1479030294225498112?s=21
Well, making tea alone is definitely convivial, and making something for yourself with a 3D printer is also convivial, I agree. Iriichi: "People don't just need to acquire things. ...need the freedom to create things, the freedom to give them form according to one's own taste, the freedom to use them for others..." p.39
	Deprivation of conviviality = demotion to mere consumer status
	My idea that "virtual offices should be able to make their own changes, not simply enter and use a world that someone else has created" means that "to be placed in the position of a mere consumer of something someone else has created is a deprivation of conviviality, of the freedom to give it form according to one's own taste. It is a state of being deprived of the freedom to give it shape according to one's own taste.
	This use of the term "convivial army" on p. 34 also makes sense. In other words, "guerrilla soldiers" that are individually handcrafted are convivial armies, while mass production and mass deployment of the same are not. We are talking about the latter losing out to the former.
	As for the question that made me decide to read "Tools for Conviviality", "Should groupware be a tool for conviviality?", yes, Kintone is definitely a tool for creating a convivial information system.
 	This is exactly what p.39 says.
 There are some things that are convivial tools by their very structure. The telephone is one example. ...anyone can talk about whatever he wants to talk about with whomever he chooses." p.62
 As rides get faster, it becomes more and more important to keep them full all the time." p. 180 Uke.
 Looking back, I was sharp enough to turn to Minecraft's multiplayer server as a service to supplement the "necessary meetings can be held via videoconference, but something is missing" in remote work at With Corona (self-praise).
	 Microcosmos is a tool for conviviality.
 	The freedom to create what you want to create, the freedom to change the shape as you see fit, and the freedom to create things "to help others" due to the multiplayer nature of the game.
  That said, maybe we should think of it as a set of Scrapboxes with written explanations, rather than the Mycla server by itself. It is two sides of the same coin to put a teleporter so that people who want to play in Mycla can move to the 1.18 region, and to write an explanation that they should use it because it is placed there.
	Conviviality when we say "a tool for conviviality" or "a tool is convivial" and conviviality when we say "a convivial society" are two different concepts that are connected in Ilyich's own mind but seem to be different in the long and thin view, and so he falls into one or the other. I'm going to take it down.
	Ah, I see, why did Ilyich, who was a Catholic priest in the first place, quit because he criticized the Roman Catholic Church for sending missionaries to Latin America as a bad thing?
 So you find a common structure in the church giving relief, the school giving education, and the hospital giving medical care.
 If we go from school in an easy-to-understand way, mass-produced, homogeneous education is given to students in a descent manner, which eliminates the opportunity to learn according to the individual student's situation and the ability to learn on one's own. They are raised as people who only consume the mass-produced education given to them, and those who consume it well are considered to be on their own, and those who do not are considered to be failures.
 I was wondering why the term "self-reliant symbiosis" was applied to "making things by oneself," but this is indeed self-reliant symbiosis, a highly abstract concept that includes not only physical existence but also faith, learning, and medical care.
 In that sense, "festivity" is not just "going to see an event that is run by someone other than yourself and consuming it as a mere consumer," but it is a festival in the sense of "putting on your own festival, fixing the mikoshi you are carrying, and offering hot tea to the people working on the mikoshi. So it is a festival in the sense of "doing the mikoshi ourselves.

Industrialist productivity
Impose limits on tools for conviviality.

Since "tools" are "means of production to create things," and since "things" include "education," "schools" are naturally "tools," but schools that provide uniform education are not "tools for conviviality," so "deschooling" is necessary, right?


 divide of the two watersheds
 　More than half are treated by doctors
 　Medicine creates a new kind of disease.
 　　Life prolongation costs exceed treatment costs
 　　Professional exclusivity
 　　Increased demand for medical services
 　　Welfare declines while costs and demand rise.
 　　Promoting specialization reduces marginal utility.
 　　At the second watershed, the progress evidenced by previous achievements provides a rationale for the exploitation of society as a whole in the form of value services
 　　　Other examples
 　　　　Schools are no longer an efficient means of providing education.
 　　　　Automobiles are no longer an efficient means of mass transportation.
 　　　　Streamlining is no longer an acceptable mode of production.
 Convivial reconstruction
 Pluralistic equilibrium
 　生物学的退化
 　根源的独占
 　Over-planning
 　　This is rubbished as "programming," but is it that programming?
 　　　not match the correct (answer, etc.)
 　　How to gain knowledge
 　　　People's basic interactions with each other, use of convivial tools
 　　　　For example, native language
 　　　Consequences of following a purposeful and planned training
 　　　　For example, mathematics
 　　If the tools are not convivial, the act of teaching is conducive
 　　Specialization of tools and division of labor can be mutually reinforcing.
 　分極化
 　廃用化
 　欲求不満
　回復
　　科学の非神話化
　　言葉の再発見
　　Recovery of legal proceedings
　subversion in politics
　　Myth and Majority
　　From Collapse to Chaos
　　Crisis Insights
　　Rapid change

---
I saw a story once where two kids wanted to play against each other and there was no one to read the karuta, so they wrote a program in Scratch to read it out, and that's conviviality, because Scratch is a tool for conviviality.
We're not stuck in the belief that "we can't make it, we can only buy it and consume it."
Software is a convenient tool for children to create things because it does not burn or cut their fingers. And as they make things and play with them, they gain confidence backed by experience that they can create things. Isn't this what Iriichi meant when he said we need to "[get out of school]"?
