2022 Muscle Training
[2022 Muscle Training: Current Status].
[2022 Muscle Tractor TABLE].
[active stretching of neck and shoulders].
[2022 Muscle Training Menu].

[Jan~Feb 2022 muscle training]
2022-03-13
	[https://gyazo.com/7c0217491ad169e2a96319cb419ae137]
 ✅B pull-up 2: Horizontal pull high 0 30 x 3
 C bridge 1: Short bridge 50 x 3
 　✅x2
 　I can do it. Your back hurts.
 ✅C hanging 2: bar hang 25s 10s
  It's a lot more stable than when 10 seconds was just barely enough.
  The second time I could only do it for 10 seconds, so I guess something is consuming me.
  The road to 60s x4 is a long one.

2022-03-14
　Tried.
　　[https://gyazo.com/33ac760e9d5642f9e98fe608ba5d75df]
　　They said they'd give you a recommended plan after you enter a lot of information.
　　https://twitter.com/hrjn/status/1502971535224881160?s=21
　　I've entered a lot of information, and then it says, "We've got a plan for you! and then "To see it, you need to subscribe to a subscription of 4,400 yen per year".
　　There's a one-week trial period to get in a subscription and give it a try.
　　[https://gyazo.com/bfea7284de70506021dd2316f6f1b67c]
　　Well, I don't really like this "I've never done this before and I don't know the form" thing where you have to do it for 30 seconds, rest for 30 seconds, and then move on! I don't like this kind of thing.
　　I am the type of person who wants to take my time and cultivate an understanding of my body through observation.
　　Cancelled.
　Carry over of what I was going to do yesterday
　 ✅C bridge 1: Short bridge 50 x 1


2022-03-16
　A Push-up 2: Incline push-up 40x3
 A Leg Raise 1: Knee Tuck 10x1
 ✅B Squat 1: Shoulder stand squat 30 x 2
  I did it without looking at the menu and at the 30 times point I was like, "Well, how many times do I have to do it?" it was 25 x 2.
  Since I had done 30 times, I did another set of 30, but it was indeed tough.
  Weak back pull.
  I was worried that my body might have stiffened up after skipping for a while, but I kept my knees to my forehead.
  　When I first started, it wasn't at all.

2022-04-23
　[https://gyazo.com/290cd34e5a0a4442dda334a01025fe82]

　I did 25 horizontal pulls and came back to see "that's tough, how many times did I do that?" and it was 30.
　　Weak...

2022-05-21
 [https://gyazo.com/03aa063394fb235f135aeb47e5d06047]
 Horizontal pull 30 x 3

　You only do muscle training once a month!
　 It doesn't go to zero times thanks to [Pikmin Bloom].
　[Barhang] continues.
　　Hanging for 10 seconds is not hard, so you can do it every day, this is a low load.
　　The room that has been created is being developed in the direction of [hanging knee raises].

[Parkour-style balance training]

2022-06-04 Sat.
 Horizontal pull 30 x 3
　The flow of taking a walk on Saturday and doing a horizontal pull while doing so.

2022-06-08 Wed.
　Bar hang. 30 seconds.
　　With knee raise leg up form.
　　I wonder if the bottleneck is grip strength.

2022/9/5
　The heat wave was so bad I had to stay indoors.
　Even if you were to stay indoors, you could have done some muscle training indoors, so it's just an excuse.
　My weight is surprisingly unchanged, but my muscles are breaking down and turning to fat, the worst W
　 [https://gyazo.com/c16d7493618caf1c8e25e0cb24f00a85]
　Barhang can only last 12 seconds.
　I did 30 supported squats.
　Should I associate waiting for a microwave or something with muscle training?
　I'm a test user for a project with an unexplored junior, and it's stirring my desire to walk.
　　It's getting a lot cooler, so I should start walking.

2022/12/15
　It's been a long time
　I can do 10 x 2 full squats.
　　It should be ready in the time it takes to make a [hot sandwich].
　Close squats are quite difficult.
　　Just as you needed to have a greater range of motion in your hip joint to be able to do a full squat.
　　Narrow ankle range of motion, shins do not fall forward and center of gravity moves backward
　　Written, weak muscles in front of knee.
　　　I was told to go back to suppoted squatting.
　I didn't do the pull.
　I didn't even do push ups.
　Knee tucks used to be tough, even the starting position, but draw-ins and knee stroking sit-ups have made it a little better.
　　After all, my abs were too much more than they were supposed to be.
　　By the way, your posture is in a hanging knee raise because you're bending your legs during the bar hang.
