Writing is one-dimensional
Reflecting on the idea that "writing is one dimensional" is surprisingly not coherent in my Scrapbox

2018-08-01
	[Social Security and PoliTech#5b615ca7aff09e0000551962]
		Graphic recordings abandon the preconceived notion that minutes are to be taken along a one-dimensional time axis and can be freely arranged

2018-08-11 [Scrapbox Information Organizer#5b6e52afaff09e0000846956]
　I read that the writing is about finitization and [sequence finalization].
　I'm thinking of it in relation to the story of one-dimensionality in the second half of the KJ method.
　2018-08-12 [Books are tools of finitization].
　　Heard the author speak at the event.

2018-09-12 [Scrapbox and long text].
　It compares the reading method of reading a text from head to head with speed reading.
	He describes it as "one dimensional."
　Similar expressions [rough associations].
　[mechanical content].
　　One-dimensional content does not require decision-making about what to read next.
　　　Low cost for people tired of making decisions
　　　People who think there is a right answer to "what to read next" are confused about the right answer when there are multiple options

2019-02-14
	[Number and format of authors]
　　The matrix of "[one-dimensional/networked]" and "author: unspecified many/specified few" is created from the perspective of the author.

We're developing [Regroup] around here.

2020-07-27
 [The process by which sentences are created].
		Written on 2018-11-17 [Difference between writing out method and KJ method in chat: timeline], once I lost track of it and wrote it again.
　　Talking about how it is better to use expressions with weak order constraints because the order in which they come out of the author's head and the order in which they are appropriate for the reader to read them are often reversed.

2021-08-18
　[I want to annotate]
  Talk about using footnotes when you can't express yourself well in one dimension.

2021-12-25
　Reflecting on Kozaneba from the end of the year to the beginning of the year, it was organized that "Kozaneba supports the process of creating a one-dimensional story.
　[Keichobot is verbalized and Kozaneba is one-dimensional].
