2022-01-15 Vertigo
I had dizziness upon waking up on the morning of 2022-01-14.
Was it because of the low pressure? I thought it was, but the pressure was changing violently in the direction of increasing
Still dizzy and feeling sick at dinner, went to bed around 8pm
Wake up around 26:00 and take a bath
Then I was working on the chabu-dai, but when I got up and tried to walk away, I stumbled to the left like "oops" and put my hand on the wall, which I knew was not a good idea.

I called the ENT the next morning, but the appointment was full, and they said they would be there at 9:00 and would give me an appointment after 12:30, so I decided to go to a nearby home doctor type place.
I took his blood pressure and checked for a possible brain hemorrhage, and then I said, since it looks OK, I'll give you some medicine to stop the dizziness.

[Melithron] Tablets 6mg
　>Increases blood flow to the inner ear, thereby relieving rotatory vertigo.
 > Usually used to relieve the dizziness and vertigo sensation associated with Meniere's disease, Meniere's syndrome, and vertigo (dizziness).
 https://www.rad-ar.or.jp/siori/kekka.cgi?n=9784
 Seems to increase blood flow to the ears and brain.
 　https://www.kegg.jp/medicus-bin/japic_med?japic_code=00048337
 　So you had to make sure it wasn't a cerebral hemorrhage.
Tsumura [Poriaing] Extract Granules
　https://www.rad-ar.or.jp/siori/print.cgi?n=7941
　The Chinese herb I used to buy as a countermeasure for getting sick due to low pressure was also Goryosan.

relevance
　I was diagnosed with low frequency sudden hearing loss a few years ago.
 　bass-impaired sensorineural hearing loss
 　　https://www.ohkawara-clinic.com/column/nancho_teion.html
 　About Sudden Hearing Loss
 　　https://www.e-healthnet.mhlw.go.jp/information/sensory-organ/s-001.html
　　At the time, there were no subjective symptoms of difficulty hearing sound

I don't know when "a few years ago" was. I think it would be better to put it in Scrapbox, since this is the kind of information that will be remembered and needed after a few years have passed.
