dezier
Cybozu released in 2002 an information system that allows users to design, use, and collaboratively edit databases on the web ([Web Database]). in 2017, Cybozu announced that it would end support after 6 years, and urged users to migrate to the [custom app function] of [Cybozu Office] or [ kintone], and urged the transition to [[kintone]].

History (excerpted from [https://cybozu.co.jp/company/history/ Cybozu History | Cybozu, Inc.)

2001-06-25 "Cybozu DB Maker" is released
	A card-type database that can be designed on the Web and accessed on the Web. Anyone can easily design and use the database on the Web. The new pricing system includes version upgrades and support, and charges according to the number of databases used.

2002-10-15 "Cybozu Dezie" is released
 A Web knowledge tool that enables easy and quick sharing of information used in various forms within a company on the Web. Based on "Cybozu DB Maker", it has enhanced functions for handling knowledge information.
	[https://gyazo.com/2f8951b25f610bb34a2f679f5f12fbfc]
		https://cybozu.co.jp/products/old-products/dezie3/

2011-11-21 Launch of "cybozu.com" cloud service
	Full-scale launch of cloud services for enterprises. Provided "kintone" for easy development of business applications and cloud-based version of main product "Cybozu Office".

2017-03-21Notice of end of sales and support for Cybozu Dezie 8
	>Cybozu Office" Premium Course has been equipped with a custom application function since 2011. The "Status Management" function, which can be used for shared task management, and functions linked to groupware have been added to the functions provided in Cybozu Dezie 8, and many customers are now using these functions.
 > We would like to announce that we will consolidate our services to "Cybozu Office" custom application function and discontinue "Cybozu Dezie 8" sequentially by license type from 2017 to 2022.
 	https://cs.cybozu.co.jp/2017/006363.html
	[https://gyazo.com/17b5125f296098fcd42dc69455aa3245]
		https://products.cybozu.co.jp/dezie/replace/
