Keep going even if you can't connect
[https://gyazo.com/58a426980b87f3605550b8d64d7f701a]
　1: Thinks that he/she can express his/her thoughts in sentences (one dimensional words, a row of symbols connected in a line)
　2: When it comes time to start writing, you realize it doesn't connect well.
　3: There are two patterns of behavior after this
　　3A: Find the connecting words
　　3B: Put off connecting them and proceed to write out the other parts.

Personally, I think 3B is better.
	I started out thinking I could smoothly write down what I was thinking in one dimensional words (1)
	However, the actual writing did not come out smoothly (2).
	This observed fact reveals that "I didn't have a very clear grasp of the structure of what I wanted to say."
	Yet, ignoring it and trying to write it out as a connected symbol sequence as originally planned (3A) is an ill-advised choice.
　I think it's better to let go of the "must be connected" constraint and write out first (3a) the whole of what you were going to say.
　As the writing continues to reveal earlier symbols, the "connection" may be revealed a posteriori by association with them

context
　I talked about the writing process with someone who does not do two-dimensional placement of detailed fragments.
　The person made a distinction between "moyamoya -> sentence" and "moyamoya -> fragment".
　However, Nishio felt that there was no clear boundary between the two.
　After thinking about why there are no boundaries, I realized that I often choose to do things the 3B way.
　Fall back to the mode of writing out fragments, letting go of the constraint of "producing symbols connected in a line" as soon as the fact that they do not come out smoothly is observed, even if you start with the intention of being able to write out a sentence that can stand alone.
　So there is no boundary between "writing sentences or fragments".

[Writing process].

---example
t1
In scientific terms, with "influencing substances",
Past it.
freely
By using it in a messy way.
harm
Beneficial when used delicately.
t2
In scientific terms, with "influencing substances",
Past it.
freely
By using it in a messy way.
harmfulness
Beneficial when used delicately.
t3
In scientific terms, with "influencing substances",

Harmful when used roughly
When used delicately, it has a beneficial impact
Past it.
t4
I guess the scientific term is "influencing substance," which is harmful when used in a messy way, and beneficial when used delicately.
People think it is harmful because it was used in the past in a miscellaneous way and caused harm, but this is probably a temporary belief in its long history.

Comment
　In this example, the organization is complete with only a text editor.
　After the word "beneficial" was introduced, its effect was to differentiate the earlier "harmful" into "harmful" and "harmful."

---example2
t1
Simply memorize the book's content
alone, the information in the "past".
I'm just duplicating it.
Before you do something, be able to anticipate what will happen by doing it.

The "past" information in the book.
How right you are.
Can it be reproduced?
instead of
The "future" information that I predicted.
How right you are.
ability to foresee the future

t2
[https://gyazo.com/cd8d64c4d82e143537bc0c992717ced8]
t3
[https://gyazo.com/3b7825cab86740e984dd5de2127ead81]
t4
[https://gyazo.com/c8c93dbf078bec016846b62d46f3e4ed]
t5
+Language,Understanding
[https://gyazo.com/5a2ee9b1096f8e73cc273c36b5cff437]
t6
Even if one could memorize the contents of a book and reproduce them verbatim, this would only be duplicating information that has been verbalized in the past.
Understanding the content of a book is [- before you do something, what is] to be done by doing it.
It is to be able to predict what will happen in the future.
The degree of understanding is measured not by how correctly one can reproduce past information, but by how correctly one can predict future information.

t7
Even if one could memorize the contents of a book and reproduce them verbatim, this would only be duplicating information that has been verbalized in the past.
To understand the book is to be able to predict what will happen in the future.
The degree of understanding is measured not by how correctly one can reproduce past information, but by how correctly one can predict future information.

Comments:.
　In this example, the writing was started in a text editor, chopped into Kozaneba, and placed in two dimensions
　The block of "before doing something ~" was written once and then truncated because "this branch is unbalancedly large in expressing the contrasting structure of the two elements."
　　If I were to write, I would probably rewrite the paragraphs and supplement them with more information.

---example3
t1
Writing sentences from the head.
be packed (with)
When the next word doesn't come out
When the next word comes up but it's not connected to what you've written so far.
Someone stops the brush and worries.
Continuing is more important than connecting.
Connections can be made later.
As we continue to write out and clarify what is ahead
The "connection" may be revealed by the association of it

t2
[https://gyazo.com/58a426980b87f3605550b8d64d7f701a]
The picture was created to better express "when the next word comes up, but it's not connected to what I've written so far."

t3
Supplement this picture with words
　1: Thinks that he/she can express his/her thoughts in sentences (one dimensional words, a row of symbols connected in a line)
　2: When it comes time to start writing, you realize it doesn't connect well.
　3: There are two patterns of behavior after this
　　3A: Find the connecting words
　　3B: Put off connecting them and proceed to write out the other parts.

The fact that you started out thinking that you could smoothly write out what you were thinking in one-dimensional language (1), but in fact you could not (2), clearly shows that you did not have a very clear grasp of the structure of what you wanted to say. Therefore, I think that 3A, which ignores this and tries to write it out as a one-dimensional language as originally planned, is an illogical choice.

t4
supplement the context
I talked about the writing process with someone who does not do two-dimensional placement of detailed fragments.
The person made a distinction between "moyamoya -> sentence" and "moyamoya -> fragment".
However, Nishio felt that there was no clear boundary between the two.
The reason why there are no boundaries is that when we start out with the intention of being able to write out a sentence that can stand alone, but observe the fact that it does not come out smoothly, we let go of the constraint to "produce symbols connected in a row" and fall back into the mode of writing out fragments.

t5
[- I've been thinking about why there are no boundaries, because when I start with the intention of being able to write out a sentence that can stand alone, but observe the fact that it doesn't come out smoothly, I let go of the constraint to "produce symbols connected in a row" and fall back to the mode of writing out fragments].
After thinking about why there are no boundaries, I realized that I often choose to do things the 3B way.
Even if you start with the intention of writing out a sentence that can stand alone, once you observe that it does not come out smoothly, you let go of the constraint of "producing symbols connected in a line" and fall back to the mode of writing out fragments, so there is no boundary between "writing a sentence or writing a fragment.

t6
Look back and see the initial fragment
>Connections can be made later.
> As the writing continues and what is ahead becomes clearer.
> The connection can be revealed by the association of them.
I notice that there is no equivalent to

Started out thinking I could smoothly write down what I was thinking in one-dimensional words (1), but in reality I could not smoothly write it down (2).
Since this observation reveals that I did not have a very clear grasp of the structure of what I wanted to say, I think that 3A is an ill-advised choice to ignore it and write it out as originally planned as [- one-dimensional language][* connected symbol sequence].
It is better to let go of the constraint that "it must be connected" and write out first the whole of what you were going to say. As you continue to write out and the symbols ahead become clearer, the "connection" may become clear after the fact by association with the symbols


Comment
　In this example, I initially wrote it out thinking it could be expressed in one dimensional text, but after getting stuck and expressing it in fragments, I made the choice to express it in pictures
　Some coherent text was output to explain the picture.
　I compared that text with the fragments I had initially written out and discovered what I had missed.
