It would be good to have a policy on how to proceed with the ScrapboxAutoTrans project going forward.
[/nishio/kei.icon]What would you like to see happen in this conversation?
[/nishio/human.icon]It would be good to have a policy on how to proceed with the ScrapboxAutoTrans project going forward.
[/nishio/kei.icon]What kind of "ScrapboxAutoTrans project" is that?
[/nishio/human.icon]A project to bridge and interconnect the Japanese project, which is the main editing project, and the English project, which is a translation of "The Art of Intellectual Production of Engineers" with machine translated content.
[/nishio/kei.icon]What kind of "intellectual production techniques of engineers" is that "intellectual production techniques of engineers"?
[/nishio/human.icon]A cohesive amount of interconnected knowledge systems output and published. It has been observed that it has fulfilled the needs of many people in Japan. I think it will fulfill the needs of many people around the world because it doesn't contain anything specific to Japan. That is why I am translating it into English.
[/nishio/kei.icon]What kind of "mutual" is that "mutual"?
[/nishio/human.icon]Hmmm, they are connected, they are related, and it is more helpful to understand them if you are aware of the connection.
[/nishio/kei.icon]
 > A coherent amount of interconnected knowledge systems output and published. It has been observed that it fulfills the needs of many people in Japan. Since it does not contain anything specific to Japan, I believe it will fulfill the needs of many people around the world. That is why I am translating it into English.
 Is there anything else you can tell us about this "mutual"?
[/nishio/human.icon]As for interconnecting with Japanese projects, Scrapbox is now divided into separate projects, which makes it difficult to connect, so we felt we needed a system to help us connect. One of the reasons for the project's existence
[/nishio/kei.icon]How do you know its "mutual"?
[/nishio/human.icon]I can't know if the projects are separated, so I thought it was necessary to group multiple projects together and display them. But I just realized, "Why don't we just put the projects themselves together and create a view for English speakers by narrowing it down?" I realized that
[/nishio/kei.icon]What kind of "project" is that "project"?
[/nishio/human.icon]The container that contains the page.
[/nishio/kei.icon]
 > As for interconnecting with other Japanese language projects, the current division of Scrapbox projects makes it difficult to connect, so I felt that a system to help connect was needed, which is one of the reasons for the existence of the ScrapboxAutoTrans project.
 Where is this "mutual" located?
In [/nishio/human.icon]Scrapbox, a page can belong to only one project. However, there are often pages that cannot be clearly identified as belonging to more than one project, and it is a loss to lose the connection by dividing them appropriately.
[/nishio/kei.icon]What do you value?
[/nishio/human.icon]Obviously, it's a "connection". There are two kinds of connections regarding this: connections that help me think about it, and connections that help the reader read and understand it
[/nishio/kei.icon]What kind of "connection" is that "connection"?
[/nishio/human.icon]When I think about which of the two types of "connections" is the more valuable "connection," it's the former "connection for me. The latter "connection for the reader's understanding" cannot achieve its purpose if it is massively machine-generated in the first place. They must be a small number of useful links that have been selected and discarded by the author. The former connections for their own sake are useful in making sure that the latter connection choices are not overlooked
[/nishio/kei.icon]Is there anything else about that "connection"?
[/nishio/human.icon]Given that, we can conclude that it is better to merge the Scrapbox projects in terms of providing a connection for authors.
[/nishio/kei.icon]Anything else about that "project"?
[/nishio/human.icon]The reason why we separated the two in the first place is that Scrapbox did not have a function to create a card view page narrowed down to English content. So we can create that part in Scrapbox Reader.
[/nishio/kei.icon]What kind of "Scrapbox" is that "Scrapbox"?
[/nishio/human.icon]Memo application for storing connections at low cost.
[/nishio/kei.icon]Where is that "connection"?
[/nishio/human.icon]It's stored in each project in the form of a link. I don't think there's explicit information about which English corresponds to which Japanese, which straddles languages.
[/nishio/kei.icon]Where is this "project"?
[/nishio/human.icon]They exist in two separate files on Scrapbox, but I'm thinking it would be better to merge them.
[/nishio/kei.icon]Anything else about that "Scrapbox"?
[/nishio/human.icon]It would be good to flag the English version with the icon notation since it is difficult to Undo the merged one
[/nishio/kei.icon]
 > I have two separate entities on Scrapbox, but I'm thinking it would be better to merge them.
 Where does this "Scrapbox" come from?
[/nishio/human.icon]Putting that question aside, policy summary: merge the two projects, create a view focused on the English version only.
[/nishio/kei.icon]Where is this "project" located?
[/nishio/human.icon]Then the "static hosting of machine-translated Japanese projects" would completely float, but hmmm, maybe that's something that should be lowered in priority since it didn't come up in the process of making something worthwhile into a language, Naming ScrapboxAutoTrans and what we're going to do in the future is a mismatch, so I'm going to suspend this one.
[/nishio/kei.icon]What is the relationship between that "Scrapbox" and "Project"?


https://keicho.netlify.app/#talk=cXmq3OIvJtba3hCNc8Jo
#KeichobotLog