(4.2.2) Where is the bottleneck?
When speaking or [reading aloud], the [bottleneck] is the performance limit of the throat.

[https://gyazo.com/5cf249b15afb48deae76fa0846235f45]
Fig: [The bottleneck of conversation is throat]

When reading a paper book, the bottleneck is the performance limit of hands. If you digitize the book to make page turning at high speed, the bottleneck is the performance limit of the eyes.

If these hardware bottlenecks are affecting the reading speed, solving the bottleneck is beneficial for improving the reading speed. For example, some people who read slowly are unconsciously moving the vocal cords in their throat. They are [quietly speaking]. By training how to read without using throat, they can read faster. Training how to move eyes and hands also improve reading speed, only if they are bottlenecks.

However, in the case of most readers of this book, those are not bottlenecks. Even if the size of the letters, pages, and the density of letters are the same, there is a difference between the speed when reading a casual magazine and the speed when reading a difficult technical book. What is the cause of the difference?

For the hardware such as the throat, eyes, and hands, the two documents are the same. The only difference is the difficulty of the contents to understand. If you have a difference in reading speed of two documents, the bottleneck is your [speed of understanding]. In other words, the bottleneck is not to collect information but to assemble them to build understanding.

[https://gyazo.com/fe288a2c6d2f297affc5affc70fbe05c]
Fig: [Assembling information is a bottleneck]

When you are comfortably watching fragmented text on SNS, the contents are small pieces, and there is not much relation between the pieces. So, there are not much need to assemble them. The reading speed in the case is the speed without assembling information.

Many speed-reading techniques propose additional tasks. Such as keeping the pace turning the page twice a second, keeping the pace by counting the number, or saying "[relax]" repeatedly.

However, they are all additional tasks for your brain. Those tasks run in [parallel] with reading. They decrease your brain's performance. So, in the case that the bottleneck is the brain, they are all harmful unless you can do those tasks unconsciously.

[en.icon]