(4.3.1.9) Five days training
We learned the 8 components of the [Whole Mind System]. In the first half, we clarified the purpose and gathered rough information. We learned a similar concept in [(1.3.3) Learn roughly first]. The second half is an activity to prepare concrete question and read the book repeatedly. This activity is related to the effect that the test strengthens memory, which we learned in [(3.4.1) Test is a means of memorization]. To leave overnight is also likely to relate to a way to enhance memory by leaving the interval learned in [(3.5) Spaced repetition method that lasts knowledge].

Well then, let's see how the Whole Mind System combines these components. In the Five days training program, you repeatedly read a book over five days. You read the book 10 times in total. On the whole, you spend more than two hours. So, for many people, this program does not shorten the time to read a book. This program is training to experience a change in the quality of reading. You learn the way of reading which iterates through the book 10 times rather than reading through the book only once.

5-days training is as in the following procedure. I omit some step because the procedure list becomes complicated. At the beginning of every day, "[❶ Preparation]" is attached. Also, at the end of every day, "[❺ Mature]" is attached by sleeping overnight until the next day.

	Day 1
　　[❸ Photo reading]

	Day 2
　　[❷ Preview]
  [❸ Photo reading]
  ❹ [Post view] while writing keywords and questions

	Day 3
		[❸ Photo reading]
  [❻ Find the answer]
  	(Do not mind if you understand the answer)
		See the keywords and think if the selection was right.

　Day 4
　　[❸ Photo reading]
  [❻ Find the answer]
		See the keywords and add questions.

　Day 5
　 [❸ Photo reading]
  Look at the [table of contents], check the chapter you want to know more and [❻ Find the answer]
  If you do not have any questions, but you want to know more, do a [❽ High-speed reading]
  [❼ Make a Mind Map]

As a standard of time, Paul suggests that [❷ Preview] on 2nd day is less than 2 minutes, [❹ Make questions] is 15 to 20 minutes, [❻ Find the answer] on 3rd day is within 30 minutes, [❼ Make a Mind Map] on the 5th day is about 10 minutes.

As one example of [speed-reading techniques], I described at the [Whole Mind System]. How did you feel? Many people think "reading a book" as "[reading a book once]," and misunderstand that speed-reading is a way to get it faster. However, the Whole Mind System is a way to [repeat fast and rough reading] many times instead of reading the book slowly only once.

[en.icon]