(Column) PDCA cycle
Although the [PDCA cycle] is a useful concept, many people are confused. There are variations such as A=Action, A=Adjust, S instead of C. What matters is a way of thinking that gradually improves by turning the cycle. The details are not relevant for the purpose of this section. However, since many people are interested, I explain it.

Around 1950, [William Edwards Deming] made a Deming cycle. It is a cycle of followings:

 designing products
 → manufacturing products
 → putting it on the market
 → investigating what the user thinks and why non-users do not buy
 → redesigning the product.

Deming himself calls the cycle "[Shewhart Cycle]" named after his co-worker. It is sometimes called "[Deming-Shewhart Cycle]."

At the same time, in Japan, regarding the cycle, another cycle created. It was followings:

 plan]([plan], [design], [forethought]), [plan], [design], [forethought])
 [Implementation]([implementation], [operation])
 [check]([check])
 [action]([action])

The cycle was translated directly into "Plan · Do · Check · Action" cycle. It was exported to English-speaking countries. 

In the Japanese version, all of these are nouns, and they all become verbs by attaching "-suru" at the end of the word. The distinction between nouns and verbs is ambiguous. However, in English, only "action" is a noun, and the others are verbs. It seems strange. So, derivation "Plan Do Check Adjust" and "Plan Do Check Act" were born. 

I often explain using the "adjust" version of the cycle because I feel the word "act" too vague.

After that, around 1990, Deming proposes the [PDSA cycle]. Replacing Check with Study. He emphasized the idea of ​​[learning from the results of action]. It is similar to [(1.6.1) Varification by making]. In this PDSA cycle, A stands for Act. The contents if "act" are as follows.

 Adopt the change plan
 Abandon the change
 run through the cycle Again

As of 2018, it seems that the [OODA loop] proposed by the US Air Force is prevalent in some Japanese engineers. The OODA is the abbreviation for Observe, Orient, Decide, and Act. You may be interested to compare them to PDCA cycle.
[en.icon]