(Column) Example of "to write all out" method
I used the method described in this chapter for years. I use the method for preparing lectures. I also used the method to write this book.

So, as a concrete example here, I show you some pieces for the chapter.

[https://gyazo.com/e9f5bb041ededf27c04c0a116d4b5f13]
Fig: the actual pieces for writing this chapter

Rough translation of each piece for English readers is as follow. The broken grammar is intentional because I didn't care about grammatical correctness when I made the real Japanese pieces.):

 Method to organize thought
 thought won't be organized:
 	too much?
 	too less?
 report
		can't write
 Do I need to create new knowledge?→(6)
		But organizing also build new pyramid in brain
 Too many tasks, confusing
  → related to chapter 2
	 GTD = write out method
 Too much? Too less?
 Try to write 5 minutes
 First try to write 100 pieces
 write out method
  First write everything come up with
 Try to write 100 pieces
  measurable goal
  interrupt-able
  →dupulication is OK
 level is not aligned first they come out
 don't mind dupulication, together after
 can write only less → lack of material to think
  write out → small number → evidence of lack
  back to chapter 4 and read 3 books roughly

You can see that there are many duplications in the content.

I made pieces once when I planed the contents of this book. It was in May 2016. I wrote "first try to write 100 pieces" because I usually do that.

After that, I left those pieces for chapter 5 aside and wrote the previous chapters. When I was writing the way to motivate yourself in Chapter 2, I noticed that it is a too big task for readers who are unfamiliar with the "to write all out" method. They can not predict how long the task takes. ([(2.3.1) Task is too big])

In Chapter 2 [(2.3.2) Timeboxing],  I explained the method to motivate yourself by making a task smaller, breaking it by time.

As a concrete application of [timeboxing], I add a new piece "try to write 5 minutes" that keeps the first step small. And then I re-arranged those pieces, and convert them into sentences. It was August 2017.

[en.icon]