(4.2.4.1) Get information without reading
Before deciding whether to read a book X, you can know the position of the book X in the [context] of history. For example, Philosopher [Immanuel Kant] wrote "[Critique of Pure Reason]."

Before the book, a mathematician [Gottfried Wilhelm Leibniz] argued the correctness of reason on the assumption that God is right. Kant took a critical position against the opinion. 

The book is a turning point of the history of the philosophy. 

A hundred years later, the philosopher [Friedrich Wilhelm Nietzsche] said "God is dead" in his book "[Amazing Knowledge]." Kant triggered Nietzsche to say that.

Even if you do not read these two books, you can know this information. This activity is collecting information about "[a book that you have never read]."


Next, you can [collect information] from the other people who read the book. You can ask your friend who familiar with the field. In these days, you can [search] book reviews on the Internet. By those ways, you can grasp the [rough content].

Even if you are convinced that you should read the book, you can read it [roughly] before you read it firmly. After the rough reading, if you do not feel the need to read firmly, you can stop reading there. 

If you think that you must read more books firmly than you can read, the thought accumulates suffering and stress. It is a more [realistic] [goal]-setting to let go of firm reading.

----

I refer to many books in my book. If you call "reading" only the firm reading, I have read most of the books only once. 

Let me write it more concretely.

I read the book at least once roughly before the planning of my book. I read it to the extent that I can recall there are concepts which worth to introduce.

Next, I read the book so that I can grasp what page I want to refer before writing the manuscript. It is the second time.

I carefully read the part to refer. It is the third time.

Writing a manuscript as reading make descriptions in excessive detail. So I do not read the book when writing a manuscript.

Finally, I read the book to confirm that my explanation is correct. It is the fourth time.

In other words, if you call "reading" including the rough reading, I read those books at least four times.
[en.icon]