pIntEn Released up to chapter 3
from [English Project for Intellectual Production of Engineers (-20190522)].
Released up to 3 chapters
2019-02-21
	On the train to
		Bolded issue [Engineers' Intellectual Production English Translation Project#5c6cebb3aff09e00007cd01b].
			>It looks like the bold output is buggy and it's a link.
		Title hierarchy
	implemented.

I've just created a Scrapbox parse tree and then converted it to Markdown, but I should resolve the links in the parse tree state before outputting Markdown.

	Cache crawl results
	Images are automatically replaced with links to downloads
Now you can repeat the experiment on the train on the way home.

Yes, I forgot to note that I released the results of the automatic conversion up to chapter 1 yesterday, so the number of pages and words has increased considerably.
[https://gyazo.com/8e57b3c8f01dcec1cd4e22e30e5f4cd3]
Today's script improvements have improved the images, so we'll release them again at the appropriate time.

Return train + α
	New implementation of cross-linking
	Keywords that appear only once should be italicized, not linked.
Now you can link everything you can think of without worry.
Crosslinks used to be generated by converting them to Markdown, but now they are in the form of two licks of the tree after the Scrapbox parse tree is created and before it is converted to Markdown.

It's too much trouble to deal with multiple split trees, so I think it would be better to create one big tree and then split it into multiple Markdown files.

2019-02-22
	Output multiple markdown files, separated by chapter
Human reading and checking is a separate phase, but for now, we can now do "finished translation on Scrapbox" -> "immediately generate Markdown and release on LeanPub".

Issues:
	The diagram in section 1 looks like this
		[https://gyazo.com/b017bc399827d9715d071030596bdb4a]
		This is due to the fact that there is no blank line under the image tag
	Listing examples are misinterpreted as links.
		[https://gyazo.com/7ac5b727f95c6fc92cd2dcdf7911313f]
		I think it's better to fix these things individually, since the number of pieces is so small, than to deal with them programmatically.
	What to do with footnotes
		In the meantime, LeanPub does have a footnote tag...
		That's fine when reading it in PDF, but in ePub, it's wedged on a separate page.
		I'm a bit fuzzy on whether that's a good idea, but if you can't think of a better way to do it, then I guess we'll just have to keep doing what we're doing.
	Links to other pages
		Link to children's page is useful
		I don't want a link to my brother's Next.
		Maybe there should be a link to the parent, I use it a lot on Scrapbox, but it's gone when converted to ePub.
		Now, cross-links are basically summarized at the end of the chapter with the assumption that they do not have the substance of the page. However, there are a number of them that do have substance, and it would be a shame to throw that content away. How it should be.
			Existence of columns that are not clearly located in the tree of chapters
			All pages should have an auto-generated "link to that page" (backlink) at the end
			Then, if you only clearly indicate the link from parent to child, the link back to the parent will be generated automatically.
			Columns have backlinks to where the column is mentioned
			Individual pages that do not enter the chapter tree will have links to pages that mention the keyword as well
			Currently, footnotes are grouped at the end of the book as Endnotes, and links to them are paired with a link back to the Endnote.
				This also happens to be a one-to-one relationship, just a page without a title, but the composition is the same
				Footnotes" in Scrapbox would be "pages where the title is just a number.
				I've been struggling with "whether you want footnotes to be visible in the flow of the text or not on a case-by-case basis." Whether to include them or not should be controlled by a tree description indicating the order of reading.
			When creating a paper book, there was a separation between text and footnotes based on whether they entered the story flow or not, but essentially that and the way the branches are attached can be controlled independently.
				For example, the explanation in footnote 1, "Cybozu is a software maker developing groupware." should have been linked with "Cybozu," not with the footnote number "1.
					It's just a link by number because of the poor representation capability of the book.
					I saw the footnotes on a separate page to try it out.
						Example of natural title present [/intellitech-en/MOOC].
						Example of non-existence of natural title [/intellitech-en/1.2.2.2 *1].
							Does not exist = not yet thought of at this time
			I thought "how to express footnotes in Scrapbox" or "Scrapbox is not capable of expressing footnotes well because of its poor expressive power", but it's the opposite. Essentially, all you have to do is bracket the part you want to annotate and write it on the link.
			If the physical page separation in a book goes away, then so does the "foot" in "footnotes."
	About the sway of expression
		"Learning methods of engineer"と"Learning method for the engineer"の両方があった
		If they refer to the same concept, the expressions should be identical.
		And make it a link.

Released up to 3 chapters (1~3 are mechanical conversion only)
[https://gyazo.com/0552f4e0cb27df67d18d84c17cbc006c]

	Added blank lines above and below the image.
	Dealing with the problem of Japanese garbled in the PDF version
		→ I guess I'll pick it up with a regular expression after it's generated and replace it.
			InnerLink and Verbatim's to_markdown to wrap for Japanese
	Incoming links are now displayed at the end of the page.
I could have done it on the train ride home, it was surprisingly easy.
Is it good to be able to organize your thoughts while walking?
	I thought about using the character code to determine if it is Japanese or not, but decided that if it contains non-ASCII characters, it is NG.
