(5.1.1.4) Benefits of 100-piece goal
There are two good things about the approach that put the goal at 100 pieces.

One benefit is that you can measure [progress] clearly. If you think "I have to write a report," it is difficult to keep your [motivation]. The progress is unclear, and you can not get [reward]s from your actions.

On the other hand, if the goal is "to write 100 pieces," when you wrote 30 pieces, it is 30% progress. It is easy to understand. Also, if you write a piece, you steadily step toward the goal. The direction to go for reaching the goal is clear, and it is difficult to get lost.

The other benefit is easy to [interrupt]. 

Even if you are busy and it is difficult to take a long time, this "to write all out" method can be advanced gradually. You do not have to be sitting at your desk all the time until you finish writing 100 pieces.

In the previous section, I recommended 5 minutes as your first experience, but it is not a requirement. One minute is OK. 10 seconds are also OK. You do not need to use a timer. You can use small fragments of time.

When I wrote this book, I gradually progress the method. For example, I came up with an idea while I was walking to the station and wrote a piece. In the train, it triggered me, and I wrote 7 pieces. I wrote 3 pieces on the escalator. It progressed little by little. I used 50 mm × 38 mm fusen, inserted in my chest pocket and notebook. I write one by one idea.

Many people think that they can not start writing without having a long continuous time. (*6) However, at least this "to write all out" phase can proceed with short fragments of time. Even if you can have a long time, it is more efficient to start writing with 100 pieces of thought written beforehand rather than start writing with nothing prepared. So let's start with the "to write all out" method first.

Note *6: Many people think that they can not start writing without having a long continuous time. It is a [procrastination]. It is a [mental model] that "The writing is a [big task]." [Big task harms motivation].

Note *7: In my case, I need a continuous long time for the last phase of writing. In the phase, I make sentences which can be read by reviewers. I spend time on holidays, come to coworking space, and write at a stretch. There may be ways to use fragmented time in this phase as well, but I have not found it yet.
[en.icon]