(5.2.5.3) Relation which connects story
At the stage of creating a group, you do not need to explain what the relation is. You do not need to be able to explain it.

[Jiro Kawakita] recommended the following approach:

	collecting pieces which are likely to be related in one place first
	then explaining the contents of the group

It is a good group if you can explain the contents smoothly. Since you can disassemble the group anytime, it is important not to raise your mental hurdle too high at this stage.

It would be better to compare the group to the presentation slide. There are contents that you put together in a slide and what you do not. If you put unrelated information in one slide, your story is not smooth. 

The physically close pieces in the KJ method correspond to the same slide or slides close in time in a presentation. I arrange the pieces so that the story runs smoothly.

Let me give a concrete example on whether the story connects or not. Suppose there are two pieces as follows. Do those pieces connect?

	A: KJ method absorbs time infinitely (*26)
	B: "thought is not organized" and "room is not clean" are similar

(Footnote *26: It is an expression that "In the KJ method, you can spend unlimited times if you want". I did not rewrite it to make it easier to understand. I think it would be better to introduce the sentences I wrote as direct as possible.)

I could not find a way to connect these 2 pieces smoothly. (*27)

Let's add 2 more pieces.

	C: Cultural anthropologist and many workers are in different environments
	D: Make it readily available when needed

What would you do if you were to make these four pieces into two groups? There is no correct answer for the group organization, but I did as follows.

	A+C:
		KJ method absorbs time infinitely
		Cultural anthropologist and many workers are in different environments
	B+D:
		"thought is not organized" and "room is not clean" are similar
		Make it readily available when needed

By putting pieces that are likely to connect close together and thinking about how to connect, new pieces are created.

[https://gyazo.com/4a4e73ed8a6015cff63de541948f26c5]
Fig: See pieces that are likely to connect, think how to connect, create new pieces, and then they connects

	They may connect.
	They connected.


I show explicitly the information to connect pieces as below.

	A+C:
		KJ method absorbs time infinitely
		(however)
		Cultural anthropologist and many workers are in different environments
		(so, it should be adjusted to the situation of workers)
	B+D:
		"thought is not organized" and "room is not clean" are similar.
		(What is "clean"? It is)
		to make it readily available when needed.
		(Organization of thought is also same, isn't it?)

By trying to connect pieces, you get new pieces. In this example, I got the concept of the need of adjustment. If you get new ideas, write it as soon as possible. Otherwise, you may forget it.

Footnote (*27): When I first wrote this part of the manuscript, I did not come up with A + B. I read it back now and came up with a combination: "tidying up a room also absorb an infinite amount of time." Even if the materials are the same, what comes from those materials changes from time to time.


[en.icon]