(1.5.1.3) Focus on the difference
People tend to focus on common parts. However, collecting common parts is less likely to lead to abstraction. [Focusing on difference]s and contradictions is more likely to lead to abstraction.

For example, let's [compare] how to learn programming and how to learn a second language. (*1) What do you imagine as the way to learn the second language? In my case, it is to read textbooks written in English. It is quite different from the way to learn programming. Let's think about why they are different.

	*1: Originally in Japanese, "the second language" was "English" because the second language of the most Japanese is English. I rewrote it.

After a while, I came up the conclusion that to read is only part of the input.
When we learn programming, after reading a book, we use the knowledge to make a program. It is the output phase. And then, if the program works as expected, we feel joy. 

Is there something corresponding to that in learning of second language? I thought so and found answer. It is to tell others something in the second language. If the listener understand what you want to say, we feel joy.

Thare are three step cycle:

 They are not the same.
 Why are they different?
 They are not different from another viewpoint!

By turning the cycle, you climb the stairs of understanding step by step. The [pattern] of thinking has the [name] "[dialectic method]."

[https://gyazo.com/82aae7c62b41f120d2333a07b996aa4c]
Fig: Repeat [conflict] and [resolution of conflict]

	(1) B differs from A, why?
	(2) In viewpoint of C, they do not differ!
	(3) D differs from C, why?
	(4) In viewpoint of E, they do not differ!

This cycle is an endless process. So, especially when reading books written by different authors on similar themes first, you should better to focus on common parts. It helps you to acquire popular models among multiple authors.
After that, if you can afford, it is good to focus on the difference of the opinion among the authors. Then, think why they are different.

For example, in [(1.3.1) Learn from what you want to know], I introduced three similar ideas:

 [lazy evaluation study method]
 the [YAGNI principle]
 [Matz's code reading method]

By Comparing them yourself and focusing on differences, your understanding deepens. However, since this is a task with the unclear achievement condition, you can skip the task now. After you finish reading this book, please try it once.

Keywords:
	[difference]

[en.icon]