(2.3.2.4) TaskChute: method to estimate time in minutes
In the Pomodoro technique, we estimate the size of tasks in the number of Pomodoro. However, in "[TaskChute]" proposed by [Masaaki Sasaki], we estimate the time taken for a task in minutes. (*24)

When I heard this method, I thought that it was impossible to estimate the task with an accuracy of minutes. So I asked the author Mr. Sasaki how to estimate them. According to him, to measure is important. First of all, we estimate the time. We may make a mistake, but there is nothing to worry. Then we run the task, measure the actual time, observe the gap between the estimate and the actual time, learn from them. The basic idea is the same as estimating the size of the task by the number of Pomodoro, and the difference in TaskChute we use the 1-minute unit.

Once you do this estimate, you can learn much about what kind of things you are doing and how much time you spend for them. In my experience, I was surprised about the time to write an e-mail. Before I started measuring, I estimated it about five minutes. After actually writing the e-mail, I watched the clock and found it took about 35 minutes.

In these days, I felt very busy. Time flies like an arrow. However, I did not understand the reason. The reason is that the number of mail exchanges increased due to my new project and I misunderstood the time taken for replying those e-mails. I thought it takes 5 minutes, but it actually takes 35 minutes. That's why it took more time than I expected.

In this experience, I learned replying the e-mail is unexpectedly time-consuming tasks if I do not control well. Since then I start a 25 minute Pomodoro timer when replying to a mail that may take much time. Otherwise, I start a 5-minutes timer, because my estimation may fail.

Also, since the reply of e-mail is 1 Pomodoro and I can only 4 to 8 Pomodoros per day, if I use 1 Pomodoro for all incoming e-mails, time gone. So I compare the incoming e-mail with the importance of other tasks written in "Today's Task List" to see whether it is worth taking away one Pomodoro from the scheduled task. If it does not worth, I reply to the e-mail simply.

---

　Footnote*24: In Japanese book: Shogo Sasaki, Etsuo Ohashi (editor), "Why can't work be finished on time? Why can't you finish your work on time? Task Shoot Time Art", Gijutsu-Hyohron Co.

[en.icon]