(4.4.3) How to read mathematical books
Mathematician [Yasuyuki Kawahigashi] also adopts the "[do not go ahead if you do not understand]" principle strictly. He says it is not surprising to spend 50 hours to prepare a seminar.

Most of mathematical books are [climbing books]. The "do not go ahead if you do not understand" principle is a common way of thinking in the mathematics department of a university. You should not leave things you do not understand while reading.

I interviewed [Shigeo Mitsunari] who graduated from the mathematics department and is doing research on cryptographic theory. In the interview, there are strongly related topics here.

I asked him how to learn new thing. He answered, "we have no choice but to read a textbook." This "reading" was quite different from "reading" in our everyday conversation. I quote some:

> The biggest difference between engineers and mathematicians is the amount of training to read properly. Professor sometimes gives a book and says us to read it properly. We need to read it properly.
>When we say "read," we read every letter. We do not read ahead if we do not understand anything. When we go to the seminar professor ask us to explain. When we explain, the professor asks, "is it true?" When we say "I think it is true," the professor says "show it." We have to explain everything in our own words. It is frequently happens that a seminar takes five hours and we go ahead only one line in the book. It is OK. The professor does not get angry with it. He gets angry when we say "I understand it" to the concept which we do not understand. It is similar to the debugging of a program. We gradually increase the fact that is absolutely correct.

On the other hand, [Motohiro Kosaki] who graduated from the physics department and who is developing the Linux kernel said in my interview "It is important to read it ahead even if you do not understand." I also asked about this gap to Shigeo Mitsunari. He said it is a difference between understanding the [whole picture] and understanding the [definition].

>In the study of physics, sometimes they have phenomena which they want to describe. They prioritize the understanding of the whole picture. They close their eyes on some gaps and go ahead like stepping stones.
>It is a completely different direction with the study of mathematics. We have the definitions, think why the definitions are, and discuss whether we can make better definitions. So it is important to understand the definitions. It makes no sense to save time to understand the definitions.

In the study of mathematics, it is impossible to discuss the definition without understanding the definition strictly. So it is necessary to understand the definition so that there is no unknown point. The [goal]-setting is different from understanding the [overall picture], how to use time also differs.

 [(4.4.3.1) Definition of understanding]
 [(4.4.3.2) Is it necessary to understand?]


[en.icon]