(1.7) Summary
In this chapter, we learned about the cycle of learning, and its three phases: [information gathering], [modeling], [verification]. Finally, let's [compare] it with the drawing by [Albert Einstein].

[https://gyazo.com/fcef63bec1e60be54fe5a541c514b800]
Fig: thought of Albert Einstein

	1: Direct experience E
	2: Axioms
	3: Specific claims S, S', S'' are derived from the axiom A
	4: Verification through the experience

❶ The direct [experience] E corresponds to the concrete information in the chapter. I explained that we need to gather concrete information first. Einstein explained that direct experience E is for example data from scientific experiments.


❷ [Axiom] A is born from the direct experience E. Einstein thought that axiom A is born by instinct instead of logic. The thought corresponds to the [pattern discovery] in this book. We do not find patterns by logic. Observing concrete information, discover intuitively. In [(1.4.7.1) Generalization by pattern discovery], I explained that the pattern we found is not always correct. The thought is similar to the thought of Einstein: "axiom is not logically derived."

Einstein thought that the ❸ [specific assertion]s S, S', S'' are logically derived from axiom A. And [verify] them through experience ❹. In [(1.6.1) Varification by making], I told about the verification of your understanding by making a program. Your understanding corresponds to axiom A. Based on your understanding, you make a concrete program. The program corresponds to a specific claim S. Next, you observe whether the program works as expected. The specific behavior of the program corresponds to direct experience E. You compare the expected behavior and the actual behavior. It corresponds to comparing the specific claim S and direct experience E. (*47)

Some of we learned in this chapter do not appear in Einstein's diagram:

	[(1.2) Driving force to cycle: motivation]
	The [concrete] methods of information gathering, modeling, verification
		[(1.3) Three methods of information gathering]
	 [(1.5) How to abstract]
	 [(1.6) Verification]

In chapter 2, we discuss [task management] for maintaining [motivation]. 
In chapter 4, [how to read books] for [information gathering]
In chapter 5, [KJ method]s for [pattern discovery].

---

	Footnote *47: 
		Einstein thought that step 4 also belonged to intuition. Because the relationship between the concept in S and direct experiences E is not logical. For example, there is no logic for associating the word "dog" with what we directly experience when seeing a dog. 
		This idea is related to "[All models are wrong]." Since the model is different from the phenomenon itself in the real world, whether to interpret the newly observed phenomenon with a specific model is not logically determined. It is a [subjective] choice.

[en.icon]