pIntEn English translation started
from [English Project for Intellectual Production of Engineers (-20190522)].
pIntEn English translation started 2018-12~2019-01
2018-12-14 [Facebook 2018-12-14 https://www.facebook.com/nishiohirokazu/posts/10217059709141431]
	First, separate intertwined tasks from one another, as thinking of them as a single entity can make them large and cumbersome.
	It was a mistake to embrace the creation of a Scrapbox with book content and a community on it.
	First, create a book Scrapboxing project [/intellitech-en-private] for yourself.
		This is subject to mechanical rewriting
		[Auto Bracketing]
	Then put [/intellitech-en-private] into the public project [/intellitech-en] at the appropriate time
		The purpose of this is to publish the results of the private experimental project, which will be overwritten as appropriate when the private is updated
	Apart from this, you can create a project for collaborative editing experiments at an appropriate time, but it's not a priority.
		Currently [/test-scrapbook] serves that function.
			This is a private
		It would be more interesting to do it in public.
 Higher priority is the English translation project
		For now, mechanically tag it as "English translation yet" and make it a separate project, then translate it as you measure it.
		I'm hoping to finish translating it over the holiday season, but we'll see how it goes.
	Bracketing is not a priority, because the English version will be published in book style.
		But the translated English text will be completed in Scrapbox format, so you can just refer to the Japanese version and placket it from there.
	You'll need a utility to edit JSON in Scrapbox format, but you can make a quick one.
 	I have a script that puts a specific tag on every page in the project.
 	[Specific tags for all pages in Scrapbox].
 	One step forward until the bath is filled with hot water.
	It has been confirmed that no permission is required to publish the English version (the Japanese version is also free to the author as long as no contract has been signed yet, but it seems like it is being withheld out of kindness).

2018-12-15
 Wife: "Instead of trying to do it seriously, for now, just do 30 or 15 minutes for measurement, and do the appropriate pages, about four chapters."
	You went to the lodge when you were writing, so maybe you can go there when you're translating.
	Conversation 1
	 I said, "I was going to translate from the table of contents."
 	Wife: "Table of Contents should be last."
 	I said, "I thought a table of contents would be easier to generate progress because it's smaller in volume."
		Wife: "The table of contents and the text are formatted too differently to meet the intent of the measurement."
		[Measure first, not progress.]
		Me: "Why is measurement taking precedence over progress?"
  Wife: "When you translate the table of contents and generate progress, it's impossible to estimate how much of a task it would be to translate the entire text."
  I said, "So even if progress is generated, without an estimate of completion, we don't know the percentage of achievement?"
	Conversation 2
		Wife: "We should examine first where irregularities are likely to occur; there are no irregularities in the table of contents, but there are irregularities in the text, such as figure captions."
  I said, "I guess it's important to reduce uncertainty by doing the [uncertain] part first."
  	[Reduce uncertainty by doing uncertain tasks first].
		If you are whacking irregular moles, you will feel like you are doing the same thing all the time and demotivate them, so catch the moles that cannot be defeated immediately and put them in a cage. After confirming the mole's overall condition, we take the mole down.
		Listing where and what the problems are is a priority.
		Once the irregularities are gone, you can throw them to people.

 2Pomodoro's experimental results
	 1 Pomodoro: "Let's just translate 25 minutes from the appropriate place and see how much progress we can make."
 	 →I only made it three paragraphs.
 	 Why? -> When I run it through Google Translate and see that it doesn't translate correctly, I feel like the Japanese sentence is bad to begin with. Then we start revising the Japanese.
 		Example of polishing [polishing for English version (~1 chapter)].
 	 I think this reworking process has improved the quality of Japanese writing, so I feel it is "beneficial", but of course it is slow!
		Next experiment "Don't worry about the quality of Google Translate, just the appearance.
		 One Pomodoro completed 14 pages in Scrapbox pages, one twenty-fourth of the total of 333 pages. If I do this 23 more times, the entire page will be machine-translated.
		Which way should we proceed?
			[Done is better than perfect].
			At 8 pomodoros per day, we estimate that we can do it in 3 days, so we can certainly complete the machine-translated version during the year-end and New Year vacations. After publishing it, we can improve its quality. What we publish will generate social triggers.
			English translation of the text → 23 Pomodoro remaining
 		Replacement of Japanese in the figure → not measured

2018−12−16
	The work of translating the text into English was determined to be cut out and thrown to a part-timer.
	Outsource work that can be outsourced.
	To reduce uncertainty, first [towed bullets].
	Should proceed with minimal man-hours to release
 Where you translate a single page and publish it on Scrapbox, plus more, up to an e-book.
 We'll start with one page to do that, and when we're done, the next step is chapter 0. Once that's done, we can pre-release it as a teaser.
 1 Pomodoro
 	[/intellitech-en/4.3 How to read a page in two seconds to find information]
 1 Pomodoro
 	Install [Typora], create a book project with [LeanPub], and Done to the point of inserting the above page.
 	What to do with the file name of the image
	1 Pomodoro
		Chapters 0 to 1.2, 30 pages
	I guess the next step is to clean up chapter 0, where it explains each chapter of the book, and make it public.
[https://gyazo.com/59fd2a36fede9de07b7cef15e295588c]

2019-01-07
	"intelligent production techniques"
		sluggish
		Literal translation of "Intellectual Production
		I think "creativity" is fine.
		Keep it simple stupid!
		Eventually it became intellitech.
	4 pomodorized and only 2 pages done.
	 It's 250 pages long, so it'll take 500 pomodoros.
	 8 pomodoro every day without a break would take 62 days...

2019-01-08
	4 Pomodoro and a little more, page 4
		I'm starting to think we're going to make it in the three month time frame.
		After all, there is familiarity.
		Since the observation period is still short, let's try this approach for a week for now.

2019-01-13
	4 Pomodoro in a private room at an internet cafe on Sunday
		[Facebook https://www.facebook.com/nishiohirokazu/posts/10217287585118188]
	Progress of 4 pomodoros in a 3-hour course

	2019-01-16
		[Facebook https://www.facebook.com/nishiohirokazu/posts/10217311620359054]
		>I wanted to do it in Japanese at first, but maybe by doing it in English, I won't get too sidetracked (in Japanese, I might develop too many ideas and write too much).
		In the process of translating into English, we have created a new page for those items that we thought, "I expressed what I expressed in Japanese in this way in English, but I think the original nuance is lost if I only used the English words.
		Example: [curiosity].
		I have a page of links to Wikipedia, etc., for technical terms, etc.
		[information asymmetry]
		I really wanted to do something like this for Japanese content.
	5 pomodoros in 1 day (split into 2 and 3 depending on meeting schedule)

	translation
		I'm thinking of making a [burndown chart] or something to keep [motivation] up for translation work, but I'm wondering if anyone has done something similar or if it's just "futile to do that"? I'm feeling heartbroken because I'm falling far short of my expectations and only making progress on one page per pomodoro.
			I didn't make it. I feel like I have a rough idea of the current line in the reST file.
				There is a trick with the line count in reST: if you translate a file with 1000 lines, you get 2000 lines; if you translate 500 lines, the total file is 1500 lines, but the cursor position is at the 1000th line; you translate only 50%, but your progress is perceived as 66%.
					[False progress].
		Is there any way to avoid heartbreak in translation?
			Don't think about it. Keep translating and you'll be done.
			The Python documentation is updated from the beginning of the translation, so I don't mind if I don't finish it.
   With Good Mas, I was able to translate at a more or less steady pace, and once I started to get perspective, I felt more at ease.
 In the end, I didn't go as far as a burndown chart, but I figured "I'd be worried if I couldn't get a perspective", so I made [calculation sheet https://docs.google.com/spreadsheets/d/1escWYnowRf9ieorGEETZNimRsTzbmDS7QU64kF3 Kaxs/edit?usp=sharing].

	1/19
		I worked hard at a comic book cafe on Saturday and managed to get the estimated end date to March.
			https://www.facebook.com/nishiohirokazu/posts/10217334026439192

2019-01-26
	[case study of getting closer to the goal].
	Finished translating up to chapter 1.
		112 pages in terms of Scrapbox at this time.
			In paper pages, 55 pages, so about twice as many.
			The table of contents has 70 headings, so about 1.5 times
