(5.2.3) Make related things close
After you spread the pieces, you look at them for a while. You find pieces that seem to be related. If you find those pieces, you move them so that those pieces are nearby. By repeating this, gradually [a group of pieces seems to be related to one another] gradually forms. (Related: [family resemblance])

What is this "[relationship]"? According to my observation, many people stumble upon this concept. So I explain it in detail in the "What is the relationship?" Section. #TODO link

I learned the method of spreading pieces and moving related things to nearby from "[Way of thinking]" written by anthropologist [Jiro Kawakita]. His method is called "[KJ method]."

He proposed this method in the 1960s. At that time the pieces of paper with glue are not invented yet. So, he used cards of 182mm × 128mm, called "[Kyoto University Information Card]."

When I tried to use the KJ method in 2011, I tried to buy information cards according to the description of his book. However, my wife, who is working at Tama Art University, recommended me to use [pieces of paper with glue]. So I have been using them all the time since then.

 Note: "pieces of paper with glue": So-called [post-it]. Post-It is a trademark of 3M. It was released in 1980.

Many people have experienced the activity that makes pieces of paper and creates groups in a workshop.

However, because the workshops are often limited in time, there is no time to learn the KJ method itself, and it is rare to carry out all the processes of the KJ method.

If you read Jiro Kawada's book carefully, the KJ method does not only moves the paper on which you wrote the information, but there are various processes after that. Especially interesting is "nameplate making" which bundles the collected pieces and adds a nameplate on the top of the pile. Before going into a detailed story, let me first explain the flow of the whole KJ method. ([grasp the whole picture])

 [(5.2.3.1) Flow of KJ method]
 [(Column) Size of pieces]

[en.icon]