(4.5.3.1) Make leverage memo
What do you do when you read a book and find useful information for later use. You may fold the corner of the page, draw a line, or make a summary. Consultant Naoyuki Honda said in his book "[Leverage Reading]" that we should [extract] important parts of books and make concentrated note (called "[leverage memo]") like concentrated juice.

By reading the book, I made the following note:

> 80% of the content of a book is in 20% of the book. Take 80% content in 20% time, make a leverage note and discard the original book. Read the note repeatedly and concentrate it more.

After you make a leverage note, you read the note repeatedly and concentrate further. It is a method to make materials for review.

(Note: Now I am negative about discarding the original. I [digitize and make it searchable].)

I sympathized with this concept and have been making leverage notes for many years. However, there are disadvantages to this method.

One problem is a [disconnection from the context.] 

When you are reading a book, your short-term memory keeps context information related to the information you think important. You think that you can recall from only the content you noted. 

However, as time passes, you forget the context information. When you read the note, sometimes you can not recall what it says, why you think it is important, and where the note comes from. 

If you discarded the original book, you disconnect the note from the context. After you forget the connection, you can not recover it. So it is necessary to record the source and make it possible to read the original when you want to read.

You may feel it takes much time and effort.

Another problem is that the amount increases. When I started to make leverage notes, it was a text file, and the printout is one sheet of A4 paper. So It was easy to carry around and read it in my spare time. However, as time goes, it grows to 8 pages. I thought that this way was not good.

[(4.5.3.1-2) My failure: a service to help review]

[en.icon]