(5.2.4.6) Family resemblance
[https://gyazo.com/a3c832d9b96f39ed63d35fdeda59bfb5]
Fig: A family

"Family" is a group. Not all members of a family have common features. Even if there are no common features to all members, partially common features loosely connect members to form a group.

The word "family resemblance" was made by [Ludwig Wittgenstein]. He wondered if what was called a "game" had common features. He concluded that there is not a feature that is common to all games, but there is a mesh of complex similarities that overlap each other. He called the group connected by family resemblance "family."

In [(5.2.3) Make related things close], I said:

>After you spread the pieces, you look at them for a while. You find pieces that seem to be related. If you find those pieces, you move them so that those pieces are nearby. By repeating this, gradually [a group of pieces seems to be related to one another] gradually forms.

In classification, we determine "features common to groups" ([criteria]) in advance, and determines whether a piece is a member of the group based on the presence or absence of the features. On the other hand, in [group organization] of the KJ method, we focus there is a relationship between individual members and does not require common features. The concept of group organization is very similar to the concept of family resemblance.

You do not need to create a group with common features. 

---

There is an interesting experiment on family resemblance. (*1)

	(*1): Norenzayan, A., Smith, E. E., Kim, B. J., & Nisbett, R. E. (2002). Cultural preferences for formal versus intuitive reasoning. Cognitive science, 26(5), 653-684.

[https://gyazo.com/4c60884f971a6a15541414557d2a0c70]

Which group is the target object is most similar to? In response to this question, European Americans and East Asians gave the opposite answer.

[https://gyazo.com/26318f028c04d1e3c3906a8c03c30b89]

Let us think more detail to understand the thought opposite to you.

These flowers have 4 features:

  Feature 1: Target petals are round. 
  	The 3/4 flowers in group 1 have round petals. 
  	The 1/4 flowers in group 2 have round petals.
  Feature 2: The center of the target flower is a single circle, not doubled. 
  	The 3/4 of group 1 have s single circle. 
  	The 1/4 of group 2 have a single circle.
  Feature 3: Target has a leaf. 
  	The 3/4 of group 1 have a leaf. 
  	The 1/4 of group 2 have a leaf.
  Feature 4: Target stem is straight. 
  	The 0/4 of group 1 have a straight stem. 
  	The 4/4 of group 2 have a straight stem.

In this situation, which group is the left target object is most similar to?

There are two type of thinking:

	Rule-based: Features 1 to 3 do not clearly separate groups. Feature 4 is the criteria to separate these two groups. The target has a straight stem. So it is similar to group 2.
 Family resemblance-based: Features 1 to 3 say the target is more similar to group 1 than group 2. The 3 out of 4 features indicate that it is similar to group 1. So it is similar to group 1.

Another experiment asked, "which group the target object belongs to." In this case, East Asian also makes a rule-based decision. In other words, East Asian thinks that classification and similarity are different, but European American does not distinguish it.

Rule-based thought is easy to explain the reason for the decision to others. You can show a clear proposition that "if the stem is straight, it is group 2." On the other hand, it is weak to noise. In this example, we can separate two groups with feature 4 clearly. However, if there is a noise on feature 4, the rule-based people think that there is no clear criterion to distinguish the two groups. They stop thinking. The thought is also weak to the situation that some of the features are unobservable. If they can not observe feature 4, they also stop thinking.

Family resemblance-based thought is strong against noise and unobservability. However, they can not explain the reason for the judgment simply. One example of explanation is using vote:

	If the target petals are round, one vote for group 1, otherwise one vote for group 2.
	If the target has one center circle, one vote for group 1, otherwise one vote for group 2.
	If the target has leaves, one vote for group 1, otherwise one vote for group 2.
	If the target stem is straight, two votes for group 2, otherwise two votes for group 1.
	Sum the number of votes to determine the group with the highest number.

The KJ method was born in East Asia, Japan. Kawakita Jiro strongly insisted what "it is not classification." The concept of family resemblance helps Europeans to understand the KJ method.
[en.icon]