(5.1.1.5) Do not mind duplication
Some people worried that if they write in a time-dispersed way, they write the same things over and over.

Do not mind duplication. Do not try to avoid duplication. If you try to avoid duplication, you can not write a new piece without seeing all the pieces which wrote in the past. It makes the task big and kills motivation.

Suppose you find there are 3 pieces of the same content after you write 100 pieces. Is it harmful? I think it is not harmful, and moreover, it is a signal of importance.

At three different points in time, you thought independently that the piece is related to the theme. That shows you felt the concept so important. Duplication is useful as a measure of importance.

Duplication of exactly the same content is useful, but a group of similar pieces with subtle differences is even more useful. It is the opportunity to think about what is in common and what is the difference. As explained in [(1.5.1.1) Focus between 'same' and 'different'], comparing similar but different things helps to [deepen your understanding].

Let me give a concrete example. There were two pieces I wrote before writing this chapter.

	Move related pieces closer
	Move pieces which may related closer

It looks similar but is slightly different.

After I found these two, I thought about whether this difference is a meaningful difference or just a notation sway. As a result, I conclude that it is a meaningful difference. The detailed explanation is here: [(Column) You may find a relationship later].

Other than this, some people worried about whether they should align the level of pieces. You can not judge it with just one piece. If you care about such [global constraint], you need to keep all the pieces in your brain. It makes task big. It raises the hurdle of the mind. 

You organize those pieces later, so you do not need to organize them here. In this phase, you should not try to keep them organized. It prevents you [to write all out]. Do not mind and write all out.
[en.icon]