(Column) Naming the pattern
[Douglas Carl Engelbart] who invented the computer mouse raises the following four methods for augmenting (=strengthen, enhance) human intelligence.

	❶ [Artifact]
	❷ [Language]
	❸ [Methodology]
	❹ [Training]

Let's give some examples. By using "❶ artifact" called a calculator, human can calculate faster. The artifact augmented the calculation ability of human. Learning "❸ methodology" of information input, such as "focus to the table of contents first" strengthens information input capability. "❹ Training" is to use ❶ ~ ❸ efficiently.

Among these four, "❷ language" seems to be hard to understand. Engelbart said that language is a means for individuals to break the perception of the world into "concepts" for modeling the world. By the language, symbols are connected to the concepts. Then we can consciously operate the concepts. To intentionally manipulate the concepts is "to think".

[https://gyazo.com/a57b18b83e738c55f43f2795156c6380]
Fig: [Name]([symbol])s are connected to the [concept]s

What does it mean to model the world? It is to observe the world, to find patterns that repeatedly appears, to pick what is useful. Design patterns were patterns that are observed in many programs, and they are named. Making design patterns is exactly creating a language. By making a language, the human can call a structure "a mediator pattern" instead of call that "a structure that one thing mediates all interactions of many things instead of allowing them to interact with each other." By associating symbols with concepts, the cost if thinking decrease.

Some may think this way of thinking is difficult. It is because they think that language is not what they make themselves, but it is given from the surroundings.
Philosopher [Maurice Merleau-Ponty] separate the language being created and the institutionalized language. When you and I communicate, I use words to convey information to you. In the case, I use the institutionalized language. With a metaphor for a programmer, you and I communicate according to the predetermined "[protocol]."

On the other hand, there is no need to follow the protocol when you think. You can add your favorite name to the patterns you find. The design pattern was made like that at the beginning. On the day when the words "mediator pattern" were created, the words do not convey information without explanation. The human creates new languages every day. Only a part of them are going to be widely used, and then it is institutionalized.

	*1 Engelbart, D. C. (1962). "Augmenting human intellect: A conceptual framework." SRI Summary Report AFOSR - 3223, Stanford Research Institute.
 *2 The words "[institutionalized languages]" itself are the languages ​​created by [Merleau-Ponty]. Among those who are interested in philosophy, they are institutionalized. However, I think that the words are not widely famous in general.

Naming the [pattern]


[en.icon]