(4.3.2.3) Measure and control speed
As a major difference from the Whole Mind System, the [Focus Reading]  emphasis measurement. After reading a book, you should record the followings: 

	the number of pages of the book you read
	the time spent to read the book
	how much you feel you understand the book.

By keeping track of those measurement result, you understand your current abilities. You need to understand your ability to control the speed according to the level of understanding you want. For those whose understanding is [bottleneck], it is important to read in optimum speed, not to read faster. 

If you read too fast, you do not reach the level of understanding you want. If you read too late, your level of understanding is high, but the range that you can read in unit time go narrower. By controlling to the optimum speed, you get the best performance without stress.

[https://gyazo.com/e67dbb74e5ff52e3c2c65f3d0f95d7c5]
Fig: [The relationship between reading speed, range and quantity of knowledge]

	[reading speed] = [reading speed]
		up: [slow] = [slow]
		down: [fast] = [fast]
	Three sentences in the middle
		The level of understanding is high, but it is too slow to read the whole.
 	You read whole content with the level of understanding you want in the same time.
 	You read it in a shorter time, but you do not reach the level of understanding you want.
 [quantity of information you got] = [the quantity of information you got]
		[many] = large, large, [few] = small
	[The range you read
		[narrow] = nallow, [wide] = wide, wide
	[optimum speed] = [optimum speed]

If you read too fast and you did not understand enough, you can read it again. However, if you read too slow, you waste your time, and you can not regain it. So, if you do not understand the optimum balance, you should better to read fast. That goes similar to the repetitive reading of the Whole Mind System.

On the other hand, when you read about unfamiliar content, sometimes you can not grasp the content at all. It is a sign that the speed is too fast.

Because it is inexperienced content, you have to read slowly rather than usual, but you read at an ordinary speed, and your speed of understanding can not catch up with. In such a case, [reading aloud] may have good effects. It slows your reading speed. The learning technique "Shakyo" introduced in [(1.3.4.1) Shakyo] is also a way to slow your reading speed. I explain other ways to read difficult books slowly from the section [(4.4) Reading one page in three minutes to assemble information].

[en.icon]