(5.2.4.0) concrete example of group organization
I give a concrete example. I have helped organize the thought of a director of the marriage counseling office. He wanted to summarize his thoughts on communication between men and women. I asked him to prepare 100 pieces of paper and then held a two-hour meeting.

On the day of the meeting, his first voice was "I have considered classification." The classification was as follows:

  Men / Women
  Passive / Active
  Feelings / Actions

It is a typical mistake when doing the KJ method. If you make the classification criteria first and classify pieces according to it, you only reproduce the classification criteria.

So I advised:

 Put aside the classification criteria.
 Spread the 100 pieces on the desk.
 Look at the 100 pieces.
 Find a pair of pieces that seem to be related.
 Move the pair to the workspace.

He looked at the 100 pieces and chose a pair. I asked him, "why do you think these two pieces are related?" Then I listened to what he said, picked-up a keyphrase that appeared in his talk, and asked him to make a new piece with it.

I made him experience the process of group organization through the minimum time.

	Instead of classifying pieces, he looked at the whole pieces, find related pieces and group them. A pair is the smallest group. This activity is the [label gathering].
	Next, I asked him why those pieces were in one group. He explained. And then he created a new piece with a brief description of the group. This activity is the [nameplate making].

In this way, 3 pieces, a group of 2 pieces and its nameplate, were placed in the workspace. I did not bundle it because the number was small.

My next advice was, "are there any pieces in the remaining pieces that relate to these three pieces? If there are, pick them up and put nearby." 

This advice makes the task smaller and the goal closer. The goal of "organizing group" is vague and far away. I created a small task by asking the question of existence in the remaining pieces. The task finishes by looking over the remaining pieces, so it is easier to do. (Related: [Make the goal closer])

While doing this task, he seemed to understand the process of "finding something related and putting it close," and after that, he was able to continue working alone.

After a while, he made 16 groups. I asked "what kind of group is this group?" about each group. And I heard his explanation.

If his explanation is too long, I asked him to say it in a single sentence. If his explanation is a single word, I asked him to add another word. I helped to create nameplates of modest detail.

As a result, for example, the following nameplates were created:

 not interested in the other
 move without thinking
 focus too much on the appearance

Let us compare with what he thought before organizing those groups. He initially thought of a few "[cuts]" that split the whole pieces. This activity is a top-down classification. On the other hand, what he experienced in this group organizing was to move each piece near a related piece and create 16 groups of on an average of 6 pieces. This activity is a bottom-up group organization.

[https://gyazo.com/e48fd5ce4f0dd2f552c11266512eddb8]
Fig: top-down and bottom-up

Later, he organized 4 groups from the 16 nameplates. At this stage, the size of each group is about 25 pieces, which is the same as the result of two splits of the top-down classification. Were the nameplates of those groups like "passive × male", the pair of 2 features of cuts? There was no such thing at all. He got human behavior patterns as nameplates. For example, "people do not want to get out of their own reach." He extracted the pattern from the 25 pieces of specific cases.

Thus, top-down classification and bottom-up grouping are in the opposite direction. What we do in the KJ method is bottom-up group organization. It is because the KJ method is a method for [discovering unknown patterns] and loses its effect if you determine the patterns in advance.
[en.icon]