(5.2.6.3) Making a nameplate when we have a huge number of pieces
Making a nameplate is very beneficial when there are many pieces. In my experience, if the number of pieces exceeds 150, I feel the pain to see them even if I spread them. By bundling and attaching nameplates, I can ease the pain of the information flood.

As a concrete example, I introduce the flow of making this book. First of all, I wrote all out the topic that I think is good for writing in this book. After I wrote all out, there were about 600 pieces. It is difficult to see everything in a glance.

So I first expanded it as much as possible. It was probably about 150 sheets. I made some groups, bundle, and attached nameplates. Then I gradually grasp the whole picture what kind of information is there.

By bundling pieces, I got a vacant space. I added other pieces there. I organize them again. Suppose a piece seems likely to be related to a bundle. If the nameplate explains the new pieces properly, I added the new piece into the bundle. If I feel different, I just put aside. I bundled them with a new nameplate at appropriate timing. (*30)

After a while, I compressed all the information so that I can see the whole at a glance. Now I decide what kind of chapter to make. It is a temporal plan. I think about the relation between the chapters and the order of chapters. At this phase, 600 pieces of information grouped into twelve chapters.

Observing the plan of chapters, I reconfigured it. For example:

	"I thought the section A and the section B independent, but if I dare say B is a part of the A. Can I merge them?"
	"The section C does not have enough amount of information to make it an independent chapter. It is strongly related to chapter D. It might be better to insert it as a column." 

At this stage I had a plan of chapter "meditation," but I omitted it because it does not have strong connections with other chapters. In this way, I made a draft plan for this book.

After that, I divided the bundle by chapter, spread again, and grouped again in each chapter. At that time, the number of pieces increased to about 700. However, I divided them into 10 chapters. Each chapter had about 70 pieces. It was easy enough to handle.

---

In Chapter 1, we compared the process of abstraction, modeling, and pattern discovery with building a pyramid. To stack up a pyramid, we first need to gather stones to be the foundation and then place other stones on them.

To organize information, it is similar. We first need to gather the information that becomes the foundation, then put the abstracted information on it. To make a nameplate, we first gather pieces to make a group. And then put a "nameplate" on it. It is very similar.

Footnote (*30): Strictly thinking, you may feel that we should unfold a bundle and compare each piece in it. I did not do that, because it is time-consuming. It is a demerit of bundling explained in [(5.2.6.1) Merits and demerits of nameplate making]. However, the demerit is a physical constraint. In the future, we may have a nice digital tool to organize information. For example, if you use a foldable outline editor and it allows you to fold and unfold with one-click, it works well to this purpose.
[en.icon]