(5.2.5.2-2) Conflict is not only one
The conflict is not only one. There are many conflicts.

[https://gyazo.com/caab7ed032d988ecce78aec18cb91189]
Fig: two conflicts

In the figure, there are two conflicts:

 The conflict between a white circle and a black circle
 The conflict between a smooth circle and a spiky shape

Both the black circle and the white spiky one conflict with the white circle. However, the two are not the same thing. It is not similar either.

There are two features: white/black and smooth/spiky. I add a black spiky which was not in the previous figure. The [whole picture] goes like the following figure.

[https://gyazo.com/75cdec6c64c18cd269857324144b833d]
Fig: Conflicts between four objects with two features

There is nothing in common between the white circle and the black spiky. You may look the pair are [irrelevant]. It is a lack of relation.

If you feel a pair is conflicting, they are closer to one another than a pair which you do not even feel they conflict.

So far, I talked about two features: white/black and smooth/spiky. Real objects in the world have many more features. We can not figure out how many features in all.

In the following, we consider a simple model in which there are only two values in one feature. It is called "[boolean lattice]." Let's observe how the number of features affects the overall picture. The lines in the figure connect objects that differ only in the value of one feature. When there are three features, it goes a three-dimensional cube. Our cognition is limited, and we feel difficulty on the high-dimensional lattice.

[https://gyazo.com/9fcbc7464466adc85fd566234b410952]

Fig: boolean lattices with different number of features

With the word "[conflict]," we sometimes imagine there is only one feature, such as the conflict between good and evil. It is a simplified [model]. In the real world, there are many features.

We already saw objects with four features in [(5.2.4.6) Family resemblance].

Let me express the four features of the target flower as 1111.

	The 4 flowers in group 1 are: 1110, 1010, 1100, 0110
	The 4 flowers in group 2 are: 0011, 0001, 0101, 1001

Now, let us see the 4-dimensional boolean lattice again.

[https://gyazo.com/a6fec999b1f0d3e96be5fbbcb90c8d5d]

Fig: flowers on the 4-dimensional boolean lattice

You may feel that group 1 is closer to the target than group 2. The cause of this feeling is not the family resemblance. The difference between group 1 and group 2 is that group 1 includes 1101 which near the target and group 2 includes 0001 which far from the target.

When we think of conflicts, we tend to image one-dimensional conflict and think that the conflicting pieces are distant one another. However, the real world has many attributes. In that situation, the pieces in conflict are closer than the pieces that are not even in conflict.
[en.icon]