(4.5.2.3) Get the tools of thinking
You are accumulating [experience]s every day. You understand many things by experience. However, you often do not have words to express what you understand. By reading books, sometimes you find [name]s to describe such unnamed concepts.

For example, when my wife is discussing at the graduate school of business administration, she thought there should be a line. However, she does not have the words to express the concept, and she could not communicate her opinion well.

Her concept:

	There is a line
	Until something is less than the line, the business is bad
	After something goes over the line, the business is good

In my word, it is a boundary between profitable business and deficit business.

She talked with her friends about it and the friends said: "Oh, that's a [break-even point]!" Then she got a new word. Once we get the name of a concept, we can search it on search engines. The name makes it easier to get relevant knowledge. 

By getting those words, you can think effectively using those words. The words are attached to the shapeless concept like a handle. It helps to grasp the handle and operate the concept. We can not carry shapeless water as it is, but if we put it in a container, we can carry it.

"[Design pattern]" described in [(1.4.6) Design pattern] is an example. Competent programmers do [trial and error] to make a program to fulfill their [purpose]. By accumulating those [experience]s, they [find common pattern]s. However, if the pattern is unnamed, they can not describe their thought for others. The design pattern is a set of named patterns. By attaching the name, we can talk with the name. For example, "you should use the mediator patterns to implement this purpose."
Even when you think alone, the name makes patterns easier to handle. It improves your thought.

Taking examples from this chapter, the words "[shelf-viewing]," "[Syntopic Reading]," and "[rhetorical afterimage]" are the handles for interesting concepts. In my case, "[fast reading]" v.s. "[slow reading]" and two purposes of reading: "[finding information]" and "[building understanding]" are handles for concepts I want to describe. ([Footnote for 4.5.2.3])

In the [(Column) Naming the pattern], I mentioned that [Douglas Carl Engelbart] states the [language] as one of four methods to enhance human intelligence. By creating a [model] that [abstract]s the events in the world and giving it a [name], we can [manipulate] the model in our mind. It is the [augmentation] of intelligence by languages.

By reading books, you sometimes think "Oh, I experienced it! I did not know the name!"

For example, you have experienced watching bookshelves at book stores. By reading this book, your experience and the language "[shelf-viewing]" is linked. The language is also connected to the importance of book-choice before reading the book. The connection makes it easier for you to do the action with a clear [purpose] consciously.

Your shapeless experience is packed into a [box], [trigger]ed by the stimulation of the book. With the language [handle], you can operate the box easier. In [(1.1.2) Modeling and abstraction], I told you the action of [stack]ing boxes. In this way, you can create boxes, and you can stack them.

[en.icon]