(2.2.4) Prioritize important tasks
A commonly mentioned idea about what to [prioritize] is "[prioritize important tasks]." Let's dig into this.

"Prioritize important items" is the third habit out of seven habits proposed by [Stephen Richards Covey] in his book "[The 7 Habits] of highly effective people." *12 *13

 *12 Covey, S.R., 1991. [The 7 habits of highly effective people]. New York, NY: Simon & Schuster.
 *13 I choose the words "prioritize important items" from the Japanese version published in 1996. In the original English version, it was "[Put First Things First]."

According to the definition by Covey, "urgent" is the tasks that seem to have to respond immediately, "[important]" is the task which is related to the achievement of your mission, values, high priority targets. For example, the ringing phone is "[urgent]." It is not important. Importance depends on the direction your individual aims.

Suppose if you do not finish a task today, your company can crush. It seems important at first glace. It is important to the company owners, but it is not always important to you. For you, it may be more important to find a new job than to do the task, or it may be more important to back home soon to care your sick wife.

Covey explained tasks in four quadrants, whether it is [urgent] or not urgent, whether it is [important] or not important. Many people have seen the urgent and important matrix because many people referred to it since then. Let's explain using that matrix here.
[https://gyazo.com/a549a93258ff95b3f249db10bd53f61a]
Fig: Four areas of urgent and important

❶ is the urgent and important tasks. Of course, you need to do the tasks in top priority. In [(2.1.4.2) Make a base], I told you to prioritize tasks you must do today. On the other hand, if you have many ❶ tasks every day, your life is being chased by the task all the time. It is a tough life. To reduce ❶, you need to invest in ❷ which is important but not urgent.

Where can we get the time to do the tasks in ❷? For the new task, it is necessary to take time from other tasks. We can not take time from urgent and important tasks in ❶. You need to take time from not important tasks ❸ or ❹. For example, say No for the urgent but not important task in ❸, and assign the time to the other task in ❷.

In [(2.1.4.2) Make a base], we focus on the tasks we must do today. Now you need to think it is correct. Are all tasks in the list really important? You need to find not-important tasks and say "No" to them. 

To say "No" to ❸, and to assign that time to ❷, you need [independence]. You need to control the situation rather than to react to the situation. Because the tasks in ❸ ask you to do, but the tasks in ❷ do not. If you just react to your external events, you consume all your time to the tasks in ❸ and do no ❷ at all. You need to start a task by yourself from the inside, instead of triggered by stimulation from outside you.

In this section, did a brief explanation of the third habit. In the explanation of Covey, the boundaries of "urgent" and "important" seem to be clear. However, it seems there are many people whose boundaries are not clear. For example, when you received a mail "Please do X immediately!", is it urgent?
The text of the mail say so, but in the decision, you did not judge with your own head. You are following the judgment of others.

 [(2.2.4.1) "Recently notified" is not "urgent"]
 [(2.2.4.2) Missions ​are verbalized bottom-up]
	[(Column) 7 Habits]

---

 Footnote *14: Regarding the individual aims, it is described in the second habit "start with the [purpose]."

[en.icon]