The blog was dismantled and became a social networking site and Scrapbox.
Considerations I wrote on Facebook when I started using Scrapbox in 2017.
　The functions that blogs once had can be divided into "flow" and "stock" functions.
　The role of the flow part, or the immediate distribution of information, has been eclipsed by the rise of Twitter and Facebook.
　With respect to the remaining stock portion, existing blogging systems are weak in their support for discovering relationships between individual entries.
　　The total amount of value increases only by less than linearly as the amount of written material increases.
　Scrapbox seems to be the most serious within the scope of observation in the direction of how to turn stocked information into structured information.


[2017]-04-09 [Facebook https://www.facebook.com/nishiohirokazu/posts/10211785329605239]
>I think I might discover something if I dig up "Why I am impressed with Scrapbox while I was not impressed with various services as a place to migrate from Hatena Diary?
>If we divide the functions that blogs used to have into "flow" and "stock," the flow part, in which readers are notified of updates to what they have written via RSS, etc., and they read the latest posts and send trackbacks, which stimulates discussion..., has been eclipsed by Twitter and Facebook. The role of "stock" has been eclipsed by the prosperity of Twitter and Facebook, and what remains is "stock." The existing blogging system is weak in supporting the discovery of relationships between what has been written.
>I think Scrapbox seems to be the most serious about how to transform stocked information into structured information within the scope of observation. The reason why I'm tickled.
>In fact, when you post to Hatena Diary, you only need to check a single checkbox and the notification will be sent from Hatena to Twitter to Facebook, so there is not much difference if you write in Scrapbox and notify Twitter with a bookmarklet or something.
