How did you get involved with Scrapbox?
from [/villagepump/about the elation of learning about Scrapbox].
	My relationship with Scrapbox (not exuberant)
	I blogged on Hatena Diary from 2007 to 2017.
	I felt Hatena Diary's service was about to end and was looking for a place to migrate to (compared to Hatena Blog, Qiita, and Medium).
	I created a project [/organize-ideas] on 2017-04-03 to put together a "how to organize ideas" project, but it wasn't quite right.
	 I'm tempted to write about Numpy and other technical stuff, but it's not "how to put ideas together" so I'm in trouble -> make a generic [/nishio].
  2017-04-09 "Scrapbox seems to be the most serious within observation about the direction of how to turn stocked information into structured information."
	2017-05-26 [Cybozu] Scrapbox event [Scrapbox Drinkup] was held at the Nihonbashi office
		Participation note: [ScrapboxDrinkup].
		I heard here that the projects should be combined into one, and I consolidated them all into [/nishio].
		I figured out a few tricks, such as "link roads together with links instead of categorizing by tags," → wrote 2017-05-31 [Scrapbox Best Practices].
	2017-06-04 [/mitou-meikan] made
	2018-03-07 Hatena Diary has not been updated at all for a year and [/nishio]has exceeded 1000 pages. I wrote my last greeting to Hatena Diary. This is the epoch of "I parted from the means of information transmission called a blog, which I have been doing for more than 10 years, and moved to the means of a wiki.
	The Intellectual Production of Engineers] will be released in 2018-07
	　At that time, the publisher thought that the author's official page should be static HTML that the publisher or author could control, not on a third-party service like Scrapbox, but after discussion, it was decided to "put the static HTML on a domain controlled by the author and point to it from the book, while pointing to Scrapbox from that page. After much discussion, it was decided to "put the static HTML on a domain controlled by the author and point to Scrapbox from the book, but put all the main content in Scrapbox".
	　We wanted to put the entire contents of the book in Scrapbox, but we could not reach an agreement with the publisher.
　Thus, the weight of "public personal project" is large since it is an alternative to blogging.
　　If you don't feel comfortable writing in a public forum, you can write in a private forum, I have a private project of course.
　2021-04-29 [operation to let acquaintances into /villagepump/personal Scrapbox] joined bluemountain[/villagepump/bluemountain.icon] Private Project
　Here, for the first time? I understood the fun of multi-person projects.
　2021-05-16 Creation of the Unexplored Junior Common Private Project [/nishio/unexplored-junior-2021-boost-conference].
	2021-07-18 Participation in a public multi-person project[/villagepump].
