(Column) Two kinds of tacit knowledge
Discussion about the meaning of tacit knowledge is too abstract, I think that it will not lead to your intellectual productivity improvement too much. However, since there seem to be many people who are interested, I will explain it in the form of a column.

When [Michael Polanyi] proposed the concept of tacit knowledge in the book "[Personal Knowledge: Towards a Post-Critical Philosophy]" in 1958, he used the expression of both "[tacit knowing]" and "[tacit knowledge]". In Japanese, "knowing" and "knowledge" are both translated as "[CHISHIKI]", so it is difficult to distinguish between the two. If I dare to translate it with a softer word, those would be "AN-NI-SHIRU-KOTO" and "AN-NI-SHITTE-IRU-KOTO".

[René Descartes] suggested methodological skepticism in the book "[Principles of Philosophy]" in 1644. 
Since it the linguistic thinking process of "doubting what I think is natural" has been emphasized in the Western philosophy.
[Immanuel Kant] believed that this suspicion (criticism) is the most important task of philosophy.
He published the book "Critique of Pure Reason", "Critique of Practical Reason" and "Critique of Judgment" in 1781 to 1790.
The word "Critical Philosophy" in the title of the book of Polanyi means this kind of philosophy.

Polanyi thought that new things were not created by explicit and linguistic "criticism" alone. He published another book "[The Tacit Dimension]" in 1966. In the book he talked about an implicit non-linguistic dimension, apart from the explicit and linguistic dimension. He wrote, "Tacit knowledge is the implicit perception of something that will be discovered someday but is hidden for now" (p. 48) "(Tacit knowing is) your own feeling that you are approaching to a solution."(p.50).
(Notice for non-Japanese readers: the quote and page number are from Japanese translation.)

Polanyi assumed mainly the process of scientific discovery. In this regard, his thought is not conflicting with the thought of ​​Descartes or Kant. The difference depends on the difference in the nature of the field between the science which can obtain knowledge by making a hypothesis and experiment and the philosophy which can not be experimented.

A management scientist [Ikujiro Nonaka] published his book "[The Knowledge-Creating Company]" in 1996.
Based on Polanyi's ideas, he divided knowledge into tacit knowledge and formal knowledge. And then he added the dimension of whether knowledge resides in individuals or in organizations. It is to discuss knowledge creation within organizations.
While Polanyi's interest focused on knowledge creation of individual scientists, Nonaka's interest was knowledge creation within organizations.

Nonaka believes that the subject of knowledge creation is not an organization but an individual, and personal knowledge creation is promoted by social interaction within the organization. Then he proposed the following four knowledge conversion modes. After those initial letters, the model is called [SECI model].

 [* [Socialization]: Converting the tacit knowledge of individuals into an implicit knowledge of the organization]
 [* [Externalization]: Converting tacit knowledge to formal knowledge]
 [* [Combination]: Concatenating formal knowledges to make systematic formal knowledge]
 [* [Internalization]: Converting formal knowledge to tacit knowledge]

In this context the term "tacit knowledge" refers to what can be converted into formal knowledge by expressions. So to speak, it is 'empirical knowledge that has not been translated yet'. This seems to be different from Polanyi's "sense of feeling if you are approaching the solution of the problem". On the other hand, the feeling was acquired empirically, so there is also a claim that Polanyi's tacit knowledge is part of Nonaka's tacit knowledge.

My personal feeling is that we will get closer to solving the problem if we do not equate or try to encompass these two usages.


