(6.2.5.6) Use disconfort to arrange cards
I wrote about [KJ method] in [(5.2.3) Make related things close] and [Young's method] in [(6.1.2.1) Young's method to make ideas].
In those method we write information on the card and then arrange those cards.

As we are arranging the cards, we often feel that there is something wrong with putting this card next to this card. In the case, we move the card and then feel, "It looks better to put the card here."

During this process, we did not speak the reason why it is wrong to put it there or why it is good to put it here [beforehand].
In this process we are trying to find out what is not yet become word by focusing on [discomfort].


In the KJ method, after arrang the cards saying "It seems to be good here", ask yourself "What is the reason for arranging like this?"

There was similar questions in [Symbolic Modelling]. Those are "What is the relationship between X and Y?" Or "Is X and Y the same or different?". 

At first we represent relationships between cards that have not been written yet.
The relationships are not word yet, but now those are an observable existence.
By asking yourself about the representation of the relationships, those are encouraged to become words. 
Finnally, we write a short sentence explaining the relationships, make it as a nameplate and bundle the cards up.

I think this is the reason why Jiro Kawakita said "we should not classify the cards". If we arranged cards according to the existing classification criteria, we answer the existing classification criteria to the question "What is the reason for arranging like this?".
There are no effect to facillitate verbalizing things that are not yet verbalized.

I think this is the most important part of KJ method.
I taught KJ method people who do KJ method for the first time.
Many people use the already verbalized reasons when arranging cards.
They even ask question "where is the correct place?" with a language.
For newcomers, it is a question that comes naturally.
However, using verbalized reason break the usefulness of the KJ method.

This is a technique to help you put into words what is not yet in your mind. If you look outside yourself for the right answer, you will never find it.

[en.icon]
