(6.2.5.4) Matching with a dictionary
What I felt particularly interesting in [Thinking At the Edge] is the step of using a dictionary. 
First, you choose a important keyword in the short sentences which you described your felt sense.
And you draw the keyword with a dictionary. 
After that you compare the explanation of the dictionary with what you wanted to say. 
The word written in the short sentence is a temporary pointer to the felt sense which can not express well in yourself.
So in many cases there is some misfits([IWAKAN]) with the explanation of the dictionary.
Let's focus on that misfit.

[https://gyazo.com/fc0a1ac0899dab0cd596e32675f6748f]
	1: You have a felt sense.
	2: Make a short sentence.
	3: Draw a keyword in the short sentence with a dictionary.
	4: You may find misfit(IWAKAN) between them.

For example, I have a metaphor: 
	There is a gear in my head.
	The gear sometimes doesn't engage to the other gear.
	In that case, the gear in my head rotates at high speeds.
	If I engage the gear to the other gear, the teeth of the gear will be lost.
	So I need to slow down the rotation of the gear.

At a point, I thought that the "slowing down" is so called "meditation" in the world. (*37)

However, the feeling did not match with dictionary definintion.

I drew the word, "meditation" in a dictionary. 
The dictionary says, "closing eyes and deeply and quietly turning thoughts".
I felt strong discomfort.

The felt sense I tried to express with the word "meditation" does not need to close my eyes.
Also, the phrase "to turn thoughts" is trying to rotate something and does not match the image that slows rotation. In this description in dictionary, the only words I could accept are "deeply" and "quietly".

In other words, "deeply" and "quietly" are the words that fit to express my felt sense. This seems to correspond to "slow down speed". To the contrary, the opposite words of  "deeply" "quietly" should correspond to "rotating at high speed".

 "Does it rotate noisily?"
	"What is the opposite word of 'deeply'? 'Shallow'? 'High'?
	Both are unconfortable.
	'Floating' or 'not keeping one's feet on the ground' are acceptable. (*37-2)

Thinking developed as above. By drawing keywords in a dictionary, comparing and focusing on the sense of misfit(IWAKAN), we can clarify what we want to say. This is an example of promoting understanding by comparing similar items. I wrote it in [(1.5.1.1) Focus between 'same' and 'different'].

*37: In Japanese, there is also an idiom "the rotation of his head is quick" (=he is clever). The idiom is usually good meaning. However, now I believe that we can interpret the idiom in a bad meaning.
*37-2: "Floating": I feel misfit to the word "floting". A dictionary show me some words "frivolous feeling", "flurried feeling", "flippant feeling" and "preoccupied feeling", but none of them are comfortable for me.

[en.icon]
