自己啓発
Someone disliked self-help, but when I talked to him, he hated "paid self-help seminars," not "self-help."

関連
　[Deteriorated copies spread.]
　[Parable of the Forgeries]
　[Just kidding!]

自己啓発
>[* personal development] is the development of an individual's skills, competence, attributes, and personality through education, training, and other activities --- [https://www.oxfordreference.com/view/10.1093/acref/9780199298761.001.0001/acref-9780199298761-e-1913?rskey=OCBHp4&result=1202 Personal development - Oxford Reference]
"the development of an individual's skills, abilities, attributes, and character through education, training, and other activities."

If we interpret "self-improvement" in the sense of this definition, statements such as "I don't like self-improvement" or "I don't do self-improvement" make me not want to get too close to them, although they are, of course, a personal life choice.

https://en.wikipedia.org/wiki/Personal_development#Aristotle_and_the_Western_tradition
Aristotle and the Western tradition
The Greek philosopher Aristotle (384 BCE – 322 BCE) wrote Nicomachean Ethics, in which he defined personal development as a category of phronesis or practical wisdom, where the practice of virtues (arête) leads to eudaimonia, commonly translated as "happiness" but more accurately understood as "human flourishing" or "living well". Aristotle continues to influence the Western concept of personal development to this day, particularly in the economics of human development and in positive psychology.

Confucius and the East Asian tradition
In Chinese tradition, Confucius (around 551 BCE – 479 BCE) founded an ongoing philosophy. His ideas continue to influence family values, education and personnel management in China and East Asia. In his Great Learning Confucius wrote:

The ancients who wished to illustrate illustrious virtue throughout the kingdom first ordered well their own states. Wishing to order well their states, they first regulated their families. Wishing to regulate their families, they first cultivated their persons. Wishing to cultivate their persons, they first rectified their hearts. Wishing to rectify their hearts, they first sought to be sincere in their thoughts. Wishing to be sincere in their thoughts, they first extended to the utmost their knowledge. Such extension of knowledge lay in the investigation of things.

Aristotle and the Western Tradition
The Greek philosopher [Aristotle] (384 BC - 322 BC) wrote the [Nicomachean Ethics], in which he defined [self-development] as a category of [phronesis] ([practical wisdom]) and that the practice of [virtue] ([arete]) leads to [eudaimonia]. Generally translated as "happiness," it is more accurately understood to mean "human flourishing" or "living well." Aristotle continues to influence Western concepts of self-development to this day, especially [the economics of human development] and [positive psychology].

Confucius and the East Asian Tradition
In the Chinese tradition, [Confucius] (ca. 551 BC - 479 BC) established an ongoing philosophy. His ideas continue to influence family values, education, and personnel management in China and East Asia. Confucius wrote in "[Da Xue].

The people of ancient times, desiring to display admirable virtue throughout the land, first set their country in good order. He who wishes to improve his country first improves his family. Wishing to improve their homes, they first cultivated their characters. Desiring to improve his body, he first corrects his mind. Desiring to correct his mind, he first tried to be sincere in his thoughts. Wishing to be sincere in his thoughts, he first expands his knowledge to the fullest. Such expansion of knowledge was in examining things.
	Mastering oneself = [shushin].
