(6.3.4) You can learn from anyone
People with knowledge and few people in the world, people with a lot of knowledge tell people with little knowledge, there are people who think that this flow is unidirectional.

[https://gyazo.com/7ec58923a8d2fcb4aab553fa2e142824]
Person who know much teach people who know less

But the thought is wrong. Please look at the following figure.
[https://gyazo.com/c8966bf82b160766e2dcc82e30716323]
You can learn from person who have less knowledge

The vertical axis is the amount of knowledge, and the horizontal axis is the field of knowledge. In the total amount of knowledge, Bob is less than Alice. However, because Alice and Bob's field of expertise are different, Bob knows things which Alice does not know. In such circumstances, Bob can teach Alice, even if Bob has less knowledge.

This way of thinking is very important when you want to take advantage of the viewpoint of others. For example, let's say you made some software and showed it to a customer. Even if you make a good software, it may be criticized by customers. At that time, you think that the customer does not understand the goodness of the software and may explain how wonderful the product is from your point of view. Let's say the customer finally agreed. Was it good action?

Was the purpose that you showed the product to customers was to increase sales? Or was it to find a blind spot that was not visible from my point of view? Suppose you explained the product, persuaded the potential customer, and got the money. It contributed to sales, but it did not contribute to brush up ideas.

The difference in opinion is the opportunity to notice the blind spot. If you do not accept information which is inconsistent with your own point of view, it is the [Seeing] state of [U theory]. I wrote about it in [(6.1.2.3) Otto Scharmer's patterns of change] and [(6.2.2.2) Advantages and disadvantages of framework]. In this state, you cling to your existing frame and do not accept information from the viewpoint of others.

In order to get out of this state, you need to understand other's view. To understand it, you need to convert the unverbalized feeling of others into words. You can't understand information while it's still in someone else's mind. You need to take them into your mind with as little distortion as possible.

Here, the method of verbalization learned in the plowing phase will be useful again. You can practiec your skill to extract information from your mind by yourself. And then you can use the skill to extract information from other people's mind, even if your opinions disagree with others.