(Column) Knowledge Distribution Chart
I drew a chart in [(6.3.4) You can learn from anyone] with the field of knowledge on the horizontal axis and the amount of knowledge in that field on the vertical axis. I call this the "[knowledge distribution chart]." Since I first used it in 2011, I have found it useful for expressing various ideas.

[Radar chart]s are used for similar purposes. There may be many readers familiar with radar charts. The two radar charts in the figure below represent the knowledge amount of each five field of two people with different fields of expertise.


[https://gyazo.com/c1dc70a839ae9e3a08dcd4832ac155f7]
Relationship between distribution chart of radar chart and knowledge

The pointed part is that person's strength. Five graduated line represent five knowledge fields. Next to the radar chart, I draw a line chart with five knowledge fields on the horizontal axis and knowledge volumes in that field on the vertical axis. This expresses exactly the same content. This line chart is smoothed and the two are superimposed is the distribution chart of the knowledge of the right end.

The reason I do not use radar charts is that it is not an appropriate expression of the knowledge field with graduated lines of limited number. 
There are countless numbers of knowledge fields, not just a few. Knowledge field has no clear boundary. The knowledge field is not independent, and learning a certain field will also increase the amount of knowledge in the near field. In order to express this, a smoothly connected distribution chart with no clear axis is preferred, instead of expressing it with the values of several axes. **

Knowledge field is not fixed, it is increasing newly every day. To represent this, it is more appropriate to use an open straight line instead of a closed circle.

In the space of paper, it is represented by one-dimensional axes, but in reality more space of higher dimension is spreading.

**: 
If you have ever read "[Blue Ocean Strategy]", you may recall the [strategy canvas] of Cirque du Soleil. In comparing a competitor's business with your own, the axes of comparison are not fixed but newly created. If you are implicitly ignoring this newly created axis, you have a blind spot.

This column placed after [(6.3.4) You can learn from anyone]
