(6.4) Summary
In this chapter, we have delve into the process that creates ideas, that is, the part directly related to "production" of [intellectual production].

Many people think of learning as bringing something outside of yourself into yourself.
And they also think of creating ideas as bringing something inside of yourself out.
They think learning phase and creating phase are opposites.
But I don't think so.

We compared James Webb Young's "How to create an idea," Jiro Kawakita's "HASSOUHOU(How to make ideas)" and Otto Scharmer's "U theory." in [(6.1.2) Predecessor's idea creation methods]. And found common pattern that the process of creating ideas has three phases: plowing phase, seedling phase, and growing phase. The plowing phase is closely related to the [information gathering]. The growing phase is closely related to the [verification]. 

Information gethering and verification are elements in the [learning cycle]. The learning cycle and creation process of ideas is not the opposite, but about the same thing. In other words, what happens at the moment the idea buds is a new connection, a discovery of the association between different things, a discovery of patterns, modeling and abstraction.


[https://gyazo.com/19f3456f6337234f374c664c2f5eeeba]
	[Plowing/Seedling/Growing] (re-listed)

[https://gyazo.com/b3d14f5734e5b381b8839bdb0771550d]
	[Cycle of learning] (re-listed)

In the middle of this chapter ([(6.2) Collect information first]), I devoted plenty of pages about how to languageize things that have not yet been translated into language. Trying to be objective and correct from the beginning is an obstacle to creating new things. At first we use subjective sense of discomfort, physical sensation and personal metaphor to bring thing that no one has seen. It is afterwards to polish.

In Chapter 5, we learned that the KJ method as a method of summarizing enormous information. We learned it is also a method of intellectual production that produces a hypothesis in [(6.1.2.2) Jiro Kawakita's HASSOUHOU]. Together with chapters 5 and 6, we learned that it is important for crerating new idea to find subjective associations rather than objectively categorize them. The KJ method is a useful technique to [cultivate] information and prepare an environment that ideas easily grow.

The polishing method varies depending on your application, but introduced the concept of MVP as a method that can be used in a wide range of fields. You can start from small experimentation and gradually improve it. It is an example of [Small Start Principle]

In Chapter 7, I will talk about frequently asked questions "What should I learn?" Learning is intellectual production, so it can be interpreted as a business strategy of what to produce and value. Let's think about how to connect your intellectual productivity to results.
