(7.1.2) The difference of "right" between science and mathematics
The correctness in science is a bit different from the correctness in mathematics. In science, many people think that it is correct that they have been confirmed and tested many times. However, in mathematics, even if you experiment and confirm it over and over, it is not guaranteed that it is correct.

For example, let's see if we can verify whether the claim that "all prime numbers are odd" is true by conducting an experiment in which we randomly select one prime number and see if it is odd. In the first experiment, let's say that 971 is chosen, which is odd. This is an odd number. In the second experiment, the number 683 is chosen. This is also an odd number. If we repeat this experiment 100 times and all 100 times are odd, can we say that "all prime numbers are odd" is correct?

It is not correct in mathematics. Even if it is affirmed 100 times, there is a possibility that it may be denied in the 101st time. Prime numbers exist indefinitely, of which only 2 is even number. This experiment continues to return the observation that it is "odd" until we choose 2 with a very low probability at "Choose one prime at random". If 2 is chosen and it is observed that "there are also non-odd prime numbers", we can conclude that "all prime numbers are odd numbers" is incorrect. However, it is mathematical position not to think "odd" as odd numbers, even if odd numbers are observed hundreds of thousands times. *6

With mathematics' "It is not correct even if it repeatedly be observed" position, a claim based on observation of experimental results would be incorrect unless all cases were observed. However, this is a problem in science. For example, to prove that carbon becomes carbon dioxide when it is burned, it is not practical to burn all the carbon to check.

So in science we changed the standard of correctness. First, assertions that are not denied by experiments are assumed to be correct. And, as we repeat the experiment, the more we observe the results that support the assertion, the more reliable that assertion will be. *7

[https://gyazo.com/ae183e5419220a49a661bb5442f2c599]
Mathematical viewpoint and scientific viewpoint

If you adopt this criterion, you can increase the reliability of the hypothesis by repeating appropriate experiments.

[https://gyazo.com/2246e7a27bb30eeaa3658519143febc9]
Experiment to raise the reliability of the hypothesis

Hypothesis that increased reliability in this way, scientist express it is "correct".

*6: This is similar to [software testing]. By failing a test, you can notice that a bug exists, but a successful test does not mean that you have proved that the bug does not exist. I introduced Dijkstra's words in the column [(Column) Consistency of knowledge] in Chapter 5.

*7: The experiment must able to determine that the claim is incorrect. Here, I am chewing on the concept of [falsifiability] proposed by [Karl Popper], a philosopher of science.

