Scrapboxing experiment of fragmented written materials
from [fragmentary writing].
Scrapboxing experiment of fragmented written materials
2018-07-28 It would be interesting to import fragmented writing into Scrapbox one page at a time [linkage].

2022-01-28 
	When I wrote this, I had a book translated into Japanese in my brain, but when I was translating The Art of Intellectual Production of Engineers, I started thinking that I could translate it myself from the English version, which is out of copyright.
　Because you don't have to translate it exactly.

2022-01-29 
　supplementary explanation
　　In 2018, I had a "paper book of Japanese translations" first, which I would cut and scan, and then experiment with it in a private setting, or add to it to the extent that I could claim it was a citation.
　　In the process of translating "Intellectual Production Techniques for Engineers in 2022," it was decided that "I would like to explain the source of the word 'conducive,' but I don't have a Japanese book at hand, and Wikisource has the original source and its English translation, so if I use this English translation as a basis, it will be copyright-free.
　So here's what I mean.
　　Choose a classic whose English version is published copyright-free.
　　Machine translate it and put it in Scrapbox.
　　While reading it, write comments and give links.
	I tried it at [The Art of Worldly Wisdom].
  I don't translate everything.
  　Even if the entire book survives the test of time for hundreds of years, that does not mean that every part of the book is equally valuable
  　Filters for the modern era according to Nishio's subjectivity.
  　　Anyone who wants to read the full, unabridged text can read the published original.
  　　If you want to read it in Japanese, just machine translate it.
  　　In other words, the way I can add value is by adding my subjectivity, which is my differentiation and source of profit.
  　First time, a little too much (=20), seems better to add a little at a time
  　　I thought about it, but then I reconsidered that there was no way I could do it that "steady and diligent", so it was more realistic to do it all at once and gradually process the searches and social triggers as they floated by.
2022-01-29
　I translated ~49 at the last minute.
　　The neat thing is that it's ~50, but the page is split there.

2022-01-30
　I added another 50 for now.

2022-02-12
　I was thinking of Scrapboxing the table of contents of my books, but I'll do this one first.
	Last time xcix was last, so this time from c.
	First, paste the entire page into a text editor and modify the following
	　The pages are separated and inscribed in the middle of paragraphs.
	　The title is being reused as part of the text.
	　Numbering is confused with part of a word in a sentence, so put a line break immediately after the word break.
　Translate 5 to 7 articles at a time and post them on the Scrapbox source page.
　　I'm stretching for a few seconds while I translate.
　　I once tried to select the next translation item at this time, but I had to stop because I got confused about where to go back when I went over the word count.
　　I didn't measure it properly, but it took less than 15 minutes to get here.
　Scrapbox-like interesting titles and dangle them out on the page.
　　This will give you about 50 new articles on the top page.
　　This could have been a mistake.
　　　It's a pain to open the page and look at it.
　　Uh, could this be a situation where [Incremental Reading] is appropriate but Scrapbox doesn't have the functionality to support it, so it's not being done?
　What's at stake.
　　When there are links from one page to many pages, choosing one to view requires "decision making".
　　　However, in the case of Twitter, where content appears one after another, or in the case of books, where content appears one after another as you turn the pages in a one-dimensional array, humans dislike decision-making and prefer content to appear without having to make a decision.
　　I was thinking of Incremental Reading, that one also has fragments, but the decision of which one to read is not made by a human, it is determined by the interval repetition method.
　　Before adding 50 new ones, I had to assume that the 50 I added last time had already been processed, but halfway through I added more!
　　I ended up reading the previous additions today, from top to bottom.

2022-02-16
　About preachiness
　　It's hard to make the connection between "do what, don't do what."

2023-03-01
 Ended after a year of not being able to continue.
 
