Dyson Sphere Program 2022-01-29
[Dyson Sphere Program]
	Last time I played it (2021-01), it was too early access and the achievements didn't exist.
		I'll play it again, as it seems to have improved a lot.
	2022-02-16
		The true sphere Dyson Sphere was completed.
		[https://gyazo.com/aafe111b60839c93f2344afed44073da]

----
2022-01-29 Day1
Last time I played it (2021-01), it was too early access and the achievements didn't exist.
[https://gyazo.com/c2ce4a1d92636de015414e93f6bae842]

I don't know if I'm going to get a selection screen like this, or what to look for to choose, so I'll just use Seed 1.
[https://gyazo.com/865845209c8248cb70ae6770c5d3e449]

Emergency production facility. Make 3 in parallel when something is suddenly needed a lot.
[https://gyazo.com/c176723eae068c2814fd3bff8cbedd65]

They say things like, "You reached ~ in 4 hours and 4 minutes." Do you want them to play repeatedly by making them do a time attack?
[https://gyazo.com/d8a7436ca238ec7f7935c3d9483e4a10]

The flow velocity monitor is still in simplified Chinese, I can read it, but if this is in English setting, English-speaking people may not be able to read it.
That said, the font is cool, maybe I should play it in Chinese to enjoy it the most.
[https://gyazo.com/26f1d77e9e2722d44f27eaae0ba00627]

Not too many planets.
[https://gyazo.com/9a5af654959a269292203c3df16b9cde]

This seems to be the new spray function, whereas in Factorio, the chips were put into the production equipment to enhance it, this one is applied to the raw materials to enhance them.
[https://gyazo.com/60839b96ced4cc6f3997c868d956241a]

I came for the silicone.
[https://gyazo.com/a6b0ebdafb772ef5634e077c0ae28ab3]

And by the way, another planet.
[https://gyazo.com/7d0e3f9d095379beaa6ae5c5acfa45c7]
Lava.
[https://gyazo.com/23c377965ef94fb30c72f8c05dfb4f4b]

[https://gyazo.com/74f3cb706641fe6a5217d5df7c07d7be]

I saw it stacked.
[https://gyazo.com/b9d6c0226385c59d91ae1da1e6efac37]

Try a flowmeter.
[https://gyazo.com/62a4a405ff5ae662e7837f1c4b8d3ba2]
[https://gyazo.com/a1853fb22cda2a6c02ae88e381ba4ab4]
[https://gyazo.com/6c98f9a5a880e7fba7985e958db21220]

Queue the red and green studies and leave them alone.

Explore power generation options
 I see, so geothermal power generation uses lava.
 　So a planet with that lava could use the lava for unlimited power.
 　I can't use it on the main earth because there's no lava.
　Wind and solar power will be laid out on vacant land.
　　Difficult to build near the poles because of large mesh distortion.
  Let's line up the wind turbines here.
　　If you put solar power here, it won't generate power during the winter.
　　　I wonder if the amount of electricity generated changes with the angle of the sun in the first place.
    Doesn't look like it's going to change.

Increased spray, does a recipe that uses multiple ingredients need to be applied to all of them?

--- Day 2
 Yellow cubes are now available for production and a line is being built.
 Reduce dependence on thermal power generation by increasing wind and solar power generation
 Gas planet development to take hydrogen from neighboring planets.

Petrochemicals are needed
　Solids can be put in storage and you can grab dozens of stacks and move them all at once, but liquids can't, which is why they need to be designed even better.
 　Huh? Liquid will fit in the box?
 　　It will fit. One liquid tank can hold 10,000, while a storage tank can only hold 600, 20 x 30 stacks per stack.
 　　So in the end, the low volume of one stack makes hand-held transport more difficult.
　The supply of hydrogen to make red cubes is in short supply, and I would like to change the line when X-ray cracking becomes available, but location constraints...
　Putting that aside for a moment, let's start with plastic production.

Can feed itself from the power grid.
　This ensures that the player's energy is not depleted if the player continues to produce
　There they are cleaning and eating while producing with the player character.
　Fewer points of failure compared to creating a production chain with conveyor belts
　Moreover, it kindly displays the time of completion of creation.

I used up all the titanium I carried on hand.
　I should have been ready for interplanetary transport of titanium before I ran out....
　Well, we just need to do the hand-held transport again.

I took 60 stacks of titanium.
 Construction of an interstellar station begins.
 　1 pomodoro left alone and material is ready.
 　　Alloys that use sulfuric acid and titanium cannot be made by hand, so I made them separately.
 　　When I finally put it all in my inventory, it will give me two stations as planned.
 　Also, I need a vessel, I don't know how to do that.
 　　I made it.

Ready to accept
[https://gyazo.com/7e90b028d80154f96eecbd2d0ac7a23e]

I get anxious before I do interplanetary travel because I haven't forgotten anything.
　They also built a geothermal power plant.

The power situation on the other side of the planet, as expected, has worsened considerably with station charging.
　But it's 25%, so we're not losing power, OK.
　 You were right to bring a geothermal plant, the plant would have stopped if you tried to use quicksand and wind for interplanetary transport.
 Oh, it's not good enough to finish charging, the station has a lot of standby power.
 　[https://gyazo.com/9b9a2a3d8701fd68a63b151725b4bb68]
 　Oh, no.
 　[https://gyazo.com/64706ff44e2341eed7b92cf7228b2d1b]
 　The light blue squares are storage batteries discharging due to the power demand from connecting the stations.
 　And even though the station was fully discharged, power was still tight because the station was not fully charged.
 　As the station is recharging, the power consumption is going down and the storage batteries are being recharged because there is once again more room to spare.
 　In other words, the planet was able to ship titanium with enough power to spare.
 　I wonder if we could ship rechargeable batteries since we are generating power only from non-exhaustible resources.

Roughly built rechargeable battery production line
[https://gyazo.com/90e3004840c3ee084d14ca73cdacd5d1]

We returned to our home base, which also had excess power.
　Well, if you want to make yellow cubes more quickly, you need a lot of chemical plants.

I'm thinking of building a plant to make plastic from oil fields a little further away, since we'll need a lot of plastic again in the purple cubes anyway.
　Plastic plants have been built, but pulling them in from afar with conveyor belts is a hassle.
　I didn't do the drone transport on the planet the last time I played, but maybe I should use a drone to transport what I used at the remote factory.

I've done the research on gas giant use.
　And then hydrogen and graphene can be made via methane hydrates (FireIce).
　I need a charged battery to make a pumping device, I made it on the lava planet, I should have just poured it into the station, I'll have to go back and get it.
　I came for it.
  123 were made, what stopped them.
  　They forgot to supply the steel plate in the final battery process.

Harvesting of gas giants begins!
　[https://gyazo.com/2bf75b800add64f283c7a6c0aac05642]
　[https://gyazo.com/edb7f7fd0acf745d26ead91295a3cd01]

The first oil field we started mining has already decreased the calculated volume to 0.55/s.
　Graphene production plant is connected here.
　But the sulfuric acid plant is also connected, so we can't just stop it at the root.
　Oh, the graphene part was already stopped.

I thought I'd cue up the processing before I went to bed anyway, so I added more and more, and it got to about 20,000 seconds. I added more and more, but for some reason, the time did not change from around 18,000 seconds. Is it a bug in the system that "when there are too many queues, not all of them are displayed" and "only the time to be displayed is added up"?

--- Day3
I left it overnight, I think it was done in the morning, but I didn't have time to look at it until lunchtime.
　With so little copper left, they developed a new mine.
　Lack of silicon after making purple cubes
　They need to be transported from other planets.

evening
Started shipping silicon.
Intra-planetary drone transport started.

I've increased the production facilities for yellow cubes, so my handiwork will be making purple cubes.
　Lots of fiber is being made in automated production, but silicon is also needed for the chips to be combined.
　They're just pouring the silicone into the factory, not into the chests, so Icarus can't receive it.
　Oh, and if the station's silicon acceptance clears, the inventory will be spit out.
　I took out the silicone that had accumulated, it splattered all around me.
　I used up all the fiber I had used, but then I realized I could use the tips, so I cue-loaded them to the point where I ran out of silicone.
　Over 1,000 cases.
　It would take at least 3,000 seconds.

Long abandonment playstyle
 I don't think we should make the production of green cubes fully automatic, but we should first identify what can't be made by hand.
 　[green cube automation]
 　Ah, double hydrogen, that bothers me.

--- Day 4
Purple cubes, 2000 were made.
Yellow cube, diamond production line stopped.
Early oil wells are drying up.

FireIce (methane hydrate) is being turned into graphene, and the byproduct hydrogen tanks are full.
I'm just using the nanotubes now and putting them away in storage, but I might as well make an automatic downstream one.

What you can't make with a replicator
　steel
　silicon crystal
　Titanium Alloys
　diamond
　sulfuric acid
　deuterium
　plastic
　organic crystal
　graphene
　nanotube
　Strange Matter
So here's what I've already researched.
Conversely, if only this area is mass-produced and stocked, the rest can be made by leaving it alone during the day.

Production of blue cubes was unexpectedly halted due to a shortage of iron.
　I packed them in a large chest.
　They said they ran out of inventory because they left it for so long.

--- Day 5
Intra-planet drone transport of crude and refined oil
　Slowly decreasing production without warning signs, so it's a hassle to re-pull the pipeline when you realize it.
　Petrochemical plants are usually large, making it difficult to run pipes.
　Drone transportation solves the problem of plastics and organic crystals that are being produced automatically, but production is somehow slowing down due to a decrease in upstream oil production.
　　(PS: This is not a solution because less oil will be transported by drone, and it's easy to deal with after you realize that you just need to connect the transport station to the new oil field)

They built a particle accelerator and started producing double deuterium.

Power began to get tight, so wind farms were going halfway around the world to line up solar power instead of poles.
　It's easy because there is a copy and paste of the blue print.
　Power fluctuations were reduced.

The green cube study is done.
　but production requires the production of Strange Matter, which cannot be done by hand.
　To do this, we need a particle container as a material.

--- Day 6
Hydrogen is clogging up and not enough refined oil is being made to produce plastic...

Maybe we'll build one big plant that produces 5 colored cubes over the weekend.
It's all going to need to be mass-produced together in white cubes anyway.
We're ready to make green cubes, but we can't move forward with green research if we can't produce large quantities.

--- Day 7 Saturday
Automated production of Strange Matter has started.
　2 to 3 per minute

What's next, producing Kashmir grass?
　Casimir crystals require hydrogen, graphene, and titanium crystals.
　Combine that with titanium glass, which can be made from glass, water, and titanium.

Hmmm, the problem is that the plant that makes graphene from methane hydrate is in a remote and inaccessible location, let's get this out of the way.

Production of titanium crystals has stopped.
　No plastic is coming from upstream.
　　Surprisingly, I thought "there will be plenty to pull from here," but the graphite is depleted.
　　Let's make this a drone transport, because we'll miss it again if we pull it from a different part of the city.
　　There's an empty slot station relatively close by.
　　Some stations were supplying.
　　It would be nice to see what and how much is stocked in the drone logistics network.

Titanium crystals are also used in the production of yellow cubes
　How much to allocate to the production of green cubes
　We have yellow in stock, so we'll have to swing it all to green once we have it.

hydrogen
　Graphene from methane hydrates in the ratio of 1 hydrogen 1 graphene 2
 Production of Casimir crystals requires graphene 2 hydrogen 12
 We need to pull hydrogen from somewhere...
 Oh, let's just use drone transport.
  but there was just an extra one nearby, so I took it from there.
 There was a surplus of hydrogen in general and a surplus of electricity, so there was no choice but to burn it and process it into hydrogen fuel.
  I wish I had the ability to prioritize the power grid.
  I want to implement a factory that processes hydrogen into fuel while there is surplus electricity, and burn it when there is not enough.
　Hydrogen is 20 per stack, 9 MJ per stack.
  Hydrogen fuel is made of 10 hydrogen, 54 MJ, 30 per stack, 200% efficiency when used to fuel itself?
  It's more for my own use than for thermal power generation.
 10,000 hydrogen in one liquid tank
  Processing makes 1,000 pieces, 33.3 stacks.
  If you're putting it in a larger storage unit, it's a little more storage efficient, but not that attractive.

Production rate of Kashmir crystals is 3.8/m

Next, we'll make titanium glass.
　Glass was made on the side of the appropriate stone production point, and titanium was transported by drone.
　Eventually the stone will run out and stop, but right now the production of Kashmir crystal is 3.8/m and the production of Titangu glass combined with it at 1:2 is over 14/m, so there is a large surplus. We can have more buffer and relocate when the stones die out.

Began producing circuit boards and microcrystalline components and materials for processors
　They call it microcrystalline.
　22.5/m for microcrystalline parts and 76/m for circuit boards
　Triple the production of microcrystalline parts and leave it at that?

Load up on making purple cubes with processors and fiber already stocked in the hand production queue because it's unhealthy to be home all the time, and go out for exercise.

Power consumption has increased a lot, but there is still room for more.
[https://gyazo.com/7ea4e9a12770d0e510ec09d856417da8]
 If we can't afford it, we'll use the pre-charged storage batteries we're making at Mercury for now.
 If you want to increase the amount of electricity generated, you can easily lay down solar cells and scale them up.

Just got back from a walk.
　Discharging batteries with an Exchanger has priority over normal generators.
　In other words, it's done with wind turbines and such turned off.
　　no way
 　It should be a priority between wind and other forms of unlimited energy and thermal power.
　Therefore, if I wanted to use it properly, I would first place a stationary charger with a reasonable amount of power, and when it is fully discharged, I would use it as a method of quick charging.

Automatic production of green cubes has begun.
　By the way, I have 24,000 red cubes in stock, any chance I don't need anymore?
　Let's stop for a moment.
　Green cube production is less than 5/m
　　Slow production of quantum chips
　　Is the production speed of plain filters the bottleneck?
　　Both titanium glass and Casimir crystals are more in production.
　　Let's add more production equipment.

Bottleneck Considerations
　Cases where processing speed is the bottleneck
　　The downstream conveyor belt is empty even though both raw materials have reached it.
　　This can be eliminated by increasing production facilities.
　　However, the demand output to upstream increases, so the bottleneck moves upstream.
　　If we improve all of them, the final bottleneck will be the ore production rate.
　　　This is going down slowly, so it's easy to end up with a problem here.
　　Increased production spray
　　　Increase production without propagating bottlenecks upstream
　　　I see what you mean - that's how the game is designed.

Copper reserves on the planet today are less than 1M.
　It seems like a good idea to set up a spaceport by the main mine we're using now and pour in from another planet.
　I had all the ingredients and was able to make it instantly, civilization has advanced!
　There's 20M on Mercury.
　　Let's go take a look.
　　There are 9,000 charged batteries in the w
　　I poured the copper ore into the spaceport.
　　Maybe other ores could be poured but with YAGNI.

Current Inventory
 Don't we have a screen where we can see the inventory?
　Yellow 10000
　purple 4000
　Red 2000
　blue 10000
　There is no green inventory, and the company is producing at 24/m while consuming raw material inventory.
　　1.5k per hour
　Oh, no, I shouldn't, I was producing purple elsewhere.
　　18/m
　　I'm going to miss this one, so I'd better move on.
　　If we move the warehouse in between, we can use the conveyor belt.
[https://gyazo.com/432e8559f7569f9ebec465c1a607e2cf]
[https://gyazo.com/37b580941a24ca25ca72a75e0354f895]

Ah, well, just as titanium crystals are used for both yellow and green, processors are used for both purple and green.
　If you make purple fully automatic production, it could take away resources for green, and it would be best if there was a device that could adjust the distribution ratio of items with a slider, but it's a pain because you can only split it into 1/3 with a splitter.
　Is it better to supply in storage to avoid overproduction?

Started researching white cubes.
　Green production settled at 15/m.
　It's a little over two hours, so if there's no trouble, I'll be done when I go to bed and wake up.
　Plain filter production speed is very slow, 5 units in a row, but bottleneck.
　　No, Strange Matter.
　　　That's the upstream part of it, the motors and stuff.
　　　Improvements.
　Production speed of gravity lenses is the bottleneck
　　Doubled.
　　One plant consumes 1 Strange Matter in 6 seconds.
　　When the accelerator is running at full capacity, it will produce one unit in 8 seconds... what? What's missing?

I sprayed the production of green cubes to increase production.
　I see, I was under the impression that one spray item was one spray, and I thought it would be a hassle to set up a spray supply process, but you can make one manually in 0.5 seconds, spray 12 times with one item, and stock about 600 at the facility itself.

I just finished researching the white cube.
　Oh, you need anti-matter to make white cubes?
　We need 4000 of each color for the white cubes, so we'll have to sort them out first.
　Purple is about 200 short.
　We have to create anti-matter while we wait for the 4,000 green ones to accumulate.
　You didn't go this route last time, saying that you wanted to create a Dyson Sphere, which is the theme, rather than collecting and clearing white cubes.
　I thought I didn't have to do the fusion power research because it's a dead end and we have too much electricity, but you need it to make rockets!
　Building a Solar Sail
　　Glass, Circuits, and Graphene?
　We could have rocketed it.
　　Let's see, how do we design the Dyson Sphere?
　　They didn't study the stress system.
　　　You might not need it if you just want to clear it, but you still want to make the Dyson Sphere.
　　　So let's do the research, we'll need an additional 2,000 green cubes.
　Solar sail production line, only used for miscellaneous purposes, but the launch is slower.
　Photon, 0.2/m, so increasing the production speed of this is by far more important than other cubes, etc.

--- Day 8 Sunday
I went to bed and woke up.
　87 photons, 0.1/m remains
　Rather, the solar sail is already running out.
　　
[https://gyazo.com/c47c1decae65e4a0a76c92fea8917630]

What's missing is plate glass.
　We're getting 80 photons from a production that was only a few stacks in storage, so we know we're OK if we produce 50 times as much.
　The current inventory of flat glass is not enough, so it has to be produced somewhere else.
　I've done the math right. All you need is 3 sheet glass, 1 circuit, and 1 graphene.
　 I see. Well, that would deplete the sheet glass.

For now, what we want is not continuous power generation, but a certain amount of photons.
　Then there's a way to increase the light-receiving side and scale it.
　But first, we need to mass-produce plate glass for now.
　While I was using it, I finished my research on stress systems.
　　I want to use rockets more and more.
　Looking at the manual production, it looks like the frame production is taking a long time.
　　Automated production.
　Di-hydrogen fuel was also produced automatically.
　We decided to stop producing our own solar sails as raw material and stop launching the ones we are producing now.
[https://gyazo.com/1247ffb382aae6239ade17457852a202]
[https://gyazo.com/ff1d0fe2abe1570a597e93a85e87d2a1]
I'd love to switch to first person view and do some photography.

By the way, there's no sign of a power crunch.
	In a sci-fi setting, we want energy, so we build the Dyson Sphere.
	I guess I'll just keep producing white cubes, clear the game, and then make the Dyson Sphere as a hobby. w
 Do we set up a rocket production line for a future that launches a lot of rockets?

I decided to research vertical construction to level 5 because I can research with the extra blue, red, and yellow cubes.
　Can be stacked with lots of warehouses, etc.

I need a quantum chip to build a rocket, but this is also the material for green cubes, it bothers me.
　I have a surplus of titanium crystals and have produced up to Kashmir crystals elsewhere, but I might as well refactor them with drone transport.
　Kashmir crystals are a bottleneck in the current green cube production line.
　Use Kashmir crystal line on large lots?
　No, the line to make quantum chips from Kashmir crystals, titanium glass, and processors is first cut out by drone transport.
　　This would allow more freedom in the placement of the process of making Casimir crystals.
　　Both processors and titanium glass are already on the drone transportation network.
　　Ah, but you don't have enough Casimir crystals to afford to put them on the transportation network.
　　　Hydrogen, graphene, titanium crystal
　　　Hydrogen is not so reliable, but it's all there.
　　　There is a buffer of titanium crystals in large storage that will flow to the drone transport.

No? Is this not enough hydrogen to begin with?
　Hydrogen was flowing from the drone transportation network to the Casimir crystals, but the rate of hydrogen production couldn't keep up, and the hydrogen buffer, which had felt like an impediment, was now empty.
　This reduced the production rate of Kashmir crystals.
　I thought it was safe to assume they were transporting it from Jupiter, but even that is being depleted?
　Vessel on the demand side was too busy transporting titanium and silicon to transport hydrogen.
　　They say that the inventory on hand is depleted, but they are not smart enough to schedule transportation.
　The graph shows that they increased production of Casimir crystals 50 minutes ago, but 20 minutes ago, they drastically decreased and are only being produced intermittently.
　　So the hydrogen has been depleted here.
　　We've increased the transport, so it should be back after a while.
　Hmmm drone transport algorithms are so dumb.
　　I wish they would give priority to those that have the lowest inventory to demand ratio.

Hmmm, before the rocket could make the frame, the solar sail had reached the end of its life and they were all gone.
　I thought it would be easy to make a few frames, but I was surprised at how many are needed.
　Launching the solar sail inventory that we're accumulating right now.
　　About 2,000 pieces
　　Lifetime is 100 minutes, so set about 10 gravity lenses.
　　　Around 1,000 units were launched.
　　　No, there's a surplus due to the slowdown of Kashmir crystals, let's put them in now.
　　Photon production at this point is 0.3/m

Not enough hydrogen at all.
　We have 3,000 inventory of deuterium, so we'll stop bringing it from the methane hydrate cracking plant to the accelerator and start bringing it back to the station.
　Hey, the ship is idle, but the hydrogen is not being remotely transported, why?
　　Lack of inventory on Jupiter's side...

Enhance the final assembly process of rockets with increased production spray!

Photon is now at about 600.
　Started producing anti-matter.
　Began production of white cubes.

If you click on the Dyson Sphere design screen, it shows the number of rockets needed.
　110 rockets are needed for each vertex and 80 rockets for each edge

I got one side.
[https://gyazo.com/67a758eaf988796eec68fd1cbc5b9083]
Well, now we won't have to say, "I noticed that the production of solar sails has stopped and they are all gone.
	Because the solar sail adsorbed in the Dyson Sphere will not disappear.
	I'm not sure if I'll be able to clear it today, but I'll have enough when I go to bed and wake up.

I started researching the last one, the "let's have it show us what percentage of progress we're making, rather than calculating it" kind of thing.
[https://gyazo.com/343ab4359bff86bc301a77596c685d4a][https://gyazo.com/cc59c56a694b176e8473711bc9ccc6f2]

Progress, it was obvious from this.
[https://gyazo.com/1a2649cc4125d378a544abb9305b36f1]

With 75% progress remaining, that is, 3,000 more cubes to go, the current white cube production is 3/m, so 16.7 hours to go.
	This will be cleared tomorrow....
	The bottleneck is photon production.
		The solar sail will be launched and gradually increase in productivity, but, well, it won't be that intense.
		It might be a good idea to reinforce the solar sail production line before going to bed today.
At any rate, I'm not getting enough exercise, so I'm going to leave it alone and go for a walk.

Not particularly meaningful.
[https://gyazo.com/bc478e0142042c875dd31c62c0a7dbf4]
[https://gyazo.com/46f3ffb7a74b8f3389a074860dbd6405]
[https://gyazo.com/25a07411ea3996d1a9651effd09a6226]

[https://gyazo.com/e989c3c07a87bf762e9731235e9f012a]

Can it be bigger?
[https://gyazo.com/228e637c8b215df7f15c8a628510eeab]

40% remaining
 Photon, 9/m during the day, stops at night, so 6 more hours as half, 9am Monday morning.

--- Day 10 Monday

Cleared.
[https://gyazo.com/2b5b832e6468ab6a70578fd270d9e1be]

[https://gyazo.com/0f166ee9c80b1eec717fecffe2a9ed46]

--- Day 14 National Day
Refactoring of placements with large numbers of drones
[https://gyazo.com/443a99b40aab9ab6c8459be526866f1f]
　Drone transport in the planet was used for the first time in this play.
　Very useful for refactoring, as it can temporarily transport large quantities of supplies without worrying about belt conveyor handling

Me "I'm clear!" My wife, "Did you make the Dyson ball?" Me "No, I didn't..."
[https://gyazo.com/5c13953ea9223fe6855313c379dd12b5]

More and more transport stations are being added.
[https://gyazo.com/7fc473f0f3a1e4aa9b4495f8adda8586]

I see. This is an artificial star (anti-matter power generation).
[https://gyazo.com/a516ecc3912e61fdcfe0d12fd676c4dd]

All that's left are the milestones of the explore-and-discover system.
[https://gyazo.com/a1b76b5bf1731baf7112f5830f5f5dbc]
	I don't know how you do interstellar travel.

I'm going to go check out the other planets for a bit.
	Dyson BallPassing by and looking closer.
[https://gyazo.com/0a47dd368f3abe7885b19928fb8c25d3]
[https://gyazo.com/6f8a9098d165eaa6dbea225335061088]
[https://gyazo.com/9ff2175de6cabdbdcd7e5bb82a5b75cb]
[https://gyazo.com/15cc4bdeb7252040137fcee0c7b7fb62]

Lava Planet (Power Generating Planet)
	Silicon mining was down.
	There were 1,000 charged batteries accumulated.
	Earth's power was finally temporarily below 100% when they flew drones all over the place.
	　Just switching the ray receiver to power generation mode would be enough to cover the cost.
	　not likely to be troubled for the foreseeable future

Items for warp can be made from green cubes.
　Gravity lenses are more scarce now, so that route is more affordable.

I hadn't researched warp drive yet.

Similar to the "to be right is to be uninformed" in Wordle the other day, the increase in availability when viewed locally is often also detrimental.
This is a game, so fun is paramount, but often in the real world there is the trap of the [diligent fool] who thinks he has done his job by building a line that should not have been built!
Producing something means reducing upstream buffers and increasing downstream buffers, and whether that is a good thing depends on the situation.
Working diligently with the assumption that production is good is not good.
If a problem can be solved by waiting, waiting (i.e., allocating valuable time resources to other purposes) may be the optimal solution, but when humans have a problem in front of them, they tend to narrow their vision to solving it.

Well, aside from that, in the case of the leave-it-alone-on-weekdays-and-play-on-holidays style, one way is to buffer a larger amount of intermediate inventory to improve response to line change decisions, meta-gameplay.

I wrote this text while waiting for the warp study.

Now that we can warp, let's go to another star system.
[https://gyazo.com/43659a7c263cc1743083c0b5257ea649]
attached
[https://gyazo.com/041c5cfd57803f29020ad70bd5963550]
Blue planet like Earth, I thought.
[https://gyazo.com/b30187e913b4949c2009aeb718da55a7]
What the hell, it's all the ocean.
[https://gyazo.com/83559de6ad253a2a97bbb3deebf64a2f]
I've tried reclaiming it because there's no place for it, but how do you dig for ore?
[https://gyazo.com/e2e361642154272505614b4b7222eeb6]
I also reclaimed resources (although it is slightly fantastical to reclaim resources on the ocean floor and have them come to the surface).
[https://gyazo.com/bb538e08a7461bc8f9bdac7357d220c8]
I see, a rare resource that is calculated only in the deep ocean floor. It will be carbon nanotubes. I don't need it...
[https://gyazo.com/d914fbbb976b82204e9078b269916857]

See the star map
[https://gyazo.com/ee3b7dbfb6d6962dd59b6ed55ffa50a3]
 If you go 12 light years away, you'll find the resources you want.
 　What it takes to build an advanced mining machine
 　Mining a large area, which itself can be a drone landing site.

Hydrogen fuel does not burn fast enough.
　I ran out of energy while at warp and went out of warp with 4 light years left.
 There was enough fuel in absolute terms, but the combustion rate was a problem.
 So if you're going to fly around in space, you need to produce anti-matter fuel.
 Fly normally for a while to accumulate energy and then warp again.
 　Good thing there's plenty of room for warp items.
 [https://gyazo.com/7481593e0765205869b1049c49460030]

target star
[https://gyazo.com/7aca3f34a9a4bb2de2f2762dd08ca59b]
The desired resource, there it is.
[https://gyazo.com/d0ce3bb50ffac906dd9432acd276bfdc]
Take all you can carry and go home.
[https://gyazo.com/57884404ec8d9424769b18d821af0137]

On the way back, I still ran out of energy with about 7 light years left.

Fix the flaws in the line, start producing anti-matter fuel, and go to the park for some muscle training.

Well, I guess I'll go exploring again.
　Milestone things to look for are kimberlite, fractal silicon, organic crystals, magnetic monopoles
　I don't think the last one is the only one you can't get nearby, the one you can only get from a black hole or a white dwarf, maybe.
　Well, let's start close by and get it done.

Try out the new mining machines that can now be made before exploring.
[https://gyazo.com/b5b0ee15c45a32572530677ba2ffaf4b]
[https://gyazo.com/c78795207420c0fd505a5081174f5a5a][https://gyazo.com/81f316066208335cb91df9151ac26ddf]
 I'm thinking we could install these in vein in various locations on the new planet while building a power grid with wind power, and collect them at stations in the main location.
 　Do that and then pull the conveyor belt if you want to.

resource search
　There are magnetic monopoles and fractal silicon in a neutron star eight light years away, so let's get that first.

Hmmm, antimatter fuel lasts very long compared to hydrogen fuel
　54 MJ of hydrogen and 7200 MJ of antimatter.
　Although the burn rate is faster, depletion still occurs during warp if the research is not advanced.
　I started with hydrogen to compare this time, but I should have started out with anti-matter to slow down the gauge loss.

New Star, Fractal Silicon Discovered
[https://gyazo.com/a75278c6bec2e3b6293b8454973e66f4]
 Fractal silicon produces silicon crystals, but honestly, we don't need them because they can be made by ordinary processes.
 Can magnetic monopoles be particle containers?
  I'm glad that would compress the process so much, but I'm not sure I'd want to transport it from 12 light years away for that.

I forgot to bring wind power, so I'll take thermal power.
 You can only have 50 per stack.
[https://gyazo.com/d7ef8ff1145f9a60fc7ad4e63f5481cc]

Mistake of disarming too soon because I was afraid to go past at warp...

next star
[https://gyazo.com/f83891eaf9a544da59998356aaa3579d]
Also the next star, lush!
[https://gyazo.com/2188d449199e1ba470ef1fa9d5463a03]
[https://gyazo.com/84874b46d3a94a7bc904042d0d20a960]
All the milestones are in place.

The Dyson sphere is not so bad.
　I thought we'd move on while we explored, but not by much.
　Looks like we need a more serious line.
　Maybe when it's working well, rocket production is about 5/m, and it takes 120 or so per vertex.

Magnetic monopoles, 50 per stack, 10 per particle container. This should have been a particle container before shipping.

I ran out of fire ice.
　Hydrogen is being depleted because we are launching more and more rockets with double hydrogen.
　Let's add more and more orbit collectors!
　If not, it will be made from crude oil.
　　The first stage of processing crude oil has no other options, so there's no harm in doing it, but the more advanced processing may not be the optimal solution because of the options available? If we consume refined oil for hydrogen, we might be in trouble later.

Current Photo
[https://gyazo.com/392837456e0bc379b8f8201be41be954]
[https://gyazo.com/a55f263175c0d6f504dbccb89dc0a78b]

Eight Orbit collectors in a row.
　I was waiting for the sunrise, thinking it must be cool, but it was on the backside.
　　Which is the back?
　　The sun side shines golden and cool.
　　Outside is blue, dark and not great.
　　If you wrap it up in a sphere, it's all not good...
[https://gyazo.com/c89ea9875292d3f3e5745542e9f2e7cc]

Lava planet, so close to the sun, so powerful.
[https://gyazo.com/0c10863c2ff5d6d66e7261c9869e3fa1]

Another oil field dried up and plastic production stalled.
　I don't calculate it on other planets in the solar system, so when this one runs out, we'll have to transport it a long way...

Electricity demand finally exceeds supply.
[https://gyazo.com/dbb0284a830dd4e141dbe5c240b79ad5]
　I changed the ray receiver to power generation mode.
　　It doesn't generate much power...
　　Max. 14 MW?
 Tried discharging the battery.
 I see. Installed batteries that were discharged due to lack of power are being recharged.
 Discharges at 45 MW.
　Looks like 23.4 GJ is the maximum charge right now.
　Take your empty batteries to the power generation planet.
　　I was thinking of having it automatically transport empty batteries, but I don't have any slots available.
　I made sure to charge it at 45 MW.
　　But the battery production rate hasn't caught up.
　　Well, there are 1,500 per chest.
　What happens when you put a battery in an Energy Exchanger at a site where the world is fully charged?
　　Discharge as described.
　　The power will be so surplus that it will shut down other power plants.
　　Hmmm... hard to automate that one...
　Antimatter fuel, now there are 20 bottles, and it seems that each bottle has 7.2 GJ.
　　Use 3 bottles and the world is fully charged.
　　The power plant is 72 MW, so can it last 100 seconds?
　　The current generation is 141 MW, which is half the power of the entire world's electricity demand. w
　The rechargeable battery line consumes resources at the point where the battery is made and does not consume the rest.
　　Antimatter fuel is consumed because, well, it burns.
　　Either way, power after a full charge is wasted either way.
　　Then I'd prefer rechargeable batteries that don't consume resources.
　　Either way, it's the same as manually adding fuel when you notice a power shortage.
　We still have wind and solar power to cover our needs for now.
　Graphene is piling up, so next time we run out of power, we'll burn it.

I broke the old small mass place.
[https://gyazo.com/ab414d8d1b0a626454d29af5e0c666e8]
	Solar sails are released again at full life expectancy.
 　Structure points will not be restored.
[https://gyazo.com/0efb832a573e9a49c7ebfbd366000994]
[https://gyazo.com/8c603ad2eb2d328f32293efa8b22fc6f]
[https://gyazo.com/0fc5178d1cf2299b32b92b46ef7f2092]
[https://gyazo.com/06ffbadc1f4f95be0a16a5c265c89386]
[https://gyazo.com/eb5b3f8c75f8452198af0ae8cae6cf04]
[https://gyazo.com/2940392be207336f5db796dce21a4223]
[https://gyazo.com/cd72904b2de1f859a756f4d8944f0855]
[https://gyazo.com/3cf909511f7bb8108afe78d0c0a919f0]
[https://gyazo.com/8bec169041e4183401db94261cd2f54f]

--- Day 16 Sunday
The study of the stress system of the Dyson sphere has progressed to lvl 6 and can finally be covered to the top.
	Since we have stopped research, demand fluctuations are eliminated and we can concentrate on rockets.
	Deuterium fuel was at 12.5/m, which was a bottleneck, so I built two more at a distance to triple the fuel.

current record
[https://gyazo.com/5fa2f1b9e75f89c7ca00ff40991068e8]

The production speed of Dyson sphere parts is the bottleneck, so when we hand produce them, we make them.
　It turns out that once the bottleneck here is resolved, the launch will be the bottleneck.
　It is now tightly coupled with the launch facility, so even if it is increased in the current situation, it is difficult to maneuver and not good.
	[https://gyazo.com/2f7f45660360f558659be5cf6909b189]

photography
[https://gyazo.com/eeeda752245f6cf8780487099f2909a3]
[https://gyazo.com/edbd4203b448c868e6e4a5fce224ebbb]
[https://gyazo.com/2f23f603c0810a7dbc829f7be47f7a22]
[https://gyazo.com/06b0cbcba1696bb4bcf5037444c9db9c]
[https://gyazo.com/6243bcd7978d2ecc0cd147bb38c47aef]

The rocket production rate was exceeding the launch rate and the inventory was up to 100 units, so let's build another launch facility.

The distribution of graphene was stalled, the process stopped after Strange Matter, and the gravitational lens was gone.

Another oil well runs dry.
　The supply of titanium alloys stopped, and when I traced it back, it was because the production of sulfuric acid had stopped.
　I wonder if the Dyson sphere will be completed before all the oil wells on earth are wiped out.
　I still have about 8 more, so I'm good.
　All petrochemical plants were turned to blue increase spray (25% production bonus).

I tried to leave the power short.
　All batteries discharged.
　When I did anti-matter power generation, it stored about 7 GJ.

Photography, Vessel, drone, and vertical launch rocket in front of three parties.
[https://gyazo.com/af2c7e84ffadd86a806d210ad1ae00ae]

Let's estimate the remaining man-hours for a moment.
　Now Dyson sphere is 9000 points out of 15000 points.
　　Five launches per minute, with an excess of inventory, and occasionally a second launch facility in operation.
　　I don't know what the goal is without a plan for all the balls.
　　[https://gyazo.com/adea8b041463bf30374710e9f681ace7]
　　12,000 more structure points to go.
　　That's 40 hours, so tomorrow I'll be in weekday leave mode again, and I'll have two days at the earliest to complete the project, or I'll stop for trouble and fix it little by little.
　　370,000 more cell points to go.
　　　Solar sails are now producing 65/m.
　　　Part of it will be taken for rocket production.
　　　This one should take about 100 hours.
　　　Let's build a solar sail production plant and leave it alone.
　　　The existing plant is slowing down upstream stone mining.
　　　Consolidate too much glass made elsewhere here.

[https://gyazo.com/109a33ab1fe509b4f159b0d12fd595d6]

--- Day 17 Monday evening

remaining
10,000 structure points
　5/m, so 33 hours
　　Production is 5.9/m
290000 cell points
　180/m, so 29 hours

A third launch facility was built.
　All the extra glass that had been left over for the solar sail was now used up.
　At the end of the game, I'm running out of stones that I've had left over since the beginning of the game.
　　We still have 2M on the planet, so we just need to go digging.

I'm going to visit one inner planet that I haven't been to for a while.
　Hmmm, I don't know what to do, calculate if I need to pioneer this place or not.
　The remaining 280,000 cell points are needed, and each one requires 12 stones, so 3,360,000.
　Whoa, this is just barely enough to dig through all the rocks on the earth and on this planet.

Power is consistently short about 80 MW.

I've mass-produced conveyor belts and other equipment on Earth, first I'm going to go to the power generation planet to receive empty batteries.
[https://gyazo.com/2d52819a83c928429980e393ad35579b]
[https://gyazo.com/f86685eb14c1942e3a2f5ad5ebc9e828]
[https://gyazo.com/0ff18b2bc645f60b80280d8eb7aa1fa5]
[https://gyazo.com/64c3ded7e43183865bebad670ee3adb5]
[https://gyazo.com/dac26d3057f7a015935081906be95789]
[https://gyazo.com/aff330cb64e784f1c1344361bd1ce204]
[https://gyazo.com/d62ded49b730d72a1fd31a83923265a7]
[https://gyazo.com/c10a4bf2f00e5a46f9718f3bbe6cd62f]
Charging speed reduced by less than 3 times.
[https://gyazo.com/2b5d78c9663192a6f9cbc27330beb868]
Putting geothermal power all over the lava
[https://gyazo.com/a71f17791c5768467f06295e5007da2c]

Solar sail production is 350/m
 Graphene production 240/m, consumption 350/m, so mostly due to graphene, large inventory is about to be used up.
 The high consumption of graphene prevented drone transport to additional factories for nanotube creation, affecting the speed of rocket production.
 Graphene manufactured 2.5 times
[https://gyazo.com/9e65c715014007dbca9963255652c4fc]
　At this rate, I'm sure we'll have cell points accumulated by tomorrow night.
　Oh, is it a miscalculation that you have to dig up all the stones on two planets?

I discharged it with two arrays of rechargeable batteries.
　I don't think I'll lose any because I'm charging about 2.5 on the power generation planet.
　Since there are already 30,000 units in stock, even if they were never charged, two units can last 21 hours using two units in 5 seconds.
　　I think you're hoarding too much.

--- Day 18 Tuesday morning
[https://gyazo.com/041c5c435d158d9846ec24b3243e270c]
	It's in a different shape than planned.
　The rocket is inadequate and keeps launching solar sails in a loop.
		[https://gyazo.com/bf09a654c7daaef07934a8d451367c4e]
　　Rocket production has stopped.
   cause
   　Mining of stone upstream of the process of making titanium glass had been exhausted.
   　The upstream crude oil from which the Kashmir crystals were made was also depleted.

When I checked after work at night, it was much more done than I expected.
[https://gyazo.com/3102087f2f9dca4cfe441c470f97dc71]
[https://gyazo.com/c4033a822db5e3ac770a73bb954ac26c]
remaining
　Structure point 1100
　 Three hours to go.
　Cell point 40000
　　2.8 hours to go
　I've improved the rocket's bottleneck, deuterium fuel, by 33%.

[https://gyazo.com/4b7bb0c8cee6aec257b4eb42190f29c6]
[https://gyazo.com/5b4957e48f5d5735e39918d186419460]
[https://gyazo.com/f05659a38ce928593eaa630f47fea018]
[https://gyazo.com/ad35249ee21e0c10d178b1eb67f9c379]
[https://gyazo.com/f9a7af10f32bae85a0a5c566951efb0a]
[https://gyazo.com/d166d59918bd448b921f315c69f8af63]

Oops, no matter how many launches you do, it looks like the inhale rate is 30/s per location.
	[https://gyazo.com/4484b2ce6dcc229e2199870024b7d256]
	The remaining 20,000 points is 1.9 hours, and considering that it gets slower and slower towards the end of the day, it's going to be over 2 hours.

not quite
[https://gyazo.com/57d732c652253fb6750bb1e5067fef29]

I was able to do it!
[https://gyazo.com/aafe111b60839c93f2344afed44073da]
[https://gyazo.com/a480c7e8147d404170147093d0b078df]

It was as expected, but when completed, it is just a ball, so it looks uninteresting; it is more interesting when it is in the process of being made.
	Looking back, it is still more beautiful under construction
	But, well, I'd love to complete a true Dyson sphere for once.

consideration
	It can be made using only the resources of the early solar system.
		We're using rare resources from other solar systems for advanced mining machines, but they're not needed for the Dyson sphere.
	There is still a lot of room on the Earth's surface because there is a "nearly building-free half" of the planet.
	I played it pretty worried about running out of oil, but I think I still have a couple untouched (I checked and there are 34/s left).
 Thermal power generation is only used in the early stages and in the early stages of pioneering on new planets.
 	Only renewable energy is acceptable.
 	Basically, wind and solar power on Earth, geothermal power generation on a lava planet at the end of the day, and interplanetary circulation of the charger.
		Even without a lava planet, there's still half the surface of the Earth left, so we could lay down photovoltaic panels, right?
	 The photons obtained from the Dyson sphere were used as anti-matter fuel, but not used because the rechargeable battery cycle was sufficient.
	 	Photons are in abundance. No need to worry about energy without firepower.
	I have 8 orbit collectors on my gas giant.
		All of the demand for hydrogen and graphene has been met by it along the way, and we're not using petroleum.
			This area may be important.
				If you made it from oil and burned the byproduct on the surplus side, you might have depleted the oil before the Dyson sphere was completed.
					What an educational game!
				I wasn't aware of it, but it's a rather constrictive play to not burn it, despite the existence of a thermal power plant and a large inventory of burnable by-products.
					Maybe it is a balancing act that usually burns without more concern and suffers from oil depletion at the end of the day.
					If oil is depleted during the phase of making Dyson spheres, I have a feeling that the production of sulfuric acid for the titanium alloys needed for rocket production will be drowned out and we will be in considerable trouble.
						Even if we were to transport it from another solar system, it's liquid, so we wouldn't be able to carry much in our hands.
						Oh, you mean carry it in a warp-navigated vessel? That's, well, a realistic line.
						We've completed it in one solar system, so we haven't had to deal with inter-solar system transport.
						It was pointed out that titanium is commonplace and can be processed to a titanium alloy before being transported, sure.
