Evidence of competence
Respect is the breath of life that sprouts excellence. Competent people like evidence of competence in order to gain respect.

The relationship of [respect] to [excellence] is the same as the relationship of the West Wind to the flower, that is, the breath of life.
 >Esteem is to excellence what the zephyr is to flowers, the breath of life.
　I think some people don't know what this "west wind is the breath of life against the flowers" is all about.
　[https://gyazo.com/ce52894c0423dcee795e811dff27a7a3]
		>West Wind Zephyrus
  > Zephyros (Ζέφυρος, Zephyros) is the god of the West Wind. In English he is Zephyr... Zephyros, the mildest of the anemoi, is known as the fertility wind that heralds the coming of spring.
			[アネモイ - Wikipedia https://ja.m.wikipedia.org/wiki/%E3%82%A2%E3%83%8D%E3%83%A2%E3%82%A4#%E8%A5%BF%E9%A2%A8%E3%82%BC%E3%83%94%E3%83%A5%E3%83%AD%E3%82%B9]

The "King of Aragon" in the text is: Conqueror [Jaime I (King of Aragon) - Wikipedia https://ja.wikipedia.org/wiki/%E3%83%8F%E3%82%A4%E3%83%A11%E4%B8%96_(%E3%82%A2%E3%83%A9%E3 %82%B4%E3%83%B3%E7%8E%8B)]


from [The Art of Worldly Wisdom]
Prioritize the call "en Evidence."
lxvii 

Most things depend on the satisfaction of others. Respect is to excellence what zephyr is to a flower, the breath of life. Some professions command the respect of all, while others, more important, are discredited. The former are pursued before the eyes of all and win universal favor, while the latter, though rare and valuable, remain obscure and unnoticed, honored but without applause. Among princes, the conqueror is the most famous, and hence the king of Aragon was applauded as a warrior, a conqueror, and a great man. A competent man prefers a profession and evidence that is known and available to all, and is thus immortalized by universal suffrage.

Prefer Callings "en Evidence."

Most things depend on the satisfaction of others. Esteem is to excellence what the zephyr is to flowers, the breath of life. There are some callings which gain universal esteem, while others more important are without credit. The former, pursued before the eyes of all, obtain the universal favour; the others, though they are rarer and more valuable, remain obscure and unperceived, honoured but not applauded. Among princes conquerors are the most celebrated, and therefore the kings of Aragon earned such applause as warriors, conquerors, and great men. An able man will prefer callings en evidence which all men know of and utilise, and he thus becomes immortalised by universal suffrage.