Keep a journal in a private one-person project.
from [Diary 2022-01-31].
Keep a journal in a private one-person project.

Diary Goodness
　No title.
　　Just use the date as the title.
　Assumption that it must be titled
		There should be no such restrictions on the primary receptacle for writing out thoughts.
			[as natural as breathing, ideas are preserved, shared, and explored].
   No title on your breath.
   Should be able to write it out first and then title it
	Forcing titles is not for writing out, but for organizing.
		The writing phase and the organizing phase are one and the same.

This project is often referenced in regards to how to use Scrapbox
　But I'm not sure that's an appropriate example.
　Not how to use the Scrapbox tool, but how to see it as a tool for bottom-up structuring of values
　　When I started using a personal wiki, it was [howm] running locally.
 　　What I wrote was not immediately published.
 　　So I could write anything without worrying about what people would think.
 　　I could clip sentences I liked without worrying about copyright.
　　　　I did a kind of thing where I read books and extracted sentences I liked.
　　On the other hand, he was also writing his thoughts in a public forum on the Web
　　　It's been over 20 years.
　　　Some of the blog posts from 10 years ago say, "I wouldn't be writing this now.
　　　The filter for "what to write and what not to write" has changed over time.
　　　What is worth writing about is "value."
　　　By establishing a filter for "what to write" over a period of 10 years, there is no psychological resistance to writing what you decide is OK.
　　　　Those who don't are hesitant about whether or not they should write, and this puts the brakes on writing.
　I think a good first step for someone new to personal wikis and information dissemination would be to keep a journal in a private one-person project.
　　Searchable compared to paper diaries.
　　One of the best things about Scrapbox is that you can make it a "link" simply by enclosing it in square brackets
　　You don't have to specify where this "link" leads, just do it like highlighting an important word.
　　One day you draw a marker and it changes color.
　　　That "I've marked that keyword before."
　　　You can discover past diaries in which I mentioned the keyword.
　　　Interesting to read back.
　　　　You can write your thoughts about what you see connected in today's diary or on the keywords page.
　　　　Many people resist editing "past diary pages."
　　　　　So it's good to have "another page with only the important parts extracted".
　　　　　Keyword page is suitable for it.
　　This is how the dots are connected after the fact.

[https://gyazo.com/a11b8ca340419141db0ba3a61a546631]
[bottom-up verbalization of values = iceberg model = ConnectingDots].

It is better to have a single person project as well as a multi-person project
　Even if a multi-person project is a "free to write" place, there should be a separate "free to write" place just for you
　Even if it says you are free to do what you want, people implicitly read the rules from the air and subconsciously restrict what they write.
　When thinking carefully, other people's stimuli can get in the way.
　　[Parable of the quiet room]
　　Sometimes I want other people's stimulation and sometimes I don't.
　　There is a difference in the mode of mind.
　　[SNS export mode]
