Kozaneba:IOFI
prev [Kozaneba:体験過程と意味の創造]
[「体験過程と意味の創造」勉強会2]
[https://gyazo.com/6a23a991b4d49dc8fe2313e7980456dc]

[IOFI]

[https://gyazo.com/5cb2f6685251c6abf3b6476537474d80]

[https://gyazo.com/03880f8f4ca8636e7c5bf22196aeb70c]
[https://gyazo.com/477ebcbe50f2322dc51cd009a97fee9c]
>It is true that the relationship between symbols and perceived meanings is more fundamental than logic, since meanings and logical patterns are created only in the interaction between symbols and perceived meanings. Therefore, logic is secondary and only works after the formation of meaning.
[https://gyazo.com/e681864c515d8a3e1dc2f3162748e8a9]

?
	>However, the logical use of a concept must and can be differentiated from the role of the perceived meaning in the creation of a newer meaning.

It can be shown that one is always matching a very specific, well-defined felt meaning, and that the variety of possible symbolic meanings for that felt meaning is quite the opposite of arbitrary.

Perceived Meaning
Symbolization of the can be diverse.
Due to the fact that it has very complex determinants
symbolization

Only a few of the many pre-conceptual meanings of the sensed meaning can be symbolized.

?
>Fundamental empiricism would not assume (think) any kind of logical pattern prior to the creation of logical patterns. Fundamental empiricism would not read any conceptual patterns into the preconceptual experience process. (This is because they themselves were created by the interaction of symbols and experience processes.) It would retain well formed and defined concepts and logical deductions, but it would not confuse these with the actual experienced processes at work in the creation of new meanings.

[https://gyazo.com/cd382c05bc486b71bb55dfd25a881f5f]

B

p.165-p.201
p.201-p.232

p.170
>Metaphor creates meaning or similarity. Meaning does not create similarity, nor vice versa, but they are equal to each other.

This is the important part

>We can generalize a (new) methodological category by considering "a given and specified (explained) meaning as an illustration of a (new) kind of methodological category for some (related) aspect of meaning or role in the article. " He stated.
> We name this the "instance of itself" principle, and recall that the instance of itself has the meaning of an "experiential process procedure.
面
Methodological Categories
体験過程手順

>Principle: One may creatively specify new methodological categories by considering any given specified meanings as an instance of a (new) kind of methodological category in any (relevant) aspect of it or its role in the discourse.

>The principle that a new methodological category can be creatively specified by considering some given specified meaning as an illustration of a (new) kind of methodological category in any (relevant) aspect of its or its role in the paper. The following is an example of one (new) kind of methodological category in a (related) aspect.

>(DeepL) Principle One can creatively prescribe new methodological categories by considering a given particular meaning as an instance of a (new) kind of methodological category in any (relevant) aspect of it and its role in discourse.

[https://gyazo.com/ab388f2969e8b2e25b0e66d89e4c175b]
>"Experience Process Procedure" a. Definition of "′′′′" b. Definition of "1-iettC snake′′ "′′′′
> I would like to identify and explain a different "experiential process procedure" from the terminology just described. In other words, it identifies (clarifies) the experienced transition from one step of thought to another, and in discussing such a transition, we have already mentioned (Chapter IV, "The Transition from One Step to Another").
> Section B, 9) That the experiential process in the transition of thought would be regarded as a "single" experiential process in which the two steps in thought are simultaneous aspects (even though they are specified and "revealed" in continuous time).
> > and is a very good example of how to use the newest technology.

>Definition of "experiencing procedure." The terms just mentioned specify different "experiencing procedures," that is, experienced transitions between one step of thought and another.
>In discussing such transitions, we have already mentioned (Chapter IV, Section B, 9) that the experiencing in a transition in thinking may be viewed as “one" experiencing of which the two steps of thought are simultaneous aspects (although they are specified at successive times). 
	>(DeepL) Definition of "experience procedure." The terms just mentioned define different "experience procedures," i.e., experienced transitions between one stage of thought and another.
	>When discussing such transitions, it has already been noted (Chapter IV, Section B, 9) that the experience in the transition of thought can be viewed as "one" experience in which the two steps of thought are simultaneous aspects (although designated in successive times).

創造的な機能的関係
	[https://gyazo.com/72c5dfaa9c9747d4af30f65b1d7cd0ba]
	非平行的機能的関係
 1. 隠喩 (METAPHOR)
 2. 理解 (COMPREHENSION)
 3. 関連 (RELEVANCE)
 4. phrasing (CIRCUMLOCUTION)
　The question about the logical determination regarding these things was open.
　　For example, METAPHOR
　　　What determines the new meaning?
　　　　(Before I go any further, I will say that "similarity does not decide" after this.)
		COMPREHENSION
			論理的視点から: symbolized comprehended meaning = implicit meaning でないといけないように感じる
		RELEVANCE
			It seems to me that some logical relationship is going to determine "what is involved".
		CIRCUMLOCUTION
			The meaning that contributes to "making a little bit of the now" seems to have some logical significance to the subject
	Rather, these functional relationships do not depend on another logical relationship

METAPHOR
>My lover is like a red, red rose.
　How do you determine the meaning that comes to your mind when you see this
　Is it determined by its similarity to the meaning of the rose?"
　　Really?
　　Roses and humans are different.
　　In what sense are they similar?
　　There could be a lot of words for this.
　　　Or, "Lively and blooming."
　　When you first saw "my lover is like a red, red rose", did you understand the meaning after the explanation of this similarity came to mind?
　　　I'm sure he didn't explicitly think about it.
　　　The "similarity" did not come first.
　　　　The experiencing process of combining the words "lover" and "rose" to refer to the same thing was first, from which the similarity was derived a posteriori.
　　　　Specific parallels are "found" and "created" as aspects of metaphorical meaning
　　　　Cats are like the sun."
　　　　"[Wandering Panda https://shindanmaker.com/1072777]"
　　　[https://gyazo.com/5436b596b8d6f782f7c1dd5362568459]

　The creator's side of the story
　　There's an unspoken blur.
　　'Can you compare this to something, what does this look like?'
　　You think about it a lot and you go, "Oh, it looks like a rose."
　　　After you feel the resemblance, an explanation of why it is similar comes up.
　　Vague experience that "discovered," "created," or "identified" a particular aspect of the experience.

If so, what determines the creation of meaning?
　直接照合
　　We can directly compare unspoken mumbo-jumbo with words and other symbols and think "yes" or "no."
　Distinction between concept and perceived meaning
　　概念(uniquely specified (logical) concepts)と感じられた意味の働き(the functioning of felt meaning)は明確に区別しなければならない
　　One felt meaning can be symbolized in many ways (COMPREHENSION)
　　Each of these uniquely speccified concepts is not equivalent.
　　Even if each of the functioning of felt meaning "fits", it does not mean that the output symbols are logically identical in meaning.
　　This "fit" can be determined by direct matching.
　The function of perceived meaning determines
　　The "creation of meaning" here is
　　　It is not "creation from nothing."
　　　Nor is it "the creation of anything arbitrary."
　　Each functional relationship has a different degree of imagination.
　　　In METAPHOR and CIRCUMLOCUTION the felt meaning itself is created
　　　In COMPREHENSION and RELEVANCE, the given felt meaning is modified by the symbols
　　　　It does not create new meaning.
　　　　However, this given felt meaning is somehow directly referred to, so the whole is involved in the creation of a new meaning.
			[https://gyazo.com/72c5dfaa9c9747d4af30f65b1d7cd0ba]
　　　[https://gyazo.com/645cfa49709fdbf7b883f6715280bea8]
　Logical relations between linguistic symbols occur after two experienced creations
　　Creation of the concept of the object (symbolization of the felt meaning)
　　Creation of relationships between symbols
　　 [nishio.icon]KJ法の説明で良く言うやつ
　　 　"You put something nearby that you think might have something to do with it, and then you can verbalize 'what's the connection' after the fact."
　　 　This way you can verbalize how the relationship is, and then you can deal with it linguistically.
　Gendlin "reversed the order of existing philosophy!" He says.
　　[nishio.icon]That's just because of the historical emphasis that Western philosophy has placed on linguistic thinking, which is not very interesting to those of us who are familiar with Eastern philosophy.
　　　>Furyumonji is a term used to describe the doctrine of Zen Buddhism, meaning that in addition to the transmission of doctrine through letters and words, what is conveyed through experience is the quintessence of the doctrine. [https://ja.m.wikipedia.org/wiki/不立文字 furyumoji - Wikipedia]
　　　[Ikitaro Nishida]'s "There is 'pure experience' before it becomes a word!" and so on.

having of concept

Two Dangers
>Thus, there is a twin danger: either (1) we will take one of these functional relationships as crucial and ignore the fact that felt meaning functions in others
>, or (2) we will speak of felt meaning as an occurrence altogether apart from such relationships with symbols, which will be quite a questionable thing to talk about.
We may assume one of these functional relationships to be definitive and ignore the fact that the perceived meaning is at work in the other.
　We may be talking about a meaning felt as an event totally apart from any such relationship with the symbol.

The first danger is
Know well,
第二の危険
It stands on the possibility of direct matching.
　We've already singled out one feature here.

Consider the characteristics of experienced meanings so that we can use a variety of functional relationships, not just one.

無数的特徴
　Lots of it.
　Concepts are discarded from countless experiences.
　There is no unit for counting the number of experiences.
　　It doesn't consist of a unit experience.
multischemic
　scheme
　　組織体系
　It is not schemeed in one way.
　Aspects of Experience
　　Such a particularization is COMPREHENSION
　Experience includes time.
　Includes the possibility of being identified in terms of time
　
temporal scheme
physical scheme
process-like scheme
　

[| [https://gyazo.com/204722063186b0dfa83ee9fdeaf3f2b6] [https://gyazo.com/2b086d1dd9a886aebc133cfb35badb28] [https://gyazo.com/a7d1f41874a5fb8adb7051d8b653c637]]
[https://gyazo.com/c5e15cac8079f9649b2686744b51776c]

[https://gyazo.com/a56993ea13ecb94fd51158b532159431]


The "multi-scheme" nature of experience
muzukasi
[https://gyazo.com/52f97c0cfc4c576bf86a871bd1dea7cc]

[| [https://gyazo.com/f393230322ebe345227d8fc16080af48][https://gyazo.com/841240a5c77d959ebdc84004ed5e58ee]]

[nishio.icon]The term "differentiation," for example, implies that there is one "structure of experiences" within the experiences. We have used this structure in our discussion of units of experience. By doing so, we have "structured experience.
	構造:schema, 構造化:schematize
　We wanted to discuss without symbolizing one particular one, so we provided some schemes
　　(When discussing differentiation, instead of using only one specific symbol, "differentiation," a symbol used within the existing structure of philosophy, I pointed to the "felt meaning" I wanted to point to with a number of different symbols used within a number of different structures.)
　　It allowed me to say what I wanted to say.
　　Each formula (fomulation) had a philosophical meaning, but there was no obligation to accept it.
　　I wasn't obligated to, but I tried not to break it if at all possible... I collated it directly and chose the word that fit best.
　　(8)詳しくは6章A節7で語られる。「機能的等価値」(functional equivalence)と呼ぶ
　　Equivalent terms can be REFERRED and FUNCTIONAL to the same experience X
　　X is function performed by experience, which is symbolized in a variety of ways
　At this stage, the term "multi-schematic" may seem very abstract, but that is because it does not give concrete examples of schemas, and "temporal schemas," "physical schemas," and "process schemas" come later.
　Diverse schemas can occur. The experience process is not structured by any one schema.
　　This "being multi-schematic" is characteristic 2 of "experience as something at work in the creation of new aspects".

[| [https://gyazo.com/bfeb1f81c1d163c05aee4eb3123afbb0] [https://gyazo.com/f24d1a151884fca263c03dc4c3629580] [https://gyazo.com/954f8ab07507e9e84e34da034df81d82]]

SPECIFICATION, referring to both "specifying" and "what results from specifying".
Here, it's the "results obtained". Because the verb results modifies it.
In the translation, you wrote "I put quotation marks around "were" to mean ~", but the "were" is gone in the translation.
Ah, we're talking about given and other, but the other in the original text has been dropped from the translation!
So, the same symbol is used to express a connection, but the translator misses the symbol, so the connection is not connected.
Ha - progress in understanding the phenomenon of "understanding".


Definition of "Aspects of Experience
	経験の側面:aspect of experience
	The term "aspects of experience" is used to refer to the objects that result when experience is SPECIFIED through creative symbolism.
	Creative symbolization creates=specifies certain "aspects (aspects)" of "fuzzy experiences" that are myriad and multi-scheme.
	At this time, aspects are created, depending not only on the experience X that is the focus of attention, but also on other experiences Y, Z.... At this time, aspects of Y, Z as well as experience X are created.
	One can always explain (creatively specify) which other experiences besides experience X were "included" in this "creation of aspects". If the "creation of aspects" has already taken place, then this explanation is COMPREHENSION.
	I say included and "was" here because it is in the past. This explanation is timed to COMPREHENSION (and COMPREHENSION takes place after the "creation of aspects"), so the "aspects" are "already there" at that time.

Experience includes time.
　An experience that has not been specified has no unit, the unit is specified at the time it is specified, and at the same time the schema-like relationship is specified.
　The same can be said about time.
　Temporal pre- and post-relationships and moments are a type of scheme and have no relationship in the time scheme until they are identified
　For example, there is "an experience X", then there is "an experience Y", and then you look back from Y and say that something Z was "already there in X".
　　This was first," explains more than just "this."

After dinner I felt very sleepy, so I interrupted and went to bed.
Putting props on stage makes it easier to perform with them later.
Engrave unintelligible sentences in Kozaneba
Each symbol may or may not lead to a felt sense.
Stay large, don't connect.
Smaller.
In places, there are symbols tied to felt sense.
　Felt Sense" and "Felt Meaning" do just that.
　It comes in the form of "felt meaning" in the book, which I feel is felt sense.
Symbols cannot work creatively unless they are connected to experienced meaning
　Let's not talk about the Chinese room.
I know what each word means, but I don't know what it means as a whole.
　What I do in Kozaneba at this point is to write down the adjacency of a symbol to other symbols, or the relationship of "A and B are the same", etc., and create the meaning felt by the CIRCUMLOCUTION!
An important word was left out in the translation process.

I woke up and read a little more, and I'm feeling like translation is a tough job.
The author's own thoughts (felt meaning) written in non-parallel symbols,
When words are re-expressed in another language that does not have a one-to-one correspondence
Naturally, it cannot be translated mechanically by looking only at the symbols.
Ideally, we need to "reproduce the exact meaning that was felt in the author's mind, and then express it accurately in Japanese.
Difficult to verify if the "felt meaning" I created in my brain by looking at the symbol sequence matches what was in the author's mind.

Because non-parallel symbols are used, dictionary-mechanical translation yields subtle results."
The actual result of DeepL

twin danger:
(1) we will take one of these functional relationships as crucial and ignore the fact that felt meaning functions in others
(2) we will speak of felt meaning as an occurrence altogether apart from such relationships with symbol
There is a double jeopardy.
(1) To give importance to one of these functional relationships and ignore the fact that the felt meaning functions in other functions.
(2) To speak of the meaning of the felt as something entirely separate from its relationship to such a symbol.

I have not been able to connect "felt meaning" to the Japanese symbol for "felt meaning. I need to train my side to be able to recall the same felt meaning from the string "felt meaning", or I need to specify the translation in a glossary. DeepL can specify a glossary, but it seems that Japanese is not supported.

By the way, here's how I would translate it

There are two diametrically opposed dangers.
1: You give importance to only one particular one of the seven functional relationships explained in the previous section, and ignore the fact that "felt meaning" is also a function of the remaining six functional relationships.
2: Discussing "felt meaning" on its own, divorced from the seven functional relationships between symbols and

To avoid the second danger, one of the seven functional relationships, "direct matching," can be used. Therefore, it is a twin danger, not two dangers, and this is not "two individual dangers" but "two sides of a coin".

If you observe my translation again, you will see that there are many words mixed in that are not included in the short original symbol sequence. Where this comes from is that when I look at the symbols in the English text, I am reminded of experience X from the previous study session, contributing to the creation of "felt meaning" Y, which corresponds to this sentence. This is one RELEVANCE out of seven. And when expressing this "felt meaning" in a sequence of Japanese symbols, I thought that it would be "easier for readers to understand this part only on the groupware" if I supplemented the story of X as well as Y. So I acted accordingly. This "specifying the X aspect" is COMPREHENSION, which is the scope of the present discussion.

Another way to put it is that it makes no sense to talk about "felt meaning" in isolation from the functional relationship between symbols.
There exists "moyamoya," right? and it does not make much sense to focus only on moyamoya, but we need to pay attention to how moyamoya becomes words, and how words affect moyamoya.

[https://gyazo.com/1ca4d98849c45a059b19063fbaeec228]
The word "process" doesn't sit well with me personally.
　It doesn't fit the "felt meaning" I conjure up with the word "process."
　The expressions "river" and "motion" are used.
　　When we think of the "movement" of "water moving downstream," all the water in various parts of the river is "moving downstream" at a certain point in time.

Development Memo
　When opening and closing a group with many small bills, the text is momentarily smaller.
　　I think it's a recalculation of the font size, but I thought it was cached?
　I want the color of the arrow head to be consistent with the line itself, and I want lines that are not binary to be gray.
　I would like the scaling parallelism after selecting a range to be applied to the selected range as well.
　　I want to select an object that has a delicate border with its neighbors, zoom in, then select it, then zoom out, then move it farther away.
　　If you move it and then scroll the screen to "move it farther", the selection doesn't move, so it looks weird.

3: Meaning is similar (LIKENESSES) and vice versa
[https://gyazo.com/a56993ea13ecb94fd51158b532159431]
[https://gyazo.com/6b8efb4f64f73b456768cff9eed915d3]

[| [https://gyazo.com/a56993ea13ecb94fd51158b532159431] [https://gyazo.com/c4ccadbce5b2c021ac39beb2e37fe817]]
I might have liked the way the right edge was drawn.
Because there is no clear entailment between the perceived meaning and the

[https://gyazo.com/ce0fd1c64dc7aea1f9f3930ef52e7c8e]


4: Relationships or various relations
[https://gyazo.com/3b1b4d32dcde8ef9c0547d68fe84ac7a]
[https://gyazo.com/3a345d8c61975173bf899358d0300cc1]


[| [https://gyazo.com/cd656e26bce32b61a573223f1b1bc07f][https://gyazo.com/cebeff2e80a5b2e8e53f91d56f9c580a]]

[| [https://gyazo.com/1035188703dc20d8e34cfffc2cb7713a][https://gyazo.com/da7b76d71267cbf2791a43953dd68b92]]

a creative process is possible in two directions
[https://gyazo.com/fe7c77fe0bcfd07eed87479b84fa3328]
relata
[https://gyazo.com/b514c56b60b91cb460872ef91bf2a14a]

New aspect
[https://gyazo.com/7f28a9923c4f1b97dc449f9b51aa1ce3]
	interaction of experienced meanings

[https://gyazo.com/8a7188bb670a1ebbdb8a142cae549858]


[https://gyazo.com/6bd27377d39e3bca3dea3acaa65801a2]

We have seen that in each functional relationship the meanings said to be "already in" an experience are a myraid of specifiable meanings.
We have seen that in each functional relationship, the meanings that an experience "already has" are a mishmash of identifiable meanings.
We have seen that the meanings said to be already in an experience are a myriad of specifiable meanings.
We have seen that the meanings that are supposed to be already present in the experience are a myriad of identifiable meanings.
[https://gyazo.com/0a71917e758bec9792bf43755c7c742f]

At least I got to look through the end of chapter 4.
　This "looked over" means that it was imported on Kozaneba, but not to the point where it was chopped to the appropriate size.
　[https://gyazo.com/6c7c6e3fae99f1c32864d2dafb10a2ea]
	[https://gyazo.com/d38ffe6a90c82208886890ec9d1975f6]
	[https://gyazo.com/d57236f5387b4d9fa9a5321c8930d332]
	[https://gyazo.com/77895164a94be4bc6393a0950847b163]

