Re:2022/01/24
from [/villagepump/2022/01/24]


　I was writing in the context of my work that the future direction of [Keichobot], which currently has no memory across conversations, is "to have a memory of a multi-person team" beyond "to have a memory of an individual", in which case it will contribute to creating a common language for the team...I was writing this in the context of my work in my company. I was writing in the "Chatbot" section, and I had a sudden inspiration that "a chatbot that has a memory of the contents of the well and the contents of the public personal projects of the people participating in the well" would be a rather interesting route to try this out....
　　面白そう[/villagepump/yosider.icon][/villagepump/erniogi.icon]
　　I have no idea how to implement this in concrete terms! ([Expectation Control])[/villagepump/nishio.icon])
　　[/villagepump/chatbot with memory].

　[pages that have been aged are more likely to be edited] + topics that anyone can speak on are more likely to be lively ([discussion of bike storage]) =?
　　Unimportant things take up brain resources!
　　It seems like it would be nice to have a page where anyone can write and have a good time, but let's see...
　　The fact that a page has been updated is displayed on the home page and streamed regardless of what the update is about
　　When you think about it as a [notification] mechanism, the receiver can't mute it, or it's a situation where the receiver can't mute it.
　　　Conversely, is a mute enough?
	[/villagepump/安全な政治の話の要件]

from [/villagepump/2022/01/24]

[/villagepump/inajob.icon]
	I've been using note-taking tools regularly and then quitting, but joining [Wells] has revived the habit of leaving notes on my wiki (maybe for a day).
		There is nothing to write about in the results [wells].
		I make use of paper diaries and other things when they are booming in my mind, but they disappear from my habit at some point.
	Is this what [2 hop link] is? (I checked it works...)
		[https://gyazo.com/bfb985a0def9852e3de2ef3463975816]
			Yesterday this or that [2022/01/23#61ed2dcd1280f0000026ee50].
				When linked from the table of contents.
			Is the reason why Ehime is not shown in Wakayama in the example below to avoid the table of contents issue?
				If you link to each item from the table of contents, each page is all related.
					Does this add too many related pages?
			Should the basic idea be to make it a reciprocal link?
  ですね、共通の話題を辿る物[/villagepump/kuuote.icon]
   I'm sure [/masui/2 hoplink discussion] has more details, but the fact that you're choosing that word means you've already seen it.
   	It's still there[/villagepump/inajob.icon].
   	見てなかった[/villagepump/nishio.icon]
   	 Normal link and Kiai link." Isn't this interesting?
   	  Scrapboxにもあってよさそう[/villagepump/kuuote.icon]
