Face icon freed from the physical body
[https://gyazo.com/33506f42d0d01848cfb88ad9b785ab31]
	>What is a face icon that is completely free from the physical body...?
		I think this is a good w


--- log
from [well 2022-01-22].
Face icon freed from the physical body
	I just changed my face icon, but if you say "[I want to be free from the physical body]" and "[Using a live-action icon simply because it is familiar is a contradiction]", isn't using an image of a 3D humanoid model made from a photo of a physical body as a face icon also a contradiction? I've just realized that.
	　What is a face icon that is completely free from the physical body...?
	　　Original character icons like [/villagepump/mtane0412.icon]'s? [/villagepump/yosider.icon].

from [/villagepump/nishio]
[https://gyazo.com/6d104983abdce7cd51495d6ba06d17a9]
　Auto-generated avatars from photos
　I'll try to use it as an icon for a while because it's interesting to see the atmosphere it retains.
　https://twitter.com/nishio/status/1484377212925411336?s=21

from [Re:2022/01/21]
　After seeing and thinking about the recent gender and age questions, I'm starting to feel like I'm "wanting to be free of [my] physical body" after all[/villagepump/nishio.icon].
　 And yet I felt it was [inconsistent to use live-action icons simply because I'm used to using them.
　 Then, a story about creating avatars from photos came up on Twitter, and we thought, "Why not use this as an avatar (icon) for the time being?
　  [/icons/like.icon] [/villagepump/dai.icon][/villagepump/Mijinko_SD! .icon] [/villagepump/dai.icon][/villagepump/Mijinko_SD.icon]

　I can't recognize my icon as me. w
　　I'm not used to it because of the image of [/nishio] (I'll get used to it in a few days)[/villagepump/kimoto.icon][/villagepump/takker.icon].
　　Oh, I can't get used to it myself. w[/villagepump/inajob.icon].
　　　Yes, given the examples of others, I got used to it in a few days.
　　Sometimes I have a mysterious feeling that if I don't confuse my cognition, I will lose my ability to adapt w[/villagepump/nishio.icon].
　　 Is it a necessary ability w[/villagepump/kuuote.icon]?
　　 Certainly those who change icons will be recognized as those who change icons, so when they change, it will be "again," but for those who don't, it will be "I can't get used to it..." for a while.
　　 　Not "get used to changing icons" but more abstract [ability to adapt to change][/villagepump/nishio.icon].
　　 　 For example, you go to an electronics store because your mouse is broken, and you buy a trackball that you happen to see and return home (true story).
　　 　 I started [thumb shift] because Dr. Shiozawa recommended it to me.
　　 　 It is a feeling of wanting to change things when you realize that you have become accustomed to a certain way of doing things and take it for granted.
　　 　  Well, it is indeed important to notice the "[natural]"[/villagepump/kuuote.icon].

from [well 2022-01-23].
Face icon freed from the physical body
 I came up with a face icon with no physicality[/villagepump/nishio.icon]Isn't it more obvious than the previous one?
  Grass[/villagepump/takker.icon].
   When I saw the icon, I first thought "who is this?", then I saw the description and figured out that it must be "nishio-san", and then I went to the user page to check the answer.
   [concept of face] Cracked
  Easy to understand[/villagepump/inajob.icon][/villagepump/bluemountain.icon].
  I recognized it instantly because I watched nishio's project and remembered the shades. w[/villagepump/sta.icon][/villagepump/kuuote.icon][/villagepump/erniogi.icon][/villagepump/ teyoda7.icon]
  When I think of a face, I imagine a real face, but this is certainly a face[/villagepump/kuuote.icon].
　I will probably continue to use "real name + face photo" as a legacy interface with society, but I think I'll work this way in places where I don't need to use my real name...