7 Days to End with You (spoiler alert)
[https://gyazo.com/942897722fc7b4b953856dc56d0df92d]

from [7 Days to End with You]
7 Days to End with You (spoiler alert)
That's a difficult one. This is the only place I can tell.
[https://gyazo.com/8386fa86060e2bb0118684ef8fbabcd9]
I thought it might be days of the week on the calendar, but I guess it's a 7 decimal system.
Once I understood the word for "book" and the number tense syntax, I knew I could get ahead in time if I slept in bed, so I didn't guess for now and just went on with my guns.
Dead.

If you don't understand the language, you don't know what's going on in the world, and you just die without being able to communicate with this woman.

From the content of the dream, the atmosphere is that there is a war, there is some kind of guilt....

There's a cooking system that's very flexible, but what's the mystery behind this?
　Or that cooking a dish that reminds you of something.

2nd play
make a serious effort
[https://gyazo.com/c5ac507075a09c9089aa556b6fe04e6f]
You can also see where words appear in the in-game UI, but it is only an aid.
First, assign a writing style that is easy to write for the printed letters of this world, and then guess the pronounceable sounds.

Miscellaneous frequency analysis
[https://gyazo.com/53eb93ed7c8a1e032c2c0b63670a9a5d]
There are a few other letters in the word list, but, well, if the frequent letters can be worked out, that's all that matters.
Women are amelier.
Other words that appear repeatedly are
Hahirulco.
kokihanokugureyoki (landlocked variety of sockeye salmon, Oncorhynchus nerka)
Mihinoyakiyo (breed of chicken)
Bubibiki (bodhisattva who looks over children, travellers and the underworld) (travelers)
it has become (formal)
[https://gyazo.com/e68e12a68381757c80fb9e251a613ec8]

I think one of them is my name, but I'm not sure which one, maybe Hahirulco...

What was entered into the dictionary last time is carried over.
So, well, if you put in a wrong guess, it will carry over too.

I realize you can read newspapers from the last time you played, so it seems like reading and understanding them would be necessary for your perception of the world, but I doubt it.

Second Scene
[https://gyazo.com/ed003c356c0cb4858cd6ba8313a52625]

Two new letters came up, and I agonized for a while about what sound to guess, but then I decided to make them both long sounds because I don't think I'll ever need to identify words with different low-frequency letters.
Well, I thought it would be a good idea to think about it when it appears at the top of the list or when a distinction needs to be made.

At the negative/affirmative question, you refer to yourself and the main character while saying Bugouille, Amelie, Bugouille, and Yukooyo, I didn't notice that the first time I played it.
Therefore, the main character was decided to be Yuko Oyo.
Well, it was only mentioned once in the first scene, but it was satisfying because it was the first voice to the protagonist when he woke up.
So the questioning scene, which doesn't go on when you agree, was a state of nodding and not talking, when you're being told to talk about something.
"Can I talk to you?" or "Can we talk?" I'm still not sure if it's "talk?" or "talk?
At first, I registered the words taught in the picture.

The second word in the clock is the mysterious frequent long word "kokihanokugureyoki" I wonder what it is. It appears both in the sentence and before the hatena.

When you touch things, it tells you what to say, but it's overly detailed, so you have to start with something distinctive.
[https://gyazo.com/0d50e1e74365f23d60287dcfaff4dbd8]
I did the "get mad at him for trying to go outside" with Amelie herself.
Vuo would be "no", ocole has come up before, but I still don't know what it means.
　The places that came up were Goukiri, Alibubu, Okore, right before I denied it and asked him to draw a picture on a piece of paper.

[https://gyazo.com/467b6a2405e3b40654cf7fbd38069c4e]

What, you're a woman?
They certainly didn't say it was a man.
Genolthal would be, well, a picture.
Is ummeuge~ "we"?
Mebuyoko is a city, or a country, or something that looks like the other side of the river, I wonder if there was a war after all.
I wonder if that's how the hero was injured and rendered unconscious.

[https://gyazo.com/e1e41b7ecd050fa6e9941bb07b83333f]
Some questions arise in the back of the kitchen, I deny them and they stop.
What happens when we affirm
→Amelie sat down.

[https://gyazo.com/335e6c084d9805e0a2127e70df5a954a]

I'm feeling pretty stuck.
Will there be more tips as we sleep and time progresses?

I got sleepy when it got dark.
[https://gyazo.com/fe0262535925cb18ac045fdebc5d4e00]


I guess "a lot" for O'Kole.
It's like the number of times, not the part of the body, that I get angry when I hit the body. There is a book that is ocorre.

Mebuyokoh, referring to both the alchemical bone-like material and the city-like thing outside the window... disturbing...
What we see in the city is "a lot of mebuiocor"...dead bodies?

I noticed that I can read the labels on the alchemical homunculus thingy.
　6-2 The First Successful Alchemical Corpse?
　Hmmm, I saw the word "Bihakikou" with a hint of death on it in my section of the newspaper and thought, "Oh?" I thought, "Oh?
[https://gyazo.com/fc03f9575b37959f8c77b0d4d5c7ad8c]


I told him I was sleepy and he said, "It's wonderful to understand a few words," but then he talked a lot and I accidentally failed to take notes.

Questions for Day 2 are Miuki Meyobi and the unspecified word 3 in the shooting star episode.
Words spoken with trouble.
Maybe it's "grief." Maybe "forget."
[https://gyazo.com/800f504da80905d876082dabf632c84c]
Let's forget about it.
(degree of) conformity



