Guilt in the Game
I saw a story about playing games and feeling guilty for spending time on it.

I haven't put it together yet.

Comparing games to productive activities, do you consider games to be an unproductive use of time?
　What is the measure of "[productive]"?
  allegory
  　Some people make a lot more money in day trading than most people work.
  　If you miss a day, you don't get the money you would have earned that day, this is a loss
  　So every day I sit at my PC without a break and continue to watch the market changes.
  This is "productivity" being measured in "monetary" terms.
  　Because they are so good at creating value as measured by that measure, they perceive "what they didn't get" ([lost earnings]) as a loss when they didn't do it.
  　[trade-off between exploration and utilization], biased toward utilization.
  　　Not using the system is perceived as a loss, so exploration is not possible
  　Personally, I think this is suffering caused by [attachment] (Buddhist idea).
  　　You can make as much money in one day as a normal person makes in many days, so it would be a lot easier if you let go of the "wanting more" feeling.
  　　He believes that he is one of the few people in the world with the ability
  　　　But what you get out of it, you can't take with you to the afterlife.
  　　　Attachment to "worthless things" in this life.

　What is the basis for the value that "productive use of time is better than unproductive use of time?"
		axes of values
		Internal? External?
  Are you unconsciously distorted by the values of others?
  　For example, by the reaction of the parents.
  　　Were they imprinted with certain values by being scolded for playing games and praised for studying?
  　Is "spending time productively a good thing?"
  　　The Problem of Defining "Good"
  　>[Epicurus] believed that the purpose of philosophy is [the rational acquisition of happiness].
  　　Does spending time productively bring happiness?
  　　　If you enjoyed playing the game, didn't you gain happiness?
  　　　It doesn't seem to be a pursuit of happiness to clear a game that is not very interesting out of a sense of obligation, thinking that it would be a waste if you don't clear it now that you've bought it.
  　　　If you're feeling unhappy by interpreting that you've "spent too much time playing the game" after playing the game, then that interpretation is what's harmful.
  　　Is "spending time happily ever after a good thing?"
  　　　Here's a thought
  　　　I'm an Epicurean hedonist, and the purpose of life is the rational pursuit of pleasure!
  　　　　Talking about the quality of pleasure [quality of pleasure].
