(7.2.3.2) Knowledge gained from others has low value
We learned that knowledge can be acquired at a low cost by learning the same field as a person nearby in previous [(7.2.3.1) Getting knowledge from others is low cost]. However, the results obtained from knowledge are low. Why is that?

If you learn from only one person, you will be a subset of the person. The figure expresses the knowledge amount of each field of Alice and Bob. In the case Bob learned only from Alice. (*13) Bob will be inferior to Alice in all fields.

[https://gyazo.com/524b989560d68e5466586714aee79234]
Alice and Bob who learned only from Alice

Which do you want to work with either Alice, the most knowledgeable in the organization, or Bob, the second? Of course we would want the most knowledgeable person. As a result, the opportunity of contribution will focus on top people first.

As people work, time is a limited resource. Requests concentrates on Alice, so Alice chooses what she want to do (*14).  Let's say Alice and Bob can use 5 units of time per day. There is a work X which generate 100 valueable results in 3 units of time and a work Y which generate 100 valuable results is generated in 7 units of time. Which task will Alice choose?

[https://gyazo.com/d211a182ed37e9349ded918494404957]
Which task would you choose A?

Job X produces approximately 33 achievements per unit time. Job Y generates about 14 achievements per unit time. Naturally Alice gives priority to efficient work X. She will do work X in three unit time, produce 100 achievements, and then she will do work Y in the remaining two unit time to produce about 29 achievements. With this, Alice's time has been exhausted. The remaining work will go to the second place, Bob. B uses 5 unit  time to do job Y and produces about 71 achievements.

Well, let's compare the achievements ​​each of them produced using 5 unit hours each.

[https://gyazo.com/53b291d5f0cc056e216b1b7f6d12730a]
Alice gives priority to work X

Alice got 129 and Bob got 71. Alice is generating about 80% more value than Bob. If you decide their salary, you will obviously pay Alice a high salary.

Have you noticed? Even if Alice does the job X, Bob does, 100 values ​​will be born in three unit time. In this problem setting, Alice and Bob have the same abilities. Nevertheless Alice got 80% higher outcome than Bob. Why is this?

The concentration of requests for Alice happened by what the person who asked the work recognized that "Alice is better than Bob". In other words, the difference is born from Alice's "most detailed person" position. Based on that position, Alice showed high productivity by choosing the job.


*13: This diagram is the "[knowledge distribution chart]" introduced in [(Column) Knowledge Distribution Chart]. In this chapter, you will see various variations of the knowledge distribution chart.

*14: Some people may think that it is impossible to discard tasks. Let's read again [(2.2.4) Prioritize important tasks].

