(7.2.4.1) Knowledge of two peaks
The same thing happens even in a crossover of fields. Suppose Alice is more detailed in the field X than you, Bob is more detailed in the field Y than you, but you is the only one who know both.

From the viewpoint of Alice, you know X a little and know Y much. From the viewpoint of Bob, you know Y a little and know X much.

[https://gyazo.com/62925d66ba9004d2cffd7b3c6f6b7ca5]
Knowledge of two peaks

Communication between people is smoother with more common knowledge. If we only want to make communication easier, we can make a group of homogeneous people with almost the same knowledge. But ideas comes from a new connection. If we want to create a new ideas, it is preferable that people with different knowledge gather.

In order to create ideas that span fields X and Y, we need to bring together knowledge in both fields and create a connection. However, Alice and Bob have difficulty communicating because there is little overlap of knowledge. You have overlapping with both A and B, so you can easily communicate with either. (*16)

[https://gyazo.com/4e05d5ab374c7f04c7ba437335b4a68a]



The idea that this type of personnel is worthwhile is widely known. For example, the Ministry of Education, Culture, Sports, Science and Technology (MEXT) introduced three types of human resources in 2002 "Science and Technology Human Resources Needed for Japan." Type I has a deep expertise in one specific field. Type T has both a wide range of knowledge and a speciality in one field. Type Pi(π) has multiple specialties. It is argued that it is important not to deepen knowledge only with a narrow specialty field, but also to have broad interest in peripheral fields and completely different fields, not to be bound by the frame of expertise. (*17)

[https://gyazo.com/79e487392ca82cd95047547e1a6d9271]
Type I, Type T and Type Pi

Time is limited. Is it better to invest in raising our expertise? Or is it better to invest in order to make it wider? Let's think about this in next section.

　Note 16: You may find it surprising. It is because you think the ease of communication in analogy of physical distance. If the physical distance between you and Alice is one meter, and the distance between you and Bob is one meter, then the distance between Alice and Bob is always less than two meters. This is called a triangle inequality. However, when it comes to the distribution of knowledge, it is possible to go from a situation where the distance between Alice and Bob is as if they are one kilometer apart, to a situation where the distance becomes much closer when a person such called an interpreter or translator who can communicate with both of them steps in between. The triangle inequality does not hold.
　Note 17: In [(6.2.1) Explore inside you], I introduced Young's idea of creating ideas by combining special and general materials. It is a very similar composition.

 Note: In the figure of Type Pi Human resources, the Y axis of [knowledge distribution chart] is inverted. The purpose is simply to compare it to the shape of the letter T. It's not a significant difference. Type Pi = Two peaks.
