Next Action for the Engineer's Intellectual Productivity English Translation Project should be decided.

[/nishio/kei.icon]What would you like to see happen in this conversation?
[/nishio/human.icon]Next Action for the Engineer's Intellectual Production English Translation Project should be decided.
[/nishio/kei.icon]What kind of "Next Action" is that "Next Action"?
[/nishio/human.icon]Now that I've roughly finished translating to the end, I'm thinking about what to do next.
[/nishio/kei.icon]What kind of "what's next" is that "what's next"?
[/nishio/human.icon]Specifically, I'm torn between making it readable in Reader, reflecting the revised differences in the 4th edition, and doing a paper version of chapters 6 and 7.
[/nishio/kei.icon]What kind of "Reader" is that "Reader"?
[/nishio/human.icon]Static delivery mechanism for content on Scrapbox
[/nishio/kei.icon]What kind of "on Scrapbox" is that "on Scrapbox"?
[/nishio/human.icon]This time, we are experimenting with putting content on a wiki as a way of expressing knowledge differently from books.
[/nishio/kei.icon]What kind of "content" is that "content"?
[/nishio/human.icon]English translation of book contents
[/nishio/kei.icon]What kind of "book" is that "book"?
[/nishio/human.icon]"The Intellectual Production of Engineers"
[/nishio/kei.icon]What kind of "engineer" is that "engineer"?
[/nishio/human.icon]I
[/nishio/kei.icon]
 > English translation of book contents
 Is there anything else about this "book"?
[/nishio/human.icon]I put it on Scrapbox because it's a book about intellectual production and I think Scrapbox is a useful tool for intellectual production.
[/nishio/kei.icon]
 > English translation of book contents
 Where is this "book" located?
[/nishio/human.icon]Japanese version available at bookstores, English version at Scrapbox.
[/nishio/kei.icon]What kind of "Scrapbox" is that "Scrapbox"?
[/nishio/human.icon]A wide variety of articles, not just book content, have been written over the past few years, exceeding 1,000 pages.
[/nishio/kei.icon]Where are those "books"?
[/nishio/human.icon]The English version of the book is chopped up and placed scattered throughout Scrapbox, so there's not enough navigation to read it as a book, and I'm hoping Reader can do that.
[/nishio/kei.icon]What do you value?
[/nishio/human.icon]The conversation right before [/nishio/human.icon]is a breeze to read, but it's not, and "Scrapbox is good for intellectual production, that's why I put it in Scrapbox" seems important. In other words, I see value in what leads to better intellectual production.
[/nishio/kei.icon]Anything else about that "Scrapbox"?
[/nishio/human.icon]Scrapbox is limited in its expression, and I was thinking that it would be better to have breadcrumbs when it comes to readers, but it's not good enough to do that in Scrapbox, and so I was thinking of using Scrapbox Reader
[/nishio/kei.icon]What do you hope will happen regarding that "Scrapbox"?
[/nishio/human.icon]It would be nice to have book-like navigation without killing the intellectual and creative support that Scrapbox currently has.
[/nishio/kei.icon]What needs to happen to "Scrapbox" for that to happen?
It would be nice to be able to add that extension to [/nishio/human.icon]Scrapbox, but the mechanism currently provided does not allow it. I was thinking of creating a book-like navigation in Reader, but that would not satisfy the "without killing intellectual creation support" requirement.
[/nishio/kei.icon]With regard to "Scrapbox", can it?
[/nishio/human.icon]Cannot
[/nishio/kei.icon]
 > It would be nice to be able to add that extension to Scrapbox, but the mechanism currently provided does not allow it. I was thinking of creating book-like navigation in Reader, but that would not satisfy the "without killing intellectual creation support" requirement.
 How do you know about this "Scrapbox"?
I think we should explore [/nishio/human.icon]Scrapbox by itself a bit more to see if we can achieve book-like navigation.
[/nishio/kei.icon]Where is that "Scrapbox" located?

https://keicho.netlify.app/#talk=zdJ1iDTCyzTXc7zeYng4
#KeichobotLog