pIntEn Translation completed up to chapter 7
from [Engineers' Intellectual Production English Project].
pIntEn Translation completed up to chapter 7
　Future Tasks
　　Translation of Chapter 7
　　　This is the most important
　　Make it readable in Scrapbox Reader
　　　Fix the domain so that incoming links are not wasted.
　　Chapters 6 and 7 reflect [revised differences for the 4th printing
　　Multiply chapters 6 and 7 with a grammar check in Grammery
　　Typesetting of chapters 6 and 7
　　　It's not that important, but I'm inclined to DONE and be done with it.
　　Toward a better network structure on Scrapbox
　　　This is of interest, but the definition of complete is unclear

2022-01-28
>What is that "right"? We touched on this a bit in Chapters 2 and 5, but this is an important point, so let's dig in.

I'm talking about "a little."
Chapter 2 starts with "How do you pick one task?" and then "Prioritization is a difficult task in itself" and "Values are verbalized bottom up."
Chapter 5 talks about "don't look for quality" from the beginning, write it down first, and then organize it subjectively without seeking objective correctness, "group organization requires a change of mindset".

I'll hold off on this and move on, but I may add some guts later. Like adding a "look back" column here.
The explanation that follows is about the definition of correctness.

>To illustrate this with the metaphor of stacking boxes that I have used in this book.
in [(1.1.2) Modeling and abstraction]

>Suppose we use another knowledge Y as a reason to show that knowledge X is correct. Without showing that that knowledge Y is correct, we cannot say that X is correct. With this approach, somewhere along the line, you are deciding "this shall be correct" without a reason.
→ need to be decided without any basis.

I felt that "it will be" had a strong negative nuance.
It's better to be objective and in the form of "necessary", right?

DeepL too smart
>For example, if there is a set {A, B, C}, a set of {D, E} and a set {F, G, H}, select one element from each and {A, D, It is possible to create a set called F}.
>For example, given the sets {A, B, C}, {D, E}, and {F, G, H}, it is possible to select one element from each and create the set {A, D, F}.
I almost accidentally passed it over because I translated it correctly, but the English sentence is broken.

The case where you're pointing across the page with a directive, Scrapbox-wise, I'd prefer to keep it independent.

link to site
`https://scrapbox.io/nishio/(1.3.1.1)_Lazy_Evaluation_Study_Method`
`*16: The idea of connecting afterward is also related to [Connecting Dots] introduced in Chapter 7, [(7.1.3.3) we can only connect dots looking backwards].`

Maybe you could touch on this when you write your Scrapbox article.
[keep a journal in a private one-person project].
	[bottom-up verbalization of values = iceberg model = ConnectingDots].



>*11: Of course, if you take on all the requests that come in, you won't have time to reinvest in your business. Choose the ones that are likely to lead to results and take them on. Use the fact that you have a lot of requests as a reason to refuse other requests. We learned about proactive task selection in [(2.2.4) Prioritize important tasks].

---
[(7.2.4.1) Knowledge of two peaks]
 Note: In the figure of Type Pi Human resources, the Y axis of [knowledge distribution chart] is inverted. The purpose is simply to compare it to the shape of the letter T. It's not a significant difference. Type Pi = Two peaks.

If we take an ongoing specialist strategy here, the first step is to acquire some knowledge of the X field through training new employees and imitating senior employees.
Once evaluated as passing, they will not further enhance their knowledge of the X field.
Invest time in acquiring knowledge in new areas y

[https://gyazo.com/601a19ae968c7f501b7d00db71ec741b]

[https://gyazo.com/36e9ec6085a8851dd9f2c65c690729f0]
No, X is not illegal.

+ even after the project.
Belonging to more than one organization may seem like a hurdle. Suppose you form a joint team with someone outside the company and work on a joint project as your company's business. This is an opportunity to be a trader. If you communicate only with people inside your company, you will not be able to take advantage of this opportunity. On the other hand, if you communicate and exchange knowledge with people outside the company, you can create value as a trader even after the project is completed.

>- Note 21: There may be cases where an organization is connected inside and outside the organization, or where multiple organizations are connected.
>+ There are many possible cases, including those that connect internal and external organizations, those that connect multiple organizations, and those that connect multiple sections within an organization.

The "How Engineers Learn."
"Engineer's way of learning"
So it's translated into.
Then "The Intellectual Production of Engineers" is
"Engineer's way of creating knowledge"
Maybe it's okay to be a "good" guy.

2022-02-09
Translation finished!
