Three characteristics of knowledge creation
from [knowledge creation company].
Three characteristics of [knowledge creation
p.15
> First, metaphors and symbols are often used to express the inexpressible.
> Second, in order to spread knowledge, individual knowledge must be shared with others.
> Third, new knowledge is created in the midst of ambiguity and redundancy.
 [Metaphor] and [analogy]
		>With metaphors, people begin to combine the known with the new and express what is known but difficult to put into words. Thus, the use of metaphors in the early stages of knowledge creation is effective in eliciting commitment to the creative process....
		>Analogy is a more logical way to characterize two ideas or things than metaphor. It clarifies what is similar and what is different between two things. In this sense, analogy is a mediator between pure imagination and logical thought.
		I wrote in [(6.2.4) Parables, Metaphors, and Analogies] of The Engineer's Art of Intellectual Production
	From Individual Knowledge to Organizational Knowledge
		>New knowledge always starts with the individual and...
	[Ambiguity] and [redundancy].
		>The ambiguity of the mission given by Honda's top management caused confusion within the development team. As paradoxical as it may sound, this confusion actually gave rise to a very clear sense of direction for a completely new car. Ambiguity is sometimes not only a useful source of new direction, but also an opportunity to find new meaning in things and to rethink things anew. In this sense, new knowledge is born from chaos.
		　Clear top-down direction leaves no room for exploration.
		>Creating an organization with redundancy is critical to the management of the knowledge creation process. Redundancy is very important for the management of the knowledge creation process because it promotes frequent dialogue and communication. Redundancy creates "cognitive common ground" among employees and helps transfer tacit knowledge. Only by sharing overlapping information can organization members understand each other's struggles to express what they are trying to express. This redundancy in information sharing allows new formal knowledge to spread throughout the organization and become the property of each individual.

