rotational force
In Dominion, the term refers to shuffling frequency.

The problem is that when you buy a powerful card, you tend to focus on the advantage of being able to use it faster, but when you buy a victory point card, it comes to your hand just as fast!

A separate "rotating control force" could be considered. A deck that simply reduces the number of cards by compression has no control.


[https://gyazo.com/8973296dfece010d0476e4fda050b7a8]
　Relationship between turns and the probability of exceeding 8 gold for the same Big Money strategy when starting with a normal initial deck and when starting with "double the initial deck".
　　Since the percentage of cards in the deck is identical, the [average amount of money] is of course also identical
　　This difference is created by the fact that there are twice as many sheets.
　Distribution of [average purchasing power
		[https://gyazo.com/121a57a7ab8c0d3ff2d955b4d0f1a7b7]
		The colors in the legend are a bit odd, but the lower one is the one with the double deck.
		The average purchasing power in the initial deck is 3.5 for turns 1 and 2.
		　In a normal deck, buying silver coins would increase it to about 5.0 in turns 3 and 4.
		　　Often, 6 gold is reached in some cases.
		　On the other hand, the double deck has not yet been shuffled, so it remains at 3.5.
		　　It will be shuffled for the first time in T5 and will be around 5.0.
		　　It stays around 5 until T8, during which time the average purchasing power of the normal deck reaches 7.
		　　　This is a "one in two times you can buy a genus state" state.
		　　　It takes eight turns to get there, which means that the normal deck buys four genus states first, which is not competitive at all.

One definition of rotational force as "frequency of deck shuffling" made sense to me.
By this definition, the initial deck would be 0.5 and the full draw deck would be 1.0.
However, this is a wide range of values and can vary and be controlled by play in the same deck. Typical is the messenger's "you may put your deck on your discard" effect
https://wikiwiki.jp/dominiondeck/使者
This effect will ensure that shuffling will occur on the next draw of the hand, so it will be used when it is desirable, and not when it is not.
If there are times when it's favorable and times when it's not, then what we can control is power.
If we call the rotational force "deck shuffling frequency," then there would be a separate "rotational force control force," and if we call the control force "rotational force," then "shuffling frequency" would be "rotation.

Well, it seems that the term rotational force is already widely used to refer to frequency, so it would be best not to change the meaning.

https://wikiwiki.jp/dominiondeck/借金
