A common language is created.
[https://gyazo.com/31640e3a9685d14fd794d2dba3aa0987]
　1: Alice has something she wants to express in a blur, but doesn't know just the right word for it.
　　It may be that Alice simply doesn't know, or there may not yet be a corresponding word in the world to begin with.
　2: I dare say that Alice could be expressed by a combination of existing words A and B.
　　For example, "[properly subjective]", "[intersubjective]", "[dwell-think]", "[institutionalized language]", etc.
　3: Bob hears that combination of A and B and thinks, I don't understand; I don't feel like A and B are well connected.
　4: Bob thinks for a while and says, "Well, if I think about it from this angle, perspective, and point of view, there is a relationship between A and B. This must be what Alice wanted to say! I'm sure that's what Alice meant!
　　At this point Bob thinks, "I get it!" but of course it is an untested hypothesis whether this "interpretation" FB is consistent with what Alice "wanted to tell" F
　　This "I get it!" is still fuzzy in Bob's brain, so he can't tell Alice to verify it.

[https://gyazo.com/53174d8b532158193c51204cea1cb537]
　5: Bob tries to put this "I get it!" and thinks, "In essence, the relationship between A and B is the relationship between C and D."
　　Here, "what we know" that had not yet been verbalized is being verbalized.
　6: And when I told that to Alice, she said, "What? That's totally different. or something like that.

Through this kind of exchange, a common symbolic space is created for the two of them.
　[https://gyazo.com/25c09ad411ea63d8ee4c6730552ca218]
　Each of us sees things differently from the perspective we originally had, but we arrive at a structure that allows us to do so without contradiction.

This "exchange" is a common experience, a [co-creation] in the SECI model.
Through this process, Alice and Bob have a [common language].
　If someone hasn't gone through that process, I think, let's try to express it in a way that they can understand it.
　This adds constraints and costs to communication.

relevance
　This picture is [a diagram of felt sense and symbols
　　I tried to write without using the terms [experience process and meaning creation].
　　The term "[symbolic space]" doesn't have much of an explanation written on it yet, like the A+B that just came out of Alice.
　[6 and 9] or [neither a circle nor a square].
