Dominion 2022-02-21
[https://gyazo.com/7d74cf7fb5a9728d050c0cfd604e311e]
Let's think and play properly. The opponent is Hard AI.

Hmmm...lots of cards I've never seen before.
First, think for yourself without looking at online explanations.
 Fool's Gold, First Look.
 　A treasure that becomes more powerful when gathered together. 1 gold for 2 costs is inferior to a copper coin, but if you get 2 out, they cost 5 gold, which is equivalent to a silver coin gold coin, and since they cost 4, they are a 5-cost bargain compared to a silver coin gold coin. The problem is that you need a considerable amount to cover it.
 　I feel like I have to buy these strong systems when they gather because I don't want them to be bought up by the other side.
 　In situations where you start buying endgame victory point cards and the deck thins out, can you exchange them for gold coins? Nice.
 Hori Terminal Draw
 見張り、初見
 　I feel that not consuming actions and requiring the disposal of one piece after seeing three pieces is very restrictive, and I wonder if it is effective in compressing the early stages of the video and the mansion full of video.
 　I have a feeling it will be a dead card after compression.
 Butler, I've seen it before, but what was it?
 　Draw, coin, and discard selection cards
 　If destruction is the goal, is this better than watching? After compression, you can use it for draws or coins.
 　Uh, unlike the lookout, it's a terminal action.
 Conclave, first time
 　+2 coins
 　If you have an action card in your hand that is not on the field, you can use it for another +1 action, so it's really +2.
 複製
 　Another card is acquired when a card with a cost of 6 or less is acquired in the tavern reserve.
 　You can earn 2 gold coins when you buy gold coins.
 公爵　特殊勝利点
 船着場
 　Draw + purchase, lasts 2 turns
 鍛造
 　Destroyed and cost combined to acquire
 宮廷、初見
 　3 times action use
 Chameleon Habits
 　Draws and coins are swapped.
 　Mhm, the conclave is turning into a draw card. Wouldn't it be pretty good if you could use the card you drew after you drew it?
 Project: Evil Deviousness
 　You can accumulate 1 draw right each turn.

Supply Check
　Action increase: Conclave, Court
　　Court + butler" yields 6 gold.
　Draw: moat, butler, conclave + chameleon, landing place, deviousness
　　The devious "accumulate tokens and use them when you have a bad hand" approach sounds good.
　購入:船着場
　Compression: watchman, butler, forging
　Attacks: None
　特殊勝利点: 公爵

方針検討
　I'd like to verify that the conclave can perform the drawn action.
　Compression and buying a genus state seems like a good idea.
　There could be a line to increase the dukedom all over with duplicates.
　I'm going to play with this supply a few times, so let's go the route of using something I've never used before first.
　　Butler, deviousness. Thereafter, while compressing with the butler, buy fool's gold for 2 gold, silver coins for 3 gold, a conclave for 4 gold and a landing place for 5 gold.
　　I think it is difficult to aim to draw out every turn because there is no easy-to-use action increase and draw. I would draw more to increase the turnover rate.
　　　If the landing place comes once every two times, it's always a +1 purchase, so the court + butler will be able to make good use of the 6 gold produced by the court + butler.

Let's do it, Round 1
　AI has been playing exactly the same w
　T3: Destroy the mansion and fool's gold for 2 gold
　T4: Conclave with 4 gold and silver coins, but learning is a priority.
 T5: Butler, Conclave, Copper 3
  I'm torn between discarding more with the butler or not and buying a landing place, because I just discarded two cards, so if the landing place comes in at this time, it'll be every turn draw and increase the turnover without compressing it now.
  7 gold, so you can buy a court, but not now, I feel.
  I have six cards left in the deck, so if I draw on the butler, the landing place I just bought is instantly shuffled.
  Conclave, 2 draws with butler, copper coin comes, 7 gold, 5 gold to buy a landing place.
 T6: 銅貨3愚者の黄金1
 　Buy silver? Draw 3 for a devious token?
 　Let's draw three.
 　執事、船着場、5金
 　Backstage playing the boatyard and pulling a conclave.
 　Oh, but I also drew a copper coin, so that's 6 gold. I can buy a gold coin.
 T7: 執事6銅貨
 　Compression or buy a gentry state for 8 gold.
 　Compress and buy silver coins for 4 gold?
 　Oh, and we're buying more, so we can have fool's gold x2.
 T8: Conclave, copper coins, fool's gold, gold coins
 　Conclave with +2 gold and poof!
 　Shall we try the conclave + chameleon?
 　　There is an option to use devious tokens...
 　I drew fool's gold x2 w
 　 I wanted to verify that I could use the action card I drew.
 　全部で13金、購入1→属州
 T9: 執事、船着場、銅貨3
  Well, first of all, I'll use the pier.
  4銅貨
  Is the Fool's Gold x2 subtle here? Conclave?
 T10: Opponent gains a province, will you turn fool's gold into gold?
 　Hand, copper coins, fool's gold x2, gold coins, so even if you discard one, you can still buy a genus state (Note: misjudgment).
 　Oops, you can replace any number of cards in your hand, or just one.
 　I was only going to use those eight gold pieces to buy the genshūtō, but I got a conclave and gold coins at the dock.
 　Oh, fool's gold, if you destroy one of the two pieces, the rest is not one gold!
 　The chameleon conclave safely drew the fool's gold.
 　Can I use an action card drawn in a conclave?
 　12Kin, Genus and Conclave
 T11: 執事、銅貨4
  Draw 4 cards with the devious tokens!
  Chameleon Conclave with 2 draws
  The landing sites drawn by the conclave can be used.
  　Correct behavior?
  　Well, if it's available, we'll use it.
  　Draw more conclaves
  Chameleon Conclave Draws Conclave
  　I can use the original butler I had, but not the conclave.
  　Oh, because the conclave is already in place.
  　I have 13 gold now, so I have the choice of destroying the copper coins with the butler, or +4 coins with the butler and the conclave to buy 2 genus states.
  　I'm at the end of the line, so I'll buy a genshu.
 T12: Opponent also buys a province and has one card left, the score is 25 for me and 22 for opponent, and I have 2 gold coins and fool's gold in my hand, so I cannot reach the province.
 　I was going to draw in a trick, I thought.
 　Oh, the gold coins came from the effect of the shipyard. W. Purchase of the province of the genus and victory.

[https://gyazo.com/58eda1a9db9a951ec5e2a2919dc8ec21]
相手は執事、船着場。

第二戦
　We won easily, so now let's ban the conclave and duplicate, duke and ducal.
　I can't get more actions, by the time I get the court, the deck is full, should I use less terminal actions?
　　And don't even get me started on the boat docks.
　　I'm having a hard time deciding whether or not to compress with a butler.
　　Hmmm... I still think the previous plan is easier to work with.
　　Duplicates move to the mat if you use them, so they don't squeeze the deck as much?
　　Is it inevitable that the Duke's Dukedom will reduce the turnover of the deck one way or another?
　　I feel like I should throw away the copper coins, though.
　　Should I play it as differently as possible to learn, or not include a butler, first hand silver + duplicate (duplicate stero)
　銀貨
　Play duplicates, 4 gold to buy duplicates or silver coins, or silver coins, or, nay, insurance against accidents in hand with deviousness.
　6 gold, buy gold coins and activate replication.
　5 gold... the dukedom is not ready yet, maybe a silver coin.
　複製、5金
　　Three draws for deviousness!
　　10 gold.
　　buy a state of the genus
　7 gold, buy gold coins and duplicate
　6金、金貨
　6金、金貨
　8金、属州
　複製、5金
　　4 draws by deviousness!
　　12 gold, buy a genus state
　My opponent and I each have three cards, and we'll be done before we can buy the public domain.
　　Oh, right, I should have bought the dukedom instead of the silver coins.
　10 gold to buy a province
　The other party also buys and loses.
　　僕:属州4 屋敷3
　　AI:属州4 公領2 屋敷2
 AI was again a butler plus a landing place.

Third round with the same strategy
　複製+銀貨
　conspiracy
　Reproduction, fool's gold at 2 gold
　銀貨
　5 gold, 2 draws by deviousness, gold coins purchased and duplicated.
　Play duplicate, buy gold coins and duplicate
　金貨を購入
　4 gold, 2 draws for deviousness, buy a gentry state
　　Let's buy public domain instead of gold from here.
　Reproduction, 6 gold, not gold coins, public domain, to be reproduced.
　The other party bought a gentry state, do you want to turn the kingdom of fools into gold coins?
　　If I change it, it will be 7 gold, so I'll pass.
　6金で公領
　Duke for 6 gold, now that he has 4 dukes, he will have 4 dukes from then on.
　8 gold. If you buy a genshu, you have one card left, if you buy a genshu, it is 33 to 30, and if your opponent can buy a genshu next time, you will lose the game in reverse.
　　Possibly, there is a line that if you draw 4 in a devious way and get a duplicate, you can buy 2 dukes to make it 8 points 35 to 30, and your opponent wins the genus and turns it around, but the game is still not over by 1 point.
　　　If that happens, I get 5 points in the public domain, so that's an advantage.
　　Which is correct...
　　　8 cards in the deck, 12 cards in the discard pile... the duplicate would be on the discard side.
　　Purchase of the genus state
　Oh, the duplicate came in the draw w
　 W lost the game in a predictable upset.
　 僕:属州3公領4屋敷2
　　AI: 属州5公領2
 Let's consider the side that draws with Undo.
 Draw 4 in deviousness, play duplicate, 9 gold but buy duke and duplicate.
　　The other party buys a gentry state, 35-36.
　5金で公領40対36
　 The opponent buys a gentry state and loses.

 Well, I still think it's a little too much to ask for this line.
 　But I felt that the frequency of duplicates is very low.
 　Can we get away with compressing it with a butler?

Round 4 to be done by butler + duplicate
　If you buy a butler and a duplicate on your first move, you'll have an accident, so either butler + deviousness or butler + silver coin.
　　I'd rather have a bad card than a silver coin because the bad card averages +1 card, so 1.4 coins per turn, and it compresses it even more.
　Butler 3 gold, 2 discarded, fool's gold.
　3金、銀貨
　4金、複製
　Butler, 2 copper coins, fool's gold, mansion
　 2 discarded and fool's gold.
　複製5金
　　4 draws for deviousness
　　The butler's here.
　　複製、金貨を複製
　The other party purchases a gentry state, and the fool's gold is made into a gold coin?
　　If you do, 6 gold, if you don't, 10 gold.
　　Let's buy a genus state.
　　　Looks like the other party turned it into a gold coin.
　複製4金
　　Hmmm, I only have one draw... but I'll use it.
　　Here comes the gold coin!
　　複製、金貨複製
　Butler, 7 gold, fool's gold. Would you trade a gold nugget of fool's gold?
　　2 gold in exchange and a butler, and a genus state.
　7 gold, fool's gold >> genus without exchange
　Duplicate 4 gold, 2 draws with deviousness.
　　8 gold, duplicate, genus state.
　The opponent bought the genshu and lost by one point.
　Hmmm, this one doesn't compress very well with the butler doing the "discard two pieces and fool's gold" thing twice.
　　僕: 銅貨5 愚者の金塊1 銀貨1 金貨5 他7
　　AI: 銅貨6 愚者の金塊4 金貨6 他8
　　You have a lot of fool's gold, you have more purchase rights at the landing, and you're using the extra coins as fool's gold.
　　Hmmm, here I used the boat landing too, it's just an imitation of AI...
  Okay, let's use the conclave.

Round 5 in silver coin conclave duplicate
　First Hand Silver Conclave
　6金、金貨
　2金、堀
　Conclave for +2 coins, moat for 2 draws, 7 gold for gold
　5 gold...by devious means.
　5 gold moat, 6 gold in belly draw, gold coins
　5 gold, duplicated here
　5 gold moat, draw and gold coin
　Conclave 5 gold, draw 6 gold, gold coins. I think I've had enough by now.
　複製6金、公領2枚
　Draw at moat, 6 gold, public domain
　Chameleon Conclave, 12 gold, only one right to purchase the genus state.
　複製、9金。属州
　2 gold moat, 1 genshu left, 12 points difference. Impossible. There are 8 devious tokens, not being used effectively. Even if I use these now, I can't sow them because I only have one purchase right.
　I knew, essentially, that the only additional right to purchase in this supply, the boat landing, is required for the deck.

船着場+複製で第六戦
　初手は銀貨+悪巧み
　銀貨
　複製
　7 gold... gold coins, or rather, a forge or court that is not used at all?
　　(The courts don't overlap in any way, no matter how you think about it.)
　 Can you dispose of a batch of copper coins by forging from a devious draw, or two silver coins into a gold coin, or a gold coin and a mansion into a genus?
　 Let's forge it in.
　銀貨
　Duplication and forging came together w
　 I'll send a duplicate to Matt and we'll get back to you on the forging.
　 moat with two gold pieces
　5金で船着場
　　Ah, there is a way to duplicate the landing place...
　　Maybe I should keep it because I can forge it.
　6金で金貨
　複製5金
　　Opponent has a 10-point lead after buying a gentry state, public domain replication.
　5 gold, you could honestly buy a public domain here, but you have 8 devious tokens accumulated, so what the hell, let's use them!
　　9金、鍛造、船着場2、堀、屋敷3
　　　I don't see more action.
　　Forging destroyed 3 mansions, moat, and 1 copper coin to gain a province.
　　Purchase of the genus state with the remaining 8 gold.
　　That makes it 18-19.
　6金、公領
　鍛造、銅貨、金貨、公領2
　 hmm
　 属州残り1、10点差
　 Draw 1 for deviousness.
　 　Genshu is here...

It would have been fun to win the same supply in two completely different ways, but it didn't work out the way I thought it would, and the first plan was the most successful, so I guess it's okay.

Oh, that's right, I said, "First, let's think for ourselves without looking at the online commentary. Let's look at the explanations.
　Collect combo parts in duplicate.
　　Duplication is a terminal action, so it's hard to increase with stero
　The reserve card is no longer on the field and is subject to the use of the conclave any number of times.
　　Scales from the eyes!
　Forging is suitable for combo decks with easy cost adjustment
　Pier Stello
　　https://note.com/urihari/n/n2daca977a912

I see... I see... I can roughly summarize them as these two.
　Pier Stello
　Duplicate + Conclave for more action, and finally a combo deck that uses the Conclave 3 times in the court for 6 gold.
　　We need a landing place too.

Let's do the landing stero first, Round 7.
　初手、銀貨x2
　4 gold, what shall I do, I'll be devious.
　5金、船着場
　Draw at the pier, 7 gold, maybe gold coins.
　Draws in the effect of a landing, 5 gold, another landing.
　8金、属州
　6 gold. Maybe we could buy gold, but I'm thinking we could do a devious 4 draw and then do a landing draw.
　　No! Let's subtract all the copper coins and buy 12 gold w genus states.
　2 gold came for 2 pieces of landing, 2 gold to buy something? Fool's gold?
　Draws the landing place under the effect of the landing place. 6 gold is there. Use the landing place! I buy a province.
　21-18, 5 gold. There are 3 gongzhou left. I could buy the gongs honestly, but I'll have to be devious and draw two to try to get some upside.
　　Success! 8 gold, buy a genus state.
　3 gold on the landing, 5 gold on the draw. One gentry left, 27 to 24. buy gongs.
　Draw!

Let's do a replication + conclave Round 8
 初手、執事+銀貨
 Butler 4 gold, +2 gold to buy gold coins
 4K gold, conclave
 5金、船着場
 Butler Conclave 3 Gold
 　Chameleon Conclave draws 2 and plays butler for effect.
 　+2 gold to buy gold coins or throw away 2 coins, but let's compress!
 　3 gold to buy silver coins
 6金、金貨
 Chameleon Conclave Butler
 　I have 7 gold. Discard and buy gold coins.
 4 gold at the pier, terminal action, so I'd say +2 gold at the chameleon.
 　Oh, I wonder if this will be +2 even if it is sustained.
 　　No, you got drawn.
 Conclave Butler 9 Gold
 　12 money to buy gentry and duplicates
 船着場複製4金
 　Draw at the landing, buy genshu and moat.
 Butler Conclave 9 Gold
 　Draw in chameleon conclave
 　Play the drawn moat
 　執事複製12金…
 　 Play duplicate, buy genus state conclave, duplicate conclave.
　They bought two genshu and lost.
　　I don't feel like I'm putting together the combo very well.
　　Is it wrong that I bought gold coins without compressing them with a butler early in the game?

Ninth round split 5-2
　初手、船着場、愚者の黄金
　Conclave with 4 gold
　Another 4k gold, another conclave? A devious scheme?
　　I'll be devious.
　船着場、4金
　　Conclave?
　Draw in conclave, 5 gold. Boat landing?
　4 Gold. Conclave? Duplicate? Draw by deviousness, 6 gold, gold coins.
　condominium boat
　　Draw in conclave, play the landing with increased action, 7 gold. Gold? No. Court? I'll play the court.
　9金、属州
　court of congress
　　Perform the Chameleon Conclave three times at the Court
　　　Is it possible to choose whether or not to use the habit each time instead of having to draw all three times?
　　　Play drawn landing sites.
　　　6 Gold 1 Action
　　　More draws, 7 gold, ugh, was +2 coins right?
　　　Buy more court already!
　　　No, let's forge it.
　Draw at the landing, court and forging draws back
　　6金で金貨
　Conclave 4 Gold
　　It's 9-26, and I can't take it easy anymore, so I'm going to draw in a devious way!
　　Concon 6 gold...
　　Two draws at the Chameleon Conclave, the landing and forging came
　　Play the landing place...can't do it (it's already on the persistent card).
　　Discard 3 mansions and 6 copper coins in forging to get gold coins.
　　One more action and there is a conclave and a landing place, draw hoping for an action in the conclave, it didn't happen, buy another conclave.
　Conclave Court 4 Gold
　　Conclave at the Court
　　　Once, draw and play the landing place, draw forging and landing place
　　　Play second conclave, play forging, discard video and fool's gold to moat.
　　　　Oh, you don't get it in your hand, miss.
　　　Third time, draw or coin, I'm torn. I already have 2 actions so I can play the remaining con ships. +2 coins would give me 8 gold and confirm the genus state. But if I draw, there's a better chance of something happening. w
　　　　Draw! Conkons ship 9 gold.
　　　Play the landing place, here comes the moat.
　　　Play digging in the conclave
　　　　Oh, I've already pulled this off.
　　　　I'd better get my coins out.
　　　I'm pulling out, but 13 gold, dreary, 23 points difference, I guess I'm a gentry, I can't catch up...
　Hori con con forge court 6 gold, it's the last turn now, so I'm going to be devious, here comes the gold coin.
　　court conclave
　　　Pulled off at 1:moat
　　　2: Forging to duplicate the conclave
　　　3: Draw and execute its duplicate
　　conclave implementation
　　15 gold 3 purchased 1 duplicate. Hmmm, even if I get 12 points for the dukedom and ducal province, I'm still 20 points behind, so I can't catch up. Can I just buy 3 dukes and score 13 points with the duke and hope that my opponent can't buy a province on the next turn?
　It didn't work.
　　I've got a feeling that if it's put together right, we could go for it.
　　I guess compression is important...

Once again, Round 10
　4-3, Butler, Conclave
　3Kin, watch
　Conclave, draw, butler play, buy silver coins
　4 money, deviousness
　The lookout, the butler, and the conclave. First, draw on the conclave, execute the lookout, discard a copper coin. Next, the butler discards two coppers and buys a moat.
　Conclave 3 gold, draw a lookout at the conclave, discard copper coins. 4 gold...buy a duplicate.
　Conclave the Watchful Butler. Conclave draws, duplicate comes in and is played. With one action left, he played 2 coins on the butler, bought a landing place, and duplicated it.
　A moat, a lookout, and a butler. Not enough action, and it's dreary, so three draws for deviousness. The conclave came!
　　If you call the dig at the conclave, you'll leave the action and you'll get a +4 card.
　　Two landing sites and a duplicate came (I wanted a conclave).
　　Oh, the pile is already empty, it's drawn out, then I guess I have 4 gold now, but that's all I have, I should buy gold coins with +2 coins at the butler.
　Butler, duplicate, landing, 1 money. Not enough action, not enough money. Chameleon the landing place and pay for the money and buy the silver coins. This brings the total to 9 gold.
　Moat, lookout, landing, 6 gold. No action! Bad draw! Conclave coming!
　Activate digging in conclave, 1 piece remaining.
　　No, you only have one conclave.
　Run a duplicate, buy a conclave for 9 gold, duplicate, add 3 more!
　　I feel like I'm screwed because my opponent has already bought 4 copies of the genus state. w
　And ship ship 6 gold. Buy gold.
　Hori Butler Con-Con Reproduction
　　Con moat, con duplicate, con butler, con lookout (empty shot because it's drawn out), run chameleon landing with one action left, all used up!
　　14金3購入。公領x3,複製。
　Draw 2 by deviousness. Skip the hand memo because you can probably draw it out.
　　Con duplication, con replication, con moat, con watch.
　　I just barely made it, but if I buy a victory point this time, it will be impossible.
　　12金。宮廷、公領x3
 Con duplicate, butler. 8 gold, that's troubling. I can buy a genus state, but I still have a 9 point lead. I'm 3 points behind with the duke x2 in duplicate...should I buy the silver at 3 or not...I would if the watchman didn't have forced discard. Or if the butler has action +1.... Hmmm...maybe the silver coin.
 My opponent bought a duke and withered. I am a duke, 6 points. Duplicate, landing place. I gain 2 dukes, and the tables are turned!
 Court Conclave! Court Conclave
 　1: Con duplicate
 　2: Con moat
 　3: No action cards available
 　船着場
 　Con butler draw
 　I have a lookout, but I'm afraid to use it, I think I have another duplicate, but oh, it came with the draw of the conclave.
 　CON duplication
 　12 gold 3 purchased, duplicates x2. got 3 dukes and got 18 points. I have 7 gold left. Court.
 Court Conclave Reproductions. Get 3 reproductions.
 　We're up by 22 points, so it's like we won, but it's hard to finish.
 4 draws of deviousness. No conclave by any chance. 10 gold to buy a genus state.
 Court steward, all in virtual currency, 8 gold to buy a gentry state.
 　We won 72-44!
　I like that the conclave and duplicate pair can be used as many times as you want to get "+1 action +2 cards + duplicate".
　　I bought miscellaneous cards early on to feed the conclave, but I could have kept the silver coins and collected them for duplication.

Whew, at any rate, I was able to play against the Hard AI, win with a strategy I devised myself without looking at anything, seal that strategy, and win with another strategy, a draw with a landing stero, and a draw combo.

追記
　I also won at the landing stelo.
　　When you only have 1 action, you may not be able to use the draw, so make the landing place +2 coins with the chameleon.
		[https://gyazo.com/9d1770e13a83e7bdcd077162d40480e9]

