Diary 2022-02-23
Learn slowly if you want to learn quickly

Dominion and Go
　What it felt like to fight the computer again for the supplies that came out of the versus game.
　Computers are weak, but there is learning, and why not.
　I think it's because you can't think at your own pace when you're playing against someone else.
　　Play with enough thought?
　　Research each card before playing?
　There is no restriction on how many minutes you have to play.
　　If it were a game of Go, I would set the timer for the match to one minute.
　　　If there are no restrictions attached to it, it means you can spend however much time you want.
　　　The shorter the holding time, the more difficult it is, of course.
　　And yet somehow the air determines the speed.
　　　It's similar to how the speed on the highway is somewhat determined by the speed of the cars around you, not by the speed limit.
　Slow Kendama Story
　　The speed of execution of the Kendama is determined by the laws of physics.
　　It is said that if this is slowed down by VR and practiced, the learning speed will increase.
　　This is also the same as "you can't learn too fast"
　difficult book
　　I don't know if I read difficult books fast enough.
　　I don't know how to read at normal speed.
　　Daring to read slowly is necessary for understanding
　I thought they were all common.
　　If you want to learn fast, you need to learn slowly.
　　Slowing it down isn't always better.
　　A condition in which "learning is hindered because we are unconsciously acting at a faster than appropriate speed."

Engineers' Intellectual Production Techniques and Dominion
　The Intellectual Production of Engineers introduced the components of various intellectual production techniques, but it's not a matter of "let's do all of this tomorrow."
　Dominion fits as an analogy.
　People who do not know the various methods are those who do not see the supply.
　　I'm not aware of that option.
　　Even in actual play, some people jump to the "favorite card they know well" and ignore the option to use other cards they don't know well.
　To know the various methods is to know the effects of each card, how to combine them, and the best situations in which to use them.
　　This does not mean "always use."
　　All cards have advantages, there are no cards you should not buy.
　　But there are "limited resources" such as money, action rights, number of cards in hand per play, etc., all cards compete for resources with other cards.
　　Deciding which cards to employ and which not to employ based on the situation is the "optimal allocation of resources," or "management strategy.
　　Dominion is a management game that can be repeated in a short time.
　　[Delay is the key factor.
　　　There is a delay between the purchase of a card and it coming into your hand.
　　I know the advice to "buy what's the first move" is well-intentioned [choice injury].
　　　You'll have a better chance of winning if your first move is fixed on a good one, rather than having absolutely no idea what you're doing and playing randomly.
　　　But it is not a matter of "If you are taught a good method and follow it, you will be stronger" or "What should I do next to be stronger? Tell me!" It creates a dependence on

Assortment of components of intellectual production
　It would be interesting to delve into why I made the decision to use Anki after all these years instead of Kozaneba when I was trying to "understand Dominion".
　In other words, Kozaneba is "a means of retaining and editing [the associative network] as it is without having to put it all in your head.
　　Anki, on the other hand, is "a means of getting the desired object into your head."
　I'm just getting started, so I don't have many concrete examples.
　　For example, I wanted to be someone who could look at a card and know what expansion it was.
　　I noticed a mark in the corner of the card.
　　However, there is no help in the UI, so you need to look at the icons to understand what they mean.
　　So I put this correspondence in my brain.
　　In the process, I learned unfamiliar English words like cornucopia and managerie.
　Already organized.
　　Card and Expansion Relationships
　　Cards and types (actions, treasures, ...)
　　Replicating this on Kozaneba is not a learning experience.
　Vocabulary acquisition
　　Knowledge representation is compressed by domain-specific vocabulary
　　　Example
　　　　Action card with "cantrip" + 1 action + 1 draw
　　　　Handes to three" opponent discards until he has three cards in hand
　　　　Action card without "Terminal Action" +1 action
　　　　"Horses are disposable laboratories" Horses are gone from the deck when used with +1 action +2 draws (back to supply)

bounty hunter
　If you buy in the first hand, you are sure to expel +3 gold 1 in the second round.

march
　Used twice, discarded and improved

Thinking in terms of the label "game" for the experience of playing Dominion is [a top-down classification of experience].
　It is impossible to know in advance what part of the actual experience will be connected to what.
　　[Connecting the Dots]
　We do it simply because it's fun, but after a certain amount of experience is accumulated, a mass emerges from that experience after the fact in a different way.
　Why didn't they try to Kozaneba the Dominion?" seems to me to be an important question that has yet to be answered.
　After all, it is associative skills, the ability to discover new connections, and other kinds of skills that link concrete "experiences" to "themes" of interest, which can only be acquired by assembling concrete experiences into a bottom-up structure.
　　Pre-classified experiences only give you knowledge of the classification, but no opportunity to develop the ability to create your own structure

Plot: Ambush 2
+1 Action
Choose one of the following: "Discard an Action card in the supply"; "Gain an Action card in the discard pile".

Dark Ages: Grave Robbing 5
Choose one of the following
"Acquire a card of cost 3-6 from the discard pile and place it on the top of your deck." ;
Discard an action card in your hand and gain one card that costs up to three more than the card you discarded."

[https://gyazo.com/33607fb7b7b7842d9addb1bc0a2cbbc3]

Turn the text you read into a card.
　You read it and think you "understand" it, but I know you don't.
　I wrote in [(3.4.1) Testing is a means of memory] that it is better to test than to read four times
　Anki, you have a column for each source URL.

Looking back as the 3-day break ends
　What I did before the vacations.
　　Watch the video of the Creating Experience Process and Meaning Study Group and add your questions.
　What I was going to do before the vacation.
　　Read over the discussion on Kozaneba and Keichobot to determine if they are additions to the engineer's intellectual production techniques.
　Other
　　Log of sentences rewritten during the process of English translation and make a list of corrections for the fifth edition.
　　Syntax check with Grammery after chapter 5
　　Bread crumb on mem.
　　Add an advertising section to mem.
　　Resumed machine translation project that was "suspended to give priority to English translations.
　After the Unexplored Results Debriefing Session
　　ZIGEN was amazing, so make sure you know what you need to experience it and buy what you need.
　　I was blown away by the impact of this, but I'm sure there were a few other things I would have liked to try, like Hidane, look back at the announcement Scrapbox
