Dominion 2022-02-27
Anti-Personnel Supply
[https://gyazo.com/225b03ffad277dc3d1f46a7ff1989316]

Nocturne: Dark Player 4 Action - Attack - Bad Luck +1 Purchase. All other players receive one of the following curses.
--------------------
When this card is acquired, 1 gold coin is earned

Means of obtaining gold coins for 4 gold

Curse: evil omen Put your deck in the discard pile.
Look at all the cards in your discard pile and place two coppers from it on top of the deck. If you cannot, reveal the cards in your discard pile.

Curse: illusion If you have neither delirium nor jealousy, take delirium.
Confusion At the beginning of your Purchase Phase, return this card and you cannot purchase any Action Cards until the end of this turn. You can purchase all but Action Cards.

Curse: envy If you have neither delirium nor envy, take envy.
Jealousy At the beginning of your purchase phase, return this card and produce only one silver and one gold coin until the end of this turn.

Curse:Famine Reveal the top three cards of your deck and discard all action cards. Add the rest to your deck and shuffle.

Curse:Fear Discard an action card or a treasure card from your hand if you have five or more cards in your hand. (If you cannot do so, reveal the cards in your hand.)
Curse: Greed Gain 1 copper coin and place it on top of your deck.
Curse:Possession If you have four or more cards in your hand, put a card from your hand on top of your deck.
Curse:Locust Discard deck top X. If X is a mansion or a copper coin, gain 1 curse. Otherwise, gain 1 card that has the same type as X and costs less.

Curse: miserable life First time living hardship - 2 win advantages, second time double hardship - 4 win advantages.
Curse: Plague Gain 1 curse
Curse: poverty Discard so that there are three cards in hand.
Curse: War Search the deck for a card with cost 3 or 4 and discard it.

Nocturne: Poet 4 Action - Good Luck +2 coins Receive 1 blessing.

Blessing:Blessing of the Earth You may discard a treasure card in your hand to gain a card of cost 4 or less.
Blessing:Blessing of the fields +1 Action +1 Coin (Keep this until the Cleanup Phase.)
Blessing:Blessing of Flame You may discard a card in your hand.
Blessing:Forest Blessing +1 Purchase +1 Coin (Keep this until the Cleanup Phase.)
Blessing:Blessing of the Moon Look at all the cards in your discard pile. You may place one of those cards on top of the deck.
Blessing: Blessing of the Mountains. 1 silver coin is acquired.
Blessing:River Blessing At the end of this turn, +1 card. (Keep this until the cleanup phase.)
Blessing: Blessings of the Sea +1 card
Blessing:Sky Blessing You may discard 3 cards in your hand to gain 1 gold coin.
Blessing:Blessing of the Sun Look at the top four cards of your deck. Discard any number of them and return the rest to the top of your deck in any order.
Blessing:Blessing of the Swamp Will-o-wisp 1 card from its pile of cards.
will-o'-the-wisp
Action - Spirit +1 Card +1 Action / Reveal deck top X. If X costs 2 or less, put X into your hand.
Blessing:Blessing of the Wind +2 Draw a card. Discard 2 cards from your hand.

Plot: Patrol 5 +3 cards
Reveal four cards from the top of the deck. Add the victory point card and the curse card to your hand and place the rest on top of the deck in any order.
5-cost blacksmith. Beneficial terminal draw for both combo and stero.

Nocturne: Persecutor 5 Action - Attack - Bad Luck +2 Coins
If no other cards are on your field, you get 1 imp. If not, all other players receive one curse.
Imp +2 card draw/You may use an action card from your hand that is not on your field.

Nocturne: Vampire 5 Nocturne - Attack - Bad Luck All other players receive one of the following curses. Gain 1 non-vampire card of cost 5 or less. Exchange this card for 1 bat.
Bats Night Action Discard up to two cards from your hand. If this discards one or more cards, replace this card with a vampire.

Night cards are after the purchase phase, so they can benefit from jade regalia, quarries, and other treasure cards.

Prosperity:Jade Seal 5 Treasure 2 coins/ As long as this card is on the field, when you gain a card, you may put that card on the top of your deck.

Prosperity:Quarry 4 Treasure 1 coin/ As long as this card is on the field, the cost of the action card is 2 less. However, it cannot be less than 0.

[https://gyazo.com/87418e7accdb8a5ae052a0b199f12d83]
protector


Nocturne: Ghost Town 3 Nocturne At the beginning of your next turn, draw +1 card, +1 action. / When you gain one, add it to your hand.
Nocturnal card similar to Village. It is activated on the next turn. Unlike Village, it is a Night Action card, so it cannot be chained even if it is drawn during the Action Phase.
It can be used immediately in the turn it is earned.

conclave
This is a + action-type card that produces coins. However, if you can't use additional action cards, you'll end up with terminal silver coins.


Nocturne: Shepherd 4 +1 action/reveal and discard any number of victory point cards. Draw +2 cards for each card you discard.
(Heirlooms: Pasture) 1 coin/win advantage for each mansion you have.
The meadows make the mansion score two points a piece in effect.

Diet building
courtier

Nocturne: Even 5 / Treasure - Fortune / 2 coins / When used, if the even on the field is: odd number of pieces, receive 1 blessing. If it is an even number, all other players receive 1 curse.

usage method
It collects a large number of idols while compressing the deck and disperses curses while receiving blessings at every turn.
If you get 5 gold in a stero deck, buy it instead of silver coins.
A single silver coin in the hand is a bonus.
Idol - Narrative Play the idol and draw in the narrative


substitute (for)
improvement
werewolf

[https://gyazo.com/f347ca56445d95ddd85d04e39b22637e]

Empire: Stone thrower 3 - stone 4
Stone thrower +1 coin/1 piece discarded X/
If X is cost 3 or more, all other players gain 1 curse.
If X is a treasure, all other players have 3 handes.
Stone Treasure 1 coin
When acquired/disposed of, one silver coin Y is acquired.
If it is the purchase phase, Y is placed on the deck, otherwise it is added to the hand.

Adventure: Dungeon 3 Persistent Warehouse
Seaside: Warehouse 3 +3 cards/+1 action/3 discard
Gold is obtained by discarding the mine.

Xiangang: mine 3 2 win advantage When you discard this card in an opportunity other than the Cleanup Phase, you may reveal this card. If you do so, gain 1 gold coin.

Empire:Female Sorceress 3 A persistent card that makes the opponent's first action card a cantrip for one turn. You can draw two cards at the start of your next turn.

Adventure:Guide 3 Cantrip/Reserve/Redraw your hand

Empire: Temple 4 +1 win advantage token
Discard 1-3 cards with different names. Add 1 victory advantage token to the temple deck. When you gain this card, receive all victory point tokens from the temple deck.

Empire: villa 4 +2 action +1 buy +1 coin/when acquired, add to hand, +1 action, if in your buy phase, return to action phase.
After running out of actions and entering the purchase phase, you can buy a villa for 4 gold and have another action phase for practically +2 actions + 1 coin. You can use the storeroom after paying the treasure.

Empire: 5 cantrips, +1 card next and the turn after that, can choose from the top 3 cards in the current deck.

Adventure: relic 5 treasure 2 coins Attack -1 card token/duplicate has no effect and is a relatively expensive silver coin.

sentinel
wine merchant
charity
induction

[https://gyazo.com/f4c4e128e62126a30c5aca25c3b63e80]
bunker
Chapel Compression

Basics: merchant 3 silver coins for 1 gold cantrip.

Basic: Vassal 3 +2 coins / If the top of the deck is an action card, you may use it.

Workshop Acquisition
Militia +2 coins/handes
patron
reconstruction
throne room

Renaissance: conscript 5 +2 cards/discard 1 card in hand/ +1 villager per cost 1

enlisted man
Draw & compression & + action, useful for combos

pageant
guild meeting place

[https://gyazo.com/6f7511ea0bdac3f68638e56b18f80914]
farmers

Empire: Pioneer 2 - Noisy Village 5
Pioneer +1 card +1 action/You may add a copper coin from your hand from the discard pile.
Noisy Village +1 card +3 actions/You may add 1 pioneer from the discard pile to your hand.

Adventure:Squadron Escort 3 Cantrip that yields 1 gold next turn/card type = 3, so it works well with courtiers.

Empire: gladiator 3 - large gold 8<8>.
Gladiators +2~3 coins
Large money +1 purchase/double the coins.

Adventure: mountain guardian 4 +1 purchase +2.5 cards

metamorphosis
remote location

Adventures:Imperial Car 5 Reserveable Throne Room w/ +1 action, so you can overlap.
Imperial carriage + mountain guardian/ Imperial carriage + giant

Adventure:Narrative 3 Cantrip/spend the coins from the previous one and draw.


Empire: Wild Hunt 5 Action - Set Choose one of the following:
Draw +3 cards, add 1 win advantage token to Wild Hunt's deck." ;
You gain one mansion. If you do so, you receive all victory point tokens from the Wild Hunt deck."
Blacksmiths can also choose to earn victory points.

aqueduct
public hall

remote area
When you create a remote area by transformation, it goes into your hand so you can send it to the mat immediately and the disadvantage disappears. it dominates the public domain as a 5 gold 4 point card.

The public hall is not activated unless you buy it. if you end without buying anything because you have 2 gold, you didn't get any victory points.
