idiosyncrasy
I tried to translate [there are two types of genus elimination] into English, but I couldn't find an English word that corresponds to "genus" in one word.

>[nishio https://twitter.com/nishio/status/1498575947293163520]: how do you say in English what is an attribute? Is there no one good word for it and you have to say Dependency to a specific person or something like that?
	>[geinin https://twitter.com/geinin/status/1498577128614346754]: if you mean that the job is dependent on a specific person, I wonder if it's "with no standardization"?
	>[otsune https://twitter.com/otsune/status/1498577472345948166]: key person risk or bus factor?
	>[kyoheif https://twitter.com/kyoheif/status/1498577613521965056]: dependent on individual, I guess
	>[shima__shima https://twitter.com/shima__shima/status/1498624495795404806]: You may have already looked for it, but Eijiro has the following
		>>be dependent on individual skills/expertise

Surprisingly, there is no English word that corresponds to "genus" in one word.
>[nishio https://twitter.com/nishio/status/1498584849070067714]: Is "gentry" or "[elimination of gentry]" a [Galapagos concept] unique to Japan?
	>[saitamasaitama https://twitter.com/saitamasaitama/status/1498585681572282368]:[truck number]? (How many people get hit by a truck and the project is ruined?)
	>[dmikurube https://twitter.com/dmikurube/status/1498586196859326464]: From what I have seen in some of the main companies outside of Japan, there are many cases where they have such a concept but don't see it as a problem (in other words, they turn a blind eye to it or think it can't be helped). I think there are a lot of cases where they have such a concept but don't see it as a problem (in other words, they turn a blind eye to it or think it can't be helped). (In other words, they pretend to turn a blind eye to it or think it can't be helped.
	>[tagomoris https://twitter.com/tagomoris/status/1498586504947400705]: I was talking to a manager (Canadian) a while ago and he said, "I know he's the only one who can do it, but if he's doing a job that anyone else can do, why pay more? If he is doing a job that can be done by anyone else, what's the point of paying him so much money? He said, "I know he is the only one who can do it.
	>[nishio https://twitter.com/nishio/status/1498586677459419137]: ah, I see
		>>They are not afraid to say, "Oh, the guy who was doing that quit.
	>[nishio https://twitter.com/nishio/status/1498587018426990595]: would that mean that there is a strong tendency in Japan to "consider gentry as something that is very hostile and must be eliminated"?
	>[nishio https://twitter.com/nishio/status/1498587361432973314]: "Let's make humans homogeneous and interchangeable cogs" kind of idea.
	>[dmikurube https://twitter.com/dmikurube/status/1498637068276498434]: It seems to me that there is a widespread view that the attributes themselves are also the source of each person's [job security], and that there is a perception that it is prudent to say, "I want to make this available to other people...", because there is sometimes resistance to such a request. I'd like to make it so that other people can do it, too, but...", there may be resistance (sometimes), so it seems to be recognized as prudent to do so.
	>[dmikurube https://twitter.com/dmikurube/status/1498638442947026944]: I think the reason why there is little in that direction in Japan is not so much the "hostility to gerrymandering" or the "individual as a cog" or other incendiary phrases, but rather the "if you gerrymander yourself, you will get endless work, so each of you will cooperate in eliminating gerrymandering. I think the reason why there is less direction in Japan is not because of the "hostility toward gerrymandering" or "the individual is a cog in the wheel" but rather because of the "each individual is cooperative in eliminating gerrymandering because if you gerrymander to yourself, you will have endless work. In countries where this is not the case, they do not try to eliminate it in a hurry even if it comes down to them endlessly (they usually make them wait).
	>[dmikurube https://twitter.com/dmikurube/status/1498641693431955456]: Well, I don't feel that one is better than the other. I think it's not very efficient, but I think it's the manager's skill to do the right thing.
	>[dmikurube https://twitter.com/dmikurube/status/1498648341340909575]: I just did a quick search and saw what came up, but I think it's rather close to the feel of the article here or something.
		[https://www.scientia-security.org/entry/2017/02/08/214654 U.S. Culture and Security - Why is automation so aggressively adopted? - From the Security Consultant's Journal]
  [https://cobokun.com/2019/03/12/job-security/ Job security - Cobokun's American Diary]
		>[nishio https://twitter.com/nishio/status/1498666447635161089]: this is very interesting!
  	>Genrality itself is a source of job security for each person / The reason why there is little in that direction in Japan is... If you make yourself a genus, you will have unlimited work to do, so each person cooperates to eliminate the genus.
  >Is it because of the strong practice of [lifetime employment] that each of them cooperates in the elimination of the genus without fear of being fired?
		>[dmikurube https://twitter.com/dmikurube/status/1498672756090900480]: I think this is part of the reason. In the case of individual contributors in the US and other countries, they use their individuality as a shield for job security, while negotiating and bargaining with management on compensation, workload, discretion, etc. As a result, overall efficiency may be sacrificed, and it's hard to say. I don't know...
		>[dmikurube https://twitter.com/dmikurube/status/1498677160915386368]: This is the reason why things like [psychological safety] and [OKR] come up, and if everyone starts negotiating like that, the organization can't turn around. I think it's partly because we want to create a situation where everyone can talk to each other in good faith. I wonder if Japan was able to do that (in one aspect) when it had money, or.......

	>[tnj https://twitter.com/tnj/status/1498658695957266434]: This is interesting, in foreign organizations [transactive memory] is often considered important, but isn't that a genus problem? I was wondering, but maybe it's not considered a problem to the extent that the word "genus" doesn't exist in the first place.
		>[tnj https://twitter.com/tnj/status/1498661630707572736]: I wonder if it's because organizational change is typically faster than the problem of attribution. I've heard that there is often no concept of handover from a predecessor. I wonder if the documentation and policies are left in place because of the pursuit of consensus building on the spot, and if it's a side effect of reduced attribution.


[Cross-cultural]
