ZOKUJINSEI
ZOKUJINSEI (gentei) is a Japanese word which means "dependency on individual skills/expertise."
	genus: belong
	Person: person
	Sex: -ity

It often used as a phrase "Elimination of ZOKUJINSEI".
[en.icon]
---
[jaen.icon]Machine translation from [genus].

Surprisingly, there is no English word that corresponds to "ZOKUJINSEI" in one word.

>[nishio https://twitter.com/nishio/status/1498575947293163520]: what is the English word for "ZOKUJINSEI"? There is no good one word and you have to say Dependency to a specific person or something like that?
	>[geinin https://twitter.com/geinin/status/1498577128614346754]: if you mean that the job depends on a specific person, then maybe "with no standardization"?
	>[otsune https://twitter.com/otsune/status/1498577472345948166]: key person risk or bus factor?
	>[kyoheif https://twitter.com/kyoheif/status/1498577613521965056]: dependent on individual, I guess
	>[shima__shima https://twitter.com/shima__shima/status/1498624495795404806]: You may have already looked for it, but Eijiro has the following
		>>be dependent on individual skills/expertise

>[nishio https://twitter.com/nishio/status/1498584849070067714]: Is "ZOKUJINSEI" or "exclusion of ZOKUJINSEI" a uniquely Japanese Galapagos concept?
	>[saitamasaitama https://twitter.com/saitamasaitama/status/1498585681572282368]: I thought you meant truck numbers? (How many people get hit by a truck and the project is ruined?)
	>[dmikurube https://twitter.com/dmikurube/status/1498586196859326464]: From what I've seen in some of the main international companies, they have the concept but don't see it as much of a problem (another way of saying In many cases, they pretend not to see it, or they think it can't be helped. They seem to be able to get away with saying, "Oh, the guy who was doing that quit.
	>[tagomoris https://twitter.com/tagomoris/status/1498586504947400705]: I was talking to a manager (Canadian) a while ago and he said, "I know he's the only one who can do it, but he's doing a job that anyone else can do. What's the point of paying a lot of money if you're not going to get what you want?" I said.
	>[nishio https://twitter.com/nishio/status/1498586677459419137]: ah, I see
		>>I can just say, "Oh, the guy who was doing that quit.
	>[nishio https://twitter.com/nishio/status/1498587018426990595]: I wonder if that would mean that there is a strong tendency in Japan to view gentry as something that is very hostile and must be eliminated.
	>[nishio https://twitter.com/nishio/status/1498587361432973314]: "Let's make humans homogeneous and interchangeable cogs" kind of idea
	>[dmikurube https://twitter.com/dmikurube/status/1498637068276498434]: There is also a reasonably widespread view that the attribute itself is also a source of job security for each person, and that the "I want other people to be able to do this too. I think there seems to be an awareness that saying "I'd like to do that, but..." may be resisted (sometimes), so it's prudent to be cautious about it.
	>[dmikurube https://twitter.com/dmikurube/status/1498638442947026944]: The reason why there is little in that direction in Japan is not so much the "hostility to gerrymandering" or the "individual as a cog" or other incendiary phrases, but rather the "if you gerrymander to yourself, you will have an infinite number of I feel that each of us is cooperative in eliminating gentrification because the work is falling on us. In countries where this is not the case, there is no particular rush to eliminate the endless work that falls on us (we usually make them wait), so
	>[dmikurube https://twitter.com/dmikurube/status/1498641693431955456]: Well, I don't feel that one is better than the other. I think it's not very efficient, but it's a good thing that the manager has to be good at it, and I think it's a good thing that the manager has to be good at it.
	>[dmikurube https://twitter.com/dmikurube/status/1498648341340909575]: I just did a quick search and saw what came up, but I think it's rather close to the feeling of the article here
		[https://www.scientia-security.org/entry/2017/02/08/214654 U.S. Culture and Security - Why is automation so aggressively adopted? - From the Security Consultant's Journal]
  [https://cobokun.com/2019/03/12/job-security/ Job security - Cobokun's American Diary]
		>[nishio https://twitter.com/nishio/status/1498666447635161089]: this is very interesting!
  	>>Generationality itself is the source of each person's job security / The reason why there is less in that direction in Japan is... If you make yourself a ZOKUJINSEI, you will have unlimited work to do, so each person cooperates to eliminate the ZOKUJINSEI.
  >Is it because of the strong practice of lifetime employment that each of us cooperates in eliminating gentrification without fear of being fired?
		>[dmikurube https://twitter.com/dmikurube/status/1498672756090900480]: I guess that's part of the reason. In the case of individual contributors in the U.S. and other countries, they use their individuality as a shield for job security, while negotiating and bargaining with management on compensation, workload, discretion, etc. As a result, overall efficiency may be sacrificed, and I'm not sure. like
		>[dmikurube https://twitter.com/dmikurube/status/1498677160915386368]: This is also the reason why things like psychological safety and OKRs come up, and if everyone starts negotiating like that, the organization can't turn around. I think it's partly because everyone wants to be able to talk to each other in good faith. I wonder if Japan was able to do that (in some respects) when it had money...

	>[tnj https://twitter.com/tnj/status/1498658695957266434]: This is interesting. In foreign organizations, transactive memory is often considered important, but isn't that a ZOKUJINSEI problem? I was thinking, maybe it's not an issue to the extent that the word "ZOKUJINSEI" is not in the first place.
		>[tnj https://twitter.com/tnj/status/1498661630707572736]: I wonder if it's because organizational change is typically faster than the problem of attribution. I've heard that there is often no concept of handover from a predecessor. I wonder if the documentation and policies are left in place because of the pursuit of consensus building on the spot, and if it's a side effect of reduced attribution.
