Dominion 2022-03-02
Play 1
[https://gyazo.com/f07efc5a69b08c15b9b1fa11cd659126]
[https://gyazo.com/ca2e74eb2e4854d46dbec9a0c21f8343]
I see

Play 2
[https://gyazo.com/c3a730071a32891e141f19e1f7ea8070]
　Peacemakers pay as many friendships as they want at the start of the purchase phase and discard that number of cards.
　Servant 3 Cantrip +1 Friendship
　Mediator 4 Discard 1 hand, options "1 draw per cost", "1 action per cost", "1 coin per cost", "1 friendship per cost"
　Restoration 5, 1 discard in hand, option "cantrip," "gain up to +2 higher cards."

They're all disposed of.
　There's a garden, but...
　Draw at the Institute, plus action 2 gold at the festival, militia, maybe.
　　You didn't use the new expansion.
　Let's just buy a servant and a mediator for now and then we'll think about it.
　初手、平和教徒、従僕、仲介人
　　I think it's over-compressed, though.
　従僕、平和教徒、銀貨
　Discard 2 coins with the militia. Silver coin for 3 gold, discarding a copper coin with the mediator.
　Militia for 4 gold
　Servants, minus intermediaries. Institute by discarding the copper coin. If you discard the video, you don't get friendship because the cost is 0.
　Militia. Mediator, destroyed copper coins. Peacemaker, destroyed copper coins.
　Destroyed the compound with the institute, servants, militia, and peacemakers. 8 gold for the province.
　Militia and discarded cards. Servants, militia. Institute.
　Destroyed copper coins at the Institute Institute Institute, mediator. Institute Institute, with further destruction by peacemakers.
　Servant, lab x3, pulled through.
　　Huh? I thought I bought a genshu, but it's not here?
　　Not familiar with the UI and made a mistake?
　　Oh well.
　　Broker to destroy coppers and buy festivals
　　　I can't hit with the militia because I don't have enough action.
　Pulled off and destroyed the copper coins and the province
　Torn off, genus state
　Militia Attack. Using festivals to buy gold coins.
　12:18. 11 in pull-offs, genus, and silver coins. In addition, there is a shortage of material for the disposal of intermediaries, leaving a surplus of actions.18:18.
　18:21. drawdown failed. Genshu, silver coin. 24:21.
　24:27, province remaining 1. Accidental, 2 gold, mediator, militia. Broker, discard militia for coin, buy gentry? Or draw 4 coins? I'm going to have trouble drawing a lab because I don't have an action. In coin.27:27
　27:30. buy a genshu mansion and reverse the situation.
[https://gyazo.com/6931aaf1473027f3072f91a45746be9c]
Friendship tokens, I had 5 extra, still overdisposed, and the mediator was playing with them after all. And I'm diluted with victory points that can't be discarded and fail to draw off.
However, being able to destroy it with a mediator and return it to coins is good for emergency money.
In retrospect, I would have rather had a servant militia since the mediator in the early stages is a "1 discard per action" with nothing gained by discarding 0 cost copper coins. If you want to increase the discards, I think it would be better to add another cantrip servant.

[https://gyazo.com/595a14e2092c881b006a61176d5ae95f]
Town 4: Village and + purchase +2 coins choice
Barter 5: You can return an action card to your supply in a cantrip. If you do, you gain an action with a different name and cost 5 or less into your hand.
Highland Shepherd: 2 win advantages per pair of 1 friendly and 2 cost cards

Oh, special victory points. If there is enough friendship, the house will be worth 3 points, which is the equivalent of a public domain.
Draw: Blacksmith
Action: Town
獲得: 工房、職人、町
圧縮: 礼拝堂、仲介人

The chapel is overdisposed of because we want to destroy it with a mediator to gain friendship. The question is whether the first move is a silver coin mediator or a workshop mediator, and there is some concern that the workshop is too active to compress, but the idea is that you can collect towns and blacksmiths. No, you have a precursor, which is a cantrip, so you don't want to disturb it.
　初手、前駆者仲介人
　The forerunner, the mediator, and the mansion were destroyed and made into 2 gold, and the town
　5金、物々交換
　Town, blacksmith shop purchased
　Barter the precursor to town. Town, broker to destroy the mansion, draw, blacksmith. 5 gold for... town, I guess...
　Buy town thing town town, town
　Draw in blacksmith, blacksmith
　Machimachi Town, Blacksmith Shop
　Town blacksmith barter blacksmith, 5 gold for... town or... let's barter.
　(town blacksmith) x3, bartered, pulled off (7 gold, subtle) Broker, destroyed copper coins, gold coins.
　9 gold for a cut-off, a broker, and a copper coin discarded in the province of the genus.
　　I really wanted to add two more towns, but the purchase is still one.
　　Hmmm, should I have made the town a purchase?
　8 gold for the drawback, if you destroy it, you can't buy the province, so you have to buy the town, 10 gold for 2 purchases, town and gold coins.
　Failed to pull off, 9 gold. province of the genus
　15:20. failed to pull out, 6 gold. Hmmm, maybe town.
　属州
　21:27、3金、屋敷
　　Lost because of the purchase of a province in the genus

[https://gyazo.com/a5bbf45de5888c5b8364ac9f79148c3f]
　Hmmm, the AI that did the blacksmith steroids without making any extra moves to worry about effective points wins, huh?

Play 4
[https://gyazo.com/7bf44124d984970d008f883325cf16db]
4 piles of 4 different types, 2 touchy, 3 town blacksmiths, a miller, and an elder.
	[https://gyazo.com/25dce066468e4861acce891c34c87ae7]
family of flowering plants
	[https://gyazo.com/604d49e31953abfbefad44ab38701a74]

At any rate, I don't need the herb pickers because they're coppers in the early stages.
The touching role can switch to cantrips with the silver coin acquisition, I guess. The deck is full of silver coins. Draw is a storeroom, so it's hard to stack them on top of each other.
　First hand, money loan, silver coin
　Destroyed by moneylenders, 7 gold for gold.
　Chapel with 3 gold
　3 discarded in chapel, silver coin
　Disposal by moneylenders, gold coins
　3金で銀貨
　属州
　金貨
　金貨
　Destroyed by moneylending and belonging
　14:12、金貨
　属州
　20:24 属州
[https://gyazo.com/bc206cbf931d215d364d0bf8d9861a2c]

Play 5
[https://gyazo.com/7d5c7e42aacd6e3a50f957102626ca5b]

[https://gyazo.com/7131cda24f52d4a3d44efc85eccb63ac]
Scattering soldiers are cantrips +1 coin militia attack.
Hmmm, if there is no compression and there is witchcraft, it must be witchcraft.
If you want to buy a witch for a quick 5 gold, silver coins silver coins or silver militia.
It's useless to wear it, so once the witch is bought, the rest is gold, guards, and silver coins.
　初手銀貨民兵
　　My opponent bought a witch with his militia in T3 as well...
　4 gold, given that there are witches on both sides as well, it would be better to run the deck a little faster in town and hit more witches than to buy silver coins here.
　民兵、町
　Town, Town
　Struck witch, witch militia for myself. Use witches, town.
　Town, town, witch, town. Guards.
　町町民兵、金貨
　Town, Town
　町、民兵。金貨
　衛兵町魔女町町、3金()銀貨
　町3、金貨
　民兵、属州
　魔女、金貨
　民兵、金貨
　town
　公領
　属州
　魔女、公領
…
[https://gyazo.com/8491fd0bd5df5bcd8736e2adc273eb8d]
The curse only makes a difference of two pieces.
The big difference is that I bought 7 townies to spin the deck, whereas AI bought silver coins.
He said that the average amount of money should have been increased because the difference in curses was not significant.

[https://gyazo.com/8dd1ad6e29fcf307f95ac251e60024df]
League of Bankers, you'll get friendship/4 virtual coins, you won't consume friendship.
Oh, there's a servant, I think the first servant x2 will be +1 coin every turn from about T4.
Fastest servant loop with one workshop in two rounds.
How about 5 gold to buy the market....
　初手従僕x2
　　You're dealing with silver coins, silver coins.
　工房
　　Oh, they are bandits with 5 gold, I see.
　　This one has no cash at all, so the attack won't hit.
　Servant, servant, servant.
　Servant-servant, servant in the workshop. 2 gold, +1 in the bankers' federation, servant of course.
　　I'm afraid my servant will wither before I buy this market.
　Servants in the workshop, purchases are also servants, no, 5 gold, so the market
　attendant
　Servant 4, market. Huh? Why are there two workshops? Is it an operational error? A servant at the workshop. 5 gold at the market.
　Servants 5, Market 2, Servants at the workshop, Servants Market at 8 gold.
　　partner state
　6金、市場
　Servants 5, servants in the workshop (depleted), the province, come on, let's tie it up.
　3 copper coins and +5 of the League of Bankers for the Province.
　従僕4市場2、属州
　従僕3市場2、14金。属州公領
　Servants 4 (now 8 gold per turn) Province
[https://gyazo.com/a41f5c4851dc450691c07e7d2bdccd33]

I was able to buy a mansion from the League of Bankers with 10 "servants" of the new Dominion expansion "Alliance" with a confirmed receipt of 8 coins each turn (although it was the last province to receive 8 coins).
The servants produce newly added "friendship tokens" in cantrips, so the chain of servants increases the friendship level of the banker's federation and "receive 1/4 of the coins of the friendship tokens" each turn, and the story is about expanding the business with bank loans without cash. The enemies are bandits who aim to destroy the treasure, but there is no cash, so it is safe!
