Page-level atomicity and row-level atomicity.
from [/unnamedcamp/ page-level atomicity and row-level atomicity exist].
[/unnamedcamp/nishio.icon]
　I don't understand "[atomic]" ([atomic]).
　To be precise, "I'm [uncomfortable] with the way the word is used."
　I think the nuance, the direction is something like this:.
　　A single bulleted line with a directive or conjunction gets in the way of moving it to a free place.
　　　So if you intend to move it, you better get rid of those ties.
　　Writing for a one-dimensional reading would get in the way of free structure and thinking.
　　　So it's better to write in a way that doesn't depend on other fragments, on fragments that can be moved two-dimensionally, to create "parts for thinking in a two-dimensional arrangement".
　If you call something as "small" as this "atomic", it's not strange.
　But I'm uncomfortable with calling a page consisting of multiple sentences, for example, "atomic."
　　Isn't that a crazy high molecular weight compound!" I feel like
　　If you squint so hard that the page looks like a grain [of cognitive resolution], you can understand a little bit why they want to call it atomic.
　　Okay, so this is the source of the discomfort.
　　　In what one person calls "atomic," I see a structure made up of multiple other "things.
　　　The word "atom" originally meant "undividable" and was used to refer to the smallest constituent unit of the world
　　The internal structure of the real atom was also discovered after the fact, so is there any problem if the layers are limited?
　　　[Kozane-level atomicity]
　　　[row-level atomicity].
　　　[Page-level atomicity]
　　The abbreviation "atomicity" for page-level atomicity would have clashed with atomicity at other levels and caused discomfort.

[/shokai/bi writing must be destroyed].
	>Use [bullet points].
 >In [WiKi], it is difficult to comment on long, beautiful sentences.
 > Every time I comment on a detail, I need a [citation] or directive to point to a specific part of the text.
 > Stories can only be chained in series.
 > The only people who can cut back would be those who are equally good at writing.
 > Bullet points make it easy to insert simple comments on an item-by-item basis.
	This could be translated as "[row-level atomicity] is useful"