Why is discomfort relevant when advancing intellectual action in a loaded act?
from [/unnamedcamp/why is discomfort relevant when advancing intellectual action in a loaded act?]
[/unnamedcamp/nishio.icon]
 Several multi-person projects have "created chat pages to lower the psychological hurdle of writing" or "created diary pages.
 On the other hand, that has not been done here, so I initially felt a high hurdle against writing.
 After reading "[not creating an] inbox," I understood that this was done intentionally.
  >To be clear, the burden of such actions is high. Compared to that, it is easy to write if you create an inbox. However, that ease inhibits the [discomfort drive].
  > We would like to proceed with this project with the hypothesis that this sense of discomfort will promote intellectual action.
　[What is Unnamed Camp?]
		>We will not create a page with the title as a proper noun first, but will only write a bean paper and then proceed to use the keywords contained within the page as links as an aid to the paper.
  > [/unnamedcamp/nishio.icon] Am I understanding correctly that "instead of deciding on the page title first and then writing it, you write a chunk of text and then use an important phrase from that as the title"?
　Certainly the act of "writing a chunk of text and then titling the important phrases in it, rather than deciding on the page title first" is a load of work!
　I can see the argument that if there is a place to write comfortably, members' time will be consumed by it, thereby hindering intellectual action.
　　Related [title not required], [no improvement in capacity where there is no load].
　I don't know what the term "discomfort driven" attached to it means.
　But, well, I guess this is "a concept that is now being verbalized," so I thought it would be better to experience it than to seek an explanation in words.
　So I did it.
　　As of this writing, there is no title on this page yet.
　　Now, what title to give it...
　　>The load of the act is high.
   > Discomfort
   > Advancing Intellectual Action
　　Why is [discomfort] relevant when [intellectual action is advanced] in [loaded action]?

 [It takes courage to create your own page.]
 	>Write lightly, and then prompt a tsukkomi like "No, it's not like that" (priming effect, [discomfort-driven]).
 	Lightly written."
 		Doesn't seem to be a loaded act.
