atomic
[Atomic]
There are those who believe that "being atomistic is a good thing."

[/unnamedcamp/that-is-Atomic].
>One of the [Evergreen notes principles] is Atomic.
>>Evergreen notes should be atomic

Apparently this is what happened.
[/unnamedcamp/Evergreen notes should be atomic]
>This world does not exist in a poof of atoms alone... The concept of "Evergreen notes should be atomic" is to introduce the same kind of "look and feel" to the group of information we handle (or whose brains we hide in).
I don't really feel much empathy, but I wonder if there's something I'm not seeing yet.

Maybe the talk of "it's useful to do this" in a few concrete situations is walking alone, out of context, after it's become an abstract precept.

[/rashitamemo/Evergreen notes concept].

https://notes.andymatuschak.org/Evergreen_notes

https://notes.andymatuschak.org/z4Rrmh17vMBbauEGnFPTZSK3UmdsGExLRfZz1

I see


　[Doesn't it vary from person to person as to whether a given note is atomic or not?]
 　In a more rigorous writing style
 　　Atomicity is not a binary attribute of "being/not being atomic",
 　　　The "close to the right balance" nature of the notes is neither too broad nor too fragmented.
 　　　It's hard to see the connections when notes are too fragmented."
 　　　What people find when they look at the same thing differs from person to person.
  　Isn't atomicity not a property of the note alone, but a relationship between the note and the person?
　　Suppose a theme X contains elements A, B, and C.
　　　For those who already understand it, the separation of A, B, and C is "atomic".
　　　But if someone unfamiliar with X looks at this note that divides A, B, and C, they may not find a relationship between A and B.
　　　　This is exactly what happens when notes are too fragmented to see connections, which is contrary to atomicity

[/arpla/atomic-note]
	[/arpla/why didn't the atomic note work].
		>I didn't get it right/thought about the cause/one factor was that I thought that atomic notes are about making the pages as detailed as possible.
	　The original article talks about too big and not too small, but I guess that got lost in the process of the message game.
　[evergreen note should be atomic#62221788aff09e00004ca54f]


The right balance of atomicity is great in Scrapbox.
　I translated the original English text because the concept of "atomic" didn't seem to fit.
　[evergreen note should be atomic].
		Proponents of evergreen notes explain that "if the note is too broad -" and "if the note is too fragmented
		In other words, the argument that it's better to strike the right balance.
		That "proper balance" may be greater in Scrapbox than advocates assume.
		In "If the Notebook is Too Wide," it says: "If the Notebook is Too Wide, it's too Wide.
			A: For one of several ideas in the notebook, it is difficult to notice when you come across a related new idea
			B: The link to the note is ambiguous
		　B seems to implicitly assume that a link to a note leads to the beginning of that note
		　　That appears to be the system that advocates are actually using.
		　Scrapbox's ability to scroll to a line link or link position would allow me to point to that part of the page even if multiple thoughts are on one page.
		　A is also mitigated by Scrapbox's feature that links in a page are not "one-way links to other pages" but "a window that can lead to it from other pages as well as the title of the page".
　　In other words, what advocates call "the problem with too much space" is mitigated in Scrapbox
　　　The harm of too much ticking does not seem to be well taken care of in Scrapbox, for example, from the fact that requests to transparently embed other pages are often raised and rejected in the forum
　　　Then wouldn't the proper balance in Scrapbox be to make it larger than the advocates envisioned?




	[/issac-37765679/being Atomic].
