Dominion 2022-03-03
[https://gyazo.com/bd9ed3415e32a518fed5c7883c0fa339]

Heian-period student of government administration
[https://gyazo.com/dbf455f86be689d1e00eab94055a2695]

　Student 3 Compression, friendship
　Mage 4 Acquisition
　Spellmaker 5 Curse spreading with cantrips
　Demon King 6 draw 2 actions 1 turn off

The hunter's a +1 action, a variable institute that looks at a three-card deck and puts one of each kind in your hand.
Masonry union consumes friendliness when shuffling and sends it to discard effect.
If the servant is a cantrip and I can use most of it, it's like reducing the dilution caused by victory points.
Action Throne
Draw Blacksmith
Compression Moneylenders, guards, students
Acquisition Craftsman, Mage

Compression with a student, draw off with a hunter, or maybe I'd like to try another wizard card.
　First move, student silver coin, friendship 1, discards 2 mansions.
　4 gold. There can't be any money loan and the blacksmith is a silver coin or... a throne? He's throwing away copper coins, and if he doesn't buy silver coins, he won't have enough.
　silver coin
　Shuffled with no friendlies because students were swept away by enemy bandits, and the delicate situation of two student copper and silver coin houses...
　 Ah, I see, I should have included a squire to make room for friendship.
　 Destroyed copper coins, no purchase
　Shuffle, student copper coin 3...copper coin destroyed
　Student 5 gold, hunter
　Students, destroying copper coins, servants.
　Oh, no, you can't draw it out and shuffle it every turn, so you have to pay a friendship every turn to get rid of it.
　　We still need at least two servants at this point, and we will need one for every two victory points in the future.
　　I put in a mage.
　Draw-off, servant with mage, bandit with 5 gold.
　　Lack of action puts the throne
　Servant-servant-hunter, pull-off. Threw away the last copper coin at the student and got gold at the bandit. Oh, I thought it was 4 gold, but it was 2. I made a mistake.
　Servant servant hunter, draw off. Gold by bandit, throne for 5 gold.
　Throne squire, mage with blacksmith, bandit, skip with 2 gold.
　Discard house 3 students. Hunter 2 squire throne squire, draw off, throne with mage, bandit. Province
　　Money has increased, but purchases haven't increased, no one is increasing, I'm now 18 points behind and have 3 genus states left, so if purchases don't increase, I'm not going to be able to do it. 2 Throne Mage Houses acquired, Province purchased.
　Hunter, throne hunter, mansion, genus state
　　The opponent bought a gentry state and lost.
[https://gyazo.com/9d0500627d2425f5b92aed945624e3e2]

Play 2
[https://gyazo.com/c535b1ca6cfdef339c0f45ce64fc2922]
[https://gyazo.com/12eaec72879929e2b74fba849ed11f03]

Ehhh, lots of draws but no more actions and my opponent bought a witch on his first move...
First buy witches in Naruhaya with silver coins silver coins, and while hitting each other, run the deck with non-terminal laboratories, markets, and old maps, and when the curse dies, buy the public domain and mansion in flow?
　First hand, silver coins silver coins
　Map
　witch
　Map
　Witch, Institute
　Map
　Map Map, Institute, Witch. 8 gold for genus state.
　Skip with 2 gold
　Map Map, Institute. Research Institute
　Map
　Map Map Witch, Map Witches, Map Witches, Map Witches. silver coin
　Institute, silver coin
　Institute 2 map 3 6 gold, gold coins
　silver coin
　Witch. The Institute
　Institute, Province
　duchy
　voyage
　silver coin

The dilution of the deck was not at all more than I expected.
[https://gyazo.com/764bc5b2b29fc7ef0339ae431f28a4e3]
I can buy a witch later and hit twice as many times, so I've succeeded in turning around faster and hitting more, but that's only a difference of two pieces, or I should have bought the treasure where I bought the map.

[https://gyazo.com/80c1660c4bc2e9f444915744a6c1f8cc]
Islanders pay 5 friendlies for an additional turn.

Merchant's camp has +2 actions +1 coin, can return to deck to increase actions, no draw
After that, I'll add more action to the throne.
I can get a cost of 4 at the workshop.
Well, I think I'll acquire it at the workshop, destroy it at the mediator, and turn it in the precursor and increase the action at the throne and festivals.
　First mover, forerunner, intermediary
　2 Gold Skip
　Return the copper coin at the precursor. Breaker destroys copper coins, precursor for 3 gold.
　Broker with 4 gold
　Destroyed the mansion with the previous intermediary, turned into gold and the throne.
　Precursor, throne mediator, house copper coin destroyed, silver coin converted to gold.
　Precursor, intermediary to destroy the mansion and make it gold, festivities for 5 gold.
　Festival precursor, destroying copper and silver coins, festivities for 5 gold
　Throne Precursor, Precursor, Festival, Broker destroys copper coins, Throne for 4 gold
　　Now I realize I forgot to put in the workshop, oh, I guess I put it off because I still have some copper coins.
　Throne Festival, Festivals, Brokers destroy copper coins and workshop x2
　Precursor, Throne Precursor, Festival, Throne Mediator discards 2 coppers, turn end
　Throne Precursor, Throne Festival, Workshop Workshop. Precursor x2 Throne
　Precursor Throne Precursor, festivals. Workshop workshop workshop, mediator, destroying the mediator and turning it into gold, mediator, throne, gold coins.
　(Throne Precursor) x 3 Acquire a workshop at the workshop. Destroy the workshop with the mediator. Festival x2. buy a precursor and a mediator.
　provincia
　(Throne Precursor) x 3 workshop workshop, throne throne, festivities, destroy the mediator, artisan for 6 gold.
　Throne artisans, acquire and destroy the public domain in hand for gold, and the province
　Precursor, (Throne Precursor) x4 Throne Throne Craftsman Workshop. Public domain public domain precursor precursor acquired, precursor acquired at the workshop.
　4 gold
　　I'm just finding out now that the throne precursor is finally a +1 card, so the draw is too weak to get the mediator's discard target in hand.
　　The Throne Precursor is excellent, and the system allows you to draw any card you want from the discard after all, because the Precursor piles cards of your choice from the discard into the deck, and then you don't draw any cards you can discard.
　　Ummm, wrong plan.
　　It's hard to buy gold because only the opponent has bandits, but maybe it would have been better to acquire gold through banditry instead of acquiring workshops and artisans, and if you destroy the gold and get 6 gold, then you can buy the rest of the genus at festivals.
　　Acquiring a public domain with a craftsman is tricky because "return to deck" is triggered.

[https://gyazo.com/5b9b5e4c8e7d28eeefdc64c2a2436038]

Play 4
[https://gyazo.com/57c738539527e5260aaccb3269b40f46]
City State, you may use it if you pay 2 friends when you get the action.
Shining gift, choose 2: +buy, +1 coin, +1 friendship, good in a deck when you get a card

Hmmm, "when acquired," so you can take off for the first time with renovations and renovations.
The problem is that there's no draw again.
The only thing that increases friendship is the gift, and this is a treasure, so it doesn't increase with the throne, and it's the equivalent of a copper coin, so you can't just buy it all... Oh, right, you have to renovate the copper coin and turn it into a gift.
Okay, okay.
　First move, precursor renovation. Pioneering to turn copper coins into gifts while bringing in bandits and acquiring gold coins, and then making it a province with gold coin renovations.

No, no, no, no.
　The effect of the bandits "destroying treasures other than copper coins" will cause gifts to be discarded. w

Play 5
[https://gyazo.com/f11797219a8eeb64c6e73cd04838d7e8]
Cave people can use friendship to discard 1 card and draw 1 card.
And what about that friendship gain?
　Shining Gifts
Bandits?
　You're there!

　First move 5-2 Bandit, gift
[https://gyazo.com/6305e62837123ec23be5d5cdc26f5881]
　Bandit Forge Sterojan

[https://gyazo.com/bfe5e9c1d838f5f49f0fccbcafc674b0]
　First move, map moneylender. Turn the deck, lose the copper coins, and turn the moneylenders into gold coins through renovation. Don't add too much gold because purchases don't increase.
　T3, 2 gold, has become a chapel?
　Moneylending, gold coins
　Maps, gold coins
　3 destroyed in the chapel
　3 destroyed in map chapel, map
　Moneylending, gold coins
　Map Map Moneylenders, 12 Money, Gentry
　6Kin, I don't know, maybe a renovation.
　Gold coins in renovation to the province and purchase gold coins.
　Gold coins for moneylenders in renovations
　Province with reconstruction
　provincia
　Province with reconstruction
[https://gyazo.com/d3b2536c1b9f25660e11394bba597c08]

[https://gyazo.com/7d61976e7151245acab73f0d246ca413]
　First move, silver coin officials. I'll go ahead and do the public domain garden route with the treasures subject to the artisans.
　T6 Craftsman
[https://gyazo.com/42dc1737dc99cab6b63a871ffba2fb1d]

[https://gyazo.com/7dd7a98e3a07fc924d78027d5b5a6ff8]
　First hand, student blacksmith. Raise and buy one witch while discarding copper coins at the student.
　Destroy the mansion and the silver coin
　Draw and witch
　Destroy and silver coin
　Destroy the house, the witch, the cellar.
　Witches, gold coins
　T11 Attributary State
[https://gyazo.com/0e458e47ea70575420db2f1d4ed3cfbc]
That puts a squeeze on the draw, since the student goes back to the top of the deck.

[https://gyazo.com/ab1dd1bb5f130a2db730afcd5233b138]
Hmmm, I guess the basic idea would be witches.
　First move, silver chapel, compress and write one witch.
　witch
　total abolition of chapels
　witch
[https://gyazo.com/20aaa6bfbe79ccb237d4a8290924cdfa]
It was hard work, I could buy the one remaining copy of the genus state, but from a 10-point deficit, the dukedom and the mansion withered, and I had to increase the number of witches and hit them every turn and use curses to close the point gap and keep them in the game.


[https://gyazo.com/ce61a1e3de1977e8e138194d11af0e2e]
　More action and purchases in town.
　Acquired at the workshop
　Compression in the chapel
　Draw in the archives
　First Hand Chapel, Town
[https://gyazo.com/4f6ff709032fb9d4b7b0919e1d0eb9fa]

[https://gyazo.com/df9dc6e2fd04321f645f651b74ff1a87]
　First move, silver coin renovation
[https://gyazo.com/98fd3a5783e4e47b10145b938a27dc7f]

[https://gyazo.com/22e80b1c687cb6ba4e0d70cc22f41587]
　First hand, gold loan silver coin
[https://gyazo.com/c07fc470e712b70a8df59afbd43dd1d0]

[https://gyazo.com/6e2ce0b3ce80deee66c962974e4d924a]
　First hand silver coins silver coins, market after buying tailgating
[https://gyazo.com/77c4b121a9757f90867b81515bfd2b95]

[https://gyazo.com/a3b0f5cbf6d1e4852ce2504a1a4a2c2d]
Nomadic gang Paying friendship when acquiring a card with a cost of 3 or more will get you a draw, action or purchase.
First move, student blacksmith, later bandit renovation.
[https://gyazo.com/377cd3fa1d97c39e35eea850a27638ed]
[https://gyazo.com/ba9f72438804fc05a3b350039932a8ff]
silver militia
[https://gyazo.com/f294cced2c9b2cc6b6d0d00081e4e22c]
[https://gyazo.com/ecbb9e7f6dff665edae370ece2ab08b6]
　township-owned coin
[https://gyazo.com/7306dff0398bfeea6bea0a494de08318]

[Dominion 2022-03-02]
