Write notes for yourself by default and ignore the reader.
[読者は自分]

[https://notes.andymatuschak.org/z8AfCaQJdp852orumhXPxHb3r278FHA9xZN8J Write notes for yourself by default, disregarding audience]
	Ignore the listener and write notes for yourself by default
	The [evergreen note] is,
		公共の仕事を書くための戦略（Executable strategy for writing）
		Because it can be used as part of a
		It is tempting to "save time" by writing notes in a publishable form.
		It is,
				Some (boring to you) ideas
					Provide all the background necessary to understand the
				自己検閲
  		Adding many modifiers
  		clarity
  	This may mean spending a lot of effort on
  	For example, clearer writing usually involves clearer thinking.
  	However, this is not the way to do it,
  		Significantly increase overhead and effort in writing,
  		Often enough, I feel, to create a sense of stagnation.
	Specifically,
		When writing notes as part of a clear preparation for writing in public,
			This phenomenon appears as a common failure.
		Often I try to [do two jobs at once].
		I mean, I may be writing an atomic style note, but
				(Evergreen notes should be atomic)
			They try to write as if it were a section within a larger essay or work.
			We try to write things in all the context and clear sentences necessary for outsiders to understand what we are saying.
			Then, "I can't write at all!" This is often the case.
			Better yet, write something at a level where you can write something and get yourself going with it.
				(Evergreen notebooks allow you to write sentences gradually and smoothly ("incremental writing").
	If it is a subject you understand well,
		You can write notes for yourself and for your audience at the same time. Shi
		However, when we do so, we sometimes have the illusion that we are doing so all the time.
		To avoid such misunderstandings,
			I write notes for myself by "default",
			We will "opt-in" to write clear notes for the audience.

 Q. What are some of the bad habits you tend to fall into when writing a standing order in preparation for public writing?
 A. The text for publication should be done as part of the first pass of the note.

 Q. Why do you often get stuck when trying to write Evergreen Notes as publishable prose for an audience?
 A. The extra cognitive load of thinking about the reader overwhelms me when the topic is one that I cannot extract on my own.