Evergreen notes must be closely linked
The word "dense" is not being used in its proper sense.
　The most densely linked state is "everything is connected to everything" [close phase].
　　It is not useful
　Implicitly assumes no notes linked at all.
　　By comparison, denser links get closer to "proper density."

[https://notes.andymatuschak.org/z2HUE4ABbQjUNjrNemvkTCsLa1LPDRuwh1tXC Evergreen notes should be densely linked]
	Evergreen notes should be closely linked.
	Trying to add a lot of links between notes,
		You begin to think extensively about what other concepts might be relevant to what you are thinking about now.
		Doing so creates pressure to carefully consider how our ideas relate to each other!
			Understanding requires effort."
			Evergreen Notes should be conceptually oriented."
	Elaborative encoding also allows for deeper internalization of ideas.

	I need to read the old notes to find the correct link,
		It's also an organic mechanism for intermittently reviewing written notes
		(Evergreen note maintenance approximates repetition at intervals.)
			[nishio.icon][Spaced Repetition] / [Incremental Reading]
		The result may surprise you (Notes should surprise you).

	And by recording the connections,
		Record how you reached your conclusions,
		It may help you (or your colleagues) later.
		Whenever possible, detailed associations should be prioritized.
		In contrast, tags are an inefficient association structure.
		[nishio.icon][stock in association].

	If only to look over the notes,
		Connections provide many pathways to move through the idea space.
		I would like to navigate hierarchically,
			Links cross disciplines and topics.
		Prefer associative ontology over hierarchical taxonomy

	Luhmann actually argues that.
		>In this way, the importance of what is actually written is secondary compared to the structure that provides the possibility of a connection that can be actualized.
	You don't necessarily have to link to your own notes.
		Backlinks may be used to define nodes implicitly in a knowledge management system.
		To stop and add new notes whenever needed,
			I sense high friction, though,
			Being able to link to stubs is very liberating.
			(Linking to stubs is very liberal.
			(Evergreen notes allow for smooth, incremental progress in writing.
			(See also "Gradual Writing").
				[nishio.icon][Incremental Writing].

	Aside from the ongoing value of the captured links,
		It may help to direct attention during drafting.
		The release valve for non-linear thinking is.
			It may support the improvement of linear output.

