Evergreen note title is similar to API
Implicitly assumes "a system in which the title is the only means of pointing to the text.
　In such a system, the title functions as "an API that, when you call it, returns the text associated with that title.
　　(Well, actually Scrapbox also has an API to retrieve content by title.)
On the other hand, they don't seem to be aware of other ways of pointing at all.
What you're saying isn't wrong, but it's not new.
　　It would be nice to have a permalink for the concept.
　　That permalink should be human readable for meaning.
　Many wiki systems support it.
　　(Well, there are blogging systems at the moment where the article ID is a hash value, time, or a sequential number, so this is a good thing compared to those.)

[Evergreen note titles are like APIs https://notes.andymatuschak.org/z3XP5GRmd9z1D2qCE7pxUvbeSVeQuMiqz9x1C]
Evergreen note title is like API
　When an evergreen note is factored and titled well, the title becomes an abstraction of the note itself.
　You can then use that handle to refer to ideas throughout the note
　　See Alexander concept handle
　　　[nishio.icon] The concept of a "concept handle" is not uncommon.
　　　I'm not from Alexander, I'm from [Douglas Carl Engelbart].
　　　　The title "[handle]" is used because the word "handle" is associated with a car steering wheel, but in English, it is more appropriate to call it a handle.
　　In fact, this characteristic itself serves as a kind of litmus test.
　　If you develop the ideas in the notebook over time and improve the "API",
　　You will be able to write individual notes abstracting increasingly large subtrees
　　(For example, the Enacted experience has great potential as a mass medium, and the Evergreen Notebook would be a basic unit of knowledge work.)

	Effective note "API design" techniques:
		Separation of Concerns (Evergreen Notes should be atomic)
		Sharp titles (prefer full phrase note titles to make the claim clearer)
		Positive framings (prefer positive note titles to promote systematic theory)
