Domininon 2022-03-05

[nishio.icon]I noticed that there are trade routes, trading floors, and traders.
[human.icon] And then there's the trade.

Prosperity: trade road 3 +1 buy/discard 1 from hand. +1 coin for each coin token in the trade route mat.
/Preparation: Place one coin token on top of the deck of victory point cards in the supply.

Plot: Trading floor 5 Discard 2 cards from your hand. If you do so, you gain 1 silver coin to your hand.

Xenophobia: Trader 4 Discard a card from your hand. Gain a number of silver coins equal to the cost of the card.
Reaction: When you gain a card, you may reveal this card from your hand. If you do so, exchange 1 acquired card for 1 silver coin.

Adventure:Trading 5 (Event) Discard up to 2 cards from your hand. Gain 1 silver coin for each discarded card.


As you put the cards in your head, you'll start to see patterns.
The masses are blacksmith types, or the will-o'-wisps are laboratory types.
And weak knowledge of destruction and acquisition.

The difference between an altar and a priest

✅ Dark Age: Altar 6 Discard 1 card in hand. Gain 1 card of cost 5 or less.
✅ Renaissance: priest 4 +2 coins/discard a card in hand. Then, when you discard a card during this turn, +2 coins.

Thieves, righteous bandits, bandits, grave robbers

✅玉座系
玉座の間、宮廷、行進、門下生、御料車、冠、幽霊、王笏、首謀者

✅最適BigMoney
6 coins, officialdom if the genus is less than 4 coins, gold if different.
5 coins, dukedom if genus is less than 5, silver if different
3-4 coins, mansion if genus is less than 2, silver if different
2 coins, mansion if the genus state is less than 3.

What is the best way to learn now to make Dominion stronger?
So far, I've done "let's just get it in my head" because there were so many cards I didn't understand in the first place.
Now that I'm somewhat in and seeing patterns, I don't think it's important to learn all the cards as it is.
When I could barely understand the cards, I had to look at the supplies and read them all one by one!
I learned to play cards to avoid making decisions without reading them calmly and feeling sorry for taking plenty of time to read them at the start of the game, that's been eliminated a lot.
The card's effect is written on the card when you look at it, so I don't think you need to memorize 100% of it.

