There is an individual purpose apart from the purpose of the place.
from [/unnamedcamp/individual's purpose apart from the purpose of the place].
[problem of not knowing what to write about in a shared project].
>I feel there needs to be a purpose to the sharing
>Running knowledge/ Consciously doing something "a little hard"/ Aiming for atomicity/ Bringing knowledge together, exchange, interaction
　[/unnamedcamp/nishio.icon]Apart from the "purpose of the place," there is the "purpose of the individual.
　　People are acting for their individual purposes.
　　People belong to a place because the purpose of the place is beneficial to their individual goals.
　　Individual objectives fluctuate from day to day for a variety of reasons.
　　　When the purpose of a place is no longer beneficial to the individual's objectives, the individual leaves the place.
　　　　Especially since the Scrapbox project has almost zero "unseen" cost, so you won't see it right away.
>I feel the need to recognize the issues and individuality of each
　It would be good if each of you write about this "problem consciousness," "individuality," and "purpose"-like thumbing[/unnamedcamp/nishio.icon].


[/unnamedcamp/nishio.icon]
 I wrote[/nishio/Scrapbox Best Practices] in 2017 and it's still being looked at quite a bit 5 years later, so I want to rewrite it with current knowledge.
 My perception as of 2022 was that it was better to place it in a multi-person project instead of writing it alone, and it was felt that
 I did it in [/villagepump/Scrapbox Best Practices 2022 manuscript v1].
 Lack of knowledge and experience regarding multi-person projects through discussions
 from [/villagepump/Scrapbox best practices 2022 manuscript v1].
  >It would be good to check out other projects where multiple people are working[/unnamedcamp//villagepump/takker.icon].
  >If you have the time, I recommend joining a multi-person project that is working well first[/unnamedcamp//villagepump/yosider.icon][/unnamedcamp//villagepump/kuuote.icon].
	So, I think, at least for the present, everything that the other members do or don't do is useful as "observation of a public multi-person project".
	　It is interesting to see voices both inside and outside of the project saying "[it's] hard to write" and "it looks hard to write".
			e.g. [[Loose Solicitation] When you find it easy or difficult to write for a shared project].
