I threw my reservations down the well.
from [/villagepump/2022/03/05]
Frequency of place updates differs from frequency of personal updates.
　I wrote to UnnamedCamp at my convenient pace and it was like a hijack.
　 [scrapbox hijack] is grass[/villagepump/takker.icon].
　  A phenomenon that often occurs when new participants
　At this rate, within a week most of the top pages will be me.
　 I don't really care[/villagepump/takker.icon][/villagepump/kuuote.icon][/villagepump/issac.icon].
　  Is there any disadvantage?
　I've learned to be reserved and choose not to write over there.
　[threw his reservations down the well]!!!!!!! [/villagepump/nishio.icon]!

Let's say there was some interesting article that inspired me to think about it, and I want to write this down.
　At that point, I think it would be good if you could write in a comment so the other person's page can come up.
　　Not the feeling that one person is writing, but the feeling that everyone is writing.
　But if you follow the "write atomically" rule, you should make a new page instead of hanging your comment
　I'm having trouble here, and I've stopped writing.
　　Well, they don't actually stop and write to the well.
　　Human [brush energy] is constant, and it erupts where it's easiest to write, and it doesn't write where it's hardest to write.
 I think you can hang the comment as is without cutting it out[/villagepump/takker.icon].
  The reason is simply that other unnamed camp members do it too.
  Of course, there is the drawback that it will not be atomic
   I have the impression that [/unnamedcamp]pages are pretty much like that.
   I'd like to cut it out, but I'm hesitant to make any strange changes.
    The [Abilene paradox] seems to be happening[/villagepump/yosider.icon].
     Maybe so[/villagepump/takker.icon].
    It is an act of making a non-atomic page atomic, so it is likely to be praised but not condemned.
   At the well, we [dropped the concept of hesitation into the well] and [did it], so we can cut out whatever we want.
    I know I've said this many times, but I love this messiness of the well[/villagepump/kuuote.icon].
    Less pressure to do this or that.
     As I wrote in [Scrapbox Best Practices 2022 manuscript v1], anything is in some ways the strongest[/villagepump/takker.icon].
