unnamed-hub-page
2022-04-02
　Don't expect anyone to participate in such a mysterious project that no one might participate... but I'm glad they did.
　So I'll sort out the messy notes below.

[/villagepump/intellectual production is not stoicism].
　Scrapbox is time-distributed brainstorming
　　You can't brainstorm in a place where it takes courage to write.
　I created a [chat page].
　　If the quantity is too large, cut it out.
　　Cut out after a larger quantity.
　　　Meaning that we don't mechanically create a date page from scratch.

I want to deny the "air of goodness that comes from reading the air."
　You can't know if "your interpretation" is correct until you verify it.
　　Verbalizing and communicating to others is a means of validation
　　I think "reading the air" is "assuming your interpretation is correct without verifying it."

---log

2022-03-07
　[write a sentence, then title it].
	[name the project after the pages are assembled].
	[Few people are okay with a harsh environment with no rules.]
	[Movements are made by followers.]
　I should have put it in the project, but I wanted to release it with "almost nothing", so I put it here as a memo.

2022-03-30
	[You don't need two unnamed projects, but one might be nice.]
	[First of all, Home is assumed to be there.]
　[Put the text you don't want edited in Home].

　It's not that there aren't rules, it's that they haven't been verbalized yet.
　Rules come after conflicts.
　Rules are minimal.
　Rules and visions are different.
　　Vision, policy, and direction should be clearly verbalized.
　　Not the first person to verbalize it, but after 100 pages are gathered.
　　Emergence from the bottom up by members, not a vision created and descended by one person.
　　I'll think about it after the 100 pages are done.
　I want to deny the air of "airs and graces."
　　The "guess what" that demands airtime.

　Questions promote verbalization.

　[期待]
　　what is
　　A disprovable optimistic observation, eh?
　　　[Stockdale Paradox].
				[Expectations of immediate response].
				Abandon short-term expectations, long-term results will be beneficial
　　[He who passes through this gate must give up all hope.]
　　　What to throw away
　　　Expectation that others will respond positively to what you write
　To begin with I should not expect others to participate in this project.
　　Start to work without the participation of others in the
　　The project will be named after 100 pages are done."
　　Even one person can reach 100 pages.
　The expectation that others will behave in your favor by reading the air

　Assumption that Home
　　It would be interesting to make full use of inter-project links.

[/sta/Unnamed Camp]
	>[I'm just trying to make an example out of you.]
[/villagepump/intellectual production is not stoicism].
	I tried to quote it, but I couldn't find just the right sentence.
	　Wellsprings are brainstorming sessions.
	　Time-distributed brainstorming
	　　You can't brainstorm in a place where it takes courage to write.

It would be good to [dash off] the opinions of others and add
　Explicitly say, "That's a good thing, let's keep doing it."

Operation not locked at first
Lock the door after a certain number of people enter.
　[Hide the gate but show the brilliance inside the fence].

2022-03-31
I updated the project a bit.
　Hiding information about the creator will eventually ooze out.
　When you strip away all the descent attributes and use "an unnamed project", in the end it cannot escape the attribute "an unnamed project by [nishio.icon]".
　Considering that [what separates Wikipedia from Scrapbox is subjectivity], shouldn't we rather try to erase the subjectivity of [nishio.icon] here?


　There's no point in rushing.
　　Only grows at the proper growth rate; if you pull it too hard, it will die.
　　　[Conducive]
