Domininon 2022-03-06
[https://gyazo.com/a2dd48ee7380332856cc7ce6db7b89cd]
　Workshop Garden Route
　There are no cards with more actions, but there are two different laboratories, so can they be drawn off?
　　It looks good to be able to banish the genus state if it's a draw-off, since the expulsion can banish any number of types of cards from the hand at once.

Workshop Garden 1 point loss
Workshop garden AI also came and lost
cutoff (e.g. cookie cutter)
　Decreased cost of destrier, not number of cards played, but number of cards earned.
　I don't fit because I don't want to increase the number of sheets that much in a pull-off.
　It was looking good until about halfway through, when the witches' coven was activated and it stopped turning.
　Pull off and play 5 stockpiles to buy 2 genus states and a stockpile.
　　Stockpiles withered and ruined.
　　The deck died when they hit me with 10 cursed cards when I had one genshu left.
The pull-out is vulnerable to curses, if you can run through it before the witch coven curse is triggered, but not if you don't make it in time.
　On the other hand, if you expect to eat the curse, is it a stero with more treasures? Is this one faster than a pull-off?

First move 5-2 Witch Assembly
　I could have hit more and more witches in the lab and made them eat the curse, but the three mountains end.
　　Curses, gardens, stockpiles
　　You're acquiring them at the workshop.

Workshop Garden
　Buy a house and tie.

First witch rally, plus the action produces coins, so if you put in four coins and pull them off at the institute, you can buy the genus state, line.
　The opponent also comes to the witch coven and the curse is struck early, 4 cards.
　I had more laboratories, so I was able to draw out all the curses and exile them from the deck at once by destroying them.
　Laboratory, 2 excess
　Huh? The curse.
　　Oh, if you banish the curse, it will come back at the witch coven!
　　I guess I should have included the reconstruction.
　two-point victory
　　End of the renovation to make the curse a mansion and buy a mansion with 2 money to wither it.

Workshop Garden
　I won with 51 cards in a 6-card deck of gardens.

Let's try the stero route too.
　Dump the coppers at a moneylender, and when you're done dumping them, renovate the building.
　The genus state withers and loses before it can be discarded.
　Ah, the witch coven is a silver coin with an attack on it, I see.

I bought two steroids and two genus states with stockpiles in the workshop and then they took seven gardens in that workshop, I see.

Ah, right, stockpiles make moneylending less attractive.

Workshop gardens, what you buy after the garden dies is important.
　The deck's turnover is low, so even if you include bounty hunters' banishment and renovation, you can only hit it once.
　If you buy silver coins, you won't get a second round, so then a stockpile is appropriate.
　　Not only more coins, but also more purchases so you can buy more coppers.

[Dominion Maniacs Special] arrived.
