Re:2022/03/05
from [/villagepump/2022/03/05]
[/villagepump/nishio.icon]
 >I'd love to see the Scrapbox Best Practices page and get some tips on community-use projects!
		I realized I was too inexperienced to write, so I participated in a lot of things to increase my experience.
  Was that what the Slack participation notification was about (language community)[/villagepump/takker.icon]?
  　I tried to get in three new ones at the same time, but I think the manager was busy with his day job during the week on that one.
  　[/vim-jp-emojis/naruho.icon].
	[/villagepump/write filler icon or].
	[/villagepump/place update frequency differs from personal update frequency].
	[/villagepump/wells are the strongest because there are no rules].
	[/villagepump/really want quick feedback].
　If I were to create an intellectual production co-editing project, I would set a high hurdle, like "intellectual production takes place by doing something cognitively demanding," but since most people would pass under the hurdle anyway, I would set the hurdle so low that they could not pass under it.
　　Almost well
　Do you want to give some direction to the theme?
　　What is "intellectual production"?
　　　I feel like the wells are already biased towards intellectual production-like topics, maybe since nishio's arrival? [/villagepump/inajob.icon].
　　  I think people who use Scrapbox basically tend to be like that. w[/villagepump/nishio.icon][/villagepump/kuuote.icon].
　　  [/villagepump/intellectual-production-atmosphere].
　　I mean, I just realized that if it is beneficial to "write the contents of the page and then give it a title", there may be merit in "[naming the project after the pages have been assembled]" (...).
　The opposite of my project as a [quiet room].
　I was thinking about it, and it turned into a disturbing project that says "[Those who pass through this gate must give up all hope...]" w
　 https://ja.wikipedia.org/wiki/地獄の門
　 　That project, hell!
　 Rodin's "[The Thinker]" sits above the gates of this hell.
　Well, it's getting interesting, and I'm thinking weird things, but I don't think it's going to work if you focus on these non-substantial things.
