Dominion 2022-03-07
Rating competition with an unknown person in the world for the first time
[https://gyazo.com/5cc382a5f1b056ac99870db62f6def37]
Village, blacksmith, 3 guards, 2 silver coins, 2 gold coins, purchased 4 genus states ahead of time.
　I was very nervous.
My opponent had bought a mansion early on and a garden in the process, so I thought, well, we're not going to lose.
He bought a village and a blacksmith shop along the way, maybe based on my play, and he was on the chain for quite a long time.
[https://gyazo.com/2db570f81ea3f58723ced11d8b4e6086]
I've been in the chain, but I'm short on treasures. You can't even buy gold coins because they're 5 gold, you can buy silver coins first.
Rate? Fluctuated.
　[https://gyazo.com/af5b1dfa18fff1a32bce287c2f22aa10]
　　I see.
　　[https://gyazo.com/75a36c4863fda39ca2a2b0172ddd3785]
　　They say new players start with a rate of 35, but I got 38.8, I'm not sure if that counts playing with friends or fighting the AI.
　　　I also saw a description that it is not a rate game when you add a bot, so it must have been a rate game when you played with your friend (I didn't see it because he set up a table).


This match lasted about 18 minutes, including matching.
You can play with just the basics without subs.
　I'm setting my level at 1 in the matching so I only get the basic supply.
　I guess if you raise the level, it becomes "if they have it, that's what you'll get".

Second time, this time I try to raise the level to 10. I also tried to squeeze the bottom of the rate. I tried to get it above -4 and got a warning, so I'll leave it at -5.
[https://gyazo.com/46fc848be26b7e5e17c433f800e66358]
[https://gyazo.com/074cc4a402828691776c90591d8d3586]
　Isn't it basic again?

I'm getting nervous.
　I thought it might be a bandit stero for silver coins silver coins, but 6 gold came first, so I assumed craftsman, laboratory.
　The opponent is doing this, is he strong?
	[https://gyazo.com/e8fabdd299622d20071bc8efb797432b]
	[https://gyazo.com/5bbd835b046af11623856b44c047994b]
　I see. Strong.
　[https://gyazo.com/ed96fceae0d1d77569964b47fef087a2]
　I bought four victory point cards w
[https://gyazo.com/c2d4dff3dd4a95f80b38ee733bfd2d45]

Vassal, it's a terminal action...
　[https://note.com/urihari/n/n215ccc9cf8c1 Dominion Tactics Explained: the Vassal Chain｜Urihari｜note]
 Ah, I see, so if the action ratio is high, it's effectively two cantrips of gold.
　So it is safe to offer coins at festivals and vassals against the destruction of treasures by bandits?
　The only thing that can be compressed in this supply is the guards...
　　There is no compression, so is it the first vassal vassal or the vassal silver coin? Oh, the one in the supply is not a workshop, but a renovation, so let's go with the vassal renovation.
　Turn 7, 10 gold, genus state
　　If I had more purchases, I'd put in a festival or something.
　Turn 12, 15 gold 2 purchased. Maybe a genus state festival.
　Turn 14, vassal withered.
　Turn 18, 1 province left. 25:27
　Turn 20, 28:33, 11 Fri.
[https://gyazo.com/4594f4e05b4e436a04abeeaa17fbb956]
We barely won, but this is a slow build, right?
　The way you just played it, you're losing on turn 15.
　Looking again at the opponent's hand, we see
　　There are four guards in the room, this compresses it.
　　Four moats too.
　　Festival 6
　　Acquired by artisans?

Tried again. Early on, I could not take advantage of the overlap of vassals and renovations with each other. Better not to add too many actions until more actions are added at festivals.
　First hand, silver coins, renovations
　　The silver coins will be destroyed later.
　T5 Craftsman
　T10, oh I see. I can put the action on the top of the deck while destroying it with the guards?
　　You can also stack action cards in your hand with artisans, I see.
　　Craftsman with two actions remaining, leaving the acquired guards in hand and loading other actions...
　T13, sort the deck top in guards from vassal to festivals and play vassal! Makes sense.
　　What do you acquire in a craftsman, the person who just said that didn't buy the institute, but isn't it good?
　T14, Institute 2 festivals guards, vassal vassal festivals, 3 actions. Moat. Hmmm, 4 purchases, 12 gold, 2 actions, 2 moat renovations, 2 artisans, 21 points difference, 5 left in the province, how do you interpret that? Should we go after it now? I'm not sure....maybe we should make the artisan a province by renovation, and the province and vassal by purchase. I miscalculated and it was 14 gold. Maybe 2 vassals?
　T15, opponent is a dukedom, 18:24. 2 guards, 2 vassals, 2 renovations, and a craftsman in the province. 6 gold... maybe a dukedom.
　T16, opponent has 7 gold, 1 genshu left. 27:27, hand, 2 moat, 2 rebuild, 2 genshu... Hmmm, there is a way to tie the score.... I'm thinking of rebuilding the dugout into a mansion.
　T17, opponent is a public domain. Institute, Festival of Festivals, Guards ~. 17 gold 4 purchased. Residence of the Duke of Gongsheng
　Oh, I got logged out before the results were displayed.
　　Well, you didn't see it, but you would have won. It's still a little late.
　　Two turns too late I could have bought four victory point cards too.
　[https://gyazo.com/5cb169f9179163bfecddaf425eb9993f]
　　I made a mistake on the loading operation and it's the other way around, but it's okay because what I want to see is the deck list, and it looks like there's a lot of copper coins and mansions left over and not enough compression.
　　Shall we try to guard promptly with first hand silver coins silver coins?
　First silver coinage silver coinage
　You bought a guard on turn 4 and got discarded by your opponent's bandits.
　I bought 3 cards by turn 6.
　　　Craftsman, discarding three cards.
　Turn 8, buy market and shuffle
　　So far, the only terminal action is the craftsman, so there should be no accidents.
　　Oh, I made a supply mistake, it was the storeroom, not the market... oh well.
　Turn 9, discard 4 cards. Craftsman takes the festivities, vassal x2.
　Accident, 9 gold 2 purchased. festive vassal
　13 gold 5 purchased, 4 vassals purchased
　Pulled off, 22 gold 5 purchased, vassal vassal vassal vassal vassal vassal
　Institute at the Craftsman, 26 gold 5 purchased, 3 genus state. This leaves 1 genshu remaining with a 12 point lead.
　　AI bought the last one and killed itself.
	[https://gyazo.com/3d7e6c612d6ead11989f12577f866bea]
　Thirteen turns, or did it work this time?
　　The compression was a long way because only guards were available, but first I bought silver coins to stock the guards, then destroyed the silver coins.


vs Human
[https://gyazo.com/fa75603e53e5162b1047ce45666263f8]
[https://gyazo.com/de14fb83ccae0f166e0ca2e8e290468e]
I tried to play one more time at the end of the day and ended up with 5 minutes left today, so it seemed to go more quickly than I expected, or maybe because it wasn't a pull-off.
　If you use the Capitol against me in Stero, I'll change states every turn...
　The amount of money seems to be insufficient since the other party was a gazetteer purchase even when there was a lot of it.
　The other party bought a gentry state and ended it.


[https://gyazo.com/44a554cbfd0e3a196e2affff27668aad]
