Line Drawing Function
By "drawing a line," we can express "the relationship between distant objects.

In the original [Kozane method], lines are not drawn. In the KJ method, lines are drawn only after the spatial arrangement is completed.
Why is that? Because the [Kozane method]/[KJ method] was created in the age of pen and paper. Once you draw a line with a pen, you cannot move anything on either side of it. So, you cannot draw a line until you have finished moving everything and the location is fixed.

Digital Stationery [Kozaneba] has solved this problem.
You can draw a line between things whose position has not yet been determined and then move them again.
Kozaneba has pushed the limits of the paper and pen method. I am finding it so convenient that I don't want to go back to paper.

However, we are not sure if the line-drawing feature will be beneficial to users who are not familiar with the [Kozane method]/[KJ method].
The ability to draw a line gives the user more choices. When there is a relationship between two things, should the relationship be expressed by "putting them close together" or by "drawing a line"? This is a decision that users need to make. The burden increases until the user sees a real benefit in Kozaneba.

I have been doing the Kozane/KJ method on paper for 10 years and have found it to be of real benefit. In other words, the ability to draw lines is not essential for real benefit. If you are not sure whether to express yourself by "putting it close" or "drawing a line", I would recommend "putting it close".

[* On the word "line"].
Lines represent "relationships between things that are far apart.
These "things apart" are not necessarily just two.
I call this concept "line" because I can't find a better word for it.

Excerpt from [/kozaneba-forum-jp/release-note
　Arrows can now be added from the selection menu.
　 [https://gyazo.com/cef794096b06743c1bbd9b9c4b40f0c4]
	矢印追加APIを作成
		Added the ability to pull arrows together in a user script.
		[https://gyazo.com/db24cc8fbda75c98c436458fb4fcf5fc]
	Add the double-headed arrows to the menu because they are used so often.
	　In addition, the arrow addition menu up to now also clearly states that right is head.
　The arrow addition menu is now an image, making it easier to visualize what will happen.
　[https://gyazo.com/5b240c04a1f83c891eba3a279609964b]
　2021-09-16, "Add the ability to pull arrows together in a user script."
　On 2021-09-17, "Added to the menu because of the frequency of use of the double-headed arrows," and "Also, the menu for adding arrows up to now clearly states that the right one is the head."
　　These three have been transformed into a menu of images.
	[https://gyazo.com/8856cb7b7951c957dfdfe3cf6f27f15a]
		Added double lines/arrows and lines without arrows.
		In previous versions, the expression "this and that are the same" could only be expressed by proximity. From the current version, it can simply be expressed with a double line.
	Leave from linesメニュー
	　Weaning from associations with lines and arrows
		[https://gyazo.com/f83f83f555be85ab03d5b9d457b9ec98]
