Kozaneba:Proofreading:Line drawing function
before
code::
 By "drawing a line," we can express "the relationship between distant objects.
 Drawing lines is not done in the original [Kozane method]. Also, in the [KJ method], it is done after the spatial arrangement is completed.
 
 Why is this? Because those methods were created in the age of pen and paper. Once you draw a line with a pen, you can't move anything on either end of it. So you do it after you have finished moving it and the location is fixed.
 
 Now that the software is electronic, this problem has been solved. It is now possible to draw a line on an object whose position has not yet been determined and then move it again. The author finds the line-drawing function useful and feels that he has surpassed the limits of the KJ method done on paper and does not want to go back to paper anymore.
 
 However, the ability to draw a line gives you more options.
 When there is a relationship between two things, the user must choose whether to express the relationship by "putting them close together" or by "drawing a line" between them.
 
 The author has been doing the KJ/Kozane method on paper for 10 years and has found it to be of practical benefit. In other words, the ability to draw lines for practical benefit is not essential.
 For the author, who is accustomed to using and has used repeatedly the technique in which the only method for expressing a relationship is to "put them close together".
 The "draw the line" feature would be beneficial, though,
 I am not sure if this would be beneficial to those who are not yet familiar with these methods.
 I worry that more choices will increase the number of things to worry about and the road to actual benefit will be longer.
 I am hesitant to enter the tutorial because
 Might not default to display in the menu.
[https://gyazo.com/71aa2e7ab8cb6093cf105f8056c8884d]

The order of the second half of the program has changed dramatically.
[https://gyazo.com/38850f46bb006127230db9c2cf819546]

after
[Drawing a line function].