Dominion 2022-03-08
[https://gyazo.com/20840ff8c086981d83b4c4283f9470b5]
　The first 5 gold came from the Capitol Stero
　
[https://gyazo.com/e1816851dedf7cd1b0f9a567aaaf64b5]
　I was going to guard with silver coins for the vassal loop, but my opponent also bought vassals early on.
　　I don't think there's enough to take away.
　There's a witch, and if she hits the curse, the loop will stop connecting.
　I was a little lost, but I was going to use the guards to compress and hit the witch.
　I bought too many coins, like 7 gold, so I'm going to put in the Capitol.
　A bit of a failure, lack of action.
　　It's hard to grow up with a militia because the opponent beats the militia with more time to spare.
　　It's not enough because there are three terminals in it, militia, witch, and capitol, and one throne to increase the action, I guess I should have bought it sooner.
　　The opponent hits the militia at the end every time.
　This was the game to pull off first, and I'm losing, I'm ahead on points, but it's hard when you hit the curse with frequency.
　　The other guy's vassals are circling, so they'll catch up with us.
　The other party, I could have bought two copies of Genshu, but I could afford to buy the action, gnu.
　I won two genshu in T18 and got turned around.
　I pulled through, but 5 gold, I failed.
[https://gyazo.com/003979ad6aa1de28fba80023aa19f300]

[https://gyazo.com/bb3e77ae4cd61ad1bf8b789858d31a74]
　I bought a retainer, but the compression is only moneylending, and then renovations.
　No more actions, so it's a problem when they're covered.
	[https://gyazo.com/e0fe38860d67e84ac0029e16bccf2ae1]
　I just barely won.

[https://gyazo.com/6099f8bb52cb747042072a0359ee3d3c]
[https://gyazo.com/99b4e66279532c1d4fbad7d5d7bc66a9]
Because of the image of being beaten up by a vassal, when Supply has a vassal, it's easy to say, "Vassal? but in the end, I didn't make him a vassal.
　It takes a lot of time and effort to compress until the vassal is in a position to continue pulling the action.
　The vassal itself is a terminal, so if you don't get more actions, the vassal who got more than one card in his hand becomes a dead card.
　If I had two terminal draws in this time, and I had to run the deck to draw them, I would have preferred the 3 gold to be a cantrip, not a vassal.
　I bought a merchant, but I think I would have been better off with a forerunner.
	[https://gyazo.com/127c85bb184f45b509d3e82ccaef1466]

[https://gyazo.com/d68aef5d6ae5d4c63275e32d22ee5c4b]
		https://www.reddit.com/r/dominion/comments/6d77u3/dominion_online_bell_curve_distribution/
