wat watashi (Ischikauia steenackeri) (freshwater fish of the carp family)
from [/villagepump/2022/03/08]
　When you are busy with a lot of tasks, you are stimulated by something you happen to see and you say, "Oh, I should probably do that! and add a task [human bug].
　　(現在進行形)
　　Think calmly! You don't have to do that now!
　　Go back to basics and write it down first
 　　この目的で[Inbox] ([GTD])を使い始めた[/villagepump/takker.icon]
 　　 Put it in [UserScript to quickly put it in /takker/Inbox] and forget about it on the spot.
 　　 We're operating pretty well there.
　　Newly conceived tasks tend to pile up on top of the stack when left to the brain
　　　But the truth is that unless there is a "clear reason why it should be prioritized over the previously recognized task", it should be added to the end of the queue.
　This "wata wata" is a little different from impatience.
　　Impatience is a negative feeling, a "Oh no, this is bad, this is bad,
　　Wata wata is positively high-strung and manic?
　　They both have the same point that the gears are not meshing [spinning].
　　ref [parable of the gears].
　　[Impatience] is,
　　　First of all, the gears don't mesh.
　　　So there is no output.
　　　They begin to get impatient when they realize that "the expected output is not being produced."
　　　You get impatient and rev the engine faster, but the gears aren't meshing, so you don't get any output, and you get impatient again.
　　　Empty engine overheats, with no results, of course.
　　　[Hell of slacking off in frustration].
　　The [wata wata] is,
　　　There are a lot of [small tasks that can be done quickly].
　　　As you're doing [the crunch], the tension rises and the engine starts revving faster.
　　　Suddenly bang! and the gears or something breaks, and the speed becomes uncontrollable.
　　　　The steering wheel doesn't work either, and the car runs in strange directions (= tasks are not properly selected and prioritized).
　　　　ref [fighting for steering wheel of car].
　　　The engine starts idling even faster because the load is removed.
　SNS notifications and Scrapbox Streams exacerbate the latter situation because they generate a large number of "small tasks that can be done quickly" that say, "Oh, I should comment on this.
　 井戸端開くと毎回起きるやつだ！[/villagepump/takker.icon][/villagepump/kuuote.icon]
　  This was the reason time was melting away every day~.
　 #井戸端依存症の病理
　Important tasks with deadlines, easily triggered when waiting for others to take action
　　I'd be curious to see if they've had any action, so I'd go to the notifications.
　　そうなのか[/villagepump/takker.icon]
　　 So what is it about ...... that makes you open your well at all hours of the day to worry about it?
　cope
　　No caffeine today.
　　 ？[/villagepump/takker.icon]
　　  Does it mean to force them to sleep with drowsiness?
　　   (I assumed that caffeine was used to numb drowsiness so that they could work for longer periods of time.)
　　  眠気とは無関係な話[/villagepump/nishio.icon]
　　   Caffeine is a drug that produces excitatory effects by disabling the inhibitory neurotransmitter adenosine
　　    [/icons/知見.icon][/villagepump/takker.icon]
　　   I can't show you the exact source, but I wrote this with the feeling that it's not right to break the brakes when the car is spinning because the brakes aren't applied.
　　Tasks are written down
　　[Pomodoro] do (do not go to the notifications during Pomodoro, use as a barrier)