How do you write a project proposal?
2022-03-09
This is Nishio, a [unexplored junior] mentor.
The application form for this year's unexplored junior competition is now available.

I think that many of you are writing your first "[project proposal]" when you apply to Unexplored Junior. It is not good that the quality of the proposal varies depending on whether or not there is an adult nearby who can give useful advice, so I wrote this thinking about what advice I would give if I were nearby.

First, open the proposal template and take a look at it!
	https://jr.mitou.org/download
　Let's not try to fill this in head to head.
　First, feel free to write anything you want!
　　It can be done in a text editor or with paper and pencil.
　　Thinking is hard work, so tools should be mindless but usable.
　　Hereafter we will refer to it as "notepad."

>Title of proposed project
　Skip this as it will be written after the proposal has been clarified.

>Name of main creator (representative)
>For groups, names of members
　There is no advantage to having more members.
　In fact, all of the projects selected for 2021 were one-person projects.

>Brief description of the proposed project (200 words or less)
　First, write as much explanation as you want without worrying about the number of characters.
　　Find out the number of words after you write.
　　If it was less than 200 words, then you are not thinking about the project at all.
　　It is good to write about 400-600 words, then delete words that are not necessary, or give up low-priority parts of what you want to say, so that the concentrated result is 200 words.
　　If you can't write 400 words at this stage, don't worry about it and move on. Write the others and come back to them later.
　　Even if you could write 400 words at this point, you will probably want to come back and write something else after you have thought about the other parts, so let's move on first.

>Proposal Details
　This is the main part of the proposal
　　Don't try to write neatly and neatly in the proposal from the beginning; instead, start with a notepad with ideas of things that might be good to write about.
　　Write down as many ideas as come to mind. You can decide later which ones to put in the proposal and in which order.
　　If you run out of ideas, read the questions!
			>What is it like?
				>Explaining to Grandma and Grandpa
				By trying to explain something to someone who has no knowledge of it at all, you realize what you had not yet told them, and it becomes a language.
				You may think, "My mentor probably knows what I know as well as I know it. However, you may be surprised.
				There is little harm in writing about what your mentor knows. Rather, it is evidence that you understand them well.
				On the other hand, if the mentor does not know what you did not write because you thought the mentor would know, that is a big loss: the mentor cannot understand your proposal well.
				Where is the proper balance is a difficult question, and there is no right answer. When in doubt, it is safer to write.
			>Who would be happy to do this?
				>Not necessary to help a lot of people
				>It may not be useful, but it can be interesting!
				Combining the two, of course, makes one "interesting to me".
				There are some adults who assume on their own that it is not enough for them to be interesting, that they must make their proposals beneficial to the world and to others, but this is not the case.
				The important thing is for you to think carefully and put into words whether the proposal you are about to make is of the "interesting to me" type or the "someone who would enjoy it" type.
				If you are the "I'm funny" type, you might want to think about how to express how it is funny in words, images, or videos, and how to make people who see it think it is funny.
				If it's the "someone who would appreciate it" type, then who exactly are they? How do you get them to use what you make? Will they really enjoy it? If you think about these questions, I think your project will have a better chance of success.
 		>What are the existing means (some method, product, service, etc.) of solving a similar problem?
　　　　For example, in the case of a proposal to "create a service to share shopping information with family members," how is that "lack of information sharing" problem being solved by existing means? For example, there are many ways to solve this problem, such as putting a memo on the refrigerator, or creating a family channel on LINE.
　　　　What are the advantages of what you propose compared to those?
　　　　By thinking this way, the strengths of your proposal will become clear.
 		>How do you make it?
 			>Please describe exactly what you propose (software or hardware) and how you will make it using what technology, data and tools.
 			It's very important, but you are the one who makes what we propose here.
 			So I am interested in the extent to which you have thought about how to make it.
 			It is not necessary to know 100% at this point. It is very good to write, "I understand so far, but I don't understand this part. It means that you are able to put into words what you don't understand.
 			On the other hand, if you can't write how to make it at all, you might want to do a little research before writing your proposal. There is no point in writing a beautifully written plan that cannot be realized.
			>What are your unique ideas?
				>What is unique about your proposal compared to existing ones?
				>Let's write down some of the improvements we've made.
　　　　Unless you copied something existing in its entirety, there must be some "difference".
　　　　I would like you to explain this difference. Because what may be obvious to you may not be so obvious to your mentor.

>3. why you want to use your valuable time to make this project happen (optional)
>Please tell us why you think you are better suited to take on this project than someone else. For example, what are your unique strengths or past experiences?
 Again, since this is important, you are the one who will implement this proposal.
 Useful projects, basically, do not go as planned. You will have to think a lot about "situations that don't go as expected" to get closer to what you "want to achieve".
 What is the driving force within you to do it?
 What are your surroundings that would help you do that?

>4. what you have done on this project to date (optional)
>Please describe any work you have done so far, such as research on similar products, questionnaires to test hypotheses, experiments, or development of prototypes. If you can describe in detail what has been done and to what extent, and what will be difficult in the future, it will facilitate our communication in the interview.
 I would like to know what was done and to what extent it was verified regarding this project.
 If you think you don't have anything to write here yet, think about what you can do before the submission deadline and give it a try.
 One thing to note is that it is not "great if you write some programs".
 　I think there are probably people who would be happy to create this service, so I'm starting with a WebUI that is easy to create."
 　...That's a lot of wasted work if "there are probably people who are happy" is wrong, isn't it?
 　Have you talked to people about whether or not they are "happy people?" Or do you just think so on your own?
 　If this is not written, I would think that you are just thinking that way alone.
 　Even if it is "I talked to three of my friends," it is still a "hearing investigation to test a hypothesis. It is valuable.
 Again, it is not "great to have done it"!
 　What is more important than "what I did" is "what I gained by doing what I did.
 　It's a very good story, "I made a prototype and it revealed the problem of -"
 　This is also a good story: "When we talked to our assumed users, we found that they were troubled by unexpected things!

>5. software or hardware previously produced by the proposer
　We are looking to see how much experience you have in building something and what type of experience you have. Anything you can think of should appeal to them.
　If you are using the same technology as used for the project, the evaluation of technical skills is a plus, but even if the technology is unrelated, "making things" is all about the experience of "managing situations that don't work" through trial and error, so it is easier to understand if something is written that shows this experience.

>6. approximate hours of work per week
>7. plan for use of development expenses
 This is a time plan and a money plan. The plan will be modified as circumstances change, so you should write how you feel about the current situation.
 It is not the case that those who work longer hours are more likely to be adopted; it depends on how much can be done in an hour, and projects are often delayed by unforeseen events to begin with.
 You do not need to plan to spend the entire $500,000 budget for development. To begin with, software projects require less than hardware projects.
 The amount of money spent does not change the likelihood of being adopted. Everyone can spend the entire budget.

>8. self-promotion
	I feel like every year there are applicants who are interviewed and told, "Well, if you have such an interesting story, why don't you write it down in your personal statement?
	People who did make it to the interview are told to "write it down" like that, but for those who didn't make it to the interview due to lack of appeal, they don't have the opportunity to realize that, which is a waste of time.
	I think you should keep the information for your appeal digitally somewhere and copy and paste it from there when you write these proposals.
	Organizing "what you did" and communicating it to others as needed is an important skill even after you enter the workforce. This is a good opportunity to practice.

Well, we are finally at the end of the proposal.
　What did your notepad look like?
　Is your proposal jam-packed with content you want to write about? Or are you scrambling?
　I think the most common case is that there is a good amount on some of the topics, but I have not thought much about some of the topics, so I am scanty.
　Add to your notepad where you think it is missing. Add a note to your notepad saying, "This is where it's missing." Then think about what you need to do to fill it. Can you just sit at your desk and think about it, or do you need to research something?

When the whole thing is sizzling, it's time for the next step.
Decide on a title for your project that you left blank.
　This title is the first thing a reader of the proposal will see. It is also the one they will see most repeatedly.
　Which of the following two proposals do you think is better?
　　A: `123-Yasukazu Nishio-Kozaneba`.
　　B: `123-Yasukazu Nishio - Digital Stationery Kozaneba` to organize your thoughts
 A will not be remembered at all. One mentor will talk about "Kozaneba's proposal -" and others will say, "Well, what was Kozaneba's proposal?"
 Unexplored Junior Mentor Suzuki wrote a good article on this subject
 　>2. Explain "Domain," "Purpose," and "Means" in the proposal title.
 　[https://zenn.dev/reputeless/articles/idea-mitoujr Unexplored Junior, 5 Tips for Creating a Proposal that Communicates]
　　I urge you to read it. I recommend it except for the part about how to write the title.

Now that you've made it this far, I hope you've gathered some information in your notepad that looks good to write in your proposal, as well as a good title.
The next step is to quickly write a proposal... before
	>Proposal Sample
 > Some of the proposals submitted by the successful applicants up to last year are available below. Please note that the format may be partially different from this year's proposals.
		https://jr.mitou.org/download
　Download and read this.
　The objective is "to increase the repertoire of ways to express what we want to say.
　You have already accumulated "what you want to tell" in your notepad, but you don't know how to output it efficiently.
　That's exactly the kind of knowledge we need right now. That's why we learn efficiently by reading proposals written by others and copying good practices.

By now, you're probably itching to write a proposal. Let's write it.
　You can reapply for proposals as many times as you like, so once you have written one, apply.
　People who apply for the first time just before the deadline probably start writing when the deadline is approaching and send in their last-minute application. Try to fool yourself into thinking that the deadline is a week earlier than it is. You will want to fix it.
　Letting it sit overnight and reading it over will improve your writing. Those who finish and submit at the last minute are losing this chance.

OLD TITLE: Advice for Applicants to Unexplored Junior
