Dominion 2022-03-11
Expansion: Alliance has been released for the Steam version!
　Cards not translated.
　Crashed twice.

versus (vs, against) the opponent
[https://gyazo.com/9afa58a974e18b79d64d34e53f11e2a1]

[https://gyazo.com/8bc2d7cf487da8732e1e9efefaf9801d]

[https://gyazo.com/0dea9285cf6137e9c572619b60eb2177]

[https://gyazo.com/e32e9dc15cd1da801776ab87a2b80ebc]

Importer to acquire guards, compress and insert vassals.

[https://gyazo.com/cea5abdea918f117b8a82db58db9a592]

---
Replay vs. AI
[https://gyazo.com/9afa58a974e18b79d64d34e53f11e2a1]
Importer, gains up to 5 cost cards next turn
Merchant Camp, 2 actions, 1 coin, may be returned to the deck when discarded from the field.
Brokers, discard and get a lot of different things depending on cost.
Carpenter, 1-action workshop, and a dry mountain change to renovations when they are present.
Contract, 2 coins, 1 faber, action can be carried over.
Guild Master, 3 coins, 1 faber when acquiring cards
Hunter, 1 action, draw an undetermined number of cards

Plus Action, Throne, Merchant Camp
Draw, Hunter, Broker
Acquisition, Importer, Carpenter
Compression, Broker
Attack, Militia

Only hunters can deal with hand reduction by militia, put in importers to get hunters promptly, hunters are a plus one action so you can put in a lot of them, put in brokers and compress depending on the money situation
　First importer x2
　Merchant camp back in the deck, one or two hunters will come and you can draw with it.
　Passing and Winning

---
[https://gyazo.com/8bc2d7cf487da8732e1e9efefaf9801d]
It is difficult to do supply checks when there is a split deck, and although it may become possible to recognize them by solidity once you get used to them, you still have to read them one by one to know what they are.
For now, let's just do it as if we can figure it out gradually, because aiming for perfection is exhausting.
You can collect herbs, buy +1, discard your deck, and choose one of the treasures from the discard to play.
Battle Plan, Cantrip, +1 draw if you reveal an attack card. Not in this supply.
Old map, cantrip, discard one and draw one.

Plus Action, Villagers
Draw, Capitol
Acquisition, Capitol, Specialist
Compression, none

The capitol stero is thick, but the effect of the alliance is that without one friendship per turn, you have four cards in your hand.
I was in a hurry to buy a couple of underlings when I played against them, but honestly I didn't need that many.
　First hand double silver coin
　金貨
30:37, the province loses
　You can really pull in gold by collecting herbs.
Play 2
 First hand double silver coin
 being outpaced (or outmatched) by speed
Play 3
 First hand double silver coin, do not buy underling, just a contraption.
 　more than enough
 being outpaced (or outmatched) by speed
Play4
 First hand, herb collection, silver coins
Crashed W


