Nodal Point of Thought 2022-03-11

2022-03-11
 [who thinks he knows]
 [looks at a small area and says "no"].
 [not "senile people" but "senile behavior"].
 [There are two ways to behave toward new things.]
 [You have to pay the cost of mastery to enjoy something new].
 [Old-age behavior is interpersonal behavior].
 [Technology that doesn't age is beneficial for intellectual productivity in life as a whole].
 [Tends to make the question the title]
 [It's useful to raise the resolution of the old man, but don't talk about it].

2022-03-12
	[The Three Elements of Senile Behavior]
	[labeled "labeling"].
	[meaningless classification].
	[Downloading]
	[We need to stop imposing a "should.]
	[Pushing" against others is a harmful interpersonal behavior].
	[Young harm]

2022-03-13
	[Without conflict, there is no dialectical development.]
	[clipped remarks are shallow in their digging]
　[Atypicals who integrate into society through emulation increase their purity as they age].
　　This cut-off isolates the concept of "old age."
　　Until now, I had vaguely thought that cognitive decline would lead to more strange behavior.
　　This can be divided into two types
　　　'The cognitive decline of sedentary individuals increases their odd behavior.'
　　　Asperger's who had been emulating the stereotypical developer, but were reverting back to their original behavior."
　　　I was planning to deepen my understanding by collecting case studies, but the majority of the world's case studies are from the former, typically-developed people, so they are not useful for the latter

Unorganized mess below

Collection of senile behavior
　Thinking "it's always been that way" when you've only observed a limited point in time.
　Assume that "the other person is experiencing X for the first time this time what you experienced in the past."
	Old people who observe only a small area and assume that what they get there is all there is.
　　I think it's all about a narrow range of observations.
　Affirming everything that is new.
　Some old people move around and do extra work, others don't do anything and don't make changes.
　Some old people lump things together like this, saying they are all the same, while others individualize everything as being complex.
　People who don't know how to use the tools make the tools look bad.
　Labeling and shaming people whose behavior you don't like as "that person is XX".
	push the argument that something should be done
 	Kota Mizushima
   >My personal view after reading through the book is that as one ages beyond a certain point, one naturally becomes more and more "ought" (or perhaps it can be paraphrased as the norm for living in society).
   >At the same time, there also seems to be a tendency for people to acquire enough power to impose their "ought theory" in society.
   >I wonder if the origin of such impressions as "This person is an old man" or "That old man is an old man" comes from the fact that the younger generation is becoming depressed with those in power (or authority) who want to say "should" to the world, "A should, B should, C should ......".
 	[We need to stop imposing a "should.]
  Related [should avoid "should"].
	Stagnant behavior for safety.


	[senile phobia].
Jun Kuikei
Old phobia.

Nishio Hirokazu
I'm an old age phobia. How to avoid becoming senile is one of the areas I am very interested in. So I collect and analyze old age cases.

Jun Kuikei
Phobia is a form of "mummification," and your behavior is the type of "old man with a good sense of humor," but...
And the type of person who actively increases the amount of communication with young people to get away from the fact that he's getting old and I'm doing okay.

>Phobia is the mummy's revenge, and the mummy's revenge is the mummy's revenge.
>The kind of person who is afraid of identification, the kind of person who panders to the opposite of the object of his similar attributes and attacks those with similar attributes to himself.
I thought for a minute that mummyphobia would turn into mummy, but I had a feeling the mummy would turn into mummyphobia.


>I suspect that there is a bias to regard a reaction to something as old age if you don't like it.
bias
　The idea that we are deviating from the correct perception
　He thinks, "There is a correct set of old people, and you are making the mistake of including in the old people those that are not part of that set."
　There is no correct set of old age, but rather an approach of collecting what might be related to old age and finding the structure from there.


Observe a single phenomenon from the front and back to better understand it.


[Box or assume model].
Jun Kuikei
I'm saying that I think it's wrong to put them in the box of old people.

Nishio Hirokazu
If it's a comparison between collecting them and putting them in one box and then categorizing them, or categorizing them from the beginning, I think we should collect them first and then categorize them.

Jun Kuikei
I don't think I'm either of those things.
They think it's just a multiplication of some three or so factors.

Nishio Hirokazu
That's an interesting story.

Jun Kuikei
I think of it as multiplying x, y, and z, so that if age is in z, you are called an old man, and if a woman is in z, you are called a fucking femme fatale.
It's the previous parameters that matter.

Nishio Hirokazu
It is possible that the model is correct, but it is also possible that it is just a dogmatic assumption.

[Symptoms of unconsciously ignoring new information].
Jun Kuikei
I shouldn't speak from experience, because it's said that speaking from experience is a type of old man.

Nishio Hirokazu
That seems a little low resolution to me.
When is it wrong to speak from experience?
Maybe when the experience is old.
Despite the availability of new information, it does not seem a good idea to make decisions based solely on old experience without incorporating it into the decision making process.
Instead of thinking, "There may be new information," they unconsciously think, "There must be no new information," which seems to correlate with old age, so old age
Ah, right, so it's all about the information that comes in.

Jun Kuikei
When speaking from experience, new information is always a lower proportion of the information one has compared to old information.

Nishio Hirokazu
People in their natural state tend to do so, so we should consciously increase the weight of new information, or "unlearn," as they say.
Young people naturally accept the fact that there are things in the world that they do not know, so when they feel something strange, they naturally think, "Could this strange feeling be caused by something I don't know? When they feel something strange, they naturally think, "This discomfort may be caused by something I don't know.
On the other hand, old people often forget this and feel like they "know everything". When they enter this state, positive feedback hangs over them.
This is due to the fact that even if a young person knows something that the "Mere Old Man, who thinks he knows everything" does not know, he does not try to point it out to him.

[who thinks he knows]


They both believe that what we're talking about now isn't limited to the elderly.
>N: Old and senile are distinct, so I don't attack people just because they are older.
>K: For example, experience mounting occurs even when young, but is called old age.
I gave specific examples of this "experience mounting" but they were not appropriate.
>N: For example, "high school students who tell their juniors, 'Don't use Arduino, use PIC'" are old people.
I'll write a better example later here.



And then there were these exchanges.
>N: Even if a young person knows something that the "Mere Old Man, who thinks he knows everything" does not know, he does not try to point it out to the old person.
>K: You are wrong to see it as a phenomenon only for old people.
We both thought it was "not X" and I thought I recognized it and told him I recognized it, but he didn't get it.
This has resulted in the misguided suggestion that "it's a mistake to view it as 'X'".

The fact that you went through the "if there was an upsurge, you should have led us there as an operation" may have reinforced the false belief that there was no upsurge.


With this question.
>>Is it that there is a trade-off between the "probability of achieving the project's objectives" axis X and the "members get along" axis Y, and that optimizing for X increases the likelihood of being called "old" and trying to avoid it makes it suboptimal for X?
> Gesellschaft and Gemeinschaft. Now that this has been derived, I ask the question, is this trade-off relationship of banning the FooBar beneficial to human development?
I think there's a connection to this statement that I've been finding a little disconcerting.
>To limit this case by certifying it as old age is to deny the personality of the participants and limit the high-cycle movement of prolific and prolific death.

So you seem to be interpreting the assertion that "X is a FooBar" as an assertion that "X should be banned".
On the other hand, I am motivated by the idea that "it looks like I won't be able to judge whether X is FooBar or not as I get older, so I want to collect FooBar cases now so that I can use them to judge when I get older", so I don't care whether others are FooBar or not.
If Mr. A understands that a certain behavior is FooBar and is prepared to assume the disadvantages of that behavior, that is his freedom.
If you are FooBar without understanding, Mr. A is simply a fool.

Oh, of course, that's if that other person's behavior doesn't affect you.

With this in mind, to answer the question, "Would a ban on the FooBar, with all its trade-offs, be beneficial to human development?" the answer is "It would be detrimental.

source: https://www.facebook.com/nishiohirokazu/posts/10226630159276703
