Dominion 2022-03-12
I bought a subscriber.
[https://gyazo.com/03129c9ffe579f27553b2f827642a94a]
Is this what you want to do?

No, no, no, no.
[https://gyazo.com/6da2bb268e9a55d042fd04de56c3c865]

Oh, this one.
[https://gyazo.com/ef6f5c69e717325c7ad014d6808eb0c6]

It's done.
[https://gyazo.com/2b17a69b370153f3209c82da44329853]
The Sentinel can compress two cards.
More action in town, more purchases.
Is the draw an imperial messenger?
Can also be acquired by mages.
Okay, let's pull it off.
　Hate Student Town
　Coins in town and imperial messenger.
　Rotate in students, destroy the mansion, purchase the Sentinel.
　Sentinel, two coppers destroyed, shining gift
　Destroy house coppers at town, imperial envoy, and sentinel; destroy house at student; purchase mage.
　Destroy copper coins with student, win town with mage, gift (maybe you shouldn't buy it).
　silver coin
　　You have 9 friendlies, but the action you leave unused after you draw it out is the one with no + action, so if you carry it over to the next turn, you'll have an accident...(PS: misunderstanding)
　gold coin
　8 gold, but would I be better off buying gold coins and throwing away the copper coins?
　　Oh, okay, I can carry over the silver coins here.
　Oh, you draw five cards in addition to the cards you carry over.
　 Completely pulled off.
　 Mage x2, town x2, win 2 towns, destroy copper coins in student, coin out in town, genus, town.
　Accident, mage x2 for town x2, 4 gold for...no I don't need anything, I have 15 friendships so I carry over 3 cards.
　Town x4, Imperial Guard, Sentinel. [- I can pull it off, but I won't do it because it's just a waste of action] town x4, oh, not enough action.
　　2 old maps with 2 mages, 4 towns and 2 provinces.
　Undrawable, genus state. If I carry over the victory point card, I can prevent that from coming around.
　Genus State 1 card left, tie. [- There are four towns, so spend on coins instead of draws]. This would have consumed an action.
　　Successful draw. Town x4, gentry lord mage wins mansion.
[https://gyazo.com/c1df5bbed79a52273698d219c7f29ea8]
　I have 14 friends left over, too much.

[https://gyazo.com/400c91b131ee6b167b41836606b10e99]
The family of inventors put the friendly tokens on the supply pile to reduce the cost. Does this need to be placed by all?
Let's give it a try.
	[https://gyazo.com/9ebe3c9b692ab0d2d142d04213e176a8]
　　Cheaper!
　The capital is a village where you can pay 2 gold and draw 2
　I haven't checked the supply for a bit, but I'll play around with it to get a better grasp of the cards I don't know.
　Purchase of a tailgating. This is a one-turn delayed draw.
　Mm, I don't know if I'm implementing this right, but you can't pay 2 gold and draw without using +2$ to discard 2 cards in the capital.
　　Oh, so it's not enough to have a treasure card in your hand, it has to be in coins?
　If there's a mansion, I'm just going to throw it away and make a coin, so there's no real harm done.
　Two tailing off every turn, +6 cards, if you don't buy more....marquis!
　Starting with 11 cards in hand, the capital, Marquis
　Discard a copper coin without drawing in the capital, draw it in the marquis, buy 15 gold 2... I'm disturbed that the copper coins are not compressed, now that I think about it.
　
　I know it's too late now, but I think it should have been the herb pickers, not the marquis, that increased purchases.
[https://gyazo.com/0479e1b063f603bfea630737e887c8b2]

[https://gyazo.com/f4ae01f3e9ae0f1e69cc3c87c563e130]
 Cave people rotate hands
 The lady's husband, too.
 Compression is an intermediary
 Plus action is capital
 No draws?
 Purchases will increase with herb picking. There is also the option of a shopping district.
 It's subtle - if you're playing against someone, you're going to avoid cards you don't understand and steroids the intermediary person.
 I'm going to try to buy all kinds of cards.
 first-hand herb broker
 Rotate in medicinal herbs, capital for 5 gold (I'm definitely going to run out of action).
 acolyte
 shopping district
 Ah, so the miko is a 4-card draw!
 Tents, operational plans, gifts
 female magician
 Hillfort, is this an acquisition?
 Miko, uh, you can pull four of these, but you have to put two back.
 Draw three cards at the garrison, but with more cards in hand like this, it doesn't feel like you need to rotate in friendship.
[https://gyazo.com/d6c5e891d4aaa569913166e87e1f864a]
　Miscellaneous Chain of W
　 I can buy three copies of Genshu, but that's not my goal for winning this time.
[https://gyazo.com/9dc0873841559ef6e3aa4071cb33d7ae]
Oh, I didn't buy the public domain, all kinds of failures.
The AI is weak, perhaps because it is a newly created expansion.

[https://gyazo.com/94e2dbfe69b9866da9be491dc1ba922e]
[https://gyazo.com/c1292787a67b5b053d75cf6b49498d71]
　Play to earn money by scattering soldiers and drawing cards in the capital.
　Oh, I just realized, AI is a big money strategy to begin with, it should be weak.
　Well, at least it works enough to learn the cards, so once you get used to it, you can start playing with humans.

Ah, I see, so you're prepared to work together in a divided deck.

