Dominion 2022-03-13
[https://gyazo.com/74a44f6d5969987f94551e136871cf71]
I'll verbalize my current understanding after about 3 weeks of study.

Supply Check
　Different people express themselves in different ways, what feels right to them.
　　positive action
　　draw
　　compression
　　acquisition
　consideration
　　positive action
　　　Cards that increase the number of action rights from originally one per turn to allow multiple effects of terminal action cards per turn.
　　　Some call it "village-style," but the throne room is also a plus action.
　　　The "night cards that can be used without spending action rights" are not included here because they are part of the "treasure cards that generate coins without spending action rights."
　　draw
　　　Cards that increase the "choices of actions you can take" and "purchasing power" by increasing the number of cards in your hand, which is originally 5 cards per turn.
　　　So I don't consider "3 draws 3 discards" etc. to be draws because they don't increase the number of cards in your hand. This is "rotation."
　　compression
　　　Cards that increase turnover mainly by reducing the number of cards in the deck or removing cards that hinder combos (initial deck or curses)
　　　Some call it "destruction," but not only destruction, "expulsion" has this effect.
　　　Since the purpose of the deck is to rotate the deck, the number of cards that do not change is only used in cases where, for example, "the result of the renovation will be a cantrip".
　　　　Copper coins and curses are 0 cost, so there should be cantrips, etc. at 2 cost, I don't remember such a card.
　　　　I guess a moat as a common one, but not a cantrip.
　　acquisition
　　　Normally there is only one purchase right per turn and only one card can be acquired. Cards that increase this number of cards acquired
　　　Increasing purchase rights is one of them, but acquisition actions are more attractive in the early stages.
　　　　Coins are required to acquire additional items with the right to purchase.
　　　　The latter is more difficult than the former, "acquire cards up to 4 cost" and "buy 4 coins 1."
　　　　Not a good choice for speedy construction in the early 3-4 coin days.
　　　　　Unless you have something you want to collect on a 2-cost card.
　　　On the other hand, if you are able to cut the draw at the end of the game, you can buy two copies of Genshu if you have more right to purchase them.

what is this for?
　The decision-making process of which deck to choose between two very different types of decks, the "draw-off deck" and the "treasure deck" (a.k.a. "stero").
　It's simple.
　　If none of the cards in the supply have more actions, you can only use one action card per turn.
　　Then don't build a deck that has more than two action cards in the five, the second one will be useless.
　　If you want to keep the ratio of action cards in the deck, you need to buy a ratio of one action card to four other cards.
　　→ You'll be buying mainly treasures.

About Plus Action and Draw
　This is not what each of us needs.
　Ultimately, what we need is a "+1 action +2 cards" laboratory
　I make a combination of plus actions and draws because I have no choice when I don't have this.
　　Even when it is there, you can't get it from the beginning because it costs 5
　　Typical "combo parts" are village + blacksmith
　　You need more than +2 actions for this purpose, because you want to use more than one +0.
　　I want to quickly collect these combo parts so I can increase acquisition.
　　Combo parts are ineffective unless two of them are present.
　　　So, 2 or more cards are needed for 5 cards in hand.
　　　If you leave the initial deck, the average is finally 2.5 cards at turn 10, a long way from being achieved.
　　　So increase the combo parts ratio by discarding the initial deck



