Ticket to Ride
2022-03-12
[https://gyazo.com/f2ea0682c9194aaef62ceb422f5ed9f5]
	https://www.daysofwonder.com/tickettoride/en/usa/

	[Amazon https://amzn.to/3hZU2xF]
　I don't really know how to get it, because I played with a screen sharing feature called Steam Link?
　The map shows the route districts? If you have the specified number of train cards of the specified color on the map, you can make it the track you own.
　There is an achievement condition card called "Ticket" that says "connect here and there", and if you achieve it, you receive the bonus points written on it, otherwise it is taken away.
　I played without knowing the detailed victory point calculations.
　　At any rate, it's a multiplayer resource-sharing game, so I could see it being sabotaged if it was perceived as top of the line.
　　Ignore achievement condition cards because they are easily sabotaged and accumulate private resources, the cards in your hand.
　　When you decide that you no longer need to draw until the end of the game, you can turn around and go on the offensive.
　　　Estimate was a little off and one draw was needed.
　　I was warned that I was in trouble, but it was difficult to interfere because I was in the mode to score points by drawing a rail at any position each turn instead of connecting destinations, and the game ended as it did.
　　The score calculation screen reveals, "The benefits that were shown did not include the ticket achievement bonus."
　　　The bonus for that was that they were tied for second place.
　　In third place, the "longest track" bonus rode in to close the gap to two points.
　　The owner said, "The only way to turn the game around is to get lucky and complete the ticket", and only one player got a ticket just before the end of the game, but he was dented by the fine, leaving the rest of the players in a two-point tie.
　　　If it weren't for the mouthpiece, I think he would have been in first place alone.
　　　The owner of the company, who was the mouthpiece, is a bad guy, because he's tied for first place.
