Deck archetypes
Money strategies http://wiki.dominionstrategy.com/index.php/Big_Money
Big money is a typical deck configuration in which players primarily purchase treasure cards, usually along with a small number of action cards. This is usually contrasted with engines, and whether to play an engine-like strategy or a big money strategy is an important strategic choice on many Dominion boards.
　[nishio.icon]In Japan, the term "stero" is used

Much analysis has been done on big money strategies, partly because big money is easier to model and simulate than more complex decks.

A pure big money strategy, i.e., a strategy of buying only basic cards, is hardly optimal. However, since this strategy is available in all Dominion games, it is useful as a benchmark against which to compare other strategies.

strategy


Gold is usually the most important card in a BM deck.

There are several strategy articles on Big Money. Below are two of them. Also see this article by ragingduckd on Big Money Choking.

Strategy Article Big Money
Original article by Theory

Big money is as simple as "strategy" in Dominion: buy Provincials for $8, Gold for $6-7, Silver for $3-5, and nothing else. (You can tweak it by buying duchies for $5 when you have 5 duchies left, or by doing more advanced duchy dances.)

Why is it important? Because most beginners, after buying into some pretty fancy action, one day find themselves literally trampled by people who are just buying money. Many stop at this point, convinced that "Dominion" is a "solved" game and that there is no more depth to it.
　[nishio.icon]That was me 12 years ago.

But one day you realize that Big Money is not invincible, but merely a benchmark. With the right combination of action and treasure, you can easily beat Big Money. The key to finding out if your strategy is effective is to see if you can clear the Big Money hurdle. For reference, big money averages 4 provinces by around turn 17 (assuming no attacks). Since you can always get to big money in any set, if any strategy does not work better than big money, it is not a strategy.

To understand that Big Money is not invincible, it is easy to see that Big Money plus one action can beat Big Money. For example, Smithy-Big-Money will reach 4 regions in 14 turns and stomp Big Money every time; Witch-Big-Money is not as fast, but will stomp Big Money with a tsunami of Curses. And so on.

Of course, Smithy-Big-Money is not much more interesting than playing Big Money. But as you continue, you will find that more sophisticated interactions also beat Big Money. You can chapel the deck and accelerate your endgame mega-turns with "Bridge" and "Throne Room". You could draw the entire deck with "Village/Chamber Room" and finish it off with "Militia". Or you might ditch the provinces in favor of workshops and gardens. And with each new action card introduced in each expansion, the big money becomes more and more lopsided.

There is another way to think about it. A very simplified version of Dominion, consider rolling the "money die" five times each turn. If the sum of the rolls reaches a certain threshold, you can buy states.

Now, the obvious "big-money" approach is to buy silver or gold to make the die's eye bigger. But there are other approaches.

Removes all low numbers from the die, allowing for a higher average die roll. (Chappell)
You may want to devise a way to increase the number of times you roll the die. (Village, Smithsonian)
Can add bonuses to the roll of the dice. (Festival)
Can make someone else's dice fail. (Witch)
Re-roll lower values. (Seller)
Lowering the threshold for purchasing Provincials. (Bridge)
You can go for low value cards at low stakes and end the game before the Provincial player has accumulated enough points. (Workshop/Garden)
Big Money's true identity is that it is an advanced underdeck. Good decks are not hard to beat big money, but most beginners are not. There are few sets where big money (or one action plus big money) is the dominant strategy. Study the board to design a deck that can win big money, that's what Dominion is all about.

---
Big Money Optimization
Big money alone is rarely optimal. However, it is useful to know what the "optimal" big money play is for comparison and for further strategy development. The optimal big money play against other big money-like decks is described by the following rules

However, if you get $8 really fast (no gold and less than 5 pieces of silver), buy gold.
If you subtract $7 from $6, you buy gold. However, if the game is nearing its end (less than four provinces left), the duchy is bought.
If you draw $5, you buy silver. However, if the game is nearing its end (less than 5 provinces left), the duchy is bought.
After subtracting $4 from $3, unless the game is nearing its end (less than two regions left), buy the silver, in which case buy the estate.
After subtracting $2, the territory is bought only if there are three or fewer provinces remaining.

This can be further improved by proper application of the Penultimate Province Rule. However, this is not a strategy that should be done in a real Dominion game, but rather a basic one for evaluating competing strategies and for making improvements.
---
Terminal Draw Big Money

Smithy was the prototype for BM-Terminal Draw.

The most common way to improve a big money deck is to use a small number of terminal draw cards. This is described in [this article], written by HiveMindEmulator and edited by Theory, and is reproduced in part below.

One of the simplest basic strategies to learn and surprisingly effective in the basic set is Smithy Big Money. The strategy is to open a Smithy/Silver, shuffle it a few times, then add a second Smithy, otherwise buy only money and VP cards. You can also add cards that will help you later in the game, such as Markets and Remodels, but mostly just two Smithies and money. It means that very often you can draw up to 7 cards with the Smithy and buy Gold with 7 cards. And if you have enough silver or gold, you can often buy a region.

Some expansions that add engine-friendly cards, such as more trash cans, or cards that are better than Smithy in a "big money" strategy, make Smithy BM much weaker. However, there are variants that can sometimes be targeted, especially if there is no way to quickly build a strong engine. The purpose of this article is to look at the terminal draw cards and discuss how they differ from the regular Smithy BM and how they affect the game.

Before we get into the cards, let me outline a few general thoughts about terminal draw BMs. First, since you will be drawing cards to death, there is no reason to have too many actions, especially terminals.
　[nishio.icon]Too many terminal actions are a dead card.

And compared to decks that do not draw cards, they will consume more cards per turn. Therefore, you want to limit the number of draw cards to about two, and mix in only other actions that work particularly well in the early and late game. For example, cards that benefit from accelerating the endgame trash, such as "Remodeling" and "Salvager," and
 >end-game accelerating trash-for-benefit cards like Remodel or Salvager
　　[nishio.icon]Renovation and salvage sailors
　　　Renovations can be made to the province with +2 gold coins or to the duchy with +2 silver coins.
　　　Salvage sailor returns discarded cards to coins and buys +1
　　　　Gold and silver coins convert 5 coins to 6 gold coins to buy a genus state.

Really strong estate trashing openings such as "Jack of All Trades," "Masquerade," and "The Island" are mentioned.
	>estate-trashing openings like Jack of all Trades, Masquerade, or Island. 
	[nishio.icon]Yorozuya, Masked Ball, Island
	　Yorozuya can acquire silver coins and destroy one piece of non-treasure
	　Masked ball is good for destroying certain things because you can draw two cards and then destroy them.
	　The island can be banished from the deck along with the mansion.
These three cards, in particular, you want to open before Smithy and add Smithy on turn 3 or 4.

You want to be conservative in your actions, but you will gladly take kingdom treasure cards such as Fool's Gold, Venture, Stash, Royal Emblem, Bank, Treasury, and Harem (Loan, Smuggling, Quarry, Talisman, and Horn of Fertility are mainly for engines, and Philosopher's Stone is a potion (The "Loan," "Smuggler," "Quarry," "Talisman," and "Horn of Fertility" are mainly for engines, and the Philosopher's Stone is not too late for a fast BM strategy because of the cost of the potion.) Treasures of the Kingdom tend to make Terminal Draw BM stronger, so these cards may steer you toward playing Terminal Draw BM. The Terminal Draw BM deck is really set back by drawing $5 (a little more for silver but not enough for gold), so it is a real advantage to be able to purchase the venture.
	>Fool's Gold, Venture, Stash, Cache, Royal Seal, Bank, Hoard, or Harem
	>(not Loan, Contraband, Quarry, Talisman or Horn of Plenty, which are primarily for engines, and not Philosopher's Stone, whose Potion cost makes it too slow for a fast BM strat).
	>Kingdom treasures tend to make terminal draw BM stronger, so the presence of one of these cards may steer you towards playing terminal draw BM. Terminal draw BM decks are really set back by drawing $5 (which is a little too much for a Silver but not enough for a Gold), so being able to buy Venture is a real benefit.
　[nishio.icon]A treasure card that is arranged as a kingdom card.

Conversely, strong engine parts and colonies are the real drawbacks to running a terminal draw big money strategy. Your slow but steady "turtle" strategy is more likely to be beaten by a game-ending mega-turn "rabbit" strategy.

Several tactics also come into play in the BM game of Terminal Draw.

If playing a draw card causes a reshuffle, you must weigh its benefits against the shuffle. Usually skipping the play of this card is just as bad as missing the shuffle, so it is worthwhile, but if it does not improve purchasing power, it should be skipped.
　[nishio.icon]Maybe a situation where there's already 8 gold or something.

As for the dukedom dance, you want to keep track of your opponent's key card, the terminal drawer and gold. For example, in the case of the Smithy BM, if the greening is going well, the Province Turn usually requires Smithy + Gold or 2x Gold. So if you know that your opponent does not have one of these cards in his hand from previous turns, you may want to break the "Penultimate Province Rule".
　[nishio.icon]He's also counting your opponent's cards and telling you to decide whether to buy a second gensu from the last to determine if the money to buy the gensu will come on your opponent's next turn.

There is a disclaimer that none of the numerical things mentioned in this article should be taken literally. If I say I want a smithy "after the second shuffle," that does not necessarily mean that something magical will happen the second time I shuffle the deck. It is just relative timing. Once you have about 16-18 cards in your deck, you can tolerate a second Smithy if your only action is a Smithy. But if you want to add some other card or if your opponent attacks you in some way, the situation changes.
　[nishio.icon]I don't know if they tell you by the number of shuffles too much when you're doing it online, because it's automatic... I'd say buy it right before the shuffle, like 6-8 turns or something.

How to play big money with draw cards for each terminal is best explained on the wiki pages for those cards.

Envoy
courtyard
masquerade
library
safe
embassy
conference room
pier
Mort and watchtowers
steward
aristocrat
adventurer
Torturer/Mulgrave/Rabble
phantom ship
oracle
Young girl/witch
catacombe

Envoy
Courtyard
Masquerade
Library
Vault
Embassy
Council Room
Wharf
Moat and Watchtower
Steward
Nobles
Adventurer
Torturer/Margrave/Rabble
Ghost Ship
Oracle
Young Witch/Witch
Catacombs
Hunting Grounds

Keys to Big Money Money Density and Opportunity Cost
Original text by WanderingWinder, edited by Theory.

In a big-money deck, you really need to be aware of two concepts: the first is "money density" and the second is "opportunity cost.

money density
Money density is the average value in production of the cards in your deck. For example, copper is 1, silver is 2, heritage etc. is 0. Remember that with 5 cards, you need a money density of 1.6 to buy a province and 2.2 to buy a colony.

Duchies and dukes are only 1, gardens, islands, tunnels, etc. are less.
　[nishio.icon]Meaning that an average of 1.0 can buy a 5-cost public domain.

Calculating money density is very easy if you know what is in your deck. Add up all the money production values and divide by the total number of cards in the deck. So, in the first deck, there are 7*1 coppers and 3*0 estates, and dividing these by 10 cards gives a money density of 0.7.

Changing the subject a bit, I would like to purchase at least one card that is not a silver or gold coin, state or duchy, right? How do you incorporate the other cards into the monetary density? The easiest way is with cards like the "Lumberjack". The "Lumberjack" gives you (at least the first one) a clear advantage over the "Silver", i.e., the "Buy". But for all intents and purposes, this card counts as $2 in your money density.

Another very simple and common card is the cantrip. (I use "cantrip" here to define the type of card that always draws at least one card and returns at least one action.) Cantrips are what I call "virtual cards" for the purpose of calculating monetary density. This means that they are not counted in the total number of cards in the denominator of the money density calculation, since they are completely replaced in the hand. So if you bought a village and a militia with two cards in your hand (not a very good strategy), 7 coppers, 3 estates, 1 village, and 1 militia would yield 7, 0, 0, and 2 money, respectively, and the cards that count toward the deck total would be 7, 3, 0, and 1. Thus, your total money density is 9/11 = 0.818181...... is.

If we develop that further and add a slightly more interesting (at this point anyway) card, "The Peddler," to the deck, the effective deck size increases by 0 (because it is a cantrip), but it generates an extra $1, so the purchasing power increases by 1. If we could add "The Peddler" to the starting deck, we would have 10 effective cards for a total of $8 in money, for a density of $0.8.
	>Peddler

Now, once you have that figured out, you need to think about terminal conflicts. Most of you know that buying only Treasures and VPs will not get you far in success (and fun). So, you will probably want to buy some terminal Actions, and at the end of the game, you will probably want to buy multiple terminal Actions. This will create the possibility that your terminal Actions will clash. A big key to playing big money decks is to weigh the benefits that your Actions bring against the potential for them to clash. Of course, if you are non-terminating, there is no need to worry about such things, but in many cases it is better to take the risk at some point.

Fortunately, calculating the likelihood of a terminal conflict is generally not that difficult. You just need to remember to use the effective deck size, not the actual number of cards in the deck. For more information on what advantages this has, please see ...... You all have to figure this out for yourselves. Just keep in mind that you have to beat other players, not optimize your results in a vacuum. This means that, in general, you must count on being a little luckier than you would expect to be on average. And the amount of this luck you must count on, and thus the amount of risk you must take, grows as the number of players increases. Villages reduce these wrinkles, but you have to have a village with a hand where the terminals collide, and that doesn't happen as often as everyone thinks.

Of course, this leads to the very important topic of terminal card draws (smithing). Typically, by the time you mix multiple terminal draws... You will have engine building*. And for engine building, things like getting the engine to start consistently and having enough payload are much more important than the concept of money density.

But even with a big money + terminal card draw strategy, you will probably need more than one card: with the major exception of Envoy, you will probably need two cards, such as Smithy and Courtyard. And many terminal card draws have ways to reduce collisions; Vault, Embassy, Courtyard...
	http://wiki.dominionstrategy.com/index.php/Envoy

So, for a one or two terminal drawer, this view of money density is still quite important. In the first terminal drawer, you have another virtual card in your deck, and then you have a percentage with a larger hand size (according to the size of your deck). After all, the card average is important because it calculates the average value of your hand.

Take Smithy for example, with 2 silvers, 1 gold, 1 Smithy, and my starting card in the deck, you have 13 active cards, 14 total money, and you have a probability of having 7 cards in your hand instead of 5. Given the way reshuffling works, calculating the exact probability is not as easy as one might think. However, we can come up with a way to approximate the calculation. As a rough guide, let's assume that there are about three turns before the reshuffle, two of which result in a five-card hand and one of which results in a seven-card hand. This works out to (roughly) $5.4, $5.4, and $7.5 per hand. Now, adding a second Smithy increases the probability of getting a seven-card hand, but the money density drops from 14/13 to 14/14 (or $1). (This looks pretty good, but its hidden cost is discussed in the next section.)

Understanding money density is also helpful in understanding how much your deck will stall. The money density of a deck consisting of 3 gold, 7 silver, 7 copper, and 3 estates is $1.5. The money density of a deck with 1 gold, 3 silver, 2 copper, and 1 chapel is 11/7, or just over $1.57. However, if you add two regional cards to both decks... the first deck drops to an average fund density of ~$1.364 and the second to ~$1.222. In other words, thin decks generally need more padding and/or choke more on green cards, while big-money-rich decks are more resilient.

In reality, things are a bit more complicated than this model considers, since we are not drawing an average hand. Drawing cards is not a continuous operation, but a discrete one. Therefore, there is a difference between having two silver cards and having a gold and a copper card, and this is painfully obvious when you get hit by a militia. Sometimes you want more variance, sometimes you want less variance.

Opportunity Cost
This may leave us with an interesting little question: according to the analysis of buying a second Smithy, it should be good for our deck fairly early on, right? For example, look at this deck: we have 7 copper, 1 smithy, 3 estates, and 2 silvers; adding a second smithy reduces the effective fund density to $0.846, but the significant increase in the likelihood of two more cards in our hand is worth it in the analysis, right?

Well, if the choice was to buy a second Smithy or nothing, you would be right. But it is not. Whenever you can buy a Smithy, you can buy Silver instead. And if you buy Smithy, you cannot buy Silver. In this case, the correct play is to buy Silver. You have to think in terms of what you could have bought otherwise, i.e., what you buy, rather than for the collision problem, because of opportunity cost.

This is actually an important way to look at not only big money, but Dominion as a whole, but it is easiest to understand with big money because the density of money is easier to calculate. In other words, when trying to decide whether to buy a market, you must not only look at whether it is better suited to your deck than the alternatives, you must look at whether it is better suited to your deck than the alternatives.

One good way to look at this is to use potion cards. For example, if you bought a "possession", it could most likely be a "possession" if you had bought a "silver" instead. Alchemists would become laboratories, vassals would become witches, and so on. Now, whether or not you should spend potions on these cards has a lot to do with variance and the usefulness of the potions in the late game, which is a very large picture of opportunity cost dynamics. The opportunity cost of purchasing potions was silver coins (or other cards costing $4 or less), which could earn Provincials. Instead, you have a possession that may be better than a Province early in the game, but usually worse than having 6 VP.

Perhaps the simplest and first way that many players need to realize the importance of opportunity cost is to be a "village idiot". The village replaces itself, just like any other cantrip, so it won't damage your deck, right? This is a thought process that many people experience early on. If you keep buying "villages" early in the game, you will end up with a pile of unused "actions" and no more "action cards" to use them with. More importantly, your deck has no purchasing power because the opportunity cost to buy "villages" is silver. Your opponent who buys silver will be far ahead of you.

Another great card to look at through the lens of opportunity cost is "hoarding": the Hoard could be Gold, and the Hoard could be Gold. In other words, if you bought a Hoard with "hoard" you could have bought Gold instead. Now, it is true that you are getting that gold too, but you have to look at what stage of the game you are at... Do you still want a "free duchy" in your deck? Maybe you do, maybe you don't. Not to mention the opportunity cost of choosing treasure over gold, since you could have bought a region for $8, but now you have to pay $7 for a duchy and another gold coin. Yes, I am saying that the Hoard is overvalued and misused.
	[https://gyazo.com/7787681d1f33cb733d1f343493de03b7]


The concept of opportunity cost is not just a cycle through the deck. The cost of the "village", the "silver", will hurt your purchasing power now, and in the next reshuffle, and in the next reshuffle. Furthermore, the reduction in purchasing power you feel now will force you to buy something worse now, which will hurt you even more in the next reshuffle, and anything further reduced in that reshuffle will hurt your purchasing power even more in the next reshuffle. This combined effect is why earlier turns are generally more important than later turns.

We can then extend this paradigm further to what I call "implicit opportunity cost". If I buy a chapel for $3 on the first turn, it costs me a lot. I have.

The $2 spent for it, could have been replaced by another 2- or 3-cost card (e.g., Silver).
Cards that disappear from the deck when Chapel is used
Turns using Chapel probably cannot buy things.
Chapel is the final dead card.
Now, the second of these, getting rid of the coppers and estates that are discarded as trash, may actually be more of a boon than a cost. It is often a great boon, especially in an engine deck. But you have to spend a turn to buy the "chapel," and perhaps two full turns of trashing, plus all the turns partially hampered by the trashing, plus all the turns you have worthless "chapels" in your deck. In other words, the Chapel, while strong, is not really that great for a pure "big money" deck.

Conclusion.
A good way to assess the impact of these calculations in the game is to use a simulator; the Geronimoo and rspeer simulators show a graph of the average money generated per turn. For example, comparing Big Money and Big Money/Smithy shows a significant improvement in average money in the critical first few turns. (I use rspeer's just for ease of linking, Geronimoo is generally stronger as a "player" and has more cards implemented, but requires a download to run.)