January~February 2022 muscle training
from [2022 Muscle Training].
January~February 2022 muscle training
2022-01-15
　Bar hang 10s
　Horizontal pull height 0 40 30 30
　 After all, I needed to be able to do this well, and I needed to soften my joints by moving them with loads that I could do well enough, not loads that I could only do a few times in pain.
　 High" is the highest bar, "0" is 0 directly under the bar, and +1 for each half step forward.
　 　Maybe the original is in the low 8s.
　 Even with this load, I feel discomfort in the right shoulder joint at 10-20 cycles and strain in both neck and shoulder muscles at 20~.
　 I did 40 times thinking, 20 x 2 for intermediate and 30 x 3 for advanced.
　 I'd do this load until the shoulder doesn't hurt anymore and then gradually increase the load.
　 Second set, I couldn't seem to do 40, so I did 30 as instructed.
　 Third set, the right one is spreading the strain to the upper arm as well as the shoulder.
　 　Is there some kind of weird force protecting your shoulder?
　 I walked home after that, but my right shoulder hurts... if it still hurts at night, I'll put a compress on it...
　Shoulder stand squat 25 x 2
　　Stiff back, knees do not touch forehead.
　　It's only after the 25th time that it finally comes on.
　　This also makes the left knee go, but not the right.
　Short bridge 25 x 2
　　I've been trying for a bit, but I'm having problems with my left hip.
　　After warming it up for a while, I did another 25 and didn't feel any discomfort, especially in my left hip.
　　The muscles on the back side of the lower back or pelvic area, what do you call it, I feel like they are being used there.
　Pain in the right shoulder
　　I feel it's not the same as stiff shoulder neck muscles, it's deeper.
 　　https://ja.m.wikipedia.org/wiki/菱形筋 [菱形筋]
 　　>Located deep in the trapezius muscle, ... acts to pull the shoulder blades back.
   Oh, maybe this is it...
 　I can afford to be physical.
 　　I'm not tired at all.
 　　But my shoulder hurts and I did B and C. I should take the day off.
 　　I've been rereading my notes from when I first learned about [Prisoner Training] and I'm thinking, "Is this so lukewarm? We only have to do this twice a week?" And I thought even then.
 　　　And when I actually followed it, a week later I could do it better than the week before, and I could see the growth.
 　　　I guess that means it's important to be able to keep it up over the long term, instead of cramming it into a short period of time and burning out.
 　　　Next good night until push ups and leg raises on Tuesday or Wednesday.
 　　　　I'm sure I could at least do some stretching, but I don't see anything that looks okay to do with a sore shoulder.
　After some rest, the shoulder pain went away.

[Muscle training memo in Notion]

2022-01-19
　Did 40 x 2 incline push ups yesterday and the remaining 40 x 1 today.
　Muscle soreness is tough for muscle training, but in everyday life, you can buy a cup of tea at a convenience store and say, "Oh? Muscle soreness? but in everyday life, it's just like that.
　It's important not to inhibit daily activities.
　　If you exercise and then suppress activity for a while from it, it's a ton of money.
	[Neatac] 10 x 1
 	Watch the video to see the form
  Decided he was trying to get his knees too close together.
  Still, after the ninth time, my back hurt.

 考察
 　Incline pushups are quite muscularly painful
 　　I think it's good to do 40 x 3 and repeat the current one until you can say, "This is not much of a load.
 　　Once that's accomplished, do it in the sink instead of the kitchen and you'll get an even bigger load.
 　Neatac probably won't give me abdominal muscle pain.
 　　A situation where the abdominal muscles have been strengthened by other exercises (abdominal rollers, flat knee raises, etc.), but the surrounding muscles that maintain form during the exercise are lacking.
 　　I think it's important to stick with it until you can do this without hitting the runaround of "I'll do the ones I can" at times like this.

2022-01-20
　Muscle pain remains.

2022-01-21
　Tomorrow is the Pikmin Bloom community day, so I might be tired from a lot of walking, so I'll go ahead and do tomorrow's muscle training schedule.
　　The nice thing about Scrapbox is that you can easily write things like
　　I'm starting to think that Notion may be dead.
　　I think my back hurts from short bridges because my back side pulling muscles are weak.

2022-01-22
　Walked a lot in Vibram, 19,300 steps.
　Maybe I walked too far...
　Leaning forward on the bars for a break
　　Surprisingly, I feel like I'm being stretched on my right calf.
　Wearing Vibrams makes it easy to find the reference point of the foot.
　　With MBT, I couldn't really tell.
　Let's say the heel is right under the bars.
　Horizontal pull height 0 30 x 3

2022-01-25
　Bar hang 10s
　I thought, "I've walked too far, I might not be able to move tomorrow," and "I'm fine so far, but I might be in trouble a day late," but I wasn't in any particular trouble.
　[Shoulder stand squat] 25 x 2
　 My knees are now on my forehead with room to spare.
　 It's like I'm lying about my stiff back that didn't stick at all last week.
　 It was after a bath, but the timing was such that I was like, "Oh, I was going to do it after the bath, but it's already cooled off.
　 It's still a grand run, 25 times is the limit, I don't think I can do 50 times in the advanced level.
　 　And he's off 25 times.
　 　Not until I can do 50 times without a break.
　　What are the weak points?
　　　Hmmm, I wonder if it's a pull of the muscles on the back side...
　Incline push-up 40 40 20 20
　 I still have a hard time with the third 40.

2022-01-26
　[Slow jog] 11m
　 0.9km 156spm 78kcal 平均心拍138

2022-01-28
 Slow jogging with Vibram makes my calves very tense.

2022-01-29
　I should have done it before dinner, I don't want to go outside to do strength training because I'm so limp after eating.
　　And while I'm saying that, the sun is going down and it's getting colder.
　I did a few shoulder stand squats as a back stretch on weekdays.
　　Generally, my knees go to my forehead.
 B Pull-up 2: Horizontal pull high 0 30 x 3
 　It gets harder and harder, but I can still do 30 rounds without taking a break.
 　I'll do the same next time, and if it's smooth, I'll increase the load the next time after that.
 B Squat 1: Shoulder stand squat 25 x 2
  I was in a hurry before dinner and felt discomfort on the right side of my neck and right side of my back.
  I took it slow on the second set.
 C bridge 1: Short bridge 25 x 2
  I don't move to contract the muscles in the back of my lower back when I'm at my desk.
 C Hanging 2: Bar hang 15s

2022-02-03
　A Push-up 2: Incline push-up 40x3
　　I did one set yesterday.
　　Discomfort in the outer shoulder muscles on the left side
　A Leg Raise 1: Knee Tuck 10x1
　　It's no longer as "already hard in the starting position" as it used to be.
　　It's hard after about the 10th time.
　I've been sitting a lot this week, so when I think of it, I've been doing knee to forehead in shoulder stand, short bridge, and bending my spine back and forth.

2022-02-05
 B Squat 1: Shoulder stand squat 25 x 2
 　If I could do 50 times continuously, I would do it, but I'm still limited to 25 times.
 　It was pointed out to me that my legs were falling toward my head, so I tried to straighten them using the ceiling light as a guide.
 　　Requires pulling power of the hips
 　　This is the same muscle as the short bridge...
 B Pull-up 2: Horizontal pull high 0 30 x 3
 　Discomfort on the outside of the shoulder
 　It's not the muscles, it's the joints.
 　No, maybe a tendon.
 　There's a hard one running from the shoulder to the upper arm.
 C bridge 1: Short bridge 25 x 2
  Mainly in the lower back, but discomfort is also spreading to the muscles of the back of the left thigh.
  By the way, if you hold the phone with both hands and stretch it straight out, you can see it without getting too close, and it's not as hard on your hands as if your hands were horizontal, so it might be nice to lie down and do this for a break from work
 C Hanging 2: Bar hang
  10s x1 / 60s x4

2022-02-09
　A Push-up 2: Incline push-up 40x3

2022-02-11
 A Leg Raise 1: Knee Tuck 10x1
 B Pull-up 2: Horizontal pull high 0 30 x 3
　Today was Friday.

2022-02-12
 B Squat 1: Shoulder stand squat 25 x 2
 C bridge 1: Short bridge 60,50,50
  I could do it 60 times in a row.
  I stopped because 100 times seems like a lot of work.
  Let's make it 60, 50, 50.
  I did shoulder squats 25 after 60,50, very tough.
  　I still think that these two things are both straining the same muscles in my current body balance.
  It was really hard to do 25 shoulder squats after doing the last 50.
 C Hanging 2: Bar hang
  10s x1
  I did the above, went to bed, woke up and did a bar hang.
  腹筋上部に違和感
  I'll add to this that I've been hanging with my hips and knees bent at right angles, and so far my hands want to scream first, but this time my abdominal muscles did.
 I feel like the short bridge is just now getting into the zone where I can work on my core muscles that I'm lacking.
 　Moving to 50 x 3 for advanced students in the future.
 　Hard to do shoulder squats on the same day.
 　　It doesn't look good to lose this one or move on.
 　Replaced the menu.

2022-02-13
　Yesterday's short bridge gave me a muscle ache in the back of my thigh.
　　So far, the hips have lost first, which is probably why they haven't been able to strengthen the thighs.
　　I thought I did, but I misremembered.
　　　I was checking to see if I could do 5 full squats, that's what it was.

[I was kind of fatigued when I thought about doing it the next day.
Then it stopped for a while.