Multiplicity
[https://gyazo.com/3d2f3a01b9f237a80cb9a405bc95c3bd]

I only tried Kozaneba for 4B5b "Experiences have multiple interactive relationships", but I think this is the one where you have to do a and c too.

P.161 4B5b
b. Experiences have multiple interactive relationships.
	In discussing “recognition," we noted that the felt meaning that stands in a relationship of being "called forth" by symbols is capable of being further specified by other symbols as well.
	The felt meanings that are called forth are capable of "selecting" other symbols (including objects, situations, and so on).
	We noted that "recognition" and "explication" engender each other, and that this process of engendering more "recognition" and more "explication" could proceed in both directions from any given point: a given felt meaning can function to select symbols that call forth more (because they call forth a felt meaning capable of more specification). 
	A given felt meaning can be called forth by symbols, situations, or objects ("symbols" in the widest sense). These could "call forth" other felt meanings, which in turn could select other symbols. 
	The processes of "calling forth" and of "selecting," which were perfectly parallel relations of felt meaning and symbols, can be set in motion and can have many steps. 
	This is the case because a felt meaning is capable of more than the one aspect that is specified in each of these parallel relationships.


[https://gyazo.com/bb89a1385c184135163bd1c1af82d132]
[https://gyazo.com/0e88b74b0a1d3e153728a92f23231449]


2022-03-15
5. MULTIPLICITY
	Several factors operate to make all meaning-to-us capable of being multiple. 
		(We noted, in discussing metaphor, that there were always many more than one meaning,
		 that is, many more than one likeness between the new and old meaning.) 
	Let us draw together here some of the characteristics of experience that make for the multiplicity of any meaning qua had-by-us.
		[nishio.icon]qua = “in the capacity of" / "as"

a. An experience is multiple.
	The "non-numerical" character of experienced meaning implies that many meanings are "already in" any experienced meaning
	 (that is, they are capable of specification).
 These meanings "already in" it denote functions of felt meaning. 
 We have seen that in each funcutional relationship the meanings said to be "already in" an experience are a myriad of specifiable meanings.
 	[nishio.icon]myriad = "A countless number or multitude" "Earth hosts a myriad of animals."

c. The equivalence of (a) and (b).
 We noted that there was a limit to the applicability of the parallel type of relationship.
  Hence, we moved on to the relationship of "metaphor,"
  in which we focused on this multiplicity as capacity for the creation of meaning, 
 		[nishio.icon]capacity: From Middle English capacite, from Old French capacite, from Latin capācitās, from capax (“able to hold much”), from capiō (“to hold, to contain, to take, to understand”).
 			capable: Borrowed from Middle French capable, from Late Latin capābilis. 
 				capabilis: From capiō (“to hold, to contain, to take, to understand”) +‎ -ābilis (“-able”).
  and the many likenesses implicit in it.
 What we said under (a) is not essentially different from (b).
		After all, the difference between (a) and (b) is that in (a) we considered the multiplicity as internal to an experience, in (b) as external. 
			[https://gyazo.com/ddfae364d3d3c57ec778c004efe03772]
		But, characteristic 1, the non-numericality, was precisely the finding that there is no real difference between internal and external multiplicity, 
		that is, between "within the experience" and "among experiences."
	We can say that these two, (a) and (b), are functionally equivalent, 
		since they refer to the same experienced aspeet of experience. 
		However, they are different qua logically specified formulations.

d. The as yet unspecified is multiple. 
 The multiplicity of felt meanings generates the process or movement we noted in (b). (*12)
 		(*12): Although it can also be specified as a "thing" capable of entering many relations.
  Before they are explicated, very many unspecified meanings are "in" the felt meaning that is "our having" of the specified aspect of it. 
  These unspecified capacities of felt meaning function in cognition.
  In recognition and explication, we found a movement through successive recognitions and explications, brought on by the multiplicity of the felt meaning.
  It could be specified in multiple ways as more than was specified.
 The movement we are describing is ordinarily called thinking. 
  Thinking is the process of successively "selecting" symbols for present felt meaning, 
  finding that the symbols “call forth" more felt meaning than one anticipated, 
  than "selecting" more symbols for some of this excess. 
  This excess can be specified in multiple ways.
  [https://gyazo.com/fd514a6b598a304f71e14590c39d0bdc]

 (Summary)
 	We note, then, 
 	that (a), the “non-numerical" character of experience, 
 	(b) and (c), the creativity of many new aspects of experience through the interaction of experiences,
 	and (d),  the multiple possible specifications of any unspecified experience,
  all show our fifth characteristic of experience: “multiplicity"

[https://gyazo.com/2a8b9e01e522cff66267c34941196697]


