Dominion 2022-03-15
It's been a little over 3 weeks since I played Dominion for the first time in a long time, and it was a bit confusing because there were a lot of expansions and a lot of mechanisms that I didn't know about.

The first thing I did was pull up Anki for the first time in a while and remember the mapping between extension marks and extension names.

For the next three weeks, I didn't know what to expect, so I just tried to remember the information on the card.

[Domininon 2022-03-05]
>As you put the cards in your head, you'll start to see a pattern.
> I've heard that the masses are blacksmith types, and the will-o'-wisps are laboratory types.
> And weak knowledge of destruction and acquisition

>What is the best way to learn now to make the Dominion stronger?
> So far, I've done "let's just get it in our heads" because there were so many cards I didn't understand in the first place.
> Now that I'm in there to some extent and seeing the pattern, I don't think it's important to learn all the cards as it is.
> When I could barely understand the cards, I had to look at the supplies and read them all one by one
> I learned to play cards to avoid making decisions without reading them calmly and feeling sorry for taking plenty of time to read them at the start of the game, that's been eliminated a lot.
> I don't think it's necessary to memorize 100% of the card's effects, since they are written on the card when you look at it.

Learning a card is equivalent to [(1.3.4) from one end to the other].
The next thing we need to do is map it out.

Today's Activities
　[The 5 basic types of Dominion decks]
　　I was able to find translation errors quickly by skimming over DeepL and giving examples for each classification.
　[Dominion Card Categories]
　　I knew that the concept I was reading as "in basic terms, a blacksmith" was a terminal draw, but I had a name for a concept I couldn't quite put my finger on.

I found that after three weeks of intensive study of Dominion, my sane working friends felt that they couldn't keep up if they advanced at such a speed, so I need to release my energy in some other direction. w
[https://gyazo.com/5da6022fae95103646851801f8218c21]


What we're thinking about now
　Possibility of card counting needed.
　As a result of starting to read English wikis, I feel the need to have the correspondence between Japanese and English card names in my head
　I was using the Scrapbox project on privave to put in card descriptions and such, but the English Wiki is more comprehensive...
　The interaction between individual cards increases by O(N^2) as the number of card types N increases.
　　In other words, individual card abstraction is required
