Dominion 2022-03-18
[https://gyazo.com/963ddd412627923d20a6ea4e65161cbc]
[https://gyazo.com/0dcef6d0992cc580c8827e1e46c095eb]
[https://gyazo.com/4cf9474f5d59a27f336d05206b2a973b]


[https://gyazo.com/648ea49385e63a91ae5172cb96fd5370]
Assorted cards that did not perform well on Anki
No more action.
Non-terminal compression by bounty hunters, non-terminal draw by word department

Remove those two, put in collapse, and the rest is random.
[https://gyazo.com/41668f6b1463953b3471e46c8cee8ceb]
The bishop went in.
2-5 so collapse, trolls
I lost.
Round 2
[https://gyazo.com/452fbfbbcd9eed9ed16ae78c19e0d365]
packed dominion
　Destroy the province with the bishop, +4 points, and buy the last province to reach 8 coins with the bishop's +1 coin, winning by 3 points.

It was a deck of bishops destroying silk artisans all over the place.

[https://gyazo.com/4d2400a1b4034da3726f036b07fe92c5]
grave-marker
+1 point for discarding a card
Destruction, cards destroyed by evil spirits.
Plus purchase at the messenger, and acquisition of silver coins at the amulet.
First-hand castle gate, messenger + demon repellent
Stuck with one piece left in Gushu and lost by three mountain withers.

2nd game
Reflecting on the last time, I thought the amulet would be good for the terminal and acquisition of discarded material, but I could not afford to use it, I think the plus purchase of the messenger is sufficient.
First hand castle gate, messenger + messenger, then by collapse.

Hmmm, can't win.
If you think about it calmly, even though the collapse doesn't reduce the action, it can't be used after the draw because there are no cards that increase the action, so when three cards come to your hand, you have nothing left to discard.
So if the terminal is 0 to 2 cards so as not to be covered by the hand, the collapse should be about 2 cards as well.

First hand, mass, collapse
Draw in the masses and castle gate
Destroyed mansion due to collapse, silver coins.
Destroyed mansion in collapse, draw in masses, relics.
gold coin
Destroyed mansion by collapse, draw in the masses, genus state.
Draw in the masses and the masses
provincia
Draw in the masses and genus state
Draw in the masses and gold coins
Draw in the masses and silver coins
provincia
collapse
pass (e.g. skipping a move, passing an examination, ticket to allow entry, etc.)
duchy
duchy
silver coin
pass (e.g. skipping a move, passing an examination, ticket to allow entry, etc.)
Lost at 36:44

hmm
How can this be a win-win situation?

First hand, debt, evil spirits, next, persecutors.
　They chose the persecutors because the imps serve as laboratories.

I've come to the point where I can play nice by buying public domain early, but then the app crashes.

There's a feeling that the decision to buy the public domain at the end of the day is not a good one...


---
https://dominionstrategy.com/2019/03/31/when-should-i-start-greening/

You should start greening your deck based on how quickly you can improve it and your purchasing power. The faster you can improve it, the better you should delay buying VP. The reason is simple: buying VP cards slows down your deck. Part of the problem is adding junk cards. The bigger problem is that the $8 spent on "states" is less than the $8 that could have been spent on more money or action cards. If the kingdom supports faster growth it would be better to invest in the deck now and buy points later.

If you are playing Gardens Rush, well, for one thing, Gardens Rush is not as strong as we thought it was five years ago and many big money basins are competing against it. But sometimes it is the right choice, and when it is, you start greening right away. I can't imagine that your deck would do much better than to spend $4 on the Gardens.

If you are going for the "Duke of Duchy", start greening a little later, just enough to achieve the $5 with some certainty. But it is still much faster than a "Provincial" game.

If the deck buys only one card per turn, there is no reason to play more than $8 in Province (or $11 in Colony), so it usually starts green when it thinks it can play $8.

If you are using a moderate engine, one that draws a lot of cards but does not always use the whole deck, you will start greening around the $13 (province + duchy), $16 (two provinces), and $18 (province + duchy, a useful option in the endgame) achieved. 2 provinces per turn is so lenient that the game will end as soon as both players start greening, and the eight provinces will disappear in four turns, or two turns each.

But if you are playing a kingdom with a strong engine like "Wharf" + "Village" + "Trash" you may want to build more. Three Provincials for $24, two Provincials + two Duchies for $28, or maybe even four Provincials for $32. On such boards, high-level play often turns into a game of chicken, ultimately ending in a low-scoring three-pile. On a board like this, a high-level game often turns into a game of chicken and ultimately ends in a low-scoring pile of 3s.

Finally, there are bridge boards and bridge trollboards that play for mega-turns and buy all their points on the last turn. The scoring power of these decks increases quadratically, and they do not score points unless they have to, such as to avoid 3-piles.

You should start greening based on how quickly you can improve your deck and your buying power. The faster you can improve it, the longer you should delay buying VP. The reasoning is simple: buying VP cards slows down your deck. Part of the problem is adding a junk card. The bigger problem is that $8 spent on a Province is $8 less that could have been spent on more money or Action cards. If the Kingdom supports faster growth, you’re better off investing into your deck now and buying points later.

If you’re playing a Gardens rush, then, well, for one Gardens rushes are not as strong as we thought they were 5 years ago and a lot of Big Money baselines compete with it. But sometimes they’re the correct choice, and in these cases you start greening right away. It’s not like your deck is going to do much better than hitting $4 for Gardens.

If you’re going for Duchy-Duke, then you want to start greening a bit later, late enough that you can somewhat reliably hit $5. But still much earlier than you would in a Province game.

If you’re playing a 1 buy a turn deck, you don’t have any reason to hit more than $8 for Province (or more than $11 for Colony), so you start greening when you think your deck can usually hit $8.

If you’re playing a reasonable engine, one that draws a lot of cards but not always your entire deck, you start greening around the point where you’re hitting $13 (Province + Duchy), $16 (2 Provinces), or $18 (Province + 2 Duchies, a useful option to have in endgames). Two Provinces a turn is a sweet spot where the game ends very soon if both players decide to start greening – 8 Provinces goes away in 4 turns, or 2 turns each.

However, if you’re playing a Kingdom with a strong engine, something like Wharf + Village + trashing, you may want to build even more. $24 for triple Province, $28 for 2 Province + 2 Duchy, maybe even $32 for 4 Provinces. On these boards, it’s common for high-level play to turn into a game of chicken that eventually ends in a low-scoring 3 pile. When both players believe detouring for points will cost them the game, they both buy actions instead, bringing the game closer to a 3 pile ending.

Finally, there are Bridge boards, Bridge Troll boards, and the like, where you play for the megaturn and buy all your points on the final turn. The scoring potential of these decks grows quadratically, and there’s really no reason to pick up points unless you have to (e.g. in order to avoid a 3 pile).

---

The following are toy examples. In these examples, when we say that a deck hits $N, we mean that it always hits $N, even if the winning card comes into your deck. Also, P1 is not necessarily the player who started the game, but is the first player to attack at the beginning of the analysis.

Both decks can hit $8, and it takes two turns to make a deck that hits $16.
For example, let's say the first person makes a "regional" and the second person makes a "local".

Advertisements

Report this ad

P1: Province
P2: Build
P1: Province
P2: Build
P1: Province
P2: Prefecture + Prefecture
P1: Province
P2: Provincials + Provincials, both sides have 4 Provincials, tied at the end of the game.

In other words, it is not a bad idea to play 4Province. However, in the real-life version of this scenario

And the P2 deck is more reliable because I'm buying Province later.
Once P1 misses $8, P2 can punish that bad luck more severely.
If P2 gets unlucky, well, he loses. But if P2 is unlucky without a deck, well, he loses anyway, so P2 is less likely to be unlucky if he is a little more decked out.

If you reverse the roles and let P1 build, P1 wins.

P1: Construction
P2: Province
P1: Build
P2: Province
P1: Provincial + Provincial
P2: Province
P1: Province + Duchy (P1 is 3 Provinces, 1 Duchy, P2 is 3 Provinces)
P2: "If you buy Province, P1 wins by Province. If you buy a principality, P1 wins by 2 Provincials." P2 loses.

Both decks can achieve $16, and it takes one turn to build a deck that achieves $24.
Let's say P1 is going for a double Province and P2 is going for a build.

P1: Provincial + Provincial
P2: Build
P1: Provincial + Provincial
P2: "If I buy two Provincials, P1 wins with Provincials + Provincials". Buy 3 Provincials + Duchy (cost $23)
P1: Province + Province (P1 is 6 Province, P2 is Province + 3 Duxie)
P2: Lose

In this example, P2 loses because of lack of time against a player with double Province.

If the roles were reversed, P2 would still lose.

P1: Build
P2: Provincial + Provincial
P1: Prefecture + Prefecture + Prefecture (P1: 3 prefectures, P2: 2 prefectures) P1: Prefecture + Prefecture + Prefecture (P1: 3 prefectures, P2: 2 prefectures)
P2: "If I double Province, P1 wins with Province plus Duchy. If I don't buy Province, P1 wins anyway with 3x Province." P2 loses. (In the actual game, I would buy Province + Duchy and hope that P1 is a dud and makes less than $16.)

In fact, even if both players were to double-province, P1 would still win.

advertisement

Report this ad

P1: Provincial + Provincial
P2: Provincial + Provincial
P1: Province + Duchy (P1: 3 Provinces + 1 Duchy, P2: 2 Provinces).
P2 "If I double Province, P1 wins with one Province. If I Province + Ducey, P1 wins with 2x Province"; P2 loses.

In this setup, P1 wins because it has the first-mover advantage. But what if it could build to $24, picking up points along the way? Translated from the free version at DeepL translation (www.DeepL.com/Translator).


Here are some toy examples. In these examples, when I say a deck hits $N, I mean it always hits $N, even as Victory cards are entering their deck. Additionally, P1 is not necessarily the player who started the game, but is the player who goes first at the time the analysis starts.

Both decks can hit $8, and it takes 2 turns to build a deck into one that hits $16
Let’s say first player goes for Provinces, and 2nd player tries to build

Advertisements

REPORT THIS AD

P1: Province
P2: build
P1: Province
P2: build
P1: Province
P2: Province + Province
P1: Province
P2: Province + Province, both players have 4 Provinces, tie at game end.

So it isn’t any worse at hitting 4 Provinces. But in a real-life version of this scenario,

P2’s deck is more reliable because they buy Provinces later, and
if P1 misses $8 once, P2 can punish that bad luck more severely.
If P2 gets unlucky, then well, they lose. But if they didn’t build and got unlucky, they would have lost anyways, and P2 is less likely to get unlucky if they build their deck a bit more.

If we reverse the roles, and have P1 build, then P1 wins.

P1: build
P2: Province
P1: build
P2: Province
P1: Province + Province
P2: Province
P1: Province + Duchy (P1 has 3 Prov 1 Duchy, P2 has 3 Prov)
P2: “If I buy Province, P1 wins on Province. If I buy Duchy, P1 wins on 2 Provinces.” P2 loses.

Both decks can hit $16, takes 1 turn to build deck to one that hits $24
Say P1 goes for double Provinces and P2 goes for building.

P1: Province + Province
P2: build
P1: Province + Province
P2: “If I buy 2 Provinces, P1 wins on Province + Province”. Buys Province + 3 Duchies (costs $23)
P1: Province + Province (P1 has 6 Provinces, P2 has Province + 3 Duchies)
P2: loses

In this example, P2 loses because they don’t have time against a double Province player.

If we reverse the roles, P2 still loses.

P1: build
P2: Province + Province
P1: Province + Province + Province (P1: 3 Province, P2: 2 Province)
P2: “If I double Province, P1 wins on Province + Duchy. If I don’t buy any Provinces, P1 wins anyways on triple Province.” P2 loses. (In a real game I would buy Province + Duchy and hope P1 has a dud and hits less than $16.)

In fact, P1 wins even if both players go for double Provinces.

Advertisements

REPORT THIS AD

P1: Province + Province
P2: Province + Province
P1: Province + Duchy (P1: 3 Prov + 1 Duchy, P2: 2 Province)
P2: “If I double Province, P1 wins on a single Province. If I Province + Duchy, P1 wins on double Province”. P2 loses.

In this setting, P1 wins because they have first mover advantage. But what if we can build to $24 while picking up some points along the way?