Dominion 2022-03-19
[https://gyazo.com/4d2400a1b4034da3726f036b07fe92c5]
This supply not winning at all since yesterday.

分析
[https://gyazo.com/1ba85eda84bb9dc963903fcd0e2d30f9]
Did I buy the public domain too early? I went back and redid it, but in that case, my opponent's hand didn't thin out and I lost easily.
[https://gyazo.com/73bdab213f2e94caea9e8ff451ad8243]

It's hard to do it manually and I hope it gets better.
table::
 7	3	
 		魔	
 			借
 6	
 5	2		

属州
公領
屋敷
curse
金貨
銀貨
銅貨

[https://gyazo.com/3e696ef479bb090da26bf8c054a3da00]

[https://gyazo.com/046774bd52bf6d8cedff0d13b52639e5]
[https://gyazo.com/faa8a3056f9e54b834b5502a5d95b551]
It was just barely.
looking back
　The destruction of treasure cards due to debt can no longer be used effectively when buying silver coins, relics, or other treasures. This is incompatible with this supply, which has no cards to increase actions, because it cannot be used by buying too many action cards.
　The basic policy hasn't changed much since yesterday. The basic idea is mass sterilization, just compressing with collapse and magic protection.
　　What was fine-tuned was the timing of buying victory points.
　　Considering that the effect of the -1 card on the relics will give you 4 cards in your hand, the Coin Per Card must exceed 1.25 to buy something that costs 5, hence the more gold coins.

Collapse, is it necessary?
First move, evil, evil, evil.
	T7
	　[https://gyazo.com/6969df47da3b4b3f0f0b31863c97cee7]
	Oh, it crashed. I'm back on.
	T9
		[https://gyazo.com/2af0a911dc68b2dff15dbc1d83f899ea]
　　It's time to destroy too much, so let's destroy the collapse.
			[https://gyazo.com/259ee9d902ec6b5e6833e09f9f27c21a][https://gyazo.com/453970f1d3c2c4ccf7502cdde2b777fa]
　　　Don't dilute it too hard because there aren't enough of them, gold coins might have been the right choice.
　T14 Buy the genus state before the goal 39:32
　T15, 1 coin more for the amulet and 8 coins for the genus state.
　[https://gyazo.com/f89d53894ae2b240114e09b92a5d8dbd]
		[https://gyazo.com/b917e395fd20937bc8ca5f6d1adb1dee]
　　The masses didn't deck the deck because they started buying gold for 6 coins before it was 5 coins.
　　This... was meant to be a mass stero, but this would be a demon-protecting stero...
 　　Oh, there it is.
 　　[https://note.com/urihari/n/nc2e8fdcd4b10 #Dominion Tactics Introduction to Demon-Destroying Stero | Urihari | note]
 　So it seems that they have reinvented the magic steroids.
				>It is inevitably inferior to first-line tactics. It is also vulnerable to Handes.
  	 > It is generally stronger to acquire silver coins than to discard copper coins. As is true of all steroids, copper coins are also a valuable asset in steroids, so do not discard them unnecessarily.
					In this supply, there are no cards that increase the action, so the [Engine] deck is difficult to play, which gives it a relative advantage over Stero.
					Since the effect of the tombstone is to make the destruction a victory point, it is better to destroy the copper coins as well.
					　Both AI and I have 15 points in the discard.

I left the program source here.
https://github.com/nishio/dominion-webtool
