It's a waste cycle if you can't get out of your infantile senses.
If you can't get out of your infantile senses, you'll get [a bad cycle].

I would like to describe this "infantile sensation" with a little more resolution.

Infants typically receive positive [strokes] for every action
Sometimes negative strokes, such as a scolding, but rarely ignored.

On the other hand, this is clearly an outlier
[The average time available to others is less than one second.]
So it is no surprise that almost all people do not react positively or negatively to themselves

These two cognitive states need to shift at some point, but there are people who have not shifted

[幼児的]
I've heard the term "infantile universalism," but it just doesn't seem right.

Search for "toddler."
>I want praise and act like an attention-seeking toddler.
	[In his fifties, he is not getting compliments, so he is fumbling for approval].
>One person, A, was positively commented by another person, B, about his conduct. However, A did not like some of the word choices in B's statement and complained about it on social media.
> From the standpoint of not knowing much about either A or B, this behavior of A seems like an infant saying, "I don't like it unless you praise me with expressions that make me feel good.
	[Arrogance in ordering compliments]
>It is a normal state of affairs that there is no reaction to what you write. It is natural that there is no reaction to what you write because even Buddha did so, and it is hubris to think that there should be a reaction, or an infantile sense that "it is natural for people around you to pay attention to you".
	[Social triggers and approval addiction].
>An only child toddler usually gets a lot of attention from his parents, and when he goes to a family gathering or something, he expects that the other adults should naturally pay attention to him, but he feels uncomfortable when the adults leave him alone and talk among themselves, so he does bad things on purpose to get their attention.
	[human bug, not old man].
