Circularly closed pages (birth process)
When ideas develop on a time scale, they become one-dimensional.
What happens if we close this in a circle?

[https://gyazo.com/a494139ae7358fb90af8dcccdc2bf9a0]

I'm getting off track with the output.
	If you try to connect the end and the tip of a story after you've written it, they're too far apart to connect.

The lack of connection reveals "not one topic".
　But each line is so densely interconnected that you can't even separate them.

One page, one topic.
　What happens if each is made to be a circle?
	[heptopod word]-like

This is a matter of deciding what form of output you think is best.
	Many homo sapiens prefer to be [one-dimensional] because they have always done so
	　[audio output] due to the fact that it is so.
　Bulleted discussions on Scrapbox are tree-like with each line written by a different person
　　Similar to co-editing a [mind map].
　　Some people think this tree-like output is possible, others think it's a mess.
　　　In the end, it's a matter of getting used to it.

When writing a normal sentence, the constraint of "the sentences before and after are connected" is included.
	I'm loosening the restriction that the bullet points don't have to be connected at the time of dedent.
	The circular page adds the restriction that the end of the page must be connected to the beginning of the page.

With short sentences, simply put the first line at the end of the page to create a circular page.
	It's not hard.
	Rather, "Will it be?" and when a slight modification does not bring it full circle, "Could this contain more than one theme?" And it becomes

To make a circular page up to this point, I looked at it in Kozaneba

[https://gyazo.com/6020223d4ca620451a76126d9269cbfb]
Connecting this...
A circular page is a page where the end and the beginning are connected.

I'll connect them and read them in reverse order.

[https://gyazo.com/627a66e0ecf5e9376fab66d0224321d2]
Off topic, the beginning and the end don't connect.
for the inclusion of multiple themes.
Opportunities for Awareness
I'll add a constraint to that.
[https://gyazo.com/d8c17f380212016f2d01c3b75209623e]

Circular closed page
A circular page is a page where the end and the beginning are connected.
Off topic, the beginning and the end don't connect.
Create a single topic on a single page as a circle.
This is a matter of decision.
Many people prefer one-dimensional writing.
Some people like the tree-like representation, others dislike it.
A matter of familiarity, not yet used to circular sentences.
Try to circle the page, and when you can't, realize that the topic is plural
More constraints for opportunities for awareness
The end of the page must be connected to the beginning
Circular closed page
[https://gyazo.com/c22fb0f5aa397663d5546c4709b28c93]
[closed circular page].

Separate pages for the detached parts in making a circle.

Slowly devolving stories are hard to divide.
When ideas develop on a time scale, they get lost in a one-dimensional output.
If you try to connect the end and the tip of a story after you've written it, they're too far apart to connect.
The lack of connection reveals "not one topic".
But each line is so densely interconnected that you can't even separate them.

Different people prefer different output formats, but it's a matter of familiarity
	Many Homo sapiens prefer to be [one-dimensional
	　[voice interaction] due to the fact that it is so.
	　Because that's what we've always done.
	　experience
　Bulleted discussions on Scrapbox are tree-like with each line written by a different person
　　Similar to co-editing a [mind map].
　　Some people think this tree-like output is possible, others think it's a mess.
　　　In the end, it's a matter of getting used to it.
　Some people use [illustrations] or one-panel cartoons.
　　Often it is easier to draw than to explain in words.
　　Avoid this output format if you are uncomfortable drawing.
	Formalities are constraints
  When writing a normal sentence, the constraint of "the sentences before and after are connected" is included.
 	 I'm loosening the restriction that the bullet points don't have to be connected at the time of dedent.
 	 The circular page adds the restriction that the end of the page must be connected to the beginning of the page.
　　Some people are more literate with restrictions and some are more literate without.
　　　Easier to read with and easier to write without.
　　　The degree of "ease" of doing so depends on familiarity.

感想
　I can't add, "This circular page was created after this discussion."
　Similar to [write the text and then title it
　　The title connects the beginning and end of the main text, so the title must be the subject of the entire text.
　It's not that difficult to simply make a circle.
　　We unconsciously increase the restriction of "being able to read in reverse order" by thinking "let's do something more difficult".
　　this is a big deal

[Impose high hurdles on others, but pass under them].
