Dominion 2022-03-26
[https://twitter.com/nishio/status/1507455004252127238 nishio hirokazu(@nishio)]
>I heard that the book [Domi Guide] is good, so I bought it, and it is a really good book, and I am groaning "I see, I see" at 2 out of 1 to 5 difficulty levels of the questions.
>
>I wonder if the fact that the question assumes that the rest of the deck is known by the way means that all strong people can do card counting...

What I made last time to see Coin PerCard
　[Dominion 2022-03-19]
This only deals with the deck as a whole, and you don't know what's left in the deck, so you need a system to keep it separate.

It's done.
[https://gyazo.com/33c3fdfeec2205236dae869f34a14219]

It seems to be important to predict what will be drawn next, so I simulated 100,000 times and put them out in order of frequency.
Also, we added a logging function so that you can look back on how things have changed.
	[https://gyazo.com/db981d8ae40bf9c66c861103ec47eeb0]
　T4, play the blacksmith, 8 coins, here would be gold coins.

Blacksmith Stello
I missed recording one turn during the process, the logging button should be next to the clean up.
code::
 銅貨7-屋敷3,10,3,0.70
 鍛冶屋1-銅貨7-屋敷3,11,3,0.64
 鍛冶屋1-銅貨7-銀貨1-屋敷3,12,3,0.75
 鍛冶屋1-銅貨7-銀貨2-屋敷3,13,3,0.85
 鍛冶屋1-銅貨7-銀貨3-金貨1-屋敷3,15,3,1.07
 鍛冶屋1-銅貨7-銀貨4-金貨1-屋敷3,16,3,1.13
 鍛冶屋1-銅貨7-銀貨4-金貨1-屋敷3-属州1,17,9,1.06
 鍛冶屋1-銅貨7-銀貨4-金貨2-屋敷3-属州1,18,9,1.17
 鍛冶屋1-銅貨7-銀貨5-金貨2-屋敷3-属州1,19,9,1.21
 鍛冶屋1-銅貨7-銀貨5-金貨2-屋敷3-属州2,20,15,1.15
 鍛冶屋1-銅貨7-銀貨5-金貨3-屋敷3-属州2,21,15,1.24
 鍛冶屋1-銅貨7-銀貨5-金貨4-屋敷3-属州2,22,15,1.32
 鍛冶屋1-銅貨7-銀貨5-金貨4-屋敷3-属州3,23,21,1.26
 鍛冶屋1-銅貨7-銀貨5-金貨4-屋敷3-公領1-属州3,24,24,1.21
 鍛冶屋1-銅貨7-銀貨5-金貨4-屋敷3-公領2-属州3,25,27,1.16
 鍛冶屋1-銅貨7-銀貨5-金貨4-屋敷3-公領2-属州4,26,33,1.12
 鍛冶屋1-銅貨7-銀貨5-金貨4-屋敷3-公領3-属州4,27,36,1.07
 鍛冶屋1-銅貨7-銀貨5-金貨4-屋敷4-公領3-属州4,28,37,1.04
 鍛冶屋1-銅貨7-銀貨5-金貨4-屋敷4-公領4-属州4,29,40,1.00

cutting off the research institute
9 coins, but if I couldn't pull it off, I'd buy the lab.
Oh, pull it off, 8 coins, then we'll buy a genshu.
code::
 銅貨7-屋敷3,10,3,0.70
 銅貨7-銀貨1-屋敷3,11,3,0.82
 金貸し1-銅貨7-銀貨1-屋敷3,12,3,0.75
 金貸し1-銅貨7-銀貨2-屋敷3,13,3,0.85
 金貸し1-衛兵1-銅貨6-銀貨2-屋敷3,13,3,0.77
 金貸し1-衛兵1-研究所1-銅貨6-銀貨2-屋敷3,14,3,0.71
 金貸し1-衛兵1-研究所1-銅貨4-銀貨3-屋敷3,13,3,0.77
 金貸し1-衛兵1-研究所2-銅貨4-銀貨3-屋敷3,14,3,0.71
 金貸し1-衛兵1-研究所2-銅貨2-銀貨4-屋敷3,13,3,0.77
 金貸し1-衛兵1-研究所3-銅貨2-銀貨4-屋敷3,14,3,0.71
 金貸し1-衛兵1-研究所4-銅貨0-銀貨4-屋敷3,13,3,0.62
 金貸し1-衛兵1-研究所4-銅貨0-銀貨4-屋敷3-属州1,14,9,0.57
 金貸し1-衛兵1-研究所4-銅貨0-銀貨4-屋敷3-属州2,15,15,0.53
 金貸し0-衛兵1-研究所4-銅貨0-銀貨4-屋敷2-属州3,14,20,0.57
 金貸し0-衛兵1-研究所5-銅貨0-銀貨4-屋敷2-属州3,15,20,0.53
 金貸し0-衛兵1-研究所5-銅貨0-銀貨4-屋敷1-属州4,15,25,0.53
 金貸し0-衛兵1-研究所5-銅貨0-銀貨4-屋敷1-属州5,16,31,0.50
 金貸し0-衛兵1-研究所5-銅貨0-銀貨4-屋敷1-属州6,17,37,0.47
 金貸し0-衛兵1-研究所5-銅貨0-銀貨4-屋敷1-公領1-属州6,18,40,0.44

It's hard with the current UI to return the silver coins after seeing them under the Guard's effect.
　You draw, play the silver coin in your hand, then discard it, separately acquire the silver coin and put it back in the discard back in the deck, and because you're really top-decked and don't know it, the simulation of the next draw doesn't work and you have to draw by hand.
　Either add a button to return the card from your hand to the top of the deck.
　Or, since there are so many cards that temporarily look at deck taps, put a "put in not hand" button next to the current random draw button, and give the cards in that zone a "discard, discard, return to deck top" button.

[https://gyazo.com/cd66fa8098b0236b28b7e47c426ee945]
　I really wanted to combine them into one scatter plot, but I couldn't figure out how to do it in Google Spreadsheet, so I just laid them out roughly to scale.
　横軸がカードの枚数、縦軸が平均金量coin per card
　In the blacksmith stero on the left, the amount of gold increases to about 1.3 while monotonically increasing the number of cards, then declines as the winning points come in
　In the right lab pullout, it's going up and down around 0.75 and then down.
　If you're going to pull off a village blacksmith in a workshop, you're going to get more pieces even faster than a blacksmith stero.
　A chapel stero would increase the amount of money at a fast pace once the number of cards is reduced, and would decrease at a faster pace once the victory point is bought.

>礼拝堂-銅貨-銅貨-銀貨-屋敷: 29%
Is this okay to leave the silver coins?

>礼拝堂-銀貨-銀貨-銀貨-銀貨: 75%
With only 6 chapels and silver coins in the deck, this is inevitably what happens, but I'm not sure which is correct, the gold or the gentry.

Oh, I feel like I made a mistake (maybe I bought a genus for 7 coins? ), there's no way to check or go back and redo it, so I'll have to start all over again from the beginning.
I've got the logs in CSV format on the screen for easy copying and pasting into a spreadsheet, but I'm getting them in JSON, so I'd better put enough information in there and add an Undo button or something.

It's done.
[https://gyazo.com/553467cecca0181455816d71447e7267]
code::
 礼拝堂1-銅貨7-屋敷3,11,3,0.64
 礼拝堂1-銅貨7-銀貨1-屋敷3,12,3,0.75
 礼拝堂1-銅貨7-銀貨2-屋敷3,13,3,0.85
 礼拝堂1-銅貨5-銀貨2-屋敷2,10,2,0.90
 礼拝堂1-銅貨5-銀貨3-屋敷2,11,2,1.00
 礼拝堂1-銅貨3-銀貨3-屋敷1,8,1,1.13
 礼拝堂1-銅貨3-銀貨3-金貨1-屋敷1,9,1,1.33
 礼拝堂1-銅貨1-銀貨4-金貨1-屋敷1,8,1,1.50
 礼拝堂1-銅貨1-銀貨4-金貨1-屋敷1-属州1,9,7,1.33
 礼拝堂1-銀貨4-金貨1-屋敷1-属州1,8,7,1.38
 礼拝堂1-銀貨4-金貨2-屋敷1-属州1,9,7,1.56
 礼拝堂1-銀貨4-金貨2-屋敷1-属州2,10,13,1.40
 礼拝堂1-銀貨4-金貨3-屋敷1-属州2,11,13,1.55
 礼拝堂1-銀貨4-金貨4-屋敷1-属州2,12,13,1.67
 礼拝堂1-銀貨4-金貨4-屋敷1-属州3,13,19,1.54
 礼拝堂1-銀貨5-金貨4-属州3,13,18,1.69
 礼拝堂1-銀貨5-金貨4-属州4,14,24,1.57
 礼拝堂1-銀貨5-金貨4-公領1-属州4,15,27,1.47
 礼拝堂1-銀貨5-金貨4-公領2-属州5,17,36,1.29
 礼拝堂1-銀貨5-金貨4-公領3-属州5,18,39,1.22
 礼拝堂1-銀貨5-金貨4-公領4-属州5,19,42,1.16
 礼拝堂1-銀貨5-金貨4-公領5-属州5,20,45,1.10

[https://gyazo.com/df623f503ac930a4ad9c1675dd83165d]

https://twitter.com/nishio/status/1507790327390048257?s=21

