The "society in which those who are great get what they deserve" is over.
>[Hiromi Okuda] [Facebook https://www.facebook.com/hiromi.okuda/posts/4853931617976162]
> When I went to the countryside, I thought that it was a society where people who behaved like big shots got more benefits. The person who acts like a big shot gets a better seat at the table, gets pecked at by all kinds of people, and is given priority in everything. And when you grow up seeing authority and [people moved by fear], the next generation learns that way, too, and they act that way because they think it is more beneficial to that side.
> But I believe that the "society where people who act like bigots get more benefits" is over. Why?
> Because things of great value have become information, ideas, and empathy for people. Those things don't come together for those who are not big enough and don't listen to others. This is especially true for new age opinions, which are often still considered immature. I try to be in a place where various information, consultation, immature opinions, outlandish ideas, and such things can fly around at any time, and I am grateful to those around me who allow me to be in such a place.
> I've written many reasons, but acting like a big shot, it's not cool. Well, that's the best one.
> And when you see someone who is like an overbearing elder, just think, "Oh, this person is a leftover soldier from a society that benefits those who act like a big shot," and come over to our side quickly.

Why fear makes it harder for people to function
　I'll have more options for action.
　It is easy to understand the image of the company
　　If you can only work for one company, you have to endure a great loss if you displease the great people of that company.
　　If you can move to another company, it's better to move quickly to another place than to endure under an incompatible boss.
　　When many people choose the latter, the "motivate people through fear" type of person will simply be avoided and will only be able to perform poorly.

[A society in which those who are great benefit from being great.]
[Information is not gathered by those who are pompous.]
　[Knowledge Acquisition]
[man of high stature]

relevance
　[who thinks he knows]
