Parable of a hot spring that is too hot for humans to enter.
Metaphor with respect to [idea].
　Like a hot spring that is too hot for humans to enter, an idea may not be beneficial to the majority of people at the moment as it is.
　Over time, the "hot springs will cool down" and people will be able to enter.
　Water can be added to lower the temperature, but it will dilute the hot spring ingredients.
　By taking the time and effort to "fir the hot water," the temperature can be made suitable for humans without diluting it.
　Only employees have access to the "[source]" that has not been "turned down to temperature" to be released to the world.

Comparing ideas to [boiling water] was also done by Osborn, the proponent of brainstorming, but relating it to the hot water in a hot spring is uniquely Japanese.

---

from [/NotaAllStarsMeetup/Nota ALL STARS  Meetup vol.3 ディスカッション・質疑応答#62340feb97c29100005420d7]
	[/NotaAllStarsMeetup/ToshiyukiMasui.icon]'s [idea is too hot] and it's like a [hot spring] that people can't enter, so we're adjusting the temperature [/NotaAllStarsMeetup/daiiz.icon].
		Enter Nota and you will be exposed to the idea of [source
			It's the best motivation for an engineer.
		この比喩良すぎる[/NotaAllStarsMeetup/teramotodaiki.icon][/NotaAllStarsMeetup/akix.icon][/NotaAllStarsMeetup/yamanoku.icon][/NotaAllStarsMeetup/yuiseki.icon][/NotaAllStarsMeetup/nsyee.icon][/NotaAllStarsMeetup/nishio.icon][/NotaAllStarsMeetup/meganii.icon]
   It's not that the idea is bad, it's just that the temperature is not human-friendly and needs to be adjusted -[/NotaAllStarsMeetup/nishio.icon].

from [/villagepump/a source too hot for humans to enter].
議事録みてめっちゃ笑った[/villagepump/mtane0412.icon]
　I guess a lot of geniuses are evaluated posthumously because they need time for the temperature to cool down...
　　Great insight, metaphor further developed[/villagepump/nishio.icon].

Image of a Nota member doing a hot water massage[/villagepump/nishio.icon].
	[https://gyazo.com/a437cb0c04a9752cd0a94f8d24b2461f]
 	>This is an illustration of "Yumomi," or stirring hot water with a board, which is done at Kusatsu Onsen.
 		[https://www.irasutoya.com/2014/06/blog-post_13.html?m=1 Clip art of hot-spring freshener | Cute Free Clothing Collection Inusutoyo]
	Mixing with a board lowers only the temperature without diluting the hot spring ingredients.
		>Most of the hot springs in Kusatsu Onsen are hot, almost 50 degrees Celsius, and cannot be bathed in as is. However, if water is added to the hot spring to lower the temperature, the effects of the hot spring water will be diluted. Therefore, the "yumomi" method was devised, in which a board approximately 180 cm long is placed in the hot spring water and the hot water is firmer to lower the temperature to a certain level before it can be bathed in. In addition to lowering the temperature, "yumomi" also softens the water and serves as a preparatory exercise before taking a bath.
			[https://www.kusatsu-onsen.ne.jp/netsunoyu/history/ History of Yumomi｜Kusatsu Onsen Atsunoyu]
　　I interpreted lowering the temperature as "adding water", but they are doing their best to lower the temperature without adding water[/villagepump/nishio.icon].
　　　You mean, "It's possible to easily lower the temperature by adding water, but that would dilute it, so you'd have to take the time and effort to 'rub' it in."

from [/villagepump/2022/03/28]
[/villagepump/nishio.icon]
　The metaphor of "[a source too hot for humans to enter]" is very good!
　　It's not that the idea is bad, it's just too hot, and people can't get in now without cooling it down a bit.
　　It's outrageous that you don't appreciate this idea!" Instead of "I see... Too much heat?", it would be good for mental health[/villagepump/nishio.icon][/villagepump/yosider.icon].
　　I had zero hot awareness... [/villagepump/toshiyuki-masui.icon].
　　Hot water itself feels "cold all around"[/villagepump/nishio.icon].
