What separates Wikipedia and Scrapbox is the presence or absence of subjectivity.
[/yosider/主観がScrapboxとwikipediaを差別化する]
 >[主観]がScrapboxと[Wikipedia]を差別化する
 	>For general knowledge, just look at wikipedia.
 	>Information that aligns with my interests, information about my subjectivity, and information in a format that is easiest for me to understand has value for me.
 	>[The evaluation criteria are within me.]
 	>#Scrapbox tips

from [/unnamedcamp/grassroots/sharing/what-do-you-expect-scrapbox].
[/unnamedcamp/nishio.icon]
 I'm not sure if Wikipedia is part of what you're imagining here, but you may be asking yourself, "Wikipedia is by far more successful than Scrapbox in that they are both collaborative wikis, and if you measure success by the number of people and size of pages, then why not Wikipedia? Why not Wikipedia?" I think the key lies in the question "Why not Wikipedia?
	 Wikipedia never writes these statements in the first place.

[/unnamedcamp/meganii.icon]
　I felt that [/yosider/subjectivity differentiates Scrapbox and wikipedia] is one of the most recent ones I've seen.
　　I want to read someone's humanistic and subjective thoughts.
　　And I want to comment there. I'd like to see someone's reaction to it as well.

[/unnamedcamp/sta.icon]
	With Wikipedia, there's a sense that we're headed for the "only right answer".
 	We have to be objective and descriptive in our expressions, and evidence is required.
	Scrapbox allows you to mix subjectivity, so it's easy to do "My Idea of Today".
	　[/unnamedcamp/nishio.icon]I'm reminded of the edit war on the Dominion Wiki between users who write "This card is the best! and the users who redacted it.
	　　With Scrapbox icon notation, "This card is the best!" with Scrapbox icon notation, I don't think I'm particularly inclined to erase it.
		　　Because "Mr. A thinks so" is an objective fact.
		　　If I had an objection, I'd write "I don't think so" with an icon.
	　　So, to summarize, "When you aim to write a universal truth that is not personalized by anonymous co-editing, you get into trouble for misinterpretation of what is true."
	　[/unnamedcamp/sta.icon]Scrapbox may be strong in that it is easy to arrange opinions for n people
	　I wonder if the icon notation is strong.

[/unnamedcamp/issac.icon]
 I would like to find like-minded and like-minded people.
  People who are close to your sense of self.
 I'd like to read about people who see things differently.
  People who seem to be interested in things that I am not interested in.


