Re: cognitively busy
[/rashitamemo/cognitively busy].
>In cognitively busy situations, the ability to control oneself is weakened. And it makes it easier to engage in `habitual` behavior.
> I would expect that perhaps it comes down to [cognitive busyness] and not the amount of knowledge.
> First, it perceives the world in an extremely simplistic way. Second, it perceives the world based on the ideal of "I wish it were so" (≈without regard to substance). This would be a thorough suppression of [MP] consumption.
> I think the roots of the "zero-risk faith" and the tendency to excessively seek "integrity" are close to each other.

from [/unnamedcamp/concept intersection].
>For example, if it were [/unnamedcamp/ikkitime.icon], I would probably add tags such as "[righteous] mind" and "[simplistic] thinking" to this page memo.
	>Mustn't multiple concepts be encountered and tied together, so they must be referenced in their own context?　Because I feel that

>[/unnamedcamp/rashita.icon]As the person who created the page, I've been thinking a bit about whether or not to add `"righteousness" etc. tags and "simplistic thinking" type tags.
	>Such tags are not inappropriate. Rather, it is contextually appropriate.
		>When I ask if you are going to put it on, you probably won't.
	>I would rather create a link like "The Relationship Between Righteousness and Simplistic Thinking" and try to write something on that page. Probably because I have a number of ideas similar to the above stored up in my mind, and I have a sense that I can say something about this.

I just thought I'd put it here to give you an idea of what I would do.

relevance
　[thought save].
　　Link to 2 other pages where this keyword appears
 Unlink "habit" and link "cognitive busyness," "cleanliness," "justice," and "simplicity."
　[System 1].
　[DOWNLOADING]

Ask yourself why you did it.
　This is a "[borrowed] idea" and neither of the two [usages] of the term is familiar with their own usage.
　But I don't find it difficult to understand.
　This is like a road: "I didn't usually go this way, but I noticed a road here, I may go this way, I'll add it to the map in my brain.
　So I made the keywords in the borrowed text into links, and at the same time I added links to the "paths I already have in my mind" associated with the text, so that they are interconnected.
