What is the intersection of meaning?
from [/unnamedcamp/概念の交差点とは何か？]
>I wonder if the intersection of concepts is a concept, a meta-concept, or something other than a concept.
I don't know if what the metaphor "[the intersection of concepts]" refers to is the same as what I have, but if it is the same, "the intersection of concepts is concepts."[/unnamedcamp/nishio.icon].
 I'm using a different definition of the word "concept" in my Scrapbox than it is used here, so for the sake of distinction, I'll say "intersection of meanings is meaning".
 First, meanings can seem separate and unrelated, or overlapping and related, depending on your point of view.
 [https://gyazo.com/6c2d7be5e47635516bdf4021f4ec504b]
　The term "intersection of concepts" on this page seems to be a metaphor used to refer to a phenomenon that occurs after "observing from a different perspective, there appears to be a relationship between meanings that were previously thought to be unrelated.
　At this time, "meaning" is a "blurry circle" that does not yet have clearly defined boundaries
　　[https://gyazo.com/23a2844a878062ad4f0b486b815ae6f8]
			[blurred circle]
		It's hard to tell if you draw with these blurry circles, so we'll draw with two "dark zones and light zones".
		　[https://gyazo.com/aa8305c21851e8396403025a5e567deb]
		　[dark thin circle diagram].
　　　Unlike "concepts" used in mathematics, which have clearly defined boundaries, the "meanings" we usually deal with have both thick and thin parts like this.
　So far, we have all the tools we need to describe the "intersection of meanings."
　What is meant by "intersection of meanings?"
　　[https://gyazo.com/1efed47963335f68e176a3bdaad60022]
			[「体験過程と意味の創造」勉強会3#6233f244aff09e00009fa2ae]
　　The thin areas of the edges of the two "meanings" A and B overlap, creating a new "dense area" L. This L
　　This is also a "blurry circle" like A and B, so "intersection of meanings is also a meaning"
　Side note: I use the term "concept" to refer to something whose boundaries have been clarified by careful definition.
　　["concept" is logically and uniquely identified and symbolized].
