An unsatisfied Socrates has more total happiness than a satisfied fool.
>[https://twitter.com/kaityo256/status/1517536926596997120 @kaityo256]: Congratulatory speeches at Todai are sometimes talked about, but my favorite is the 2014 Liberal Arts Degree Conferral Ceremony by Professor Yojiro Ishii, who talked about the three mistakes of "Be a skinny Socrates rather than a fat pig. I think it is very interesting and educational. I think it is very interesting and educational.
>[https://www.c.u-tokyo.ac.jp/info/about/history/dean/2013-2015/h27.3.25ishii.html 2014 Faculty of Liberal Arts Degree Conferral Ceremony Ceremony - General Information - General Information]

	>The graduation ceremony of the University of Tokyo reminds me of the famous words said by the then president of the university, economist Kazuo Okochi, in March 1964. I am reminded of the famous words said to have been spoken in March 1964 by the then President of the University, economist Dr. Kazuo Okochi. He said, "[Be] a skinny Socrates rather than a fat pig.
 > At the time, I was just old enough to start junior high school, and the term was reported quite widely in newspapers and on TV...
	>The first mistake lies in the subject "President Okochi is". The first mistake is in the subject "President Okochi" because it is not a phrase that Dr. Okochi himself came up with, but is borrowed from the 19th century English philosopher John Stuart Mill's "The Theory of Utilitarianism".... If you look at the manuscript of the ceremonial address, you will see that it says, "Long ago [J. S. Mill] once said, 'I would rather be a lean Socrates than a fat pig...'"...
	>Next, the second mistake... John Stuart Mill himself did not say "be a skinny Socrates rather than a fat pig" or "want to be" at all...
 > [* Better to be an unsatisfied man than a satisfied swine. Better to be an unsatisfied Socrates than to be a satisfied fool]. ...
	>In fact, President Okochi skipped over this part of the graduation ceremony and did not actually say... This is the third mistake...
	>I believe that this healthy critical spirit is the essence of "[liberal arts]" that is commonly demanded of all graduates of a single department with the same name, "College of Liberal Arts," regardless of whether they are in the humanities or the sciences. I believe that this is the essence of what is required of all graduates of the "College of Liberal Arts" with the same name, whether in the humanities or sciences.

>[nishio https://twitter.com/nishio/status/1518138546703732736]: and the original sentence "It's better to be an unsatisfied Socrates than a satisfied fool" is "The world is imperfect, so highly capable beings get what they get. happiness feels incomplete" (read appeal).

>[nishio https://twitter.com/nishio/status/1518138933737320448]: if you don't have a smartphone, you won't feel pain if the hotel wifi is clunky

>[nishio https://twitter.com/nishio/status/1518248640539951104]: "Which has more total happiness, the satisfied fool or the unsatisfied Socrates?"(the correct answer is Socrates) might also be easily understood by comparing it to Wifi [].
>People who don't use Wifi and can't use Wifi don't complain about Wifi not working well, only those who use Wifi all the time are unsatisfied, but only the latter enjoy the happiness caused by Wifi.

[Unsatisfied Socrates over satisfied pig].
