Unexplored emphasizes spontaneity.
The idea is to increase the number of [third places that stimulate children's creativity] such as [unexplored junior] [https://scrapbox.io/nishio/%E3%82%A4%E3%83%8E%E3%83%99%E3%83%BC%E3%82%B7%E3%83%A7%E3% 83%B3%E3%83%BB%E3%82%A2%E3%82%AB%E3%83%87%E3%83%9F%E3%83%BC%E6%A7%8B%E6%83%B3] and that it is unlikely to work if only the form of "Unexplored Junior" is replicated without "[Unexplored Culture The word "unexplored [culture]" is not clear and needs to be further elaborated.

Since its inception, the MIZUHATSU has always been about "support for individual creators, not grants to companies.
In addition, the "PM system" has been adopted, in which open calls for proposals are not reviewed by a committee but left to the judgment of individuals. In the Junior Project, the name has been changed to "Mentor," but the system of individual decision-making has been continued.

I think these two "leveraging the power of the individual" are important factors.
This direction has been expressed in many different words by now: "I'm not sure what I'm supposed to be doing.
 [spontaneous] [initiative] [intrinsic motivation] [enthusiasm]
 [the ability to move forward on one's own] [self-propelled] [first penguin].
 [sense of self] [overwhelming sense of ownership] [overwhelming sense of ownership] [overwhelming sense of ownership

The culture that considers this kind of thing good is, of course, not exclusive to the unexplored.
　In the process of discussing the culture of our own community within the unexplored community, the term "unexplored culture" was coined.
　This language is not good because it feels exclusionary to those outside the unexplored community
　It seems more appropriate to interpret that there is an as yet unnamed "Culture X", that the culture of the unexplored community is Culture X, and that there are other Culture X communities
　For example, [CoderDojo] is clearly Culture X
  >CoderDojo is a global, free network that is non-profit and voluntary. The participants themselves decide what they want to learn.
  	[https://steam-japan.com/report/2886/ "Thinking together, not teaching, and children learning from each other" CoderDojo Japan Representative Director Mr. Yasukawa | STEAM JAPAN]
  >All dojos are autonomous community groups that support the younger generation in learning independently.
  	[CoderDojo Charter]

relevance
　[ex-post facto leadership].
	[Can you spot innovative talent in advance?] [Self-oriented] of
