Adopters are not announced at the time of adoption
from [mitoujr-mentoring-tips]
Adopters are not announced at the time of adoption
　There are cases of dropouts for diverse reasons.
　　Publicizing the adoption reveals the fact that it dropped out because it was "on the adoption list but not in the results report".
　　The information of adopters is not made public at the time of adoption by the Junior Adoption Program because of the belief that "this is too much".
　　There is no prohibition against publicizing one's own actions. The possibility that one's actions may be detrimental to one's future self is not a reason to prohibit others from doing the same.
　　On the other hand, as of 2021, there are quite a few people who will publicize it on Twitter, etc.
　　As to whether this "no-publication stance" is beneficial, that's debatable.
　On the other hand, in the case of "Unexplored IT," names are disclosed at the time of adoption, and if, for example, a presentation is not made at the results reporting session, it is clearly stated that "the presentation by Project X (Y in charge) scheduled for Day 1 has been cancelled due to unavoidable circumstances.
　　It's tougher than unexplored junior, but, well, I don't see why there should be a difference between unexplored junior, where the creator is a minor, and unexplored IT, where the creator is an adult in most cases.

[https://yasslab.jp/ja/news/we-support-you-in-any-situation ⛰ Unexplored Junior "Guidelines for Troubleshooting" - YassLab Corporation]
 >In the "Guidelines for Troubleshooting," we provide guidelines for creators of new things, such as the Junior Unexperienced Creators, when they encounter a situation where they are in "trouble🤔. Although this document is intended for Junior Unexperienced Scientists, I think it will be useful not only for Junior Unexperienced Scientists, so I would be happy if you find it useful 😉.
	[https://gyazo.com/efd94c18d08c18fd40972c161286d35f]
　This is communicated at the first "Boost Conference" event after adoption.
