Scrapbox projects across the fiscal year
 We started using the Scrapbox project in 2021 with the participation of all creators, mentors, alumni, and guests of Unexplored Junior.
 	Initially, it was envisioned that the project would be reworked each fiscal year.
 It's been over 1,000 pages in a year.
　 It was suggested that we should continue to use the same Scrapbox project after FY2022.

discussion
　Pros
 　Scrapbox is difficult to understand how to use at first sight, so it is easier to get a sense if the previous pages are still available
 　Opportunity to learn how past projects have progressed
 　Opportunity to connect with past creators.
 　If you separate them, the old one will definitely be missed, as it has been in the past when we've migrated chat tools.
 　The process of ignition is labor intensive and dependent on luck. It's hard to start over from scratch when you've successfully ignited a fire.
 Cons
 　It is possible that the creators did not think that the MTG minutes of the 2021 creators would be seen by adopters in the next year and beyond.
 　　It is not a good idea to share something written in a PRIVATE space with a wider group of members without the consent of the person who wrote it.
 　　How about getting consent or announcing that it is OK to turn it off?
 　　　Simply erasing it is not a good idea because it destroys the learning opportunity to look back on it years later.
 　　　　If it's something you don't want people to see next year or later, you can move it to a PRIVATE place and delete it from here.
 　　　I feel uncomfortable taking consent.
 　　　　The chat already had years of past project discussions available for viewing, so no problems there.
　　May hinder lateral community formation
　　　Conditions are the same because "senior creators" were present in this year's group, and while the possibility of "hindrances" is small, the negative impact on vertical connections when divided by year is significant.
　　　Maybe we should be more proactive in implementing measures to increase lateral connections.

→ Continued use in FY2022, may change in FY2023 if there is a major problem.