The real name-only rule is unreasonable.
The [real name] limitation rule is unreasonable.
	If you try to do it right, you can't operate practically.
	If you don't do it right, it will be POLITICALLY-INCORRECT.

On 2020-02-05, a Japanese user of a social networking service who was using his real name was blocked for "violation of the real name rule".

>[__gfx__ https://twitter.com/__gfx__/status/1225022472166100992]: violation of the real name rule? ?This logic of QUORA is broken, isn't it?
>However, it was a hassle to defend myself and I decided to deactivate my account.
> [https://gyazo.com/a8c0fad663133a96e86585b8a45b746b]
	>[kenn https://twitter.com/kenn/status/1225255142687035394]: We apologize for any inconvenience caused. We have explained the background of this matter in detail in [https://inside-quora.quora.com/本名規定違反のトラブルについて?ch=10&share=4d5e3599 Trouble with Violation of the Real Name Rule - Inside Quora]. We would appreciate it if you could read it and come back to us.
	>[__gfx__ https://twitter.com/__gfx__/status/1225259403282006016]: thanks for the reply.
  >In summary, Quora says, "English education by Japan's Cultural Affairs Agency is strange and wrong. Only what we native English speakers say is correct when it comes to the alphabetization of names. I understood it to be an assertion that "we are not allowed to use Quora with the notation encouraged by the Agency for Cultural Affairs in Japan".
	>[kenn https://twitter.com/kenn/status/1225260077398937600]: I've changed the notation there, but it's going to be hard in the short term to get them to swallow the policy change to make capitalized last names OK globally. I wonder how Facebook, for example, is doing?
	>[__gfx__ https://twitter.com/__gfx__/status/1225260974501847042]: I think it would be a good idea for Quora to stop being so arrogant that "our standards are the world's standards" and to recognize cultural diversity a little more. I think it would be a good idea for Quora to stop being so arrogant that "our standards are the world's standards" and to recognize cultural diversity a little more.
	>[kenn https://twitter.com/kenn/status/1225264289381900289]: I understand the importance of diversity, of course, as the company has more diversity than the Silicon Valley average, but in this case, the odds are against us. I understand the importance of diversity, of course, but in this particular case, the rules seem unfair, not to Quora, but to other English users, because capital letters don't look like real names (they look like abbreviations of something).
>I wonder what Facebook is doing about it?
	>[kenn https://twitter.com/kenn/status/1225264884402683905]: But I think it is possible to convince them if you try very hard to explain. I've seen examples of other companies applying the same real name system and allowing capital letters.
	>[__gfx__ https://twitter.com/__gfx__/status/1225270340969889792]: facebook certainly doesn't allow all caps. However, it seems to allow the order family-name given-name. In other words, it appears that certain companies are arbitrarily deciding where to set the standard.
		>Anyway, I don't think it is a good decision to say "your name is strange, so I'm going to ban your account".
	>[kenn https://twitter.com/kenn/status/1225272834630406144]: I see, Facebook has separate first/family names in the English version, so that is a consideration.
		>Yes, the block is not the same as ban when it comes to details, but in any case, it is a fatal mistake and we are sorry that users who do not have a problem are prevented from using the site. We would like to find a way to improve it.
	>[__gfx__ https://twitter.com/__gfx__/status/1225289190381719552]: I think it is a reasonable decision not to split the name fields like facebook does, but I think it would be better to go one step further and "not impose a specific culture on the name I think it would be better to go one step further and not impose a specific culture on the name field.
		>([facebook name convention https://www.facebook.com/help/112146705538576] also looks like a cultural imposition to me)
	>[kenn https://twitter.com/kenn/status/1225306558260662272]: yes, I agree. I realized that such cultural clashes are inevitable when trying to fairly apply the rule of [[real name system]].
		>However, it is certainly difficult to refute a rule when it is called "a long-standing rule on Facebook". I would like to push with a counter-example in another major real-name service.

>[__gfx__ https://twitter.com/__gfx__/status/1225309954745126914]: If you mean convincing your teammates, how about this.
 >[https://twitter.com/makotonagasawa/status/1225291455582748672 @makotonagasawa]: Quote: "If you’re seeing a cross-national list of names with all caps, and they’re all European, it’s because they’re respecting Hungarians." [https://www.quora.com/Why-do-Europeans-write-their-surnames-in-capital-letters Why do Europeans write their surnames in capital letters? - Quora]
	>[kenn https://twitter.com/kenn/status/1225312913742688256]: thanks. These two answers, both of them, have almost switched to talking about the backward and forward order. I was able to confirm the official French document, and am checking with the community manager of the French version to see if this has ever been an issue.

>[kenn https://twitter.com/kenn/status/1225315051923394560]: Also, like Facebook, consumer speech platforms can't market mainland China, so they are without CJKV's C. Special I'm also troubled by the fact that there are few allies who can push for a response. I will do my best.
	>[__gfx__ https://twitter.com/__gfx__/status/1225319547869093888]: I'm not demanding that we take the trouble to do anything, but simply that we do nothing. Is it so difficult to say that we should respect diversity and not exclude different cultures just because we don't know or understand them?
	>[kenn https://twitter.com/kenn/status/1225356204131504128]: Yes, as I have explained, the general idea of understanding different cultures is of course understood, but the "global" approval of capitalization of last names However, there is no agreement on one point: capitalization of surnames "globally" is not acceptable. As I mentioned in the article, it is also not practical to pre-check every time whether a person is Japanese or not.
	>[kenn https://twitter.com/kenn/status/1225357124667969536]: So, I think a practical solution would be to automatically (forcibly) capitulate at the point of entry. It won't solve the problem of cross-cultural acceptance, but it may solve most of the problems, since there will be no incidents of "being suddenly blocked at a later date and feeling angry at the unreasonable treatment".


>[tkihira https://twitter.com/tkihira/status/1225472526177820675]: looking: [https://inside-quora.quora.com/本名規定違反のトラブルについて?ch=10&share=4 d5e3599 The Trouble with Violating the Real Name Rule - Inside Quora].Quora's response. They disregard the decision of the Japanese Agency for Cultural Affairs and write a personal blog as evidence that "it does not work in the English-speaking world". I am quite disappointed that Quora's management is of such low quality.
	>[ryukbk https://twitter.com/ryukbk/status/1225485635278004225]: I looked it up and found that in France, the first name is written first on official documents, etc., or the same name is used for both the first name and the last name, which may be indistinguishable, so the first name is written in capital letters. I found out that in France, the last name is written first on official documents, etc., and in some other countries in Europe and elsewhere, too, it seems to be the custom. in-capital-letters Why do French people write their surnames in capital letters?]
	>[tkihira https://twitter.com/tkihira/status/1225486263211483136]: yes, you can find a lot of things just by doing a little research. If you feel uncomfortable with your own sense, you should write so, but I am deeply annoyed that you are putting the blame on others, saying that in English-speaking countries....
	>[kenn https://twitter.com/kenn/status/1225574547694465026]: it is simply a fact that many people feel a sense of fakeness about capitalized last names, and it is the users who actually send in the "fake name" and problem reports. This is already an area of sensitivity, so I can only say that it is a cultural gap. The problem is compounded by the fact that Quora has separate spaces for each language.
	>[__gfx__ https://twitter.com/__gfx__/status/1225578960282501120]: An American passenger on a San Francisco bus expressed displeasure with a Japanese, so the crew dropped the Japanese off. When the Japanese complained to the bus company, the company defended itself by saying, "It is true that the passenger was offended. This is a matter of sensitivity," he defended himself.
		>Isn't this a problem that should be described as cross-cultural exclusion, not a cultural gap?
	>[__gfx__ https://twitter.com/__gfx__/status/1225581966017228800]: Here's a suggestion, once and for all, why don't we stop calling this issue a "sensitivity issue"? This will only lead to a parallel line no matter how far we go, and will only lead to the exclusion of names that are written in a way that is uncomfortable for American sensibilities. The question is whether Quora should recognize "the right to use the customs of the country of origin when writing one's name in English.
	>[kenn https://twitter.com/kenn/status/1225582890869592064]: well, yes, I think you're right about that, since Facebook has a cohesive policy (which they probably follow), How many naming conventions are there in the world that deviate from this? I think it would be a good idea to check how many naming conventions there are in the world that deviate from this one. [https://www.facebook.com/help/112146705538576 What other names are allowed on Facebook?]
	>[__gfx__ https://twitter.com/__gfx__/status/1225583648641966080]: I'm also quite distrustful of the Facebook rules. For example.
		>> Symbols, numbers, unusual capitalization, repeating characters or punctuation.
		>O'Reilly is not in violation of this rule, is it? But actually Tim, who is famous in this industry, can properly call himself O'Reilly.
	>[kenn https://twitter.com/kenn/status/1225584369013669889]: O'Reilly is an official Irish capitolization. But yes, there is a sense of unfairness that only European languages are being meticulously supported.


>[otsune https://twitter.com/otsune/status/1225585015582384130]: gfx registered "Goro FUJI" as his last name in capital letters, and the Quora English moderator banned him because it is not his real name.
	>Was it because of the uniquely Japanese culture of capitalizing surnames in Roman letters for clarity, which is not understood by foreigners? [https://inside-quora.quora.com/本名規定違反のトラブルについて?ch=10&share=4d5e3599 The trouble with violating the real name rule - Inside Quora]

>[dmikurube https://twitter.com/dmikurube/status/1225635824529596416]: I personally think it's time to throw this in Quora's face and be done with it. I think it's irrational in the sense that [[rules like the real-name-only rule are practically impossible to implement if done properly (and easily politically-incorrect if not done properly)]].
> [https://www.kalzumeus.com/2010/06/17/falsehoods-programmers-believe-about-names/ Falsehoods Programmers Believe About Names | Kalzumeus Software]
> [http://emptypage.jp/translations/kalzumeus/falsehoods-programmers-believe-about-names.html fallacy about names held by programmers]

>[nishio https://twitter.com/nishio/status/1521326249670750208]: I remember there was some article that summed up the name diversity well, but I couldn't find it. The one with a lot of "names are not always split in two" and stuff like that.
 > [https://twitter.com/wonderful_panda/status/1521327102255149056 @wonderful_panda]: not just the name, but this isn't it
 > [https://qiita.com/yugui/items/55f2529c5a731badeff7 Our Idea of the Greatest i18n Nation - Qiita]
 >[https://twitter.com/__gfx__/status/1521330117137469440 @__gfx__]: @nishio "The fallacy about names held by programmers" by Patrick McKenzie.
 > [https://emptypage.jp/translations/kalzumeus/falsehoods-programmers-believe-about-names.html fallacy about names held by programmers]

This social network has since dropped its real name system.
[https://quorajp.quora.com/より多くの方がQuoraに参加できるようにモデレーション方針が変更されます?ch=10&oid=9988076&share=ee4820b6&srid=5g3qr&target_type=post Moderation policy changes to allow more people to join Quora - Quora Official]

>[https://twitter.com/yugui/status/1521488683849105409?s=20&t=o70VZ9ARl8_RFZu8awQPaQ @yugui]: @nishio And here's something else related to names not mentioned there.
>https://t.co/rABzMiBbVG
>https://t.co/urgnydIOoS
>I'm in the category covered by the "fallacy about names".
	[https://gigazine.net/news/20080829_woman_called_yoda_blockde_sns/ Woman Continually Denied SNS Subscription After Being Mistaken for Star Wars' Yoda - GIGAZINE]
 >[https://twitter.com/yugui/status/1027378844443922432 @yugui]: I didn't know much about Chinese Business Conversation, but it says something scary like using the husband's last name when giving the honorific "Mrs" even though the couple has separate surnames. So, we need a field in the user profile for "preferred honorific title" as well as "preferred honorific designation"?


[Culture]
[Diversity]
