Presentation in Interviews
>[nishio https://twitter.com/nishio/status/1522117002399461377]: #Unexplored Junior Question Box Q: For a presentation in an interview, is it necessary to think of a text or prepare slides for it in advance? Do you need to prepare slides for the presentation in advance? Or do they specify what you are going to talk about on the spot?
>A: I think it is advantageous to be prepared. To be continued

>[nishio https://twitter.com/nishio/status/1522117105554190337]: The following statement has been added to the official website this year.
>>You will have 5 minutes to give a presentation outlining your proposal and then we will ask you a few questions.
> [https://jr.mitou.org/guideline Application Guide - Unexplored Junior]
>This process is explained below.

>[nishio https://twitter.com/nishio/status/1522117653590323200]: Up until last year, I did not write "do a presentation", but there were still a number of people who came prepared with a presentation. I have not kept data on the ratio of the number of people, but from Nishio's personal subjective viewpoint, I think that more people come prepared.

>[nishio https://twitter.com/nishio/status/1522118571480219653]: until last year, there was a mix of people with and without presentations at the start of the interview
>"Mentor, do you have a presentation?"
>Creator: "No."
>Mentor: "Okay, so my question is..."
> There was an exchange of

>[nishio https://twitter.com/nishio/status/1522118632800944129]: This is a great way for creatives to say, "Hey, maybe I should have prepared a presentation? Maybe I should have prepared a presentation? We discussed whether this would have a negative impact, such as creators becoming impatient, and decided to require a uniform presentation.


>[nishio https://twitter.com/nishio/status/1522120293200068609]: with or without a presentation, it is easier to get the conversation going with one. Why is that? Because it is easier to see where your [enthusiasm] lies.

>[nishio https://twitter.com/nishio/status/1522120457243488256]: difficult to read from the proposal alone.
>For example, if a proposal says, "We will use judgment technology X to achieve objective Y. If the proposal says, "We have tried these things with regard to judgment technology X, but the accuracy of judgment is low and we are having trouble with it," where is the enthusiasm?
 >[nishio https://twitter.com/nishio/status/1522120905094463488]: you may be enthusiastic about "using decision technology X" and want to improve the accuracy of X.
	>On the other hand, maybe they are enthusiastic about "achieving objective Y" and are willing to stop using judgment technique X if they can achieve their objective.

>[nishio https://twitter.com/nishio/status/1522120933389250560]: you can't simply judge by the amount.
>Sources of enthusiasm and impulse are subjective or related to private experiences and are hesitant to be documented. On the other hand, technical knowledge is easier to write about and tends to be more voluminous.

>[nishio https://twitter.com/nishio/status/1522122162949492736]: mentors strive to read where the enthusiasm lies in the documents, but often fail because it is difficult. Sometimes they look at the ones that are too large in volume.

>[nishio https://twitter.com/nishio/status/1522122234210709504]: if the mentor misunderstands where your enthusiasm lies, for example, you are not interested in improving the accuracy of judgment technique X, but the mentor asks, "What are your thoughts on how to improve accuracy? What are your thoughts on how to improve accuracy?" You are not interested in improving the accuracy of judgment technique X, but the mentor asks questions like "What do you think about how to improve the accuracy?
 >[nishio https://twitter.com/nishio/status/1522122250262282240]: The limited interview time is consumed by exchanges about things you are not very enthusiastic about, leaving the mentor with the negative impression that "You didn't seem very enthusiastic about anything. This will leave the mentor with the negative impression that "you didn't seem very enthusiastic".


>[nishio https://twitter.com/nishio/status/1522123241762193408]: So it is good to have a presentation.
>In the limited time of five minutes, it is not possible to explain everything in the proposal. So it will be disconnected and focused on what you think is important. What you focus on and what tone of voice you use will make your enthusiasm easy to understand.

>[nishio https://twitter.com/nishio/status/1522124032166219778]: you are free to do whatever you want with your 5 minute presentation. But as you can see from what I have said so far, this is a chance for you to express to your mentor the enthusiasm you feel for your project. It would be good to make a presentation that allows you to take advantage of this opportunity.

>[nishio https://twitter.com/nishio/status/1522124989969100801]: For example, to give a bad example, a presentation where the same text that is written in the proposal is put on a slide in small letters and read out loud with no inflection. I think it's not good.
>All mentors participating in the interview read the proposal, so if they read the text in the proposal, they will get bored.

---

>[shoya140 https://twitter.com/shoya140/status/1522135006054952960]: I understand what you are saying about the focus by time limits clarifying where the heat is.

>[shoya140 https://twitter.com/shoya140/status/1522135195515826177]: If presentations are the best way to convey enthusiasm from a focus perspective, I could consider the idea of "having a video presentation added to the proposal next year". However, that tends to increase the workload and delay the start of proposal writing, so I thought the current format seemed like a good idea.

>[shoya140 https://twitter.com/shoya140/status/1522135386893475840]: On the other hand, even if the format of the proposal is written, it is effective to make slides ahead of time and imagine yourself presenting it, so that you can reassess the source of your enthusiasm and It can help you identify the source of your enthusiasm and, as a result, improve the structure of your writing. When I find myself having trouble writing a paper or a proposal, I make the slides ahead of time.

>[nishio https://twitter.com/nishio/status/1522136021940736003]: There is also a style where you are asked to submit a "5 minute presentation video" instead of a proposal, but again, the disparity between those who can make it and those who can't is a problem I thought it would be a problem. It would be useful in the experimentation and development process to imagine presenting the proposal.

>[shoya140 https://twitter.com/shoya140/status/1522138792467083264]: I have realized in many places that the task of "recording a presentation" is much harder than I imagined, and that I spend time and awareness in areas that are not essential. I strongly agree with you.
