(Special Provisions for Right of Transfer for Persons with Good Intentions)
[Copyright Law]
Chapter VII Infringement of Rights
> (Special provision for the right of transfer pertaining to a bona fide person)
>Article 113-2 An original work or a reproduction of a work (excluding a reproduction of a cinematographic work (in the case of a work reproduced in a cinematographic work, including a reproduction of said cinematographic work)) (excluding the original work or a reproduction of the original work of a cinematographic work (in the case of a work reproduced in a cinematographic work, including a reproduction of said cinematographic work)) The same shall apply hereinafter in this Article). (2) Where, at the time of transfer of an original work or a reproduction of a work, a sound recording or a phonorecording of a performance, or a reproduction of a phonorecording, a reproduction of a sound recording or a phonorecording does not fall under any of the items of Article 26-2(2), the items of Article 95-2(3) or the items of Article 97-2(2), respectively. (2) An act of transferring to the public an original work or a reproduction of a work, a sound recording or a phonorecording of a performance, or a reproduction of a phonorecord by a person who does not know, and is not negligent in not knowing, that the said work does not fall under any of the items of Article 26-2 paragraph (2), Article 95-2 paragraph (3), or Article 97-2 paragraph (2), shall be deemed not to constitute an infringement of the rights prescribed in Article 26-2 paragraph (1), Article 95-2 paragraph (1), or Article 97-2 paragraph (1). Article 96-2(1), Article 95-2(1), or Article 97-2(1).

	Each item of Article 26-2, paragraph 2
		>(Right of transfer)
  > Article 26-2 Authors may, when they have made a work (excluding cinematographic works; hereinafter the same shall apply in this Article), obtain permission from the Minister of Land, Infrastructure, Transport and Tourism. The same shall apply hereinafter in this Article). Article 26-2 An author may reproduce a work (excluding cinematographic works; hereinafter the same shall apply in this Article) in its original or a reproduction (in the case of a work reproduced in a cinematographic work, excluding a reproduction of the said cinematographic work). The same shall apply hereinafter in this Article). (2) The right to make available to the public by transfer of the original work or a reproduction (excluding, in the case of a work reproduced in a cinematographic work, a reproduction of the said cinematographic work) of a cinematographic work shall be exclusive.
  > 2. The preceding paragraph shall not apply to the case of transfer of an original work or a reproduction of a work that falls under any of the following items
  > (i) Original or reproductions of a work that have been assigned to the public by a person who has the rights prescribed in the preceding paragraph or by a person who has obtained the authorization of such a person
  > (ii) a reproduction of a work that has been transferred to the public with a ruling under Article 67(1) or 69 or with permission under Article 5(1) of the Act on Special Provisions of the Copyright Act in connection with the Implementation of the Universal Copyright Convention (Act No. 86 of 1956)
  > (iii) Copies of works transferred to the public under the provisions of Article 67-2(1)
  > (iv) Original or reproductions of a work that have been assigned to a specific and small number of persons by a person who has the rights provided for in the preceding paragraph or by a person who has obtained the consent of such a person.
  > (v) An original work or a reproduction of a work that has been transferred outside Japan without prejudice to the rights equivalent to the rights prescribed in the preceding paragraph or by a person who has the rights equivalent to the rights prescribed in the preceding paragraph or by a person who has obtained consent therefrom
	each item of Article 95-2, paragraph 3
		>(Right of transfer)
  > Article 95-2 Performers shall have the exclusive right to make their performances available to the public by transferring their sound or video recordings.
  > 2. The provisions of the preceding paragraph shall not apply to the following performances
  > (i) Performances recorded with the permission of a person who has the rights prescribed in Article 91, paragraph (1)
  > (ii) Performances set forth in Article 91, paragraph (2), which are recorded or recorded on an object other than a sound recording set forth in the same paragraph
  > 3 The provisions of paragraph (1) shall apply mutatis mutandis to performances (excluding those listed in the items of the preceding paragraph). The same shall apply hereinafter in this Article). (2) The provisions of paragraph (1) shall not apply to the transfer of sound recordings or video recordings of performances (excluding those listed in the items of the preceding paragraph) that fall under any of the following items
  > (i) Sound recordings or video recordings of performances that have been transferred to the public by a person who has the rights prescribed in paragraph (1) or a person who has obtained the permission of such a person
  > (ii) Sound recordings or video recordings of performances that have been transferred to the public following an award under Article 67(1) as applied mutatis mutandis pursuant to Article 103.
  > (iii) Sound or video recordings of performances that have been transferred to the public under the provisions of Article 67-2 paragraph (1) as applied mutatis mutandis pursuant to Article 103
  > (iv) Sound recordings or video recordings of performances that have been transferred to a specific and small number of persons by a person who has the rights prescribed in paragraph (1) or by a person who has obtained the consent of such a person.
  > (v) Sound recordings or video recordings of performances that have been transferred outside Japan without prejudice to rights equivalent to the rights prescribed in paragraph (1) or by a person who has rights equivalent to the rights prescribed in the same paragraph or by a person who has obtained his/her consent
	each item of Article 97-2, paragraph 2
		>(Right of transfer)
  > Article 97-2 A producer of phonograms shall have the exclusive right to make his phonograms available to the public by transferring copies thereof.
  > 2. The provisions of the preceding paragraph shall not apply to the case of transfer of a copy of a phonorecord that falls under any of the following items
  > (i) Copies of phonograms that have been transferred to the public by a person who has the rights prescribed in the preceding paragraph or by a person who has obtained the authorization of such a person
  > (ii) copies of phonorecords that have been transferred to the public by an award under Article 67(1) as applied mutatis mutandis pursuant to Article 103
  > (iii) copies of phonorecords that have been transferred to the public under the provisions of Article 67-2(1) as applied mutatis mutandis pursuant to Article 103
  > (iv) Copies of phonograms that have been transferred to a specific and small number of persons by a person who has the rights prescribed in the preceding paragraph or by a person who has obtained the consent of such a person.
  > (v) Copies of phonograms that have been transferred outside Japan without prejudice to rights equivalent to the rights prescribed in the preceding paragraph or by a person who has rights equivalent to the rights prescribed in the same paragraph or by a person who has obtained his/her consent

	Article 26-2, paragraph 1
		>Author shall not use any of his/her works (excluding cinematographic works) for any purpose other than the purpose of the publication of his/her works. The same shall apply hereinafter in this Article). (2) An author shall not make a reproduction of the original work or a reproduction (in the case of a work reproduced in a cinematographic work, a reproduction of the said cinematographic work shall be excluded; the same shall apply hereinafter in this Article) of the original work or a reproduction thereof. The same shall apply hereinafter in this Article). (2) The right to make available to the public by transfer of the original work or a reproduction (excluding, in the case of a work reproduced in a cinematographic work, a reproduction of the said cinematographic work) of a cinematographic work shall be exclusive.
	Article 95-2, paragraph 1
		>The performer shall have the exclusive right to make his/her performance available to the public by transferring his/her sound or video recording.
	Article 97-2, paragraph 1
		>The producer of phonograms shall have the exclusive right to make the phonograms available to the public by transferring copies thereof.
