Not focused on social significance.
>[nishio https://twitter.com/nishio/status/1521773229400293377]: Well, today we are going to talk about [social significance]. You could say that there are different opinions on this, or you could say that it's a broad but common direction.
>"I don't appreciate the social significance at all," and from the side of "we need to do something about the adults who are harmful and mis-educate people that they should include social significance in their proposals,
	>[nishio https://twitter.com/nishio/status/1521773972538662912]: up to "involving social significance can be beneficial in doing what you want to do". You could say that there is a range, and that generally people don't focus on social significance.

>[nishio https://twitter.com/nishio/status/1521774620768337921]: I was thinking about how I am, and felt that this "social significance" is also an obscure concept. The words "society" and "significance" are unclear.

>[nishio https://twitter.com/nishio/status/1521776927010607104]: The size of "society" varies from person to person. Some people set "society" as all mankind or all Japanese as their target, while others set "people within a radius of 5 meters". The former often make iffy suggestions. The reason is that the target is not concrete.

>[nishio https://twitter.com/nishio/status/1521779266228453379]: Mentors who give negative feedback to proposals that focus on "social significance" are probably not negative because of the social significance written in the proposal, I think they are negative because the "social significance" they claim to have is vague, unclear, or imaginary, not based on concrete examples.

>[nishio https://twitter.com/nishio/status/1521779937807826945]: In contrast, the "It's not useful for anything, but I want to make it, so I'll make it! There is a clear need for the "I want to make this! If I can do it, I will be happy. In that sense, it is a clearer description than proposals that talk about vague social significance.

>[nishio https://twitter.com/nishio/status/1521780845098717184]: "I want to make this! One of the mentors said, "That's a great idea! I'd like to see it completed myself! If one mentor sees a proposal and says, "I want to make this!

>[nishio https://twitter.com/nishio/status/1521781480833581058]: I see, after all, the existence or non-existence of "social significance" is something that society decides. It can be said that there is "social significance" only when it is confirmed that there are people who actually enjoy it, and whether it actually exists or not remains to be verified even if you just think about it in your head and claim "there is social significance" on a piece of paper.


>[nishio https://twitter.com/nishio/status/1521783963614072833]: let me write about another connection with the keyword "[make it personal]". Projects that target the broader society tend to obscure "why are you doing it?" is often unclear. The application form for the Junior Project for the Unexplored Program includes the question "Why are you doing this? but not "What is the social significance? but not "What is the social significance?

>[nishio https://twitter.com/nishio/status/1521784493165539328]: if you check now, you will see that "who would be happy to do this? It doesn't have to be useful for a lot of people. It may not be useful, but it can be interesting."
>It explicitly said. It's explicitly saying that it doesn't have to be a proposal that helps a lot of people.

>[nishio https://twitter.com/nishio/status/1521785875977609218]: This is related to the "adults who incorrectly instruct that social significance should be included in proposals are harmful" argument, but I think the first and most important thing is "answer the questions they are asking. The first and most important thing is to "answer the question they are asking. I'm designing this with the assumption that they'll think for themselves about what they're asking and answer honestly, so I don't want the adults around them to get in the way.

>[nishio https://twitter.com/nishio/status/1521786522114363393]: even just the proposal is so distorted by various assumptions that it's hard to read, so some mentors are angry at the adults who make the distortions bigger. It's only natural that some mentors get angry at the adults who make the distortions bigger. I am the type of person who thinks that it is expensive to deal with the adults directly, so I wonder if I can make things better by disseminating information.

>[nishio https://twitter.com/nishio/status/1521787387684454400]: Now that I've thought about it a lot, let me finish by verbalizing "So what do I think about the social significance?
>I positively evaluate "having social significance," but the scope of what I consider "having social significance" is much narrower than the rest of the world. I consider anything that I can't see the faces of concrete beneficiaries to be "unverified" or "not verified.

>[nishio https://twitter.com/nishio/status/1521788804021231621]: if you look into your own mind, it looks like this
>"Unverified social significance is being claimed."
><(high wall)<"I want to do it"
<"The social significance is verified."
<<"Social significance has been verified and has the potential to scale."