Unexplored graduates who have achieved good results should be aware of this.
2018-02-12 Mito General Incorporated Association, Director Yasukazu Nishio

Good words from Natsuno at Mitou 2017 Demo Day.
We are not waiting for the old man or woman who comes, but go and get what you need for yourselves. Our reaching out to you will end at the end of the term."

The first half of this is especially good. We need to be wary of people who approach us after seeing our results. (2022 note: Nowadays, the value of the "Unexplored" brand has increased to the point where simply "being adopted by the Unexplored" has become a value of use. Therefore, the problems discussed here require vigilance not only "after the results reporting meeting" but also "during the adoption period").

Don't say "yes" to someone who has seen the results report meeting and approached you to "make it a business" with a two-fold response. Why is that?

Not everyone in the world wants you to be happy. Some people value more money in their wallets than your happiness. Your achievements and the fact that they are widely known will attract "people who want to take achievements away from others.

Such a person X says, for example, "I will pay for you." X pays 3 million and takes 30% of the company's stock. The intellectual property, of which you would have had 100% rights, is transferred to the company; X promises to work two days a week, but actually does nothing. You alone have to work hard to make your business profitable. And when your business becomes profitable, X takes 30% of the profits. You want to get rid of X, but X says that if you get rid of yourself, you must buy out his shares. You have no money left because you spent it on the business. This can happen.

X puts the curse on you that this is a business matter and you should not discuss it with others. If you take it to heart, you will have no one to talk to but X. If you are in doubt about whether X is doing the right thing, you will not know what to do. X will use his greater knowledge than you to exploit you by entering into contracts that will put you at a disadvantage. X is not interested in you having knowledge. So he puts these curses on you.

Q: How do I recognize a bad person?
 A: As noted above, "Do not consult others" is a common curse used to exploit using knowledge gaps. Knowledge is power. You should consult others and get a second opinion before making a decision about an area of which you have no knowledge.

Q: Who should I talk to?
 A: There is no general rule. Refer to the following and figure it out for yourself.
  Better to be a disinterested party.
  Better more than one person.
  The OB/OGs who are invited to boost meetings and mid-term camps are better than a random one because they have been selected by PMs and IPAs through trust and have a track record of altruistic acts, giving up their holidays without compensation to help you all with your projects. However, they should not be trusted 100% as we have had to call in inappropriate people.
  PMs are much better because they are trusted and selected by the IPA and are continually working to get their name out there for exposure. However, they are not necessarily business savvy.
  The lawyer you hired. There is no incentive to cheat you. However, there is also not much incentive for your business to succeed.
  Rich. There is no incentive to get money by deceiving you. However, it is difficult to distinguish between the truly rich and the con artists pretending to be rich.
  Someone is trusted by someone. However, being trusted does not mean that he/she is really worthy of trust. The person you trust may be mistaken. Nor does it mean that his / her knowledge is 100% correct. Some people give wrong advice with good intentions.
  You may also consult with the General Incorporated Association Unexplored (head-office@mitou.org). The e-mail will be forwarded to all members of the secretariat, including directors Takeuchi, Arakawa, Nishio, and Kawai, so if you have a confidential matter to discuss, please write a letter stating that you would like to discuss it instead of writing directly.
  Mixing people from different positions is a good idea.


Related Documents
 [Productivity Improvement Recommendations by Communities https://www.slideshare.net/nishio/ss-55412704] Nishio's 2015 presentation slides. Dealing with Altruistic Individuals.
 [Biases around Entrepreneurship, March 2012 http://www.shudo.net/article/201203-biases-around-startups/] Dr. Suto's presentation. Bias by position.
 [about negotiating power https://www.slideshare.net/nishio/ss-82258731] Nishio's slides to be presented in 2017 (no presentation due to lack of time)

2022-05-07 I found it buried in an account that HackMD doesn't usually use, so I posted it here.

relevance
　[Productivity Improvement through Community Recommendations].
　[On negotiating power].

Maybe we should collect past announcements under a tag like [announcement as a board member of an unexplored association] or something like that...
