Translate textbook formulas into your own symbol system
from [/villagepump/translate textbook formulas into your own symbol system].
[textbook] with [active reading][/villagepump/takker.icon].
　I'm fed up with formulas that are hard to understand.
　 Appropriate handling of symbols
　 Please stop omitting the integral range.
　 　What area are you dividing?
　 　In case you read the successive integrals that come up in the equation transformation right after, you can finally see where I wanted to integrate and what I wanted to do.
　 　　I want you to write first[/villagepump/takker.icon].
　It's faster to rewrite it from scratch yourself.
　　Whether it's early or not, [understanding] is going to be deep[/villagepump/nishio.icon].
　　 The "early" was inaccurate[/villagepump/takker.icon].
　　 A closer representation is, "It is easier for my hand to translate an expression into the [symbol system] that I normally use before expanding it, rather than expanding it with the symbols that the textbook uses."
　　 　I feel like I'm just stating the obvious.
　　 　Does this mean I'm not learning new concepts?
　　 　 [/enchi/1.3.4.5 When you need sutra again](private)
　　 　 [(1.3.4.5) When the sutra is needed again].
　　 　 But I've only learned the symbolic rules in the textbook, but not the theoretical content (in this case [stability conditions for floating bodies in hydrostatics]), so is that a problem?
　　 　 If all you're focused on is rewriting symbols and not getting the substance of the theory in your head, that's a problem, but if not, why not? [/villagepump/nishio.icon].
　　 　  It was rather refreshing to rewrite[/villagepump/takker.icon].
　　 　  Also, it's interesting how the lack of explanation keeps coming up.
　　 　  I think that when it is written in unfamiliar symbols, we unconsciously reduce [cognitive resolution] or [skip over] it[/villagepump/nishio.icon].
　　 　   [/unnamed-project/episode of a child who was unaware of the English message].
　　 　   You skipped reading it in the first place[/villagepump/takker.icon].
　　 　    I can only pick up information to the extent of [table of contents reading].
　　 　     Resolution to the extent that when Topic A is dumped, it comes right out and says, "You know, the verification column for this was at the end of Chapter N of Book B.
　　 　    (As for formulas) I have to rewrite everything in my own symbols to understand it.
　　 　    　And re-draw all the diagrams.
　　 　 Whether something expressed in a symbol system A is transformed within that symbol form, or whether it is transferred to symbol system B and then transformed
　　 　 　I want something that gets me to the right answer fast.
　　 　 　When tackling a problem with no correct answer, the wider the search area, the better the chance of reaching the correct answer.
　　 　 　Better to use both A and B than to use only A.
　　 　 　[https://gyazo.com/019d3db9ea786470d5e5790128f8f710]
      	[/enchi/6.2.4.1 NM Method and Analogy] / [(6.2.4.1) NM Method and Analogy].
      I think it's a kind of [fast travel through the knowledge network], that there's a network in symbol system B, and you can use that to fast travel.
		I used to dare to use a different layout when transcribing the board into my notebook to encourage reorganization in my brain[/villagepump/inajob.icon].
　　　It's [intellectual production by changing the format][nishio.icon].
