Working memory reaches its peak in the 30s.
>[https://twitter.com/kohaken_dsl/status/1522699476409802752 @kohaken_dsl]: There is a guideline for the number of instructions that can be understood at once, depending on age. Of course, this is just a reference as it varies greatly from person to person, but at 5-6 years old, for example, two instructions are considered the limit.
>It is better to refrain from giving too many instructions at once, and to devise a way to say more than three at a time, or to write them down ^ ^.
>[https://gyazo.com/c05c351077ceec56ef37b5107e278e60]

Is this the original paper?

Working memory across the lifespan: A cross-sectional approach [src https://www.tandfonline.com/doi/full/10.1080/20445911.2012.748027?scroll=top&needAccess=true]
>The aim of the present study was to extend previous lifespan research to a wide age range (5 to 80 year olds) and investigate any potential differences in the development and decline of working memory functions. To that end, measures of both verbal and visuo-spatial working memory were included in a cross-sectional study. The findings indicated that there is considerable growth in childhood–on average 23 standard points; with performance peaking in 30-year olds. There was relatively little change in working memory performance in older adults, with 70 to 80 year olds performing at comparable levels to teenagers (13–19 year olds) in verbal working memory tests. Confirmatory factor analyses suggest that working memory skills across the lifespan are driven by domain differences (i.e., verbal or visuo-spatial stimuli), rather than functional differences (maintenance and manipulation of information).
	(DeepL)The purpose of the present study was to extend previous lifespan studies to a broad age range (5 to 80 years) and to investigate potential differences in the development and decline of [working memory] function. To this end, measures of both verbal working memory and visual and spatial working memory were included in the cross-sectional study. The results revealed that there was substantial growth in childhood, averaging 23 standard points, reaching a peak in the 30s. Older adults showed relatively little change in working memory performance, with 70-80 year olds performing as well as teenagers (13-19 years old) on verbal working memory tests. Confirmatory factor analysis suggested that working memory performance throughout life is driven by domain differences (i.e., verbal or visual/spatial stimuli) rather than functional differences (i.e., information maintenance and manipulation).
Alloway, T.P. and Alloway, R.G., 2013. Working memory across the lifespan: A cross-sectional approach. Journal of Cognitive Psychology, 25(1), pp.84-93.

[Aging]
