Cross-checking of scheme concepts
Organizing scheme concepts
	It would be better to organize the concept of the scheme and talk about the scheme next time before going into section 7.
		4B7 "Experienced meanings can (partially) scheme (creatively determine) new aspects of other experienced meanings"
		Section 7 is developed on the premise that the previous section 2, "experience is multi-schematic," but I have a hard time believing that section 2 is a good fit.
	Scheme Concept
 　There's a lot written in Chapter 6.
 　Might be a good idea to cross check on the scheme.
 　As I understand it now, there are not one but several structures (schemes) that can logically be said, "There is such a structure, isn't there? And there is a state before that scheme is verbalized." That's how I feel.

p.25-27
	序章
	　What types of concepts can be associated with a felt meaning?
	　Requires more than the logical scheme of "experience."
	　Not only the experience already logically in place.
	　We must also address experience before it can be logically arranged.
	　　Meaning.
	　　logical order
	　　　論理的秩序[nishio.icon]
	　　The function of experience in forming
	　　Pre-logical and pre-conceptual experience must be studied when it is working with logical symbols
	　　Never replace "pre-logical experience" with "logical symbols."
	　　Staying at the logical level does not reveal how experience works with logic
	　No matter how complex an experience may be.
　　　Cannot logically be regarded as a scheme-like construct
　　　One can only have one scheme for how experience and logic are related
　　　　Even then, experience must be directly collated.
　Experience is the flow of emotions we have at any given moment
　　It's not in shape.
　　We call it "experiencing.
　　The experience process is
　　　In action, too.
　　　In forming meaning, too.
　　　Basic Role
　　　If logical schemes are not considered in relation to this role of the experience process, they are empty
　p.26
　 We have so many schemes that each one is exclusive and fundamental
　 Relativism, positivism, pragmatism
　 The scheme is.
　 　For the most part, they are the same.
　 　　相対主義
　 　　　>Relativism (English: relativism, German: Relativismus, French: relativisme) is the view that one's view of an empirical event is relative to, or dependent on, one's view of other empirical events. Relativism (German: Relativismus, French: relativisme) is the idea that a view of an empirical event can only be objective in
　 　All completely meaningless.
　 　　Positivist position "metaphysical propositions are nonsense because they are unverifiable."
　 　Often we can determine that they are the same thing.
　 　　Pragmatist judgment in chapter 6A5.
　 Relativity of Schemes
　 　In today's West, society does not provide individuals with a scheme or format for interpreting their experiences
　 　　　この「形式」は何の訳語？=form[nishio.icon]
　 　　There used to be a scheme that interpreted "lightning struck" as being the wrath of God[nishio.icon].
　 　 Individuals know that there are many forms and schemes that contradict or are unrelated to each other
　   = Facing life and the process of experiencing it firsthand
　　　He questioned art forms, philosophical schemes, religious beliefs, social patterns, moral values, and rituals.
　　　Spengler and Toynbee, "Isn't such relativization a sign of social division?"
　　　　historical pattern
　　　　　In times of social division, the schemes that have been maintained become "relative" and
　　　　　Individuals interpret life and experience processes directly.
　　　　　　Often hopeless
　　　　　　very human
　　　　Do you want to take out an existing scheme?
　　　　Know how to relate concepts to the experience process through rational methods
　p.27 How symbolization affects the process of experience and how to be affected by it
　　Create a vocabulary that can interact with the experience process
　　　This allows for communication about the experience process
　　　Be able to think of the scheme in relation to its empirical meaning


Chapter 6: Applications in Philosophy
6A Principles of philosophical method implied by relativity
Some practical examples of the principle
　The myriad meanings that can arise
　決定性
　選択的公式化
　6A4 Open scheme
　6A5 Scheme Evaluation
　Relativity of all terms
　　Include basic terms such as "definition."
　機能的同等性
　論理的形式

237-239
　open scheme
　　原文を読む必要がある[nishio.icon]
　　 roughly
　　 　You can't formalize every (possible) meaning.
　　 　Cannot resolve any implications that may be contradictory

239-240
 Scheme Evaluation
 　Scheme Value
 　Intercomparison of schemes, relative evaluation
 　Scheme Objectives
 　How?
 　　Match to aspects of experience identified
 　　If two schemes can be matched and symbolized in the same way, then for that aspect they are equivalent
 　　You need to check the original text because of the strange parentheses [nishio.icon].
 　Principles of scheme evaluation
 　　The value and valuation of the scheme depends on the aspect of experience that's symbolized with the scheme's help.
 　　In my specific example [Re: verbalization], I am verbalizing the answer to the question, "What are the benefits of verbalization?" I verbalize the answer to the question, "What are the benefits of verbalization?
 　　　This verbalization is done with the help of a system of knowledge that has been created in me through my study of "the process of experience and the creation of meaning".
 　　　This "verbalization with the help of a knowledge system" is here called "symbolization with the help of a scheme."
 　　　Even in this specific verbalization, assuming that the other person has no knowledge of the "experience process and the creation of meaning," I am able to change the language into words that seem to convey
 　　　　The reason why I can do that is because these words are not just symbols, they are connected to a "felt meaning" within me
 　　　　In other words, we're in a state of "conception."
 　　This idea is pragmatistic[nishio.icon].

>21. "scheme" is translated as "scheme. Scheme" means a system of theory, but we have chosen to translate it as "scheme".
>multischeme translates as "many schemes".

p.23
 >In the past, meaning was usually analyzed in relation to things (objective verification, sense perception) or in relation to logical structures. Of course, meaning was considered to be related to experience, but "experience" was usually interpreted as a logical scheme integrating sensory perception, or as a logical concept mediating in relating or predicting the observed results of actions.
 >Today, however, we can no longer interpret "experience" in such a narrow sense. Besides logical schemes and sense perception, we have come to realize that there is also a powerful sensed dimension of experience that is pre-logical, yet plays an important role in our way of thinking, perceiving and acting.
 Argument that experience should not be thought of as being a logical scheme, that it is a narrow interpretation

p.185
　Scheme Example
  時間
  物
  過程

p.231
 Descartes Any concept is either about something or is itself existential
 　[nishio.icon]I think, therefore I am.
 In Gendlin's terms, "the content identified and described" and "the process of experience per se."
 　The latter is "the creation of new meaning."
 　This is, in Spinoza's terms, "the idea of an idea."
 　[infinite regress] is avoided because "the conception of the conception of the conception" corresponds to "the conception of the conception."
 　The "conception of a conception" is the IOFI point, which is a multi-scheme
