Thoughts in the negative form give rise to that behavior.
>"Thoughts in the negative form give rise to the action. But only if the subject relates to a strong desire." This seems to be the scientific view.
> Strong cravings include, for example, cigarettes and chocolate (Erskin J.A.K et. al. 2010, ① ②).
> For example, in the experiment (2) by Professor Erskine, he had the "thinking about chocolate" team, the "thinking about not eating chocolate" team, and the "about what you like" team taste and evaluate chocolate. The experiment was not really to evaluate, but to find out how much each group ate. The result was that the "team that thinks about not eating chocolate" ate the most.
https://nullowlife.com/nouhiteikei/

Effects of thought suppression on eating behaviour in restrained and non-restrained eaters
>Recent research has shown that suppressing food related thoughts can cause a subsequent increase in consumption relative to groups not suppressing, or thinking about food. The present study examined whether the effects of thought suppression on subsequent eating behaviour would interact with participants restrained eating status. One hundred and sixteen female participants were split into three groups. One third suppressed thoughts of chocolate, one third thought about chocolate and the final third thought about anything they wished. Following this, participants took part in a task where they rated two brands of chocolate on several taste characteristics. Participants were unaware that the dependent variable was the amount of chocolate consumed and not taste preference. Participants also completed measures of dietary restraint, craving, guilt and thought suppression. Results indicated that restrained eaters in the suppression condition consumed significantly more chocolate than restrained eaters in the expression or control condition. Participants low on restraint ate statistically equivalent amounts in all three groups. In addition, participants reporting frequent use of thought suppression (assessed by the White Bear Suppression Inventory) reported greater chocolate cravings.
(DeepL) Recent studies have shown that suppressing thoughts about food increases subsequent consumption compared to the uninhibited or no-thinking-about-food groups. The present study examined whether the effects of thought suppression on subsequent eating behavior interacted with the participants' state of food suppression. 16 female participants were divided into 3 groups: 1/3 suppressed thoughts about chocolate, 1/3 thought about chocolate, and the last 1/3 thought about their favorite The participants were then divided into three groups. Participants then participated in a task in which they rated two brands of chocolate on several taste characteristics. Participants were unaware that the dependent variable was chocolate consumption and not taste preferences. Participants also engaged in measures of dietary restriction, craving, guilt, and thought suppression. Results indicated that inhibited eaters in the restraint condition consumed significantly more chocolate than did inhibited eaters in the expression or control conditions. Participants with low self-control ate statistically the same amount of chocolate in all three groups. In addition, participants who reported more frequent use of thought suppression (as assessed by the White Bear Suppression Inventory) reported a stronger craving for chocolate.

[否定形]
[Do not]
[禁止]
[抑制]
