How to introduce structure into a one-dimensional timeline
How is [cotoami] doing?
　reply: Referential relationships between statements
　　That's why the "buzz" is created bottom-up [nishio.icon].
　pin
　Add a statement that becomes a relationship between the pin
　Creating a chat room on the topic

How to introduce structure into a one-dimensional timeline
>Like a normal chat, what you just post on the timeline becomes flat, structureless, chronological information. This is the so-called flow state. The information is flowing and you will always see only the latest information.
>What would be a natural way to introduce structure into a [one-dimensional timeline] that is constantly flowing?
	>The structure of the context (topic) is created on top of the time series by replying/replying to the existing information.
	>The next step in the process of replying is to pin what you think is important on the timeline (in Cotoami, individual statements are called "koto") and ensure that they do not drift away.
 >Once the starting point information has been created in the pin, add things to it that will form a has-a relationship to create a structure.
 > Finally, kotonoma (categories) of koto/"kotonoma" are, in the context of chat, so-called chat rooms/chat timelines dedicated to the topic/discussion that can be further explored. At the same time, kotonomas can be treated like kotos, so they can be connected to each other and posted on timelines.
 >The ultimate goal of [Cotoami] is to create this network of kotonoma.
[How do we extract stock-able knowledge from casual conversation? - Fibitec https://ubiteku.oinker.me/2018/02/07/how-to-make-structure-from-everyday-chat-conversation/]

The above page is based on the premise of chatting, and the chat tool itself.
In [well], a "diary page" is created on Scrapbox, a page that is created and flows every day. Let's think of this as flow information equivalent to chat!
　reply: Referential relationships between statements
　　On Scrapbox, bulleted trees can represent replying relationships between statements.
　pin
　　The equivalent would be "cutting out the lively topics on the diary page to a separate page with a title.
　Add a statement that becomes a relationship between the pin
　　The equivalent would be adding links between pages.
　Creating a chat room on the topic
　　In Scrapbox, all pages are editable, so they can all be considered chat rooms like diary pages.

Okay, there's a common structure.
In using Scrapbox, there is no stand-alone "place to have a conversation without a title".
　Prepare a diary page, etc., and use it as a chat room.
　Use dedicated chat tools such as Slack together
It would be in the form of something such as
