KJ Method Study Session @ Loftwork
	Held 12/2 (Fri.) 14:00-17:30
	[** Advance Materials].
		[KJ Method Study Session @ Loftwork_Lecture Material v1]
　　This is version 1 of the 1-hour lecture material, please read it in advance.
　　This will not fit in the presentation time, so I will make a short version of this document assuming you have read it beforehand and use it on the day of the presentation.
	[** Materials on the day of the event]
		[KJ Method Study Group @ Loftwork_Lecture Material v2].
 [** 2022-12-02 on the day of the event].
 　When I looked on the morning of the day, a surprising majority of people had started making nets.
 　　The only pre-task was to make 25 labels and read the lecture material, which was very active and good!
 　I went around commenting on the state of affairs as of this morning, as there was no merit in procrastinating.
 　　[KJ Method Study Session @ Loftwork Pre-map comments].
 　lecture
 　[KJ Method Study Group @ Loftwork_Lecture Material v2].
 		[Zoom comments during the KJ method study group @ Loftwork lecture].
 　During the workshop, questions were accepted via Slack and answered via Slack.
 		[KJ method study group @ Loftwork Slack during private work].
 	Questions via Zoom + answers to missed questions via Slack
 		KJ Method Study Session @ Loftwork Q&A] [KJ Method Study Session @ Loftwork Q&A


[** record of preparation process].
　No need to read it after this point to be a part of the study group.
　I recommend it to anyone who wants to "go deeper."


	2022-05-21~ Digging up past articles and new ideas
	[Draft addition to ""Group Formation Needs a Change of Mindset""]
	[There is no incorrect placement of cards in the KJ method.]
	[25 sheets might be a good first step to experience the KJ method].
	[It's not the sticky note that matters.]
	[Parable of the Floating Weeds and Trees]
　[compare KJ-method grouping to clay].
　Don't group top-down" is a bad pattern for "[negative instructions are] hard to understand."
　[bottom-up grouping can be interrupted].
　[Suggested additions to make a nameplate when the sticky notes are enormous].
　[What is emotion?]
	[On preconceived notions].
	Not organized yet, but [verb to explain] seems relevant (TODO).
	[metaphor of the meter in the mind].
	[The KJ method is not powerful without individual work].
 [Shadow of a word]
 2022-06-24
		Since it was my turn for Cybozu Lab's internal study session, I decided to introduce the contents of "[KJ method] Let the chaos speak for itself" just for the sake of it.
	　[Study group "Let the chaos speak for itself"]
　I didn't finish in an hour, so I continued explaining.
　2022-07-01 [Exploration Net (Fireworks) Study Session].
 [Success is success.]
 [It takes more than 100 sheets to really understand the KJ method].
	[Illustration of the relationship by Jiro Kawakita].
	[Fog of Silence]
	[Up to 800 labels assembled by Jiro Kawakita at once].
	[Six-round cumulative KJ method is not even 1%].
	Late 2022-06 Study group plans are taking shape.
　[It's hard to verbalize what you don't understand.]
　　[Don't put time pressure on label making].
　　I'm not going to do one round of narrowly defined KJ method.
　　Whether you call it an exploration net (fireworks) or not, it will be something close to that!
　[Jiro Kawakita's example of information granularity].
　[Even if you learn only the KJ method, it is difficult to put it into practice every day if you have not mastered the daily fireworks report].
　[Occasional collecting]
　[I'm confused because I seem to be in more than one group.]
	[On the correctness of the KJ method]
	[The birth of fireworks to think about.]
　[Bicycle parable]
　[It would be a shame not to put it in writing.]
　["Let the data speak for itself" is not "let the facts speak for themselves."]
　[How far do we go in criticizing the ideas we get and where do we terminate them?]
　[A cylinder looks like a circle or a square, but it is neither a circle nor a square].
　[eye on the walk and eye on the plane].
	[KJ method from surveys is the most difficult].
　[After all, isn't everything subjective to you?"]
　[I don't know if the client's output is correct.]
　2022-07-08 Deadline for pre-submission questionnaire for students
	[The term "KJ method" is ambiguous.]
	[The mission of the nameplate]
	[Lone wolves are worth it.]
	[Place conflicting labels close together].
	[words connected by associative meanings].
	7/14~21 Preparation of lecture material: [KJ Method Study Group @ Loftwork_Lecture Material v1].
	2022-08-19 [KJ method study meeting @ Cybozu].
　　The event was postponed, so a study session was held earlier within Cybozu using the same lecture materials.
　　Questions added.
　2022-11-16 Meeting
　　The lecture material was to be a short 30 minute version.
　　　It is inefficient to use voice, a protocol with low information density, for one-way information transfer.
　　　I'll let you go read the previous version.
	　[Parable of the byways.]
	　[When to change the KJ Act front page].
			[When to change the front page of the KJ method (creation process)].
　2022-11-30 Rehearsal meeting
　　[KJ Method Study Group @ Loftwork_Lecture Material v2].
　　 Tried speaking, 31 minutes.
 　　Process: [create short version of lecture material].
　　　　I'm worried about the not-so-smooth part because time is tight unlike when I spoke at the Cybozu workshop... I'll have to record it once and get the kebab out of the way.
  A concept that has taken shape in discussions during the meeting, "Creating the Loftwork style [is] a means, not an end."
  　I felt [uncomfortable] when I saw the question "How do you think we should create the Loftwork style?" in the post-course survey.
  　For veterans who have developed their own style in accordance with their work, the appropriate question is "How can we share this style within the organization and not keep it to ourselves?
  　Not an appropriate question for someone new to the KJ method.
  　　I prefer content that I feel I have more control over.
　　They said some people thought the parable was funny.
　　　The story of focusing on metaphors and developing them in the world of metaphors is described in detail per [(6.2.4) Parables, Metaphors, and Analogies] in The Engineer's Guide to Intellectual Production.

2022-12-02 Day of the event
　When I looked on the morning of the day, a surprising majority of people had started making nets.
　　The only pre-task was to make 25 labels and read the lecture material, which was very active and good!
　　Maybe it was a good thing that each individual's situation was visualized and shared on Miro.
　　The fact that the lecturers and organizers each had their own nets in Miro may have also [shown them how to do it].
　I went around commenting on the state of affairs as of this morning, as there was no merit in procrastinating.
　　[KJ Method Study Session @ Loftwork Pre-map comments].
　lecture
　[KJ Method Study Group @ Loftwork_Lecture Material v2].
		[Zoom comments during the KJ method study group @ Loftwork lecture].
　During the workshop, questions were accepted via Slack and answered via Slack.
		[KJ method study group @ Loftwork Slack during private work].
	Questions via Zoom
		KJ Method Study Session @ Loftwork Q&A] [KJ Method Study Session @ Loftwork Q&A

On or after the day
	[Group formation goes from small teams to large teams].
	[Don't abstract too much.]
	[Ideas inspired by a single stimulus].
	2022-12-13 [Beyond the KJ Method] @ Cybozu
 [Name the Nishio's own style].
	[Bad Patterns in Group Formation]
　2022-12-16 [KJ method study group review study session]@Cybozu
　2023-01-18~
		[write later why you collected them].
		["summarize" and "put together"].
