The Parable of the Bow and Arrow
>[nishio https://twitter.com/nishio/status/1529033288937271296]: Recently, I saw an article on the internet somewhere, Nikkei or something, where someone was giving advice to students who are job hunting, and the parable of the bow and arrow was mentioned in the middle of the article. I'm not sure which one it was... I was talking about something else and the parable of the bow and arrow seemed very important to me, so I'd like to read it again and summarize it.

>[nishio https://twitter.com/nishio/status/1529117963160539137]: there it is [https://www3.nhk.or.jp/news/special/news_seminar/syukatsu/ syukatsu925/ Job Hunting Worries: Zero job offers...What should I do for the 23rd grad? Interview with Kotaro Abe, copywriter｜NHK Job Hunting Support News Seminar].

	>The power to draw the bow lies in the motivation within you and the reason why you want to work in the first place. Then, I think you should find the target of each company you are attracted to and set your sights on it. And if you consider what you have experienced so far as "your own field," I think it is very important to put it in your own words.
		[https://gyazo.com/af74c0e7dca7786d3176a9eb66b25742]
		>I was actually saying the same thing when I was looking for a job. If anything, I played the sport of football in my early teens because I felt very lonely and had a single-minded desire to connect with someone. I was playing football in my early teenage years because I wanted to connect with others, and I talked everywhere about the fundamental joy of feeling connected and united. For television, I would say, "We can create a sense of togetherness through images," and for advertising, I would say, "We can create a sense of togetherness through a variety of media. Although the branches and leaves were slightly different, none of them were lies, but true feelings.
  > I think everyone has their own original experience, their own strong magma. As long as we can show with words that "the fire of my heart is here," I don't think we should try to talk too much about the company.
  >Q: Are you saying that it's more important to know who you are than to research companies and take measures now?
  > A: From a corporate point of view, I think it is very interesting to know what this person's energy source is.

	If a person working for a company works 250 days a year, 8 hours a day, that's 2000 hours a year. Even if a job hunter spends a few hours researching a company, it is only 1/1000th of what a person who has worked for that company for several years would spend, and if you use that as a scaffold for [self-promotion], it won't work.
	　Moreover, people who "research [companies]" in this way tend to base their research on "information that other applicants can access in the same way," which they can obtain by searching the Internet, etc., so they are not differentiated from other applicants.
	What I'm saying in this article is to use your [passion] as the foundation for your self-promotion.
	　This has nothing to do with individual companies.
	　If you compare it to a tree, your passion and your own past experiences are the roots and trunk.
	　And that means adjusting the branches and leaves to suit the other company.

I've summarized the content of a recent live concert ([About the Unexplored Junior's Progress and the Unexplored Ecosystem]).
> "This is what I want to make! and appeal with high enthusiasm.
I was reminded of the parable of the bow and arrow when I wrote

relevance
　[true motive].
