Nodal Point of Thought 2022-05-25
from [Diary 2022-05-26].
Nodal Point of Thought 2022-05-25
Calibration Meeting Summary
　Looking at a phenomenon A, "This is 'subjective'.
　　Isn't this not good?
　　Isn't it [thought-provoking]?
　　I think you have taken a concrete [earth-smelling] phenomenon and turned it into a bleached abstract concept.
　"What, then, is 'subjectivity'?"
　　Isn't this a strange way to ask this question?
　　You shove all the concrete phenomena into a jar of abstract concepts, jumble them up, and then say, "What is this jar?"
　　　You mix all the drinks from the drink bar, and then you wonder, "What drink is this?" or "What else can I say except that it's a drink?"
　　　When you mix things up, you've ruined it.
　Specific Ex.
　　When you're trying to write something out on a sticky note, what size sticky note you choose is subjective."
　　　Sticky notes are stationery, so use what feels comfortable in your hand.
　　　Sticky notes of a particular size do not have a magical effect.
　　　It feels right."
　　　　This is subjective
　　　feel of a brush or pen
　　　　Some people put silicone sheets on their iPads.
　　　pen sound
　　　　I don't like the "squeak."
　　　　I hate blackboard chalk.
　　　　whiteboard marker
　　　corporeality
　[Common language]
　　feeling of being killed
　　'If you say you are killing, I assume that means the thing in front of it is alive, but how is it alive?'
　　　Like a plant, it sprouts, branches, and roots grow.
　　　They are killing this by shoving it in a box.
　　　Live trees and square blocks of wood
　　What good is it to be alive?"
　　　Developments.
　　　New ones are created.
　　lingua franca
　　　A is X." "Yes, X."
　　　　produces nothing
　　　A is X. Is it?"
　　　 [https://gyazo.com/425b7d4590c81d54a81064cc8fac1511]
    The fact that the two X's have different meanings allows us to delve into what is common and what is different, and it increases the resolution of the world.
    subdivision
    Different perspectives.

　Some people enjoy having different points of view and others don't.
　　If the cognitive resolution is high enough, we can see that "each person's way of thinking is different.
　　They look "the same" because they are seen through blurred glasses.
　　Understandable = "not recognizing differences in each other."
　　　This does not mean "no difference."
　　Some people are glad there is no difference.
　　Some people find it interesting because it's different.
　　　Interesting" is subjective and a matter of personal values.
　　　Different perspectives are beneficial to creation."
　　　　The idea that it is beneficial to disagree with different opinions
　　　　Is this another personal value?
　　　　Diversity also includes "not creating."

　What is creativity?
　　Is it creativity to paint the same picture every day?
　　If Mr. A paints a picture every day and Mr. B interprets it as "the same picture every day".
　　　In fact, for Mr. A, every day could be a new challenge.
　　　Mr. B just doesn't recognize the change.
　　　It happens all the time. Parents say things like, "My kids are playing micromanagement all the time, don't they ever get tired of doing the same thing all the time?"
　　　　Kids are making new things and trying new things every day.
　Can you recognize if you have creativity?
　Is "creativity" real in the first place?
　　Fun to make."
　　What we make is useful to society.
　　The one who's having so much fun making it."
　　Made of."
　　Does "creativity" itself exist that is different from these?
　　　Unobservable?
　　I feel like I'm [shoving everything into a jar] called "creativity."
　Convenient at first
　　I'm going to put everything that is relevant into that box.
　　A lot of stuff in the box is becoming a lot of stuff.
　　They'll start putting things in boxes in a messy way.
　　It's not good.
　　I think we need to get it out and reorganize it.
　　[creative regress]
　　　Massage to relieve stiff words
　　　Disassemble the finished Lego
　　　Calibration?
　　　　Metaphor of sensor madness.
　　　　You won't even know it's buggy.
　　Difference between a box and a jar
　　　Boxes are cardboard boxes that you can put things in and then take them out again.
　　　Jars get mixed up with liquid, can't get the original out.
　The "human bug" is also in the [jumble pot].
　　Human G
　　Assuming a human is a bug when human behavior deviates from the algorithm assumes the algorithm is correct.
　Difference between a two-person conversation and a three-person conversation
　　With three people, when A is done talking, there's a lot of air-reading about whether B or C is going to speak.
　　I have a hard time reading the atmosphere.
　If the conversation between A and B is lively, and the conversation between B and C is lively, is the conversation between A and C also lively?
　　Not necessarily, the catch can't start without someone throwing the ball first.
　I want a rebuttal = observations from a different point of view.
　　If it's not the same, it can't be anything else.
　　　certainly
　　Requires trust in the other party
　　　Trust is an estimate of value
　　Understanding different opinions comes at a cost, and if you don't believe that there is value to be gained from understanding at a cost, you will not create the behavior to understand.
　　Neglected, not paying the cost, through
　　Twitter posts, countless, can't pay the cost of all of them.
　　Yes man = one who does not speak differently.
　　　Possible observation coverage issues
　　　When B is a yes-man from A's point of view, it is not that B is a yes-man, but that A may avoid giving his opinion because, from B's point of view, A is "a person whose opinions incur annoying social costs".
　Is subjective estimation a human bug?
　　If it's "a human bug that makes it impossible to estimate correctly because of subjective estimates when objective estimates are possible..."
　　But I don't think an "objective estimate" is possible, there are too many uncertainties.
　　If neither subjective nor objective estimates are accurate, then it's more fun to do it subjectively, and you get more out of the fun.
　　　In this case, the assumption that "objective estimates must be made" bugs me.

