What are sentiments?
from [KJ Method Study Group @ Loftwork].

The part where Jiro Kawakita explains the word "passion".
	>What is the most important thing to pay attention to? The most important thing is to collect pieces of paper that you feel close to each other, and in this case, the ability to "feel" must come first. However, people who are unfamiliar with this process try to collect them based on logic before the ability to perceive them. In other words, they think, "For this reason, it would be better to collect the A piece of paper and the B piece of paper in one place. When logic comes first, the first step in group formation is to do the opposite of the KJ method, which results in a sham group formation.
	>Let's call the method of collecting information by thinking theoretically "thinking with reason. In contrast, the ability to think outside of reason is called "emotional thinking. This may not be a psychologically rigorous term, but it is a distinction that is fundamentally necessary for the KJ method. In such a case, the emotions must be gathered first. Reason comes later... The person who wants to divide into large groups and then gradually divide into smaller groups has the idea of dividing these pieces of paper into three or four groups at first, even before the sorting is done. That is why they are able to sort them into large groups. This way, nothing new can come out. The protagonist is merely imposing his own classification framework on a group of scraps of paper. In other words, the protagonist is merely following his own preconceived, dogmatic framework, with a flock of paperclips as his retainers.
　[Continuation of the Idea Method] p.58-60

　They call "something other than [reason]" "[emotion]."
　　He didn't elaborate much on specifics.
　　Instead of "collect A and B for a reason," we should "collect them and then think about why we collected them."
　　　If you try to collect reasons first, "reasons that have already been verbalized" are given priority, and since they are just arranged according to the structure that has already been verbalized, of course "this doesn't produce anything new".
　Eliminate [stereotypes] and [preconceptions]."
　　Some people mistake this for "eliminating [subjectivity]," which I don't think is a very good expression.
		relevance
			[On preconceived notions].
			[After all, isn't everything subjective to you?"]
