Environment for evaluation of the quality of actions
from [Diary 2022-05-30].
Environment for evaluation of the quality of actions
>[YoshifumiSeki https://twitter.com/YoshifumiSeki/status/1530950141527851008]: It is very difficult to be adopted as an "Unexplored Junior", and of course there are many things that cannot be detected only by an interview and a proposal. One of the things that can make the difference is the fact that "if you want to do that kikaku, you already made some progress regardless of the application for the junior project, right? is a big factor.

>[YoshifumiSeki https://twitter.com/YoshifumiSeki/status/1530950610635620354]: As a result, it has been said that updates to projects that are already in action are more likely to be adopted, and there is an evaluation of the quality of the actions already taken. There is also an evaluation of the quality of the actions that have already been taken, which means that there is an assumption that the project has already received good guidance, so there is a big dependence on the environment.

>[YoshifumiSeki https://twitter.com/YoshifumiSeki/status/1530950865385066497]: I would like to do this because we have not been able to provide information on the differences in this environment, that is, people who want to do something but don't know how to do it or what kind of action they should take. I would like to work on this, because we are not able to provide information for those who want to do something but do not know how to do it or what kind of action to take.

>[YoshifumiSeki https://twitter.com/YoshifumiSeki/status/1530951426247376896]: I know there are a lot of similarities between talking about scaling as a startup and first actions to realize an idea, I wonder if there are some different methodologies in that case, and if we can do something to support that, I don't know.

>[YoshifumiSeki https://twitter.com/YoshifumiSeki/status/1530953079633645570]: I think that there are schools and communities that encourage this kind of action that is easily evaluated by unexplored juniors as an activity. This is a good way to realize the idea. I don't think it's a cozy relationship or a hack, because it's a good way to realize an idea and a place where mentors are likely to think of it.

>[_anharu https://twitter.com/_anharu/status/1531057718286757888]: learned this in 4 applications to the Unexplored Junior and got through to the Unexplored Junior.
>I was hoping that the official website of the unexplored junior would provide effective information,
>I was actually able to see all sorts of articles.
>Do you have a prototype?" and they say, "What? What?" I think there are some people who will be like "What?
>jr.mitou.org/download#tips twitter.com/yoshifumiseki/…

>[_anharu https://twitter.com/_anharu/status/1531059684740055040]: Of course, this is not a creepy senior appeal that I've been struggling with,
>Know what you need to know in advance.
>I'm just saying that it's better to spend time developing ideas, improving techniques, and taking action.
># Unexplored Jr.

