Use it yourself and keep improving it.
[https://togetter.com/li/1334884 HCI研究おもちゃ論争 - Togetter]
[https://anond.hatelabo.jp/20190329034939 After spending two years in a popular neglected & miscellaneous lab in the Department of Information Science and Systems Informatics at the University of Tokyo] ([https://anond.hatelabo.jp/20190330134453 postscript])

I think this is an interesting point here.
	I use what I make.
		(Related [Use your own deliverables])
		If you don't use it yourself, "integrity dictates that you make an effort to have the research results put in."
	別の表現
		Make the deliverables available to others than yourself
		詳細な制作方法を公開する
		Use it yourself and keep improving it.
　>[https://twitter.com/shokai/status/1113024808638283776 @shokai]: "I feel like this field of research ([HCI]) is full of twisting logic and justification for seemingly useless toys."
 >I can't help but wonder what this is all about now.
 >You're not using what you've made, and you're thinking defensively at the same time when you're making up the concept.
 >[新規性と有用性は別]要素
 >Peer review looks for novelty and holes in the experiments and methods of argumentation.
 >Anything can be made useful by specifying extreme situations (HCI makes this easy thanks to the Human element).
 >The best tactic to create novelty easily is to make strange things that even you don't use because of these factors.
 >I personally call it [curiosity].
 >I would think that in other engineering fields, the value of the extreme situation setting itself would be sifted to some extent by market needs (such as the fact that such a network configuration is useless).
 >The extreme situation setting by the Human element is strong because it can be used as an invincible shield that can never be beaten if it is well-spoken, poly-colored, etc.
 >[* If you set up an extreme situation, I think the integrity is whether or not you are making an effort to get your research results in there.
 >[* make the results available to others than yourself], [* publish detailed production methods], [* use it yourself and keep improving it], etc., if you don't see any of these
 >It looks like you're toying with the Human element to make it useful.
 >It's just that it's not fair to act like it's convenient when you don't think it's convenient or necessary yourself.
 >That's all there is to it.

関連
　[/masui/ Don't publish what you don't use].
