word created by retaining the first syllable (or two) of a word
In the course of the meeting for the [KJ method study group @ Loftwork], I was told that the phrase "focus your attention on the shadow of the leaves, not the leaves" appears in "[The Sound of Airflow Rumbling - A Symphonic Commune]".

When I first heard this, I associated it with the idea that "the 'word' is also a 'leaf'".
	In the context of [the process of experience and the creation of meaning], words are symbols (S), then the "shadow of a word" would be [felt meaning] (F).
	　[https://gyazo.com/835604a3a1abb85786d0186b6f35e458]

After a while, I read [Tanka Class for the mediocre by the geniuses], and what was written, "[Amateurs who try to follow the formulas cut down particles and cut them into pieces]," was so illustrative that I tried various ways to fit the formulas without cutting down particles.
　So I thought.
　　If you create version 1 of a tanka poem and have to cut it down to fit it into a standard form because it is too many characters.
　　If you pay attention only to the words written there, you feel that particles have only a small meaning compared to nouns, verbs, and other words that have a larger meaning, so you cut out particles
　　This means discarding the branches that connect the leaves, so the leaves will fall apart
　　[https://gyazo.com/63be22135ca1ae169709c94a2ce3fdd3]
　My thoughts when I'm trying to fit it into a formula without cutting out the particles.
　　[https://gyazo.com/4ae9d4533a95a3739a661a9f3d9aebaf]
　　The focus of the eye shifts away from the word (leaf), thereby shifting the focus to what was meant to be said (shadow), and then new words are created to try to express it
　　If you do this for just one leaf, it becomes "replace the word with a synonym".
　　There's a sense of "nice" when you see the shadows of a larger area, not just one leaf.
　　　The ideal would be to see the shadow of an entire neck of the woods.
　　　There is the shadow of an entire poem, a myriad of branches that cast shadows on the place, from which we select the one that fits the rhythm of the formula.
　　　I'm just starting out, so it's rare that I get to see a whole necklace, I'm looking at shadows of 7 notes or something.
　　We can think of what's going on here as [creative regress].

In "The Sound of Air Currents," he explains the concept of "unfocused viewing" in this way: "The sound of the airflow is the sound of the airflow, and the airflow is the sound of the air.
 A focused view concentrates on the individual abstracted from the whole.
 　This means separating the "figure" from the "ground" and concentrating on the "figure"
 　Unconsciously ignoring the "ground" part.
 　In the focus view, we see only "what is in the framework we have beforehand".
 　The unfocused view is "[a] free posture toward the unexpected."
