Success is the source of success
There is a saying, "[Failure is the source of success]," but why are there so many instances where a closer look at reality leads one to want to say, "Success is the source of success? Jiro Kawakita] examined this question in this article.

summary
	[Failures] are often not deeply thought through in advance.
	So when a failure occurs, we don't know "where did it deviate from our assumptions?
	It's hard to look back because it's hard to face failure
　On the other hand, if you think deeply beforehand, you have a higher chance of overall success
　Finally succeeded and have the presence of mind to reflect on local failures
　In such cases, for him, "failure is the source of success.
　　[nishio.icon]This is seen as "successful" by outsiders who can't see the details, so "success is success"
　　　Related to [Trial and error is hard to see
　　　Lots of small failures lead to big successes, but it's hard for others to see the small failures

Quotes (bold emphasis added by Nishio)
>The more important something is, the more it will cost you if you fail. It is demoralizing. You can't even muster up the energy to reflect on your failures. And if you reflect on it, you will feel the pain of failure all over again. In other words, "I don't even want to remember. In addition, people who are sore losers do not want to admit their failures as failures in the first place. These various psychological conditions prevent us from learning valuable lessons for the future from our reflections on our failures. Most people, unless they are very insensitive, are familiar with this situation.

>But in addition to these, there are other circumstances that are surprisingly unnoticed. [In a great many cases of failure, people do not think things through before they do them. If you don't have the capacity to think, then you have no choice. Instead, they often fail to do so out of carelessness or negligence. That is why they fail.
>Because they have not done their research and thought things through beforehand, when they fail, they have no clue as to what went wrong or how things went wrong, even if they were to reflect on their failure. They are unable to reflect on the true depths of their failures, and are only able to recognize the root of their failures in the most superficial direct causes or accidental misfortunes.
>On the contrary, successful cases are often the result of careful research and thought in advance. So, we can understand why they succeeded. Not only that, but we can often think of [* local failures here and there included in the overall success]. This is also because the overall success has opened their minds to the world and they have the presence of mind to recognize their failures. In such cases, "Failure is the source of success" literally applies. There is a big difference between this saying and the one that often serves only as a self-defense or sore loser for those who have failed.
>From here, we should realize the following truth. We can often achieve a small amount of work without making a deep judgment by using the KJ method. But while some people do not learn much from their small accomplishments, others learn a great many lessons. This big difference comes from whether or not they made the effort to make the decision and plan.
[KJ method: Let the chaos speak for itself] p.50

relevance
	[Fog of Silence]
　　Setbacks ruin many people, but a very few make the leap from frustration and guilt to great enlightenment.
