Introduction to Clean Language
[https://gyazo.com/b382e8813f92c98a92923ccbc2660a0a]
	Introduction to Clean Language: A New Coaching Technique Based on the 12 Questions
	[Amazon https://amzn.to/3MS0aoC]
	Bought on 2014-10-22.
	　I think it was the only Japanese book on clean language at the time.

---
Written on [Facebook https://www.facebook.com/nishiohirokazu/posts/10206193953984343] on [2015-06-15] and reprinted on 2017-06-15

After days of learning and practicing [clean facilitation], I thought I'd read the introduction to [clean language] again.
 The important concept that "[don't] delve into the problem, focusing on the problem and detailing it causes suffering" is not introduced, or at least treated so little that you can't find it at a cursory glance #PRO model
  There is an implicit assumption, especially for someone like me with an engineering background, that "finding [the problem] and fleshing it out is a good thing.
  We need to be able to recognize the "blind spot" that doing it to humans is actually harmful.
  #Digging into matters of the heart is harmful.

 In the explanation of [symbolic modeling] in Western books ([Metaphors in Mind]), they start with "[five basic questions]," and those five questions are used in heavy rotation in the actual sessions.
 　Two of the five questions are location questions, and the name question is rather rare, so you are essentially repeating three of them.
  This book, on the other hand, asks "12 basic questions."
  　I probably can't memorize this all of a sudden, and I find it difficult to decide "which one" to choose from the 12 questions in the field.

 For many people, the low psychological barrier would be "do it to yourself > use it on others > take it on yourself".
 	I am sure that the best way to understand is to "take it on yourself," but it is good to have a "do it yourself" as the next best thing, and this book is a good place to have activities to do and see for yourself.
  But the first step is "What am I like when I'm focused and learning?" and the staircase is too big, starting with answering the question, "What am I like when I am concentrating on learning?
  　(Added 2022-06-15) If you don't dig deep enough with the detailing question and then ask the metaphor question, you'll get an appropriate metaphor in your head.
  　Related: [two choice questions that elicit metaphors].
  Practitioners and "takers" have a sense of security through the experience of saying an analogy and having it accepted without scrutiny, but there may be many who don't. I think it would be better to take it a step further. I think it would be better to take things a step further.

 There is not much written about procedures and precautions in using it for others.
 	How to start, how to end, when and how to use it, etc.
  For many people, "using it on others" is a lower psychological barrier than "taking it on yourself," so they tend to try to use it
  	It's easier to start with a vague idea than to say explicitly, "Let me practice this kind of session," and we tend to choose that because it's less of a barrier.
   Using it that way can make them uncomfortable, it's happened a few times.
  It's related to the first thing I wrote about "digging into the problem," but if you use it wrong, it can bring out negative feelings in the other person.
  More examples of pitfalls should be collected and people should be educated to avoid pitfalls.

	We need to create something that breaks down the steps to create the first metaphor more and makes the path so gentle that you can get there even if you do it alone.

	[tokoroten.icon]: I see. Is there a process of problem decomposition->denial of one's present->visualization of sunk costs->rejection?
		[nishio.icon]: it could be simpler: visualize the problem -> discomfort -> rejection
		[tokoroten.icon]: I think it is difficult to distinguish between "visualizing the problem" and "accusing someone of neglecting the problem". Because "visualizing the problem" is routinely used as a euphemism.

	It is reasonable to have them first focus on [synesthetic] expressions as training to create [metaphors].
		For example, "Find five examples of visual representations of things that cannot be observed visually. Example: yellow voice."
		You know, my wife once told me about a class she took on "creating new [onomatopoeia]". That might be useful too.

	Medicines can be poison if used in the wrong way. Those who handle medicines must be knowledgeable and ethical.


