It's good to have a sense of what to talk about at an internal study session on "Let Chaos Speak."
[kei.icon]What would you like to see happen in this conversation?
[nishio.icon] It's good to have a sense of what to talk about at an internal study session on "Let the chaos speak for itself.
[KEI.ICON]What kind of "streak" is that "streak"?
[nishio.icon]The story is about what you start with and what you land on via what.
[kei.icon]What kind of "story" is that "story"?
[nishio.icon]Talk about an hour. Oh yeah, you can't estimate the volume in the end, so you can't decide how to end it.
[kei.icon]Anything else about that "story"?
[nishio.icon]I want to make sure my understanding is solid by doing that.
[kei.icon]What kind of "I" is that "I"?
[nishio.icon]I'm going to do a study session on the KJ method for another matter, so I want to make sure I have a good understanding of it.
[kei.icon]What kind of "understanding" is that "understanding"?
[nishio.icon]Indeed. To be able to answer questions from the participants and to improve the future lives of the participants who hear the answers.
[kei.icon]What kind of "answer" is that "answer"?
[nishio.icon]It needs to be convincing for the participants.
[kei.icon]What kind of "student" is that "student"?
[nishio.icon]People who have experienced the KJ method itself but are not quite sure if it's a good idea.
[kei.icon]What kind of "KJ method" is that "KJ method"?
[nishio.icon]Surely this is a low-resolution concept, though it's clumsily lumped under the term KJ method. maybe it's better to focus on the ends, since KJ method is a means, not an end.
[kei.icon]Is there anything else about that "KJ method"?
[nishio.icon]Surprisingly, about 90% of Jiro Kawakita's own work is not KJ method but expedition net
[kei.icon]Where is that "KJ method"?
[nishio.icon]First, it was introduced in partisanship, then it became a long seller with its idea method, various books were published, and 20 years later, "Let Chaos Speak" was published.
[kei.icon]What is it that you value?
[nishio.icon]There are various updates to "Let Chaos Speak" compared to the well-read "Ideas", and if more people know about it, those who did not understand it well at the "Ideas" stage will have a better chance to understand it
[kei.icon]What is the relationship between that "let it speak" and "let chaos speak"?
[nishio.icon]同じ本を指してる
[kei.icon]
 > There are many updates to "Let Chaos Speak" compared to the well-read "Ideas", and if more people know about it, those who didn't understand it well at the "Ideas" stage will have a better chance to understand it.
 What kind of "chaos to speak of" is this "chaos to speak of"?
[nishio.icon]The paper is devoted to talking about W-type problem-solving methods, exploratory studies, and exploratory nets, not just the KJ method.
[kei.icon]Where is that "KJ method"?
[nishio.icon]Distributed in three places, first the narrow KJ method, then the cumulative KJ method, with a light touch on what we do in groups.
[kei.icon]What is that "KJ method" like?
[nishio.icon]To use Jiro Kawakita's words, it's an easy way out of the fog of blindness.
[kei.icon]
 > There are many updates to "Let Chaos Speak" compared to the well-read "Ideas", and if more people know about it, those who didn't understand it well at the "Ideas" stage will have a better chance to understand it.
 What else can you tell us about this "let chaos speak"?
[nishio.icon]"Chaos" or dealing with "a large amount of data that is beyond your capacity. When you recognize it as negative chaos, your mind unconsciously shuts out information. By recognizing the large amount of data as "something that comes out of it," or "something that speaks to you," it is beneficial to have the attitude of "What does it speak to me? It is beneficial to have an attitude of mind that says, "What does it tell us?
[kei.icon]What kind of "chaos" is that "chaos"?
[nishio.icon]Even with the same amount of data, new things are more likely to be created if things that seem to be related are placed close together than if they are shuffled and arranged in a square, and the reason for this is that new information is expressed in a non-verbal way by "placing them close together" and the question is "Why is this gathered? Why is this coming together?" and the question prompts verbalization.
[kei.icon]
 > "Chaos", or dealing with "a large amount of data beyond your capacity". If you perceive it as negative chaos, your mind unconsciously shuts out information. By recognizing massive amounts of data as "something that comes out of it," or "something that speaks to you," it is beneficial to have an attitude of "What does it speak to me? It is beneficial to have an attitude of mind that says, "What does it tell us?
 Is there anything else you can tell us about this "chaos"?
[nishio.icon]Chaos is an important keyword, so maybe we can dig a little deeper into what Jiro Kawakita says.
[kei.icon]Where is that "chaos"?
[nishio.icon]Not the label itself, but the "shadow" that is "behind" the label, if you want to use a positional metaphor to describe it.
[kei.icon]
 > Chaos is an important key word, so maybe we can dig a little deeper into what Jiro Kawakita says.
 How do you know about this "chaos"?
[nishio.icon]We need to train ourselves to pay attention not to the words themselves, but to what is behind them.
[kei.icon]
 > Chaos is an important key word, so maybe we can dig a little deeper into what Jiro Kawakita says.
 Where does this "chaos" come from?
[nishio.icon]Those who think of chaos negatively may perceive it as chaos coming from outside of themselves and attacking them. Those who think of chaos positively may see it as a kind of fountain of creativity rising from within. Fountain or plant metaphor.
[kei.icon]What does that "chaos" look like?

For some reason, the export to Scrapbox was interrupted halfway through.


Land of abundance
nisbot
> There are many updates to "Let Chaos Speak" compared to the well-read "Ideas", and if more people know about it, those who didn't understand it well at the "Ideas" stage will have a better chance to understand it.
What kind of "let it speak" is this "let it speak"?
Plants grow out of the rich earth.
nisbot
> There are many updates to "Let Chaos Speak" compared to the well-read "Ideas", and if more people know about it, those who didn't understand it well at the "Ideas" stage will have a better chance to understand it.
Where is this "let chaos speak"?
I have it, it's not in the hands of many people because it's expensive and thick, but the content is useful to reach many people
nisbot
> There are many updates to "Let Chaos Speak" compared to the well-read "Ideas", and if more people know about it, those who didn't understand it well at the "Ideas" stage will have a better chance to understand it.
How do you know this "let chaos speak"?
I don't remember how I knew. In terms of how you know the content, read on.
nisbot
> There are many updates to "Let Chaos Speak" compared to the well-read "Ideas", and if more people know about it, those who didn't understand it well at the "Ideas" stage will have a better chance to understand it.
What do you hope will happen regarding this "let chaos speak"?
I'd like to see it chopped into smaller units and widely distributed.
nisbot
What needs to happen to "let chaos speak" for that to happen?
It needs to be chopped, and there is no point in simply storing a huge amount of chopped products in a warehouse, so a system is needed to get them to the people who need them.
nisbot
As for "let chaos speak," can it?
At any rate, it seems like a good idea to take the first step of reaching the "people in need" who are in front of us right now.

https://keicho.netlify.app/#talk=hZwFAlDvMzBnEK3yy8Ia
#KeichobotLog
