Study Group "Let the Chaos Speak for Itself
Study Group "Let the Chaos Speak for Itself
　2022-06-24
	Explanation of the book "[KJ-ho: Let Chaos Speak for Itself]" written by Jiro Kawakita, the originator of the KJ method.
　　If the subtitle is deleted, it is indistinguishable from the KJ method as a method, so hereafter it will be called "Let Chaos Speak" or "Chaos Book".
　　[https://gyazo.com/03b2ffa4d5d01a904014a0b677bfdad8]
	Previously, we have been studying [the experience process and the creation of meaning].
		This was an American philosopher's view of the linguistic process.
	From this time onward, we will look at it from the perspective of a Japanese cultural anthropologist.

川喜田二郎の著書
　He is best known for his book "Ideas," which was written very early in his career.
 "[Party Science] How to Develop Human Creativity" (1964, 44).
 　At the time, it was called the "[Paper Kill Law]."
 [Ideas] for Creativity Development" (Chuko Shinsho, 1967, revised 2017, Chuko Bunko, 1984)
		It was introduced here under the name of the KJ method.
 Development and Application of the KJ Method" (Chuko Shinsho, 1970)
 　The "Idea Method" sold so well that people started asking me to teach them how to train in the KJ Method, so I wrote it.
 [From research to creation (Kodansha Gendai Shinsho, 1977)
 	The KJ method was created and popularized as a way to assemble data, but examples of successful use are rare, so why is that? The "information gathering place" in front of you is the problem.
 	> If the quality of the original label data used as material for the KJ method is poor, the results are irredeemable. (p.29)
 [KJ method, let the chaos speak for itself] (1986, 66, Chuo Koron Co., Ltd.)
 If the publication of partisanship is 0 years old at the moment of the birth of the KJ method,
 　At two years old, "[the idea method]" came out and was named the "KJ method."
 　When I was 13, I said, "It's important to collect information before that," and [Exploratory Studies in "Knowledge"] came out.
 　At the age of 22, he published a compilation book with the KJ method as the main title, "[Let the chaos speak for itself]".
 Most people in the world read only books at age 2.
 　It would be for commercial reasons.
 　The "Idea Method," which is in mass circulation as a paperback, is easy to obtain and inexpensive: less than 800 yen.
 　The list price for "Let Chaos Speak" is 6800 yen, and the current market price is around 9000-15000 yen.
 This "let chaos speak" has been honed through more than 20 years of interaction with society.
 　There are many updates to the way they explain things.
	　Many people have read "The Idea Act" and didn't really understand it.
　　If the content of "Let Chaos Speak" reaches those people, they'll have a better chance of understanding it.

Book, "The KJ Method: Let Chaos Speak."
　It's just under 600 pages.
　　Let's take a quick look at the chapters.
　First, 9% for "Introduction" and "Coherence of Human Action".
　Next was "[* W-type problem-solving process]" at 12%.
　　Talk about how the problem-solving process is structured
　Then finally the KJ method comes into play.
　 9% for "[* one round of narrowly defined KJ method]"
　Two small chapters.
	　Evaluation and Public Assessment Methods, 4%.
	　KJ group work 3%.
	The percentage of "[* Method of coverage]" is quite large at 13%.
	　This is where the [exploratory net] comes in.
	　Exploratory netting was a method that had not yet been created during the "Ideation Method" era.
	Next, "[* Exploratory Net Re-enactment - Practical Application of the KJ Method]" 9%.
  It discusses the exploratory net in more depth.
  I call it "practicing the KJ method."
  Jiro Kawakita himself creates about 90% of his works not by the KJ method, but by the exploratory net.
　Small chapter "Conference Discussion Methods" 4% on brainstorming, etc.
　Large chapter "[* Cumulative KJ method]" 13%.
　 The chapter talks solidly about the six-round KJ method, which was discussed in "The Idea Method" and elsewhere.
　 Note that of Jiro Kawakita's 1,000 works over a 5-year period, only 8 of them used the cumulative KJ method.
　Largest chapter "[* KJ method as a thought]" 20%.
　 「展望」4%
　In other words, as a rough overall picture
　　1/4 for ideology, 1/4 for KJ method, 1/4 for interviews and exploratory nets, 1/8 for W-type problem-solving process, 1/8 for detailed related topics
　　Compared to the popularity of the term "KJ method," "W-type problem solving" and "Exploratorium Net" are not so well known.
　　　However, the W-type is already mentioned at the beginning of the "Idea Method," so if you know the KJ method and don't know the W-type, it's a touchstone that says, "You haven't read the Idea Method.
　　　The exploratory net has been gradually taking shape since 1969.
　　　　1970's "Continuing Ideas" only lightly touches on the importance of exploration
　　　　The 1977 "Explorations in Knowledge" has the heading "Exploratory Net."
　　　　In 1981, the implementation of the expedition net was subdivided and named "Thinking Fireworks".
　　　　In "Let Chaos Speak," 1986, he describes it as "the twin brother of the KJ method" (p. 327).
　　　　Q: What do you imagine "thinking fireworks" to be?
　　　　A: The nuance of "fireworks" having the image of "scattering in all directions from a central theme" and using it for the "thinking" process.
　　Instead of narrowing our vision to the narrowly defined "KJ method," we can better understand it by looking at its relationship to surrounding concepts.


Why the KJ method was created
　KJ method is a means, not an end
　So it is good to have a clear "purpose of using KJ method".
　What was Jiro Kawakita's purpose in creating the KJ method?
　[https://gyazo.com/9afd212b5ada6ca7ea3af8b259f6eb90]
 There are three things that hurt.
  For Business.
  for the sake of one's livelihood
  現代の危機の打開
  　[nishio.icon]This doesn't sound personal to me.
　What is work?
　　作業
　　task
	[cut1]

[https://gyazo.com/230499ce32bb461cb58a44883bc9ed1b]

　仕事
　　川喜田二郎は文化人類学者
　　Fieldwork is required.
　　Observe and record a wide variety of things
　　　This recorded material is called "data."
　　　Most of the data is unquantifiable
　　This large amount and variety of [* data] must be [* summarized
　　This was the challenge Jiro Kawakita faced in his work.
　生活
　　How to deal with life every day
　　How do I take control of the situation surrounding me?
　　And it's not just about what you know, but what those around you know as well.
　Breaking Through the Modern Crisis
　　Strong interest in international peace, having been mobilized for World War II as a single soldier.
　What is the "wall of work" in "I want to break the wall of work?"
　　I'm not confident in my judgment.
　　Escape into your own world of expertise and mastery.
　　Causes sectionalism
　　[nishio.icon]Just like fieldwork, it's important to "dive into a field you don't know much about and understand it.
　　　Feelings that don't stay in your [comfort zone
　Disruption of Lives
　　Councils, meetings, hard to come to a consensus.
　　be pressed for time
　　Relationship Troubles
　　Flood of information
　　Conversely, simple labor that does not require the use of judgment
　　[nishio.icon]「[* 判断]する力」が大事
　Summarize data and make a decision
　　Let chaos speak for itself (1.2.1 p.10)
  　>Do not let your judgment be clouded by [preconceived] notions, conventions, and wishful thinking [applied] to reality from the outset. (p.12)
			In reality, the opposite is dominant.
 　　Atehamism."
		Beliefs and desires are one thing, judgments are another.
 What is judgment?
 　[https://gyazo.com/c6313288906e1b98c9b5214a4968b249]
 　	p.23
 　This "act" is also called "one job."

Twelve stages of one's work
　Twelve stages of one job (2.6 p.28)
	[https://gyazo.com/9625347ead6e566fd50c9de1c3e4c12f]
　Twelve stages of one's work
　　1: 問題提起
　　2: 情報集め
　　3: Organize, classify, and store
　　summarize
 　　4: 要約化
 　　　Summarize homogeneous data
 　　　　Examples: statistics, listings
 　　5: 統合化
 　　　Bringing together heterogeneous data
 　　　The Japanese word "summarize" also mixes up the meaning of summarizing and analyzing homogeneous data and integrating heterogeneous data, so I separated the words and steps.
　　6: By-product processing
　　　The process of summarization and integration (especially the process of integration) produces by-products
　　　　Findings, suggestions, hypotheses
　　7: 情勢判断
　　　1~6 are "situational awareness"
　　　We need to "let ourselves be empty" and observe the data without making preconceived and hasty judgments.
　　　This step switches attitudes.
　　　What would you think about it based on your understanding of the situation?
 　　　Be yourself.
 　　　主体的判断
　　8: 決断
　　　Decide whether to do a solution to the issue.
　　plan
 　　9: Summary Plan
 　　10: Plan of procedure
 　　　They're splitting up the concept of "planning."
 　　　What can be done as a cohesive whole if the work is completed as planned?
 　　　　It's described as a "blueprint," but that's probably not the right word to convey it to a younger audience.
 　　　　Or should I say "blueprints?"
 　　　I make a distinction between "how it's structured" and "where to start and how to proceed."
　	11: 実施
 　12: Savor the Results
 　　Later, I came to think of it as "examination and verification -> appreciation.
　W型図解
　　I realized after the fact that it was a different depiction of the same thing, although of different provenance.
　　Both are problem-solving processes
　Chapter 3, "The W-Type Problem Solving Process," will take a closer look.
　　But first, one thing.

The accomplishment of one job is important.
　達成と達成体験の重要性(2.12 p.40)
	[https://gyazo.com/dd2765492031d47d25fe481c9cb222f5]
　一仕事
　　from beginning to end
　　On your own initiative and responsibility.
　　Achievement.
　　This is important
　Why is achievement important?
　　Fruits of Achievement
　　Process of Achievement
　Seek the fruits of your own initiative and responsibility.
　　When we share, we are aware that we are trying to achieve things in a coherent way
　　Overall coherence
　　　Blind Work Assignment
　　　sectionalism
　　[nishio.icon]There is a difference between coherence and "sticking to the original plan.
　　　While flexibly changing the plan according to newly obtained information
　　　Don't get swept up in new information and lose your axis.
　　Q1: Is coherence as a whole equivalent to what Cybozu calls "sympathy with ideals"?
　　Q2: "Do you agree/concur with the Next Action?" or something like that.
　　A: I think it has to do with the scale of "one job".
　　　For example, if you imagine a single job of about 3 months, there would be many times when you would decide on Next Action.
　　　In this case, even if all members agree on each timing, there may be cases where judgment is blurred in the direction of the time axis. It is a case where everyone is only looking at the most recent information that comes in.
　　　Cybozu's request that its members share the ideal of "creating a society overflowing with teamwork" helps to reduce this blurring of the time axis.
　　　For example, if a partner asks for requirement X, the difference between "We do requirement X because the partner asks for it! and "The requirement X that the partner wants has a negative impact on the realization of the ideal, so let's discuss whether we can somehow remove it".
　　　On the other hand, "coherence" here does not equal "sympathy with the ideals" of Cybozu.
　　　　The "ideal" is placed on a long-term basis, unrelated to the "beginning to end" of "a job."
　　　　The coherence of one job is only during one job.
　　　　Shared values with members who work together on one job
　　　　Image of creating the equivalent of "creating a society full of teamwork" for Cybozu with the members who do one job.
　　　　For example, in discussing the planning of an event with someone outside the company, we might say, "It would be nice if the participants of this event would think about 'trying it again on their own' after it is over. This would be an "ideal" shared with the team members of a single job.
　process
　　Experience of coherent accomplishment = achievement experience
　　mental enrichment
　　人間的成長
　　Generosity and inclusiveness
　　Occurrence of love and solidarity
　　Solidarity with the Environment
　　[nishio.icon] "I don't understand the second half," many people think.
　　　On "generosity and inclusion."
　　　　If we accumulate seemingly contradictory things instead of rejecting them immediately, we can find interpretations that make sense later on.
　　　　By experiencing this repeatedly, you will come to recognize it as "natural.
　　　　When you are confronted with an "opposing opinion" or "an opinion that contradicts your own ideas," instead of being repulsed by it, you say, "I'll include it because it's interesting.
　　　　See also: [dialectics], [no disagreement exists].
　　　On "Solidarity
　　　　I don't think it's unique to the KJ method.
　　　　Understanding and empathy for the other person's point of view grows among members who cooperate and focus their wisdom on a single goal.
　　　　The same effect that can be obtained by [Wai Gaya] or [Working Together].
　　　　The experience of having your label used in a large illustration that everyone else is making
　　　　　It blends harmoniously with the surrounding labels.
　　　　　Message of Acceptance to Society
　　　　　　↔ Alienation.
　　　Q: "Solidarity with the environment" Nishida philosophy-like.
　　　 A: There are a few references here and there to Nishida's philosophy from Jiro Kawakita's book, so this may have something to do with it.
　　　 例: [保守と創造の対立と循環関係]
　Synergy between fruit and process
　　pragmatists
 　　Impatient to reap the fruits
 　　Not doing a good job of problem posing and fieldwork to get results quickly
 　　　I tend to just do the [nishio.icon]prominent "line up the labels" kind of thing.
 　　This is not how the KJ method works.
 　　The KJ method is useless."
 　心情派
 　　Disregard the real benefits to be gained.
 　　Failure to set goals for good fruit
 　　Don't get caught up in the results."
 　　Only with the earnestness of wanting to obtain good fruit is there a fulfilling experience of achievement.
 　　It makes the "achievement experience" you once experienced into an objective.
 　　experience of accomplishment is weakened.
　　[nishio.icon]What we call "process" here is not the KJ method in the narrow sense of the word.
　　　〜I'm afraid it will lead to a "it's important to follow the KJ method step by step" type of misunderstanding if I don't get to the bottom of it.
　　　The scope of this story is not narrowly KJ method, but "one job"
　　　Talk about the need for "judgment" before "decision" to decide what to do.
　　　[https://gyazo.com/ea22b648efef89ba9735ec6a5598018b]
			That decision is made by "putting the data together."
				[https://gyazo.com/896eea33552666c937f365bd848bcf37]
　　　In detail, it starts with "raising an issue" and "gathering information," then compiling data and understanding the situation before making a decision.
				[https://gyazo.com/dbdf291fe4edd07ded71463eb43fe5ff]
　　　And to taste the results after implementation.
　There was an interesting story about [success is success] in this position, but it doesn't fit the flow of this story, so I'll leave it out.

W-type problem-solving process
　第3章
　[https://gyazo.com/0b28933fe504868a5029ec7704051b06]
　　p.33
　Thinking Level and Experience Level
　　Thinking work only in the mind = level of thinking
　　Observing things and working with things = experience level
　　A model in which problems are solved by moving back and forth between these two models.
　In this diagram, "evaluation" and "decision" are placed at point D.
　　This "evaluation" corresponds to the "assessment of the situation" of the twelve steps of one job
　　So the part before that corresponds to "understanding the situation".
　　From there on, it corresponds to the planning, implementation, and tasting the results of the "one job, two steps".
　　big picture
　　　[https://gyazo.com/d80b1048d68953df0942a840d1e4c5ea]
　　前半部
　　　[https://gyazo.com/e7ef666f2a9f2057d2802e391ee6bb86]
　　Insistence that a phase of gathering data and letting the data speak for itself is necessary before making a decision.
　　He writes that there is no existing appropriate word for this "let the data speak for itself" (p. 54-55).
　　　"Make yourself empty and let the data speak for itself" (p. 57).
　　　[https://gyazo.com/9c789fd3fef2f416de8c2515f8cd86a7]
　　　Since he wrote the word "idea" in "Idea Method," he must be dissatisfied that it was interpreted in a way different from Jiro Kawakita's own ideas.
　　　　[The "idea" in the idea method is "to make yourself empty and let the data speak for itself and put it together.]
	[W-type problem-solving model of the KJ method and U-theory, respectively.]
		2015 Lecture at JEITA by Nishio
		The relationship between the [W-type problem-solving model] and the [PDCA cycle] of the [U Theory].
		The PDCA cycle does not talk about how P is created
		W-type problem-solving model and U-theory both focus on "what is needed before P".
		[https://gyazo.com/6e152a3761a0029fdb6676b129d7e5b0]
　　Jiro Kawakita himself uses the term Plan, Do, See instead of PDCA
　　　Because the PDCA cycle was born in 1986, and at this point in time, it hasn't been born yet.
　　In recent years, "[OODA Loop]" has been increasingly mentioned in Japan
　　　これは 観察 (Observe), 情勢への適応 (Orient), 意思決定 (Decide), 行動（Act） 
　　　Common with the W-type problem-solving model in that observation is required before decision (Decide).
　　　OODA assumes that the next O begins immediately after the action
　　　In the W-type, after the action, there is examination, verification, and tasting of the results, and what is obtained is put away in the knowledge repository.
　　　This is a difference in timescale due to the fact that OODA was born out of the context of US Air Force air warfare and Type W was born out of the context of cultural anthropologists' field work
　Is the W-type problem-solving model correct?
　　This describes the subjective "view of work" of Jiro Kawakita, a cultural anthropologist
　　　It's not right or wrong, [all models are wrong].
　　Understanding this distinction in Jiro Kawakita is useful in understanding the difference between the KJ method and fireworks (exploratory net)
　　　[https://gyazo.com/c575130dfa4ed228f6e8453236c0adc6]
　Comparison with Nishio's view of work
　　I'm not comfortable with the interpretation of "only one W in a job."
　　　waterfall-like
　　This may be for illustrative purposes.
　　A Software Engineer's Perspective
　　　Agile/Scrum view of work
　　　　Lots of small W's repeated.
　　　[Lean Startup" view of work
　　　　Small W should be repeated at high speed.
　　On the other hand, the story could be interpreted as focusing on "one big job."
　　　The nuances of the term "one job."
　　　This is what happens when you only do small W's.
　　　　[Efficiently handling the task would implement the damn app at high speed].
　　　Jiro Kawakita's idea of timescale
　　　　[https://gyazo.com/f7d7aefe7817836bdc174f0136cc82bf]
 　　　p.437
 　　　This is about the size of what is expected.
　If we consider that the left side of "Q:" is for "judgment" work, I agree with your image of many small W's, although the left and right sides of "W" are not necessarily one-to-one anymore.
　 A: Yes, it's not always one-on-one, the process for gathering information is a detailed trial-and-error process, and I feel that the concept of an exploratory net fits better that way!

I could only go so far in an hour.

Reflection on the past 3 chapters and the connection to "Exploration".
　Jiro Kawakita created the KJ method, wondering how to summarize the large amount of qualitative data resulting from field observations.
　　[https://gyazo.com/070ccca7ddcc56b0dc6a4abb4d4ae775]
　This was published in 1967 in a book entitled "Ideas
　　This was read by a very large number of people
　　Probably because the naming of the "idea method" made people imagine a wider range of applications than "how to summarize a large amount of qualitative data resulting from field observations.
　As a result, the demand for instruction on how to master this technique has increased
		>In 1967, I wrote a book entitled "The Idea Method. Since then, the KJ method, which is at the core of the "Idea Method," has been rapidly expanding and deepening its influence in society. With this development, I have had to give a number of explanations related to the KJ method. Furthermore, the training problem of how to master this technique has emerged. Thus, today, a training system has been roughly outlined.
			Continuation of Ideas p.2
		The KJ method was found to be useful in various fields, and data on successful and unsuccessful cases was gathered at Jiro Kawakita's disposal.
	In the process of Jiro Kawakita's repeated teaching of the KJ method, he realizes that in many cases there are problems with the "exploration" part in the foreground to begin with.
		1977 Exploratory Studies in "Knowledge
			>However, even though the KJ method is becoming popular on the surface, it still does not seem to be used in earnest. Although there are some people who have mastered the KJ method on their own, examples of organizations making full use of it are still rarer than the stars of dawn. What is the bottleneck? There are many causes of obstacles. However, one of the most important causes seems to be the following.
			> If we consider the KJ method in the narrow sense to be the part [C→D], no matter how well we overcome this part, if the preceding part [A→B→C] is not done well, the KJ method will not be utilized. If the quality of the original label data, which is the material for the KJ-method, is poor, the result will be irredeemable. (p.28)
　　in other words
　[https://gyazo.com/e9bc618b517bd6762a62d8f0da7647a2]
　　To solve this problem, "Exploratory Studies of Knowledge" introduces a number of methods, including "exploratory nets"
　This "exploratory net" developed significantly through 1986.
　In 1986's "Let Chaos Speak", nearly 1/4 of the paper was devoted to "[* Methods of Research]" (13%) and "[* Exploratory Net Re-enactment: Practical Application of KJ Method]" (9%).
  He calls the exploratory net a "practical application of the KJ method."
  Jiro Kawakita himself also shows data that about 90% of his works are created not by the KJ method but by the Kanken-Net method.
  [https://gyazo.com/2bf75f74885b4c9e5ecfb8a633a3ddae]
　　　p.436
　　So here's what I'm saying.
　　　[https://gyazo.com/2919fff1c57322c2f26db9b16429af7d]
　When modern working people try to get the fruits of achievement from the "KJ method", they ignore this "exploration net" when they focus only on the process named "KJ method".
　　The exploratory net is "the twin brother of the KJ method" (according to Jiro Kawakita).
　It is important to delve into this exploration net
　However, in Nishio's personal opinion
　　Too tightly coupled to physical methods.
　　　Assumptions written in pen in the "KJ Method Notebook."
　　　Inventory is running out in 2011.
　　　>I have been using the "KJ Notebook" for about 30 years now, but I will probably stop using it next year. The publisher, Kawakita Research Institute, is going to run out of stock.
　　　http://eskokugojyuku.cocolog-nifty.com/blog/2011/11/post-d521.html
　　　Between 1986 and now, technologies related to information input and output have advanced, including personal computers, always-on Internet connections, smartphones, multi-touch input, pen input, and voice input.
　　　　The current system does not allow for these benefits.
　　Not organized as a system.
　　　This is probably due to the fact that it does not fit well into the KJ method system (especially the W-type problem solving model) that I have been using for over 20 years.


So far, we're done for now.
　Next time due to lack of time
　I'll do an overview of the concept of exploration nets and fireworks after this additional explanation.
　　探検型花火・統合型花火
　　Fireworks Daily, Thinking Fireworks

next: [exploration net (fireworks) study group].


---Unused memo
KJ法
　KJ method is a means, not an end
　Not the only way.


Not right, not right, but useful, not useful.

p.159
 数種類が限界

p.251
dot-notes
連合
p.255
Expedition Net

Look at it from a different perspective
Understand three-dimensionally

Maps can be made in the brain.

広域地図と詳細地図

