Difficult to practice daily without mastering the daily fireworks report even if only the KJ method is mastered
[Even if you learn only the KJ method, it is difficult to put it into practice every day if you do not master the daily fireworks report.

[KJ method: Let the chaos speak for itself] at p. 264-265.
A fireworks daily report is a daily diary or daily report that uses [ExploreNet] as a daily diary or daily report.
I think this is a bedtime statement for those who only read "[the idea method]" which is written in a salacious manner but has no description of fireworks ([exploration net]). I think it's a bit of a shock to those who have only read "[Idea Method]," which doesn't mention fireworks ([Expedition Net]). I guess.

>One example of a use for daily ruminations is for college students to take lecture notes in the form of a daily fireworks report. This can be done for at least some types of lectures. The result is that lectures that used to bore you become less boring. There is no need for shorthand-like writing. Instead, one has to listen to what the teacher has to say. But at the same time, it is interesting. When you turn your notes into a daily firework report, the content becomes very polished and the ideas are stimulated. In other words, it is an ideal review. Grades naturally improve. The students will be motivated, and they may even extend the principle to their preparatory work. Finally, it will culminate in the establishment of a proactive attitude of inquiry.
>This is a very important matter for a society like Japan, where the overwhelming majority of young people are frustrated because their personalities have been distorted by studying for Tsumekomi, especially for entrance examinations. Of course, it is even more important to learn the full-fledged KJ method as well as the Hanabi Nippo. However, [* I think it is difficult for students to fully use the KJ method in their daily practice if they have mastered only the KJ method but have not mastered the daily fireworks report as well. The KJ method will be better utilized with the daily fireworks report as a springboard].

Incidentally, Jiro Kawakita himself creates about one sheet every two or three days, even though he says this, so it seems that he does not write a daily fireworks report every day. Does he do it only during fieldwork?

from [Exploration Net (Fireworks) Study Group].
