I'm confused because I seem to be in more than one group.
from [KJ Method Study Group @ Loftwork] Preliminary Questionnaire

Q: I'm confused because I feel like things can be looked at from many different sides and can categorize materials into multiple groups.

A: There is nothing wrong with that feeling.
Jiro Kawakita himself gives such an example in his association between islands of illustration.
	[https://gyazo.com/d70464b986bec83bc0d4cbe3c8b3227a]
	> C is also like A and D. In another sense, it is also like B and E. These double or triple lines of relationship are called [cross-circles].
　[KJ method: Let the chaos speak for itself] p.136

For example, let's say you are struggling with the grouping phase before diagramming.
　[https://gyazo.com/7e1ec337ae18cce4aa150195e5696a8a]
　"C has a strong relationship with A, and a strong relationship with B, so which one should we stick with..."
　If there is a strong relationship between both, why not one group of three?
　　[https://gyazo.com/6cb805402fd309fde36789034b61957a]
　Why did you consider "A and B are different groups"?
　Because A and B are not similar?
　For example, how about this case
　　[https://gyazo.com/e2098e253713f18561866c498074e2b3]
　　Front cover "Cylindrical columns look both circular and square."
　　　Circles and squares are not similar, seemingly unrelated, but they are connected through the cylinder.
　　Are you unconsciously ignoring these patterns?
　Not necessarily "different groups because they don't look alike."
　　When you "collect things that seem to be related," do you implicitly define "related" as only "similar?"
　　I was curious about the use of the word "classification" in the question text. Classification is a narrower concept than KJ-method grouping, since classification is "to gather similar things together.

I think that there are cases where people have a chance to think once about whether the above cases apply to them and still say, "I still want a different group.
For example, a case like this
　[https://gyazo.com/d78990c25b34c37e06b319000b5cace3]
　E is closely connected to everyone in A-D, so I want him to be one of them, but he's also closely connected to everyone in F-I, so I want him to be one of them. If we put them all in one group, it would be too big, and A-D and F-I would fight with each other because they consider each other to be strangers to the other's camp...
　In such cases, duplicating E will clear up the problem.
　　[https://gyazo.com/07fc9411f361f657bc94b2c66a3cdb6f]
　　If you make it a cross circle or connect the two E's with an equal when you illustrate it later, you'll know what I mean.
　　Sometimes when I try to put two groups like this and then put a nameplate on each one, I realize that I was focusing on different aspects of E!
　　The content of one label E can be verbalized in more detail in E after the fact by being placed in a different context.
　The opinion of [Jiro Kawakita.icon] on a case similar to this is that "E should be [a monkey away from the monkey]".
	>I often see people who resolve two or three small groups to form a larger group. This is because one or two pieces seem to be related to both Group A and Group B, and they try to solve the dilemma by creating a combined group of A and B, avoiding the one-sidedness of putting one of the pieces in either group. Instead, it is better to keep a monkey or two away from the problem and group A and B separately in a small eye. If it is natural, the A group, the B group, and the separate monkey pieces will all be grouped together in the second stage of grouping. ([Sequential Conceptualization] p.60-62)
　　This means the idea that "the next step will be this form
　　　[https://gyazo.com/6cb805402fd309fde36789034b61957a]
relevance
	[A cylinder looks like a circle or a square, but it is neither a circle nor a square].
