On the correctness of the KJ method
On the correctness of the KJ method
　[In the preliminary questionnaire for the KJ Method Study Session @ Loftwork, there were a number of comments to the effect of "I'm not sure if I'm doing the KJ Method correctly.
　What is this "correctness"? If being equal to Jiro Kawakita's claim is correctness, then you should read the books written by Jiro Kawakita directly yourself. Because no lecturer is equal to Jiro Kawakita.
　For this study session, I read "[KJ Method: Let Chaos Speak for Itself]" written by Jiro Kawakita 20 years after "The Idea Method. What impressed me was the fact that Jiro Kawakita did not use the KJ method for about 90% of the 1,000 or so diagrams he created in five years. It is not that he uses KJ-method for everything.
　The KJ method is a means, not an end. And the KJ method is not the only means; we need to choose the appropriate means to achieve our goal, not the goal of doing the KJ method. Jiro Kawakita thought that it takes about 10 hours to do the KJ method for 50 labels. This is not suitable for daily use.
　What other methods are there besides the KJ method? Jiro Kawakita explains "[Exploratory Net]" in detail in the chapter "[Practical Application of KJ Method]". Ninety percent of Jiro Kawakita's illustrations were made with the exploratory net. The exploratory net is also called "fireworks. Based on this Fireworks, "Hanabi Nippo" was created for daily use. We are also proposing "Thinking Fireworks" as a practical firework.
　Although these methods are not KJ method in the narrow sense, they share a common character. That is "collecting data from multiple perspectives." The KJ method was created to summarize a large amount of qualitative data collected from multiple perspectives. Thinking Fireworks helps us to understand situations and judge circumstances from multiple perspectives, thereby improving the quality of our decisions and giving us confidence in our decisions.
　Jiro Kawakita believed that "accomplishing a single task" nurtures a person. This "one task" is not a work that is determined by others, but a task that one decides what to do and carries it out by one's own judgment.
　Some people may think that "things to do" at work are predetermined. However, if you observe carefully, you will find that there is a range of discretion within the "things to do" that you are allowed to decide. If you are able to make your own decisions about what to do and proceed with the work, you will be given more discretionary work. If you cannot make your own decisions about what to do, someone else will decide what to do in detail, and you will be expected to do it in a workmanlike manner. More opportunities for judgment will be given to those who have good judgment.
　Work and life are not tests. It is not the type of test like a school test where you get a perfect score if you follow the correct procedure. For example, if you read Jiro Kawakita's book thoroughly, do the KJ method as described in the book, and then give a presentation saying, "This is a proposal that was created based on the correct KJ method! If you do the KJ method as it is written in the book, the client will say, "You are doing the KJ method correctly, and it is wonderful! Perfect score! Would the client say, "You did the KJ method correctly! No way.
　Customers only evaluate whether they got what they were looking for. It does not matter what process produced it. However, customers cannot clearly verbalize what they are looking for. So you have room to make a decision about what to create. Multiple perspectives increase the quality of this judgment and your confidence in your decision.
　Since you all probably deal with the KJ method in your work, we first talked about understanding customer needs. On the other hand, when it comes to your life, you are your own customer. Life is not like a test exam question, but like an arts and crafts project, and you are the one who decides what to create and how to live. It is not for others to decide and give it to you, and it is not for others to decide right or wrong for your work. You can only be satisfied that you have created something good or unsatisfied that it was not so good. Any method is a good method if it helps you create what you want to create.
　This text was created by "[trying out] thinking fireworks" as a means of organizing my thoughts, thinking "I have a lot of questions about the correctness of the KJ method, I want to write a good commentary". I am satisfied that I did better than I originally envisioned. So for me, this method was a good one.

References
　[50 KJ method assumes 10 hours].
　[Jiro Kawakita did KJ method about 10% of the time.]
　[The accomplishment of one job fosters both the person and the team.]
