The term "KJ method" is vague
[https://gyazo.com/a267bec405e211196d0566cec5be6fae]

　1: The "KJ method" was created.
　　Jiro Kawakita called it the "Paper Kire Method," and [Tadao Umesao] suggested the name "KJ Method" ([KJ Method: Let the chaos speak for itself] p.212).
　　The purpose of this method was to "summarize" a large amount of qualitative data collected through fieldwork to find out what I wanted to know.

 2: Jiro Kawakita taught the KJ method to others, and in the process, "the KJ method can be applied to various purposes," and it was applied to various purposes by Jiro Kawakita himself and others.
 　Because the objectives are different, the methods are also slightly different.
		[https://gyazo.com/a267bec405e211196d0566cec5be6fae]
		Jiro Kawakita uses the term "[KJ method] in the narrow sense" to refer to the original KJ method in order to distinguish between the original KJ method and these various KJ legal methods.
		However, this is ambiguous when there are multiple narrowly-defined KJ methods, so I have decided to call it "[the KJ method of the beginning]" on this page.

　3: Let's call one of the many and varied applications of the KJ method a "KJ-legal workshop"!
	　[https://gyazo.com/bb9caf5ba9dfdf8337ea2a94969d3b94]
　　Imagine a workshop where you gather a large group of "people who have never studied the KJ method", write down their ideas on sticky notes, and discuss them together in groups.
　　The nature of the KJ method, which is "done for a large number of people who have never studied KJ before," made this the "first experience with KJ" for many people.
　　As a result, a lot of people recognized that "this is the KJ method."
　　However, this "KJ legal workshop" is at odds with the "Beginning KJ method" in many ways
　　　[Jiro Kawakita.icon][The KJ method is not powerful without individual work].
	　[Jiro Kawakita.icon][50 KJ method assumes 10 hours].
　　So those who recognize this "KJ legal workshop" as "KJ method" will be confused when they read Jiro Kawakita's author
　　　KJ method" is a low-resolution language, so it is necessary to improve the resolution of the language.

remarks
　Some people say "this is not the correct KJ method" based on the fact that the KJ Workshop conflicts with the Beginning KJ method in many ways.
　　You have a point in that "this method is different from the KJ method in the beginning."
　　On the other hand, the choice of the word "right" has the bias of thinking that being different is a bad thing, imho.
　　Since the purpose is different, it is natural that there are differences in methods, and Jiro Kawakita himself has created a number of "methods different from the original KJ method" ([Pulse Discussion], [Exploration Net], [Thinking Fireworks], etc.; see [The Flow of the Birth of Thinking Fireworks]).
　　[https://gyazo.com/cff575dca22b831cce37e9053c3a77d0]
　　The quality of a method is determined by whether it is useful in achieving the objective. It is not determined by the degree of agreement with the beginning KJ method.
		Related [on the correctness of the KJ method].

