KJ Method Study Session @ Loftwork_Lecture Material v1
Write down anything that pops into your head as soon as it comes to mind.
　I wrote this first because it is the most important tip for intellectual production!
　reason
　　What you didn't write down will be gone.
 　If you try to remember to keep it from disappearing, your brain will be used to "remember" it.
 　　That reduces the amount of power available for "thinking".
 　　When thinking about difficult things, it is important to make sure that your mind is not used for anything other than "thinking".
　Let's minimize the cost of writing it down.
　　Some people make the mistake of thinking they have to use a keyboard when there is a keyboard in front of them.
　　Which means are less costly depends on the person.
　　If you are better at flicking on your smartphone than typing on the keyboard, you may write things down by flicking
　　If you are better at handwritten notes, you may handwrite them down
　　Only you know what you are good at.
　　　So it's your responsibility to choose the best means.

Self Introduction: Yasukazu Nishio
　Master (Engineering), Doctor (Science), Master of Technology Management
　Cybozu Labs, a subsidiary of Cybozu's research division, is engaged in the research and development of software to support intellectual production.
 　[Kozaneba, a digital stationery to organize your thoughts].
 　　I find the KJ method very useful, but there are a lot of inconveniences in doing it on paper! I need good digital stationery!" Motivation
 　　Developed and provided free of charge as open source
 　　I use it to organize my thoughts and give priority to features I think I need to implement.
 　　　fold a group
 　　　Make the important ones bigger.
 　　　Drawing lines of relationship between things
 　[Keichobot: a chatbot that brings out the best in people and their ideas.]
 　　Based on coaching methods such as clean language and symbolic modeling
 　　[The questioning encourages verbalization.]
 　　　Another important tip for intellectual production
 A little look back in time at our relationship with the KJ method
 　2012~2013: [Technology supporting coding].
 　　A book that compares more than 10 programming languages and explains "what is knowledge that is less likely to become obsolete and has long-term value".
 　　I used the KJ method to put this book together.
 　　The fact that the book is still in print seven years after its release in the technical book genre, which often has a short lifespan, is proof that "long-term value" has been realized.
 　2013, 2014: [Kyoto University Summer Design School].
 　　Taught the KJ method in a 3-day, 2-night, 12-hour workshop.
 　　I used the KJ method to compile this lecture material.
 　　Motoi's discovery of this lecture material was the catalyst for this study session.
 　2018: [Intellectual Production of Engineers].
 　　A book that explains how the "technology behind coding" was created
 　　However, the editorial decision was made that "writing with the KJ method" alone was too narrow a topic for a book, so we decided to broadly discuss the entire intellectual production process.
 　　It ranked 10th in the overall ranking of Junkudo Ikebukuro's main store.
 　　[https://gyazo.com/a794bad490de9acd705ba5b914e40960 https://twitter.com/junkudo_ike/status/1044033963214290944]
 　　　I was happy to hear the bookstore clerk say, "I'm not an engineer, but this book was good.
 　　Chapter 5, "How to organize your thoughts" is the main KJ method story.
 　　　I wanted to write more but couldn't because of the overall volume of the book.
 　　　We received feedback from a newcomer to your company who read the book in advance and found the advice to "think in terms of conflict" and "similar to presentation slides" to be useful.
 Probably rather different from the work you usually do.
 　Especially those facilitating workshops where multiple clients do KJ legal things.
 　There was a preliminary question, "I want to know how to do good facilitation."
 　　but you are more experienced in that!
 　Role of [nishio.icon] in this issue: Promoting multifaceted understanding by offering different perspectives

Promotes multifaceted understanding by offering different perspectives
	[https://gyazo.com/e249b88f436ff3bf9d15d99579239ae5]
 　One person says it's a circle, another says it's a square.
  　Seemingly contradictory opinions, which is right?
  　Neither is correct!
  　[A cylinder looks like a circle or a square, but it is neither a circle nor a square].
　The KJ method has the catchphrase "let the data do the talking," but the basic premise is...
　[Jiro Kawakita.icon] "[All data is a lie]"
　　> [All data is a lie]. Use data knowing that it is a lie. And from that, we can determine the more correct truth. That is the path to judgment. But how can the truth be determined from a lie? It is because, from a different point of view, all data also contain some semblance of the truth. ([KJ Method: Let Chaos Speak for Itself] p.71)
　　A person's words are a description of the view from that person's perspective
　　　Errors inevitably enter the process of that description.
　　　What appears to be a contradiction may actually be a description of the same thing from a different angle.
　　　So [Jiro Kawakita.icon], it's important to collect data "[from] a 360-degree angle of view.
　　　From a 360-degree angle of view" is the first of [Jiro Kawakita.icon] "[Five Principles of Exploration]".

let data speak for itself
　[Jiro Kawakita.icon] "Let the data speak for itself."
	　[human.icon] "Language is difficult..."
　[nishio.icon]Modern translation of "Let the Data Do the Talking"
 　[human.icon]"Data don't talk, right?"
 　　Figurative expression.
　Consider "Let Friend A Talk."
　　Mrs. A: "Hey, listen, my husband..."
　　Bad example (Mr. B)
　　 Listen to me for a moment.
　　 　Mr. B: "Yes, yes, in essence, you are saying that 'the attitude of the spouse's participation in household chores is the problem.'"
　　　If you said this, Mr. A wouldn't be able to speak the rest of the story.
　　　Mr. B is "someone who doesn't listen."
　　Good example (Mr. C)
　　 Mrs. A: "My husband thinks I'm stupid!"
　　 Mr. C.: "Yes, you're making fun of me."
　　 　Inwardly, "Mrs. A feels that 'her husband is making fun of her' -"
　　 　I don't believe as a matter of fact that "my husband is making fun of Mrs. A."
　　　Mr. C is taking what Mr. A said to heart.
　　　　Mr. C is "someone who can listen."
　Good attitude towards people:.
　　"Listen to what they have to say without assuming, 'This is what they must be trying to say.
　The equivalent attitude toward the data is: "I'm not a good person.
　　"Don't just assume, 'This must be happening,' but look at the data."
　　This is "letting the data do the talking."
　By the way, say "[from a 360-degree vantage point]" in the context of complaining about a marital dispute:.
　 It becomes, "Listening to only one side of a marital dispute doesn't give you a correct understanding, you have to listen to both sides."

Letting the Data Do the Talking" in the planning stages of this study session.
　Motoi's first consultation email
　　It's a skill that belongs to the veteran members of the team."
　　It's hard to get that across to our younger members."
　Nishio's first thought.
　 If you're talking about how to transfer tacit knowledge.
　 　Or, "Language at a Cost."
　 　[Communicate non-verbally by] "doing it in the same place" ([SECI model] of [collaboration])
　 　I think you have two choices.
　 As to "language at a cost:"
　 　Since the veterans actually use the KJ method and find it valuable, why don't you ask them to tell you "why I use the KJ method" with their own muddled experiences?
　 　If the veteran can't afford the time cost of preparing the material, why don't the younger members interview the veteran?
　 and was about to delve into "how to verbalize at a cost".
　Then I saw the detailed data.
　　I asked Mr. Motoi some questions, looked at the results of the pre-survey, and so on.
　　In many cases, especially younger members are doing the KJ method with their teams.
　　 In other words, they are already trying to "communicate non-verbally by doing it in the same place" and then there is the current problem
　　There are "I don't understand", "I'm scared", "I don't know the right answer", and "I feel like it's too late to ask" in the survey.
　hypothesis
　　[human.icon]The KJ method is an essential skill, I was told to read the assigned book "The Idea Method" and I read it but I don't understand what it means...
　　[human.icon]I'm doing the KJ method with my senpai. I'm trying to do it just like that, but I don't know if it's right... I don't know if it's right because my senpai says it's right...
　　When I say [human.icon] "I don't understand," they say, "What? Now?" And they might say, "What? Afraid to ask questions...
　　[human.icon]I can't do it alone because I don't know the right answer...
　　Seems important to resolve this issue.

[Bicycle parable]
　Most of you can ride a bicycle, right?
　　Now let's say here's a person who doesn't know how to ride a bicycle.
　　[human.icon]"I can't ride a bicycle because I don't know how to ride it properly, please tell me!"
　　What do we do now?
　There's a "I can't do it because I don't know the right answer" kind of opinion in the data.
　　Implicitly assuming that those who are able to do it know the right answer, I don't, and I can't do it without being taught.
　　But your process of learning how to ride a bike wasn't reading a textbook or listening to a classroom lecture, was it?
　　You should have actually straddled the bike in a safe park or something, tried many times, sometimes fell down, and from the repetition you should have learned the knack of moving forward in a stable manner.
	Another perspective: a line from a veteran who has done the KJ method over 100 times.
	 [human.icon] "There may be some parts that I've taken the liberty of making my own."
　　 They don't think, "I'm doing it the right way."
　　　Nor do I think, "I know the right answer, but I'm changing it a bit and making it my own."
　　　I don't know if the way I'm doing things is the right way or my own way because I don't know the right way."
　[nishio.icon]There is no right answer.
　　Just like how you all ride your bicycles in your own way.
　　　They know that riding a bike will get them around faster than walking.
　　　Ride when you need it.
　　　This is enough for practical purposes.
　　The reason why they don't tell you the "right way" to do things when you ask them is because they are all doing it their own way.
　　Self-improvement is not bad, in fact, it's good.
　　　Self-organized = customized method to fit your own personality.
　　　[Each person has his or her own personality, so it is only natural that the right method for each person will be different.
　　　You can refine your own "my style" through trial and error.
　　Birth of the KJ method:.
　　 The intellectual production technique created by Jiro Kawakita was given the name "KJ method" after the fact.
　　　In other words, the KJ method itself is one of Jiro Kawakita's self-styled intellectual production techniques.

Need to create a loftwork style.
　The cultural anthropologist wrote in 1967, "The Idea Act."
　The day-to-day work your company is doing in 2022
　There is a huge gap between the two.
　　Different objectives, different tools used.
　　　There's lots of talk about paper diaries and labels in "Ideas," but no mention of computers, because it's a book from 1967.
　　Trying to apply it to day-to-day operations
　　　Read "Ideas."
　　　Discarding detailed specific methods,
　　　Extracting the essence as an intellectual production technique,
　　　It is necessary to achieve this using modern tools
　　Too high a hurdle for new employees?
　If you want to improve the training of new employees, you need to update the "idea method" to the modern and your company's context.
　　Updating to a modern context is also in line with what Nishio wants to do, so we can cooperate.
　　　I think it is better to read "[KJ method: Let the chaos speak for itself]" from 1988, which was written based on the experience of more than 20 years since then, rather than "The Idea Method" from 1967[nishio.icon].
　　Updating to your context requires tightly coupled knowledge of your business
　　　So this is what your company's members should do.
　　　Let each of you develop your own style for the task at hand.
　　　You should feel free to ask each other questions, exchange know-how and make improvements.

The Small Start Principle
　When you can't solve a big problem at once, start small.
　In order to resolve the "atmosphere of not being able to ask because it feels like it's too late," a survey was conducted in the form of "outside lecturers are being sought for the preparation of lecture materials.
　　It is impossible & useless to answer this question orally in a limited time, so answer it in text before and after.
　　I think you could also use this question as an opportunity for discussion and know-how distribution within your company.
　In today's work, you will be asked to "practice riding a bicycle with auxiliary wheels".
　　Even if the goal is to ride bicycles without auxiliary wheels on public roads in the future, I wouldn't challenge that in the beginning.
　　First, experience "pedaling a bicycle to go forward.
　　Then you realize, "If I pedal my bike, I can get further faster than if I walk."
　　This realization leads to confidence that this is the right approach.
 This work
 　Label "[* Explore net]" for "[* alone]" and "[* about 25 pieces]" for "[* self originated]".
 　Each of these elements will be explained

I'll do it alone.
　[The term "KJ method" is ambiguous, so let's look back in history.
　[https://gyazo.com/a267bec405e211196d0566cec5be6fae]
　　1: The KJ method was released in 1967, beginning with the "Idea Method".
 　　The purpose of this method was to "summarize" the large amount of qualitative data gathered through fieldwork to find out what [Jiro Kawakita.icon] wanted to know
	 2: The "Idea Method" became a hot topic [Jiro Kawakita.icon], and in the process of teaching the KJ method to others, he came to believe that the KJ method could be applied to various purposes.
	 　And it was applied to a wide variety of purposes by [Jiro Kawakita.icon] himself and those around him
 	　Because the objectives are different, the methods are also slightly different.
  	[Jiro Kawakita.icon] uses the term "[KJ method in the narrow sense]" to refer to the original KJ method in order to distinguish between the original KJ method and these many different KJ legal methods
  		However, this is ambiguous when there are multiple narrowly-defined KJ methods, so I have decided to call it "[the KJ method of the beginning]" on this page.
 　3: One of the many and varied applications of the KJ method is the "KJ legal workshop".
 	　[https://gyazo.com/bb9caf5ba9dfdf8337ea2a94969d3b94]
 　　Image of a workshop where a large number of "people who have never studied the KJ method" are gathered, their ideas are written on sticky notes, and everyone discusses them together in groups in a lively manner.
 　　The nature of the KJ method, which is "done for a large number of people who have never studied KJ before," made this the "first experience with KJ" for many people.
 　　As a result, a lot of people recognized that "this is the KJ method."
 　　However, this "KJ legal workshop" is at odds with [Jiro Kawakita.icon]'s "Beginning KJ method" in many ways
 　　　[Jiro Kawakita.icon][The KJ method is not powerful without individual work].
 	　[Jiro Kawakita.icon][50 KJ method assumes 10 hours].
 　　So people who recognize this "KJ legal workshop" as "KJ method" will be confused when they read [Jiro Kawakita.icon]'s book
 　　　KJ method" is a low-resolution language, so it is necessary to improve the resolution of the language.
 The majority of participants in the participant survey used it more often with their teams.
	 [https://gyazo.com/eaa5c66ee692b64556f1f473af625017]
		What purpose do you use it for? There were many "workshop" and "brainstorming" answers to the question, "For what purpose do you use it?
　[Jiro Kawakita.icon][The KJ method is not powerful without individual work].
		Jiro Kawakita believes that this problem has emerged due to the widespread use of the KJ method, which is done in groups.
			>If you have only experienced group KJ method from the beginning, it is difficult to develop the basic ability to do individual work.... Moreover, they feel like they have somehow mastered the KJ method because they have only done it in groups many times. They do not realize that they have not mastered the KJ method. ([KJ Method: Let the chaos speak for itself] p.209)
 	Jiro Kawakita believed that "members working in pairs must have gained experience and matured in competence as individuals first, or undesirable compromises will occur.
  	>Around 1968, a training program was initiated in which two people work in pairs to assemble labels. However, this work was conducted only in the third round (pursuit of essence), after the first round (problem posing) and the second round (understanding the situation) of labeling work had been conducted on the same theme, one after the other [* after having experienced this work on an individual basis]. It was only in this third round that the participants succeeded in working in flexible pairs for the first time. Prior to this, I judged that [* the individual competence of each person was not mature enough]. It seemed to me that [* operationally speaking, an undesirable compromise would occur between the two of us]. (p.201)
　What is an "undesirable compromise?"
　　For example, let's say that a senior who is familiar with KJ method and a junior who is not familiar with KJ method are paired up to do KJ method.
　　[https://gyazo.com/e249b88f436ff3bf9d15d99579239ae5]
　　When the senior says, "This is a circle," the junior says, "From my point of view it looks like a square?" Can he say, "From my point of view, it looks like a square?
　　(Is it round? I think it's square... but if senpai says it's round, maybe that's right... I don't know what's right...) just because I don't know what it is?
　　　This is an undesirable compromise.
　　If insecurity prevents us from having a multifaceted opinion, we will not be able to have "[a 360-degree viewpoint].
　　　Data showed that "when you're a loner, you feel alienated."
　　　　What [nishio.icon]eh [lone wolf has value]? What do you mean you feel alienated? Is there a tonal pressure in the place to be like everyone else?
　　　Seniors have the responsibility to control the atmosphere of the place so that juniors can express their opinions without anxiety.

So let's do it alone first.
　[human.icon] "I've only done it in teams, I can't imagine doing it alone."
　　Introduced from the preliminary survey
　　[https://gyazo.com/41403cc7feaade90ef2eb28b69d0e47c]
　　There are a lot of people who use it for brainstorming, and at one step, there are people who are aware of the problem of "stopping at brainstorming and not being able to put it in writing."
　　On the flip side, some people say they use it for writing articles and blogs.
　　　In other words, they use it for the purpose of "making sentences."
　　　This is similar to the "KJ method of beginnings" of [Jiro Kawakita.icon
　　　He used to compile a lot of data and put it in writing.
　　　Close to Nishio's experience.
	　　　I used the slides for my lecture materials and for writing my book.
　　Some said [human.icon] "I'm not making sentences, I'm making slides."
　　　 Jiro Kawakita explains that there are only two ways to "narrativization": "written" and "oral presentation (with illustrations)".
　　　 　Does not include making slides in PowerPoint or Keynote
　　　 But slide making is a form of predication [nishio.icon].
　　　 　The only reason it's not mentioned is because those presentation tools had not yet been created in 1967.
　　　　　In fact, a number of people have commented in their experience with [nishio.icon] so far that "imagining the slide-making process made group organization easier.
　　Doing it for the specific purpose of writing makes it easier to learn the method.

Achievement of one job fosters both people and teams.
　There are many other kinds of work besides making texts and slides.
　　The purpose of the "Beginning KJ Method" was to write.
　　Later, "It can be applied to various purposes," and the KJ legal method in a broad sense was derived.
　　As a result, the "purpose of the KJ method" became vague and more people felt unsure
	[Jiro Kawakita.icon][The accomplishment of one job nurtures both people and teams].
　 One job = a job to be determined by you
　 　Synonym "work"
　 　Experience in independent decision making develops people.
　 　Tasks at work may appear to be "to do" at first glance, but you have some discretion to make decisions based on your judgment.
　 　Those with good judgment are given jobs with greater discretion, while those without are handed "tasks" with less discretion.
　 　When working in a team with seniors, they tend to leave decision making to seniors = no experience in independent decision making
　　How can we improve our judgment?
　　　Making decisions based on multifaceted information.
　　　Quality and confidence in "judgments" are enhanced by being based on multifaceted information.
　　　This is "[let the data do the talking]."
　Some of the questions from the student survey: "When do you use it?" Some of the questions from the survey are as follows: 1.
　　[human.icon] "Before starting a new job," "When you are unsure of the purpose of your work," "Clarify what you are going to do," and "Decide 'what you are going to do.'"
　　[human.icon] "When you have a vague sense of an issue," "issue out," "understand the structure of the issue."
　　[human.icon] "When you're having trouble with priorities," "making a schedule," "creating a plan."
　　A number of people are using the broad KJ legal method to "make their own decisions and get the job done".
　　Related: [the W-type problem-solving model of the KJ method and the U-theory, and their respective problematics].
　In his article "Kanken-net Re-On: Practical Application of the KJ Method," [Jiro Kawakita.icon] introduces a method called "[Thinking Fireworks]" regarding day-to-day decision making.
　　[Jiro Kawakita.icon] "Fireworks to think are intended to bring certain conclusions to the worries, difficulties, and challenges that arise daily in our lives" (p. 304).
　　Learning this will be beneficial for you to use the KJ method in your future practice[nishio.icon].

Do it with about 25 labels.
　[Jiro Kawakita.icon][It takes more than 100 pictures to really understand the KJ method].
　　I completely agree, so I wrote something to the effect that "if you can't make 100 labels, you're not gathering enough information in the first place" in "The Intellectual Production of Engineers" [nishio.icon].
　But as I was planning this study session, I felt that [25 sheets might be a good first step to experience the KJ method].
　　The data shows that many people are stumbling due to lack of "experience to finish alone".
　　　So it is important to first experience [the experience of accomplishing a task].
　　The KJ method is four times more difficult when the number of sheets doubles.
　　You should make the task smaller and the distance to the goal shorter.
　　　It's not right for someone who is just starting to jog to participate in a full marathon.
　Jiro Kawakita's "KJ method" in "It takes more than 100 sheets to understand the KJ method" refers to the "KJ method in the beginning.
　　He also says, "[Thinking Fireworks has] 30 to 60 labels."
　　　The idea that it is not necessary to exceed 100 sheets for daily practical use
　When you get used to it, I recommend challenging yourself to go over 100 sheets[nishio.icon].
　　Start with the easy ones and gradually challenge the difficult ones.

Do it with a label of your own origin.
 [KJ method from surveys is the most difficult][nishio.icon].
	What do you do when you see a label and say, "I'd like more information.
 　1: Label with your thoughts
 　　→Then ask yourself, "How can I elaborate on this?" Ask yourself
 　2: Labels created from multi-person brainstorming sessions, etc.
 　　→Then ask the person who offered that opinion, "How would you elaborate on this?" ask the person who gave the opinion, "What do you mean when you say this in more detail?
 　3: Labels created by picking up from "long descriptions" such as books
 　　→Reread the relevant sections of the book.
 　4: Labels created from "short descriptions" such as free-text sections of anonymous surveys.
			→I'm in trouble.
			　Maybe you could ask the people inside the surveyed companies...
			　For example, several people used the words "axis" and "granularity" for "things I don't understand" in the pre-survey of this year's participants.
			　　I don't know if these words "axis" and "granularity" are used in the sense that [nishio.icon] thinks they are, or if they are used in a specific sense within your company.
			　　So I emailed Motoi and asked him about it. When I read the text of his reply, it was clear.
		Easiest to do with self-derived labels, much harder to do with anonymous survey-derived labels.
		　So this time I'll do it with a label of my own origin.
		　It appears that your company often uses the KJ method to compile "100 or more" labels of "survey origin" for business needs.
		　I guess if you have to, you have to do it, but you should realize that you're taking on something very difficult.
		　It seems too spartan to make someone unfamiliar with the KJ method do it for the purpose of learning it.

I'm going to do an exploratory net.
　[Exploration Net](a.k.a. Fireworks)
　　[Jiro Kawakita.icon] "KJ Law's Twin Brother" and "Practical Application of KJ Law."
　　　KJ legal methods created for practical purposes
　　　Since the purpose is different, it is natural that there are differences in the method, and the method is a little different from the "KJ method of the beginning" (SEE [The flow of the birth of fireworks to think]).
  　　[https://gyazo.com/cff575dca22b831cce37e9053c3a77d0]
　　How exactly are they different?
 　　In one round of the narrowly defined KJ method (Chapter 4), the table tag creation is done as an element of group organization, and then spatial arrangement is done as an element of diagramming (p. 123).
   　[https://gyazo.com/1774d1af2641ba655a83f27784a3c521]
 　　The exploratory net is spatial arrangement as an element of net building, and table tag making as an element of integrated illustration (p. 289).
  　　[https://gyazo.com/b70c91c7f28b1073f866baf8dba77b84]
  　Elements are swapped back and forth.
　Group formation is not necessary in practice.
　>The first system of KJ method introduced to the world was the six-round cumulative KJ method. This created the perception that problem solving by the KJ method was time consuming. (p.436)
　　Jiro Kawakita himself has made about 1,000 pieces in the five years since 1981, but only 8 of them are in the 6-round KJ method (p.436).
	  [https://gyazo.com/2bf75f74885b4c9e5ecfb8a633a3ddae]
	　　I only do the 6 round KJ method once or twice a year.
	　　　We only work on topics that require six months to a year to reach a conclusion.
	　　　In Nishio's example, a theme like "writing a book".
	　　I do a light KJ method about once every two weeks.
	　　I make about one exploration net (thinking fireworks) every two or three days.
	　　　Accounts for about 90% of all cases.
　　　　In other words, in most cases, they're not grouped together.
　　So "group formation is always necessary" is an assumption contrary to the data
　So when is grouping necessary?
　　Quite simply, "when there are too many pieces"[nishio.icon].
　　Direct spatial placement is not possible due to the large number of sheets.
　　therefore
　　　Look at the whole picture and "attach what seems relevant."
　　　Give the group a "nameplate" that represents its content.
　　　Bundle [* bundle] with the nameplate at the top.
　　Bundling reduces [* the number of apparent pieces], which is the purpose of grouping[nishio.icon].
　　[https://gyazo.com/23cbfbf14fc93c8cecb5eac7dac0cd3d]
　　Some people are misled by the term "grouping" [nishio.icon].
　　　I wonder if the word "group" makes them feel like they have to form a group of, say, seven or something.
　　 [human.icon]"Some things just don't fit anywhere."
　　  [nishio.icon], then you can leave it in one piece.
　　  [Jiro Kawakita.icon] "There also remain [* many] labels that say, 'I can't find a mate and remain in one piece'" (p. 126).
　　 [human.icon] "A group is, say, seven pieces?"
　　 　[nishio.icon]First of all, the feeling of putting two pieces together
　　 　　It's not uncommon for a piece attached in two pieces to be further attached later to increase the number of pieces.
　　 　[Jiro Kawakita.icon] "Some sets of labels are a set of two labels, while others are a set of three labels. [Some] have a set of four or five labels.
　　 　　There is a case in [Jiro Kawakita.icon]'s experience where the average number of sheets was 13 as a result of sticking together, but we consider that to be an exceptional event.
　　 　　>In this example, the small group of units in the first stage averaged a little less than 13 pieces. In this example, the number of units in the first small group averaged just under 13, but this was due to the fact that there were quite a few units in the field data collected that should unquestionably be in one group.... It is normal for a group to include as many as four or five pieces of paper or units. (Continued from Ideas, p.72)
　　 The main focus of this "putting two pieces together" is the "exploratory net."

Different tools have their strengths and weaknesses
　Everyone in this study group uses Miro, which is an interesting situation.
　　We do a lot of work on paper, often because the IT literacy of the clients is mixed[nishio.icon].
　Explore net explicitly expresses the relationship between the two labels
　　This is hard to do with paper labels.
　　　[Jiro Kawakita.icons] is a tearful example of "putting a clip📎 between
　　We can easily achieve this with Miro's "Draw a line between stickies" feature.
　So there will be a lot to learn if we all take this opportunity to do an exploratory net together.
　This time, we'll do something based on "Thinking Fireworks", one of several variations of "Exploration Net", customized to fit the constraints of this study group.
　　The original "Thinking Fireworks" will surely be useful for your work, so if you are interested, please read the explanations on p.304-311 of [KJ Method: Let Chaos Speak for Itself].

Place the theme in the middle and spread it out in a 360-degree direction.
　First, write the theme with one large label in the middle.
　Add a new label for something associated with this theme, connect it with a line, add another new label for something associated with that label, and repeat.
　　If you have experience with [mind maps], it may be easier to imagine writing and connecting associations.
　　Mind maps create a tree structure, but exploration nets create a mesh (see below).
　This time I had the labels pre-written.
　　If you put time pressure on the writing process, you may be in a hurry and make a messy label, which may cause all the later phases to be messy. I wanted to avoid this (SEE [Do not put time pressure on label creation]).
　　When expanding the associations from the theme, glance at the existing labels and pick up and connect any labels that seem to be connected.
　　The goal is not to "hook up everything we've prepared in advance."
　　　If you can use it, you can use it.

Purpose of this time
　〜It's not a "~.
 　It's not about "connecting all the pre-prepared labels."
 　It's not about "putting the data together nicely."
 　Nor is it "making pretty diagrams."
 　Nor is it "slurred speech."
　[* To notice something that you have not noticed before].
　　This could be an "idea" or "finding a solution to a problem".
　　If you notice any one thing that is new to you, you've succeeded.
　　Some will find it difficult, it's important to be able to think this is "doable".

Representing relationships with lines to create a mesh-like structure.
　The exploratory net does not organize groups, but rather expresses the relationship between the two pieces with a line.
　Many people have trouble organizing groups for the KJ method, but you can get the hang of it by doing an exploratory net.
　　Instead of "grouping," "categorizing," "categorizing," or "creating an axis," [* attach two pieces that seem related].
　　[* also place opposing labels close together].
　Place the label in a place where it will draw lots of lines with its surroundings.
　　Lines should be as short as possible.
　This process creates this kind of mesh (net).
　　[https://gyazo.com/6dca2378f76b52d352b8c985e17034f9]

　　I actually made it on the Miro board you all are looking at.
　　At the time the mesh was formed, it was not divided into groups.
　In the process of creating a mesh, for example, you may say, "I thought I was thinking in terms of multiple aspects, but when I put them together, there are gaps around the themes.
　　What fills this gap?" Prompting awareness by asking "What fills this gap?

Once the mesh is created, pen around each of the two or three pieces.
　Surround the area with two to three pieces, four to five at most.
　　This is the equivalent of collecting labels for the KJ method.
　　Anything that does not fit well anywhere may of course be left in one piece (lone wolf).
　　(In Miro) I thought it would be good to use a frame, but it was hard to do, so I decided to enclose it with a pen.
　Once enclosed, summarize and give a title (nameplate)
　　How would you summarize it?" Asking the question "How can I summarize this?
　　Unlike the narrowly defined KJ method, there is no bundling, so there is no restriction that "the meaning must be known only by the nameplate" (SEE [Mission of the nameplate]).
　　　Even if you make some mistakes, you can summarize them comfortably because you know what they mean when you read what's in them.
　Repeat this "enclose and put a nameplate" until there are 5 or 6 enclosures.

Pay attention to what you notice and make it into a narrative
　When the work is done, first take a break and carefully appreciate the whole process.
　　You can add anything you come up with in the process.
　Then, make it descriptive.
　　No need to write long, clean sentences.
　　That's not what we're here for.
　Repost: [* The purpose of this time is "to notice something new for me, even if it is just one thing."]
　　So pay attention to "what you notice" and put it into words.
　　Narrativization also has different ways of doing things depending on the purpose. by[Jiro Kawakita.icon].
　　　Narrative for reporting of facts collected
　　　　Many of you may be used to this, but that is not the purpose of this project.
　　　[Jiro Kawakita.icon] "Narrativization for ideas" (p.141)
　　　　Put more and more of what you notice and ideas that come to mind into writing.
　　　It is not important to report the whole picture of the ex-labels in this study session
　　　So, let's focus on "awareness" as the main part of the story and explain only the minimum necessary labels.
　Why is awareness valuable?
　　Because that's what "the bike moves forward."
　　Repeating the same things we've been doing won't solve the problem.
　　Reaffirming what you already know hasn't taught you anything.
　　In order to move forward, it is necessary to realize the goodness of "things that go against conventional thinking".

Constraints of this study session
　The ideal theme is what I am struggling with right now.
　　But you don't want to share that with others.
　　For example, if you're serious about your career, "changing jobs" is an option you should consider, but you don't want to discuss whether or not to change jobs in front of some of your colleagues.
　　Priority was given to the benefits of seeing other people's work.
　Ideally, there should be no time limit.
　　The experience of thinking carefully until you are satisfied is beneficial.
　　Some people try to look presentable in the eyes of others when they have a presentation scheduled after a certain time.
　　The purpose is to think hard and gain some new insights.
　　Prioritized the benefits of listening to other people's insights.
　It is difficult to align the time required for a large number of people.
　　Some are fast, some are slow.
　　It's not always the slow people who are bad, there are those who sass up their appearances without thinking twice about it.
　　　It's like buzzing a bicycle around with the stand up, you can turn it faster because there's no load on it, and you're not going to move forward by doing that.
　　In this case, we'll say, "If the label didn't reticulate in the first 30 minutes, we'll leave it alone and move on.
　　　The idea of adjusting time by reducing the number of sheets for slow people
　　　People who spend too much time trying to "use it all" end up rushing and doing the crucial second half in a messy way, which is not good.
　　　　I would rather not be able to use all of the labels than to make the second half a chore, so I prioritized taking my time in the second half over "using all of the labels".
　　　　If you don't have time constraints, you're really better off challenging yourself to use all the labels.
　　　　　Because the question, "How can this be connected?" prompts awareness.
　　　People with extra time
　　　　You should take the time to watch it and add as much as you can think of.
　　　　　This is how [Jiro Kawakita.icon] also recommends
　　　　You can go and watch other people work.
　After this study session is over, I want you to take the time to do it alone, on a subject you really want to think about, without worrying about what others think.
　　This experience is very important for "the KJ legal concept to become clear"[nishio.icon].

Break time~.
