Balance between life after birth and life before birth
>[為末 大]
> I realize that this is a sensitive discussion, but I think that continuing a country can be paraphrased as "continuing to balance life after birth with life before birth. Roughly speaking, I think that medical care is in charge of life just before and after birth, and the social framework and politics are in charge of life before birth.
> Medical advances protect and extend life after birth. Medical care enhances the well-being of people after they are born. However, to put it another way, if people are not born, there is no life to protect. How to protect life before birth, in other words, how to create a society, system, and environment conducive to the birth of a child, is a very complex and cross-cutting issue, despite the fact that there are ministries and agencies in charge. Above all, the greatest weakness of pre-born life is that it cannot be expressed in the form of a vote.
> If, in a democratic system, people after they are born pursue their own life's gain (leaving out emotions such as being happy to have a child), then no one will think twice about the lives that are born. To take it to the extreme, if the generation living now flourishes, distributes, and gradually declines, that is the end of it.
> Some people say that people want to have children as long as they are happy, which may be partially true, but from a larger perspective, the birthrate is declining in all developed countries. This is very troubling, but from a macro perspective, the more affluent people become, the lower the fertility rate will be, which means that just because people are happy does not necessarily mean they want to have children.
> For a nation with a democratic system to continue, someone must represent life before it is born, which means that individuals are required to vote on a timeline beyond their own lives. But this is a very difficult problem. This is because a portion of the gains of life after birth would be allocated to the future.
> What will happen in [an aging society with a declining birthrate]? The world is watching Japan closely for learning. Can human beings really go beyond their own personal gain, beyond the time frame of their own lives, and pass their gain to the future, imagining not only the people in front of them now, but also the lives before they are born? It seems to be one social experiment.
> I hope that posterity will say that this generation had imagination and lived for the benefit of the next generation beyond their own gain.
https://www.facebook.com/100002266699013/posts/pfbid0361otVBufHi4NuxpamEzDDznmx7u8JQqEdBdPp12SMGKFBZYhvH9gTzFotMtm6RPrl/?d=n

You're saying that there's a bias in having a one-person, one-vote [democracy] for living people that disregards distribution for future people who haven't been born yet.
　[未来軽視]

関連
	[https://withnews.jp/amp/article/f0190626002qq000000000000000W02c10301qq000019300A Childcare is "the most powerful market creation" Cybozu President Aono has learned].
		>Parenting is "creating a market. If the market disappears, the merchant has to fold his business. Childcare is by far the highest priority.
　[https://woman-type.jp/wt/feature/404/ "Of course childcare is more important than work," Cybozu President Aono says, something Japanese managers have overlooked - Woman type Woman Type | Woman's New Job TYPE]
　>Without the market, we wouldn't be able to do business. But if you look around you, you won't find any business owners who are taking care of their children. And that's as it should be. In this country, people who have sacrificed childcare in politics and the economy have risen through the ranks to become leaders of society. I was fortunate enough to experience childcare in this way. That is why I realized that a businessman must first take care of his child before talking about business.

[公平]
[平等]
