Scaling YC
A story about how [Y Combinator] is increasing the number of companies that adopt it ([src https://www.ycombinator.com/blog/scaling-yc])
　Started 16 years ago with 8 cases
　20th (twice a year, so 6 years ago, I guess) 100 cases.
　Four years later, the number was 200.
　That's where COVID19 came in and went online.
　　The number of cases increased to 300, but it worked out fine.

Why Scale Up?
　>There are thousands of online applications and hundreds of startups with potential.
　　In other words, I feel that even with the current situation, we are missing out on something that has potential [nishio.icon].
　　　This is the same issue for unexplored junior
　>The value of the network will increase if more companies are accepted.
　　That would be true if the quality did not decrease due to the expansion of scale[nishio.icon].
　　　For example, changing an event from a 2-day/1-night camp with 30 people to a 300-person event will not increase the network 10-fold.
　　　If it is not done on a scale where everyone's face can be identified, it becomes a "place full of strangers".

Cautiously expanding
　>Because when I led the development of Yahoo Mail, we increased the number of users too rapidly and failed.

What we did.
　>Maintain physical space to allow for events that bring everyone together
　　I think the all-hands event is important for me too [nishio.icon].
　>Split the program into smaller groups.
　　I would like to know more about that! [nishio.icon]
　　Is it about creating a close relationship in a small group, but putting up a random edge at the overall event?
　　[small community].

　>In-house production of software to help with operations by creating a development team
　　>Integrates onboarding, alumni directory, wiki, advising catalog, demo day website, Slack and Zoom
 　>In-house software also plays an important role in the adoption process
 　　>so that the adopting team can focus on the important issue of "who to choose from the large pool of applicants".
　　This idea was left out [nishio.icon].
　　There is a feeling that the unexplored human resources who are volunteers are doing it on the fly, so there is a lack of continuous improvement and maintenance (unexplored junior staff).
　　　I don't think the IPA's unexplored is run by engineers, so they can't even make it themselves.
　　　It is interesting to increase the scalability of the business through software

　>More GROUP PARTNERS to advise
　　>そのためにvisiting group partner programを作った
　　　It's a temporary position, not an ongoing part of the team.
　　>直近のバッチでは5名のvisiting group partnerがいて、去年は3名をgroup partnerに昇格した
　　I think this is similar to what I was thinking about with my idea of introducing a sub-committee system for mentors of unexplored juniors [nishio.icon].
　　　To suddenly become a mentor with full responsibility from zero experience is a high psychological hurdle for both the person becoming the mentor and the person asking for help.
　　　So, I think it would be good to have them get involved in a casual, peripheral position first, and then they can think about whether they want to become a mentor or not after they get a feel for the atmosphere.
　　　　[正統的周辺参加]

>COVID19 occurred when we were approaching the limits of physical space.
 >Full remote forced to do
 >Surprisingly, the largest ever
 >They ran more smoothly than any other batch.
 	This is reminiscent of the [Unexplored Junior 2021 Boost Conference] that was held using Scrapbox because it needed to be run remotely at Unexplored Junior, which turned out better than expected [nishio.icon].
 	 As a result, the Unexplored IT results debriefing session also became a Scrapbox, and this year in 2022, the Boost Conference also became a Scrapbox!
 	 　That's the first update in five years of [announcement parallel chat].
 	 　It's a nice combination of synchronous and asynchronous, so it's no longer appropriate to call it a "chat".
