Is your company's vision "money first"?
[https://note.com/tsunashi/n/n1457d6d7871a 3749 words that should be read by job hunters who hesitate to enter the company saying "I'm interested in Cybozu, but I'm worried because it's an elusive company...". |Kohei Tsunashima |note]

>[https://twitter.com/uchan_nos/status/1087501006634508288 @uchan_nos]: "The president agrees with the statement "[profits are leftover]. Hmm?" Blow me wow /3749 words that should be read by job hunters who are hesitant to enter "I'm interested in [Cybozu], but I'm worried because it's an elusive company....". |Kohei Tsunashima @tnsm0223 |note https://t.co/REEhDe8GLP

>[https://twitter.com/nishio/status/1087725578566930433 @nishio]: Just recently, a mid-level engineer at another company told a young engineer that "money comes first when you are in a commercial company". I told him that this is an old-fashioned way of thinking, but he didn't seem to get the message. It is deep-rooted.

>[https://twitter.com/kur/status/1087726371227557888?s=21&t=S4hWSoTaK32t-ig5Y0-hWg @kur]: there are quite a few people who still believe this. How can it be conveyed?

>[https://twitter.com/nishio/status/1087730659546796032?s=20&t=De36-TDyWCH26aAg4tmzUQ @nishio]: @kur And it's worse because he tries to write for younger writers.

>I've been thinking about this a bit, and first of all, the "not making ends meet phase" and the "making ends meet phase" should be considered separately, and while the former requires money promptly to survive, there is no basis for extending the thinking in that phase to the latter.
> In the latter phase, for example, when retained earnings increase from 500 billion to 1 trillion, neither the stability of the company nor the happiness of its employees will change much, and a little thought will show that the value of money will slow down out of proportion to its face value.
> Since the relative value of non-monetary capital is higher, it is more advantageous to steer directly toward acquiring it rather than converting it to money and then acquiring other capital. Such as.

> @kur
> I can almost understand, but if you divide it into two phases, the phase where you earn money and the phase where you don't have to earn money, it's difficult to define the phase where you don't have to earn money in the first place....

> @nishio
> Ah, I guess the "phase" way of cutting it sounds like it would be better because it sounds like it would be cut by time frame. Maybe we should just divide it into "enough to live on" and "more than enough to live on."

> @kur
> If I say the amount necessary to survive, it seems that I would not be able to make a new investment, so I have a different feeling. I mean, if you think about it, there is a possibility that even Nishio-san and I are thinking differently.
> Modern companies have a mission, vision, and values, and their first priority is to contribute to society by achieving these values. In order to make this sustainable, they must earn money, and by investing the money they earn, they deliver even more value to society as a whole. In this process, I believe that money is not the primary value.

> @nishio
>I understand. It's not "money is the goal," it's "achieving the vision is the goal and money is the means."
>I hadn't thought of the "vision or no vision" cutoff, but it sounds very useful. I'm not sure if "making enough money to survive" has any impact, but I guess the bottom line is that if your need for survival and security is threatened, you're not going to be able to focus on your vision and desire to achieve it.

>@kur
>I think it is normal for individuals to prioritize their desire for survival, but if we take it to the extreme, I think the future of the company is to say that if you are not committed to achieving your vision, then you are not worth living for. Kotler and others have said that the Maslow pyramid is the opposite.

>@nishio
>Drucker also says that "profit is a condition for the survival of a company, not its purpose. On the other hand, I think the idea that "survival is not an objective" is still difficult for many people to accept (because it affects their personal lives as well).

>[https://twitter.com/nishio/status/1087873049871843328 @nishio]: @kur In other words, it's a watercooler because you say "the value of money first is old" and then you ask "what is your company's vision? Oh, no? Money first?" I think it's better to separate the fact that the situation is "money first" from the value of "I think that kind of thinking is old-fashioned".

