西尾視点の2b2t.townの歴史
2b2t.townとは
　FactorioとCivilizationみたいな要素が入ったMinecraft、現在Ingressみたいな機能を開発中
　[My explanatory tweet: https://twitter.com/nishio/status/1551888778960453632]

History from start of play to date
	6/16~8/1
	It's a story about a country that becomes a technological powerhouse and then gets pinched when industrial espionage steals its technology.
	All players except me are alphabetized.
	　I'm not sure readers would be interested in the names of specific individuals.

6/16
 Nishio logged in for the first time.
 Mr. A took me to his base.

then
　Started building his own house next to the base (base 1)
　I created a system to automatically earn MP.
　 Reached 190,000 MP per day
　Reference knowledge: Mr. B was a clan member of A at this time.

6/22
　Nishio used his accumulated MP to mess around and use a wide variety of magic.
 I've been experimenting with a lot of magic and noticed the existence of an item with a very high MP purchase price.
 MP変換の自動化に着手(MP生産工場1号機)

6/23
 1億MP達成

6/24
 10億MP達成
 Start building a base away from the first house because it is too small for the factory improvements (base 2)

6/25
 Set up defenders to defend the new base
 0 MP for the clan, the defender cannot function, so 100 million is transferred, and the clan becomes a top clan.
  Note: Individuals and clans have separate accounts.

6/29
　Building and improving MP production plant No. 2, which was being built at base 2.
 100億MP達成

then
　Tired of improving MP acquisition efficiency because no one is taking back the top clan.
　I was doing maintenance on an unexplored server.

7/16
 Clan C becomes the top clan.
 War is declared by C and attacked.
 　Keep the clan's MP at 1 billion for defense.
 The defense is too hard to give up.
  I could handle a hundred million, but not a billion."
　I wasn't sure if this was a mouthful to catch them off guard, so I set the clan's MP at 10 billion to build up defenses and dissuade them from confrontation.

then
　I thought it was not a good idea to have Base 2 built in the open in a prominent location on the ground.
　　The company will begin to search for and develop potential sites for a new underground base in the
　　Major upgrade of MP production plant No. 2 to a production capacity of 6 billion MP per day.
　　All the bases are enclosed so that the mechanism cannot be seen (I thought).

7/21
 Country system release!
 A tower was introduced that consumes 2500 MP per minute and outputs a "country aura".
 The area where this country aura spreads is visualized on the map as a national land.
 [https://pbs.twimg.com/media/FYlqj7JaUAME4h9.jpg]

7/22
 Mysterious new accounts D and E continually attack.
 At this time, the system couldn't know where the attack was taking place.
 It was perceived that it was summer vacation and weird kids were doing vandalism.

7/23 [* Beginning of the Three Kingdoms Period].
 Attacks in absence, 150 million MP in 5 hours
　The attacker would have taken 300 million MP damage.
　　→ Funny, not something a new player can do without any assistance.
　Understood.
　　>There was a hole in part of the wall that surrounded my MP production plant, and the MagicBooks in the auto-conversion chest were replaced with B, C and D ones. w
　　　Looks like he found an unprotected area with a defender and poked a hole in it.
　　　The know-how of MP Production Plant 2 (production capacity 6 billion MP per day) was stolen by industrial spies. w
　　C recruits B to his clan and B accepts.
　　A removes B from his clan

7/24
　I don't know how much know-how is being passed on, but if Clan C can't replicate my factory, I don't want to pass it on any further.
　Base 2 was pulled down and production plant #2 was dismantled.

then
　Construction of the new MP production plant #3, which has been planned for some time at base 3.
　　7/26 Production capacity reaches 10 billion MP per day.

7/27
	MP earning tower function is introduced.
	　Stacking blocks on top of the tower gives MP depending on the MP equivalent value of the blocks.
　Existing MP production plants do not scale due to technical constraints that require players to be close by.
　　Tower, on the other hand, keeps adding MPs to the clan even if the user is not logged in.
　　Started researching technology, believing it was necessary to explore this direction.

then
　B, which seems to be the actual unit of Clan C, invades Nishio's territory with a tower in the underground passage.
　A complains to C that his base is covered by Clan C's country aura (military tension!)

8/1
	A tower that automatically earns 800 million MP per day.
