Exploring the "Interesting" Net Chat 2022-08-10
from [Diary 2022-08-10].
Exploring the "Interesting" Net Chat 2022-08-10
[https://gyazo.com/2d82dfb76a4e98a0281b33674f7c038b]
	n: "interesting" exploration net (net-making phase) quite interesting
	t: How interesting is "quite interesting" interesting?
	n: The goal is for the branches to be connected to form a net, so that topics that have been treated separately can be connected.
		The interest I feel now in unexplored junior is connected to my interest in avoiding [metacognitive ataxia].
	t: I mean, is it interesting to discover the connections?
	n:Unexpected connections were discovered, and those "connections" are interesting.
　　That discovery explains why I'm so enthusiastic about Unexplored Jr.
		A place to have fun with young people" is important.
	T: Because?
	n: "with young people" is important
		If it's just a "fun place to hang out," you can keep doing it with people you like.
		　But that would raise the average age by one year every year.
		With young people," and achieving this condition requires a different kind of effort.
			Because young people don't want to go near where "[smelly people]" are.
			I need to work on my metacognition of whether or not I stink.
		The advantage of creating a place like this: playing with young people gives a fresh stimulus to the brain on my side.
	t: Does it make it easier to discover unexpected connections?
	n: that's another story
		It's interesting to find unexpected connections using the ExploreNet."
		It's interesting to play with young people because it's fresh and stimulating."
	T: That these two are interesting in their own right.
	n: may lead to further
	t: seems to be a connection / there seems to be a connection between unexpected connections and fresh stimuli
	N: First of all, there is a desire to understand the structure of the system.
		The exploratory net encourages it by connecting overhead.
		The absence of fresh stimuli hinders
	t: How does it interfere?
	n: Fresh stimulus can be a trigger to wonder why when it conflicts with the understanding you have at the moment.
		An environment where fresh stimuli are not forthcoming, or a mindset that dislikes and shies away from them, causes the opportunity to understand the system to be lost.
		Understanding the world as a system" needs constant updating as the world is constantly changing.
		but when you have metacognitive ataxia, you don't know that.
　　　The idea is that "I already have a correct understanding of what is going on, and I don't appreciate young people behaving in a way that is not in line with that understanding."
	T: What is the difference between "something that is at odds with the understanding I have now" and "fresh stimulus"?
　N: Fresh doesn't always mean discrepancies.
　　There's a case of, "Oh, I never thought of that."
  For example, the creators of Unexplored Junior are creating a "network of only 50 people connected" that is authenticated through a non-centralized mechanism, and I think, "Wow, that's interesting.
  This is not so much a discrepancy as it is just something I didn't think to do.
  　It's simply "interesting to be presented with something I never thought of."
  Boundaries may not be clear.
  For example, an 18-year-old creator can set up a legal entity rather casually.
  　I have no qualms about that, and I'm inclined to think it's funny.
  　In terms of "understanding the world," I had the assumption that an 18-year-old would never form a corporation.
  　So the facts of observation and understanding contradict each other.
  　That contradiction was resolved by discarding the side of my own assumptions in favor of the observed fact that I'm "standing in reality".
  So, in that light, "fresh stimulus" is "at odds with understanding."
   'Something you didn't even think existed exists' is a 'discrepancy with your understanding.'
   Fresh = discrepancies."
   The conflict hasn't surfaced because I've accepted it without psychological resistance.
   There can be people who say that this "fresh information" is "outrageous.
	T: It's going to develop further from "fresh = discrepancies"!
		When you choose the word "fresh," you seem to subconsciously assume "rotten.
