Anti-patterns are inevitable.
2022-08-22
[https://gyazo.com/f6d59c0c6afc9d0a0d4e51aaefde0d15]

phenomenon
　1: Mr. A acts in a certain direction X is better.
　2: Experiencing something not good
　3: Experienced a change in direction Y and it got better.
　4: Then I see Mr. B going in direction X and think "Y would be better".

Assume that in this situation, the experience of a large number of people gives a high degree of confidence regarding "Y is better".
	In general, the following cases are common, but we will assume a slightly different situation
		There is no guarantee that 'Y is better' is universally true in the first place.
			I think you're overgeneralizing your [past experience].

Mr. A wants to tell Mr. B that "Y is better", but how can he get it across?

[nishio.icon]Not possible.
	Why, because Mr. B cannot see the "dark cloud that exists with a high probability ahead" in the first place.
	You need to fly at the wheel yourself, get stuck in a dark cloud, and then change course without crashing to your death.
	If I were to offer support, it would not be to "keep them out of the dark clouds" but to "help them change course as soon as they realize that they are in the dark clouds.
　　To bite off a little more, there are two.
　　　You'll notice it right away when you enter the dark clouds.
　　　As soon as they realize they've entered a dark cloud, they change course.

I wrote this much without a title on 2022-08-22 and left it alone.
　I saw this tweet on 2022-08-29 and thought it was relevant.
		>[https://twitter.com/hrjn/status/1564086755766468608 @hrjn]: I've been chatting with a lot of people lately, and they're all generally following a similar anti-pattern of corporate growth.
  >Anti-patterns are not something that can be avoided. Take appropriate action when they occur while reducing risk.
  >It's like getting a cold even if you don't want to.
 I titled it "Anti-patterns are inevitable.

Advice in advance will not be received or experienced.
https://neos21.net/blog/2022/05/22-01.html
>I just can't understand it until I "[experience]" it myself once.

[mitoujr-mentoring-tips]
