hindsight
People who use the word "consequentialism" in a negative sense.

>[https://twitter.com/me_ve1415/status/1562418012270956547?s=21&t=SsD6OxJWLsuXkBPtQd36sA @me_ve1415]: @kyu_tyou99 This is like "What is a donation to build a statue of a cartoon character! What the hell is going on!!!!" but in the end it produced economic benefits that far exceeded the cost of installation ðŸ˜‚.
	[https://www.asahi.com/sp/articles/ASN9K6SNYN9HTLVB00G.html Ralphie statue, economic effect estimated at 2.7 billion yen, 200 times the cost of installationï¼šAsahi Shimbun Digital]
>[https://twitter.com/babahnZLOtaurBt/status/1562449930433998850 @babahnZLOtaurBt]: @me_ve1415 @kyu_tyou99 I don't like a bit of consequentialist...
>[https://twitter.com/kaito_nogarube/status/1562472871540056065 @kaito_nogarube]: @babahnZLOtaurBt @me_ve1415 @kyu_tyou99 What is the economic impact aimed at? In the end, it's all about results.... No matter how much you estimate, you don't know the effect until you try it. It can't be anything other than consequentialism....

My feeling is closer to the third, "Of course it's consequentialist, but so what?"
ã€€The first person says "I don't like it because it's consequentialist" without offering any other argument, so he implicitly assumes that "consequentialism = bad".
ã€€I wondered if the term "consequentialism" was being used in an ambiguous way.
ã€€What is "consequentialism" anyway?
	Dictionary Meaning
		>A discussion that looks only at the results of things without considering causes, motives, etc. It's just -."
			https://dictionary.goo.ne.jp/word/çµæžœè«–/
		That's a vaguely negative term.
		I need a little more word resolution.
ã€€ã€€ã€€Discussing the goodness or badness of a decision at a given point in time based on knowledge revealed after that point in time has a name [hindsight bias].
	>[https://twitter.com/4ya9A/status/1562567421244092416?s=20&t=sEoBjf6sQQM1FNbZXA5NPg @4ya9A]: @babahnZLOtaurBt If the results are what you're aiming for and it's consequentialism, the only other thing If the results are what you're aiming for and it's consequentialism, then there's nothing else.
 ã€€Ah, I see.
 ã€€ã€€In other words, "the opposition is even worse."
ã€€ã€€When someone points out that "Idea A" is "not perfect," whether or not that point is correct is irrelevant to whether or not "Idea B," the opposing candidate, is better.
ã€€ã€€The idea A was that "building a statue of Ralphie would lead to a return on investment that exceeded the amount invested," and it was implemented accordingly, and the results demonstrated that the idea was correct.
ã€€ã€€ã€€This "I saw the results, so I think A is right" is indeed "consequentialism"
ã€€ã€€ã€€How about the opposing candidate's idea B: "Building a statue of Luffy is a waste of money.
ã€€ã€€ã€€ã€€At the time of decision making, both A and B were "ideas that may or may not be right".
ã€€ã€€ã€€ã€€At this point we know that "B was not the right idea."
ã€€ã€€ã€€ã€€Claiming that A was still correct at the time of decision making based on current observations is "[hindsight bias]."
ã€€ã€€ã€€[The correctness of the decision will be known later.
