Seriousness brings wisdom.
>[The difference in ability is the difference in effort.]
>[The difference in performance is the difference in responsibility.]
>[The difference in personality is the difference in hardship.]
>[Differences in judgment are differences in information].
> 
>[Seriousness brings wisdom].
>[Halfway through the process, people complain].
>[All I can say is that it's not good enough.]
> 
>[You can do most things if you really try].
>[Everything is interesting because it's serious.]
>[Someone will help me because I'm serious].

It was mentioned on Twitter as being the words of [Kazuo Inamori], but a search revealed multiple references to it being [Shingen Takeda].
So when I looked up the "Shohan Glossary" listed as the source, there is a reference to "source unknown" as of 2015.

>Have you ever heard of "Seihan Goroku (正範語録)," a "beneficial" type of content that has become a hot topic mainly on social networking sites, where the author and source are unknown.
　[https://big-mac.jp/column/think-seihan-goroku/ Thinking about Masanori's words | Words that touch your heart | Bigmac inc]

>This term was circulating on Facebook around 2012.
> Many people were struck by these words, and the question of who this "Masanori" is also became a topic of discussion. This was also a topic of conversation.
> However, it does not seem clear who "Masanori" is.
	[Shohan Words Author: Yuuji Watanabe (Quotes circulated on Facebook) Friend Link 1up Column Editor｜1UP Column｜1UP Column https://friendlink.jp/1up/news/169/]

2012-08-07 [Facebook https://www.facebook.com/meigenn1/photos/a.300728979965416/427989360572710/?type=3]
	[https://gyazo.com/91d5c653f9b5741eb3e5280958cd7e38]

>June 9, 2012
>I found out about it through ConyJapan's General Manager Akaishi's Facebook page.
https://www.heartlifedaiken.com/blog_president/23116.html

I have not been able to find a Facebook page for this person, General Manager Akaishi of ConyJapan.

It's almost certainly not Shingen Takeda or Kazuo Inamori.
