mimic
This matter will be on an unbalanced memo for some time to come.

>[https://twitter.com/yasu_mystery/status/1564923492457664518?s=21&t=aCln3RGqmemjC2mUdwD5MA @yasu_mystery]: AI drawing, Midjourney becomes a hot topic → Stable Diffuion distributed as open source -> explosive evolution -> Mimic became a hot topic in Japan -> Mimic was slammed and stopped service -> China released ERNIE-ViLG, which generates Japanese moe illustrations
>The flow of AI drawing is too fast.
	>The development dates of each service are not necessarily in chronological order (they are listed in the order in which they were discussed).

>[https://twitter.com/yitabashi/status/1565050321407442944?s=21&t=aCln3RGqmemjC2mUdwD5MA @yitabashi]: this sucks. ERNIE-ViLG was released on the mainland while mimic was beaten to silence domestically. And this is obviously learning a lot of pictures from Japan or pixiv (if you put pixiv in the spell, the quality goes up and becomes stable), what are you going to do about it? I don't know if it's still the case in the West, but the concept of copyright in the continent...
>#ERNIE-ViLG #mimic
>[https://pbs.twimg.com/media/FbgsWa5aQAAs1j9.jpg]

>[https://twitter.com/sukaneki_vrc/status/1564479607742803968?s=21&t=aCln3RGqmemjC2mUdwD5MA @SUKANEKI_VRC]: The fact that Stable Diffusion and I think the fact that midjourney's function of giving reference images and having them generated by midjourney didn't catch fire, and mimic, which was more considerate of the artists in its terms and conditions, caught fire (as a wet blanket), doesn't this set a precedent that "it is better to cut off the knowledgeable class below a certain level by making it English-only"? I don't want to live in such a world.

>[https://twitter.com/livedoornews/status/1564582854453252098?s=21&t=aCln3RGqmemjC2mUdwD5MA @livedoornews]: [Pointed out one after another] Illustration AI "mimic" Announces Suspension of All Functions all functions of "mimic", an illustration AI, have been suspended.
>https://t.co/GOK1y8p55G
>"We believe that the beta version does not have sufficient mechanisms to prevent fraudulent use," the company reported, "and we will stop all functions. We will release the official version when we have improved the anti-fraud measures.
>[https://pbs.twimg.com/media/FbaDv0gacAEclON.png]

https://togetter.com/li/1938934?fbclid=IwAR1l2UywdW8TbySOfPS2MJcjx3dK9Vz2g2Q2zM3LfrYEkGdRxPeYN9DHeK0



