Inamori Pragmatist Image
[Kaz Toyama (Facebook) https://www.facebook.com/mammy.toyama]
>I know there has been a lot of buzz about Inamori's beef bowl entertainment and other stories on the occasion of his passing, but there are two sides to the Inamori image: one is that of a real businessperson, an inedible old man (I liked and appreciated this side, so I went and asked him to head JAL), and the other is a somewhat contrived (he himself helped direct it!?) idol. There are two sides: the idolatrous and the idolatrous. Shallow journalists jump on the latter and the world accepts it, so this series of reports was mostly on the latter side.
> However, the image of the manager who was very strict with his money and financial accounts, and the image of the God who talked about the spirit of "Respect the Divine and Love People" and "Altruism" and other pretty words, in my mind, the former was the purpose and the latter was the self-control as a manager and mind-management tool for employees to realize the purpose. I observed that the former was the purpose, and the latter was a tool for self-control as a manager and for mind management of employees to realize the former, and that he was a man of "cyclical management theory. I respected Mr. Inamori's true greatness, which was similar to that of Konosuke Matsushita. At the same time, I have never tried to imitate him because it is impossible for me to have that duality and contradictory management style, and especially it is absolutely impossible for me to deify myself or be deified by others. That is why I went to ask him to rebuild JAL.
> I also understand the story of the beef bowls very closely. I don't think there is a 40-fold difference in taste and satisfaction between a 20,000 yen kaiseki meal and a 500 yen beef bowl at Yoshinoya in the first place, and for Mr. Inamori personally, this difference in price is an error, so the effect of the entertainment and the story of the business is to make a decent and sustainable profit at that price. Yoshinoya, which has survived bankruptcy, could have used that location because it could tell a lot more. Inamori-san, whom I appreciate, is a super [pragmatist] who does that kind of calculation.

[Kazuo Inamori]

I guess this is what beef bowl entertainment is all about.
　[In memori: Kazuo Inamori, the management god who chose "Gyudon no Yoshinoya" (beef bowl) for an important reception, and his true intentions | The Style of the "Top-Class" | Diamond Online https://diamond.jp/articles/-/308911?page=2]

