There were people of color in the medieval European aristocracy.
Some people thought that the depiction of the presence of people of color was a "twist of historical fact" (A), but in fact, the presence of people of color was historical fact, and the depiction of all-white people was a "twist of historical fact" (B).

https://togetter.com/li/1939652
	A
		>In the Disney princess movie, there was a black man wearing a dress at the ball and I felt nothing but discomfort...
		>There was no historical research, no hemming and hawing.
	B
		>[https://twitter.com/hakoiribox/status/1565794351980355584 @hakoiribox]: I think it's around Beauty and the Beast or Cinderella (both set in the 18th-19th century in France, I believe), but [* 18th century in reality In France, there is a record of a mulatto born in the colonies who married a local and was active in the central society with his aristocratic lineage and talent], so it's not so unreasonable to say.
  >[https://pbs.twimg.com/media/FbrRqlZagAAM7Oe.jpg]
		>[https://twitter.com/hakoiribox/status/1565800087133257728 @hakoiribox]: If you want to name a black man who was active in the French aristocratic society of his time, it was Dumas. He is the author of "The Three Musketeers". Although he himself was a black man, he was proud of his black roots, and he said, "A black man can't write a novel. He kept challenging those who ridiculed him behind his back, saying, "A black man can't write a novel, it was a substitute. (The second picture is a caricature exaggerating his racial characteristics.)
  >[https://pbs.twimg.com/media/FbrW4HMaUAA5ASp.jpg][https://pbs.twimg.com/media/FbrW4VNagAAynOY.jpg]

		>[https://twitter.com/yoshiful_saney/status/1565918877933916163 @yoshiful_saney]: @eiko_sheena In 18th century England, a countess born to a black slave mother and a Royal Navy captain father You had Dade Elizabeth Bell (the woman on the left in the picture).
  >https://t.co/82poM946We
  >https://t.co/hQ2h0Z8QOi
  >[https://pbs.twimg.com/media/FbtC651VUAU2iut.jpg]

		>[https://twitter.com/cham_a/status/1565826886915465216 @cham_a]: 18th century British, but based on a true story about a mixed-race black female noblewoman, the movie "Belle"
  >In Japan, the publicity was so sensitive to this kind of discomfort that it was often advertised as "Is there such a thing as a black aristocrat? In Japan, the posters were advertised in such a way that the skin color was made as white as possible so that it did not look like such a thing, perhaps in consideration of this kind of discomfort.
  >[https://pbs.twimg.com/media/FbrvQKGakAAUjYo.jpg][https://pbs.twimg.com/media/FbrvQKHagAAHFTM.jpg]
		>[https://twitter.com/cham_a/status/1565828460970659840 @cham_a]: incidentally, when Meghan was getting hate speech about race, Queen Charlotte was the one being talked about. She is also considered a mulatto.
  >https://t.co/ND0xkhm9VR
  >[https://twitter.com/muka_jcptakada/status/1565839972913262592 @muka_jcptakada]: the image of the modern/pre-modern "West" as transmitted to Japan is itself more "whitewashed" than historical fact This is an interesting and important point to note.

[意外]
