Diary 2022-09-10

[https://unique1.co.jp/column/sns_operation/1833/ Easy way to reserve posts on Instagram｜How to use Creator Studio and how to reserve Stories ｜Internet Advertising Agency / Web Advertising Agency｜Corporate Unique One]
	[https://gyazo.com/68fda49ffbf44a038dc57710e14777c0]

Artistic activities, long periods of inactivity, not much on the profile.

"C3: Computer Created Cats" is an online special exhibition featuring pictures of cats drawn by cutting-edge AI.
The curator Dr. NISHIO Hirokazu is a doctor of science, o'reilly author of a book on artificial intelligence in Japanese, and his artwork has awarded on ASIAGRAPH 2009 as an excellent work.

Too long

Pictures of cats drawn by AI. The curator Dr. NISHIO Hirokazu is an author of a book on AI and his artwork has awarded as an excellent work.

>[https://twitter.com/nishio/status/1568305250402193411 @nishio]: my insta profile section is too small to write at all, so I decided to write in the store about and link to it
>https://t.co/ixIxC7SWpl

https://cccats.base.shop/about
"C3: Computer Created Cats" is an online theme shop featuring pictures of cats drawn by cutting-edge AI.
The curator Dr. NISHIO Hirokazu is a doctor of science, o'reilly author of a book on artificial intelligence in Japanese, and his artwork has awarded on ASIAGRAPH 2009 as an excellent work.
He believes that AI will be, like the camera, opening up a new branch of art.

[https://gyazo.com/3b9ad9f5b6c4d732ea9214b18ad4221a]

https://developers.facebook.com/docs/instagram-api/guides/content-publishing/
　Up to 25 automated posts to Insta in 24 hours

>[https://twitter.com/nishio/status/1568450328772878336 @nishio]: AI now also generates explanatory text for Insta-posting (and the posting process is done by humans doing the simple labor of copying and pasting and sending) https ://t.co/EChR8zejXi

I saw the string for insta-posting and thought "wouldn't it be interesting to put this in Scrapbox so that the links are connected?"

I was writing a profile on Scrapbox and I was thinking, "by AI" or "using AI" is a tricky question.
　The individual text in the installment is a "Dr. Nishio created using Stable Diffusion" taste.
　In his Instagram profile, he initially wrote "by AI," and the expression "curator" is not usually used for the person who is creating the work.
　No - but maybe it's important to say that this is the part that bothers me.
　In other words, if it is a human who draws the picture, the copyright belongs to the human, and the curator does not have the copyright.

> (Presumption of authorship)
> Article 14 The name or title (hereinafter referred to as "real name") or its pseudonym, pen name, abbreviation or any other name used in place of the real name (hereinafter referred to as "nickname") shall be affixed to the original work of a work or at the time of offering or presenting the work to the public.  (2) A person whose name is indicated as the author's name in the usual manner by a well-known pseudonym, pen name, abbreviation, or other name used in place of the author's real name (hereinafter referred to as a "variant name") when the work is offered or presented to the public shall be presumed to be the author of the work.

Once an AI-generated work becomes a copyrighted work, anything made by inpainting or super-resolving it is clearly based on the original work, which means that this is where it comes from.

memo
　Fix the metadata of the initially generated exe version, which is repr, pretending to be JSON.
　　Consolidate the placement of metadata into a single location
　Added filter tool functionality
　　"Move it all together to NOT GOOD."
　　Remove this prompt."
　　EDIT this prompt to add."
　Automatic posting to Instagram
　Try to create a network with Scrapbox
　　Automatic submission to Gyazo
　　JSON Generation
　Mastering the art of inpaint

>[https://twitter.com/nishio/status/1568484473930678273?s=21&t=rQH9mOHH4PIboY5Lr_1ggw @nishio]: From Factorio's perspective, it's no use accumulating intermediate inventory. So, the most important thing to implement now is to automate insta-posting.

 I've been posting manually, trying to figure out how to achieve automatic posting to Instagram, and I've finished posting everything.
 I'm posting from the Creator Studio on my PC because it would be too much trouble to automate the operation on my phone.
 API does not support creator accounts
 browser operation
 　Press two buttons
 　Press two buttons to bring up the file selection dialog.
 　Search for file name x and select a hit (1)
 　Put description y in text area
 　Check the box
 　Press the Submit button
 　Wait for a while (2)
 The (1) process is a native file selection dialog, so it's not possible to automate it with TamperMonkey or something...
 When the time-varying submission process is completed in (2), the UI is reset, so do not start the next operation until it is completed.

Wife: "I had to mute it temporarily because it was pouring in so much at once."
 I'd like to do some kind of reserved posting, staggered by an hour.

[Diary 2022-09-09]←Diary 2022-09-10→[Diary 2022-09-11]
100 days ago [Diary 2022-06-02].
1 year ago [Diary 2021-09-10].