C3: Computer Created Cats Digital Data Purchase
2022-10-05
　This one is closed for now in order to give priority to another experiment.

2022-09-19
Surprisingly, there is talk of buying digital data from [C3: Computer Created Cats], so I've been trying to organize it!
　The copyright of the digital data is transferred to you
　　You can use this data X for anything. e.g.
　　 Print on T-shirts and postcards
　　 　Wear it yourself, give it to others, or sell it.
　　 You can create another work based on X.
　　  Collage, change colors, etc.
　　  It can be used as a material for img2img of Stable Diffusion and so on.
　　  Anything made in that way is your copyrighted work and you are free to sell it.
　　 It can be NFT.
　　However, you grant an unconditional license to create commentary on this image.
　　　Specific examples [/c3cats/Cat and the Magic Lamp].
　　　　Thus, it is recorded and published as "made on 2022-08-26 as part of the C3 series"
　　　　Even after the copyright is transferred to you, we will continue to publish in the form of this page.
　　　For example, if a future C3: Computer Created Cats book is published and sold for a fee, you grant unconditional permission to publish it.
　You can put your name on your work (naming rights)
　 Only names that are not offensive to public order and morals are acceptable.
　We reserve the right to refuse to sell any item that you have offered to purchase.
　　For example, if more than one person applies for the same item, I will make the earliest one win!
　　Also, I'd like to avoid any derivative uses that are already in place, as that would complicate the conversation.
　　　For example, [/c3cats/CAP-tan] will be used to explain the contents in the future
　　It's like picking up a cat that hasn't been noticed yet and naming it and making it famous.
　　　A little idol audition-ish.
　　　You might want to hit the [random button https://scrapbox.io/c3cats/Random_Button] in anticipation of a once-in-a-lifetime encounter!


C3: Computer Created Cats Digital Data Purchase
　URL of the work to be purchased
　Name to be listed as purchaser
　Means of contact (email address, Twitter DM, etc.)
　Title to be named for the work (if you decide later, you can leave it blank, please let us know later)
[- [purchase order form https://forms.gle/AmnvVZ2hjL9XaXQx8]]

>[https://twitter.com/yasulab/status/1571678954158968832 @yasulab]: . @nishio just purchased "Cat and the Magic Lamp (Cat and the Magic Lamp)" from @nishio !!! #StableDiffusion
>📸 C3: Computer Created Cats - Instagram https://t.co/QFCHkVOwJs
>[https://pbs.twimg.com/media/Fc-5ZJjaAAEkPHt.png]

