思考の結節点2022-09-20
[作画AI]
　[FON]-like business

[Sekai Camera]
[Second Life] [Metaverse].
Availability of a surrounding [ecosystem] to [make it a habit] to use.
Log-in bonuses for shoppers

Tight coupling of appearance and gender
 If gender is personal information, then [appearance is also personal information].
 Appearance is also tightly coupled with [ethnic identity
 　Asian people

[Can I see your face?]
	Assuming you think it's normal to show your face at some point in civilization, it's not universally normal.
	Naked people walking around with their chests out.
	Article 1, Item 20 of the Misdemeanor Law states, "A person who indecently exposes the buttocks, thighs, or any other part of the body in a place where the public can see them in a manner that is likely to cause offence to the public".
		The face is a part of the body, so if the public is disgusted by the exposure of the face, it is a violation of the misdemeanor law.
	Unrefined civilization
		Mixed bathing for men and women was common in public bathhouses during the Edo period.
	Maybe both men and women will start wearing [hijabs].

[The illusion that faces can be used for personal identification.]
　双子

[What makes a person human?]
	lesbabot
	Comment bot for current events
		Konosuke Matsushita bot, Drucker bot, comments on current events
	[Buddhabot]
		[https://www.kyoto-u.ac.jp/ja/research-news/2021-03-26-3 Solving your problems with Buddha, Development of Buddhist Interactive AI "BuddhaBot" - Fusion of Traditional Knowledge and Artificial Intelligence - | Kyoto University]
 [AI Misora Hibari]
 　Why did the narrative catch fire when the singing was antsy?
 　Narrating is part of the song.
 　Not because it's a song or not, but because he did something he never did while he was alive.
 　　What happens when you get Hibari Misora to sing death metal?
 　Someone might have a gaktroid singing obscene songs.

[Declaration providing postmortem genetic data].
　死後臓器提供の宣言の亜種
　Quite useful, isn't it?
　　I can tell you what a person with a certain gene lived like in his or her lifetime and how he or she ultimately died.