Diary 2022-09-21

[https://gyazo.com/2cc045bc37759a526bb76c71cf3a4b22]
	[OpenSea https://opensea.io/collection/c3-computer-created-cats]
 NFT could be put on sale status.
 	Well, it was difficult, I had to wait overnight due to a problem with the money transfer while someone in the know told me what to do.
	[https://gyazo.com/3b74195f5b8e160fabed731cccd698a3]
		Yay, achievement unlocked "Sell NFT"


Those who sell digital data directly
　I haven't figured out how to settle this one yet, so I think I'll hold off and expand the NFT's.
　[Diary 2022-09-19].


[https://gigazine.net/news/20220920-no-one-profitable-gpu-mining/ GPU-based virtual currency mining "makes no one money" and miners are reportedly starting to pull out, harmed by Ethereum merger -. GIGAZINE]
	Interesting; Etherium spec changes make mining on GPUs unprofitable.
	GPU prices are likely to drop because minorities will no longer buy GPUs in the future.
	Increased incentive for manufacturers to enhance instructions for AI rather than for mining
	That's a change for the better for me.

Thinking about NFT
　5mETH, so roughly 1000 yen.
　It's kind of unbalanced that NFT, where it's unclear what rights you get, is 1,000 yen and the copyright is clearly transferred for 500 yen.
　　We're making the form in Japanese because we see you as a test user who can communicate with us, so let's just say it's a privilege for Japanese speakers.
　I wonder if a close-up of the face would be better in the context of NFT.
　　From the Nishio family's point of view, it's being thrown out with a bang because "the composition of the close-up of the face is not interesting.

Think about inpaint and img2img instructions.
　Take an image as a parameter
　inpaint would also take the mask off.
　take a prompt
　Change the seed and run it.
　There are so many parameters that trying to specify them on a single line in a text file is nonsensical.
　txt2img separates output folders at the prompt, which is inappropriate
　Create folders with start times, etc., and write detailed settings inside.

[Diary 2022-09-20]←Diary 2022-09-21→[Diary 2022-09-22]
100 days ago [Diary 2022-06-13].
1 year ago [Diary 2021-09-21].