soft upper existence
>[https://twitter.com/Dongurihou/status/1568191514416939008 @Dongurihou]: there's so much weird Twitter already, everyone, let's just watch Wombat-chan and relax!
>In case you are wondering, wombats like to be petted by humans, and while in the wild they have a lifespan of about 5 years, in captivity they live up to 25 years because they are not stressed or anything.
>[https://pbs.twimg.com/media/FcNV3jkaMAAUfxw.jpg][https://pbs.twimg.com/media/FcNV3joaUAIJ77J.jpg][https://pbs.twimg.com/media/FcNV3jnaQAE3AD5.jpg]

>[https://twitter.com/nishio/status/1568782684671082498?s=21&t=dDnBm_U2ClhBaRvyhytVyg @nishio]: If a 3-4 meter tall soft and fluffy higher being takes care of us, hugs us and pats us, saying "Let's clean up your body" and "Here's your food. If a "3-4 meter tall soft and fluffy higher being" takes care of us and hugs us and pats us and says "Let's clean your body" and "Here's your food", we might be able to live 250 years happily without the stress of living, is that it?
	[SF Settings]
	Let's feed them [human jelly].

>I'm starting to think that it's a big, soft, warm, enveloping, supernumerary being, [off-tune]. I'm getting the feeling that it is.
> If you just sleep wrapped up in an off-toon, food is served, sometimes they wipe you all over with a warm steaming towel, and you can watch endless content viewing and play games with VR goggles-like...
> When everyone is having a good time like that, there are those who will rip off the futon and scream, "Humans are being deprived of their freedom and made into batteries! and some of them start ripping off the bedding.

> Let's deploy a 4-meter-tall off-the-road robot that hugs and soothes you at major train stations as a public health measure to maintain the mental health of today's high-stress, mentally damaged people.
	> "I don't know which uncle used it, but I can't use a public off-tune!" Gahn!
	> No, even hotels provide service with bedding that you don't know which uncle used, so if you replace the sheets with clean ones, you'll be fine.
		> Should one of the plans for the hotel be a 4 meter tall fluffy warm robot that sleeps with you and lulls you to sleep?

>[https://twitter.com/nishio/status/1568837316969627649?s=20&t=eKr7sRUYI3o9NaS7Z8XbZw @nishio]: all we need is a [Qoobo] with a diameter of 4 meters?
>https://t.co/zRNqVQPJB1


Protection of [stray homo sapiens

