Diary 2022-09-22

[https://scrapbox.io/files/632b4cf0ba2305002083a5e4.png]
>[https://twitter.com/nishio/status/1572636353158082560?s=21&t=_aXSPubHP5SOp8ZLnYRoRg @nishio]: NFT made with #StableDiffusion, started a face series
>https://t.co/sV39ooC6qz

>[https://twitter.com/nishio/status/1572637783843545088?s=20&t=Bpk6DuajyUqtD4elAfqn6w @nishio]: I was thinking 5 at the sharp end, but if you're going to take screenshots, 8 is I'll add 3 more.

>[https://twitter.com/nishio/status/1572641774467944450 @nishio]: I measured how long it takes to add 3 cards, but it took me a little over 6 minutes, so even 8 cards won't take 1 pomodoro, my wife would be more efficient! I think my wife could do it better.

In other words, 1500 images are automatically generated per day, selected and around 100 per pomodoro, 48 are posted to Instagram, and about 12 per pomodoro to NFT.
Hmmm, increase the efficiency of making NFTs?
Well, now is the time to try things, so it's more of an experiment than an efficiency improvement.


I suddenly found myself looking at the most liked posts on Instagram.
There are some that say, "Yeah, yeah, I like this too.
'Oh, you like this?' Some of them are called
It's interesting to see the rankings, so I'll see if I can create a script to output the rankings with images over the weekend.
It would be good to give a ranking every weekend or every other week.

>[https://twitter.com/nishio/status/1572759023535157249 @nishio]: I'm starting to feel that a stock split metaphor would be good for NFTs. If the NFT you own becomes popular and the price goes up, you split it 10 ways. The seller can take a partial profit while still owning a portion of the stock, and the buyer will no longer be unable to buy the stock because it has become too expensive. I wonder if this can be realized on top of the current structure.
[NFT]

Another three-day weekend starting tomorrow
task inventory
	✅Ranking of Insta likes with images
	Instructions for inpaint and img2img [diary 2022-09-21#632b0b13aff09e0000a6378b].
	Palmy's Beginner's Course continued

Ranking of Insta Likes with images, done [/c3cats/Instagram Likes Best 30 (~2022-09-22)].
>[https://twitter.com/nishio/status/1572952960514297856?s=21&t=s-2arW_0_o0veu-dxyJn2w @nishio]: the insta popularity ranking is ready. Something unexpected was at the top. I wonder if there is a concept of "fugakawa" even in foreign countries.
>https://t.co/Zj5n74vRKF
>[https://twitter.com/nishio/status/1572954399236067329 @nishio]: honestly, I thought people in the world liked this kind of stuff.
>[https://pbs.twimg.com/media/FdRBsGNaIAIm5Mg.jpg]
>[https://twitter.com/nishio/status/1572954824660099072?s=20&t=4urdrbpWCZzMHao_ZEcpRA @nishio]: it's close, but this one wins~!
>Well, I can certainly understand the "the former is no fun, this is more fun" (and so is my wife), but I thought people with that sensibility were in the minority.
>[https://pbs.twimg.com/media/FdRCE24akAEpfLZ.jpg]
>[https://twitter.com/nishio/status/1572955701898792967?s=20&t=4urdrbpWCZzMHao_ZEcpRA @nishio]: My wife picked this one and I was like, "That's not really a cat, well, with the title 'Cat' it would be paradoxically funny, but it would be funny if I put it out there. I'm also surprised that this one ranked 20th out of 315 entries.
>Maybe my wife has a deeper understanding of art sense in the world.
>[https://pbs.twimg.com/media/FdRC35vakAAohS5.jpg]
>[https://twitter.com/nishio/status/1572956233036075010?s=20&t=4urdrbpWCZzMHao_ZEcpRA @nishio]: my wife says it's not good, but I guessed this one, so I'm smiling that it's ranked
>[https://pbs.twimg.com/media/FdRDW2SaMAEHzMs.jpg]

>[https://twitter.com/nishio/status/1572965239393783808 @nishio]: I don't know if I made it, but "From 315 AI-drawn cat pictures, more than 400 followers around the world (90% outside of Japan) rated it with likes, and 55 likes were collected. I like the idea of beating art with data science (is it good?).
>Ignoring arguments such as whether it is good art or not, or whether AI works can be art or not, we accumulate data without hesitation and talk about it with data.

I noticed something like this dashboard.
　[https://gyazo.com/835c72f57f470470104dff96a9859444]
　Has this ever happened before? Has it ever come up with enough data?

Today's Nishio Family
Wife: "I wonder what kind of tool you use to measure by pinching it."
I "calipers".
Wife: "What kind of kanji?"
I said, "Eh, sure, what language is that?"
Answer: a corruption of the personal name "Nonius".

[Diary 2022-09-21]←Diary 2022-09-22→[Diary 2022-09-23].
100 days ago [Diary 2022-06-14].
1 year ago [Diary 2021-09-22].