Need to create an activity history archive
>It would be great if we could create an archive of artists' activity histories and evaluations.

>Creating an archive is a process of historicizing art.

>This is another White Cube story, but there was one maniacal staff member who worked silently on it. He kept everything from Damien Hirst's (see p. 125) first exhibition sign to doodles he drew while eating, all in clear plastic with white gloves on. Anyway, everything related to that gallery and artist was stored in a small room.
> I was impressed by that and said, "You are very smart. That's because we are consciously practicing [historicism], making our own history.
> From now on, just like the press, galleries will need to build archives to historicize art. History is created when artworks become established in the market, but archived history can also create a market in reverse.
[Contemporary Art Business] p.50

Compared to those who create physical works, it is much easier for those who work digitally to store digital data

Until someone comes along who can do it for you, you will need to create your own archive.
　Interesting story in the early stages when something occurs, but tends to dissipate as early as the beginning
　[Connecting the Dots]
　 You never know in advance what will lead to what.

I have been "consciously practicing historicism" since I read this book in 2009
　I was able to quickly pull up the history of "this is 2009" with Scrapbox, but looking back on it now, I think I missed the "market makes history" part at the time.
　My [Virtual Star] was a one-of-a-kind product that cost a lot and was not marketed.
　　It wasn't the type of thing you could make variations on.
　Among my works, [The Technology Behind Coding] and [An Engineer's Guide to Intellectual Production] are the two that have been widely distributed in the market. However, these are the type of books that are "identical in countless numbers and have no scarcity value" due to the format of technical book publishing.
　In that sense, the "fact that we made [NFT] and it sold well" that came out of trying out various things with [C3: Computer Created Cats] now, I guess you could say that we are doing "the market makes history.
