STEPN Play Diary 2022-09-26~.
[https://gyazo.com/1f8c862be04d37b4d5a2ce90c233070d]

Day 1 [STEPN Play Diary 2022-09-25].
2nd day
3 Energy accumulated, so it increases at 10:00.
Will it create an incentive to say, "I'm going to overflow if I work until the evening before work, so I'll exercise a little before work or during my lunch break?"

[https://gyazo.com/ad542823b1e94ebbfdbd613c49e26109][https://gyazo.com/e3fe4a19cbb2c2201fd1b7e5060d9126]

I got about 17, durability is down 8, need 3.3 to repair.

[https://gyazo.com/dccbca8f91456494778713de3c525837]

Yes, we have to think carefully and decide what to use as KPI when we have numerical indicators.
I think this is the KPI, not GST.
[https://gyazo.com/3b875f8ead4d13349e975365528ffcd6]

Well, moves and exercises will be on the rise sooner rather than later. I guess the long term goal is to increase cardiopulmonary function...
[https://gyazo.com/e4cee47ad44390612bfd9a8338c5bf3a]

2022-09-27
[https://gyazo.com/63527ed5759b70274a7dcb37e8df3a49]
Light exercise before breakfast.

Whoa, now I can do mint.
[https://gyazo.com/e41dd25fdce399e64244bb3f2bea09d2]
But the ones I can mint now are the more expensive ones, so I'll see you later.

[https://gyazo.com/4a24f1b669d2575d24e0159fc8631ba5]
Sold my runner and bought a mint 0 jogger.

2022-09-28
[https://gyazo.com/0042328319e7d427157e620c8ce1b703]

Whoa? What's that mystery box you're picking up?
　[https://gyazo.com/ea807a4c105f23785dce535cf098755b]

10 Energy consumed, so Invite rights were created.

I won't do it, but I'll check the mint screen.
　[https://gyazo.com/b7a0e155e3db463fe784ffa72123208a][https://gyazo.com/7c9a516e84b3e92e660b3a7d5d3c7d9b]

[https://gyazo.com/0bd043da1b5a1e96aecb6ddcc466926f]
　Need GMT to level up!

I did eKYC for BINANCE.
　[https://gyazo.com/7d9d547b3392358f45353aeab6944382]
 　I thought I was buying GMT at BINANCE, but I was wrong.
　　You can trade in-game.
　>If you wish to purchase a GMT Token that is not currently listed on Binance, you can follow the step-by-step guide below.
　 https://www.binance.com/ja/how-to-buy/gomining-token

You need 10 GMT to level up, 0.4 for 10, so you need 250.
　Ah, but it's a realistic line if you're walking it daily.
　　[https://gyazo.com/f100869bbcff83cd6bb12a18f2586be0]
　I'll send 25 GST, Fee is 2 GST.
　　I got 23 in the wallet.
　　　27We should have sent the money to the bank.
　　Convert to GMT
　　　They say I need a token account.
　　　　I need SOL as Gas to create an account w
　　　　I wish you'd write down how much you need.
　　  I have 0.49, I'll send you 0.25.
　　  Is Fee still 2 GST in this case?
[https://gyazo.com/522fb69871f942c3ca85d397a12e5c7d]

It's going to take a while to finalize the trade.
Ah, it's done.
　[https://gyazo.com/defd18ba65b087add2dd89787052c99c]
　　Why USDC is boiling over is a mystery.
Now you can put the GMT back on.
　[https://gyazo.com/b5021118c9f724137c629729e8321837]
　It took a minute or two for the money transfer to be reflected on the screen after it was successful.
　　I'm in a hurry because I thought it was gone.

　Level up to level 5 could begin.

2022/9/29
I have to go to the office today, so let's see how many GST it costs to get to the station.
　It was 1.8 Energy.

1 Ether is $1349, 1 Solana is $34, 1 Solana is 1000 GST, so 1 GST is about $5, 1 Solana is 50 GMT, so about 2 to 30 GST, or about 1 to 200 yen.
That means I put in 10 GMT to get to level 5, which is about $1-2,000. That's quite an expensive game.

2022/9/30
Walking in the morning because it overflows if not used by 10:00 a.m.
[https://gyazo.com/ed542e41df014902c2c838e323ee03c2]

Looks like Saturday and Sunday will be sunny.
　Add 0.1 Ether
　Oh, I'm missing a few subtleties, I'll just use 0.2 Ether because it's too much trouble.
　　Approx. 40,000 yen
　Now you can buy 4 pairs of sneakers and your energy limit will be 9 (45 minutes).
　I really thought it was going to be 9 feet at Mint during the weekday, but it didn't happen.
　　I sold the runner and the liquidity is not that low, so I think I can sell the surplus after it increases with Mint and not lose too much money.
　Five solanas would be enough to buy four pairs, leaving the rest in the wallet.
　Buy 4 pairs and pay 4.89 solana

I'm wearing a pair of sneakers I bought at random right now, but I'll mint them and grow to like them from the growing number of sneakers I have.

Observe mint costs
　[https://gyazo.com/79e53e19c72de01acdc79559e6da61cc][https://gyazo.com/b7a0e155e3db463fe784ffa72123208a][https://gyazo.com/7c9a516e84b3e92e660b3a7d5d3c7d9b]

 I have 2.3 SOLs on hand now, and if I change all of them to GMT, I'll still have about 70.
 　I can mint it once, but I'd sell it for 1.3 SOL and lose money.
 　Well, if it were that easy to make money, everyone would do it.

[https://gyazo.com/43ba85b6221494ad42d1fbfc898f2009][https://gyazo.com/0bb889f106674a8388087e150e0b8ddd]
You're just decreasing.

[https://gyazo.com/a71d85d32f49b39ef9e133eacb516d06]

This would hit the coin limit, not energy.
[https://gyazo.com/b153befed806f4f3ea13934fb197f152]
I see.

[https://gyazo.com/13dcbc9dedd1308404d21684de174b3c]
I changed everything to GMT and made a deposit.
Let's level up this evening and do our first mint tomorrow.

2022/10/2
[https://gyazo.com/95d610ebdf67d5891d9043ad693106e1][https://gyazo.com/d27fc48088a6b3ef7d85fc99f5c4e15b]
Ah, well, I'm missing a GST.
　We could solve this by charging for it, but the idea of "walk for a week and you'll be able to mint next Sunday" would be a better incentive to walk on this one.

[https://gyazo.com/f82a3adff192e66edfd9c79c5c0235ca]

2022/10/5
　I've been in the habit of "walking about 45 minutes every day and getting 50 GST" for a while now.
　To explain in a few words what STEPN is at present, it is "an application to create an exercise habit by paying 30,000 yen in advance and getting 250 yen for a 45-minute walk every day.
　　That's where the value is for me.
　Today is the first rainy day.
　　What will happen?
　　[https://gyazo.com/74dc845a7e49db3345a1ecbb10f16926]
　　Oh, I walked last night, so it's almost full.
　　I'm hoping there's a GPS-accessible course that I can walk on in the rain without getting wet.
　　 Well, maybe a shopping street with an arcade...
　　I just wish there was someplace I could walk in the winter where it wasn't so cold.
　　Well, it's not easy.
　　　I wondered if I would have to go to the station and take the train, but then I realized that I could walk on the station platform without getting wet.
　　When that happens, there will be a mysterious reversal of the situation: "It's raining today (while going to the station to walk), so I'll go to work.
　I won the alpha tester lottery for [sleepgochi].

