self-developed
>[https://twitter.com/ohashimasaki/status/1572720636715495426?s=21&t=B76gK2j9QGb0csFU8spfsw @ohashimasaki]: Roland's newsletter (in the Roland dressing room), Why do engineers develop on their own? I'm amused by that.
>"The reason why I'm selfishly and secretly developing it is that if I put everything on the plan, I have to report how soon I can do it..."
> "We don't know how long what we want to do will actually take...so we make it secretly and silently, let them hear it when it's done, and mount it...we can't do that if everything the engineers do is controlled."
> This is what is being lost in IT companies...

>"If we were to do everything [according to plan], it would be a boring instrument. The plan gets in the way... In a way, it's an organized crime... because you have to believe that they are doing it on their own because they want to "please the customer. I can't trust them if I suspect that if I don't manage them, they will slack off."
　[If you build it exactly as planned, you'll end up with something boring.]

>[https://www.roland.com/jp/promos/gakuya/ Roland - In the Roland dressing room | TOP]
>I can only read it by email, but maybe it will appear in a back issue soon!

Later, after it's published in a back issue, I'll change it to a quote from the big source.


relevance
　[Underground research].
　Developing something on your own and keeping it secret are not tightly coupled.
　　If "50% of work time is set aside for free research," as in Cybozu Lab's [50% rule], then the report will say, "This is what I was working on this week," after researching a theme of their own choice.
　As I was writing this page, I was thinking that the 50% rule does not mean "I can use 50% of my work time for research [* as I planned at the beginning of the year].
　　Stable Diffusion has been released!" and you can start spending time tinkering with Stable Diffusion the moment you see the news.
　 We're not explicitly discussing it or writing it into the rules, but we're actually doing it.
　 It's outrageous to do something that isn't in the plan! If you want to do research on drawing AI, put it in next year's annual plan and do it next year!" No one would say such a thing.
