STEPN Play Diary 2022-09-25
[https://gyazo.com/7fb329c887f6a1a207b770d7cc3d20eb]

Day 1

from [Diary 2022-09-25].
STEPN Play Diary 2022-09-25
STEPN Settings
　what we're doing
 	I have a STEPN account created.
 	Need to buy a pair of sneakers to play with.
 	Need Solana to buy sneakers
 	Solana is not available on Coincheck.
 	Convert with FTX
 	I eKYC'd at FTX.
	Send ETH to FTX and change to SOL
	　How much? How much are sneakers in the first place?

FTX Referral
	https://ftx.com/jp/referrals#a=155510446
	>Referral program information
 > When users sign up with your affiliate link, you will receive 25.00% of their trading fees and they will receive a 5.00% fee discount on all their trades.
 > You can increase the fraction of your referees' trading fees that you receive by staking FTT!

[https://gyazo.com/aafa29f22b1c61222041d4ab3c7f4bf9]
　I see, if I press Deposit on this, I get an address for deposit.
　I thought I'd send about 10,000 yen for now, but MetaMask only had 8.2mm Ether, I sent it all anyway.
　Did you leave the rest of the Ether in CoinCheck?
　　It's a pain in the ass every time, so I'll just put about 0.5 Ether in the meta mask.
　　I don't have a good impression of CoinCheck because of the hassle of having to enter all kinds of information and then being rejected for not being able to send money for 2 minutes after logging in, or having a human checker reject the money, etc.

[https://gyazo.com/677b92052f5e0f2accd8fa29fd0da83b]
　Oh, it's displayed in Japanese yen, kind.
　Then the next step is to change this to Solana.
　[https://gyazo.com/ce6a1c2fdbca49acbb0e9a243becd203]
	It's done.
	[https://gyazo.com/97059f93e3ba8f22dd0feebe94657c0d]

So the next step is to send this money to STEPN?
　[https://gyazo.com/5c7edecc4c2d440a285d36af87805095]
　　It sounds like something that could be done with Ether, but w
　[https://gyazo.com/14bf17cd0757c9cbb9d5fb1e5a5c668b]
　　I see. I'll make a wallet.
　　　[https://gyazo.com/77a7de71f407ec07cc2f7794171433e5]
　　　　I see, if I choose All here, I can use Ether.

　[https://gyazo.com/9e7e53584282f44b3610d80dd856f430]
　　You can buy it on Binance! I'll tell you what.
　　Ignore it this time and transfer the money from the FTX.
　　[https://gyazo.com/fbb5b22ef3d458fbae9bbd64c3be77a3]
　　natives
　　[https://gyazo.com/5951090a6d62bc09f8c9104862691c88]

So, what was it?
　You buy the sneakers.
　let's see
　　[https://gyazo.com/55db2ea6c4b7ab53d59846e8e113f1db]
　　https://stepn.com/howToPlay
　　I see
　　　[https://gyazo.com/1268141986ce63c964e5636f54063cdb]
　　　　Maybe JOGGER because it's like this.
　　[https://gyazo.com/5703c8bf20879ab34a69780624d3c6bd]
　　　I'm not selling anything, okay?
　　　Oh, you mean like this?
　　　　[https://gyazo.com/ccc045c8215c4ceae2a07e39be49f166][https://gyazo.com/91e47540b9fb0a6b7c97781c51a91ccd]
　　　Still no.
　　　　https://blockchain-game.jp/how-to-buy-shoes/
　　　　>I can no longer access the market directly from the app.
    > http://m.stepn.com
    I see, there's Apple.

　I was able to do it!
　　[https://gyazo.com/da4449ed205d088d37a03a093c65e6c1]
　　I couldn't buy anything for about 0.3 solana w
　　Then, well, I'll deposit about 10,000 yen as originally planned.
　　By the way, uncommon 4.2 ~, rare 22 ~.
　　8mm Ether is $1,500, so about 6 times that, or 50.
　　　You can transfer money from Metamask to FTX for a fee of about $30.
　　　Money received in two minutes.
　　　Change to Solana, withdraw to STEPN, and transfer the received money to your Spending account.
　　　Image of the time it takes to move from being a solana to being a solana.
　[https://gyazo.com/8776886778e93fc3e8207c0fcce78239]
　　It's done.


What to buy.
　There are some minor parameter differences and such, but there's a hint of a deeper syndrome.
　There is the idea of buying something with a higher level, but well, my main goal is to "experience the game", so I'll just go with lvl 0.
	[https://gyazo.com/a325070ccf21ab2f86474d30d5110105]

OK! This should be the end of the setup! Let's walk!
	[https://gyazo.com/9788649256b862ab4311e946a288517b]
	They say you have to have a buildup of energy.
		>Recovery every 6 hours at 4:00, 10:00, 16:00 and 22:00 JST
  I see, you recover 2 Energy in 24 hours, and a 10 minute walk consumes that.
  　With one foot, it's like "walk 10 minutes every day".
  　If you want to keep earning while you're doing your normal hour or so of walking, you'll need six pairs of shoes.
  　Ten minutes a day is not very exciting.
  I'll put in about 110 milli Ethers...
  　So this is how you create opportunities to charge.
  　I bought a level 5 jogger and a runner for each.
  　[https://gyazo.com/dcf254f38aa4895ed0b96343febff7db]
  　He said he bought 3 pairs, energy limit 4.0, and the next increase will be 9 pairs.
  　　Well, for the time being, I'm going to try these three pairs and find out what kind of play is right for me.

[NFT's experiment in having children].

Okay, now that I have accumulated energy, I'll go walking this time!
　I don't know how I'd like to walk, so for now, let's just go to the park I usually use for walking and start.

I had to walk fast because I was afraid that if I walked sluggishly, I would fall below the lower limit of the speed at which I would be rewarded.
　[https://gyazo.com/7b5c4f7e949b64770dc7a175a4c6d26c][https://gyazo.com/5d42124139784f6f517f66ef6e26a79f][https://gyazo.com/9d5c 50178497dbcb387b5135dc3a424c][https://gyazo.com/4dc74413290b2ff60c227bfdcee417f5]

Earned 2.2 GST
 Durability is reduced by 4 and requires 1.2 GST to recover.
 1 GST by subtraction, which is roughly 3 cents.
　Let's compare next time using the sneakers of the Level 5's.

I also bought Runner because I thought it would be better to have it in case I feel like running, but given my fitness level, Jogger is good enough for me, so I'll try buying Jogger and selling Runner!
　Runner had the lowest price at 1.075.
　　Let's see how long it takes them to sell when we put them on the market at the same price.
　　[https://gyazo.com/6b213298b4c56000a529d3b72a9975cd]
　　17:30

capture site
https://blockchain-game.jp/lp/stepn/
calculator
https://stepn.guide/

83
	[https://gyazo.com/2ee3e76a19aa4821963f0b8c7481dc71]

53
	[https://gyazo.com/4d0697f6a04b96ef04595d351cb3f2ac]
	[https://gyazo.com/f679e08a78e9632f3b12dd4cf43a5083]

82
	[https://gyazo.com/e5ad1141ace11c4f5cbb99c92c2b87a5]
	[https://gyazo.com/581942acdb7029d3993cd8e86a7a37a9]

I see, hey, the higher the level, the higher the repair cost.
　When the common sneakers are level 9, the income is about double.

When I thought about leveling up my level 0 sneakers and minting them, I subconsciously thought of "walking around in level 0 sneakers," but leveling up uses GST, so I don't have to wear them.
　Interesting how these misunderstandings came about.

I think I'll aim to exercise every day tomorrow, since it's a weekday, at least to commute to work, and I'll be on the 9-foot system by the weekend!
　Real time game, so development is leisurely.

next [STEPN Play Diary 2022-09-26~]
