draw-in
I've been misconstruing draw-in as "pulling in the belly," but apparently not.

Different example
　Hold your breath and pull in your stomach with a yelp.
　　The belly is retracted.
　　Can you breathe or walk in that state?
　　　→I can't do it.
　　So it cannot be sustained.

A slightly better example
　Squeeze the belly without holding your breath.
　Mainly the upper half of the belly tightens while still being able to breathe.
　They need to tighten up their hips in addition to here.
　　It is sometimes described as "tightening the asshole," but apparently it refers to tightening not only there but also the surrounding muscles in general.
　　In my wife's case, when she walks while doing it, it comes to the inside of her thighs.
　　　This is probably because they have [X-legs] and [knee adduction], which are common in women to begin with, and they're being pulled back.
　　It doesn't feel that way when I do it.
　　　be crazy about
　　　This is probably because I have a [warped] back to begin with.
　　　You mean, "The contraction of the transversus abdominis muscle pulls on the thoracolumbar fascia, which extends behind the lower back."
　　[骨盤底筋]？
　　　Tightening the pelvis?

[https://yogajournal.jp/4663 5 benefits of training pelvic floor muscles! Where are pelvic floor muscles located? Yoga and Training for Effective Training | Yoga Journal Online]
	>[https://gyazo.com/f033916afdf4d16ddcb5d1bf58bae196]
　Oh, I see. That's the kind of muscle you have.

The posture of lying on your face, elbows up, lazily fiddling with your phone.
　At this point, from the dove tail down, you're on the floor in a sticky mess.
　Belly pressed hard against the floor.
　Tightening the abdomen from this position reduces the pressure on the abdomen.
　　(really float).
　　Change is easy to understand
　　I'd float if I tried, but right now I'm pretty much giving it my all and putting all my energy into it.
　　　If you put your shoulders and stuff like that, it's going to be something else.
　　I need to be able to just tighten my belly while looking at my phone.

I traced the photo from the side.
[https://gyazo.com/28abd84c754cdfab827f34eaf7bb2cfb]
　Gray is when you do nothing
　I've been told it was a draw-in, and I've been pulling back to red, yay!
　　This takes a lot of energy and doesn't last.
　If you keep it to about blue, you can walk, etc. in that state.
　My wife said, "Shouldn't we do this several times a day, down to the red?"
　　In a stimulating sort of way, I think it does.
　As for whether or not the belly shows on the T-shirt, if it's gray, it does, but if it's blue, it doesn't.
