rebalancing
[https://gyazo.com/8fd997733b82fa6c33f2722979806cf7]
First you have one unit of A and one unit of B. Then when A doubles, it converts A to 0.5 units of B to restore the original balance. This is rebalancing.

From B's point of view, it becomes "A has gone up in price and [fixed profit]".
The same phenomenon is seen from A's point of view: "B dropped to half price, so I bought more ([Nanihei]).
Especially with regard to [foreign exchange], we tend to think from our own country's point of view, but I don't think it is appropriate to take a one-sided view because people with different points of view are participating in the market.

The act of rebalancing after an imbalance always results in "selling what has become expensive and buying what has become cheap.
　When I sold dollars and bought yen at a time when the yen was weakening and the dollar was making a lot of noise, I was told, "That's a great [contrarian] move," but is it contrarian?
　　There's no point in arguing here, time will prove it.
　　[https://gyazo.com/46a4616cf50e5edf8e673986c4ede044]


When "A or B doubles, and we don't know which one it will be."
　Having two credits of one X is a "it's either two credits or four credits" bet from the perspective of current value.
　On the other hand, if you have one unit of both, then "it will be three units" and it is not a bet. In other words, [the risk] is gone.

Holding all assets in yen corresponds to the former.
　If you want to explain how a weaker yen increases the price of iPhones, you need more than just A and B. You need product C.
　　A commodity whose production costs are paid exclusively in A will increase in price when A doubles.
　　So let's just identify with A, shall we?
For those whose consumption consists solely of yen-denominated costs, there is zero risk of buying any dollars at all.
 It could have happened in the Edo period or something.
 It's not easy in this day and age.
 Burning imported fuel to generate thermal power and using that electricity to run TVs that contain large amounts of chips made overseas to watch Netflix and YouTube Premium.
　I wonder if the minimum risk is to have dollar-denominated assets in a proportion equivalent to the proportion of costs paid in dollars in consumption.
