Point, dispersion and distribution shape
There is point recognition, variance recognition, and distribution shape recognition.

When you have choices A and B and you're trying to figure out which is better.
	[Point Recognition] recognizes each choice as if it were a point on a number line.
	When [recognition of dispersion] is done, it looks like this figure
　	[https://gyazo.com/9324898fb86b09c25e28197c25d8a5ab]
	　[Frequently Asked Diagrams].
　　Comparing A and B in terms of expected value returns to point recognition.
　　Comparison by expectation is not the only truth.
　　When you try to compare the two with 95% certainty, you get a reversal of the relationship between the big and the small.
　　　[https://gyazo.com/0cb3d9d5c2ab4a253d81ee6533157d4b]
　　For those who perceive it in terms of expected value, the option of reducing the variance without changing the expected value "doesn't make sense."
　　　[https://gyazo.com/9b0a40149fdcd460b6de970c38f5d5af]
　　　For example [rebalancing].

On top of this recognition of dispersion [recognition of distribution shape
　A world with no recognition of distribution shape is a normal distribution where the distribution is symmetric
 　Expected and median values match.
 　50% chance of exceeding expectations
	>[https://twitter.com/tokoroten/status/1574983234089549825?s=21&t=FS_1IZYnJctvWUPE3fBa1g @tokoroten]: By the way, I'm not saying that this company will succeed, I'm just saying that VC's invest in venture companies with the goal of getting 1 in 10 deals, so let's consider the upside.
 　I thought a lot of people didn't seem to get this.
 　This is talking about "the rationale for investing in something that has only a 10% chance of exceeding expectations"
 　　Or we could say, "There are cases where it is reasonable to pay for something you know will fail 90% of the time."
　　Mode 0 in some cases
　　　There are cases where it is reasonable to invest in an investment even if the "most probable outcome is that it will be a scrap of paper.
 　　[https://gyazo.com/cf0f69711542660f6ae0c83616429921]


