Diary 2022-10-03

I saw [Otani Onijunori] on Twitter and OCR'd it as interesting.
　The original source is Dentsu's [Oni Jusoku].
　I wouldn't try to make something like "Nishio's 10 rules" myself, why not? I thought.
　Once a decision is made, it is difficult to change it.
　　You'll be less likely to change it, and others won't be able to change it once it starts rolling out of your hands.
　Mostly it depends on the situation.
　　Using unconditional "do X" type words as a basis for action is [stop thinking].
　　In that sense, is [think] the highest command?
　　　No, but there are situations where it's optimal not to think about it.


Scrapbox can now be updated.
　I updated it and it's just barely less than 1000 pages.

Maybe I'll add a mode that automatically pages through in 5-10 seconds for TV.

I can now review on my iPhone.
　[https://gyazo.com/d8cbc30f1193f14fb6db9fb04a8deb66]
　It works on my iPhone, but if I open 1500 images or something, my iPhone gets sluggish.
　　I still need to create an API to get 18 or so as well as the TV display.


The Okoso series is easy to understand: "a series of works born from a common seed."
	[https://gyazo.com/92d15d41c7a8739e2601255598926b5b]
		[https://kotobank.jp/word/御高祖頭巾-40157 What is Mikogoso Toukin - Kotobank]
　You could say it's a sibling cat.
　Some of the past works actually came from a common seed.
　　In some cases, people don't even realize it.
		[https://gyazo.com/d4222dfcf8f8fcbb492cf3641dd5aec0]
		[https://gyazo.com/0e9511083c9c3bfb22b94e09688aeacf]
		[https://gyazo.com/26c3f08357e1b0f936c7379d8c005bed]
　　　One of them is deformed...
　　　My wife put this variant on the GOOD list for some reason. w

Interesting series on the same theme with seed fixing feature.
　More Okoso series.
　The Okoso series isn't in Scrapbox yet, I wonder why?
　[https://gyazo.com/974fbf266c702e510c6c8e18ec2568cd]
　[https://gyazo.com/7a91cf6fa2f2d09a155fc27a31a09fdb]

>[https://twitter.com/8co28/status/1576834683043999744?s=21&t=HpXPc1tO_ZdZcAkPUOLhgA @8co28]: #NovelAIDiffusion #novelAI has been released 8
>No additions, no edits, no output
>Black and white cartoon style drawing: ......
>No, AI No, I want you to wait No, ......
>[https://pbs.twimg.com/media/FeIKU8naEAArE3d.png][https://pbs.twimg.com/media/FeIKVYhagAIZqBt.png][https://pbs.twimg.com/media/FeIKjFZaYAA9VYs.png][https://pbs.twimg.com/media/FeIKvikaEAAXE4N.png]

>[https://twitter.com/picco_xxx/status/1576891851516579840?s=21&t=Ex7GlA41hl9EF-grokvCRQ @picco_xxx]: I generated it from an illustration (the first one) I wrote myself on the site, the one you're talking about! I tried to generate it from the illustration (the first one) I wrote on the site!
>#NovelAIDiffusion
>#NovelAI
>[https://pbs.twimg.com/media/FeI-T8PagAEXo10.png][https://pbs.twimg.com/media/FeI-d7DagAEd-aM.png][https://pbs.twimg.com/media/FeI-fSDaYAALTZ_.png][https://pbs.twimg.com/media/FeI-hgvagAENFHD.png]
	What, magic?
	　[It looks like magic.]
　Twitter seems to be on fire with this accuracy and the use of unauthorized sites in the training data.
　　People who are angry but can't complain to the provider in English are beating up on the appropriate Japanese.
	>[https://twitter.com/yukiteru3777/status/1576931175284633602?s=21&t=Ex7GlA41hl9EF-grokvCRQ @yukiteru3777]: now that AI can draw moe pictures, doujin I think the hurdle for making games has been lowered significantly.
 >It is a good thing that the development of AI is bringing more and more things within the scope of the individual.
 >I can't say yet if it's safe to sell these...
 >#NovelAIDiffusion #novelAI
 >[https://pbs.twimg.com/media/FeJffE6VIAA8V0K.jpg][https://pbs.twimg.com/media/FeJfmrFUAAQsfyi.jpg][https://pbs.twimg.com/media/FeJfoF3VEAA_1TC.jpg]
 	I see.
 >[https://twitter.com/mit_4_65/status/1576868410742276096?s=21&t=Ex7GlA41hl9EF-grokvCRQ @mit_4_65]: since I reached the commercial level at once with NovelAI, the most I'm afraid of.
 >I think it's becoming "an illustrator who delivers a slightly modified version of a picture drawn by an AI and gets the usual unit price.
 >You have to be the one who can use it quickly, or you'll be exploited.
 >#NovelAIDiffusion #NovelAI
　　["AI will take our jobs" is a low job resolution].

Modern Luddites
　Flaming service providers on social networking sites
　Flaming users in their own country if they do not speak the language used by the service provider

In that case, the next step is to "shut up and use it."
Next, "If you place an order with the condition of not using AI, the unit price will go up, and the client will start saying, 'It's OK to use AI.'"
Skills will be required to make minor modifications when AI-generated products subtly do not meet customer needs.



>[https://twitter.com/n_en_u/status/1576889839907409920?s=21&t=yBdTO3yMojjkBLbZLEDIEQ @n_en_u]: @chanakikun You are working, but that doesn't necessarily equate to having a job. It's not necessarily equal.
 I'm not sure of the context, but I'm thinking that "whether or not you're working", "whether or not you have a job", "whether or not you have a job" might all be independent.

[Diary 2022-10-02]←Diary 2022-10-03→[Diary 2022-10-04].
100 days ago [Diary 2022-06-25].
1 year ago [Diary 2021-10-03].