Orientation of stacking varies from person to person.
[https://note.com/4bata/n/n1e2b329ceb17 "Management is an art" doesn't fit well, explanation for people who are good at structural thinking｜Shiro Shibata｜note]
>[https://twitter.com/4bata/status/1575832285252751361 @4bata]: - I'll try to explain for those who are good at [structural thinking] who don't feel comfortable with "[management is] an art".
> Structural Thinking: Create a hypothesis to reach the goal at the beginning.
>/Art: I'm going to concentrate on the scarcity part and hope I can manage the rest at the end.
> "We'll figure it out" looks poor from a structural thinking perspective.
>[https://gyazo.com/411f138cd97f414410fe8ac6d34a5de4]

>[https://twitter.com/tokoroten/status/1575874387793784833?ref_src=twsrc^tfw|twcamp^tweetembed|twterm^1575874387793784833|twgr^58d 4210394542bc056e23fc4614d70bc3cc4f5cc|twcon^s1_&ref_url=https%3A%2F%2Fnote.com%2F4bata%2Fn%2Fn1e2b329ceb17 @tokoroten]: uh, [ negative capability]] story - this one.
　Negative capability = individual's propensity to be less anxious even when uncertainty remains
>For managers and planners, the part that can be done if you do it is not worth discussing, I don't care how you do it,
>The people who are in a position to do it have to discuss it, and if they don't discuss it, they assume that they will be badly hurt when they do it, so there is a misunderstanding.
>---
> So, when you talk about people like that in the mix.
> "Now is not the time to discuss that, is it?"
> "What's the point of discussing the implementation of that now?"
> "If we have time to discuss its implementation, let us talk about the core of the plan."
> I'm just going to be like that.
　The person thinks he/she is having a serious discussion, but the other person seems to be picking at [a corner of a heavy box].
> and as a result, implementers are sometimes removed from planning meetings
>---
> For example, when you are thinking about a plan based on a positioning strategy,
> It's worth discussing what should differentiate us from other companies,
> It doesn't make sense to argue about what makes us the same as other companies.
> 
> Worst-case scenario, since it's been determined that copying from another company will do the job, end the discussion with "worst-case scenario, copying is fine".

>[https://twitter.com/hrjn/status/1576124752028405760 @hrjn]: I get the feeling that this isn't structural thinking to begin with.
>[Structural thinking] is about understanding the [* problem] structurally, which is different from how to do the [* solution], but I think this is often thought of without much distinction.
>[https://twitter.com/hrjn/status/1576423007093895169 @hrjn]: I wrote it a bit more properly.
>After all, I still feel that we should separate the structure of the problem from the solution. I feel that if management remains artistic, there will be problems for companies to scale.
>[https://t.co/ftuPGCudSd Structural thinking is not (maybe) the building blocks of solutions｜harajune｜note]
　[Structural thinking is not a building block of solutions].
　Understand [the structure of the problem
	>[https://twitter.com/nishio/status/1576747503491616768 @nishio]: I didn't feel comfortable with the original "Explanation for those who don't feel comfortable with 'Management is Art'", but this article seems like a step forward. It still doesn't feel right enough to say in my own words, "Oh, I see, so this is what you mean.

>[https://twitter.com/nishio/status/1576750705628454912 @nishio]: For example, if you are going to do a project for the next 6 months, and someone makes a plan that says "In January, do A, in February, do B..." If someone makes a plan that says "Do A in January, B in February, and so on...". There are those who evaluate this plan positively and those who do not.
	>Positive evaluators think, "It's good that you have a solid plan, and if you follow the plan, you will be able to achieve your goals. Those who do not evaluate the plan think, "This is an empty theory based on a poor understanding of the problem at the moment, and a bad plan that does not take advantage of the knowledge gained during the project.
 > Those who perceive "artistic managers" as "placing the building blocks from the most important hollow parts without piling them from the bottom" are first of all comparing them to "building blocks," but this concept of "bottom" is at odds with each other. The "artistic manager" is also piling from the bottom, testing from the hypotheses that should be tested first and foremost.
 > When "I want to build a bridge across to the other side of the river," building C first and then A is "piling from below," but to someone who implicitly assumes the direction A to E in the image of crossing a bridge, it looks like "placing blocks in the hollow without piling from below and then filling the top and bottom.
		[https://gyazo.com/98a098cdd6e86aff50077fd65ad184e7]
	>If there is no uncertainty in the project, it is enough to just do the work from the beginning. If there is uncertainty, the work done may be worthless if the project is executed based on assumptions and later turns out to be "different from what was envisioned. To reduce this probability, some people "start from the point of highest uncertainty.
 > This is not art, it is simply rational planning for uncertainty, but perhaps the expression "management is art" is used because you can't verbalize this well or you feel it's too much trouble to explain.
 > So, harajune's problem analysis is to verbalize this and do it consciously, as if he is saying, "Do you want to build a bridge here? Then you need three pillars.
 > In other words, this is independent of whether it is done linguistically or by sense. There are many ways to describe it, but at the root, it's the same.

	>[https://twitter.com/tokoroten/status/1576764695997915138 @tokoroten]: @4bata @nishio After reading tweets from Nishio and Harasun,
 > "[Conceptual design] and [detailed design] are different."
 >"The place to focus on in conceptual design is where [uncertainty] ([implementation uncertainty] and [market valuation uncertainty]) is highest."
 >"I don't like it when people talk about detailed design when we're doing conceptual design."
 >I was able to get it down in my mind like that.
 	>[https://twitter.com/nishio/status/1576788383141011456 @nishio]: @4bata @tokoroten Whether or not the term "conceptual design" is understood, the two are different phases, and we don't want to mix the latter when we are doing the former. I agree with you that it's not good to mix the latter when you are doing the former.
  >Jiro Kawakita also says, "[There are] two kinds of plans" (Hunda book p.110), which separates "plans of structure" from "plans of procedure."
  >It is a plan to create a structure that, if realized as planned, would result in the fulfillment of a matter, a blueprint in the architectural sense, and even if the blueprint is the same, there are many ways to plan the procedure.
  > 
  > In another word, it could be divided like "[what to make](what)" and "how to make (how)". The root would be the same.

>[https://twitter.com/tokoroten/status/1576769746363510785?ref_src=twsrc^tfw|twcamp^tweetembed|twterm^1576769746363510785|twgr^a 771c1e2e42a8f6fea22a5bd78ca7d30c7a25d52|twcon^s1_&ref_url=https%3A%2F%2Fnote.com%2F4bata%2Fn%2Fn1e2b329ceb17 @tokoroten]: The "art" and "structure" is misleading,
>Conceptual design and detailed design.
>To someone who has only done detailed design and has no experience in conceptual design, conceptual design seems like an art that I don't understand.
> ---
> "Conceptual design" is subject to intense constraints of marketing research, promotion, and market trends
> If someone in a "detailed design" position, who only manufactures without looking at the market, looks at those "constraints", they look extremely irrational.
> So I would describe it as "art" and put it outside of my understanding.
　[What you don't understand looks like art].

>When there is uncertainty, the work performed may be worthless if it is performed based on assumptions and later becomes "different from what was expected". To reduce this probability, some people "start with the highest uncertainty.
	>[https://twitter.com/wint7/status/1576792665773178880?s=21&t=yHQZ8Xtq0a2woVXgaabdOg @wint7]: it's an idea at the core of agile, but is there a more straightforward explanation?
　　[Agile]
