Corporate Culture
Definition by Edgar Schein
	Shared by the collective,
	It determines the perceptions, thoughts, feelings, and to some extent manifest behaviors of the group,
	concerning the structure of society or how it should be.
	Implicit basic set of assumptions

>C-T-R was formed three years earlier, in 1911, as a joint venture of three companies, the locations of the three predecessor companies being geographically distant from each other: New York, Washington, D.C., and Ohio, respectively. Perhaps for this reason, the firms did not function as a single organization. Watson realized that one of his most important tasks was to bring these three organizations together, not only in terms of management, but also in terms of shared beliefs and processes.
> 
> Today we call what binds organizations together in this way corporate culture, which Professor Edgar Schein of MIT's Sloan School of Management, who coined the term, defines as "a set of implicit and fundamental assumptions about how society works or should work that are shared by a group of people and determine their perceptions, thoughts, feelings, and to some extent their manifest behavior. He defines it as "an implicit and fundamental set of assumptions about the way a society works or should work that determines, to some degree, its manifest behavior. Watson is regarded as the first business leader to build a very conscious and far-reaching corporate culture. Authors Tom Peters and Robert H. Waterman Jr. co-authored "In Search of Excellence," a classic book in the business field and one of the two that featured IBM prominently. （one of the secrets of IBM's long-term success is its ability to create a strong management philosophy based on values that are rooted in respect for the individual. They write, "What energizes these companies is an abundance of organizational strategies, structures, methods, and values, all of which reinforce each other to make them truly distinctive companies in which ordinary people can achieve extraordinary results.
[https://www.ibm.com/ibm/history/ibm100/jp/ja/icons/think_culture/ IBM100 - The "THINK" Culture]
	[sharing common beliefs].
