Forced admiration creates a culture of face-saving.
The [culture] of [forced admiration] creates a [culture] of [disobedience

>[https://twitter.com/tokoroten/status/1577204577522577408 @tokoroten]: miscellaneous thoughts, but I thought I understood one of the reasons for the decline of Japanese companies
>Culture and growth are a set of things.
>Because the culture creates a hierarchy, you want to grow up according to the hierarchy there.
> and if you miss the organizational design, you don't form a culture, you don't create a hierarchy, and you don't want to grow.
> ---
> No culture is formed because they are roughly divided into career, general, technical, and research positions and shoved into the same bucket in a messy manner.
> No technical hierarchy is created and no growth takes place.
> 
> This is what it sounds like.
> ---
> So, this culture formation is closely related to the development of the workflow,
> 
> Business Flow Development
>> Organizational split to allow mono-skilled personnel to work
> →Maintenance of necessary qualities
>> Evaluation by Qualities
> 
> I'm starting to get the feeling that
> Then a triad of culture, hierarchy, and growth would emerge.
> ---
> Only when we can do this can we start to highly value cross-border personnel as someone who transcends the traditional hierarchy.
> 
> Because we are trying to develop cross-border personnel who can do multiple things without maintaining this,
> No one will want to do that, and if they do, they'll wind up getting stabbed.
> ---
> I'm talking about "technical and competence hierarchy", but there are a few people here and there who mistake this for "organizational and power hierarchy" ......

>[https://twitter.com/nishio/status/1577270752566386688?s=20&t=sl0V9zg6e6PuVokoR4VHMA @nishio]: @tokoroten Well, if you use hierarchy, people will associate it with organizational hierarchy. I think there are a lot of people who associate hierarchy with organizational hierarchy. This is referring to a structure whereby Mr. B and Mr. C "[admire]" Mr. A who is ahead of them, and through imitation, "[a common standard of value judgment]" is created and maintained over time, right?
>---
> @tokoroten: ｙ
>---
> @nishio: I felt that the discrepancy between organizational hierarchy and admiration hierarchy causes problems. Some people are not worthy of being admired, but are forced to admire by being a senior or boss, reinforcing the culture of face-saving.
> ---
> @tokoroten
> I'm thinking that when the company was growing, the organizational hierarchy and the competence hierarchy must have coincided, since the process of increasing positions was gung-ho to promote from the bottom to the top.
> ---
> @nishio
> Then you start to have disagreements when the organizational structure doesn't change and grow.
