Diary 2022-10-09

[Change the order in which elements are visited].

Aging and Speech Communication

When one person is talking, the others have no choice but to listen.

Degradation of real-time audio output
　noise
　　A good mistake in a word
　　reciting one's lines well
　　I don't have to come up with the words... time to stagger.
　Biases that result in familiar thought patterns
　　Saying the same thing over and over again
　　　And the benefit of better understanding?
　　For me, it's a repeated story X, so I'm going to have to break off the branches and leaves, but that's exactly what makes it look like I'm repeating an outlandish abstract concept X to my listeners.
　Cannot explain visual thinking in language
　　The visual thinking is so good that it unfolds at a speed that words can't keep up with.

I'm hypothesizing that after about 40 years of age, you should already be leaning more towards text output rather than verbal output.
　Or he/she outputs in text and then the AI speaks.


C3cat, it would be interesting to have more of a physical presence, but it would only be a blip if my wife and I were making it, so it might be interesting to give out a free license to use it as a sort of alpha test for a limited number of people on an experimental basis.
　I've tried a lot of NFTs, but other people's understanding of the NFT concept swings either overly positive (=expect to make money) or overly negative (=get cheated by scammers and lose money), and the explanatory cost of making the proper interpretation (basically a positive zero, with a low probability of price increase) is high.
　　[NFT is a lottery]
　I thought again about what I wanted to do, and I said, "This game is interesting, and the more people who participate in it, the more interesting it will be."

In doing that, it's a pain to have images that aren't in Scrapbox yet.
　Do you want to create a merge update mechanism for Scrapbox?
　First, read the existing JSON
　Get page lines, empty list if there are no pages
　If there is no link to Gyazo, grant it.
　If there is no CAP-tan line, grant it.
　If there is no INS-tan line (which there usually isn't now), grant it.
　Grant the remaining rows, if any.
　I think this will work.
　I'd like to see a prefix icon for other mechanical information giving.
　　Shall we name it SCBO-tan?
　	✅[/c3cats/SCBO-tan]

tote bag project
　[tote bag].
　line up cats
　Bottom 1/4 is black (because it shows dirt)
　Attach Insta and Scrapbox QR codes



[Diary 2022-10-08]←Diary 2022-10-09→[Diary 2022-10-10].
100 days ago [Diary 2022-07-01].
1 year ago [Diary 2021-10-09].