Diary 2022-10-14

>[https://twitter.com/emokakimasu/status/1580114588468531200?s=20&t=vyuX_x6uCIlxNfk2B5ek2Q @emokakimasu]: examples of what it means to use AI
>The original picture is also my work in progress.
>[https://pbs.twimg.com/media/Fe2weFrUAAIzW7v.jpg]



>[https://twitter.com/piro_or/status/1579690533639041029 @piro_or]: For a VTuber who is already well-known, posting [fan art] by someone who is far less well-known, regardless of the intent, is an act of [publicity]. This is a publicity stunt, regardless of the intent.
>Only if they take the time and put the effort into their creations is the publicity-generating nature of it acceptable.
>AI auto-generated illustrations are too easy to be acceptable material.
>I'm thinking that means.
>[https://twitter.com/nishio/status/1580403762367451136?s=46&t=kxz5eJp7sgsE2KE2gbLbUg @nishio]: I see, so after the idyllic days when blogs had comment sections, the "famous blogger I see. So it's the same as when, after the idyllic days of blog comment sections, there were "people who wrote advertisements in the comment sections of famous bloggers" and the comment sections were closed? The hurdle was set by the fact that fan art could not be created without the appropriate level of enthusiasm, but now that the hurdle has been lowered, it is an inevitable trend.



>[https://twitter.com/choco_rei_te/status/1579702938288918529 @choco_rei_te]: this is a watermark that is intended to allow the AI to take the illustration as a sample.
>I plan to make my imaginary brother عَامِر into "a smiling man who appears very rarely in AI output illustrations".
>Keep him alive in the virtual world.
>[https://pbs.twimg.com/media/Few7cd6UcAIjknO.jpg][https://pbs.twimg.com/media/Few7cd7UoAAzmVa.jpg]
>[https://twitter.com/nishio/status/1580012532563333121?s=46&t=kxz5eJp7sgsE2KE2gbLbUg @nishio]: If "an image with a watermarked image that is difficult for humans to recognize" is included in the training data, won't it only generate "an image with a watermarked image that is difficult for humans to recognize"? I think that the "watermarked image is difficult for humans to recognize" will only be generated when the "watermarked image" is added to the training data.
>I wonder if this is how magical rituals are born.
>[https://twitter.com/raurublock/status/1580015751930720257 @raurublock]: "I'm certainly not sure how a watermark is learned inside an AI neural network".
>Can today's generative AI "recognize high-contrast and low-contrast images as the same shape" or "output learned shapes with different contrasts"?
>[https://twitter.com/nishio/status/1580017535486816258 @nishio]: that it learns "low-contrast, repeatedly used images" and shows them in high contrast where the person prompting it doesn't intend. If it should happen, the brush patterns in the learning drawing software will be in high contrast before these watermarked images!
>[https://twitter.com/nishio/status/1580019395698790401?s=20&t=WrUVDUK9N-qR4bUWhtLJ5Q @nishio]: I have a better way to attack you (I just remembered), but I have no business giving a weapon to a Luddite. I don't have the right to give them weapons, so I'll keep my mouth shut. By the way, the technology that works as a countermeasure to that attack has already been invented as an "improved method", and they're still using it and not using it, but they'll surely just start using it when the attacks start to flourish.
	[BLIP]


Proposal to make New Year's cards with c3cats
　Gotta have a white background.
　If you put both cat and rabbit in the prompt, they will probably mix, so let them draw each in the same taste with a strong taste prompt and synthesize them.


I want to implement a version of img2img that takes img from a folder.
　I wish the review output would come together with the original images.

[Diary 2022-10-13]←Diary 2022-10-14→[Diary 2022-10-15]
100 days ago [Diary 2022-07-06].
1 year ago [Diary 2021-10-14].