日記2022-10-15
summary
　I made a Pixiv FANBOX.
		[https://gyazo.com/6fb06228deee95a16a8ff267451c9ab6]
		[https://gyazo.com/ab9e871a2bcab056bb73c563adf06e9a]
　　　I also created limited content.
　I was wondering if I should separate the cat from the girl or not, but it seems like the nuance is that I want to make the system support the person, not the work, so I decided not to distinguish between the two.
　　In the future, I think it would be a good idea to make only the cat part of the Patreon and send it out for international fans.
　　I have 500 followers on Instagram and 90% of them are out of the country. [Cats have no borders].

---

Pixiv Fanbox
[https://gyazo.com/bd266761ff0f53add900955e4af29e3c]
	https://fanbox.pixiv.help/hc/ja/articles/360015675574-プラン作成のヒント
		>The average amount of support that one fan supports for one creator in FANBOX is about 500 yen.

[https://gyazo.com/392ef4e70b331bb1adad64a3987d0434]
	They say you can't change it.
	[https://gyazo.com/bc0dac14339b05fdb7e1b72d67dbab78]
I wonder what happens when it is shut down, will we not be able to see the article?
　I deleted my $500 plan after making a post that was only visible if it was over $500, but the post doesn't specifically disappear or anything, it simply becomes "no one in the condition to view it".
　　Well, that's an easy implementation.

[https://gyazo.com/dcb97287d6298f8d48cafa9eb8a9f7bb]


[https://gyazo.com/7f948a9f89ab88fc17bd82c6b56d383d]
	[https://gyazo.com/2df9211bfb161ed6a4c4f12dca1ee384]
　I see.

[https://gyazo.com/1a106147d6cd1f447d34eb66c9dc2e92]
　You can put a zip
　I think it's obvious that I can't continue my kiddie fan service, so I guess I'll just zip it up with the prompt and seed info in the file name.

https://fanbox.pixiv.help/hc/ja/articles/360015675414-はじめる時に大切にしてほしいこと
>There are some important things you should keep in mind when starting FANBOX.
> That means putting first priority on time devoted to the creative activities you want to do.
　You write good stuff.
　I'm thinking, "Can't I change it later?" "What happens if I turn it off?" But I think it's better to start without thinking too much about it.
　[https://gyazo.com/f2ab486eb88a970a2511bf894ee8e080]


I was thinking of doing c3cats on Patreon for English-speaking countries, but Fanbox might work too.
　It seems like subbing is something like "if it's unavoidable, it's possible".
　In the end, this is that one, the one where you start out trying to do Scrapbox public projects in various categories in your head, but eventually you get tired of using different ones.

[PixivFANBOX back number feature removed].
-----

>Illustration should be paid not only for the deliverables, but also for the fact that "the creators themselves draw the illustrations. If they knew that this was just a service that anyone could use and that the output was just being passed off, in many cases they would not pay to commission the work.
　https://www.itmedia.co.jp/business/articles/2210/14/news050_4.html
　There are a lot of people who know they're working with pen tabs and crystals that anyone can buy and still pay for the work, so the logic of "there will be many cases of ~" is questionable.
　If someone says, "It's outrageous to draw with a pen tab that anyone can buy," the artist will often say, "Oh, well, then you don't have to order it.


>Until now, the pictures drawn by AI were inferior to those by humans, so people went out of their way to say "AI drew this picture," which was followed by "Hmmm, that's great for an AI," but if AI becomes better than humans, people will just go out of their way to say "human drew this picture. [* Even today, people who draw pictures that could be mistaken for photographs go out of their way to say, "I drew this picture by my own hand.]
	[https://soysoftware.sakura.ne.jp/archives/3622 What ended up in the NovelAI leak? - soy-software]
	I see
　　Right now it's "painter" and "AI painter," but eventually, when "AI painter" becomes the norm, [retronyms] like "hand-drawn painter" will be created for the current "painter.

>[https://twitter.com/motoso/status/1580987334627315713 @motoso]: there are quite a few points where I struggle with painting with AI and it's hard to control it the way I want it to be, so trying to do that would be in the creative category. Nah.
>AI feel that some of the CG collections that are called CG collections cannot be made without a certain amount of effort, and are unfairly valued because of the image that they must be easy to produce.
>100 erotic images of elves! It's rather easy to make something like that, but on the other hand, it's only easy to make something like that.
> When you make a manga, you can make it faster than drawing it yourself, but you have to be creative to make it add up, and it usually takes a lot of work to improve the quality. Of course, you can make it faster if you separate the two.
>[https://twitter.com/nishio/status/1580989989328146433 @nishio]: People who used to get angry when people said "It's easy to draw a picture, just draw a little bit" are now on the side of "It's easy to draw a picture with AI". If you think it's easy, why don't you do it? If you think it's easy, why don't you do it?
> An episode of Tachikawa Danshi: [Why don't you do it?]


I had to keep all the not_good files locally because I didn't have enough space, so I put them online in Dropbox, but now even the data files are online, so I can't tally them anymore.
2022/10/15 22:18 I ran a script to move files before and after
If this causes serious problems, note the time because we'll have to rewind Dropbox again to fix the problem.

[日記2022-10-14]←日記2022-10-15→[日記2022-10-16]
100日前 [日記2022-07-07]
1年前 [日記2021-10-15]