Weeping Angel and SCP-173
http://scp-jp.wikidot.com/scp-173
>If personnel must enter the SCP-173 container, there must be at least three people in the container and the door will be locked after entry. At all times, two of the personnel entering must keep their eyes on SCP-173 until all personnel have exited the container and the door is locked again.... SCP-173 cannot move while it is in direct view. Never look away from SCP-173. Personnel entering the container are instructed to warn each other before blinking.



https://en.wikipedia.org/wiki/Weeping_Angel
>The Weeping Angels are a race of predatory creatures from the long-running science fiction series Doctor Who. They were introduced in the 2007 episode "Blink", making repeat appearances in later episodes. ...
(DeepL)Weeping Angels are predatory creatures that appear in the long-running science fiction series Doctor Who; they were introduced in the 2007 episode "Blink" and have appeared repeatedly in subsequent episodes.
>In their usual form, Weeping Angels resemble silent human-sized stone statues in the form of winged angels in draped clothing, such as might appear as tomb statuary in a Victorian graveyard. As they close in on more aware victims they transform to a more horrific, bestial, and demonic aspect with wide-open mouths, vampiric teeth, and clawed hands. It is also implied that Weeping Angels can mimic the forms or dimensions of a broader range of statuary if required: in "The Angels Take Manhattan" (2012), one Weeping Angel takes the form (or hijacks the existing form) of the Statue of Liberty (manifesting as a full-size Liberty with Weeping Angel features) and the final moments of "Blink" (2007) suggest that any statue might be a disguised Weeping Angel.
In its normal form, the Weeping Angel looks like a quiet human-sized stone statue in the form of a winged angel in draped clothing, like a tombstone in a Victorian cemetery. As they get closer to more victims, they transform into more hideous bestial, demonic figures with wide-open mouths, vampiric teeth, and clawed hands; in "The Angels Take Manhattan" (2012), one Weeping Angel takes the form of the Statue of Liberty (or even hijacks the existing form) and appears as a life-size Liberty with Weeping Angel features, and in the final moments of "Blink" (2007) it is implied that any statue could be a Weeping Angel in disguise.

>When they are not being observed by another being, Weeping Angels can move very quickly and silently. Their phenomenal speed allows them to close distances of metres literally in the blink of an eye. However, when they are being observed they become "quantum-locked", occupying a single position in space and becoming stone. In this state, they are frozen and difficult to destroy.
When unobserved by other beings, Weeping Angels can move very quickly and silently. Due to its incredible speed, it can literally be several meters away in the blink of an eye. When observed, however, it becomes "quantum locked," occupying a single position in space and turning to stone. In this state it freezes and is difficult to destroy.

>Weeping Angels are physically very strong, although they rarely physically kill a victim since this wastes the time-potential energy which the Weeping Angels would otherwise consume. They prefer to take their energy from live victims, but if required, they can drain other forms such as that from electric lights or other electronics.
Although Weeping Angels are physically very strong, they rarely physically kill their victims, and this is because Weeping Angels waste the time-potential energy they consume. They prefer to get their energy from live victims, but can also get it from electric lights and other electronic devices if necessary.

>Weeping Angels have also exhibited a startling ability to project themselves through images. Using this ability, the Weeping Angels appear to be manifest themselves from anything from videos to drawings. Weeping Angels can also imprint a mental image of themselves into a person's mind by usually looking straight into their eyes: the image then gestates and takes over the person's body to manifest as a new Weeping Angel.
Weeping Angels also have the amazing ability to project themselves through images. Due to this ability, Weeping Angels appear to emerge from videos, pictures, and just about anything else. Weeping Angels are also able to imprint a mental image of themselves onto a person's mind, usually by looking straight into the person's eyes. That mental image then takes over the person's body and materializes as a new Weeping Angel.


