How to Create Ideas and Adult Counterproductive Interventions
2021-03-21
>[https://twitter.com/nishio/status/1373354886306299904?s=46&t=ECsAshllg5Wp2zLedKKSVg @nishio]: "[How to create an idea]" means that there are [buds of an idea] but you don't realize it and step on them, or you find a bud but you don't know how to grow it. There are cases where the idea has been squashed, cases where a bud has been discovered but not nurtured, cases where people want to nurture it but don't know how, and cases where it has grown well but when shown to the adults around it, they squashed it, saying "such a small bud is not good enough".
>In terms of discovering the buds, the type of person who wants to create something first already has something that he or she wants to create, but because of his or her own misunderstanding or inappropriate advice from the adults around him or her, he or she is convinced that "this is not good enough," so it is necessary to convey the message that it is okay to nurture and grow. Or
>On the other hand, there is a type in which the "problem to be solved" takes precedence over what is desired to be created. For example, "My grandfather has trouble reading small letters, so I want to make the letters bigger so he can read them" is a problem-first type. In this type of case, it would be good to gather information on what kind of solutions are available.
> If you come up with a hypothesis that "this problem could be solved in this way," that will be the germ. Then, if you repeat the experiment and verify the hypothesis, it will grow.
>The adults around them should give approval and encouragement to those who want to make something, but they should also ask, "What good is it going to do? But they should be asking, "What's the use of making it?" or "Don't you have to make a proposal that solves more social problems?" There are adults who make counterproductive comments such as "What's the use of making it?
>For this type of person, the most important resource is a high level of "wanting to do it," and any intervention that causes them to lose that desire will be counterproductive. For problem-solving types, if the problem is "small but familiar and observable" and the problem is "large but distant and vague," it is easier to work on the former.
