Drawing AI is an exclusive mess.
Gacha in shadow games is characterized by the fact that even if you draw an SSR, "many other people have the same one".
This is because of the high cost of creating pictures.

When generated by a drawing AI, you are the only one in the world with one of a kind.

For example, let's say a shadow company has a project like this.
　If you raise an SSR character to a specific stage and use the in-game item X, you can img2img the character image to create a second look.

In this way, the player can "make the character of his/her choice that he/she has developed" look "even more like the character of his/her choice. They can try to give them a troubled face, or put hearts in their eyes, etc.
If img2img is processed with less noise and fewer steps, the risk of the image being turned into an erotic image is small enough because it does not differ greatly from the original image.
　(Although what is erotic is interpreted differently by different people [some people think blushing is sexual].

How much would a user pay for this "in-game item X"?
　Less than 1 yen as the calculation cost of img2img
　　The rate at NovelAI is $11 to create 2,000 sheets, so I can only assume that that's not enough to make a loss.
　So if a user buys this item for 10 yen, the profit margin is very high.
　　I think if you can gouge 10 looks for 100 yen, many people would do it.
　There's also a way to get it at a lower rate by continuing to play normally instead of selling it directly.
　　Like a login bonus every 30 days.
　Easy load leveling because results do not need to be changed immediately, unlike when the business is directly providing the drawing AI itself
　　The in-game flavor should be something like "I'm off to the hairdresser for a bit" and then be gone for an hour or so and get a notification when you come back.
　　If the load can be equalized, the cost per piece will be even lower because the capital investment cost will be reduced.

The inspiration for the idea
>[https://twitter.com/ajiko_channel_v/status/1577539908516081664 @Ajiko_channel_v]: img2img was funny.
>This, and the spell was just fine.
>I feel like I pulled a SSR.
>I really like it when they are together in the thumbnail.
>#NovelAIDiffusion #novelAI
>[https://gyazo.com/906102402493e35abfad0e70308b706f]


I thought it was a mess with the metaphor of SSR.
　In this case, strictly speaking, it is hard to say that you "get ownership" because you are using without permission something that is not copyrighted to you as the original picture.
　It's still possible for users to img2img illustrations from shadow games on their own, but it's hard to say that they "own" them in the same way.
　If the makers of the shadow game itself provide it as an internal function of the shadow game (in the same sense that most people feel a sense of "ownership" when they draw an SSR in a gacha, even though it is only in-game data and they do not have the copyright to the picture or even permission to use it outside the game), they will feel that they "own" the game. (in the same sense that most people feel a sense of "ownership" when they don't even have the copyright or permission to use the picture outside the game).

digression
　I personally find it interesting to be able to trade this "one and only in-game item in the world that only you own" in the game, but the operating companies might not want to do it because it would add to their worries.

I tried to mess up on my own (after the 3rd piece).
[https://pbs.twimg.com/media/FeSL3JLaEAA6aOE.jpg][https://pbs.twimg.com/media/FeSL4MXacAAwp8o.jpg][https://gyazo.com/e7dac450dc8e01d4ab6836d425a44aac][https://gyazo.com/89ecb46c8c65a8916529e91698cedf36][https://gyazo.com/244c6c339b7ec19d99843a62624a0f75][https://gyazo.com/dfe8cdb71c0916326f172dac751e7934]




