日記2022-10-17

>[https://twitter.com/nishio/status/1581605022336679936?s=46&t=tPpNpics6nkpgqfV-l5EDA @nishio]: some people say "all drawings with drawing AI have the same paint", but it's simply because I'm sure most people who use drawing AI don't specify the paint in detail, so it's just the greatest common denominator of the paint.
>[https://pbs.twimg.com/media/FfL80E0aAAAFYD3.png]
>I've heard some people say "they all look the same," and I was thinking of disproving that later, but I don't think anyone would think they all look the same in all the images so far. In other words, the fact that the AI pictures look the same face and paint is an indication that the creator doesn't pay much attention to the face and paint, but rather to the situation.
> It was interesting to look at Pixiv with the AI tag, and there was a series of images of a girl with tears in her eyes, or a series of images of the sides of a girl, and I thought that this person used to search for images with those keywords and save the images he liked locally, and his enthusiasm is now being used in the direction of drawing with AI. I wondered if he was using AI for drawing.
> I think it has been repeated many times in history that people who used to be mere consumers move toward creators as the tools for creation evolve. I don't think people who are creating now with digital tools such as Crysta would want to go back to the days of frescoes where Undo was not possible.

>[https://twitter.com/nishio/status/1581836555026829312?s=46&t=tPpNpics6nkpgqfV-l5EDA @nishio]: 45問中41点だった。
>I see, this is a difficult one. I have experience using it, so I thought to myself, "If I were to get it out, how would I get it out?" and answered with "I understand" or "No, what would I do, it's impossible", but I wonder where people who haven't used it would judge it. Some of them have fingertips or something hidden.
>[https://pbs.twimg.com/media/FfPP9mjakAExfHD.jpg]


NovelAI is under long-term maintenance
　There was an update before maintenance, and the feeling I got afterwards was, "Whoa? Response time is faster now?" or something like that.
　　I wonder if they've expanded their facilities.
　　People of the same opinion
　　　https://twitter.com/callimiya/status/1581412051255459842?s=46&t=tPpNpics6nkpgqfV-l5EDA
　Someone is saying that the model files were updated in that update and some keywords were excluded from the training.
　　https://twitter.com/subarusamaski/status/1581598644221841408?s=46&t=tPpNpics6nkpgqfV-l5EDA
　　I haven't felt it yet, but from someone who, for example, used a certain keyword X to produce a picture of their choice, I'm sure they'll know right away because X will no longer produce a picture of their choice.

https://dallery.gallery/the-dalle-2-prompt-book/
>[https://twitter.com/bunbunhooi/status/1581851832720437249 @bunbunhooi]: no, the AI illustration community is too interesting!
>The "Elemental Code" grimoire, created by an AI sorcerer in China, was published and studied overnight.
>Don't turn reality into fantasy any more...
>https://t.co/rR3YgtOdwl
[https://gyazo.com/d6123280b089eedc35c54fa78baf0c58]
Easily done.

[日記2022-10-16]←日記2022-10-17→[日記2022-10-18]
100日前 [日記2022-07-09]
1年前 [日記2021-10-17]