Diary 2022-10-29

I often use the word [enthusiasm], but I thought [creative urge] was a word with a little more resolution.

>[https://twitter.com/ai_contest/status/1584847243315748866?s=46&t=8r2-75ref0_VllgMzuEilg @AI_contest]: The largest ever AI image competition "#AI Image Contest The first round of the "#AI_contest" will be held!
>The Grand Prize winner will receive a cash prize of 30,000 yen and a case of ZONe (24 bottles).
>The top 50 entries will be displayed in the #AI Image Exhibition.
>, 1 piece per day, everyone can easily apply, please feel free to join us.
>https://t.co/jLvE9ag4eQ
>[https://pbs.twimg.com/media/Ff579O0akAELpeZ.jpg][https://pbs.twimg.com/media/Ff579OwacAE9ad3.jpg]

>Main Event at the AI Image Exhibition
>This is a large scale contest with 50 exhibits!
>Total is based on the total number of likes
Let's aim for an Honorable Mention in [c3cats]!

>If you wish to sell your work here, you can post the URL of a sales site such as suzuri. (You can edit the URL after submission.)
Hoho, is the back suzuri?

>Prompt (Please fill in the prompt correctly. Proper nouns such as "shinkai makoto", "Van Gogh", etc. are not allowed in the prompt for this contest. Failure to comply will result in deletion)
This feels like my work is out of the scope of the management's assumptions. I was told to write the prompt accurately, but what happens if the prompt is not written by a human, or if I use a "non-string method" such as tensor editing, etc.

>The top 50 works in the overall ranking at the end of the count will be exhibited at the Yokohama Civic Gallery (12/28, 1/4~8).
> Do you allow the use of your artwork for merchandising sales at exhibitions?
> (10% of the profit from the work will be returned. Clear files, stickers, badges, etc. are available. Please note that even if you check the box, your work may not be used. We will send a detailed outline to your e-mail after the contest is over.)
I see

>If you use Img2Img, please use only your own AI images as input images.
Is this intended to be based on a picture you drew or a photo you took?

I applied anyway.
https://ai-image-posting-service.com/artworks/1667043334939x198597808195895300

>[https://twitter.com/nishio/status/1586321111226396673?s=20&t=L8724q_GOoZUvY4nV8i2gg @nishio]: I entered the contest!
>https://t.co/RjoS8DSAyW #AI image contest

[Diary 2022-10-28]←Diary 2022-10-29→[Diary 2022-10-30].
100 days ago [Diary 2022-07-21].
1 year ago [Diary 2021-10-29].