Create a short version of the lecture material
last
	[https://gyazo.com/8f3a23e3f97dca2ab3568fc6baa022c6]


from [KJ Method Study Group @ Loftwork].
2022-11-16
 Create a short version of the lecture material

　It is an example of "something KJ-legal" of the type where the input is "lecture materials I created" and the output is "digested lecture materials".
　　Record and observe the process while doing it yourself.
　Existing lecture materials already have some structure.
　　I don't want to reset everything.
　　On the other hand, if the structure were kept perfect, the objective would not be achieved.
　　What to do in such a situation

First hand, I'm plugging all the lecture materials into Kozaneba's new Ba.
	[https://gyazo.com/7d2adf140cd6eef8b3d7856ec6a00400]

roughly
	[https://gyazo.com/1cc33aae824d3663ef4e6aec0ff26a4b]
　Write down what you feel
　The first "write it down" may not have to be spoken orally if everyone reads the lecture material beforehand.
　And less self-introduction.
　The reason why "a different perspective" and "starting small" are necessary is that in order to "create the Loftwork way," it is necessary to understand the principles that give rise to this methodology, rather than tracing existing methodologies as "rules.
　The KJ method is not an absolutely unchanging methodology, and Jiro Kawakita himself says, "This is too much work, so I made fireworks to think about it.
　　We need to change our worldview to one of "methodologies that can be created and changed according to circumstances," rather than one of "absolutely unchanging methodologies.
　The "I'll do it alone" block is awfully big.

t2
	[https://gyazo.com/02d4d264e85f5ceabbcd87d547bad4c7]
　Deconstruct the "introduction" into just the parts needed for the "different perspectives" that follow.
　The "going it alone" partition a bit more.

t3
	[https://gyazo.com/20875186a954207904043aaaaffdb4de]
　Methodology must change with the situation.
　Jiro Kawakita himself does not consider the KJ method as an absolute, and has created "Kanken-Net", "Thinking Fireworks", etc.
　Methodologies created before the widespread use of computers, which do not meet the needs of today's situation and your business.
　From now on, you will all be creating the Loftwork style.
　This requires an understanding of the principle

2022-11-25
　I realized that the exploratory net procedure itself does not need to be communicated verbally.
　　You have to have something you can read back alone because you'll be in the middle of the work and you'll be like, "Uh, what was that?
　　Instead of working by ear and learning by heart, why not have something you can read?
　　Maybe this "something you can read back" could be placed in the Miro for the study group.
　Verbal communication of information is inefficient
　　What you need to do verbally is communicate the passion.
　Then we could cut the time in half without making too drastic a change.
　　(Whether or not removing the entire second half is not drastic is beside the point.)

I made a page to cut down based on the version we talked about at Cybozu.
　[KJ Method Study Group @ Loftwork_Lecture Material v2].
　I'll be walking after dinner to stay awake, and I'll read it back on my phone then.

I fell asleep.
　walking
　You're trying to duplicate the old one and cut it down, but it's better to copy the parts you use onto a new blank page instead.
　because
　　Whether you select and delete or select and copy and paste, the act of "selection" makes you aware of a part of the text
　　Because the object of this awareness is a "useless," "unnecessary," or "negative" document, and the object of this awareness is a "usable," "useful," or "positive" document, and the mental direction is the exact opposite.

2022-11-28
	I'd better tell them early about "not verbally communicating the exploratory net procedure itself," lest there be a mismatch in expectations.
　I will be cutting the explanation of the exploratory net procedure from my oral presentation.
　　It is impossible to memorize and work through the entire procedure by ear first.
　　I'm in the middle of a task and I'm like, "Uh, what was that?"
　　So something that can be read and reread alone is a must.
　　It is an inefficient use of time to devote limited oral speaking time to reading it out loud.
　　Share as reading material
　　(It would be better if we could put the "readables" on the Miro for the study group, but I'm not sure if we'll be ready in time...)



[https://gyazo.com/781d19fe7f2e76b6ac8e05e2e64d8c5a]
　What is data?
　　Observe and record a wide variety of things
　　　This recorded material is called "data."
　　　Most of the data is unquantifiable

[https://gyazo.com/6869b43296ff560a1278895861940063]
　Hmmm, I've got the explanation there in the form of "I'll do it alone" coming first, but I might talk about the exploratory internet first in the flow of things.
　[https://gyazo.com/e1440999925405bdea4aeec2413de38d]
　　in this way
	[https://gyazo.com/8e61cc7e52a1061f7ef83eebe079189a]
　　The KJ method, which takes 10 hours to organize 50 sheets, is too burdensome, so we created a practical version.

The bicycle metaphor has developed a bit.
　Suppose you and an older student ride a bicycle together.
　If seniors hold the handlebars and seniors pedal, no matter how many two-person rides we do, you'll never learn to ride a bike.
　I take the wheel" = I make the decisions about what direction to go.
　I pedal" = I generate the energy to move forward.

This is the difficult part. For example, if I say, "You should put this here," while we are working, it would be like putting my hand on the handlebars of someone who is practicing to ride a bike alone from the side.

memo
　I have difficulty with ~, I don't know what to do."
　　Then don't.
　　Implicitly assuming that they "have to"
　　Why do I assume that I am?
　　[Humans continue with pointless procedures].
　　　If I start talking about this, there's not enough time.

4:00
 I did a little work on it before I went to bed, and then the engine started and it was this late.
 　Try a hot eye mask and if you don't fall asleep, we'll get up.
9:00
 I'm up.
 [https://gyazo.com/598eb50045a520fc49b406f081b4c788][https://gyazo.com/cd91a4936426db5a000a58196ec961f7]
　You've been sleeping very well for a short time, but at a great rate.

The Problem Solving KJ Method Workbook was published in 1970.
 Development and Application of the KJ Method" (Chuko Shinsho, 1970)
 　The "Idea Method" sold so well that people started asking me to teach them how to train in the KJ Method, so I wrote it.
 　[* "Problem Solving KJ Method Workbook"] here
 [From research to creation (Kodansha Gendai Shinsho, 1977)
 	The KJ method was created and popularized as a way to assemble data, but examples of successful use are rare, so why is that? The "information gathering place" in front of you is the problem.
 	> If the quality of the original label data used as material for the KJ method is poor, the results are irredeemable. (p.29)

[https://gyazo.com/5e9117235713f26136c8106dae7c64e5]
　I split it here in the "my style" section.
　Mastering the KJ method is not about knowing the correct KJ method, but about refining one's own intellectual production techniques using the KJ method as a reference.
　　I'm sure there are forces that would disagree with me if I were to say.
　　People for whom "doing the right KJ method" is an end in itself.
　　KJ method is a means, not an end
　　Intellectual production as a means to what end?
　　Whether the means of production are working well can be judged by the quality and quantity of the output.
　　Those who claim that "doing the right KJ method is important" delve into what they have created by doing the right KJ method.
　　I don't need to include this story in the lecture material.

---
[https://gyazo.com/10b780b3344ac1c4b2203b677939d200]

Parable of the Bicycle
　If you fall, you won't get hit by a car.
　This work is not a job with clients or deadlines.
　If you make a mistake and fall, you won't be seriously hurt.

Parable of the Bicycle
　Sense of moving forward
　Pedaling the bicycle with the stand up does not move it forward.
　They look like "people on bicycles," but they're not.
　Doing that won't help you learn to ride a bike.
　To "move on" is to "realize something you didn't realize before."

People who can already do it
　The skills of veterans are not being passed on to the younger generation" is an issue that needs to be resolved from a long-term perspective.
　Seeing people fall down because they can't do it right gives you a chance to look at what you're "doing somehow" and verbalize it.
　Unlike working in a team, you are not "accountable for deliverables" and can focus on process improvement rather than deliverables
　Your personal skills are more easily improved when the process can be verbalized.

I can talk about it with confidence because it's connected to a lot of information in a consistent way, and I can dig in and provide additional explanations as needed.

2022-12-01　35min
cut
　["I read the assigned book "Ideas" but I don't know what it means"].
　　Well, you wouldn't learn to ride a bicycle by reading an early explanation of what a bicycle is, written by the inventor of the bicycle.
 Many people have trouble organizing groups.
 　So far, I've heard that some people assume they have to do things even when they don't have to.
 　　Even in cases where I do it out of necessity, I get a lot of questions.
　[Jiro Kawakita.icon] "Some sets of labels are a set of two labels, while others are a set of three labels. [Some sets consist of four or five labels" (p. 126).
　　There is a case in [Jiro Kawakita.icon]'s experience where the average number of sheets was 13 as a result of sticking together, but we consider that to be an exceptional event.
　　>In this example, the small group of units in the first stage averaged a little less than 13 pieces. In this example, the number of units in the first small group averaged just under 13, but this was due to the fact that there were quite a few units in the field data collected that should unquestionably be in one group.... It is normal for a group to include as many as four or five pieces of paper or units. (Continued from Ideas, p.72)
　　In other words, the number of sheets is not a guide in advance, but is determined by the data

[https://gyazo.com/8f3a23e3f97dca2ab3568fc6baa022c6]
