Fedibird Reference
summary
　Fedibird can "reference" multiple posts
　>References are complementary to replies, quotes, and boosts.
 	>Unlike replies, you can mention more than one post. [src https://fedibird.com/@noellabo/108082057659111183]
	You may loosely couple the clarification of the mention and the notification to the person mentioned, and only do the former.
		>References can make references explicit.
		>Mentions will not be included and the other party will not be notified.

from [Fediverse]
Fedibird Reference
https://fedibird.com/@nishio/109370937905173000
>nishio @nishio I think there are "references" in addition to replies and retweets (boosts)
[https://gyazo.com/513697168a39b4a2f1bf348f8753a09a]

https://fedibird.com/@blu3mo/109369255787813697
>Bluemo @blu3mo
> @nishio I'm confused as to how this toot is tied to the "Support my Scrapbox for ActivityPub ~~" toot!
> something equivalent to a quote RT, since it doesn't show up in the rep section...?
https://fedibird.com/@nishio/109371036093889937
>nishio @nishio
> Fourth way
>"Do you want to copy the link?" the chain-like symbol next to the reply." I pressed it thinking that (A) it adds the post to a global "reference list" of sorts, and (B) when I try to post normally, it tells me that a reference has been granted. Then when I try to post normally, (B) it tells me that a reference is being added. I did this without understanding either A or B, so I got an unintended reference. I think.
> If that post had not contained a link, it probably would have shown the reference, but it happened to contain a link to an external page, so it was overwritten.
	>Bluemo @blu3mo@fedibird.com
	 >I see. So you can reference two tweets and do something like tweet `[reference]`.
 >inajob@electronics,programming,childcare @inajob@mstdn.jp
 	> @nishio That feature seems to be fedibird specific, I can't find it in the official client or mstdn.jp
 >nishio @nishio@fedibird.com
 	> @inajob It's interesting that social networking sites with different functions are forming a loose federation, I'd like Scrapbox to join this federation...

