When will you change the front page of the KJ Act?
Q: You say I can change my KJ Law nameplate at any time, but when in the world do I change it?

A: There are two explanations for this, one with "sense" and one with "logic". I think the person who asked this question is the type of person who wants an explanation by logic. However, the "sensory" explanation is more concise, so I will do that first.

When do we change the KJ method nameplate?
　You change it when you feel it is not turning out well.
　When you find it hard to do, you change it to make it easier to do.

What is the state of that "running well"?
My curiosity is piqued and I am in a state of [* excitement and fun].

The rest of this section is for "those who want an explanation with logic" who do not feel comfortable with this explanation.

In order to "change things when you feel they are not running well," you must first recognize whether what you are doing is "running well" or "not running well.
This sensation is first of all nonverbal. Using the wine analogy, you may be able to perceive the complex tastes and aromas of a wine, but not necessarily be able to describe them in words. It depends on your vocabulary and ability to verbalize. So the nonverbal senses come first, and language comes later.

The KJ method is a method to support intellectual production. Therefore, the most important objective is "to create a state of high intellectual productivity. The detailed HowTo is only a branch and a branch only.
Intellectual productivity is the value of the final product per input cost, but this is difficult to measure. This is difficult to measure because it takes a long time for the ideas generated to finally produce value. Therefore, we focus on process productivity. The short-term goal is to ensure that ideas that are likely to be valuable are produced.

Producing the same idea that already exists is of little value. If you work for three hours and "come to the same conclusion as usual," then those three hours of work are wasted and you should have gone to see a trendy movie.

If you are not enthusiastic about an idea you have generated, then it is of little value. This is because ideas, after they are created, must be nurtured and refined with a lot of effort before they can be of any ultimate value.
If you, the creator of the idea, are not willing to put in the effort, the odds that others will be willing to do so are also low. As a result, the probability that the idea will grow and bear fruit is also low.

This "state of new things being created and your interest and enthusiasm for them is the state in which the KJ method is working well" can be expressed sensibly as "[* Excitement, fun! This is the state in which the KJ method is working well.

This "good state" could be quantified, for example, by measuring blood flow in the brain. However, at present we do not yet have a means of measurement that we can use in our daily work. We have no choice but to use the means available to us now. That is "sensation.

It is not peculiar for you to know your internal state through your senses.
For example: .
　On a cold winter morning, when you're shivering and thinking about making a warm cup of coffee
　When you're up late on a holiday, reading an interesting novel in bed, and you're about to turn off the sidelight when you stop reading the rest of the book.
You sense that your internal state is inappropriate and you are taking action to correct it.
The same can be felt for malfunctions in the intellectual production process.

Those who want logic to explain things to them may value logic over the senses. However, if the nonverbal senses are disregarded and not used, the ability to sense them will deteriorate, making it even more difficult to make decisions using the senses. A person who says of wine, "I don't care what it tastes like or smells like, as long as it's cheap and has alcohol in it," cannot be a sommelier. It is necessary to pay attention to the senses and be able to use them as a source of information.

関連
　[When to change the front page of the KJ method (creation process)].

