Meaning of asymptote in an asymptotic formula
>I'm not sure of the derivation of the word "incremental", so if anyone knows, please let me know. In English, it is called recurrence relation or difference equation, which I think is more intuitive.)
	[https://note.com/n0mimono/n/n548fac74f8e7 Sequences, Approximation and Computational Complexity｜Ryota Yokote @ mirative |note]
　I was curious, so I looked into it.

The term "asymptotic formula" was used as a headword in the Dictionary of Physical and Chemical Sciences as early as 1939.
　Translation of Reccurence fomula.
　Also called "recursive formulas." This one is closer to a literal translation.
　The asymptotic series is used to illustrate the process.

I wish I could see the contents of the Dictionary of Physics and Chemistry, but I couldn't, so I refer to the 1937 General Theory of Integral Calculus as another source.
In this book, equation (2), which appears when integrals that cannot be computed directly are computed by the method of integration by parts, is called the graded formula.
	[https://gyazo.com/1b7f2ec49e8b3114bddf0ebe381ce3ce]
　In other words, this is a method of obtaining the integral in the form of an asymptotic series, and was probably called an "asymptotic formula" in the sense of "an asymptotically series-izing formula.

It is probably a term whose origin is no longer known, as it was later used even for sequences of numbers that do not converge, and the nuance of "gradual" was lost.

--- memo

Google Books
1954
[https://gyazo.com/496af1793d11381b708f845ab6d5b831]

1939
[https://gyazo.com/0385afc8f84831be19979865e261cf5e]
Asymptotic series refers to asymptotic series (OCR error)

[https://gyazo.com/dc2ecceb491353751234e070cdd42918]

[https://dl.ndl.go.jp/ National Diet Library Digital Collections]
The two oldest were both books on integration.

Problems in Higher Mathematics. Vol. 5, Integral calculus, books, ed. by Kondo, Shigeru Fujioka (Chukokan, 1925)
https://dl.ndl.go.jp/info:ndljp/pid/914322/10
[https://gyazo.com/42c7192c9a4fec3a034030fd8959135a]

General Theory of Integral Calculus, book by Eisaku Yamazaki (Uchida Rozuruho, 1937)
https://dl.ndl.go.jp/info:ndljp/pid/1256000/17
[https://gyazo.com/12a4047805a58f1bae012310ec48a362]
