No image generation AI function to CLIP STUDIO PAINT
>[https://twitter.com/clip_celsys/status/1598617164235575296?s=20&t=66g2q9yymbt8xIh30JAzAA @clip_celsys]: We take your comments very seriously and have decided not to include the [Image Generation AI] function in [CLIP STUDIO PAINT], we have decided not to add the [image generation AI] function to [CLIP STUDIO PAINT].
>We developed this product with the desire to give everyone a new creative experience, but we lacked the necessary consideration before giving them the experience.
>[https://t.co/7GEUORby4O We have decided not to include an image generation AI function in CLIP STUDIO PAINT].
>[https://pbs.twimg.com/media/Fi9tsuxagAAJBaf.jpg]

>[https://twitter.com/motoso/status/1598643427146887168?s=20&t=7NmlUr1HstfthZvVZ3cHew @motoso]: this is what happened when Celsys "listened to the users", homegrown creative. Tools don't use AI systems at all, and if they're not developed, they won't solve the problem. ！！！！！
>I would like to see the strength to do research and development internally, but I don't know...
	>[https://twitter.com/motoso/status/1598644057844383744?s=20&t=7NmlUr1HstfthZvVZ3cHew @motoso]: It is good to want cleanliness, but it is difficult to make it high quality and completely clean. I think it's difficult to make it clean, and it's the usual pattern that foreign capital will completely dominate the market if we don't use it.
 >[https://twitter.com/motoso/status/1598644189104947200?s=20&t=7NmlUr1HstfthZvVZ3cHew @motoso]: they didn't amend the copyright law to prevent this from happening.
 >[https://twitter.com/motoso/status/1598644301499895808?s=20&t=7NmlUr1HstfthZvVZ3cHew @motoso]: the irredeemable punchline that even if the law changed, it was no good because the awareness of those who use it was waiting for us.
 	Related [Japanese speakers give low ratings in reviews, so they don't sell in Japan].
	>[https://twitter.com/motoso/status/1598649870231166977?s=20&t=7NmlUr1HstfthZvVZ3cHew @motoso]: future prediction: US companies with fair use will steadily develop and it will be more and more used more and more.
 >At some point, there will be a tipping point in the argument to allow AI illustrations, and everyone will use them. Since they can't develop it, domestic players don't stand a chance.

>[https://twitter.com/nishio/status/1598653769499447296 @nishio]: After this, a mysterious venture company releases a drawing tool with Japanese language support and image generation AI, and users want to use the tool with image generation AI. After the users migrate to that tool and the market proves that the AI-loaded tool is more correct, a friendly M&A will take place (this is a science fiction plot and has nothing to do with a real company).
	>[https://twitter.com/nishio/status/1598654303883120640?s=20&t=66g2q9yymbt8xIh30JAzAA @nishio]: For example, if the company that developed the side that does not carry AI is absorbed and merged into another company, The company's "declaration of non-AI" will disappear when the company disappears, and the source code and other intellectual property will continue to be owned by the surviving company (this is a sci-fi plot).
		Addendum: I'm considering the case where the "corporation" here says "we don't give it out in our corporation."
		　In the actual Celsis case, they're just saying, "We're not going to load it on our particular product," so it has nothing to do with the survival of the corporation or anything like that.
 >[https://twitter.com/nishio/status/1598656797661069314?s=20&t=66g2q9yymbt8xIh30JAzAA @nishio]: this is a SF plot consideration, but I have a team of enthusiastic engineers in my company. What kind of finance would you suggest to let a team of enthusiastic engineers start a separate company with existing software assets, and if it succeeds, what kind of finance would you suggest to reabsorb them without friction?
 > The new company purchases the rights to use the software assets from the old company. The proceeds are made in the form of convertible bonds. The convertible bonds are bought by the old company. If the convertible bonds are converted into shares, the new company will have enough voting rights to become a subsidiary of the old company, or something like that?
 > Maybe someone who is good at doing this kind of thing here and there is in a strategic consulting firm or something. w

>[https://twitter.com/tokoroten/status/1598658964316893184?s=20&t=66g2q9yymbt8xIh30JAzAA @tokoroten]: @nishio https://t.co/dpJLJ01Gll
	>[https://twitter.com/tokoroten/status/1594255866177687553 @tokoroten]: I was looking at the Mercury Witch, and I saw a story that donned the material I used in my recent talk, so I'll let it go with a swoop!
 >New business can be conducted outside of consolidation to avoid reduced mobility due to audits and compliances, and to avoid accountability to the stock market.
 >[https://pbs.twimg.com/media/Fh_ugAIaUAEaDPS.png][https://pbs.twimg.com/media/Fh_uq8NaUAMQi1x.jpg][https://pbs.twimg.com/media/Fh_vNMaagAMbsIs.jpg][https://pbs.twimg.com/media/Fh_vQHNaUAAXB1V.png]
  >[https://twitter.com/tokoroten/status/1594266803492237312?s=20&t=Rw8EZqfI3tOHNhVPhb_GWw @tokoroten]: In other words, big companies use their brand power to make and sell products to Lagarde. More than they are,
  >Compatible with new businesses selling to early adopters with vision and functionality
  >So, isn't the right thing to do to stop keeping new business in the same box and make it an unconsolidated company? That's what I'm talking about.
  >https://t.co/dEdNVVLo19
  >[https://pbs.twimg.com/media/Fh_4sDaaEAIsx8I.jpg]
　　　[Lagarde] said that it is difficult to do new business for early adopters while doing business for [Lagarde], so it is better to separate the corporations.
　>[https://twitter.com/tokoroten/status/1598675928078774272?s=20&t=xCrdX6JMvSG4SjDz3UDcxA @tokoroten]: So, Celsys spins out the image generation AI and makes it a separate company. We will spin out the image generation AI-related business into a separate company, dilute the voting rights by getting outside capital from a company we know well, remove the capital relationship, and sell the image generation AI as a plugin for Crysta.
 >I think the right thing to do would be to make it a subsidiary when a certain amount of users start using it.

