Diary 2022-12-03
>[https://twitter.com/nishio/status/1598915714886565888?s=20&t=5q2Ws7b8cr-CefMggXAkdg @nishio]: I think the most serious features are "The output of image generation AI has a watermark. I think the most serious feature is that "the output of image generation AI has digital watermarks so that future AI will not use it for training data", "it is expected that people will use text creation AI to create explanatory blogs", "text is more easily modified and reconstructed than pictures, so it is difficult to tell if it is AI-generated or not".
	>[https://twitter.com/nishio/status/1598916785486852096?s=20&t=5q2Ws7b8cr-CefMggXAkdg @nishio]: people who know what they're doing are saying, "They're generating bullshit commentary and it's hilarious," and the future The productivity of "blogs with bullshit commentary being written by humans right now" will increase a hundredfold, and the people writing those blogs don't value being "correct commentary." And readers who can't discern the bullshit now, of course can't discern it either.
 >[https://twitter.com/nishio/status/1598917720720150528?s=20&t=5q2Ws7b8cr-CefMggXAkdg @nishio]: This is the same composition as Pixiv, where a lot of AI-generated images flow into Pixiv, and people who "want to see non-AI images" have trouble finding what they are looking for. This is the same composition as Pixiv, where people who "want to see non-AI images" have trouble finding what they are looking for.
 >[https://twitter.com/nishio/status/1598918588098048000?s=20&t=5q2Ws7b8cr-CefMggXAkdg @nishio]: I personally dislike "commentary on bullshit content" regardless of whether it was generated by AI or not. I dislike "writing commentary" regardless of whether it's AI-generated or not, but since it's 100 times easier to do it and there's an incentive for those who have been doing it to expand, I doubt that saying I dislike it will stop society from moving forward.
 >[https://twitter.com/nishio/status/1598919457015226368?s=20&t=5q2Ws7b8cr-CefMggXAkdg @nishio]: Maybe media with a VOTE like StackOverflow, or a notated I think the weight will increase for media with votes like StackOverflow, or engines that allow readers to search for articles by a pre-defined "trusted authors list".

>[https://twitter.com/crs/status/1599269453333602304?s=20&t=ALfmaOgjbq2I7bdKX1e60A @crs]: from "[what was said rather than who said it]" back to "[who said it]" since 2ch Yes.

>[https://twitter.com/sea85419/status/1599210261894025216?s=20&t=ALfmaOgjbq2I7bdKX1e60A @sea85419]: great series of thoughts, I feel like we can think of this as a question of how to respond to [information] by or using AI I feel like it can be thought of as a question of how to respond to [Sybil attacks] by or using AI. I think that ultimately it becomes a question of how to seek "collateral". That may actually be the same issue that blockchain has addressed as a proof of OO.

>[https://twitter.com/hachimojino/status/1599112527434362880?s=20&t=ALfmaOgjbq2I7bdKX1e60A @hachimojino]: I recall that fossil fuel combustion and nuclear testing changed the concentration of C14 in the atmosphere. I recall that the C14 dating had to be corrected due to changes in atmospheric C14 concentrations caused by fossil fuel combustion and nuclear testing.

>[https://twitter.com/uma_blue/status/1598918443050635264?s=20&t=xOa17Tjq-ssFEx3kc24Gtg @uma_blue]: is there a trend toward [peer review assistant] AI?

>[https://twitter.com/0xtkgshn/status/1599137368052989953?s=20&t=5q2Ws7b8cr-CefMggXAkdg @0xtkgshn]: the time has come for [curation] by people to be valuable.



[Diary 2022-12-02]←Diary 2022-12-03→[Diary 2022-12-04].
100 days ago [Diary 2022-08-25].
1 year ago [Diary 2021-12-03].