KJ Method Study Session @ Loftwork Pre-map comments
from [KJ Method Study Group @ Loftwork].
KJ Method Study Session @ Loftwork Morning comment of the day
2022-12-02 Day of the event
　When I looked on the morning of the day, a surprising majority of people had started making nets.
　I went around commenting on the state of affairs as of this morning, as there was no merit in procrastinating.

[nishio.icon]
I'm enjoying watching the people here and there who have started ahead of me. It's interesting to see how differently people do things.
(PS: Comments on the map by people who had made it in advance are summarized on this slide)

Case 1
[https://gyazo.com/4b557c6ebb2feaf44832b66aaf197c70]
　You can focus on individual label X in these "small chunks away" and think about whether there are any labels in other "big chunks" that might be good to draw a line through.
　Then you'll see that "some things are more likely to lead to X and some are less likely to lead to X".
　This will cause a positioning within the "big vague group".
　Supplemental:.
　　At this point the lines had not been drawn at all and were divided into large chunks
　　　Actions contrary to the principle of [group formation from small teams to large teams
	 [https://gyazo.com/38b993596bef0fe95c614d5e28be16cc]
　　　Draw a line through what might be related and bring it close together.
　　　The "position" is created by "near/far" between individual elements in a vague mass.
　　　　[Individual identification and coordinate knowledge], [Jiro Kawakita.icon] said, but I doubt if this expression is easy to understand.

Case 2
[https://gyazo.com/f97abbba9b92ffb21eb8b4c53a48a341]	
　You should try to shorten long lines as much as possible.

Case 3
[https://gyazo.com/68f6e971286b779f6d8e4f96898b3688]
　I prematurely grouped them together, but this group is isolated.
　For each of the labels in this group, you might consider where it would lead if it were to connect to a label outside of the group.

Case 4
[https://gyazo.com/20d5dfb48d45ad8207887bbf549c17cd]
　What is represented by this "large circle" is "the group boundary we originally had."
　　It would be good to remove them once and focus on finding "relationships that cross over existing groups" that are hard to see because they are hindered by their boundaries.
　If you're afraid to erase it, copy it.
　Supplemental:.
　 The "existing" and "natural" "hierarchical structure" of family, daughter, eldest daughter, etc. is strongly represented.
　 Actions contrary to the principle of [group formation from small teams to large teams
　　The constraints of that structure prevent the discovery of new structures.
　　At the time a new structure is discovered it is weak, so it loses out to a strong existing structure.
　　Need to weaken existing structures

Case 5
[https://gyazo.com/fbecca0703c9c95be1e75f5b63b5d117]
　Try to move the lines, as short as possible, and as close to the side of the label as possible so that they do not intersect!
　If you don't feel comfortable breaking the current version, just copy it.
　(There was another similar one.)

Case 6
[https://gyazo.com/bdcf3fe39dc7ef2cb93d174cbf3034c5]
　Which label is a direct answer to the central question?
　　Let's connect it to the center label with a line.
　　If not, add a label.
　　This does not have to be the "right" answer to the question
　　It's OK to say, "This is what I'm thinking at this point."
　Supplemental:.
　 Labels are in good condition, connected to one another overall by lines.
　 But it's not connected to the "theme label" in the middle.
　 Connecting to the labels of the theme will help us understand if we are "close/far from the theme" and if we can describe the theme from multiple perspectives.

Case 7
[https://gyazo.com/39cee3b4a6f230dc14c30908d19ffb7a]
　For each of the labels in this "group of 5 labels", it would be good to think about whether any of them are connected to other labels
　Supplemental:.
　 There is also an "isolated group" similar to Case 3 in blue.
　 As to which should be taken care of first, there's no general rule.
　 At that time, I first noticed that "you are surrounded by 5 items from the beginning, when you are planning to surround 2 to 3 or at most 5 items later.

Case 8.
[https://gyazo.com/45c6664776a128ddc5222c9790c05ca9]
　As for one-word labels, "What exactly does ~ mean?" or "What is it, for example?" and so on, you can add more information, add to the label or add a new label to make it easier to net!
　Supplemental:.
　 Labels are not "[delved] into," [not grounded], [floating].
　 see [parable of the floating weeds and trees].
　 In the words of [Jiro Kawakita.icons], "preserve the [earthy] scent of the original material as much as possible."
			>The conceptualization process is important to the minimum extent necessary, and should not be unnecessarily refined into a "concept.
				Ideas p. 141 see [Don't abstract too much].
　　Terminal labels such as "flower" and "sunset" are currently "too abstract a concept."
　　　So I can't find a connection between them.
　　　When each becomes a sufficiently concrete image, opportunities are created.
　　　For example, "falling cherry blossoms" and "a cold meadow with the setting sun" could be connected by "sadness.

Case 9
[https://gyazo.com/c6c12956b7c9bdf8c82055e901441595]
 If we label these "things we noticed" and place them in the net and think about what they connect to, it might be good to separate the big blurry mass of the current situation by pulling it into a line!
 Supplemental:.
  Lines are not drawn, but a rough tree-like structure has been created.
  What is considered "noticed" in this state is probably "associated" with the process of writing it down or arranging it.
  　I wanted that "association" to be labeled and connected by a line to the label of the source of the association.
  　Currently it's just [an idea inspired by one stimulus
  　[the acquisition of inclusiveness] occurs by connecting with a number of things.
  　see [interference effects of ideas].

Case 10.
[https://gyazo.com/15b41041789970933b2564ef21ebc96d]
　What labels connect to the central theme? You might want to think about
　No space for development around the central label.
　　It would be better to expand the space first to make room for something new.
　If you're afraid of breaking it, make a copy and keep it.
　Supplemental:.
　 It's very good, firmly "net-like" (I should have explicitly praised it, I forgot).
　 Not tied to central theme.
　 There's no space around the central theme, so if we connect it now, we'll run out of space if new ones are created.
　 I had already started to draw up to the enclosure line (with Miro's current capabilities), so I had to be smart about spreading it out without breaking it.
　 　If you try to do it after the new thing is born, the "exuberance of the new thing" is crushed by the "tedious puzzle of making room for it".

Case 11.
[https://gyazo.com/15a120a57b6a59a079fa6ecbf49fa44c]
 The branches seem to be growing out of the theme, very nice!
 I think if you think, "Is there a connection between this branch and another branch?" and then find them, connect them, and so on, and you will be able to use the mesh.

Case 12
[https://gyazo.com/fb0e3b13af9c6564ad420d2f4f3be868]
 Great, this looks perfect.
 Dare I say, is there a line or label that fills this "gap"? You might want to think about it.

Case 13.
[https://gyazo.com/9238e1827a0e15254990de343ed4b460]
　Looks small, cramped and hard to move around.
　There's plenty of paper space around it, so you can use it more spontaneously.

Case 14
[https://gyazo.com/9b7a3c6be13addeedd9d79b1f8eff4c7]
　Think about whether you can draw a line between each label in this large group and the outside labels, so that it becomes a mesh!
　Supplemental:.
　 There is another group above with a large number of elements, but this one is connected to the outside world a lot, so it's not much of a problem.
　 The group below has become isolated.
　 　It's like having a group of people from the same high school all talking at a college freshers' party.
　 　If you don't talk to more people outside the group, you're just extending past relationships and not creating new ones.


Case 15.
[https://gyazo.com/a1f2f998b506cad6e02faee88e743cfe]
 This may be a "vaguely spatial arrangement," and you may be troubled by the cloud-like blur in front of you.
 If so, "are there any labels that can connect the lines from the thematic labels?" you might want to consider

For people who are not lucky (2)
	You'll have plenty of time to work through this net, so maybe after you've done it, you can look at it and try to create a new net based on your findings.
	The map can be used not only for "presenting" but also for "deciding on actions to be taken immediately afterwards" or "digging into newly discovered issues with a new map", etc.

Additional information about the cases that were occurring in more than one place after looking around.
	There were a few cases where the middle theme label was left alone.
		This would be a side effect of having the label made ahead of time.
		In the original "Thinking Fireworks," only the labels of the theme are in the middle at first, and from there, add labels you associate with it and connect them with a line repeatedly.
		So, inevitably, "all labels on the map are directly or indirectly connected by lines from the sticky in the center.
	Another point, there were about 3 cases where large groups of 5 or more were pre-made.
		It's that "pre-conceived group" boundary that gets in the way of finding connections between labels inside and outside
		So it would be good to be aware of this and actively look for connections between inside and outside, or get rid of them altogether!
I was re-compiling the Slack posts on this page and noticed this addition:.
　"[If you're afraid of breaking it, just copy it and keep it]" also wrote several times
　 I don't think this was in [Jiro Kawakita.icon]'s book.
　 　This is because before the widespread use of computers, the cost of storing work in progress was high.
　 　This is one of the cases of "[as the situation changes, the optimal method also changes].
　[large blurry mass pulled apart by the line].
　　This is another concept that has come up several times
　　People who have trouble organizing groups tend to create a big blurry mass of many labels just gathered in one place.
　　Such a mass is likely to be either
　　　The nameplate is very abstract.
　　　　It's a mass of things that were originally abstract concepts that you had, and then you unconsciously used them to collect things that fit into those concepts.
　　　I can't put a nameplate on it.
　　　　It's all about what's in it.
　　If a line connects to label X in that clump, then shrinking that line will break up the larger clump.
　　　Is it ok to just tear off X. Are there labels that want to follow X?
　　　A pair that resists being torn apart shows that there is a line between them.
　　　[https://gyazo.com/146e00bd307c6296b3e9073075764c7a]

