KJ method study group @ Loftwork Slack during personal work
from [KJ Method Study Group @ Loftwork].

Thread 1
 I wrote this in [KJ method study group @ loftwork pre-map comment #638dc07eaff09e000090104a](case 14):.
 	[https://gyazo.com/9b7a3c6be13addeedd9d79b1f8eff4c7]
 　Think about whether you can draw a line between each label in this large group and the outside labels, so that it becomes a mesh!
 　Supplemental:.
 　 There is another group above with a large number of elements, but this one is connected to the outside world a lot, so it's not much of a problem.
 　 The group below has become isolated.
 　 　It's like having a group of people from the same high school all talking at a college freshers' party.
 　 　If you don't talk to more people outside the group, you're just extending past relationships and not creating new ones.

	[human.icon]Q: "How exactly am I supposed to separate and place them?" And my hands have stopped!
 [nishio.icon]A:
 	Make a copy of the current one and keep it nearby, and only use the sticky note in the center!
 	I think we've become so tied to the structure of the labels we already have that we can't change them to a new place.
 	So, I will leave it by once.
 	and make "words that come from the central sticky note and associate them with it".
 	The placement of these will be around the center sticky note.
	(Afterwards)
		[https://gyazo.com/eefbe67e32fa45e246e7b98122d62b64]
		[nishio.icon]Let's draw a line from the central theme, which of the labels we have now are connected to the central theme?
	(Afterwards)
		[https://gyazo.com/e2e3165195d26bb7531c5b22f83d4fa8]
		[nishio.icon]It's looking good!
		[https://gyazo.com/79131bce5a6aec251d5c68fdb72045ef]
  	Red is "good."
  	Blue says, "There's a valley here."
  	Green is "unclear where it leads."
	(Final state)
		[https://gyazo.com/ca6d8989d4e857c540145aef7c36c90c]

 [nishio.icon] notice
 　I noticed it when I was painting the final state.
 　The original had exactly the same thin black lines connecting the labels and the enclosure.
 　I found this "hard to distinguish" and "[a] cognitive burden.
 　The center sticky, "What do you want to do with X?" was mentioned that the "X" was changed to "X".
 　　What do you want to do?" (What do you want to do?"), he said, he felt that only answers that already existed would be lined up.
 　　I had to go through...
 　　Basically, "change it to make it easier to do" is a good thing.
 　　I was a little curious as to why all the answers were lined up that were already there.

Thread 2
	[human.icon]I'm slightly worried about where to place the first sticky from the center sticky,..,
	[nishio.icon]At first, it's fine to start with the appropriate sticky. From the second sticky, the influence of "the positional relationship with the already placed sticky" becomes stronger and stronger.
	relevance
		[human.icon]Sharing a realization: I found myself trying to extend the arrow from the center in four directions due to the square shape of the sticky note. By thinking of the theme in three dimensions, I would like to connect the two-dimensional preconceptions.
  [nishio.icon]In that sense, it would be good to place them at an appropriate angle instead of perfectly aligned horizontally or vertically.

Thread 3
	[human.icon]With a sticky note in front of you, you have to extend it from the center, so your hand is pretty much stuck.
	[nishio.icon]Well, everyone was very skilled, and I think it would have been better if we didn't have to have the labels prepared in advance if this was the case.
		Making stickies in advance is just "to extend the work time that may be missing".
		So I think it is better to leave it by your side once than to let it stop you.
	Supplemental:.
	 If we do a second session, maybe instead of "please go make 25 labels," the advance preparation should be "put the theme in the middle, add the associations as labels, draw a line, repeat 25 times, and leave it with a branch growing.

Thread 4
	I'm not sure whether to connect them with [human.icon] lines or just keep them close together since they have similar content.
	[nishio.icon][- if not an exact match] Let's make it a line
		Supplemental:.
		 By not being used to "drawing the line," we tend to unconsciously avoid drawing the line!
		 So the intent was, "If you're not sure, let's make it a line.
		 The "if it's not an exact match" was superfluous, but that's not the rule.
		 　It's rather worthless to put labels side by side with exact matches.
		 [Jiro Kawakita.icon] expresses it like this in [Let the chaos speak for itself] p.289. ([How to use clips on the exploration net])
		 　[https://gyazo.com/77dcddc698ec321c5dd5ce1fbbbfbf18]
    This was the age of no computers, so I made a tearful effort to use clips to display the relationships while allowing the labels to be moved later!
    I think the following interpretation would be easy to realize this with the current tools
    　Generally, "relationship" is "one line."
    　The "conflict relationship" is "two-headed arrow ↔."
    　Similar relationships, sets, and sequences are arranged without lines.


Thread 5
	[human.icon]It's difficult to choose a theme that doesn't seem to have the right answer for me...
	[nishio.icon]Shift the question a little, "What action do you think you should take next to find the right answer?" And?
		(I'm saying this at random without looking at the map)

Thread 6
	[human.icon]Q: I try to draw conclusions quickly from a few labels...
		Is it important to start with a rough label without a goal in mind?
	[nishio.icon]A: The first step is to create a tightly connected net.
		Because the "conclusion" you made before it was made was just what you originally had.
		So it's not "new".
		The bicycle is not moving forward.

Thread 7.
	[human.icon]When I get the feeling that distant stickies are connected to each other through different routes, I feel the limits of two dimensions.
	[nishio.icon]"I try to avoid intersections as much as possible," but there are still limits to two dimensions, so there are times when they do intersect.
		It's a real downer when you say, "I don't write what I think to avoid crossings."
		So, we try to avoid crossing as much as possible, but if we can't help it, we will cross.

Thread 8.
	[human.icon]1: When connecting from the center sticky, there is a sense that the line you choose (- / →, etc.) "determines" the relationship,
		I have a feeling it won't lead to "new insights."
	[human.icon]2: I don't know if it's →...
	[nishio.icon]Let's stop with the one-way arrows!
		Jiro Kawakita did it with just two things: a simple line and an opposing arrow.
			Supplement: [how to use clips on the ExploreNet].
	[human.icon]1: Does that mean everything is going to be "-"?
	[nishio.icon]Yes, everything that is not a "confrontation" of something that might be related is just a line
		As a general rule, "If you're stuck worrying about trying to do something complicated, you might as well not try to do something complicated and do something simpler.
 	It's easy to get stuck trying to do something complicated, like worrying about changing line types or trying to color-code sticky notes!
 	Supplemental: Reduce [cognitive burden].
 [human.icon]1: I see! It's not a question of → is absolutely NG, but the most important thing is to be able to proceed comfortably!

Thread 9.
	[human.icon]I'm not sure if the closest thing to the middle sticky is what I ultimately want to do, or the action (or activity) that seems to be the most key to what I want to do...
	[nishio.icon]We don't know in advance where the concluding notice will appear on the map

Thread 10
	[human.icon]1: I felt that in some cases, words that you would want to write as labels could look a little different by daring to write them out and place them flat with other stickies.
	[human.icon]2: I know what you mean. I think it would be better not to put labels immediately.
	[nishio.icon]: Interesting statement, but probably not well understood by many people, I didn't catch it well either!
	[human.icon]1
		When you look at a group of several sticky notes, a word that sums them up quickly comes to mind
 	I'm going to resist the temptation to label them as a group, and treat them as a single sticky just like any other sticky.
	[nishio.icon]
		I see! Let me put it another way.
  	For a group of stickies, it comes to mind, "This group's nameplate is X, right?"
  	But instead of making it a table-top at one level higher than the elements of the group, dare to make it a sticky at the same level as the elements of the group.
  	There's something nice about doing that.
  [https://gyazo.com/4a59c1351074fa7b8ee1f34c6d1d8c37]
			1: Every element of the group is a little different from each other, even the same family has different personalities.
			2: To put nameplate X on that group is to ignore individuality and make it "X family".
			3: On the other hand, if X is the new label
			4: Bring coordinate axes into the group, such as "labels that are close to X" and "labels that are not so close to X
			5: Provides a means to get a more complete picture of the group
		I got the impression that
		PS: [large blurry mass is pulled apart by the line].

Thread 11.
	[human.icon]Q: What about the stickies that are all self-explanatory phrases?
	[nishio.icon]A: If you're asking yourself the question and getting the answer, why not?
		(looking at the map) I see, that there are many labels for questions.
		If you compare it to fishing, it is the stage where you can put the bait on the hook and throw it in, but the fish is not biting yet.
			We're clearly making more progress than we were at the stage where the hook wasn't ready yet.
			You can't predict when a fish will be hooked.
			Questions that can be answered quickly are not important questions.
				I just posed the question with what I originally knew the answer to.
			Dangling a lot of fishhooks with questions that don't get answered right away.
				And then you leave it and do something else, and then you think, "Oh, that's the answer to the question I just asked.
				This is a fish on a hook.
				It's worth it to catch this fish.
			Related: [hooks to fish for things not yet verbalized].
	[If you have a question, you can answer it at the right time (some questions are unanswerable) while leaving it unanswered.

Thread 12.
	[human.icon]Q: Would you have liked to have had 2-3 enclosures that were not grouped together anywhere so that there was one lone wolf?
	[nishio.icon]I'm going to go take a look.
		[https://gyazo.com/9fbf5e828a907f2922f501b291dce850]
	 No problem!
		You mean the red not surrounded by yellow, which is fine.
  That said, the group doesn't have a nameplate on it.
  	Label red and yellow groups with an explanation of "what that group is"!

Thread 13.
	[human.icon]Around the time you start enclosing things, your ego starts to emerge, like, "I want to put it all together like this.
		As a result, I surround myself with the feeling that "new insights" are not being generated.
	[nishio.icon]That "this is how I want to put it together,
 		Is it something you had before you started making maps?
 		Is it newly born?
		is the problem.
		If it's something you've had for a while, the bike isn't moving forward.
	[human.icon]In this case,
	 	Along the way, key stickies like "Oh! This is it?" kind of key sticky note is born.
 		→It feels good and makes you want to connect the others to it.
	 is
	[nishio.icon]I think that's a good thing.
			New insights gave me a new perspective.
			→ I'd like to look back at the past with that new perspective.
		I thought you meant...
		[Parable of the Hills].
 		It's natural to want to look back the way you came.
 		The view you see when you look back from the hill is different from what you saw before you came to the hill. But what's important is the new view.

Thread 14 (related to thread 13)
	[human.icon]
		>If it's something you've had for a while, the bike isn't moving forward.
		→ I didn't have it before I started making maps either, but I still feel somewhat bewildered.
			You have a fixed idea of how to tie stickies together.
			I wonder if it is not well enclosed...
	I saw the [nishio.icon] map.
		For now, I think it would be good to put the yellow group on the front page as planned and work on enclosing more yellow groups, of which there are still many!
		(I felt that there were many parts of the tree that were not reticulated and remained just a tree, in case I have to do it again in the future.)
		[https://gyazo.com/a9887f20c8894ea20c4a9944689c2b49]
			If you highlight only the reticulated area, it looks like this
			There are a few places where the two are separated by a great distance, but are they really close together? There are a few places where
			[https://gyazo.com/bbb7b6791477bbe1c73160b6506f76ca]

Thread 15.
 [human.icon]I'm experiencing symptoms that the theme of the first sticky is gradually becoming an unimportant issue.
 [nishio.icon]That's progress!
 	I realized that my initial thematic question was unimportant."
 	Then the next step is to ask, for example, "So what is it that we should really be asking?" And so on.

Thread 16.
	[human.icon]Q: I'm trying to surround it at one point, but I'm also late at first, and I'm like, "Is this okay?" I'm not sure if this will work.
		[https://gyazo.com/f48158a531ac533da02473ae741eda5b]
			(In the original, the enclosing lines were thick blue and conspicuous, and the related lines were thin black and unremarkable.
				I drew [nishio.icon] so that it is easy to see what I focused on since the points of interest are reversed.)
	[nishio.icon]A: Ummm, the beginning KJ-legal "create a group and put a nameplate on it" is taking place, but there is almost no net building going on!
		Even where the lines are connected, they are almost a "tree" and not a mesh.
  I feel much less "done".
  It's hard to recover in the last 25 minutes, so we should try to "tie the line" instead of trying to finish in time.
  	I imagine only doing the first half.

Thread 17.
	[human.icon] I'm adding more stickies again, as if I've noticed them all around me!
	[nishio.icon]It's a good thing!

Impression 1
	[human.icon]I get excited when stickies with completely different thought paths stick together and make sense:boom:.
  [nishio.icon]That's it! That's what I wanted you to know!
  When [human.icon]I was able to do it, I just feel good! [laughs
  Supplement: I thought this is what you meant.
  	[https://gyazo.com/4ccc51de74762aee67f5d53015a6305a]
　　　Connections are discovered between "different branches" with different thought paths.
　　　It's fun to pay attention to this "awareness" and to notice even more!
　　　If you rearrange these red "newly discovered connections" to shrink them, you will see a different structure than you had previously assumed

Impression 2
	[human.icon]1: It's interesting to see stickies born out of a game of association, and unexpectedly, you think, "Hey, maybe this is a core part of the game? It's interesting.
		[human.icon]2: Sticky notes that are created because you don't think you have to write properly can be the key!
		[nishio.icon]That's good! What?" Isn't this what you were looking for?" That's what you were looking for, wasn't it?
		Supplemental:.
		 The first label that repeats an association has a relationship with the "immediately preceding label," but is far removed from the root.
		 You can move much more freely away from the "structure" you have and assume beforehand.
		 Like a morning glory vine, it can move around and attach itself to another

Impression 3
	[human.icon]It's interesting that there are unexpected places where things come together and are connected (and conversely, things that I thought were related are not).
		Supplement: I thought this is what you meant.
			[https://gyazo.com/de13e6f881519eba9b4a5c1063b26791]
　　　1: At first, we implicitly assume that these are one group.
　　　2: But if you draw a line and visualize the relationship...
　　　3: "What? I think we'll get along surprisingly well here." It's going to happen.

