KJ Method Study Session @ Loftwork Q&A
from [KJ Method Study Group @ Loftwork].

Question 1
　I would like to know if there is a way to stretch afterwards because [human.icon]the feeling of immersion is amazing and the brain load is amazing!
　[nishio.icon]I want to know too. I tend to [overconcentrate].
　The solution does not seem to be in the KJ method.
　Right now [Apple Watch] is monitoring me and saying, "Get up," but it would be nice to see more development of that type of technology.
	Supplemental Slack
		I'm not good at stretching my brain, but I do walk when I feel like switching after sitting at a desk for a long time and using my brain.
		I don't consciously think about the subject I was thinking about earlier, but sometimes something related comes to mind.
		However, I don't expect or try to come up with something, I prefer to relax!

Question 2: Sorting out the facts and feelings
　[human.icon]Themes about me
　The following are mixed on the sticky note
　　　Solid facts about yourself
　　　My own considerations and feelings about it
　　There are also sticky notes with sentences, and the granularity is uneven.
　　I noticed this after I wrote it, at the stage of spreading it out.
　　Was this the right thing to do?
　[nishio.icon]Good
　　This time, the goal is to gain awareness
　　　The objective is not to collect and analyze objective data to create a report.
　　　(Supplement)[* If the subject is about yourself, "you" are the most important interviewee].
　　therefore
　　　　I want to do this
　　　　I feel this way.
　　　　I thought of myself in response to a fact
　　　These are all "data.
　　　　see: "What is data?" in the lecture material.
　　　　Data" is what we observe and record about a wide variety of things.
　　A "sticky note in writing" is a good thing.
　　　Not abstract word fragments.
　　　The "raw voice" of one's feelings and thoughts overflowing.
　　　It is not well-formed because it has just started to overflow, but this is rather more important than abstract concepts
　　Related:.
　　[Jiro Kawakita.icon][Don't abstract too much].
　　[Jiro Kawakita.icon] It is best to be as soft as possible, and to express yourself in a way that conveys [the feel of the original statement] as much as possible.
　　You can write down anything that comes to your mind as it comes to you.
　　　Keep it in your mind and it will disappear.
　　　Write it down, record it, and make it "data".
　　　When you put it out of your mind and into data, it becomes an indelible object of observation.
　　　You will be able to think carefully while observing that data.
　　　That way you can think better.


Question 3: What is the
	[human.icon]
	　Yesterday, I took each piece of information sensitively and came up with ideas.
	　Today I learned that you have to expand from the center theme sticky note, so I took it apart and tried to expand from the center.
	　Something feels different, what is this?
	[nishio.icon]
	　Same sticky note.
	　　Yesterday, handle it the way you are used to,
	　　Handle it in a new way today,
	　So you felt there was a difference between the two?
	　I'll have to compare the two to see what the difference is... and I'll answer here without looking...
	　What is the difference?
	[human.icon] "I have to organize" is strong today.
	　Scrutinize information one by one
	　　I don't want it
	　　useless
	　　what does this mean?
	　　I don't understand this structure.
	　Sense of being in tune with the information side, rather than doing it sensibly.
	　it is difficult to move
	[nishio.icon]
		>Sense of being in tune with the information side
	　It sounds like a good thing that you are "listening to the data" and "letting the data do the talking".
	　But as for the person in question, it appears that some kind of negative emotion is occurring.
	　I'm wondering what exactly was going on.
		Just to confirm, was there a strong feeling of "I need to organize" today?
	[human.icon]There was more emphasis on organizing than on thinking up ideas.
	[nishio.icon]Where did that feeling of "I need to organize" come from?
	[human.icon] pulled to "spread from the center".
	[nishio.icon]Pulled. What does "pulled" mean?
	Is this correct that [human.icon] spreads from the center?
	[nishio.icon]Were you worried about doing it in a way that you didn't know if it was right?
	[human.icon]Maybe so.
	If [nishio.icon].
	　Yesterday, when I did it the way I'm used to doing it, I was in a high state of confidence that it was the right thing to do.
	　I rode a "new way" and a "new bike" today.
	[human.icon]Something like that.
	　When you walk, you first put your heel like this..."
	　I tried to replace what I was doing unconsciously with technology.
	　The result was an awkward walk, "How did I walk in the first place?"
	[nishio.icon]Then everything is positive, including the experience of walking awkwardly this time.
	　[https://gyazo.com/94995fa678719b2c6bbcdaf42a784cbd]
　　Tip: This is what "looking at it from a different angle" means, so it's a positive thing.
　　By digging deeper into the differences, we can synthesize the two and arrive at something better!
	[human.icon]I was healed.


Question 4: What is the
 [human.icon]For purposes such as creating future projections for the year 2030, we have been using a method of repeating large groupings. Can this method be used for this purpose?
 [nishio.icon]As for that future prediction task, I have no experience with it at all, so I think you should experiment and decide if you can use it or not.
 [human.icon]Which method is better suited for experts like Dr. Nishio to do the thinking?
 [nishio.icon]I think that's independence.
 This time, in an attempt to manage the short work time, I asked them to make the labels first, which may have confused them.
 　The original thinking fireworks start with no label and a theme written in the middle.
 　　In other words [* data not yet available], situation to be increased from now on
 　　Explore and dig inside yourself first.
 　The KJ Method assumes [* a large amount of data
 　　Too much data to compress.
 I think they are like the two wheels of a car.
 　Not necessarily because I'm a researcher, but because all people have both situations.
 　For example, at this study session, [nishio.icon] introduced "Thinking Fireworks"
 　　This lecture material was shaped by the "thinking fireworks" process as placed in Miro
 　　But in the preliminary stages, I did the "KJ method of beginnings" method (with additions later).
 　　　First of all, I felt there was merit in understanding the cost to "let the chaos speak for itself".
 　　　So, I engraved the table of contents on the labels and made the so-called grouping (with additions later).
 　　　Internalize the contents of the book into your own mind.
 　　　　Books" are "interviewed" and labeled with observational data,
 　　　　Organize it and turn it into an organic network of knowledge.
 　　　　A "beginning KJ method" approach is useful for this purpose.
　　Supplemental:.
　　 The expression "so-called grouping" was not a good one because there could be a discrepancy in the interpretation of the word "grouping."
　　 It was not appropriate to call the KJ method for books a "beginning KJ method" approach
　　 　Unlike interviews with many people in fieldwork, books are usually data from a single person, and the tree-like structure is created in advance in the form of a table of contents.
　　 　Looking back at what I did:.
　　 　 First, we have a map that just reflects the tree structure of that table of contents.
　　 　 Then they changed the structure to focus on the links across the branches.
　　 　 　This process feels similar to "[a large blurry mass being pulled apart by a line]" in Thinking Fireworks
　Continuation of the parable of the two wheels (and axles) of a wheel
　　Massive amounts of information are given from the outside, the "KJ method of beginnings."
　　Thinking Fireworks," where you create your own new information from scratch
　　Jiro Kawakita's realization that it is important to "draw information out of oneself" in this phase of "how to organize a lot of data given from outside.
　　　Organizing" is not a stand-alone concept, but is in fact closely coupled with "thinking.
　　　This realization later became a system called the KJ method
　Supplemental:.
　>"Drawing information out of yourself" is also important in the phase of "how to organize a lot of data".
　 As I was writing this explanation, I asked myself, "No, you said 'let the data speak for itself,' can I mix my own ideas?" The question was expected.
　 So I'll try to explain from another direction.
　 If you can draw useful conclusions from the data alone, that's the best you can do.
　 In many cases, however, data alone is not enough to reach a conclusion.
　 　It's like, "There's so much information out there, it's a mess, how do I organize it?"
　 　It's not productive to dwell on "what should I do..." at this time.
　 　　Nothing is going ahead.
　 　Worse yet, "There are some parts that are organized and some messes that are not. Let's just use the parts that are organized."
　 　　Where it was organized quickly, in essence, matched the existing perception.
　 　　Using only that and throwing away a mess that was not well organized is just reproducing existing perceptions.
　 　　There were new ideas to be discovered in that discarded area, but we only use data that supports existing perceptions and stomp out the seeds of ideas.
　 In these situations, it helps to create new information like "Oh, I thought this was unrelated, but if I look at it from this point of view, it will be connected! The creation of new information such as "Oh, I thought this was unrelated, but if I look at it from this point of view, it connects!
　 　This is something that "came from within" the individual looking at the data, so from the perspective of someone trying to organize only "data given to them from the outside," it's like "are you sure you want to do that?" would be.
　 　Both the data that came from outside and the data that came from inside "[Jiro Kawakita.icon][all data is a lie]."
　 　If you want to know if the interpretation is correct, you can do an experiment to verify it, or go out for an interview to corroborate it. It is not something that can be solved by thinking on a desk.

Question 5: What is the
 In the process of organizing more and more [human.icons], there are things scattered all over the place that you want to put together.
　Can I force you to put it all together?
　[nishio.icon]First of all, the realization that "this is something that is far away, but this is something that is close" is a big step forward.
　　When I first put it far away, I thought it didn't matter, that's why I didn't put it closer.
　　In the process of sorting through it, I realized, "This is close.
　　This link is very important, this is "new awareness" and "bicycles moving forward".
　[nishio.icon]I struggle to express that realization on a map.
　　[human.icon]It's so hard.
　　[nishio.icon]Why is that?
 　　Because they are trying to do it while maintaining the structure of the past.
 　　Once you think, "This is too hard," you can make a copy of it, save it, and say, "Let's make a new map with these two nearby."
　[human.icon]I see, so you're moving on to the next phase.
　[nishio.icon]Yes, I'm moving on to the next phase because I've noticed something new.
　　If you try to describe the view from the new perspective while maintaining the view from the old perspective, you get stuck in the middle and wonder "what to do?"
　　In such a case, the important thing is the new one, so just go to the new one.
　　　Related: [parable of the hills].
　　　>It is natural to want to look back the way you came when you are pedaling your bicycle and you come to a hill with a nice view.
　　　>The view you see when you look back from the hill is different from what you saw before you came to the hill. But what's important is the new view.

Question 6: What is the
 I couldn't [human.icon]bash it, it's a blur.
 　I feel like the structure needs to be changed.
 　But it's extending from the center label, so I don't know how to change it.
 　Time constraints prevented major changes.
	[nishio.icon]Time constraints are completely for the convenience of the study group, so when doing it alone, it's still better to do it without any constraints
  Several people said.
  		Like, "This one and this one are far apart, but I want to connect them."
  		Like, "I'm starting to feel like that label in the middle, it's not important."
  　This is an important realization
  　Based on that realization.
  　　Do you want to continue with the current map?
  　　Or create a new map.
  　This is your freedom, your decision.
  　　If you want to rebuild it, you can build a new one.
  　　If you're not sure, just make a copy of the old one and keep it.
  　　　If I feel like I should go back, I'll make sure I can go back.
  　　　You can always go back if you want to.
  　　　(Personally, I don't recall ever being "it was a mistake to make a new one, let's go back to the old one," but the peace of mind of being able to go back is useful.)
 About [human.icon]Emotions
	　It all feels so close because it's taken out of me.
	　It seems like one big blurry lump.
　[nishio.icon]I'm sure that's not enough.
　　Adding a new label to it separates what is near and far in that mass.
　　　[large blurry mass pulled apart by the line].
　　What we can't isolate is that we don't have enough information yet.
　　First, more information
　　　The separation proceeds based on the relationship between the information provided.
　　Supplemental:.
　　　I failed to mention it that day, but "it seems like one big blurry mass" is a better state than "it's a disjointed mass and I can't see the relationship".
　　　Changes from Beginning KJ Method to Thinking Fireworks
　　　Before creating a group, first create a net-like structure, or "net building.
　　　This change was made because it is more important to lump them together first.
 [human.icon]What is that "more information"?
 　More sticky notes?
 　Clear up the questions you are asking yourself?
 　Depends on the occasion?
 I think [nishio.icon] "Clear the question" is an unspecific action.
 　Unclear how to do that.
 　[- can't aim]
 　　Sidenote: You can aim for it.
 　　　Uncertain tasks] where you don't see the means to say, "If you do this, you can accomplish that."
 　　　For example, "I don't think this question is appropriate, what question should I change it to?" the answer may or may not come out, uncertainty
 　Adding stickies is a distinct task
 　　Look at the sticky notes as they are placed and add any associations you have.
  　If you can't think of anything to add, "I have nothing to add at this time."
  　You could keep it close and do another job.
  　　After a week or so, you can look at it again and say, "Oh, by the way, I'm in the middle of this.
  　　And then, "Oh, isn't this how it's done?" and come up with something new.
  　　Sometimes, unexpected connections can be made between what you think about in other jobs that you think are completely unrelated.
　　Like this, we're going to add a little bit at a time.
　　　We're "[writing] it down, making it indelible," so it can grow over time.
　　　If you only think about it in your brain, you work another job for a week and it's gone.
　　　The more you add, the more "organization tips" you get.
　　It is impossible to "make a good cut" when you do not have enough information to make a cut, because you do not know what is a good cut.
　　　After you find a good cut, you know, "Oh, this is a good cut. You don't know in advance.
　　　We can only simply increase our numbers, splicing, storing, and growing.
　　　If you feel that it is not in good shape, you can re-knead it with a new map.
　　　　simulation of kneading clay
　　　　By making a shape, and then looking at it, I think, "This isn't right." Through this process, the idea of "good shape" is gradually being refined.
　When you look back on it after a week, a month, a year, you'll notice things.


Question 7: What is the
 [human.icon]Was it the post-integration ideas part that you did this time?
　Is [nishio.icon]Integration and thinking a separate phase? I don't feel comfortable
 I think the [human.icon] "Beginning KJ method" is "too much -> compression -> ideas". Which phase of the [W-type problem-solving model] do fireworks to think about fit into?
 　Are you going to start with this approach out of the blue?
 　　Seems like a good fit for the problem raising phase.
 　　When I want to explore something like this, I make field observations, get too much information, and then compress it to create ideas and inferences.
 　　I'm under the impression that what we were doing today is somewhere between compression and inference.
	Tip: Since we are not discussing the W-type problem-solving model this time, I've included a diagram for the benefit of other participants.
		[https://gyazo.com/390334994715674be46fc76dfc2c7989]
　[https://gyazo.com/0b28933fe504868a5029ec7704051b06]
　　[Let the chaos speak for itself] p.33
	[nishio.icon]I see.
	　Jiro Kawakita in the early days certainly said this is the KJ method here.
			[https://gyazo.com/f997acc118bf60ef2d4dadd887d50917]
	　But in his later thinking about fireworks, he says, "We can use them in each phase," and "We need to be aware of where we are using them in each phase."
	　in other words
 	　Early on, they focused only on the C to D phase.
 　He thought the process of compression would generate ideas.
  　I guess that's what happened in the [Jiro Kawakita.icon] use case.
  　[Jiro Kawakita.icon] generalized it and created the W-type problem-solving model
 	　I've come to believe that ideas can be generated in any phase in the later stages of the project.
	  	In the process of teaching 20 years to people who don't do that much fieldwork or anything like that.
	  		You're not surprising that those people's use cases don't meet the assumptions you've implicitly made.
	  		There's a big gap between your premise and the situation of most people in the world.
	  		And [Jiro Kawakita.icon] came to realize
		Supplemental:.
		　initial
 　We thought the process of integration would generate ideas.
				1967 Conceptualization
  	　　>Information gathered in this way is put together in some form (C→D). During this process, many hypotheses are discovered. (p.23)
     > ... Information is not just a list of pieces of information, it must be assembled. It must be assembled into something that has some kind of structure. The KJ method, which I will discuss later, is used to find integration in this assembly. This is structure building. (p.61)
					[https://gyazo.com/f997acc118bf60ef2d4dadd887d50917]
 　　In the mid-term, they're saying, "We're not doing the KJ method (C to D) part, which is a narrower meaning, but we're not doing the interview part in the foreground.
				1977 Exploratory Studies in "Knowledge
					> Despite the superficial popularity of the KJ method, it still doesn't seem to be used in a serious way... One of the most important reasons seems to be the following.
					>If we assume that the KJ method in the narrow sense is the part [C→D], no matter how well we overcome only this part, if the preceding part [A→B→C] is not done well, the KJ method will not be utilized.... If the quality of the original label data, which is the material for the KJ-method, is poor, the result will be irredeemable. (p.28)
					In other words, he's saying there's a problem with the preceding [A -> B -> C] part.
    　[https://gyazo.com/e9bc618b517bd6762a62d8f0da7647a2]
     　　To solve this problem, "Exploratory Studies of Knowledge" introduces a number of methods, including "exploratory nets"
     　This "exploratory net" developed significantly through 1986.
			In explaining the fireworks of thinking in the later phase of "Let the chaos speak for itself," he says, "It's good to be clear about what you want to think about and what phase that is."
				>Once a thought proposition has been established, the work continues to determine where it fits in the process of the W-type problem-solving model. For example, if the thought proposition is "Determine the cause of ..... is the C to D position of the W-type problem-solving model. If the thought proposition is "develop a strategy for ......," then the position is D to E. If the thought proposition is "develop a strategy for ......," then the position is D to E. If you want to "List the problems of ...... is to "list the problems of ," then position point A, and so on. (p.309)
 [If you create your own technique, if you don't have a use for it, it will flow unused.
	　What is the best time to use this one?
	[nishio.icon]This time, I had the labels written first for the convenience of the study group design, but originally it was done from scratch with zero labels.
	When you don't have the data yet and you have something to think about, do an internal exploration inside yourself to find the structure.
  As you do this, the "idea" that was fuzzy at first gradually takes on a clearer and clearer form.
   I thought to myself, "I've been thinking about this?"
   'Did I not like this, or did I really want to do this?'
   'I'll have to go back and get this data before I can draw any conclusions.'
 That's what thinking fireworks are for.
 　Spreading out in all directions from the theme placed in the center, hence "Fireworks".
 　Having the labels written ahead of time for the convenience of the study group may have caused some confusion.
	I feel [human.icon]gutted.
 [nishio.icon] When we say "do the KJ method," we tend to imagine starting with a large amount of data
 　The beginning KJ method was this.
 　But that's not all.
 　　There's a technique called "do it from zero data."
 　　　[Jiro Kawakita.icon] was created in an attempt to "make it easier to understand and more practical" by the man himself.
 　By looking at the KJ method from these two directions, we can gain a more multifaceted understanding.
 　Supplemental:.
 　 Here, the "KJ method of beginnings" and "thinking fireworks" are described as if they were neat opposites.
 　 But to be precise, [Jiro Kawakita.icon] is not neatly organized.
 　 There are "exploratory nets," as [Jiro Kawakita.icon] called the "practical application of the KJ method," that "spread from the center" and those that do not.
 　 He passed away before I could get my system straightened out, so I have no choice now.
 　 That's why we need to create a new system with reference to it.

Question 8: What is the
	[human.icon]How often do you see Dr. Nishio's fireworks?
	[nishio.icon]Not so much.
		I'm not the bean-counting type, so I don't do it consistently.
		　(Supplement: [Jiro Kawakita.icon] says that writing a daily report with fireworks is very good, but I don't do that kind of thing.)
  I'll do it when I think it's necessary.
  　I'm sure those of you in loftwork who are often required to do so in the course of your work will do so more often.
	[human.icon]What other times do you use it besides writing books?
　[nishio.icon]This lecture material, I did fireworks thinking on the Miro, partly to get used to the Miro.
　That's a real intellectual production process, and the realizations that came out of those fireworks are actually in the lecture material.
　Use it in situations where you're not getting what you want out of yourself.
　　I'm sure there are lots of situations like that.
	　It's not like, "How many times a week do we do this?" but when it occurs, we say, "Oh, let's use that method."
　If you don't have a solution, you don't go through with it.
　　I'd say, "I've got to think about it," and then I'd think absentmindedly.
　If you have a hammer, you can hit the nail when you see it coming out.
 　Natural way "Thinking Dimly" solves the problem to some extent.
 　　You can't observe much of the thinking process of the people around you, so you misinterpret them as doing it the same way you do.
 　　But in reality, there are tools and methodologies for thinking, which can be used to solve problems efficiently and with good quality.

Question 9: What is the
	[human.icon]My head is very tired.
	[nishio.icon]Me too.
		Muscle training in a sense
			Loads will train your brain and make you stronger.
			You'll be smarter in the future.
	[human.icon]Feeling like after a good workout
	[human.icon]2: You're excited, you're elated.

Questions on Slack
Question 10: What is the
	[human.icon]In thinking,
 		When you are thinking using the popular way of thinking: you get the feeling of being constricted by something (limitation/constraint).
   When I am thinking naturally (in my own way), I feel like I am having fun thinking so that I can feel the dopamine being released.
		Second, is "having fun, indulging my habits of thinking, and thinking" supposed to lead to the discovery of my own way of thinking?
	[nishio.icon]
		I think you've already acquired "my way" and are comfortable with it and enjoy using it in your hands.
			First of all, that's great.
  On the other hand, "continuing to use familiar methods" does not yield "new methods." [a trade-off between use and exploration].
  Now with hammer in hand.
  	That hammer fits my hand very well and is great!
  	Much better than someone without a hammer.
  	But there is the trap of "[everything looks like a nail to the person with the hammer]."
  	You might even hit something with a hammer that you shouldn't hit with a hammer.
  Therefore,
  	For example, when you are busy, it is good to use more and more of the methods you are used to using.
  	Whenever I have free time or spare time, I will "explore new methods" with a balance of trying new methods when I feel like it.
  		Doing so would be more profitable in the long run than not exploring.
	[human.icon]The sense of thinking while collecting data. I got it!
		I mean, I feel like I am usually talking to others in real time with that sense,
		There is a fear that if you speak that way, you will be identified as someone who is not thinking straight.
			Especially online mtg with clients, etc.
		Is this fear normal? LOL!
	[nishio.icon]It seems difficult to think deeply in real time.
　　Getting out what you already have" is easy and fast.
　　Creating something new" takes time.
		[Jiro Kawakita.icon] believes that "if we are biased toward easy and speedy methods, we will not be able to create new things." image
		In MTG with clients:.
			Is it really necessary to "create something new on the spot?"
			Maybe it would be better to "scrape together the information that seems necessary" on the spot, and then respond later via email or some other asynchronous tool?
		In fact, the quality of what I responded to during the question and answer period of this study session via synchronous voice communication was not high
		　I'm doing the "grab what looks like it out of what's already in me and pull it out in a big hurry."
		　It's possible that the quality of the answers is higher for the ones that are answered asynchronously in the chat later.
　　　Supplemental:.
　　　　Don't procrastinate by being a synchronous communicator and produce a tentative output at this moment.
　　　　　This is worth more than "procrastination results in forgetting."
　　　　　Quality is low compared to "thoughtful responses."
　　　　　It's a good practice to give a tentative output and then improve it.
　　　　This activity can be interpreted as providing [immediacy] and [personalization] value
　　　　　Related [better than free].
	[human.icon]What other ways of thinking are you able to organize your thoughts (and appear to others to be able to do so) when you are thinking and speaking in real time?
	[nishio.icon]
		>Thinking and speaking in real time
			There is shallow and deep in this "thinking".
			I personally don't think I'm capable of speaking while deep in thought.
				I can't do it even while listening to you.
				I'm hindered only by people soliciting religion at the seat next to me in the café.
			Shallow thinking is just a hop or so out of what you've already read and thought about and stored in your brain.
				So, it's simply a "pre-accumulated quantity" game.
				Ah, yes, it is easy to create a "network of knowledge that connects the major ones" when using KJ legal methods for books
					(compared to simply reading books head to head).
					So it will be easier to pull them out in real time.

Question 11: What is the
	[human.icon]I felt that there is a sense of "adventure" = "taking risks" that can be seen by daring to go for it.
		I thought in retrospect that I had created a net with rather moderate language this time around because of the publicity, but do you have any tips for spontaneous adventures?
	[nishio.icon]I still think it is essential to do it secretly, without showing it to others.
		If you hit a budding tree that hasn't yet grown well, it will die.
		So, I think of it as growing them in a "safe place" first until they are firm, and then letting them out.
		Tip: I completely forgot about the "Future Individual Work" slides that I was going to talk about at the head of the Q&A period after the work was done!
			[KJ Method Study Group @ Loftwork_Lecture Material v2#6385b9daaff09e00008a0431]
			Talk about needing to "do it in secret, not in public."

Question 12: What is the
	Can I use [human.icon] pictures?
	[nishio.icon]
		Jiro Kawakita himself sometimes expresses himself in his paintings.
  	[https://gyazo.com/857b3aba09b72b756a5313fa08ef2586]
  	　[KJ method: Let the chaos speak for itself. p.253
 		There's nothing at all that says, "It has to be written in letters."
 	When writing with markers on paper sticky notes at workshops and other events, some people start to come alive by adding a few words, "You may draw a picture!
 		I think we should actively remove the assumption that we have to write in letters.
 	There must be various means that did not exist in Jiro Kawakita's time, such as taking and pasting photos with a smartphone, or drawing with an iPad + ApplePencil.
 		I think you should use whatever is available.
		Jiro Kawakita himself rather says, "Put the picture in."
			Maybe many facilitators skip that step because many people feel psychological resistance when you tell them to "put in a picture" because they don't have the artistic ability.
				>After the illustration is complete, a "symbol mark" is added to the illustration at the end. Symbols are usually included only for major islands. (p.137)
    	This is the procedure described in the chapter "One Round of Narrow KJ Method"
    >A symbol mark is as seen in the illustration in Figure 23. (p.137)
    	[https://gyazo.com/fd15dfb827e65ad5dcf65168673a127d]p.138
    	>In other words, if one wants to understand what an island as a whole is appealing to, it is sufficient to read and understand the nameplate, which is already written on the island, in order to understand it logically and precisely. The nameplate is thus good for precise understanding. But instead, it is often a roundabout way to get around, because it uses human intellect as a passageway. Therefore, it is more helpful to write something symbolic on the island that appeals to the visual, sensory, and intuitive understanding of the content of the island, and to use it in combination with a method that appeals to the instantaneous understanding of the content of the island. (p.137)
    >Symbols often use words such as verbs, adjectives, and nouns. Sometimes they are phrases, clauses, or short sentences. In any case, however, they must be extremely short. If it is long, the symbolic effect of instantaneous and coherent meaning is diminished.
    >But sometimes a symbol mark is not a word, but a picture or a symbol. In addition, the shape of the island itself may be depicted in a drawing to give a sense of meaning to the symbolic image. When the islands themselves are pictured, sometimes even the entire contents of the illustration are expressed in a single picture. (p.137)
     >(p.166)When the essence of a thing is highly boiled down in a Type A diagram, there is a way to convert its essence into a separate pictorial or simplified diagram, without regard to the original diagram.... However, this is not always successful.
     >In this way, an oral presentation of an extremely simplified yet meaningful picture or illustration can be delivered in a very short period of time, with a great deal of implication and with a strong emotional impact.
　　　　　[https://gyazo.com/0c5beb323890a515de88c11854f289ff]p.165
　　　　　This is once a normal diagramming process and then it is "cleaned up in picture form".
    >The meaning of a symbol mark and its utility are of great importance. I will discuss this later. Because of the importance of a symbol mark, it is difficult to create a symbol mark unless it perfectly and precisely expresses the meaning that the island as a whole is emotionally appealing to. Therefore, although it is easy in terms of time and amount of work, it is necessary to devise a symbol mark with all one's wisdom and ingenuity.
    >When the symbols are properly placed, the meaning of the entire illustration is more well-crafted and quickly understood, both by its creator and by the audience of his explanation. Therefore, in some cases, it is better to draw the symbol mark immediately after the completion of the island drawing, and then add the relational lines. In fact, in many cases, it is more natural to draw the symbol mark from the island drawing to the symbol line than to draw the island drawing to the relationship line to the symbol mark. (p.173)
  It should be noted that it is not always possible to create such a beautiful picture.
  	Jiro Kawakita also says, "We don't always succeed."
  	It is not "a random piece" that goes into these cases, but "the best looking or most convenient one"!
		  For example, if Jiro Kawakita had a marital quarrel or was worried about his children's education policy, he would have used thinking fireworks to organize his thoughts, but such illustrations of muddy problems cannot be included in a book, can they?
