The process by which the KJ method was created
[Idea method] p.52-53
>... I tried to solve the classification problem in a crooked and practical way, and as a result, I ran into unexpected difficulties.
> That is, no matter how neatly we tried to classify the materials, the result was that the materials did not automatically fit together well.
>Originally, classification was based on the concept of "homogeneity," which means that materials in the same category share some common characteristics. (p.52)
	To gather in one place things that have certain common properties is [classification].
	Classification makes [summary] and [analysis] easier.
	But...

>In some cases, it is not sufficient to "[summarize]" merely to summarize and analyze a homogeneous set of data.
> What is it? In other words, it is the process of collecting materials that are completely different in nature and cannot be compared, and "putting them together" in the sense of what meaning can be found in the combination of these materials.
> Or, it is about what is discovered from [the combination of heterogeneous data].
> For "summary" in this sense, the procedure of classification alone is far from sufficient in the first place. (p.53)
	In other words, grouping with a focus on "homogeneity" does not "[unite]".
	There are cases where it is necessary to [discover] new associations from combinations of heterogeneous data
	[Combining heterogeneous data]=combination of items that are not in the same group

[** How to integrate heterogeneous data].
>Data Integration Methods
> The new technology needed here was "[a] method of integrating heterogeneous data. (p.53)

>That much I figured out by stumbling upon it, but then I had to figure out how exactly to do it. As I was twisting through the field materials, I realized that there was a certain way of doing things. I don't know why, but I began to understand by experience that if I did it this way, it would come together better than before. Such a way of doing things was very vague at first. However, as I gradually refined it, I came to realize that it could be made into a systematic method. The following method of thinking was born out of this need. I had an interesting experience here. This idea was born before its implementation. The logic of why it would work if it were carried out that way was only a reflection of what came later. (p.54)
	In other words, after trial and error of various methods, I found a method that was easy for me to do.
	The "method" was vague at first, but gradually organized into a system.
	How to do it" and "Why it works" are afterthoughts.

>How can we "bring together" the chaos and heterogeneity of data in the field sciences? The final bottleneck is thus how to integrate the data. And that leads to the method of conception. (p.55)
　Bringing together heterogeneous data
　The way data is [integrated] is important.
　That leads to "[the] idea method."

>... Information is not just listed, it must be assembled. It must be assembled into something that has some kind of structure. The KJ method, which I will discuss later, is used to find integration in this assembly. This is structure building. (p.61)
　Assemble information into something with structure.
　The [KJ method] and [structure building] are used to find [integration] in the assembly.

Another expression of this "information must be assembled, not just enumerated" on [Engineer's Guide to Intellectual Production].
>If you just do a lot of information gathering, the boxes just line up flat and don't stack up (p. 3).
> [https://gyazo.com/40bb5c7183431ffabd19ee3b907dbb7b]
> The boxes piled up on top are not limited to those collected. We often create new boxes by looking at and thinking about the boxes we have collected. Creating these new boxes, or abstract knowledge, is "[modeling]. (p.4)
> [https://gyazo.com/7cecbddf9318a0c723b91b779929f5d3]
　[thinking and piling]

OLD TITLE: Failure before the KJ method was created
