Beyond the KJ Method
2022-12-13 Yasukazu Nishio
Cybozu Labs Year-end Presentation

We recently held a KJ method study session at Loftwork.
　Held remotely via Zoom+Slack+Miro
　A little more than 40 people editing at the same time in a common place, interesting.
　[https://gyazo.com/f91524b7db379139f4fde95214b49207]
　I distributed lecture materials for one hour in advance and gave a 30-minute lecture, which I will talk about in the next 4 minutes. For more information, click here: [KJ Method Study Group @ Loftwork].

KJ method made by Jiro Kawakita [Jiro Kawakita.icon
　A lot has changed in 20 years.
　　First semester 1967 "Idea method"
　　Mid 1977 "Exploratory Studies of Knowledge"
　　Late 1988 "KJ Method: Let Chaos Speak for Itself"
 The "idea method" is the most well-known, but it is the earliest and earliest concept.
 Applied to diverse purposes in the decade since the "Ideation Act."
 　The concept of the term "KJ method" has been broadened.
　Points that received a strong response from participants
　　Have you ever experienced an activity where a large group of people write things down on sticky notes and then a large group of people put them together?
　　Many people recognize this as the "KJ method."
　　However, [Jiro Kawakita.icon] himself says, "If you do it alone first and your ability is not mature enough, undesirable compromises will occur.

What is an "undesirable compromise?"
　Let's say seniors and juniors are working in pairs.
　[https://gyazo.com/e249b88f436ff3bf9d15d99579239ae5]
　A senior said, "This is a circle."
　　At this point, can the junior say, "From my point of view, it looks square?"
　(Is it round? I think it's square... but if senpai says it's round, is that right... I don't know what's right...) just so you know.
　　This is the [* undesirable compromise].
　A cylinder is neither round nor square. A cylinder is neither round nor square.

Feedback from participants
	[human.icon] A sense of thinking about what is being said in the areas of "[psychological safety]" and "[organizational diversity]" from a different perspective again.
	That's exactly right!
	 >Not cause undesirable compromises
	 	Team members need to talk about their "different ways of seeing"
	 	Need an environment where there is no hesitation in doing so.
	 	= Psychological safety environment
	 >To improve the quality of "judgments", we should try to connect information from a number of different perspectives with consistency.
	 　Gathering "information from different perspectives" is easier when you have a diverse group of people with different points of view.

The Age of Pluralistic Organizations
　A [pluralistic] organization with many axes of [values].
　The KJ method approach is a clue to a new form of [teamwork].
　On the other hand, the specific methods of the KJ method are old
　　Books from 1967 and 1988 only show how to do it before computers and smartphones became popular.
　　No [groupware], of course.
　　What we did this time: Workshops with remote people in real time using Miro!
　　 That way is not written anywhere in [Jiro Kawakita.icon]'s book.
　What we need now
　　While rediscovering the concept of the KJ method
　　Update the KJ method with modern tools
　The subject of the update is
  It's not Jiro Kawakita.
  We who live in the present have to do it.
 How to do it.
　 We should each create our own style and exchange information.
　　because
   We live in an era of diverse work styles and values.
   It doesn't work for any one person to say, "This is the right way to do it.
   Each individual needs to find a way to fit in.

summary
　[Tradition is the preservation of fire, not the worship of ashes] --- Gustav Mahler
　What we need now
　　While rediscovering the concept of the KJ method
　　Update the KJ method with modern tools
　　Individuals will find the way that fits them best.
