What new technology will allow us to do.
from [/villagepump/2022/12/03]
[/villagepump/nishio.icon]
 I don't know what the future holds, but I'm sure the way things were done 10 years ago and the way things will be done 10 years from now will be very different.
 	Can you compare the atmosphere 10 years ago and now? [/villagepump/inajob.icon].
 		2012.
 It is sterile to put AI and humans on a one-dimensional axis and argue, "We've overtaken them!" No, we're not there yet.
 　It's like having an assistant with different strengths and weaknesses by your side 24 hours a day.
 Just yesterday, he gave a lecture on the KJ method, an intellectual production technique, and said, "Things have changed since Jiro Kawakita created the KJ method in 1967, so the optimal method has changed as well.
 　The example at this time is the advent of PCs and smartphones
 　　Then I used [Miro] to do a variant of the KJ method called "[Thinking Fireworks]," which is difficult to do with a post-it and a pen.
 　　Actual examples of [methods change with changing circumstances
 　When I got back, I touched [ChatGPT].
 　　It is impossible that in the world after its birth, this will not affect the way of intellectual production.
 　　How it will change, we don't know yet.
 [https://gyazo.com/c28134616c53772acf2687b5c3ff639f]
 	1: What flesh and blood once did.
 	2: What AI has enabled us to do
　It is futile to put AI and humans on a one-dimensional axis and argue, "We've overtaken them!" No, we're not there yet.
 	　　It's like having an assistant with different strengths and weaknesses by your side 24 hours a day.
 	3: Waved letters for mention in the area
 	　Focusing on A and saying "AI is not ready for A yet" is sterile.
 	　　Bullet trains still can't change diapers, but that doesn't make them any less valuable.
 	　The B area will be better done by AI than by humans in the future.
 	　　>Because you are not writing by yourself, you may not be able to construct sentences logically or compose them in English by yourself.
 	　　　People's ability to do B is waning.
 	　　　On the other hand, the "need for humans to do B" is also decreasing.
 	　The C area is not yet visible.
 	　　Because people in the past couldn't do it.
 	　　From an area close to B, "Maybe you can do something like this?" and then someone with an abundance of imagination tries it out and says, "I've done it! and then it gradually spreads.
 　4: As C expands, we gradually see D, "what has not yet been done" and "what could be done".
 　　The division of labor between humans and AI to do what each is good at, or a mechanism to combine the division of labor.
 　　Only those who have advanced to the C area will be able to see this "technically solvable but not yet solved problem"
