KJ method and dialectical development
[Let the chaos speak for itself.]
　Chapter 8: Exploratory Net Revisited: Putting the KJ Method into Practice
　　5 The world suggested by ExploreNet
　　　5-4 Principles of Thinking Fireworks and its Philosophy
　　　　(3) Technologizing the [Dialectic of Conflict] p.337
　Chapter 11: The KJ Method as a Thought
　　3 [Three Articles of Creative Action] and Overcoming [Conflict] p. 443

Jiro Kawakita's story about how he tried to construct "what points are creative and what points are not creative" by arranging the work he has done.
 Three Articles of Creative Conduct
 　1: [spontaneity].
 　　The more you do something on your own initiative, the more creative you are
 　　The act of being told to do something and then doing it reluctantly is hardly creative.
 　2: [Lack of model].
 　　Creative without example
 　　It's uncreative to have an example that says, "You could do it this way."
 　3: [incisiveness].
 　　The more you are desperate for something to be done well, the more creative you are.
 　　Not very creative if you don't care what the outcome is.
　rebuttal
　　The more urgent the task that needs to be done well, the more you have to do it, whether you have the initiative or not.
　　The more work you do without a role model, the greater the risk of failure, so you shy away and lose your initiative."
　　Jiro Kawakita could not respond immediately to this point of view and thought about it overnight.
　Conclusion.
　>"Indeed. Indeed, these three articles of creativity must be mutually contradictory as long as we sit and wait. But to take all three articles and resolve the contradiction in a practical act is what we call a creative act. Why should we call an act creative if there is no contradiction in it from the beginning?
　	[https://gyazo.com/0a30c98a8179daa0c53b4f79915093d0][https://gyazo.com/5de6435f5dc537d8a40d33ee5a73767c]
　[nishio.icon]
　 I think this is too abstract to understand.
　 　I feel what you are saying is right, but I don't think it's clearly explained.
　 　I think it's [conceptualized] too much.
　 　You need to be more specific.
　　The more work you do without a role model, the greater the risk of failure, so you shy away and lose your initiative."
　　　This is not True.
　　　People shy away from jobs that don't have a role model.
　　　On the other hand, some people are thrilled to be told they are free to do what they want.
　　　The questioner is the former type and just assumes that others feel the same way.
　　The more urgent the task that needs to be done well, the more you have to do it, whether you have the initiative or not.
　　　This says, "If the earnestness is high, it will be carried out even if the spontaneity is low."
　　　It doesn't refute the statement that "high spontaneity is important for being creative."
　　　The "highly motivated, highly motivated" case is more creative than the "highly motivated, low motivation" case.
　　　I think this is a concept related to [making it personal] and [overwhelming sense of ownership].
　　　　The difference between thinking, "If it doesn't work, the company will be in trouble," and thinking, "If it doesn't work, I won't like it."

[KJ method] and [dialectical development]
KJ method and [dialectical] development

