Examples of Group Formation Failures
[発想法] p.78-80
>I had a hands-on training session on the KJ method at a place. Participants were divided into three teams of seven or eight people each. All three teams had the same set of paper materials.
>The material was a group of pieces of paper that had been prepared in accordance with the KJ method's recording phase, based on issues discussed by various lecturers on market research issues at several seminars over the past year. The pieces of paper were numbered in the order in which the lecturers spoke. Therefore, if they were arranged in that order, a set of the papers could be used as a kind of minutes.
　An approach that attempts to integrate stories created by different people on related topics
　It's interesting in a [syntopic reading] kind of way.
　A kind of [merging multiple stories written by different people

>The three teams were given these pieces of paper, and each team was to spread them out on a table in a small room and practice group formation. At that time, in spite of the warning given to the teams in advance, a very unusual scene took place.
	>When I looked into the first team's room, I saw that they had spread out pieces of paper like a karuta-tori game, with only one person organizing the group and the rest serving as onlooker-like advisors. This was not a bad place to be.
　　This is "not so good," which means the other two are not much better.

	>When I looked into the second team's room, to my surprise, I found that they had just received the bundles of paper in the same order as they had been received and had piled them up in order of their numbers. How did such a scene come about? It was because of a kind of fear. If the pieces of paper were to be spread out in a neat row, it would be impossible to keep them in order. When I said, "No, you can't do that," and spread the pieces of paper apart, they all looked at me with sad faces.
　　I've been afraid to break [the existing structure].
　　This time, the data was originally a "chronological record of what multiple lecturers had talked about", a "time-based structure", and this team got caught up in that structure.
　　Jiro Kawakita is taking the strong step of dismembering them.
　　If it were me, I would have said, "Let's just spread them out and look for things that you think are related to what the different instructors have talked about. If you find one, pair them up and put them side by side.
　　　It's a kind of [note the line that straddles the group boundary].

	>When I entered the third team's room, I saw a different kind of strange scene. One of the smartest people in the room suggested, "Since these materials are all related to management, let's put them in this and that category of classification. Several others agreed, and a classification scheme was decided in advance. And accordingly, they were in the process of handing out the scraps of paper. As I have already mentioned, this is a problem of dogmatism that men, especially intellectuals, are prone to. So, I also broke up the group of papers in this room.
　　Jiro Kawakita can see that he is in trouble after the distribution work is done because he decides on the frame first and distributes according to that frame.
　　I don't think the participants know what to do if they're torn apart because they don't know what's ahead of them.
　　Would have been nice to be able to stop it once the frame was set...
　　If I were to intervene in this situation, I would do something like this
　　　Prepare a "place to put a piece of paper that you feel doesn't fit easily into that framework.
　　　　[parking lot] kind of thing.
　　　　It's like forcing them to stay out of the frame by creating a "place for [the ape away from home]."
　　　Recommend finding a connection between that "something that doesn't fit into the existing framework".

>As in this case, there are many people who think they know what they are doing in theory, but when it comes time to do it, they go down the wrong path. We have developed such a bad habit that we are so preoccupied with dogmatic categorization that we refuse to listen to the facts and what the information has to say.
　So this "bad practice" is still going on half a century later.
