The value of my being to myself is higher than anything else I can think of.
The value of my being [to me] is higher than everything else.
	Because once you are gone, the "value to you" of everything becomes zero.

Value to society" is an ambiguous concept.
　Because there is no one called "society" ([false anthropomorphism]).

If we assume a specific stranger A, "value to A" becomes a meaningful concept.
　This "value to Mr. A" is not equal to "value to me". [because] "I and others are different.



from [/villagepump/imposter-syndrome].
 When you accomplish something, when you look back on it, it consists of [a series of things that anyone could do] and you feel like it's not a big deal[/villagepump/yosider.icon].
 When you look back after it's done, you can see the path, but before it's done, you can't see the path -[/villagepump/nishio.icon].
 I associate this with this, but I think I'm rather like, "[Here's a list of things I've done as observational facts. Whether you rate it high or low is your business, not mine]" kind of thing.
 Not [self-evaluate] in the first place? Is it[/villagepump/yosider.icon]?
 I see, you don't [self-evaluate]? [/villagepump/nishio.icon]
  No, I felt like [my self-esteem was] canned.
  Like, "[I am] naturally more valuable to me than everything else, because without me, everything else's 'value to me' would be zero"?
  And [others' evaluations do not match self-evaluations], but that's to be expected.
  　Because [you and others are] different.
  And maybe you don't see "[others' evaluation]" as a lump concept.
  　Different things for different people.
  　"Rating by Mr. A." "Rating by Mr. B."
  　They're two different things, so there's nothing wrong with them being at odds with each other.
  　This is the one I saw mentioned below.
  　 >"I take it as it is, "I wonder if this person evaluates himself that way.
  I remember [/yosider/self-affirmation-is-unconditional][/villagepump/yosider.icon].
  [/unnamedcamp/self-affirmation-and-confidence].


　In my case, I think I was able to break out of it by being somewhat able to [/blu3mo-public/ weaken my own voice a bit and accept the voices of others honestly][/villagepump/blu3mo.icon].
  > [I will accept others' evaluations honestly] does not mean that I will make an effort to match them, but rather that I will accept them as they are, saying, "This person evaluates me in that way.
  > [* That [evaluation] is just that person's evaluation, and if you haven't gotten there, it's not your fault, and there is no logic anywhere that says you have to get there].
  > It was also difficult to understand how you could weaken your own voice a little, but it means to go in a different direction (trial and error). Your inner voice may say, for example, "I've received such an undeserved reputation! If I keep going in this direction, I will become a liar! I desperately need to close the gap!" You have to desperately close the gap!
  > [* "No, no, no, don't be so hasty. If you get crushed, there will be nothing to evaluate. Let's go steadily at our own pace."]
   Excerpted from https://twitter.com/hyuki/status/1280465374148870144

[Imposter Syndrome]
