Need glue allowance for cutout
from [/villagepump/cutout needs glue allowance].
[https://gyazo.com/6ac7c44886fb8381306e8175e7bd8ddb]
 B: [duplicate and cut out only the parts where the context is likely to be broken].
 	[May be duplicated]

[/villagepump/nishio.icon]
 The current Scrapbox cutout mechanism is style A
 But wouldn't it be better to have a [summary] of "[the flow leading up to the topic]" (blue) at the beginning of the new page?
 　Related: I've been thinking about [a better cutout] lately.
 Otherwise, when you look at a new page, you'll be perplexed because you won't know why we're talking about it.
 I thought that [one well was not enough time and attention].
 　It's a cutout of my own diary remarks.
 　The person who wrote it didn't know what he was talking about.
 　Two lines were added at the beginning of the article.
	Oh, good word, that's how you cut it out[/villagepump/inajob.icon].
　Is [from (link to the page from which the cutout was taken)] the default/minimum glue? [/villagepump/yosider.icon].
　　+1[/villagepump/nishio.icon]
　I'm also inclined to hope that the cut out page will contain a different point of view than the original context[/villagepump/yosider.icon].
　　Does knowing [the original context] not make it impossible to write it?
　　It's hard to develop new ones when you're too tied to the original context[/villagepump/nishio.icon].
　　 I guess the most bound state is "placed in its original context without cutting it out".
　　 and the default cutout minimizes context.
　　 　They feel this "destroys the context" and resist cutting it out.
　　 I think "Norishiro" is a way to get between the two.

[Cutting out the page breaks up the context of the statement].

Something interesting about the need for a "glue line" while doing a "cut-out"[/villagepump/issac.icon].
　Need glue allowance even though it's a cutout
 Like [preface] to quote... [/villagepump/yuyasurarin.icon].
  As it is[/villagepump/uyasurarin.icon].
I had an image like "[eliminating steps]" or "[removing burrs]" after cutting out[/villagepump/hatori.icon].
　If we follow this image, it would be more like installing "[slope]" or "[sanding]" rather than building a gluing area.
　I can't think of a particularly good way to put it, but...
