川喜田二郎の男女観
I have been looking at Jiro Kawakita's books from the 1960's and sometimes he writes about the difference between men and women, which is disconcerting to me in the 2020's. I think it's because I am not a 2020's person.
Jiro Kawakita says that "women are not good at abstraction. I don't think so. I think it's just that some people are not accustomed to abstraction as a part of their personality.
On the other hand, as an observed fact, it seems to me that the probability that those who do [excessive abstraction] are male is high. Why is that?

川喜田二郎の視点
発想法 p.71-72
>One-line headings that convey as much as possible the earthy flavor of the original statement are better. Often women make better recorders in this regard.
> Japanese women, in terms of this ability to compress and record, certainly lack more training in abstract contemplation than men. In other words, they are too caught up in the details and nuances of the speaker's statement, and are not good at focusing on the essence of the speaker's statement. Therefore, the female recorder suffers in this first step of the KJ method. Instead, she may produce excellent one-line headlines that retain a soft, earthy flavor without falling into the male pitfall of over-abstraction.
> This is a serious problem. More generally, men are generally better abstractors than women in Japanese society. What is worse, however, is that men tend to think in unnecessarily conceptual terms. This tendency seems to get worse the more intellectual the man is. With such a defect, there is a danger that a compressed one-line headline will become a symbol that is out of touch with the actual situation. The result is that subsequent procedures become fruitless. Women have a habit of adhering to parts of speech in a sensuous and continuous manner, and they feel pain in unitizing them into units of meaning, or compressing them into one-line headings while killing the details of the speech. What is important is to compress the details of a statement without killing its meaning or structure. It is necessary to respect the context.

p.77
>In practice, there are often people who try to move from large to small divisions. This is more common among men than women.

p.120
>Let me also touch on the mental pain and pleasure of those who implement the KJ method. First of all, the recorders at a meeting feel a considerable amount of mental pressure due to the anxiety of "will I be able to keep up with the speed of the discussion" or "will I be able to capture the main points in a compressed manner and express them in a one-line headline? This is especially true for women. However, if you take the plunge and make a backwater move, you will find that it is easier to give birth than to think.


My Point of View
>"Some people's personalities are unfamiliar with abstraction."
> Probability that people who abstract excessively are male is high.
　There is a gender cultural bias in "experience" that creates familiarity.
　For example.
　　Experience writing a message on a small piece of paper that is intended to be read by others
　　　If you write notes on a notepad for your own short term reading only, you tend to do the same thing with KJ method labels and tableplates, just words and so on.
　　　Sufficient contextual information for others to read
　　　　Consideration for the reader
　　　　A week from now, I'll be a stranger, and if I don't take it into consideration, I won't be able to read it to myself.
　　　On the other hand, paper is small and needs to be compacted.
　　　Related experience with one-point illustrations may also make a difference.
　　Experience observing one's own psyche
　　　You can tell if you are in a good state of KJ method by observing your own psyche
　　　Whether you recognize that your mental health is something that can get better or worse
　　 Women are more likely to feel that they and others close to them are affected by changes in hormonal balance and that their condition is subject to change.

My wife's point of view (my interpretation is included since I put it together)
　To begin with, the workshops at that time were mostly male, and Jiro Kawakita was there as an authority figure.
　　Acting like a male monkey in the presence of a strong boss monkey
　　Trying to show that you are a superior individual compared to the members around you
　　　I don't want people to think I'm stupid.
　　　Being cool without being aware of it
　　　[nishio.icon]I see, so that's why you're going to put on parentheses and make excessive abstractions.
　　　　川喜田二郎自身も
　　　　　They are less trained in the contemplation of abstraction than men."
　　　　　Men are generally better abstractors than women."
　　　　The way he writes, he has a sense of value that the higher the ability of abstraction, the better.
　　　　Maybe we should do a value inversion.
　　　　　Many men lack emotional sensing more than women."
　　　　　Women are generally better at sensing emotions than men."
　　Women, on the other hand, are already aware that they are considered stupid and are adapting to the situation
　　　I've given up on being thought of as an idiot.
　　　So the incentive to "make a cool expression" doesn't work.
　　　[nishio.icon]I'd hate to be the recorder of statements in that situation.
　　　　Male monkeys are playing parentheses and arguing with each other with empty abstract concepts that have no substance.
　　　　Properly summarized, it would be "there was no substance," but when you do that, you are accused of being too stupid to take the minutes.
　self-care
　　Monitor your condition and take care of yourself
　　　Showa men are less capable of this.
　　Because they thought "care is for women.
　　　Self-care was perceived as "something weak males who couldn't mate do" and "uncool".
 　　In the past, women were economically subordinate, so they were stable in that state.
 　　　Now it leads to mature divorce, etc.
