The Liberal-Communitarian Debate and Cancel Culture
from [/villagepump/liberal-communitarian-debate-and-cancel-culture]
[communitarian] criticism of [liberals] and [cancel culture].

I found [Tweet https://twitter.com/isawmydevil/status/1593699016289976320?s=20&t=9XtTsOBFwB5Ng520MK3dVA] interesting, but it's hard to understand because of 45 tweets with difficult contents. I had to rewrite it into bullet points because it was hard to understand[/villagepump/nishio.icon].
The Liberal-Communitarian Debate
	A controversy that flourished about 50 years ago.
 	Abstract discussion at the time
 	What was discussed in theoretical philosophy appeared in secular society about two generations (roughly 60 years) later.
	1971, John Rawls, "[A] Theory of Justice."
		Revolution of Theoretical Liberalism
		The book that created the theoretical framework for today's liberalism.
		Rawls.
		 "While [[utilitarianism]], which holds that "[justice is] the [greatest happiness of the greatest number]," functions as the dominant ethical philosophy in Anglo-Saxon society, are the negative aspects of utilitarianism having a fatal negative impact on the real world?"
		atomic bombing (bombing)
			One of the moral grounds is utilitarianism
			Secretary Stimson, who oversaw the Manhattan Project, believed that the bombing would save more American and Japanese lives.
			Maximum happiness for the "greatest number."
				This is the moral basis for the atomic bombings.
			Rawls thought this was a mistake.
		Rawls.
			utilitarianism makes the misfortune of the few perceived as morally right, and in fact causes them to act that way
			You say utilitarianism is the greatest happiness for the greatest number, but if you were on the side of the oppressed minority, you wouldn't agree that it is morally right, would you?
				Is utilitarianism such a "dumb" concept that it hinders the operation of the real world?
				That's not a universal righteousness, is it?
			Then a society in which people from any position or circumstance can agree with each other is the most just society that is not dubious, isn't it?
				→ [Veil of Ignorance].
				The rules that can be established by interchanging the positions and viewpoints of all people are the standards of correctness envisioned by today's liberalism.
					Hence, anti-racist.
 				There are not that many things that are socially right, only the minimum necessary to support a just society.
 					Anything beyond that is a matter of [diversity] rather than correctness, so let's be tolerant of each other.
	communitarian
		[communitarianism].
			[Individualism [sees] the individual as the starting point of society.]
			Communitarianism believes that the community is the starting point of society because it is the community that nurtures the individual.
		The "liberal-communitarian controversy" that was so popular in American political philosophy circles in the 1980s."
		The Liberal-Communitarian Debate Revisited (Shigeki Uno)."
   	Sandel counters by presenting the concept of the unencumbered self.
   	The human being in his primordial state, behind the "veil of ignorance" as Rawls calls it, is merely an abstract self stripped of its historical and social attributes.
   	However, can such an abstract self really make moral judgments?
   	Humans live in a historically and socially situated world.
   	Such a [human being detached from his/her situation] is, so to speak, a deprived self, which has no attachment to anything and cannot reflect on "what kind of being he/she is.
   	Thus, such an argument of Rawls cannot choose the good or constitute justice,
   	This is Sandel's conclusion.

  Cancel Culture
 		The human being in his primordial state, behind the veil of ignorance, is merely an abstract self stripped of historical and social attributes.
 			Asking someone to think in an anti-discriminatory manner means asking them to "strip away their historical and social attributes" and become a naked individual.
    	The Logic of Cancellation Culture
 				The occupation of a partner is nothing but the fruit of the historical and social attributes of the person and the community, including luck.
 					So, if we cancel (strip away) the profession and think of ourselves as naked individuals, we will be able to look at things in an anti-discriminatory way.
 	    For a discriminatory person to come to see things in an antidiscriminatory way requires that he or she be stripped of the historical and relational ties to the community that are internalized in him or her.
 	    In the process, the person positioned within the community is reduced to a "deprived self," a self to which one is not attached and does not want to be.
 	    	Sandel feared that liberals would do this to themselves, but he never expected it, and I personally summed it up by saying that the real world has reached a stage where liberal thinking has "done it to others," exceeding Sandel's expectations at the time.
  In fact, Rawls accepted some of the criticisms of Sandel and others, and about 20 years later, "political liberalism"
  	The modification is that "it was not a very good idea to think of the load on the self (history and social attributes in the community) as being stripped away.
    Rawls.
    	Originally a critique of utilitarianism
						There are situations where utilitarianism can work.
						can be fatally misleading at a morally critical juncture.
							Atomic bombing of Hiroshima, etc.
				Sandel et al.
					I understand that utilitarianism is dangerous, but isn't liberal thinking, as you call it, also theoretically at risk?"
   Rawls.
   	The veil of ignorance is only a thought experiment
   	Once you're veiled and once you're free of all attributes, you could be at a disadvantage, so you wouldn't be in favor of a rule that would particularly disadvantage one position over another, even if you think about it in terms of profit and loss, would you?"
			Sandel et al.
				No, no, no. Seriously, if you think about it that way, it's not good. The idea of stripping away your attributes once you think about it in a normal way is pretty dangerous."
				Gunnu. Indeed."
  	Main Claims
  		Tatsuo Inoue's point is succinct and is quoted verbatim
    	Rawls says, "In a liberal society, with its pluralistic division of religious and philosophical positions, such a principle of justice that can only be accepted if it relies on a contentious philosophical position is not good enough.
     So what would support that, Rolls says, is "overlapping sonsensus."
     From any philosophical or religious doctrine, we can share only the conclusion, though for different reasons. It's like "living on the same bed, dreaming on the same bed."
     That kind of thing is called "overlapping consensus.
	So far we have seen three political philosophies: utilitarianism, liberalism, and communitarianism.
  Utilitarianism, which justifies minority oppression, is criticized by liberalism,
  Liberalism, which calls for the cancellation of the real "life" of living in a community, is criticized by communitarianism,
 	And communitarianism, which has no principle for mediating conflicts between different communities, is criticized for utilitarianism.
 I personally feel that it is significant that Rawls, who started out as an idealistic liberalist, met "political realism" (realism) in his later years.



---- ver1

https://twitter.com/isawmydevil/status/1593729077118398464?s=46&t=R7DqEHIP5Tj4nh-BOW1N1A
　Interesting to hear about the thread's connection between the veil of ignorance and cancel culture.
　>[https://twitter.com/isawmydevil/status/1593702387465998336?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: In 1971, a Harvard political philosophy professor at Harvard University published a book. The title is "on the theory of justice". The book is said to be a revolution in theoretical liberalism, and it is no exaggeration to say that it laid the theoretical framework for liberalism as we know it today. (4/n)
		utilitarian criticism
 	>[https://twitter.com/isawmydevil/status/1593704716869206016?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: "[Justice is] the [greatest happiness of the greatest number]. utilitarianism]," which is "the happiness of the greatest number," functions as the dominant ethical philosophy in Anglo-Saxon society, Rolls was concerned that the negative aspects of utilitarianism were having a fatal negative impact on the real world. Rolls felt a sense of crisis.
 	>Surprisingly, the topic is also relevant to Japanese people, as he served in the Pacific War and fought against the Japanese in the Philippines. He also witnessed Hiroshima right after the [atomic] bombing.
  	>[https://twitter.com/isawmydevil/status/1593711369630941184?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: One of the moral bases for the atomic bombings is utilitarianism. In fact, Secretary Stimson, who oversaw the Manhattan Project, believed that more American and Japanese lives would be saved by the bombings. The greatest happiness for the greatest number. This is the moral basis for the atomic bombings. Rolls, however, saw this as a straightforward fallacy. (7/n)
  	>[https://twitter.com/isawmydevil/status/1593715921142833152?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: In fact, he wrote an article in 1995 titled "50 Year after Hiroshima" in 1995, in which he criticized the moral justification of the atomic bombings on utilitarian principles.
  >What is the essence of his critique of utilitarianism is that "utilitarianism makes the misfortune of the few perceived as morally right, and in fact causes them to act that way." (8/n)
  	>"Utilitarianism says the greatest happiness for the greatest number, but if you were on the side of the oppressed minority, you wouldn't agree that it is morally right, would you?" ... Is utilitarianism such a "dubious" concept that it would hinder the actual operation of society?　Isn't that not a universal right?　That's what Rawls was asking.
 	>[https://twitter.com/isawmydevil/status/1593725885466968065?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: So he thought, "Then, a society where people from any position or circumstance can agree with each other is the most just society, not a dubsta. I think a society where people from all walks of life and backgrounds can agree with each other is the most just society that isn't justified in its own way. He said, "[Ignorance] is a thing of the past. He devised a famous thought experiment called "[Veil of Ignorance]," which I will leave to the Netto article and others to explain. (11/n) https://t.co/ek3r7hmi8D
  	>[https://twitter.com/isawmydevil/status/1593727383143841792?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: not every person can be considered right! Not all things are right. Rawls said, "There is not that much that is socially right, only the minimum necessary to support a just society. Anything beyond that is a matter of [diversity] rather than rightness, so let's be tolerant of each other. (12/n)
  	>[https://twitter.com/isawmydevil/status/1593728359674318849?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: the rules that can be established by interchanging every person's position and point of view are is the standard of correctness envisioned by liberalism today. Hence, anti-discriminatory.
   > What is often misunderstood is that the thought process of "my opponent says A, but using that theory would make me right on the contrary, so I'll break the argument~" is not liberalism. (13/n) If an idiot and a moron were arguing, and you switched their positions, it would just be an argument between a moron and a moron. It is just a low-level bickering, not a universal argument. It is not a reversibility test, it is just mirroring (harassing). (14/n)
  >[https://twitter.com/isawmydevil/status/1593730291927257088?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: Now this is Rawls' philosophy of liberalism, but the ultimate The ultimate point is a critique of moral philosophy, which says that if we think like utilitarianism, a fatally problematic aspect of morality will emerge. With this in mind, let's move on.
  >How did liberalism, conceived with good intentions, become such a hated way of thinking? (15/n)
  	>[https://twitter.com/isawmydevil/status/1593730908074696704?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: one answer, and one that not a few people recognize is Probably the "[middle man problem]". Liberalism was originally a good thing, but the people in the middle didn't study the original liberalism properly or weren't very smart in the first place, so this is what happened. (16/n)
   >[https://twitter.com/isawmydevil/status/1593732163840937984?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: this also hits the nail on the head in no small part, but "no. It isn't. Even if the people in it were sane, the liberalism that Rawls refers to is fatally flawed as a moral concept" kind of thing, there were people who started taking it seriously. They are called communitarians. (17/n)
  communitarian
  	>[https://twitter.com/isawmydevil/status/1593732852109443072?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: That was the "liberal-communitarian debate" that was gaining steam in American political philosophy circles in the 1980s. It's the "liberal-communitarian debate" that was gaining momentum in American political philosophy circles in the 1980s. Here's a brief overview. (18/n)
   >[https://twitter.com/isawmydevil/status/1593733251352637440?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: communitarianism is Japanese for "communitarianism" Communitarianism is translated as "communitarianism" in Japanese. If individualism is to regard the individual as the starting point of society, communitarianism is to regard the community as the starting point of society because it is the community that nurtures the individual.
   >Well, how did such a communitarian criticize Rawls? (19/n)
   >[https://twitter.com/isawmydevil/status/1593736045111099392?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: how philosophical (abstract) this criticism was. To give you a sense, here is an original quote from an article. The Liberal-Communitarian Debate Revisited (Shigeki Uno). I feel that because it is abstract, it still resonates suggestively even now, 40 years later. (20/n)
   >[https://twitter.com/isawmydevil/status/1593736556472197120?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: "Sandel counters by presenting the concept of the "unloaded ego ( unencumbered self)," and counters by presenting the concept of the "unencumbered self". The human being in the primordial state, which is, as Rawls puts it, "veiled in ignorance," is merely an abstract self, stripped, so to speak, of its historical and social attributes. → (21/n)
   	>[https://twitter.com/isawmydevil/status/1593736835657650176?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: "But is the Can the abstract self really make moral judgments? Humans live in a historically and socially situated A human being detached from such a situation is, so to speak, a deprived self, and such a self has no attachment to anything → (22/n)
    >[https://twitter.com/isawmydevil/status/1593737220350889984?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: nor introspection about "what kind of being am I?" cannot be. Thus, Sandel's conclusion is that such an argument of Rawls cannot choose the good or constitute justice."
    >Yes, I have no idea what you are talking about. I didn't either until just a few years ago. (23/n)
    >[https://twitter.com/isawmydevil/status/1593738032502300673?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: what is Sandel so eager to criticize? I only became aware of the significance of this when I began to witness the cancellation culture of recent years. I have come to understand that their liberal criticism was a warning about the risks of the cancellation culture. (24/n)

		Cancel Culture
   >[https://twitter.com/isawmydevil/status/1593738497419988992?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: I think an explanation is in order here, and finally I tweet. I'll reconfirm what Uno said earlier.
    >"The human being in his primordial state, with the 'veil of ignorance' over him, is, so to speak, nothing more than an abstract self stripped of its historical and social attributes" (25/n). (25/n)
    >[https://twitter.com/isawmydevil/status/1593739299677122561?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: What this means is that [asking the other person to think in an anti-discriminatory To ask someone to think in an anti-discriminatory way is to ask them to "strip away their historical and social attributes" and become a naked individual.
    >Yes. This is the logic of the cancellation culture. (26/n)
    >[https://twitter.com/isawmydevil/status/1593740005003866112?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: The occupation of a partner is nothing more than the fruit of the historical and social attributes of that person and community, including luck. The occupation of a person is nothing but the fruit of the historical and social attributes of the person and the community, including luck. So, if we cancel (strip off) the occupation and think as a naked individual, we will be able to look at things in an anti-discriminatory way. (27/n)
    >[https://twitter.com/isawmydevil/status/1593741540597583872?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: for a racist person to come to see things in an anti-discriminatory way requires that the historical and relational ties to the community that have been internalized in him be stripped away once and for all. In the process, the person positioned within the community is reduced to a "deprived self," → (28/n)
    >[https://twitter.com/isawmydevil/status/1593742123425153024?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: "The self that is not attachable and does not want to be. I don't want to be. Sandel feared that this would be the case for the liberal himself, but no way, no how, beyond Sandel's expectations at the time -> (29/n)
    >[https://twitter.com/isawmydevil/status/1593743103755620352?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: I personally sum up that the real world has arrived at the stage where liberal thinking has reached the point where it "does it to others". I personally sum it up by saying that the real world has reached the stage where liberal thinking "does it to others".
    >In fact, Rawls accepted some of the criticisms of Sandel and others, and about 20 years later wrote another major book, "Political Liberalism. The modifications include → (30/n)
    >[https://twitter.com/isawmydevil/status/1593744020341415940?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: "It wasn't a very good idea to think of the load on the self (history and social attributes in the community ) stripped away was not a very good way to think about it".
    >Remember that Rawls originally started out with a critique of utilitarianism. (31/n)
    >[https://twitter.com/isawmydevil/status/1593744488542789632?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: His problematic view is that "there are situations where utilitarianism works But it can be fatally misleading in morally critical situations (e.g., the atomic bombing of Hiroshima). So let's rethink the idea itself." (32/n)
    >[https://twitter.com/isawmydevil/status/1593745165029548032?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: so he got a message from Sandel et al: "I know you say utilitarianism is dangerous. I understand that utilitarianism is dangerous, but isn't liberal thinking, as you call it, also theoretically at risk? (33/n): So I think he took seriously the criticism from Sandel and others that "I understand that utilitarianism is dangerous, but doesn't the liberal way of thinking, as you say, also have theoretical risks? (33/n)
    >[https://twitter.com/isawmydevil/status/1593746028595154945?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: from Rawls' point of view, the veil of ignorance is just a thought experiment. He said, "Once you're veiled and free of all attributes, you may be at a disadvantage, so you wouldn't be in favor of a rule that would particularly disadvantage one position over another, even if you think about it in terms of profit and loss, would you?" (34/n).
    >[https://twitter.com/isawmydevil/status/1593746503805173761?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: from Sandel et al: "No, no. Seriously, if you think about it that way, it's not good. The idea of ripping off your attributes once you think about it in a normal way is pretty dangerous in itself," and then they said, "Gunnu. I was like, "Gunnu, you're right. I understand that it was a kind of a bad thing to do. (35/n)
    >[https://twitter.com/isawmydevil/status/1593747268909166592?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: but that doesn't mean liberalism is defeated or out. I don't think it is. Three political philosophies have been mentioned so far: utilitarianism, liberalism, and communitarianism, but I guess the important thing (and most instructive) is that there is no "absolute strongest" in any philosophy. (36/n)
    >[https://twitter.com/isawmydevil/status/1593748421059686400?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: meritocracy that justifies oppression of minorities is criticized by liberalism,
    >Liberalism, which calls for the cancellation of the real "life" of living in a community, is criticized by communitarianism,
    >And communitarianism without principles for mediating conflicts between different communities is criticized for utilitarianism.
    >Such a relationship. (38/n)
 >[https://twitter.com/isawmydevil/status/1593749954664706048?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: I just introduced Rolls' late book, Political Realism. I mentioned that the main argument is this. Tatsuo Inoue's points in this regard are succinct, so I will quote them verbatim. (41/n)
 	>[https://twitter.com/isawmydevil/status/1593750461869219840?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: "Rawls says that in a liberal society, religious, philosophical positions are so pluralistic and divided that such a principle of justice that can only be accepted by relying on a contentious philosophical position is not good enough. → (42/n)
  >[https://twitter.com/isawmydevil/status/1593751006852321280?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: So what would support that, Rolls says? is "overlapping sonsensus". From any philosophical or religious doctrine, we can share different reasons, but only conclusions. It's like "sleeping on the same bed and dreaming on the same bed. Such is called 'overlapping consensus'." (43/n)
  >[https://twitter.com/isawmydevil/status/1593751577331789824?s=20&t=9XtTsOBFwB5Ng520MK3dVA @isawmydevil]: I personally feel that it is significant that Rawls, who started out with idealistic liberalism, met "political realism" (realism) in his later years. I personally feel that it is significant that Rolls, who started out as an idealistic liberalist, met "political realism" in his later years.
  >So my answer to why liberals are hated is now "because they contain such things theoretically in the first place". (44/n)
  

