Positive thinking and emotional objectification
[Positive thinking] and [emotional objectification]
　[internal structure] of [positive thinking].
　[Emotional objectification]
　　[Objectification of the mind].
　　　[Objectification]

from [/villagepump/Inside of a person rated positive].
 What kind of person is rated as positive? What characteristics do they have?
 	[/villagepump/people rated as positive have an interpretation that broadens their horizons].
 	[/villagepump/people rated as positive have less preoccupation with negativity].
 	[/villagepump/ people who are rated positive are trained to objectify their emotions].

from [/villagepump/people who are rated positive are trained to objectify their emotions].
[/villagepump/nishio.icon]
 I saw two candidates lined up under [the inner life of a person rated as positive] and came up with a third.
　 [Intellectual Production and Vipassana]
 　　On this page
 　　　Anger management can help you recognize anger and
 　　 [In Vipassana Meditation, you realize, "Oh, now I am [attached].
 　　 I've noticed in intellectual production, "Oh, I'm stuck in the [unproductive swamp] right now.
 　　He used the example of
 　　I suspect there is a similar structure in "[positive thinking]."
 　　　When [negative emotions] occur, you realize, "Oh, now negative emotions are occurring.
  　　　[self-monitoring]-like[/villagepump/issac.icon].
 　　What's better when you realize
 　　　Before you know it, when you're "caught up in your emotions," your emotions and yourself are one and the same.
 　　　You find yourself divided into two parts: the self that is at one with the emotion and the detached self that is observing it.
 　　　Then, if you don't like the "at one with your emotions" state, then put the emphasis on your side, away from them.
　[Vipassana meditation] is a concept derived from [primitive Buddhism] and refers to "the practice of noticing emotions when they arise within oneself" (interpretation of [/villagepump/nishio.icon]).
　 The "calming" that is often associated with the word meditation is [samatha meditation].
　 When you calm your mind and observe carefully the "calming state of mind", you will then be able to identify the "buzzing state of mind"
　 Pay attention to what is happening at the start of this "buzzing" state
　 This will help us to understand "what makes our hearts beat".
 　 Do you provide insight into the cause of the emotion induced[/villagepump/issac.icon]?
　 Increased resolution to "disturbing causes."
　 Would that make it easier to notice the "buzzing state"? (Seems like a bit of a leap)
　 In intellectual production
　 　I think it's more productive to work on it early and quietly than to fret over the feeling of "Oh no, I might not make the deadline, I have to get it into shape anyway!" I think it is more productive to work early and quietly than to be rattled by feelings of impatience.
　 　I'm afraid I'll be laughed at or offended if I write something like this" is another emotion that reduces productivity.
　 　　I think [90% of concerns don't arise].
	I guess it's like [bird's eye view]? [/villagepump/inajob.icon].
		So you're saying we need to have two levels of awareness and being able to look down there.
   Beginners also feel in the process of improving[/villagepump/issac.icon].
    When you realize you're not good at something, that's when the training begins.
    A very big advantage of mentoring is that it gives you a bird's eye view.
   The part I notice could use some help from technology[/villagepump/yosider.icon].
    Monitoring the brain and other parts of the body to let you know when strong emotions appear.
    Can you also distinguish between "stuck in emotions" and "looking down on things"?
    And then provide feedback on the "degree of overhead" and visualize how moving your thinking will change that?
     [Neurofeedback]
	Is this a kind of [automatic thinking]? [/villagepump/inajob.icon].
		I see many examples of negative automatic thinking, though,
  It could be called neutral automatic thinking[/villagepump/issac.icon].
   It's like detaching from feelings and thinking from facts.
   I'm sure it's "relatively" because of the inclusion of bias.
		I think I learned to be in a bad mood when I was growing up. I think I learned that when I was growing up[/villagepump/inajob.icon].
	The [thought recording method] of cognitive behavioral therapy may also have this effect[/villagepump/basic.icon].
	 https://www.nhk.or.jp/kenko/atc_1361.html


[Cutting out clarifies aspects and deepening digging][/villagepump/inajob.icon].
