Why didn't you answer with Yes/No?
from [/villagepump/why didn't you answer with Yes/No?]

Why didn't you answer with [Yes/No]?
	[/villagepump/Scrapbox is a "blog"? #63a718a9aff09e0000f94680]
		> I thought this answer was great[/villagepump/basic.icon].
 	>"Is Scrapbox a blog?" is a question that [/villagepump/basic.icon] would try to answer with "Yes/No".
 	> It's amazing how you summarized what the blog was about, what its purpose was and what the challenges were, and developed what the future is in that context.
　Why didn't I answer this question myself with a Yes/No?" The mystery of[/villagepump/nishio.icon] arose.
　It looked like it was because they had already thought ahead[/villagepump/inajob.icon].
　　　I wrote down "This topic sounds interesting" and finally got an answer after a while, so subjectively I don't feel like I "gave it out because I already had it"[/villagepump/nishio.icon].
　What is Scrapbox? Have you asked yourself broad questions like that before?
　I know what it feels like to answer a Closed question with an Open answer, as long as it's to the point. I know what you mean.
　[Clever].
　(Did I choose to say "clever" in a distant way?)
　If you make a mistake, it's like [everything looks like a nail to a person with a hammer], and you're trying to twist it into your own argument [double-edged sword].
　　　Hammer "[balance is important]" w[/villagepump/nishio.icon] that can be used anytime to answer the question, "Is it A or B?"
			[In short, Uncle Balance]!
　Hmmm, I think I might find something a little more interesting when I dig.
　　How do you use X and Y?" What is Y here? "Is X a Y?" That's how it went, wasn't it?
　　When [the concept] of Y is ambiguous, the question "Is X Y?" I think the question is "Yes if you take Y in a broad sense, and No if you take it in a narrow sense.
　If there is an open discussion forum for Yes/No style questions, answering only Yes or No is not a discussion.
　　I guess it's related to the topic of not being good enough to [suddenly vote].
　　If the only [options] were Yes and No, the story wouldn't expand.
　　It's like, "If it's condition A, then yes." "Well, if it's condition A, then yes."
　　　How much does it mean to be Yes on the condition that A.
