No need to sit in meditation.
from [/villagepump/ no need to sit in meditation].
from [Dogmatic Meditation Commentary].

It's important to "reduce the amount of stimulus coming in."
　Sitting is an option as a method to achieve this.
　Choice of relaxing in the bath or walking.

No need to sit in meditation[/villagepump/nishio.icon].
　Maybe they think it's the image of [zazen], that it's something to sit on.
　　Some sects emphasize sitting.
　But there are walking sects.
　　[Walking Zen]
　　>In Rinzai, as it is also called "Running [Kyogyo]," we walk at a brisk pace, sometimes as fast as we can run.
  >In contrast, in the Soto sect, one breath is half a step, and in one breath you walk half the width of your foot.
  https://www.engakuji.or.jp/blog/33633/
　For example, even if you take a bath and just sit in a state of blankness, your mind is still calm, which is a kind of meditation.
　　Some people think of meditation as some kind of special ritual.
　　That's because some people want to stage it like a special ceremony.
　　Related: [Intellectual production is not stoicism].
　Even if Buddha was enlightened by zazen, it is not right to think that sitting is essential because of it.
　It is [suffering] to put a person who is not used to sitting on a hard floor into a state of "[suffering]" when their buttocks hurt and their legs hurt.
　　[Buddha didn't tell us to suffer, rather he told us not to suffer.
　　We do not become enlightened by doing painful things.
　To begin with, compared to Buddha's time, people today spend the majority of their time sitting.
　　Level of sitting too much is bad for your health.
　　Sitting further from that state does not have much of a "switch from normal life" effect.
　　Rather, vigorous exercise followed by rest is closer to the original "zazen."
　　There's one called [kundalini meditation] where you exercise for 30 minutes and then relax for 30 minutes.
　I don't think you can meditate while watching Twitter, indeed.
　　In other words, "reducing the amount of stimulus coming in" is important.
　　Bathrooms are also suitable for meditation because there's little stimulation if there's nothing in the bathroom, and you can't meditate if you play Netflix.

