imposter syndrome
from [/villagepump/imposter-syndrome].
> "Imposter syndrome" refers to the tendency to [underestimate] oneself as not having such abilities and not being worthy of being evaluated, even if one achieves something on one's own and is highly evaluated by others. [Impostor" is an English word meaning "swindler" or "crook," and is sometimes referred to as "[swindler syndrome].
[Self-evaluation]

　It may have something to do with being [overly humble][/villagepump/yosider.icon].
　[It's good to have this word because I know the same feeling][/villagepump/blu3mo.icon][/villagepump/yosider.icon].

Hypothesis[/villagepump/nishio.icon].
 Phenomenon in which one has had negative feelings toward "people who are valued even though their abilities are not so great" in the past, and when one finds oneself in the same position, "oneself in that position" clashes with "one's past self who denies people in that position".
 　I interpret it a little differently[/villagepump/mtane0412.icon][/villagepump/blu3mo.icon].

[depressive realism]-ish[/villagepump/mtane0412.icon].
　Depressed people accurately perceive self and society.
　Healthy people can distort their perception of the world.
　　self-deception
　　[Positive Illusion]
　　 Once this illusion is solved, it is very difficult to apply it again.
　When you look at yourself from the perspective of society, it would be realistic to think that in the vast majority of cases, "Killing now would not affect the majority of society" [nishio.icon].
　 But that's because I'm thinking about [value to society], and when I think about [value to me], I think it's a matter of course that "[my existence's value to me is naturally higher than everything else]".

The lower you look, the less you risk getting hurt[/villagepump/mtane0412.icon].
　People who evaluate my abilities make me wonder if there's something behind it.
　This trend can be carefully crafted.
　　Seems like a big parent.
 　Parents do not praise their children
 　Parents deny their children's achievements.
 　Example
 　[I was so happy to get first place that when I reported it to my parents, they asked me to show them all my grades and pointed out the only subject in which I scored below 90, math, and said, "You are a coward. I was evaluated as "a cowardly person who tries to show only his good side even though he has subjects that are below 90.
 　I was given the [curse] that I had to be perfect to be approved.
 　There is a discrepancy between the non-home evaluation and the home evaluation.
 　　Eventually, they will understand that Japanese society has a culture of [hontento to tatemae].
 　　When this happens, we no longer know what's real.
 　　I see[/villagepump/nishio.icon].
 　[Monsters with low self-esteem will be created.
　I get praised -> I don't know what is being said behind my back.
　　There's a [downward load of evaluation] like [upward load] in the Abyss.
　　If you are low from the start, you are not loaded.
　Low self-esteem leads to aggression toward others.
　　>I have had negative feelings about "people who are valued even though their abilities are not great" and
　　I believe this is a story of consequences.
　　I see[/villagepump/nishio.icon].
　　If you live by the strategy of lowering yourself, you'll have a tremendous conflict when you encounter this situation.
　　The belief that you should be the bottom of the barrel makes you negative about anything less than you are.
　　　Cognition is distorted.
　I think you should acquire the skill of "[accepting others' evaluations]" as above.


[On humility]