Dogmatic Meditation Commentary

from [/villagepump/dogmatic meditation commentary].
[/villagepump/nishio.icon]
 I've been in discussions with well-wishers, and we've been like, "Isn't that [Vipassana meditation]," but there's no coherent explanation for [meditation] in the first place.
 ã€€Different denominations say different things. that are different in different sects
 ã€€It would be nice to have a commentary that separates it from a specific religion.
 I'm not a beaner or do as I'm told, but I think it's beneficial, so I felt it would be beneficial if I could verbalize what needs to be done and what I think is beneficial.
 [No need to sit in meditation.]
ã€€You might want to forget about that whole "coming to nothing" thing.
ã€€ã€€It's not like you can become nothing by being told to become nothing.
ã€€ã€€ã€€[Don't think about the elephant] mate.
ã€€ã€€People who say things like that are [simply] not very good at explaining things.
ã€€ã€€First, we need to understand what the current situation is.
ã€€ã€€I think I am in a state where words are coming out of me more and more, even without external stimuli.
   There seem to be a lot of those types of people at the well.
ã€€ã€€ã€€I think they feel pain about not recording what comes to mind and just letting it disappear.
ã€€ã€€ã€€Just record what you want to record.
	ã€€ã€€ã€€ã€€It is a state of "attachment to an idea" that makes it painful for the idea to disappear, but [eliminating the attachment] is not easy
 ã€€ã€€ã€€ã€€So you should just give up once and for all to continue meditating.
 ã€€ã€€ã€€ã€€ã€€I'm letting go of my attachment to the meditation side of things because my attachment to "I want to be the one who keeps meditating" is clashing with my attachment to "the thought that came to me."
 ã€€ã€€ã€€ã€€Thereby eliminating the "fear that something of value will disappear".
 ã€€ã€€ã€€ã€€ã€€You can't meditate when you're in pain or fear of disappearing, so you might as well just stop.
 ã€€ã€€ã€€ã€€As for this record, I think it's better to write it in a private, private project, because I think that if it's a public project, I'd be concerned about what others would think of it.
				This way I could just record my thoughts for days and time might move on.
     I haven't been in meditation for any length of time.
     But is it about getting into meditation in the first place?
					Isn't "I must be able to meditate" an obsession?
					You don't have to go into meditation, but that's fine, because the records of value are building up and up and up and up.
    Don't worry, there will come a time when you run out of words while doing this.
     Sometimes I think, "I've written this before," or "This is an idea that doesn't need to be recorded."
     The speed at which they are processed outweighs the speed at which they come up with the idea.

		Eventually, a state of no thought will come.
   It's hard to explain this condition in words.
   ã€€Associated with [inarticulate letters][/villagepump/issac.icon].
   Like [onomatopoeic word for "Soong..."].
   I think it's futile to call this "mindless" and tell people to "be mindless."
   ã€€You have to experience it to understand it.
   ã€€It puts you in a state of mind where you're thinking, "I'll never be at peace."
   Once you experience that state, the next time you'll know, "Oh, that.
   ã€€It becomes, "I can be mindless, because I have been able to in the past."
			The first time you experience it, "Oh, now!" it will be broken by a feeling of "Oh, my God!
				After repeating it over and over again, the mind becomes less and less motivated about going into that state itself, and it becomes possible to continue for a long time.
			We call this quiet state [samatha meditation].
			ã€€What this term refers to also varies from denomination to denomination.

		To use an analogy, the surface of a lake is like a still surface.
			Stop the wind where it used to blow and make waves, and after a while the surface of the water will be smooth.
			After a while in this state, words and feelings suddenly come to the surface, as if bubbles are rising from the water.
 			It is interesting to think about why this feeling came up.
 			The reason I don't usually have that thought is that there are so many things coming up that I don't see each one as a crush.
 			Once quiet, it allows us to pay attention to what has come up.
			For example, suddenly, I can think of a counterargument that says, "The last time Mr. A said X, he was wrong. Because it is Y." A counterargument may come to mind.
				The reason why this happened is because I was unconsciously angry about that statement of his.

			This is a step forward in state of mind.
				Until then, my emotions and myself were one and the same.
					When the emotion was occurring, it was me, but
				Here, emotions have turned into objects of observation.
					It's divided into two parts: the emotion and the self that observes it.
					This is called [associate].

		Observe from yourself [as an object of the feelings that come up].
			After doing this several times, knowledge about what emotions can occur and what are the factors that cause them to occur will increase
ã€€ã€€ã€€You will be able to [observe yourself] better.
ã€€ã€€ã€€Then, even in everyday life when you are not in a meditative state, you will be able to become aware of your [emotional] arising.
ã€€ã€€ã€€We call this [Vipassana meditation].

[No need to close your eyes in meditation].

Q: Does meditation bring sleep or [power nap] effects (restoring attention resources)?
	Or maybe it's not recovery, but [dogmatic meditation commentary #63a7eb65aff09e0000b11615
ã€€A: I don't think there is a hardware functional recovery like sleep[/villagepump/nishio.icon].
ã€€ I think the ratio of "stimulus-driven thoughts" to "spontaneous thoughts" will change as we reduce the amount of stimuli from a state of "distraction" from the outside world.
ã€€ More thoughts about what I want to think about.
ã€€ I think some people interpret this as "I can now focus my attention on what I want to focus on, my attention resources have been restored."
ã€€ To use an analogy, it's like "I had too many apps open that I didn't want, they were crunchy, and when I closed the ones I didn't want, they started running smoothly.
ã€€ ã€€Computer performance has not improved.


from [meditation#631cf80179d3a900004e0f28].
>I was just thinking about ~~" "I heard the sound of ~~" â† Nothing much happens when you do this kind of so-called labeling.
 Ah, I see, care for those who need the preliminary stage of samatha[/villagepump/nishio.icon].
 There are people in the world who are already [filled with strong emotions].
 ã€€As an extreme example, consider someone who thinks, "What if I die tomorrow?"
 Even if you shut that person off from information, [they continue to suffer by regenerating the feelings they have].
 ã€€I keep thinking, "What if I die tomorrow?
 ã€€Not entering a state of samatha meditation.
 So, with people like that, you have to first [keep your head busy] and [peel off the feelings that are stuck on it].
 ã€€One way to do that is labeling, but that's not the only way.
 ã€€For example, chanting sutras that you don't understand the meaning of, or repeating [the Nembutsu] over and over again.
 ã€€ã€€This is something that's done all the time.
 ã€€ã€€When I feel anxious or fearful, I do something like "Namandabu namandabu...
 ã€€For example, you can count prime numbers, recite pi, or challenge yourself to see if you can say 151 Pokemon!
 ã€€ã€€The point is, anything that can take up brain resources with non-harmful thoughts and prevent harmful thoughts from taking place is good.
 ã€€Some people may get into labeling well and speedily go to a state of Vipassana meditation, but in general, I think it's difficult, the task is too complicated.
 ã€€	+1[/villagepump/sta.icon]
 ã€€Chanting memorized material is beneficial because it provides knowledge
 ã€€ã€€If you enter a meditative state as a result, you kill two birds with one stone.
 ã€€ã€€You know, like doing Anki in an unobtrusive way.
ã€€ã€€And the most famous one is the "suzu-bukan.
ã€€ã€€ã€€Live-streaming your breath.
ã€€ã€€ã€€I guess you could say it's a slightly easier version of labeling.
ã€€ã€€Consciousness of walking
ã€€ã€€ã€€>When you are conscious of your delicate senses, you cannot think this or that in your head first.
   > You will feel that only the senses are being manifested.
   > Ego-consciousness fades.
 	  [https://www.engakuji.or.jp/blog/33633/ walking zen | Enkakuji Temple, the head temple of the Rinzai sect of Zen Buddhism]
   		This is one of them.
	Q: Can we just keep going until it comes off? [/villagepump/sta.icon]
		For example, if you do [dogmatic meditation commentary#63a7f0e6aff09e0000b1163a] for 30 minutes and peel it off, it feels like it's going to come back to bite you when you stop.
		They don't peel off permanently.
		Of course, it goes away spontaneously without doing anything (not so with stubbornly strong emotions like hatred?). But even then, it can still recede for a few days or so. It's hard to wait for it to disappear naturally. I want to get rid of it as soon as possible.
		If we were to call it an "act of stripping," what is the best way to tackle the act of stripping?
			1: About 10 minutes a day, every day.
			2: Cram as much as possible into one day
			etc
			Certain emotions don't stop and "peel off" but come back, [* life is interfered with], a situation that requires the care of a doctor rather than something the individual can do with meditation[/villagepump/nishio.icon].
			 There were no psychiatrists in the Buddha's time.
			 We're here now, and in some situations there are means of control through medication, so it's better to leave those "difficult cases" to the experts.
		ã€€[If it doesn't interfere with your life, you can think, "I tend to get caught up in such feelings," and accept it as a normal thing to do.
		ã€€ã€€It's not that I want to be liberated and become a Buddha.
ã€€ã€€ã€€ã€€If we can coexist without too much pain, so be it.
ã€€ã€€ã€€ã€€In general, when you can "recognize" an emotion as something separate from you, it's like "Oh, it's back again ðŸ¤—" or "Let's say good-bye again ðŸ¤—", and then you start to go through with it, and you feel less suffering.
 ã€€ã€€ã€€ã€€I remember this topic[/villagepump/issac.icon].
  ã€€ã€€ã€€ã€€[/marshmallow-rm/depression has left me with a sticky, scarcely-there feeling. When I get depressed it can get tangled up in my legs and I can't move].
  ã€€ã€€ã€€ã€€>Don't try to make sense of the memories and feelings that come at you or put them under your control (if you do this, they will control you), and don't get angry at them by saying things like, "You've ruined my life,
      > Just
      > "Hello, hello again."
      > and just say hello.
      > "I'm in a bit of a hurry, so I'll leave you with this."
      > and it's like shifting your attention (and hopefully your body) to something else.
     Oh, well, here[/sta/stop reacting][/villagepump/sta.icon].
     	Well, this is all [dogmatic meditation commentary #63a7e0e3aff09e0000b115e5].
     	It is not something you can become by being told to become nothing, nor can you stop by being told not to react."[/villagepump/nishio.icon].
     	 You're absolutely right, and they're not asking you to do that out of the blue.
     	 Would it be easier to understand if we divided it into levels?
     	 Level 1: Immediate response to stimuli
     	 Level 2: After responding to a stimulus, you realize you have responded
     	 Level 3: After reacting to a stimulus, notice what you reacted to and the stimulus that caused it
     ã€€ã€€ã€€There are already real benefits in this area.
     ã€€ã€€ã€€For example, if you notice that you get angry when you see a certain kind of person on Twitter, you can mute them.
     ã€€ã€€ã€€Not "become less angry," but "move away from [the cause]."
     ã€€ã€€Level 4: As soon as you see a stimulus, you realize that it "provokes a response".
     ã€€ã€€ã€€The faster you become aware, the more it happens before the "reaction" and then you can stop the "reaction".
     ã€€ã€€ã€€I'm writing this[/villagepump/nishio.icon] and this is not always possible, sometimes it's 1-3
     ã€€ã€€ã€€ã€€Sometimes 4 occurs and it's like, "Oh, thank God I didn't have to react extra.
     ã€€ã€€ã€€It's [self-defense][/villagepump/issac.icon].
     ã€€ã€€ã€€ã€€No. [Protective Spiritual Laws]?
     ã€€ã€€ã€€ã€€I thought it was "cool" to separate "Protective Spirit/Shinpo"[/villagepump/nishio.icon].
     ã€€In my case, I am aware that I "can" generate level 2-4 after a level 1 reaction[/villagepump/sta.icon].
     ã€€It's like a high probability of "No, I know in my head I shouldn't react, but I'm disgusted by what I'm disgusted by".
     ã€€I feel like I can't stand it.
     ã€€When I'm close to someone, I often get up to complain to my neighbor about household noises.
     ã€€I wonder if it's because I haven't been able to stop level 1 itself?
     ã€€No, you mean mute them or otherwise act to keep them away[/villagepump/sta.icon].
ã€€ã€€ã€€Quite informative[/villagepump/sta.icon].
ã€€ã€€ã€€In my case, I tend to forget to rely on doctors (if anything, I have a mysterious "I can't rely on doctors") + "I absolutely must get rid of these unusual feelings at all costs! (if anything, a mysterious belief that "I can't rely on them!") + "I absolutely must get rid of these unusual feelings at all costs!" both ......
ã€€ã€€ã€€[I don't want to rely on doctors.]

Q: Is [getting fit in a sauna] meditation?
A: I don't do it much, but the concept of tensing up in the sauna and water bath and then relaxing in the open air bath is similar to [kundalini meditation].
ã€€I mean the part about being in a daze in the open air is in a state of samatha.
ã€€I'm ready!" don't know because I haven't experienced it.
ã€€ã€€There is the pleasure of [samadhi], [union with God] through [ecstasy], and the coolness of it all.
ã€€ã€€As for the sense of union with God, I don't put much emphasis on that.

from [/sta/samata meditation#63a8f3d979d3a90000876896]
	>Isn't it impossible to "recognize" the "state of not thinking"? [/villagepump/sta.icon]
		>Is the act of recognition not also "thinking"?
ã€€For example, in a situation where you're washing the hood of your car.
ã€€I noticed (and recognized) bird droppings on it.
ã€€Suppose you scrubbed with more detergent.
ã€€In this process.
ã€€ã€€A: A person with nothing in particular on his mind, a quiet mind.
ã€€ã€€B: "Oh, there's bird poop on it!" (who immediately returns to a quiet mind again, thinking, "I'm going to go back to my quiet mind.
ã€€ã€€C: "Oh, there's bird poop on it! Damn it! You're adding extra work to my life!
ã€€There are three types of
ã€€Mr. C is in a "cycle of continuous negative thinking" that evokes feelings of "anger" in response to the stimulus, and that anger makes him angry again... and so on.
ã€€ã€€They can continue to get frustrated even after they've finished taking the poo.
ã€€ã€€[Still carrying it on your back?]
I see, so the image is to reduce only unnecessary thoughts[/villagepump/sta.icon].
	I thought you also cut out the thoughts that make you act to wash the car (no, if you cut that out too, wouldn't you not be able to wash the car? Are you a master of washing unconsciously? Like that).
	["Reduce only unnecessary thoughts"] The goal is not to reduce thoughts, but to reduce suffering[/villagepump/nishio.icon].
	ã€€So there's no need to eliminate "thoughts that aren't creating suffering."
	That said, you can do the work you're used to without thinking[/villagepump/nishio.icon].
	ã€€In the sense that when you walk, you don't do, "Well, I put my right foot out, now I'm going to put my left foot out.
	ã€€+1[/villagepump/sta.icon]

[super public bath=digital detox=meditation].

