the sound of one hand clapping (a classic Zen koan)
>[Both hands] strike together to make a sound, but what sound does [one hand] make?

>The Sesshū-no-koe (隻手声) or [隻手音] (石しゅおんじょう) is one of the major [koans] of [Zen], created by [Hakuin Huihaku] (1686-1769). [https://ja.m.wikipedia.org/wiki/隻手の声 Hakuin's voice - Wikipedia]
	>Hakuin], who worked on the koan of "[Ngozi butsusei]," used it as an alternative koan because it was easier to obtain a doubtful opinion than Ngozi.
	>"There is a voice in both palms, and what kind of voice is in one hand? What kind of voice do you hear in your hands?
	> ("When you strike both hands together, you hear a sound, but what sound does one hand make? Report it to me."); "[tengzai]" means to submit an answer to a koan. "[Rengzai]" means "to submit an answer to a koan.")

The original [parable of the clap].

[* doguji buddhahood]
[https://ja.wikipedia.org/wiki/狗子仏性 Nguko Buddha nature - Wikipedia]
>Guji-butsushō is one of the most representative [koans] of [Zen].
>On one occasion, one of his disciples, a monk, asked Zhao Zhou, "Do dogs have Buddha nature or not?" Zhao Zhou replied, "None."

[* Nansen slash cat]
https://www.weblio.jp/content/南泉斬猫
>Famous koan of Zen Buddhism. When the disciples of Nanquan Pugan (748-834) were arguing in China about the Buddha nature (Buddha's seed) of cats, Nanquan taught them to slay the cat to sever the root of the conflict. When Nanquan asked him about it, Zhaozhou put his sandals on his head and left. Nanquan said, "If you had been there, the cat would not have been killed.
[/villagepump/Nansen Zan cat].
 The conclusion is: "Do cats have Buddha nature? Or not? That's [a false dichotomy]!" I think that's what it means[nishio.icon].
 　Don't kill the cat for the sake of saying that much! (aside)
 　The subsequent "he left with sandals on his head" was followed by "Does the cat have Buddha nature? Or not? It's like sandals right and left".
 　　That "conflict is not inherently present, but is found by humans, and disappears when viewed differently."
 　　Nansen killed the cat because he wanted to eliminate the conflict by eliminating the "existence of the cat.
 　I think [the shipowner's voice] is more direct and clear about this sensation.
 　　Do cats have Buddha nature? Does the cat have Buddha nature or not? That's like asking which hand made the sound when you clapped your hands together."

