InstaChord Diary (before arrival)
After the arrival of the actual equipment [InstaChord Diary].

awareness
　Cash back to inajob at https://c.affitch.com/?ref=QEP6CNKKRACV
　Also available on Amazon.
	You get a sense of being able to play and speak.
	It is [overgeneralization] + [pessimistic misconception] not to challenge something Y that appears afterwards because you tried something difficult X in the past and failed.
 　Excessive generalizations that equate X and Y when they are not the same thing.
 　Pessimistic misconceptions that lead people to stop trying because they assume from experience that it won't work in the future because it didn't work out.
	You can ignore 7 and other difficult chords and play them.
		 6, 7, M7, add9 are OK
		 dim, aug, sus4, m7-5 sound much different
	As you touch it, you will understand "this is how a song is made.
	[iOS app InstaChord-i https://instachord.com/overview/app/] just for fun!
		Let's charge 320 yen to release all codes!
	You can see the chords with video [https://www.ufret.jp/plus/ U-Fret Video Plus - official YouTube music videos and chord charts are fully interlinked!]
		When you play along with the music, it is a great feeling to play along perfectly!
　　It's a sound game that when you get a GREAT sound, you get a brain fart from the ear area.
	I noticed that you like ICN:3~.
	I noticed ICN:6251 from Thesis of the Cruel Angel popping up all over the place.
	After the first couple of days, my wife and I spontaneously broke into a chorus and said, "Oh, this is a fashionable thing that families who can play instruments do! I thought, "This is a fashionable thing that families who can play instruments do!

--- diary

from [/villagepump/2022/12/27]
　[InstaChord]Very interesting[/villagepump/basic.icon].
　　Oh! You bought it? I have one myself[/villagepump/inajob.icon].
   I laughed because the content of [InstaChord] was not at the level of having [/villagepump/basic.icon].
			I like buying crowdfunded products because this is how I can get into it[/villagepump/inajob.icon].
				In the past, I got into [enchantMOON], [Gamebuino] (I didn't buy it) and [Arduboy] in a similar way!

from [/villagepump/2022/12/28]
　[Instachord]I want it [/villagepump/mtane0412.icon].
　 Someone please give me a link because I heard that [** I'll get [cash back] for the referral
　 	https://c.affitch.com/?ref=QEP6CNKKRACV [/villagepump/inajob.icon]
　 Thank you, I'll try to get it done! I popped it before it cooled off[/villagepump/mtane0412.icon].
			Big deal! (?) [/villagepump/inajob.icon].
			This system was only available if you bought through the official store[/villagepump/basic.icon].
			Oh, so it's [** available on Amazon] now? I didn't know[/villagepump/inajob.icon].

from [/villagepump/2022/12/29]
 [Instachord] received! [/villagepump/mtane0412.icon]
　I've decided to release next year's budget and summon [InstaChord][/villagepump/issac.icon].
 　This is a [music theory] study slot, no matter what anyone says, it's a study slot.

from [/villagepump/2023/01/02]
	It's amazing to get the [** feeling of being able to play and speak][/villagepump/mtane0412.icon].

from [/villagepump/2023/01/03]
[/villagepump/nishio.icon]
　I'm actually looking at InstaChord because of the bitter experience of buying an early [Udder] and not being able to use it.
　　Udder is difficult[/villagepump/inajob.icon].
　　[InstaChord is fun the first day] is probably a lot of people, and then how you enjoy it, you know,
　　　I think it's too hard for me to get into [arpeggios] and other technicalities, so I just play songs from this season's anime like karaoke.
　I ordered InstaChord because dithering around wasn't getting me anywhere.
　Worst case scenario, if I get bored after a month, I conclude that I can ask for applicants in the unexplored junior chat room and give them away in a drawing.
　I added my observations of people who instacode to [a new door opened].

PS: It is [overgeneralization] + [pessimistic misconception] not to challenge something Y that appears afterwards because you tried something difficult X in the past and failed.
　Excessive generalizations that equate X and Y when they are not the same thing.
　Pessimistic misconceptions that lead people to stop trying because they assume from experience that it won't work in the future because it didn't work out.

[/villagepump/issac.icon]
　Welcome [Instacode] #Instacode First Day Impressions
 　I could play [should be able to fly too]. I'm so impressed[/villagepump/issac.icon].
  　I tried it, but it's so hard to play the hardest songs.
   　[** You can ignore 7 or whatever and play it]! [/villagepump/inajob.icon].
   　The 7 is a symbol for adding a fourth note, and it sounds similar without it
     　[Seventh code]
    　　The good thing about chordal instruments is that you can learn these areas while trying them out immediately.

[/villagepump/inajob.icon]
 It's fun to see someone out there who can talk about InstaChord.
 　I guess any experience can be useful!

[/villagepump/mtane0412.icon]
 Instachord 3rd day or so.
  The experience [of being able to play and talk about it anyway] is amazing.
   I've easily overcome the barrier of wanting to play it, which I hadn't been able to overcome for decades.


from [/villagepump/2023/01/04]
[/villagepump/mtane0412.icon]
 Every day I play for about 2 hours in the morning on Instachord.
  The resolution of the song [Running into the Night] has been raised a little, such as the fact that it has two modulations in it.
   I'm looking forward to hearing that transposition support is part of the update plan.

from [/villagepump/2023/01/05]
[/villagepump/shoya140.icon]
 I saw the well and wanted one, so I ordered myself [InstaChord] today.
 	International shipping from Amazon.co.jp so it will be a little while before it arrives
 	[InstaChord, an instrument-type device recommended for DTMers, which can be played even by those with zero experience with musical instruments [guitar] [typing] https://www.youtube.com/watch?v=6QwIoW6ExLI]
 		Introductory video for [DTMer
 		> That feeling of being able to create a song as you are playing along is something you can't do if you are using a computer program. (With InstaChord, you can do that... [** There are many people who understand how a song is created as they touch it. [Many people say that as they play with InstaChord, they gradually understand how a song is made. You can notice that after this chord, it often becomes this.
 		 I realized[/villagepump/kimoto.icon][/villagepump/issac.icon][/villagepump/mtane0412.icon].
 		 I can't wait to feel it[/villagepump/nishio.icon].
		[iOS app InstaChord-i https://instachord.com/overview/app/]
			I'm playing with the simulation app until it arrives. Already having fun.
			I didn't know there was such a thing! [/villagepump/nishio.icon].
			　It's interesting, I'm comfortable just playing [the canon progression] for now.
			　I know[/villagepump/shoya140.icon].
	　I still can't play the chords in my head just by looking at the [degree name] sequence, and I'm hoping that exposure to InstaChord will help me build that mental model.

[/villagepump/nishio.icon]
　I tried to pull "[Merry Christmas Someday]" on the InstaChord app and got frustrated with a lot of 4M7s.
　　Let's find a song that looks easy first.
　　Great, [I should be able to fly] I can fly.
　　[add9] overlaps the major with a higher note 9 degrees above it.
　　[Astronomical observation], ignore add9 and 7 and play
　　Merry Christmas someday, what does 4M7 mean when the key is G. 4 is originally C
　　　Oh, I see, the fourth note of 7 goes up a semitone.
　　　Then I'll just ignore this one too.
　　　There's some stuff in the A melody that doesn't make sense, like 7m7-5, but the chorus is only 7 and m7, so you can play it.
　　　[https://gyazo.com/4192e8db0bf14fcf1393814e5e062717]
　　　The one that everyone makes[/villagepump/inajob.icon].
　　　　[InstaChord basic playing method #63b4193f6eb4060000617de8].
　　　After all, you don't know what you see in someone else's, you write what you know, and then you see the same thing in someone else's, a certain composition[/villagepump/nishio.icon].
　　　 Let's check the answers against each other.
　　Updated.
　　　[https://gyazo.com/f027e294b53fe418cfce7217ed95bc42]
　　　Separated by major and minor.
　　　The top five are common.
　　　sus4 messed up.
　　　　　There is a lot of sus4 -> none[/villagepump/inajob.icon].
　　　　　　You'll know it when you hear it, but it sounds like unstable to stable.
　[Rinbu-revolution-], I can't play it on the app because of the dim at the end of the chorus.
　　I can't substitute any other code around [** aug sus dim].
　　I'd just fool around by playing only the root note or only the strings where it fits...[/villagepump/inajob.icon].
　　It would be better to charge and practice honestly than to play strange techniques. w[/villagepump/nishio.icon].
　　I'm not sure if I'm going to pay for it or not. w
　　I bought it for $320, so I didn't hesitate.
　　　Simultaneous pressing of flat and dim!
　　　Semitone up!
　　　interesting
　[Cruel Angel's Thesis], surprisingly, all the chords in the chorus are unmodified.
　　That feels so good.

2023-01-05 Facebook
	> I bought InstaChord and couldn't wait for it to arrive so I bought the iOS app as well ($320 to release all codes).
 > very interesting
	> Smooth flow of playing with free iOS apps, then wanting to play dim and paying for it.

[/villagepump/inajob.icon]
	Everyone's InstaChord situation is interesting.
	　This data seems to be something that is not readily available over the internet.
	　　I generally swallow once and write it down, so any minor notices or misunderstandings are erased.

from [/villagepump/2023/01/06]
[/villagepump/nishio.icon]
　InstaChord:
　I was playing the chorus part on a loop and it entered my head, so I played the original song to try it out and was pleasantly surprised that it matched perfectly!
　　It's a [sound game], and when you get a GREAT sound, it's a sound game that gives you a brain fart from the ear area.
	So much more of [** see code with video
		https://www.ufret.jp/plus/
		There's [Habit], [I'd Rather Die] and [Outdated Rock'n'Roll Band], which I saw in [Kohaku Utagassen 2022].
　　I guess that means a higher percentage of songs covered that have been talked about since this system was established.

from [/villagepump/2023/01/07]
[/villagepump/nishio.icon]
	summary
 	I realized that [I like 3~.
 		[https://www.ufret.jp/song.php?data=65701 Ringo no Uta / Michiko Namiki Guitar chords/ukulele chords/piano chords - U-fret]
 	　[https://www.ufret.jp/song.php?data=127092 Between the sky and you (video plus) / Miyuki Nakashima Guitar chords/ukulele chords/piano chords - U-fret video plus]
 		[https://www.ufret.jp/song.php?data=126767 Riding on the Back of a Silver Dragon (Easy Chords for Beginners ver.) (Video Plus) / Miyuki Nakajima Guitar chords/ukulele chords/piano chords - U-Fret Video Plus]
 		[https://www.ufret.jp/song.php?data=127619 Hitori de de (Easy chords for beginners ver.) (Video Plus) / Nakashima Miyuki Guitar chords/ukulele chords/piano chords - U-Fret Video Plus]
   [https://www.ufret.jp/song.php?data=64815 Stars on Earth (Easy Chords for Beginners ver.) (Video Plus) / Miyuki Nakajima Guitar chords/ukulele chords/piano chords - U-Fret Video Plus]
 	I noticed [ICN:6251] from [Thesis of the Cruel Angel] popping up all over the place.
 	 [https://www.ufret.jp/song.php?data=70334 Dynamite (easy chords for beginners ver.) (video plus) / BTS (Bulletproof Youth Band) guitar chords/ukulele chords/piano chords - U-fret video plus]
   	No way [Cruel Angel's Thesis] progression w (6251)
 	 	I saw videos on YouTube like "[this song and this song actually have the same chord progression]" and thought, "Wow, I wonder how I can figure that out," but now I can. w
   [https://www.ufret.jp/song.php?data=60139 Cherries (easy chords for beginners ver.) (video plus) / Ai Otsuka Guitar chords/ukulele chords/piano chords - U-fret video plus]
    Key:G. The chords are simple, but I couldn't make it to the 4536251 folded in "Neighbor to Neighbor, You and Me, Cherry Blossoms".
    　I think I can do it if I practice this chord progression enough not to say, "What's next?
    　Oh, and the second half of this [ICN:6251].
 	After the first couple of days, my wife and I spontaneously broke into a chorus and said, "Oh, this is a fashionable thing that families who can play instruments do! I thought, "This is a fashionable thing that families who can play instruments do!
   Both of us don't play instruments at all, so this was our first experience
   The fact that it sounds decent enough to sing is amazing.
   However, if you practice the one without video accompaniment, you will be told that the chords are fine but the uncle sings in an unstable pitch and unstable rhythm, which is unpleasant 🤣.
   　It's much better to be able to keep up with the song and skip over chords you can't keep up with or occasionally make a mistake.

I am going out to Osaka today and should receive the actual machine when I get back!
