InstaChord Diary
[*** 2023-01-09]
from [/villagepump/2023/01/09]
[/villagepump/basic.icon].
 I'm trying to understand scales and modifiers (?) by tapping on the keyboard. I'm trying to understand add9, dim, sus4, etc.)
 InstaChord's ~ seems to be the keyboard equivalent of raising or lowering the second note by a semitone (in the case of a triad).
 ã€€+1[/villagepump/nishio.icon][/villagepump/inajob.icon]
 ã€€One more above the majors in sus4[/villagepump/inajob.icon].
[/villagepump/nishio.icon]
 I call it "modifier" on its own, but I don't know the correct term> [" modifier (? add9, dim, sus4, etc.)]]
ã€€InstaChord kitteh!
ã€€ã€€ðŸ‘[/villagepump/issac.icon][/villagepump/inajob.icon][/villagepump/basic.icon][/villagepump/issac.icon][/villagepump/basic.icon][/villagepump/basic.icon][/villagepump/issac.icon][/villagepump/basic.icon
ã€€Button on the string part, pressing it does not produce sound, only when you play it.
		There are several modes for this, so you can try different ones[/villagepump/inajob.icon].
			Strum
			Hit
				Surprisingly, it is also possible to play in this mode like a Taisho harp.
			Push

>[https://twitter.com/nishio/status/1612331518726406144?s=20&t=aopuGaMlnD4IJdkVNCUVUw @nishio]: InstaChord has arrived!
>(Otsuka Ai "Cherry" chord + whistle)
[https://youtube.com/shorts/KjNkvf89C-A?feature=share]
>The "storytelling" part of playing is whistling, so it's "playing and blowing," but you wouldn't get the message if I told you that.

[/villagepump/nishio.icon]
ã€€If you don't keep the button on the cord pressed, the sound decays quickly.
		Is EZ mode the only exception? [/villagepump/inajob.icon].
ã€€ã€€If you think the one where the note is extended is normal and play the chord for a long time, you'll get confused because it doesn't extend when you swap in[/villagepump/nishio.icon].
ã€€ã€€What I have read and understood from the description
ã€€ã€€ã€€The design behavior is that a note-off is sent when the button on the cord is released.
ã€€ã€€ã€€So "press and hold for as long as you want it to ring" is the expected behavior of the user.
ã€€ã€€ã€€Funny how I "press 3, then release and press swap".
ã€€ã€€ã€€If you hold down 3 and press swap, the sound will extend properly.
ã€€If you press and play 1 and then press 2 without releasing 1, the notes will not mix.
ã€€ã€€So, except for the same finger pattern like 3 and 6, you can prepare the next finger right after the note-on of the previous note.
ã€€ã€€This is also true for the modifier keys, so once you have a note on, you can immediately release it and hold down the modifier after the next one.
ã€€Mystic will use 7b all the time (exaggeration).
ã€€[3~7] Too difficult problem
ã€€ã€€I thought about taking a video of the swallowtail butterfly for social media, but it's nighttime and I don't want to whistle.
ã€€ã€€I press 3 with my middle finger and ~7 with my ring finger[/villagepump/issac.icon].
ã€€ã€€ã€€Nice[/villagepump/nishio.icon].
ã€€ã€€ã€€I'm ready to play!
ã€€ã€€3 is pressed with ring finger and ~7 with little finger[/villagepump/base.icon].
ã€€ã€€ã€€When I tried to do that and put my pinky to sleep, my ring finger would also go to sleep and press 6[/villagepump/nishio.icon].
ã€€The one that converts to ICN and mysteriously has a lot of modulation, but I suspect it's not necessary, or the output of [Chord AI], or the feeling that I wonder what knowledge I need to understand and play a score that only has chords written in it.
ã€€I think [toICN] just estimates the key by looking at the frequency of occurrence[/villagepump/inajob.icon].
ã€€https://github.com/inajob/toICN/issues/21#issuecomment-912926012
ã€€Automatic determination of modulation has not yet been implemented, but it seems to be possible only to check the frequency of each part in a similar way, and if it is too different from the others, determine that it is modulation.
ã€€Do you estimate by frequency -[/villagepump/base.icon]?
ã€€If the head of the track can be inferred from lyrics, etc., I feel it could be a little more accurate. [/villagepump/inajob.icon].
ã€€If we analyze the existing score, there is no good way to know the A-melody and B-melody separations...
ã€€The actual machine can now show what sound each button is making by setting the Display Note Number.
 ã€€[https://gyazo.com/883d3d5f260378a24e3ed0b61680dcaa]
 ã€€ã€€The chords, there are only five, and not even a subset of the string notes.
 ã€€ã€€The chords (left) are guitar and the strings (right) are piano? The [voicing] matches the instrument[/villagepump/shoya140.icon].
 ã€€ã€€Can you display something like this[/villagepump/basic.icon]?
 ã€€ã€€ Setup. This makes practicing [arpeggios] easier!
ã€€Bass note(?) mode, the sound is played when the chord button is pressed, so it is necessarily necessary to press the modifier key and then the key of the scale
ã€€ã€€Should I usually get used to that order as well?
		The only pattern that changes the bass note is like a flat[/villagepump/inajob.icon].
		No, I mean this kind of mode[/villagepump/nishio.icon].
		ã€€[https://gyazo.com/60ae02f799edf72652494ecd2ea94af7]
			It's a recently added feature - (I don't know)[/villagepump/inajob.icon].
   Chords sound when the left button is pressed, no need to operate the right string button[/villagepump/nishio.icon].
    Easy on the hands in studying chord progressions because it can be done without manipulation to play.
    and press Am and then swap, Am will sound, so swap must be first.
			Okay, then I agree that I want to get used to that one[/villagepump/inajob.icon].
ã€€Today's Reminders
ã€€ã€€Why not just use 9 instead of having to painstakingly press 7b?
	ã€€ã€€9~?

from [/villagepump/2023/01/09]
[/villagepump/shoya140.icon]
 [InstaChord] arrived!
 ã€€You're no different than me living in Japan! [/villagepump/nishio.icon].
		Somehow it arrived 10 days earlier than the expected delivery date[/villagepump/shoya140.icon].
 ã€€[https://gyazo.com/a8f2c6b15fbbf3e2f5a8ee3a4b325895]
 I like the fact that I can update the firmware in the [web browser].
 	[https://instachord.com/instruction/howto_update/ InstaChord Updates - InstaChord/InstaChord]
 	No need to develop/install dedicated [native apps
 	[WebUSB API], perhaps.
		I thought it was already practically useful[/villagepump/nishio.icon].

[*** 2023-01-10]

from [/villagepump/2023/01/10]
[/villagepump/nishio.icon]
 I want to photograph [swallowtail butterflies] during my lunch break.
ã€€done
>[https://twitter.com/nishio/status/1612669445201358848?s=20&t=aopuGaMlnD4IJdkVNCUVUw @nishio]: 2nd day of InstaChord! It's Porno Graffiti "Swallowtail Butterfly" chord + whistle.
>I thought it would be difficult, but the progression just before the rustication is very mushy, and the rustication itself is only difficult in the swap of 3, surprisingly. It is interesting to come to understand such things.
[https://youtu.be/Yhm_WPABM98]
>The monitor looks a lot different compared to yesterday's post. This time he's playing in his chair with the camera in front of him.

>[https://twitter.com/nishio/status/1612675309920477184?s=20&t=F7hFOkOWnwx8vFwAJ35q6g @nishio]: here's a version of "Cherry" with a better view of the screen
[https://youtube.com/shorts/3dYQCnwihfY]
>[https://twitter.com/nishio/status/1612676252045053952?s=20&t=F7hFOkOWnwx8vFwAJ35q6g @nishio]: the score is this much information
>[https://pbs.twimg.com/media/FmFggHDakAAn3eZ.jpg]



from [/villagepump/2023/01/10]
[/villagepump/shoya140.icon]
 InstaChord and curiosity-driven music theory, you've finally reached the [fifth-degree] circle!
 	I don't know from here either.
 	It's interesting that everyone is going along saying they don't know what's going on[/villagepump/nishio.icon].

[/villagepump/basic.icon].
 It's interesting how the same progression can produce completely different songs.

[*** 2023-01-11]

>[https://twitter.com/nishio/status/1613047416147832832?s=20&t=aopuGaMlnD4IJdkVNCUVUw @nishio]: 3rd day of InstaChord. Today is "Thesis of the Cruel Angel". From one phrase before the chorus.
>The rust section is easy except for the end, which is a repeated 6251 circular chord. This time, the 3~ connecting from the previous phrase was a personal challenge.
[https://youtube.com/shorts/tdzhXkdHdJk]
>[https://twitter.com/nishio/status/1613049682795859971?s=20&t=kQFMGpF5Pfo2fz3tckQXAA @nishio]: One more time, One more chance / Masayoshi Yamazaki
[https://youtube.com/shorts/Lkpli-D2XDo]
>I've chosen all three songs so far as easy ones that I can play without pushing too many buttons, but I simply can't make a video that I can post because I fail at the harder ones. This is the one I managed to play.
>[https://twitter.com/nishio/status/1613052119971692544?s=20&t=kQFMGpF5Pfo2fz3tckQXAA @nishio]: here's the score for today
>[https://pbs.twimg.com/media/FmK2WYeakAALmet.jpg]

[*** 2023-01-12]
>[https://twitter.com/nishio/status/1613389754313379840?s=20&t=e4-qmbywy8mSyK_fNpFtXQ @nishio]: InstaChord Day 4 Diary Sheena Ringo "Queen of Kabukicho"
>I used 7th locks for the first time because most of the chords are 7ths.


from [/villagepump/five-degree-zone].
 I'm thinking it's like you shouldn't jump to anything other than [inbred tone][/villagepump/inajob.icon].
 Are you sure? [/villagepump/nishio.icon]
  Moving next door in a five-degree circle means +/- 5 in InstaChord, right?
  Aren't there a few songs that do that kind of modulation?
 [https://soundquest.jp/quest/chord/chord-mv4/modulation-in-pops-1/] may be helpful[/villagepump/teyoda7.icon].
  >The [genitive] and [infragenitive] are on the left and right sides of the main key on the fifth degree circle....
  >This modulation is standard in classical music, but it is not used that frequently in pop music because of the theoretical technique required.
  I see[/villagepump/nishio.icon].
   You haven't seen any classical chord progressions yet, so you're thinking, "I haven't seen many people move next to each other in the fifth-degree circle.

[*** 2023-01-13]

from [/villagepump/3~ likes]
 [/villagepump/nishio.icon]2023-01-07
  I found that I like 3~.
 [/villagepump/nishio.icon] 2023-01-13
  It became clear that what he had initially said "I like something 3~" for no apparent reason was "I like [Harmonic Minor Scale]".

	[History of the temperament]
	[Timbre comparison].

from [/villagepump/kinship tone].
[Dominant key
	Tone with the dominant as the dominant
	Câ†’G
	So you're keeping the majors and minors and adding one more sharp[/villagepump/nishio.icon].
		What does it mean to increase the sharpening? is easy to understand on the key signature, but what kind of operation is it? It seems a little more intuitive[/villagepump/inajob.icon].
		Isn't that "five degrees up"? [/villagepump/nishio.icon].
		 [https://gyazo.com/2bc8b781daa78c74ef5c0c450b43137b]
   I wonder which is the more essential expression, "rise five degrees" or "increase sharpness."
   ã€€Is "processing to increase frequency by 1.5 times" the essence?
   ã€€[History of the temperament]

[*** 2023-01-14]
 from [/villagepump/2023/01/14]
 [/villagepump/shoya140.icon]
  I have a better understanding of [minor scale] [diatonic chord] and [transposition] in the [fifth degree circle].
		[/villagepump/I have a better understanding of diatonic chords in the minor scale and transposition in the fifth degree range].

 [/villagepump/InstaChord+GarageBand]

[*** 2023-01-15]
	[/villagepump/Backspace.fm New Year's Eve Ultra Year-End Party SUPER Live 2022].
	I learned the concept of upstroke.

[*** 2023-01-16]
>[https://twitter.com/nishio/status/1614854920892710912 @nishio]: InstaChord Diary
>I have no experience with guitar or anything like that, so I didn't know this, but it seems that when you raise your right hand, you also pluck the strings. I heard it's called upstroke.
	[/villagepump/strokepattern].
	[janjaka janjaka]
 ã€€I could do "[janga janga jaga]" in practice, but I couldn't do it with the camera rolling, so I made it one step easier.
ã€€I watched [/villagepump/everyone-understands-chord-progression-course] to 10 in the bath.

[*** 2023-01-23]
[/villagepump/2023/01/23]
ã€€I'm not sure about the concepts of [/villagepump/InstaChord and curiosity-driven music theory] and [/villagepump/secondary-dominant] (and throw a fluffer).
ã€€After all, useful abstract concepts cannot be mastered in the abstract.
ã€€ã€€I found a video that gives specific examples of all kinds of modulations, and it occurred to me when I was writing the chord progression of "specific modulations" that
ã€€ã€€[/villagepump/transposition-patterns-all-encompassing].
ã€€Perhaps the concept of secondary dominance, which I just learned about, is not yet well scaffolded enough to understand
 I just finished watching the first video of the entire transposition pattern.

[*** 2023-01-25]
[/villagepump/2023/01/25 snow]
ã€€I just now realized that 13 in [Chord Progression Course for Everyone] is about [Secondary Dominant].
ã€€Watch the explanation of the secondary dominant and then watch the transposition video!

[/villagepump/all transposition patterns].
	`Key:F# 2~ 3~ 1# Key:B 4 5`
	 Hmmm, the first half isn't easy to pull off at all, instacode-wise, is it? [nishio.icon].
	 G# and A# both in the major...Eb.
	 (Commentator Eb's story)
ã€€ã€€I was able to get a little ahead of the commentator's commentary by thinking in terms of ease of playing with insta-chords, I feel that my music theory knowledge has advanced! [nishio.icon].

[/villagepump/2023/01/25 snow]
ã€€Better understanding of modulation.
ã€€ã€€The smoothness of the modulation seems to be more important than whether it's in a close key or not, like the dominant motion.

[*** 2023-01-26]
	[/villagepump/new door opened] added
