Weekly note 2023-01-13
prev [Weekly Report 2023-01-03].

2023-01-13
A week in the blink of an eye
　I can at least write a weekly journal if I'm too busy.
　　I don't have a packed schedule, so there's no reason I can't take a few minutes every day to reflect on the day.
　　The trigger for simply thinking "let's do that" is not working.

What we did this week.
　First, I was back in Osaka for a legal weekend.
　I came home late at night and the next day [InstaChord] arrived.
　　[InstaChord Diary (Before Arrival)]
　　[InstaChord Diary]
  You're writing a diary (see below).
  On the first day, he suddenly said, "I have to tell people how interesting this InstaChord is that it can be played in a certain way from the first day! "I can only do that on the first day! So I started to take videos and post them.
  　I uploaded that to YouTube later.
 I wasn't just playing with InstaChord, of course.
 　I was [creating a development environment for Kozaneba].
 Eye exam to check the progression of [glaucoma
 　It's a long wait!
 　A casual tweet I made while waiting got more excitement and useful information than I expected, so I put it together.
 　　[changes in programming languages over the last decade].
　　　I'm putting it all together like a bullet tree in Scrapbox, but of course I think "[note the line across the group boundary]" would be beneficial, so I'll Kozaneba it later.
　Interesting discussion of music theory at the well.
　　I learn every day.
　　In general, it's interesting to learn the same thing with several people, but this time it's even more unique: everyone is buying InstaChord, an instrument they are touching for the first time, at the same time!
　　There's no way that someone could arise and say, "I've been playing this instrument for 10 years, I know a lot about it."
　　　Well, it's a community that doesn't seem to have anyone who would say that.
　　I had no plans to play an instrument at all, but I thought this was the right time [to ride the wave].
　　　Well, we had an exit plan when the waves were smaller than expected.
　　　>Worst-case scenario, if I get bored after a month, I'll just ask for applicants in the unexplored junior chat and give them away in a drawing.


	[/villagepump/stoicism/people-who-stoicize]
　　Note in your weekly journal the topics that are being discussed in a multi-person project, thinking "I'll organize them later in my project".
　　I'll go look at it after a while and sort it out.
　　But depending on how that brain works, the subject page can also develop
　　　In this case, it seemed natural to go back to "let's sort this out later on my own project."
　　　Wouldn't you?
　　　　Isn't it [looking for an excuse to procrastinate]?
　　　　Why not do it now and update it later?
　　　　　I just did.

2023-01-16
Two mixed patterns in the weekly journal.
　A: Write a review of day 0-6 on the day 7 page
　　The one at the beginning of this page
　B: Write activities for days 7-13 on the day 7 page
　Should we unify?
　　I don't think we need to unify.
　　　Because "looking back on days 0-6" is a kind of "day 7-13 activity.
　　If there is enough room to write, the day 7 page will contain a lot of "activities from day 7 to 13" and the beginning of the day 14 page will be a review of the activities.
　　I started the weekly diary approach based on the observation that when I created an automatic daily "diary page" in the first place, I ended up with a lot of blank pages.
　　　There is no such thing as a daily or "enough energy to write".
　　　If there is not enough room, it will be a page where a look back is written once a week.
　　　Reality will be somewhere between those two ends.
　　　　Demanding one end or the other does not fit the changing reality of the situation.

	[Scrapbox NotFound]
		Release [/kozaneba-forum-jp/release-note].

2023-01-19
	[/villagepump/curse].
	[/villagepump/neglect due to shura familiarity#63c8bd33aff09e00005e01b5]
	[/villagepump/ about the relationship between being an idiot and asking questions and Imposter Syndrome].
		Cut out [/villagepump/what a disappointment].
	[/villagepump/ "publish or die" spell]
		More content.
	[/villagepump/new-door-opened#63c23479aff09e00007d5d68]

[https://gyazo.com/51b90750700303bb4a1b842cd6d4d4d3]
　[STEPN]

2023-01-20
 Jiro Kawakita himself found early on a common structure in the KJ method and in the type of teamwork in which multiple people bring their perspectives together, but when he established the Kawakita Institute and began providing educational services, he found himself in competition with variants and began to say, "We have to do it right," and "We have to have formal training. and "we have to do it the right way," and "we have to get formal training.
 This would create an authority gradient between those who have formal training and those who don't, and we're getting further and further away from our original goal.
 [The temple and the bazaar," he said.


[The illustrated guide to a Ph.D.] and [the fog of literacy] if you put them together.
Most people don't see any change."
I'd have to conclude that this is a good idea.

[eyes not open]

[If they ask for a price reduction, I'll give notice of a price increase.]

next [Weekly Report 2023-01-21].
