Comparison of temperaments
Comparison of temperaments
	[*** [Pythagorean tuning]] 1, 9/8, 81/64, 4/3, 3/2, 27/16, 243/128, 2
		> A temperament in which all notes and intervals of a scale are derived from a pure [perfect fifth] with a frequency ratio of 3:2 [https://ja.wikipedia.org/wiki/ピタゴラス音律 Pythagorean temperament - Wikipedia].
		1:2 is "different octave, same note name"
		By doing 3:2 up and down three times from some appropriate note D, a scale consisting of seven notes can be formed.
		　This is within about 6% of a semitone deviation from the white keys of the modern average scale.
		[https://gyazo.com/e77e2c0792fae93b1231feae47372f95]
　　More repetition of this will produce "a little higher" and "a little lower" notes than the whole tone scale
　　　It turned out sharp and flat.
　　　At this point, the sharp on the Do and the flat on the Re sounded different.
　　　[https://gyazo.com/7d0f483d34c2d19a09201958c90205fa]
				[https://ja.wikipedia.org/wiki/ピタゴラスコンマ Pythagorean comma - Wikipedia]
				G# - Ab = `log(3, 2) * 12 % 1` = 0.01955000865387646
				　If this is zero, we can consider them to be the same note in different octaves, but in reality, there is a discrepancy.
				`_ * 12` = 0.23460010384651753
				　I can tell this discrepancy is about a quarter semitone.
	[*** [pure tone]] 1, 9/8, 5/4, 4/3, 3/2, 5/3, 15/8, 2
　　>If C is used as a reference, then E is 3 degrees above C, G is 5 degrees above C, B is 3 degrees above G, D is 5 degrees above G, F is 5 degrees below C, and A is 3 degrees above F. The whole C major scale is obtained by arranging these within one octave. [https://ja.wikipedia.org/wiki/純正律 Pure law - Wikipedia]
		[https://gyazo.com/5820277b801d1dfd83bf42fbbc5d72c9]
	　Multiplying by 5/4 from the stem note yields a sharp semitone, and multiplying by 4/5 yields a flat semitone.
	　　[https://gyazo.com/b0c842b797808a84e4b078de35495d13]
　　　Am I correct in understanding that the sharp of la and the flat of so do not exist? [nishio.icon].
　　　　I guess this is why I still don't write that way very often.
　　　　Write Bb instead of A#, F# instead of Gb
　　  Sharp on a Do and flat on a Re are of course different sounds.
	[*** [mean law]] [$ (\sqrt[12]{2})^n ]
		>The twelve-means rule is a temperament in which one octave is divided into twelve equal parts. The frequency ratio of adjacent notes (semitones) is equal [$ (\sqrt[12]{2})^n : 1 ]. [https://ja.wikipedia.org/wiki/平均律 Mean law - Wikipedia]
	　Considering that "an octave is 12 semitones," we averaged the frequency ratios of the semitones to arrive at the same ratio.
		The sharp on the Do and the flat on the Re sounded the same.
			Q: "Q: Why are there two different notations for the same sound? A: It used to be different."
		>[In fretted instruments] and monochords, the mean rule can be realized by geometrically setting the division points of the strings. In fretted instruments, the fret spacing for each string is not aligned and it is inconvenient to use straight frets in temperaments where the pitch of semitones other than the mean rule is not constant.
			I see [nishio.icon].

	table::
	 	Average Rhythm Pure Rhythm Pita
	 D	0	0	1/1	0	1/1
	 Eb	100			90	256/243
	 E	200	204	9/8	204	9/8
	  F	300			294	32/27
	 F#	400	386	5/4	408	81/64
	 G	500	498	4/3	498	4/3
	 G#	600			612	729/512
	 A	700	702	3/2	702	3/2
	 Bb	800			792	128/81
	 B	900	884	5/3	906	27/16
	 C	1000			996	16/9
	 C#	1100	1088	15/8	1110	243/128

[/villagepump/tone comparison].
