Re: is Scrapbox a "blog"?
Re: is [Scrapbox] a "[blog]"?
from [/villagepump/Scrapbox is a "blog"?]
　First of all, there were [web diaries] before the word "blog" became popular.
		2001 [https://ja.wikipedia.org/wiki/TDiary tDiary - Wikipedia]
　　That's why there was "[Hatena Diary]" before "[Hatena Blog]".
　　　Hatena Diary was released in 2003
　　　Hatena Blog was released in 2011
　　It's also why old-timers call their blog-like things "[diaries]."
　　　[https://www.hyuki.com/d/ Diary of Hiroshi Yuki] 2002~
   [https://matz.rubyist.net/ Matz Nikki] 2003~? (https://matz.rubyist.net/20030501.html)
　Early Web diaries were really just diaries on the Web.
　However, with the advent of the blog system, the comment and [trackback] functions were created, and it became a primitive form of [SNS].
	　　If you post a link to an article, the person who wrote that article will be notified.
	　　For example, Hatena Diary had a system that notified a user's ID with the ID notation (`id:nishiohirokazu`), which would notify that person that "there is an article mentioning you" ([ID call]).
	　　Like a Twitter Mention (`@nishio`)
　Then social networking goes viral.
　　Twitter, released 2006
　　　Landed in Japan in 2008
 　　At the time, mixi (2004~) and Mobage (2006~) were all the rage.
 	　　[https://gaiax-socialmedialab.jp/post-39058/ The leading figure who popularized Twitter in Japan talks about Twitter's past 10 years and its future].
  	　　>Okubo: In 2008, social networking services such as "mixi" and "Mobage" were popular in Japan.
     > Mr. Sasaki: I thought it would be something completely different; it has a 140-character limit. Also, the primary information spreads overwhelmingly faster than other things, so I thought there were new possibilities.
　　　Facebook also supported Japanese at the same time.
　In light of this trend, here's what I wrote in 2017
　　[The blog was dismantled and turned into a social networking site and Scrapbox].
　　The function of immediate distribution of information that blogs had been waiting for was eclipsed by Twitter and other social networking services.
　　The remaining part of the system is the function of stocking information, but the blogging system as of 2017 is weak at reusing past information.
　　So I decided to stop blogging and use Scrapbox and social networking.
　Five years later, I look back.
　　Scrapbox as a place to stock information was, as expected, far better than a blog.
　　My Scrapbox, which grew up in 5 years, is more useful to me than the blog posts of the 5 years before that!
　　Communication on Scrapbox was something that worked well except
　　This is what I started thinking when I started getting into the well.
　　Wellhead has reinvented the Web diary.
　　Scrapbox as SNS]" is currently about "a primitive SNS on a 2005 blog system. [Pastoral Internet].
