Cumulative effect of ideas
I think the concept expressed by the [interference effect of ideas] diagram in Jiro Kawakita's "Idea Method" is a very good one, but the diagram itself is not easy to understand.

So I drew a new diagram.
[https://gyazo.com/54f823c392e8344612a22ac575b88b83]

First, look at concrete data, and then ideas will come from there.
　[https://gyazo.com/72c80aeed579bd6b0df5c9f1df17e7aa]
　Some people tend to take the words "idea" and "conception" too seriously. but "ideas" also includes things like "this is what I mean.
　In this article, once you've read it, you'll think, "Is this what I mean?" and read on as if it were a hypothesis that "this is what I mean.
　That this remains the case [Jiro Kawakita.icon] calls it "underdeveloped.
　　[https://gyazo.com/b6155b0809ab6919f9d983390331c0b4]


Another time, another set of data, and the same old "is this what I think it means?" can come up.
　[https://gyazo.com/e11881b46abccad9c685ac7d52dc0e5c]
　When this happens, that "is this what I mean?" hypothesis becomes stronger.
　This is what [Jiro Kawakita.icon] calls "gaining stability"
　　[https://gyazo.com/abc059657c953d18e0e8df5e3a6b402a]


On the other hand, some seemingly contradictory previous hypotheses may emerge.
　[https://gyazo.com/db0c62c7f9aed4d843b2ec788c3bb6d0]
　At this point, if you think about it for a while and can't resolve the discrepancy, you'll say, "Well, neither hypothesis was correct.
　This [Jiro Kawakita.icon] calls the "downfall"
　　[https://gyazo.com/df2d81972e8786f32920f8262a407223]

After a connection is discovered between the past and something that is not the same, it may develop further from there
　[https://gyazo.com/25aeab330a8cba335301002d7085f258]
　This is what [Jiro Kawakita.icon] calls "[the] acquisition of inclusiveness
　　[https://gyazo.com/8c44caf55f9079d52610a682b8b68a23]
　　　It was hard to highlight with the enclosure, so I traced it with a different color.
　In some cases, what appears to be a contradiction, upon closer examination, turns out not to be so.
　　This is very important.
　　It's called [dialectical development].
　　Specific examples: [improved/not improved].

Concepts not in my diagram but in [Jiro Kawakita.icon]'s diagram
　The idea born from the first set of data and the idea born from the second set of data were combined to create a new idea.
　Combined with an idea born from the third set of data, a new idea was born.
　Combine that with the ideas generated from the fourth set of data, and even more new ideas were born.
　After I got to this point, I looked back at the record of when I worked with the first group of data, and I found even more new ideas connected to ideas that were undeveloped
　　This is an interesting event and I know you wanted to paint a picture of how this could happen.
　　Maybe it was hard to understand how you crammed four different explanations of the phenomenon into one sheet.
