Interpretation in divergence and convergence lincography
A summary of an interesting definition of divergent and convergent thinking in the context of [Linkography]([Linkography])
	>That's the connection between what I talked about in my KJ method lecture about the importance of the relationship lines found between unrelated groups and lincography's "move with multiple backlinks is a convergent move"! (This post itself is a convergent move)

[https://gyazo.com/1328e0689093337fc7270e04ab88b499]


move
 A word that corresponds to the "move" in chess.
 In cases where the conversation is verbal and physical, the transcription can be split up with reference to the video recording by hand.
 In the context of chat and groupware, it seems to me that one post is roughly equivalent to one move.
 Link" when there is a relationship between moves.

orphan move
	MOVE not linked to anywhere.

critical move
　This critical does not mean "critical."
　Simply "an important hand" or "a hand of great influence."
　過去の2つ以上のmoveと繋がるのがcritical backlink move
　未来の2つ以上のmoveと繋がるのがcritical forelink move
　 Of course, at the stage when the utterance is made, we don't know if it will lead to the future.
　 When you look back on a series of conversations later, you will say, "This move was a critical forelink move.
　[*** 「critical forelink moveが[発散思考]、critical backlink moveが[収束思考]である」とする]
　　This is interesting. I have a better resolution on divergence and convergence.
　　For example, in a situation where you are brainstorming ideas about something, you might say, "I think A is a good idea! "I like B!" I like C!" and "I like C!
　　　I had taken this vaguely as "divergent" or "divergent thinking," but based on this definition, this is just a collection of orphan moves
　　Let's say the conversation is, "I think we should do A," or "A has a problem called B," or "Why don't we twist A a little bit and do A2?" Suppose the conversation is like this
　　　This is divergent thinking because the first A is referenced by the other two
　　I think we should do A." "A has a problem called B." "If we twist A a little bit and make it A2, that solves the problem of B!"
　　　This would make A divergent and A2 convergent.
		[https://gyazo.com/ebfc5c5323e317c6dfc62cb2ecd43023]

This original lincography analyzes conversations, so the moves are lined up one-dimensionally, but what happens when you expand the tree of associations like in [Thinking Fireworks] or [Mind Map]?
　[https://gyazo.com/d538cc0ef5935dfea34c9eaab15ac7d4]
　The "parent of a branch" is the divergence, and the link connecting the different branches is the convergence.
 It can be interpreted as, "The reason it is beneficial to [focus on lines that straddle group boundaries] is because it is convergent thinking."
 [発想の累積効果]の[包括性の獲得]は収束思考

Many one-dimensional chat and groupware tree bulletin board systems have the ability to [permalink] to individual posts
　Why, because without it, it would be inconvenient to "point to a past post".
　So why is it necessary to "point to past posts"?
　　One could interpret that as "because that's convergent thinking."
　It would be interesting to have the ability to analyze this permalink in chat or groupware and highlight "divergent thinking posts" and "convergent thinking posts".
　　Or provide a priority view of convergent thinking posts for those who want to skim them after the discussion gets going.


Scrapbox
 Given that a page in Scrapbox is a tree structure of rows
　 各行がmove
　 Parental line with multiple children in a bulleted list is divergent thinking.
　 Rows that use line links are convergent thinking.
　Scrapbox's "line links" are broken by cutting and other operations.
　　Converging statements are the first to break.
　And they don't like it, and they copy it in quotes.
　　The good thing about digital text is that it can be copied, unlike audio conversations.
　　But the problem with copying, however, is that it's a one-way street, and you can't trace the source of the copy back to the destination.
　　[https://gyazo.com/eb9a148afa5296af85f19de46c2d09bd]

