思考の結節点2023-01-31
前回 [思考の結節点2022-09-20]
	First time in 3 months!

Maternity Leave Reskilling
　Context:[/villagepump/maternity leave reskilling flames]
　Japanese are not good at recognizing human variability."
　　the subject is large
　　　["Men are taller" is a large subject].
　　Compared to the U.S.?
　　　Racially diverse...
　　　But in urban areas, aside from rural areas, it is common to see people of different races.
　　　Some people say, "Japanese are mono-ethnic..."
 　　　[https://www.s.u-tokyo.ac.jp/ja/press/2020/7056/ Genetic population structure of Japanese at the prefectural level - Graduate School of Science, The University of Tokyo]
 	   [https://gyazo.com/5ba71154e3b1f862addb25d22986b3d5]
		A meme that ignores people's differences and thinks "we're all the same" is a good thing?
		　No, the kind of bullying that excludes individuals who don't look like them from the group.
		　And it's not just in Japan.
		　　Even in America, they bully yellow people.
		Do you think it is good to be homogeneous?
		　harmonize but not agree (harmonise)
　　Is there a disadvantage to not ignoring them and you choose to ignore them?

beauty contest
　Judging people by their appearance
　"Judge humanity by its appearance."
　　She's a good person because she's beautiful."
　　There is harm in this.
　Isn't there any harm in praising them?
　　What's the problem?
　　　Bad looking people make me uncomfortable.
　What's the difference between that and posting test scores?
　　If people with bad grades are displeased, they are not taken into consideration, why?
　　　The "college entrance exam," a system that separates people based on academic ability, is widely used, sending the message that "such a separation is socially acceptable."
　　　But to get into Takarazuka, you have to separate people by their looks.
　　　　I think some people are complaining about that.
　　　　Merely a difference in the number of people
　Everyone finishes together because they don't want to be ranked in a race [non-competitive athletic event].
　I guess it depends on whether or not there were people who were adamantly opposed to the ranking.
　　[Violence makes justice.]
		[/qualia-san/暴力による新しい正義の創造]
　　I think that the use of bishojo illustrations in advertisements at train stations is also inflamed because some people are trying to create a new justice that "it is not good to display bishojo illustrations in public places" by the violence of repeatedly inflaming people.
　　	[/villagepump/What's wrong with the female nude?]

Is there a logical basis for justice?
　Those who wanted to give a logical basis to justice came up with [the greatest happiness for the greatest number], and as a result, "It was justice that we ended the war quickly by dropping the atomic bomb on Japan," which led to the question, "Was that really the right thing to do?" and then the question arose, "Was that really the right thing to do?
		[/villagepump/liberal-communitarian debate and cancellation culture]
		If busting minorities makes the majority happy, doesn't that mean busting the majority is justified?"
	Isn't there no logical basis for justice?
　　[Mackie's Theory of Error]
　[Uyghur issue]
　 [https://www.wwdjapan.com/articles/1204893 "MUJI" comments on Xinjiang cotton issue - WWDJAPAN]

Expand the scope of what you find interesting.
　Aging? Corona?
　Narrowing naturally?
　I think it will naturally narrow.
　　[Trade-offs between use and exploration].
　　When you have enough "interesting things" in your daily life, you can spend an interesting time just patrolling through them.
　　The "exploration" to explore new things is a low expectation of fun.
　　If you only patrol the pioneered ones, the number will gradually decrease over time.
　　　As we get older, like-minded friends start dying.
　　　Interesting communities cease to function due to the circumstances of their members.
　　We have to accept that the expectation of search is low and we have to search
　University teachers are blessed with a good environment, automatic supply of new people.
　　I don't think so, toxic environment.
　　People are supplied, but always in the fixed role of "I am the teacher, the other is the student".
　　　This environment is toxic, and immersing yourself in this environment alone will drive you insane.
　　　Only a handful of teachers who didn't go crazy will be considered personable, which in turn means 90% of them will be corrupt.
　　Portfolio is important.
　　　A portfolio of "different roles" is beneficial to mental health
　　　Mental Stability
　　　Self-assurance portfolio
　　　Evaluation by others goes up and down.
　　　　Just like stock prices go up and down.
　　　　Never put all your eggs in one basket."
　　　Talk about creating multiple accounts on Twitter.
　　　　Different accounts have very different timelines.
　　　　Different trends.

Put out what customers want to read.
　Maybe you should read Ramen Discovery Biography.

[No harassment will occur if we communicate via AI].
　AI intervenes instead of a direct human conversation.
		[AI defends Homo sapiens against attacks by Homo sapiens].
　Cyberpunk 2077
　 When people die, they talk to an AI.
　ChatGPT is a condom.
　　Homo sapiens can be harmed by direct contact, so AI is sandwiched in between.
　Is the "role of teacher" necessary?
　　The teacher's function is broken down.
　　The role of knowledge provider is already filled by books and papers...
　　YouTubeの講義動画
　　　As for non-interactive classes, video lectures are better than offline classes, which "can only be watched at 1x speed, restricts the viewing time and location, and does not allow you to go back to the lecture if you don't understand something.
　　　Will the ability to teach interactive classes become a requirement?
　　　　Most of today's university teachers don't seem to be able to adapt
　　Role as a question-answer person
　　　Until now, "[(Column) Books cannot be communicated with in both directions.
　　　An entity capable of two-way communication emerged.
　　　A librarian is in my house 24 hours a day!
　　Care for people with mental health problems
　　　This kind of thing should not be done by a "teacher" in the first place, but by someone who has properly learned about mental health in a professional manner.
　　Caring for people who don't know what to ask
　　　Inability to communicate with AI is a "new obstacle."
　　　As new communication targets are created, new communication skills are needed, and those who do not have these skills become the [new disabled].
　　　I can't speak a word that a machine can understand.

Twitter's translate button is useful
　It would be interesting to create an account that only follows languages that I can't read at all.

richness
　I think the wealth is increasing even though the inflows and outflows are decreasing.
　 Netflix
　　ChatGPTやDeepL
　[Digital tools trickle down].
  Abundance is not monopolized by the rich, but overflows and spreads to others.
　　In a time when "wealth" was the possession of money, it did not trickle down because money could be accumulated without limit.

権利
　Do I have rights?
　There are "legal rights" recognized by law.
　　Is it correct to use the expression "right" as if there is no legal basis?
　I have every right to complain."
　　Complaining is irrelevant to rights because one can do it alone.
　　Does the person who complained need to follow that argument?
　　　If you don't have a legal basis to comply, you don't have to comply.
　　　You have no right to make me obey you."
　　社会的承認？
　　'Mr. A has the right to complain about his girlfriend B's affair.'
　　　It is possible to complain
　　　Impossible to stop B if he continues to cheat
　　　Does A have the "right to stop"?
　　　　That right collides head-on with B's "right to act freely."
　　　　I can counter with equal strength the claim that "there is no legal basis for the right."
　　There is no legal basis for prohibiting "claiming."
　　　You can "insist."
　　　　Would you describe this as "entitled"?
　　　There is a "right to insist," but not a "right to have one's claims obeyed."
　　People have career rights."
　　　Is there?
　　　Is it legally guaranteed? →No.
　　　I have a feeling of "I want assurances."
　　　Feelings are subjective
　　　The expression "entitled" has the problem of confusing the subjective with the objective.
　　A distinction should be made between "I have a right" and "I want you to."
　　　Often when people say they are "entitled" they are only "wanting"

human gacha
Story Gacha
　[What do you want to be remembered by?]
Choosing not to be prepared
　Preparedness is not mandatory.
After being laid off, you can use it as an opportunity to try something new, or you can use it to kill time in a game you've been playing.
　The former is a better story gacha
　I'm not sure if the game will ever have a story SR.
Easy to be SR when others intervene.
　[Hypothesis that SSR emission rate is higher for gachas involving other people].
　Negative things are prone to happen, though.
　[pessimistic misconception].

[Are you interested in the mentality of homo sapiens or not?]

Buddha
　Rahula's story
　　Buddha had a child.
　　It is a hindrance to ordination." Let's name the obstacle (Rahula)!"
　　>Rahula means "obstacle.
   > When the Buddha learned of the birth of his son, he said, "Rahula was born. The origin of the name comes from the fact that the Buddha said, "Rahula was born, and Tsunagari was born.
   	『岩波仏教辞典』第二版 https://true-buddhism.com/founder/rahula/
　　Terrible parents.
　In the first place, he said, "I'm enlightened, but I don't want to teach this to other people because they won't understand it," and then he said, "Do something about that," and then he said, "Maybe some of them might understand it, and those with ears can listen.

What do you mean by "disturbing people's minds?"
　Why is the human mind disturbed?
	At this very moment, if a staff member said, "I'm quitting the company," my mind would be disturbed.
	You have the option of being like, "Oh yeah, you're quitting, all kinds of stuff."
	People who react that way seem to be the exception, "people who are either insanely masterful or dead inside."
	So Buddha tried to be.
	People get disturbed because they're so attached to life.

Why is the human mind disturbed? →Hormonal imbalance hypothesis
	[/villagepump/ now I know why there is no search avoidance culture or something like that with male doujinshi (Masuda article) #63d9dbacaff09e00001eb902]
