The relationship found after an expanded interpretation is not necessarily the same as the relationship to the original concept.
from [/villagepump/ relations found after an expanded interpretation are not necessarily relations to the original concept].
[https://gyazo.com/20e85a90b0c2cc7de6f6ff7e1f3e24aa]
　Mr. A talks about concept X
　Over time it gets magnified.
　Mr. B talks about the relationship R between "expanded concept X" and concept Y
　A later viewer gets confused by the thought that Mr. B talked about "the relationship between 'concept X' and Y that Mr. A talked about".


from [/villagepump/2023/02/03]
 Suppose Mr. A creates concept X, and after some time Mr. B claims that there is a relationship between concept X and concept Y.
 Not that Mr. A would agree that "Concept X and Concept Y are related."
 　At this time, "A's concept X" and "B's concept X" are not equal
 　Confusion arises by calling both of these two different concepts "Concept X".
 When I looked at ["" versus the term materialism] in [https://ja.wikipedia.org/wiki/形而上学 Metaphysics - Wikipedia], I felt "Huh?" I delved into the feeling of "What?
 	[" The term "materialism" dates back to 17th century Western Europe; at the end of the 17th century, Leibniz...] [https://ja.wikipedia.org/wiki/唯物論 materialism - Wikipedia]
	  So at the "Aristotle's Metaphysics" stage, there's no materialism involved with that.
	 Aristotle, who died in 322 B.C., thinks
	　 Materialism in the 17th century
	 　In between the two is the great event of the rise of Christianity.
	 　["Leibniz... At the same time, he made mechanistic philosophy and atomism, which do not recognize an objective cause in natural science, dangerous to the attitude of trying to be pious].
	 　　So Leibniz is taking the "God created the world with a purpose" position and criticizing the "idea that the world exists without a transcendent purpose is not pious."
	 　If you equate it with Aristotle's ideas before Christianity, confusion will spread.
	So is the word "metaphysics" itself.
　Western Zhou? appropriated the I Ching term for "metaphysics" and gave it the name "metaphysics" does not mean that Aristotle or any medieval philosopher thought there was a connection between metaphysics and the I Ching.
	　Aristotle (384-322 BC) wrote an unnamed section on "What is Being?"
　Around 30 AC Andronicus organized and placed it after the ta physika (book on nature)
　Since it did not have a name, it was called 'metapsychica' with meta meaning 'later' and became metaphysics in later times.
	　Are there any philosophers making the philosophical claim that they are related?
 [debt accumulated over thousands of years].

relevance
　from [/villagepump/deconstruction].
  First, [Derrida's deconstruction] and the [deconstruction] of the rest of us are probably different[/villagepump/base.icon].
  Have more theorists in the post-Derrida era been using the theory of deconstruction as a support in their own field?
   It's like "[To a man with a hammer, everything looks like a nail]," and someone who gets the idea of deconstruction finds a [dichotomy] in everything and says, "Deconstruction!" and then they might say, "Deconstruction!"[/villagepump/nishio.icon].

Common[/villagepump/sta.icon].
	I get the impression that most of the blog posts that come up on Google are on Mr. B's side.
	I still think it's important to check the original source.
　I don't always do it because it's costly to check the original source, but when I read what Mr. B wrote and say, "What? I don't understand what you mean?" I feel that in some cases, it is not difficult because the subject of the understanding is profound, but simply because the concept has become blurred over time, and the links are no longer connected, making the meaning unclear[/villagepump/nishio.icon].
　　Mr. A's opinion and Mr. B's opinion are naturally different, but they are equated, or even Mr. B's opinion is overestimated by the prestige of Mr. A.
　　If it's Mr. A's opinion I want to know, then I'd better ignore Mr. B and listen to Mr. A.
