I don't think there is any basis for confidence.
from [/villagepump/I guess there is no basis for confidence].
[There is no "basis" for "confidence.
　[Self-esteem] and [confidence] are [unfounded impressions] in the first place[/villagepump/nishio.icon].
　　Implicit in the term "[unfounded confidence]" is the feeling that "you must have a basis for yourself" and that "you who do not have something to base your confidence on should not be confident."
　　But even if someone thinks they have "grounded confidence," that "grounding" doesn't logically lead to "so I should be confident."
　　I associate this with [Humean skepticism].
　　 Even causality is iffy, much less confidence.
　　 Isn't it funny that you think you need evidence? I mean.
　　 The connection was made after the fact.
　　Is [track record] often taken as evidence? [/villagepump/yosider.icon].
　　　Just because something has worked in the past doesn't mean it will work the next time.
　　　　I wanted to say this[/villagepump/nishio.icon].
　　　But I think the odds are that someone with a proven track record will do better.
　　　　+1[/villagepump/inajob.icon]
　　　Probability is that someone who acts confidently with the same ability is more likely than someone who acts less confidently...[/villagepump/nishio.icon].
　　　　Probability of success is likely to be high with respect to tasks that are affected by human evaluation
　　　　(I thought that the probability of a bug is the same even if you write a program with full confidence, so I limited it to "evaluation by humans.)
　　　　I guess we shouldn't look too much at attitude when evaluating people[/villagepump/inajob.icon].
　　　　　I'm getting dragged along, though.
　　　　　Are we supposed to say that we should just look at the portfolio and make a decision?
　　　　　If the goal is to see [culture fit] or something, you need to see attitude.
   Is there anything to be gained by acting unsure[/villagepump/basic.icon]?
   　Moderate confidence? [/villagepump/inajob.icon].
   　　[Some say "overconfident.
   　[expectation control]? [/villagepump/yosider.icon].

