Humean scepticism
from [/villagepump/ヒューム的懐疑]
There is no rational basis for [causality], it just feels like there is a causal relationship, doesn't it? The idea that

> It is not possible that causality can be [justified] by [induction] from observation and [experience].
> because the basis for induction, nature's [principle of natural uniformity], is not actually observed, experienced, or argued for.
　Does this mean you think this is true for physics and such[/villagepump/basic.icon]?
　　Yes. Pointing out that the [basis] of [induction], the "[principle of natural uniformity]", has not been argued[/villagepump/nishio.icon] is [/villagepump/nishio.icon].
　　 1: "I did experiment A and got result B."
　　 2: 1 over and over again.
　　 3: Scientists conclude that "doing A will result in B".
　　 Pointing out that there is a logical leap between this 2 and 3.
　　>The term "principle of the uniformity of nature" or simply "principle of uniformity" is a term used in the world of philosophy of science to describe the assumption that "events in nature do not occur in a completely random manner, but are ordered in some way, and under similar conditions, the same phenomena should repeat themselves. The assumption that "events in nature do not occur in a completely random way, but have some order, and under similar conditions, the same phenomena should repeat themselves.
　　 https://ja.m.wikipedia.org/wiki/自然の斉一性
　　I think modern physicists also see it more as "it is abnormal to claim contrary to this without checking it because it keeps being experimentally confirmed" rather than claiming it is true, so I wonder if they are Humean in that respect? [/villagepump/base.icon].
　　　The [principle of natural uniformity] is not Humean because it assumes a quicksand[/villagepump/nishio.icon].
　　　　If you deny this, I don't see how science can be established.
 [David Hume] April 26, 1711 (Julian calendar) - August 25, 1776 (Gregorian calendar)
  https://ja.wikipedia.org/wiki/デイヴィッド%E3%83%BBヒューム
  　>While he believes that there is no guarantee in principle that human nature can reach certain knowledge, he avoids the radical skepticism of Pyrrhon and, influenced by Sextus, develops a relatively moderate skepticism that recognizes mathematics as the only discursively certain discipline, thus demonstrating the limits of human knowledge and empiricism.
  　 Math admits.
　 [Newton] 1643-1727 mechanics knew at this time?
[https://ja.wikipedia.org/wiki/懐疑主義 懐疑主義 - Wikipedia]

Are you saying that two events (A, B) have no effect on each other, but when people see something like B happening after A happens, they find causality between A and B? [/villagepump/biwachi.icon].
 When supermarket A closes at 9:00 and supermarket B closes at 9:15 are adjacent to each other, some people might interpret this as if supermarket A closes, supermarket B closes (causality).
 "When people see something like A happens and then B happens, they find causality between A and B." this range is Yes[/villagepump/nishio.icon].
  Isn't it possible that everything that people think is causal is simply something that they see happen back to back and assume is causal? Isn't it possible that there is no such thing as causality? Skepticism
  For example, when you see a sugar cube melt and lose its shape when you pour water on it, many people tend to think that the sugar cube melted because of the water pouring on it, but what is the basis for the claim that the water pouring is the cause? But what is the basis for the claim that it was caused by pouring water on the sugar cube?
  　Hume: "[That's your opinion, right?] Do you have any basis for that?"
  I see. Does it matter here whether the two events do or do not act on each other[/villagepump/biwachi.icon]?

 To explain this without using the word "causality,"[/villagepump/blu3mo.icon]
 　When we observe "A happens, then B happens," then humans tend to infer that "B happens" after "A happens."
 　But this is the same as [analogy], just finding patterns
　　という認識[/villagepump/blu3mo.icon]
　　+1[/villagepump/nishio.icon]

　I think this kind of thing actually happens a lot, so it's quite possible to be right when you do Humean skepticism[/villagepump/basic.icon].


[Hume]
[懐疑主義]

