concept
from [/villagepump/concept].
from [Introduction to Phenomenology: For a New Science and Philosophy of Mind].
["CNN has spatial concepts a priori, but it's able to learn concepts a posteriori/experientially without any [categories] at all, right?"]
　Are we "learning [the concept] empirically?" [/villagepump/nishio.icon].
　 It depends on the definition of the word "concept"...
　 Even if a neural net can determine that cat image A and cat image B are similar, whether the neural net has the concept of "cat"...

We need to see a definition of the word "concept."

Encyclopedia Myopedia, "Concepts" [src https://kotobank.jp/word/%E6%A6%82%E5%BF%B5-42803#E7.99.BE.E7.A7.91.E4.BA.8B.E5.85.B8.E3.83.9E.E3.82.A4.E3.83 .9A.E3.83.87.E3.82.A3.E3.82.A2]
>Translation of Latin conceptio, English and French [concept], German [Begriff], etc.
> It is the fundamental form and product of man's grasp of objects, and is sometimes used synonymously with conception, image, etc.
> Simply put, concepts are nominals.
> Naming by language is nothing but the production of concepts.
> The concept of "individual" or "single concept" and the concept of "single" or "single concept" are the same as the concept of "individual" or "single concept.
> General, universal, or class concepts.
> The concept of "[inclusion]" and "[extension]", which is the scope of application, are the semantic content of the concept.
> Furthermore, the concept of "superordinate" and "subordinate," and
> The distinction between "like concepts" and "species concepts" and so on is also made.
> It depends on the characteristics of the concept as a language.

> Origin of the concept and its role in cognition
> There have been various arguments and positions on such matters since ancient times.
>>→Related Items Extension｜[Category]｜Determination

[" naming by language is nothing but the production of concepts"], so[/villagepump/nishio.icon].
　CNN doesn't produce concepts because it doesn't name them.
　AI can acquire concepts named by humans by learning a set of language and images in a CLIP-like fashion.
