Do you read the source code aloud too?
from [/villagepump/ when reading a book, read aloud in your head].
[/villagepump/nishio.icon]
 I'd like to ask those who have programming experience among those who [read] Japanese [aloud] in their head, do you also read source code aloud?
	 I didn't, and isn't it the same thing in Japanese? I think[/villagepump/nishio.icon].
  Recognizing that reading aloud is "something you dare to do to flow slowly when you want to verify the smoothness of the connections in your writing.
   +1[/villagepump/issac.icon]
  [Typoglycemia https://dic.nicovideo.jp/a/typoglycemia]
 　　I thought this phenomenon happened because I was reading with images instead of following the text properly.
 　　If a surprising number of people are reading aloud, what does that mean?
  　　I rearrange the sentences into the correct ones and then read them aloud[/villagepump/kutsumofu.icon].
    I'm reading aloud without following the words properly, so the middle is missing[/villagepump/takker.icon].
     Don't wait for me to finish reading aloud before moving on to the next sentence.
      I can't keep up [reading aloud in my brain].
     [The parts that are not read aloud are like insect bites and the meaning doesn't come down].
	>I'd like to ask those who have programming experience among those who [read aloud] Japanese in their head, do you also read aloud the source code?
  If you are hand typing a long function, read it aloud to the end[/villagepump/takker.icon].
   Like `getElementsByClassName`.
   The speed of reading aloud is keeping up with the speed of typing.
  If you can write fast with LSP support or something, or if you just want to do code reading, the playback stops when it finishes recognizing and proceeds to the next part[/villagepump/takker.icon][/villagepump/yosider.icon].
 　Maybe this is what Japanese sentences are for.
 　　I've skimmed a lot of the pauses and have a rough understanding.
 　　　Skipped parts are not played back, of course.
 　　On the other hand, I think that's why there are so many misreadings.
 　I feel like I'm reading it aloud except for the symbols[/villagepump/kutsumofu.icon][/villagepump/shoya140.icon].
 　 You didn't read `()` and other symbols completely[/villagepump/takker.icon].
 　 Reading in silence, that seems to be the best way to describe it[/villagepump/takker.icon].
 　  I'm aware of it, but that's the only sound missing.
 　　>I think the symbols are silent and placed in the image.
 　　 This is how it looks like except for the symbols[/villagepump/nishio.icon].
 　　+1[/villagepump/sta.icon]
 　　	`return ctypes.windll.user32.MessageBoxW(0, str(message), str(title), mbtype)`
    This is "Return Sea Tapes, Windy LL, User Thirty Message Boxes Doubl e Zero Store Messages Store Title M B Type."
    	(str reads store to me (more stol-ists?))
    	By the way, the "mbtype" part is "M, type, hmm? ...... Oh, there's a bee, mbtype" I thought to the point of "mbtype".
   	You can skip reading it once you get used to seeing it over and over again.
   		I can interrupt my reading aloud around "Return Sea Tapes" to say "Oh, there it is."
   		Well, I often feel like I understand and end up reading it back aloud. ......
   [/villagepump/nishio.icon] "N" close to "N" > [" silent, I feel like it's being placed in the image].
   	`return ctypes.windll.user32.MessageBoxW(0, str(message), str(title), mbtype)`
				"Mmm. Nm. Nn. Like "Nn, nn, nn, nn, nn".
				　Symbols are also silent
				　Silent but distinguished, so `ctypesWinDllUser32MessageBoxW` makes me feel "hmmm, that's a long one".
				Even if you don't program, you have `"` and other letters that you don't pronounce.