People who frequently use coined words in their communication
from [coined its own term].
Who frequently use [coined words] in communication
 I sometimes see people doing that in communities that deal with philosophy, coining words and using them[/villagepump/biiwachi.icon].
  They use it as a matter of course, but I can't find it when I look it up, and it's very annoying.
  If you ask what it means, the definition is vague or already defined in other words
  Very high context is there, but they don't realize it and don't communicate well
 I wonder if it's a common kind of [playing smart][/villagepump/nishio.icon].
 　Yeah, well, playing smart is a fitting expression[/villagepump/biwachi.icon].
 　　He may be trying to act like a philosopher, though he may not be aware of it.
 　　Maybe I shouldn't be too evil about it, but...
 Playing smart is a [thorny phrase] feeling[/villagepump/inajob.icon].
 	Is it because it sounds like it implies that I'm not smart?
 I see[/villagepump/nishio.icon].
 　That's a phenomenon that's right in line with the [intent to insult] diagram.
 　Implicitly, they think you're not smart enough, which is why they use the nuanced term "not smart enough."
 　I haven't identified the person I'm talking to, and they're not here, but if they were, I'd be "insulted!" again. If they were here, I would be "insulted!
 　It's not good that "not smart" is vaguely derogatory.
 　　Objective if you're "someone who frequently coined terms in your communication."
 　　But that would involve decent mathematicians and philosophers.
 　　Mathematicians define concepts in language, but philosophers don't necessarily.
 　I've given it some thought, but I'm not sure I can identify it.
 　　When you observe a person "speaking with a coined word that you don't quite know the definition of," you don't know if that person is smart or not.
 　　It's not a good idea to say, "You must be trying to look smart," because it's a judgment about another person's inner life, the same kind of thing as, "You must be trying to insult me.
 　　[Don't find malice in being incompetent and sufficiently explained].
 　　　You also called this one "incompetent"...

[" I thought about it a bit, but I might not be able to identify it][/villagepump/nishio.icon].
　Suppose a person A coined a word W to express a certain concept M.
　　I can't determine if A already has a word X that expresses concept M and I just don't know it.
　　So the act of assigning the coined word W to the concept you want to express anyway is not in itself inevitable.
　Suppose a person B asks A what W means and does not understand the explanation. At this time
　　Is it that "A doesn't really know what W means" or that "the concept to which W refers is ambiguous?"
　　I don't understand why B doesn't have the prerequisite knowledge to understand A's explanation.
　　This is not identifiable.
　When some person B thinks that the meaning of W is the same as the existing word X
　　Is the meaning actually the same?
　　I'm not sure if B just doesn't understand the difference now between X and W that A is trying to distinguish.
　　This is not identifiable.
　So nothing on an objective scale of "smart", "dumb", or "playing smart" can be determined from these phenomena.
　　From Mr. B's point of view, Mr. A's statement is unintelligible and unhelpful, so much for the fact
　　It is only an interpretation to think that the cause of the problem lies in A or in B.
　　　Maybe I'll drag out [my habits from when I was a monkey] and want to decide "which one is better".
　　　It is probably better not to try to decide
　　As a subjective measure, for Mr. B, "the probability is high that Mr. A's statement is futile."
　　　Usefulness is not an attribute of the information itself, but of the recipient of the information
　　　　[Beneficial and harmful are attributes of the recipient of the information.]

