Increased skill in using tools leads to a more detailed perception of the world
from [/villagepump/ Improved skill at using tools leads to a more detailed perception of the world].
Increased skill in using tools leads to a more detailed perception of the world (2023-02-12)[/villagepump/nishio.icon].
　(If it doesn't feel different after a while, I'll use this one as the title.)
old title: [新しい扉が開いた]

from [2022/10/31]
[/villagepump/nishio.icon]
 I don't know how to describe it, but I feel like [a new door has opened].
 Until now, my [output of images] has been limited to [illustrations] in black marker on a white background for explanations.
 　モノクロの世界？[/villagepump/issac.icon]
 I had tried [sketching] while looking at the real thing, but I thought, "Why not just use a photograph?
 There were no images in the virtual world of my brain.
 　There was no [non-existent world I wanted to depict].
 　I didn't have the ability to [imagine] the non-existent world in a visual way.
 For a while now, I've been doing the "make an image with [drawing AI] -> judge whether it's good or bad" thing, and it's like "I put water pressure on a pipe that was clogged and it started to flow.
 　I don't know how to say this.
 　When I was not aware and thinking before [I was able to move things that I couldn't move].
 　　I felt similar to when I started playing sports[/villagepump/issac.icon].
 　　　Clearly perceive the presence of previously unrecognized body movements and muscles, and try new ways to move them.
 　　　　This is fun.
 　　　It could be when using a ball, shinai, stick, or other equipment.
 　　　　I think of it as a kind of elongation of one's [physical senses] through the tools.
 　　Indeed. I was doing [draw-in] recently and I was like, "I see, this is [pelvic floor muscles]"[/villagepump/nishio.icon].
 　　 There's something about muscle training that feels like recognizing the existence of muscles first.
 				ある[/villagepump/はるひ.icon][/villagepump/issac.icon]
 					Mr. [Sekihara] told me that you can't train effectively unless you are aware of where on your body you are working out properly.
 					Mr. Sekihara=person
 					Same with running, etc.
 　[If you compare it to a crane game, you used to be able to move the crane only left and right, but then you realized there was a button to move it in the depth direction, and you thought, "If I press this button, the crane will move back and forth! It's like "I can push this button and it moves back and forth!
 何の話なのか凄い気になる[/villagepump/はるひ.icon][/villagepump/inajob.icon][/villagepump/issac.icon][/villagepump/基素.icon]
 　I've done my best to verbalize it, but if that doesn't get the message across, then it's "just sprouting" and I think the only thing to do is to "wait until it grows big."[/villagepump/nishio.icon].
 　It appears to be an XX [increase resolution] phenomenon, but I wasn't sure what XX was. Drawing? [/villagepump/inajob.icon].
 　When I say "increase the resolution," I feel uncomfortable because I imagine a situation where something that was originally dimly visible is now clearly visible[/villagepump/nishio.icon].
 　This one is closer: [/nishio/fog of literacy].
 　It's like something that wasn't visible at all is starting to appear dimly.
 　I have a feeling that the emphasis will be on "[moving]"[/villagepump/issac.icon].
 　I learned that I could move areas I wasn't using.
　　　　　Sensation of moving muscles in muscle training, sports, etc.
　　　　　Likewise, did you know that there is an area of the mind that "imagines images of the virtual world" that we have never been aware of?
 　I got it to work more when I moved it, interesting! like[/villagepump/issac.icon].
 　This is what I expect from [InstaChord] (aside).
 　	　　いい話[/villagepump/nishio.icon][/villagepump/inajob.icon]
 　I think this is pretty close[/villagepump/nishio.icon].
 　	新しい自己表現の獲得かも[/villagepump/issac.icon]
 Just as we were able to [paradigm shift with Scrapbox], maybe we can shift again with drawing AI[/villagepump/sta.icon].
 I want to remember this as [advantage of trying something new][/villagepump/kidooom.icon].

[/villagepump/inajob.icon]
	I first wrote an application that allows you to play chords while studying [music theory].
		After that, he learned [electronics] and made [RakuChord] as a hardware.
		In the process, I realized that playing the piano with both hands (if you play it in a kindergarten teacher way) doesn't seem to be a superb skill.
			I think there was a sense of [a new door opening] in this area.
			I recently found this[/villagepump/basic.icon].
		And [InstaChord] is having fun.
	An example of how learning electronics in the first place opened new doors.
	[There was also the term "aha experience.
		This one is more like a light "awareness"?
	I think I've started to look at plastic products as "something to make" since I bought a [3D printer].
	　I don't have any knowledge of [injection molding] yet, though,

関連
	[nothing to make]
  >[Make hebdomads first]...
  > Can't [determine if it can be made] before starting to make it.
  > So it feels like everything ["requires a certain level of skill"].
  > [" You can't do it out of the blue without making a heck of a lot of stuff.
	[/nishio/fog of literacy].
	[/nishio/ without a hammer, even a nail doesn't look like a nail].

There is a higher level of abstraction and a lower level of abstraction[/villagepump/Haruhi.icon].
	The former is "a new door (opens)" and the latter is its content, which is concerned with [new door opened#63ad9797aff09e00000cdd6c].
		(I'm still curious about the latter.)
	Interpreted again, it's like a GPU in the head that started to move?
		It was about on-board.

The boundaries are becoming clearer and clearer with all the different opinions[/villagepump/nishio.icon].
	⭕️[" I put water pressure on the clogged pipe and it started flowing].
	⭕["perceive the muscles clearly and try new ways of moving them"].
	⭕["Notice that there is a button to move it in the depth direction].
	❌[" increase resolution].
	⭕[" There seems to be an emphasis on "moving it"].
 ❌[" like a GPU in the head?"].
　I don't feel that the performance of anything existing has been improved, but rather that new features have been added.
　　Not 1 became 10, but 0 became 1.
　　Both are increasing in number, so to someone else it might be, "Isn't that an improvement in performance?" to others.
　　But he does not feel that it is an improvement in performance. because he was not aware of it when he was 0, so there is no comparison.
　It has to do with "moving it."
　　Cannot be moved at 0.
　　I'm now at 1 so I can move it.
　　Maybe by moving it, it will increase to 10.

[/villagepump/基素.icon]
 There is a sense in which the skill of illustration does not grow linearly with the amount of practice, but rather in steps in the extreme, and this is something that others have often said
  Various people express it in terms of being able to do that when they become "aware."
  Could it be something close?

[/villagepump/sta.icon]
 As a team member who knows programming and PC/software customization [/villagepump/sta.icon] and not all of it, even in my daily work, I see a significant difference in the way I work and approach my work.
 	I thought [/villagepump/sta.icon] meant that you could see the details because you know them.
 	Knowing tool X, how to use X to process, can we look at it in a target way?
 Maybe if someone had a deep knowledge of murder or the perfect crime, you would see that approach in their work.

[** Observe changes due to [InstaChord]]
	2023-01-03 ~
	[Observed change in cognition with InstaChord].

[** [現象学]]
2023-02-12
	[Introduction to Phenomenology: Toward a New Science and Philosophy of Mind]
		[explain phenomenology to ChatGPT and have him shove it].
			I felt I could explain "a new door opened" with a [Merlo Ponti]-like vocabulary[/villagepump/nishio.icon].
    >Heidegger divided the concept of existence into [thing-like] existence and [instrumental] existence, and considered that [skill] in using instrumental existence [discloses the world].
    >Merleau-Ponty, on the other hand, believed that the movement orientation of the subjective body provides an understanding of the world
    >Heidegger considered tools to be separate from the human body, whereas Merleau-Ponty considered the human body itself to be a tool, and even when artifacts are used as tools, they are subjectively perceived as an extension of the body
		from [新しい扉が開いた#63af0a4eaff09e0000108392]
  	⭕["perceive the muscles clearly and try new ways of moving them"].
  	⭕["Notice that there is a button to move it in the depth direction].
  	❌[" increase resolution].
  	⭕[" There seems to be an emphasis on "moving it"].
　　This is a case where our understanding of the world is being promoted not by "increasing cognitive resolution" but by "improving our skills in using tools."
　　　I wrote "Merleau-Ponty-like vocabulary," but I didn't need to distinguish between Heidegger and Merleau-Ponty on this one.
　　　Can we say "phenomenological vocabulary?" Would that be the opposite, or would Husserl get mixed up and become something different...

2023-02-12
関連
	[real-life example of a process of deepening understanding].
　　This is a description of the process of increasing cognitive resolution in the process of playing the game "Guess my current location by looking at Google Street View"
　　I had the feeling that it was a little different than what we're talking about here.
　　Perhaps it's the difference between "increasing cognitive resolution" and "improving skill in using tools."

2023-02-12
	I too was unable to cut it out for fear of breaking it[/villagepump/nishio.icon].
	 So I backed up to [/nishio/new-door-opened(2023-02-12)].
