Style cut out from the pages you grew up with
from [there is more than one person to cut out at the well].
Style cut out from the pages you grew up with
from [/villagepump/ One of the reasons that the well is working so well is that there seems to be more than one person to cut out].
	Scrapbox has a low [cutout cost] UI[/villagepump/inajob.icon].
	I wondered if [the idea of cutting it out] existed in the first place until I was exposed to Scrapbox[/villagepump/yosider.icon].
	　I think there was if you meant [commonization], but I had never seen a system of links that could be cross-referenced, so maybe the idea never occurred to me[/villagepump/basic.icon].
	From a UI perspective, it is fairly easy to cut out, but figuring out where to cut out is harder than it seems[/villagepump/Mijinko_SD.icon].
		[Difficulty point for page cutout].
	There are roles for [readers, writers, and cutters], and the balance of these is going to change the way Scrapbox projects are done.
	With [one-person projects], if you don't cut it out, no one else will (obviously).
	　[The Bokuchi Project]
	Can this act of cutting out also be [interpreted in divergent and convergent lincography]?
		Feels like a kind of convergent thinking.
	　Sometimes there's additional [convergent thinking] going on, not just cutting it out[/villagepump/nishio.icon].
	　 For example, you can re-combine related topics that are branches of multiple people's diaries into a single page.
		　Now that we have a clearer definition of convergent thinking, we can describe this one with a higher resolution.
		　　Mr. A saw Mr. B's branch and simply wrote something related to it on his own branch, which is simply [continuing the topic].
		　　If Mr. A is writing about a certain topic and he writes, "This seems to involve Mr. B's ~," then this is Mr. A's [convergent move].
		　　If Mr. A wrote something related to Mr. B without realizing it himself, and Mr. C cut those two things out and put them together, then Mr. C is doing a convergent thought move.

