2023-02-14 Organize the top page leads

from [/villagepump/2023/02/13 bon curry].
[/villagepump/nishio.icon]
 After looking at [/villagepump/ first-time Scrapbox project exploration cues], I felt that my project's pinning page was not a "first-time exploration cue" for a first-time visitor.
 　Should I separate pinning for myself and bread balls for my readers?
 　　I typo'd it to "[breadball]", but I felt like that was fine.
 　　In other words, pinning is a metaphor for keeping the task you are working on in a place where you can see it.
 　　Bread balls, on the other hand, are meant to show others the way.
 　　　Image of [Breadcrumb List
 　　I still think we should be separated.
　Think about your own personal project leads.
　　It's still as I wrote it when I first started using it a few years ago.
　　Change the pinning of individuals and the pinning of the general user?
 　There is a fundamental [difference between wanting it to be read and being willing to read it].
 　　There is no need to navigate to [text in a style that is acceptable to read
 　　There are probably some things I'd like you to read.
 　　　Which one?
 　　　I don't think that's very specific...
 　　　Leads you to what you want to read
 　　　　On Twitter or something...
 　　　What do you want people to read when they are not those short-term readers?
 　　　　Hmmm?
 　　#The difference between seeing and wanting to see
　What would you like the top page of your personal project to look like?
　　I've come to the conclusion that I have no idea.
　I felt the difference in experience when I went into the well for a while and then went back to my personal project and kneaded it.
　　I feel it would be beneficial for me to verbalize this.
　　What's the difference?
　　I'm working on more "smaller pages" for my personal project.
　　[/nishio/abstract-we all want to be happy].
　　Write an untitled text in a well journal, and after it gets going, it gets cut out.
　　Cut out the excitement."
　　Implicitly at this point, you're focusing on "the excitement."
	　　As a result, cutouts tend to be larger
	　　Example [coined own term].
	　　Do not delete other people's statements
	　　If you inadvertently erase your own statements, too, you lose the context.
	　　Write and never delete
	　　I think the policy of not erasing information because you never know what information will be useful in the future is basically a good thing, but it's too big a component.
	　　　Too big to be a part, you could say.
	　　Let's chop [coined its own terminology] in your own project to try it out.
	　　　Oh, I get it, what I perceive as "lumpy" is often a single person's statement.
	　　　I'm not comfortable with cutting out just one person's statement from a conversation between several people.
	　　　but not so much.
	　　　　The one that ended up being cut out contained statements from more than one person.
　　There is no such thing as "when it gets going" for personal projects.
　　 (I don't think I can say that either.)
　　So at what point do you cut it out?
　　Is it when you feel a little different from the context in which you are currently placed?
　　A number of small, dense topic pages, moving around with links
　　　Even if [/villagepump/information tenaciously].
　　　On the big page, that's a stand-alone "read."
　　　　Read it and write comments in between.
　　　　This is like [active reading] the writings of Tanish.
　　　　That in itself is beneficial, but it's completely separate from the activities of the gibbon.
　The result was that the coined story was placed in the well, a long story, split to individuals, and the story that opened the door was placed in the well, a long backup to individuals, and a split to the well.
　　I don't know what's going to happen.

from [/villagepump/2023/02/14 keema curry].
[/villagepump/nishio.icon]
 Readers who don't know about Scrapbox don't know what Scrapbox is in the first place.
 Saying "Wiki" doesn't get it across.
...
　Organized the top page leads.
　　I took the plunge and removed all the pages that had been pinned for years.





[/villagepump/bug that tries to extend the game without admitting defeat].

[example of how optimizing for short-term rewards can lead to weakness].
