There's a glass half full of water.
[https://gyazo.com/6740e7576c92a3cdca804b2e6c5227a3]
Different people think differently when they see [a glass of half-filled water].
　A: There is [only] half a glass of water.
 B: There is [half water] in the cup.

I think it's a widely known [metaphor].
 I wonder where this [metaphorical] story first appeared.
 According to [Quote Investigator https://quoteinvestigator.com/2022/04/06/half-full/] it is unknown who was the first, as the earliest one found is anonymous
	 >Quote Investigator: The earliest match found by QI appeared in “The Evening Sun” of Baltimore, Maryland in April 1929. The statement occurred in a filler item without attribution. Boldface added to excerpts by QI:
  >[* If he says his gas tank is half-full he’s an optimist. If he says it’s half-empty he’s a pessimist.]
  (DeepL) If he says he has half a tank of gas, he is an optimist. If he says it is only half full, he is a pessimist.

A metaphor that is easy to visualize
　But the cup dictates 100%.
　The result implicitly leads to a decision that "it is better to aim for 100%" (better to fill the glass with water)
　The idea that "it's good to fill a glass with water" [draws attention to the lack of] action

[Sometimes used in the sense of "knowing enough.
　In this case, the criticism is that [focusing on shortages] may create [a desire to grow], and that if we do not focus on shortages, we will not grow.
　[Gap between ideal and reality].

relevance
	[who notes the lack].
　　This metaphor evolved
　　However, the level of abstraction has increased.
　[Drucker] has something to say about this.
　	>6. Changes in Perception
  > “The glass is half full” and “The glass is half empty” are descriptions of the same phenomenon but have vastly different meanings. Changing a manager’s perception of a glass from half full to half empty opens up big innovation opportunities.
		2002 [https://hbr.org/2002/08/the-discipline-of-innovation The Discipline of Innovation]
		(DeepL) Changing a manager's perception from a glass half full to a glass half empty creates an opportunity for great innovation.
		I say it would be more beneficial to recognize that this is "half empty."
	[two shoe salesman].
[series of drawings in which two people say different things]
