Work to open up the forest of what has yet to be written.
>[https://twitter.com/nishio/status/1627542695060328450?s=20 @nishio]: In a world where huge language models ([LLM]) have been created and we can read more text than homo sapiens can in a lifetime and understand it better than homo sapiens, I've been wondering for a few days what my raison d'etre is. I've been wondering for the past few days what my raison d'etre is in a world where people are reading more text than homo sapiens could ever read in a lifetime and understanding it better than homo sapiens, and I've come to a simple conclusion. I have come to a simple conclusion: "The power to clarify [what has not yet been written].
	[not yet verbalized] / [(6.2.5) not yet verbalized].

>[https://twitter.com/nishio/status/1627543617119346688?s=20 @nishio]: In my life as a software engineer, there have been many times when I said, "I looked at the documentation and it doesn't say that. I figured it out by experimenting with it myself.
>Science is the same, because what Homo sapiens doesn't know yet has not been written, nor do we know the language model.
>[So is] [the application of knowledge].

>[https://twitter.com/nishio/status/1627544336085962753?s=20 @nishio]: It is said in many fields that "doing what is written in books as is" does not work with regard to [application] of knowledge. This is because books are the product of abstraction. When connecting to a concrete system, it is necessary to connect [reconcile] with the knowledge of the concrete system itself, but there are only a few examples of concrete systems in books.
　[Books are already a product of abstraction.]
　[Performing] stage of the [U-Curve Model

>[https://twitter.com/nishio/status/1627545018214006785?s=20 @nishio]: if you don't understand the undocumented "system in front of you," you can't apply your knowledge to it. Whether software systems or human systems, [most systems have only inadequate documentation]. Understanding this cannot be assisted by a language model.

>[https://twitter.com/nishio/status/1627545781447294982?s=20 @nishio]: In other words, the giant language model is a new [highway] that will take us fast through the zone of "[what has already been written]" to the zone of "what has not yet been written It takes us to the [front line] where we are confronted with "what has not yet been written". It is like a forest. So we work to open up the forest of "what has not yet been written.
	[Forest parable]: [Thinking at the edge of the edge].

>[https://twitter.com/nishio/status/1627548193012715522?s=20 @nishio]: There are several variations of how to clear the forest, discovering new scientific facts is one of them. Creating implementations that work and are used in society is one of them, and observing and verbalizing what has not yet been verbalized is another.
>We've all done a little of this before, and the demand for it is only going to increase.
　[Social implementation]
