UK 3-day week experiment
2022-06-06
>[https://twitter.com/marikakatanuma/status/1533798803140055040?s=20 @marikakatanuma]: 3 days off a week, massive trial starts in UK
>70 companies (over 3,000 employees) participated in the six-month trial. They will work 4 days a week with the same salary and study the impact on productivity, employee wellbeing, environment and gender equality.
>[https://www.bloomberg.com/news/articles/2022-06-05/70-companies-begin-trial-of-four-day-week-with-no-loss-of-pay?srnd=premium&sref=chqhSVDW Biggest Four-Day Work Week Trial Begins in UK With 70 Companies Taking Part - Bloomberg]

2023-02-21
>[https://twitter.com/marikakatanuma/status/1627928321739862017?s=20 @marikakatanuma]: almost no companies going back to 2 days off a week
>A large-scale experiment with a three-day workweek in the United Kingdom found that most of the participating companies have a policy of not returning to a two-day workweek. Increased sales, reduced turnover, and lower burnout were the deciding factors ([https://www.bloomberg.co.jp/news/articles/2023-02-21/RQESWET0AFB401 Few companies return to 2-day workweek - world's largest 4-day workweek Results of Work Experiment - Bloomberg])
	>[https://twitter.com/marikakatanuma/status/1627928930702462978?s=20 @marikakatanuma]: Juliette Shore, who led the survey, said, "We thought it would be much harder for companies to make the three-day workweek work We wondered if it would, but the answer seems to be no," she noted.
 >His research has long shown that the two-day workweek no longer fits the lifestyle of the modern employee, especially those with childcare or caregiving responsibilities.
 >[https://twitter.com/marikakatanuma/status/1627929138341498882?s=20 @marikakatanuma]: Of the 2,900 participants, zero said they wanted to stop the 3-day workweek. 15% said they would not go back to a 2-day workweek no matter how much money they were offered. 15% said they would not go back to a 2-day workweek no matter how much money was offered.


UK [3 days off per week] Experimental
