I can't remember what search engine I used before Google, what is it?
from [/villagepump/検索エンジン戦国時代再開？]

[/villagepump/nishio.icon]I can't remember what search engine I used before Google.
[/villagepump/ChatGPT.icon] Unfortunately, we do not have specific information about your previous search engine, so we cannot provide an exact answer. However, I can give you some names of some common search engines.
 Yahoo!
 Bing
 Ask Jeeves
 AOL Search
 Excite
 Lycos
 DuckDuckGo
...
[/villagepump/nishio.icon]2000年ごろの話
[/villagepump/ChatGPT.icon]Around the year 2000, the Internet was still in its infancy and this was before Google became known as a popular search engine. Some of the most commonly used search engines at that time were.
 Yahoo!: It was also well known as a web portal, with a directory-style categorized listing at the top of the search results.
 AltaVista: It was able to search the full text of a page and had advanced features for its time.
 Excite: featured a wide range of content including music, news and entertainment information.
 Lycos: There was a top site ranking function that displayed the ranking of websites, and their ranking determined the priority of search results.
 Ask Jeeves: Natural language search was supported, and users could search as if they were asking a question in the search box.
At that time, Internet search engines could not provide search results based on advanced algorithmic ranking as Google does today, and each used its own search methodology.
[/villagepump/nishio.icon]日本で使ってました
[/villagepump/ChatGPT.icon]Thank you, the most commonly used search engines in Japan in the early 2000s included the following.
 Yahoo! Japan: One of the largest portal sites in Japan, it operates as the Japanese version of Yahoo! It specializes in Japanese-language search and also provides information on Japanese news, weather, and stock market conditions.
 Infoseek: One of the relatively early Japanese search engines, which also supported Japanese-language searches.
 goo: A search engine specializing in Japanese-language searches, goo also provided dictionaries and translation services.
 Excite Japan: The Japanese version of Excite, specializing in Japanese-language searches, was less well-known than Yahoo!
At that time, Google did not yet support Japanese-language searches, so Yahoo! Japan was the most widely used search engine.

I was using Yahoo's [human-powered tree search engine] first, and then [full-text search] was available on Infoseek, which was great, and then [Google search] appeared, and I thought, "The search results are overwhelmingly good," I guess. [/villagepump/nishio.icon].
