Dare to omit detailed information
>[https://twitter.com/shodamiwa/status/1629375077765771264?s=46&t=ZVUh9M3nfNkIv2dyigBgjw @shodamiwa]: "I've been having a lot of anxiety,
>When I consulted with him,
>Now is a good time to make a decision...
>We talked about it."
>Do you know how to write this sentence?

>I think it's love advice.
> I think it is a problem between friends and acquaintances.
> I think it's a matter of work.
> 
> etc. How did you take it?

> The original text is here.
> 
> "Stand up in a row
> (in terms of expenses and living expenses, as appliances become more and more inadequate)
> I have some concerns,
> 
> (To the clerk in the electronics department)
> After consulting with them,
> 
> Now (since we are running a campaign to support new life)
> 
> It's a good time to make a decision (to buy a new one)...
> "That's what we were talking about."

> By deleting "specific information," the reader "adds the missing information as he or she reads. "Is this a relationship advice?" Is it something to do with school? The reader will try to understand by guessing this and that. This means that the reader creates his or her own information.

> When a text contains a certain amount of information, "omitting some of the details" can draw out the reader's "ability to try to understand even if they have to make up for it". In game scenarios, this effect can be used to create a situation in which each user feels that the experience is unique to him or her.

> Take the example of Twitter. If you think, "Tweeting is writing what happened in real life, in real life." If you think that "tweeting is writing what happened in real life," you will not be able to tell the difference between "details you didn't know," "written information," and "information the writer left out. The information that you have added may be pulled in, and you may make a big mistake in reading the tweet.

> When you encounter "something you don't understand. If you get into the habit of "bringing up your familiar information" or "past experiences" and supplementing them to make them easier to understand. This can easily lead to misunderstandings and premature mistakes.

> Back to the story.
> In game scenarios, we can take advantage of this tendency to "make up for missing information as we read along". Therefore, in order to make it easy for people to understand, we can choose to "intentionally omit detailed information"....

> This "[omit]" is difficult, though. Similar to [bonsai], which branches to leave and which to cut. You can add and heap to a certain extent, but the more you subtract, the more aesthetics you need.
> By omitting a good amount of detailed information from daily tweets, how far can we generalize? You can also train yourself. Twitter is also a place to practice.
