Unlike chat, Scrapbox is overgrown.
from [/villagepump/best-well-kept].
　When communicating synchronously in Scrapbox, unlike in chat-like tools, you can go back and reconfigure before
　　Go back up and edit
　　change the top and bottom of a line
　　cut out a page
　I think it's important to be able to go back up[/villagepump/nishio.icon].
　 [https://gyazo.com/3d087288970450c9967fc9f24f7aaf35]
  Chat is "one long vine" when it gets going, but when Scrapbox gets going, it feels "[overgrown]" #even if
  	+1[/villagepump/kentnkmr.icon][/villagepump/yosider.icon]
  	The tool's [UI limits the breadth of thought], interesting[/villagepump/inajob.icon].
  	Even real [houseplants] stop growing when there are restrictions on the flowerpot or space around them...[/villagepump/Mijinko_SD.icon].
  	In the wild plants, they grow by forcing their roots into the rocks[/villagepump/takker.icon].

  When I first saw the picture, I didn't recognize it as "a plant growing out of a flowerpot" and thought it was "a diagram of multiple lines gathered in one place."[/villagepump/issac.icon].
  　[https://gyazo.com/6f4cbd543af26e4f5a4c8217e526dcdf]
　　　https://www.ana.co.jp/ja/jp/international/theme/noritsugi/
　　　↑upThis is how it looks like
　　　　The best of the best from each region will gather for the national competition. ...... Like.
　　　 A page with a lot of [blue links] could be viewed that way[/villagepump/takker.icon].
　　　 　Lots of information is being pulled from the pages of the past, present, and future.
　　　 　Interesting[/villagepump/nishio.icon].
　　　 　　This diagram itself is from inside to outside because I drew it as a direction of development of the flow of the story, but in the actual Scrapbox, "links" like fruits are formed here and there on the growing branches, and they connect with other plants, so it's bidirectional.
　　　 　　The bigger the plant that grows, the more likely the link is to be connected, and the more likely it is to be dug up again, even if buried.
					[blue link] is [convergent move].
