Explanation of Bing AI's Intellectual Productivity for Engineers
Intellectual production techniques for engineers are a way of thinking about how to learn, organize, and output in the course of their work.

Engineers must constantly keep up with new technologies and knowledge, but this requires efficient learning and information management methods.

The following are some of the key points in the intellectual production techniques of engineers.
	Clarify what learning is. Enhance the effectiveness of learning by setting the purpose, level, and evaluation criteria for learning.
	Organize what you learn. Use notes and charts to visualize your understanding and questions to support your memory and thinking.
	Output what you have learned. Communicate in your own words through blogs, presentations, etc. to consolidate knowledge and obtain feedback.

The intellectual production techniques of engineers are skills that can be applied not only to programming, but also to other fields. Find a method that works for you and put it into practice.

Reference:.
	[The Intellectual Production of Engineers Author's official page]
	[Amazon: The Intellectual Production of Engineers - Learn, Organize, and Output Efficiently https://amzn.to/3IWgOou]
	[What is learning? Engineered Thinking and Principles]
	[https://tech-blog.rakus.co.jp/entry/20191004/new-engineer I read & practiced "The Intellectual Production of Engineers" - RAKUS Developers Blog | RAKUS Engineers Blog]

Impressions [nishio.icon].
　The article, "[What is Learning? Engineered Thinking and Principles]" is an article I wrote the year after I wrote this book, at the request of and with college students as the intended audience.
　　The content is certainly relevant, but it never occurred to me to refer to this myself, so I feel it's worth reminding you!
　　[" Clarify what it means to learn. Set the purpose of learning, the level of learning, and the evaluation criteria]]. The description of the "What is learning?" seems to refer to this
　LUX Engineer Blog is an article written by others
　　Certainly, in introducing a book, not only "what the author says about the book" but also "what the reader says about the book" is useful information!
　　It's hard to come up with the idea of referencing this on my own.
　　[" Output what you have learned. Communicate in your own words through blogs, presentations, etc. to consolidate knowledge and get feedback]]. The description in the following is apparently based on this and Amazon
　It is very useful to be reminded of things that are "relevant" about "my book" that I think I know so well, but that I don't recall myself
　　I wrote on p. 213 of The Engineer's Art of Intellectual Production
　　[https://gyazo.com/296876a09fc4a226afd5443197f6ed25]
　　In 2018, when I wrote this, I was considering "borrowing the eyes of others."
　　Now in 2023, AI can do that role. Better than humans because it can be used more easily.
