Consulted with Keichobot on GPT-3.5-Turbo about the development policy of Keichobot on GPT-3.5-Turbo
Conversation logs generated in the process of experiments ([Keichobot on GPT-3.5-Turbo]) to realize [Keichobot], a chatbot that prompts users to verbalize their ideas by asking questions.

summary
　Somehow the project's Next Action was blurry and confusing, so I consulted with him.
　I was asked about the goal of the project and realized that it's the multiple goals that are preventing me from choosing an action.
　As I wrote out the goals and explained the value of each, I was able to narrow down the goals to prioritize: [" Achieve Goal 1 and use it to achieve Goal 3"].
　I noticed that goal 3 is actually two steps.
　Since the current implementation is free and open to the public, we were thinking of extending it, but realized that the new implementation should be closed.

[** AI summary edited by human].
	Current Goals
  Goal 1: Ensure that the Turbo version of Keichobot works with Keichobot's WebUI, which is easy to use from a mobile phone.
  Goal #2: A slightly improved UI for Keichobot that runs raw ChatGPT and eliminates the $20/month payment.
  Goal 3: LlamaIndex to be able to pass reference information to GPT3 and incorporate it into the Turbo version of Keichobot.
	Achieve Goal 1 and use it to achieve Goal 3.
	　Goal 2 is only to save money, so no rush.
	　I realized that Goal 3 is actually two steps: 1.
	　Be able to ask Keichobot for input
	　Keichobot will now generate opinions based on what I have written in the past.
	Keichobot on GPT-3.5-Turbo will charge
	　Targeted and privately available first
　Develop using something that works with API tokens and use it on your own first.
　Invite interested parties to a closed beta.

[** AI summary (recorded as experimental results)].
	Wait for the development policy to be decided.
	Summarize current goals
  Goal 1: Ensure that the Turbo version of Keichobot works with Keichobot's WebUI, which is easy to use from a mobile phone.
  Goal #2: A slightly improved UI for Keichobot that runs raw ChatGPT and eliminates the $20/month payment.
  Goal 3: LlamaIndex to be able to pass reference information to GPT3 and incorporate it into the Turbo version of Keichobot.
	Once Goal 1 is achieved, use it to achieve Goal 3.
	Since charges will be incurred, the system will first be targeted at heavy users and made available privately.
	Develop with something that works with API tokens and invite interested parties to a closed beta.

[** conversation log]
[nisbot.icon] What would you like to see happen in this conversation?
[nishio.icon] Hopefully we can come to a decision on what to do about the next development.
[nisbot.icon] Ask questions to help you have a more concrete vision for your next development.
[nishio.icon] and
[nisbot.icon] Please describe the specific goals you would like to achieve in your next development.
[nishio.icon] I see, you're confused because you have multiple goals. I'll write them all down. Goal 1: If the Turbo version of Keichobot runs on Keichobot's WebUI, which is easy to use from a mobile phone, it will be easier to use than the current situation where it runs on a terminal. Goal 2: If Keichobot's UI can be improved a bit to run raw ChatGPT, I can stop subscribing to ChatGPT Plus. Goal 3: I have successfully used LlamaIndex to pass reference information to GPT3, and I would like to incorporate this into the Turbo version of Keichobot.
[nisbot.icon] Your objectives have become specific goals. Next, let's consider what the value will be if those goals are achieved.
[nishio.icon] Goal 1: Ease of use! Goal 2: No more paying $20/month. Goal 3: Keichobot is great to be able to give my opinion based on my past thoughts!
[nisbot.icon] Thank you. What would each goal be worth to you if achieved?
[nishio.icon] When Goal 1 is oppressed, I can talk to the Turbo version of Keichobot while I walk or bathe, which boosts my thought process a lot. Goal 2 just saves a little money. Goal 3 is the possibility of unknown wonderful things happening.
　(PS: I noticed that I typoed "achievement" as "oppression," but since it also serves as an experimental log, I'll leave it as it is).
[nisbot.icon] Please tell us how the goal you achieved relates to your personal goals.
[nishio.icon] I want to accelerate my own intellectual production with computer assistance, so I thought I would do goal 1 first, then goal 3.
[nisbot.icon] I see that you believe that Keichobot, which is easier to use, will help you organize your thoughts in order to accelerate your own intellectual production. How exactly is it accelerated?
[nishio.icon] As you are doing now, being asked a question and answering it will encourage verbalization. When Goal 1 is achieved, you will be able to do this exchange not in front of the PC, but while taking a walk or taking a bath. When goal 3 is achieved, you will be able to ask Keichobot for his/her opinion when you are stuck in your thoughts, and you will be able to say, "No, this is a little different. There are two stages: "You will be able to ask Keichobot for opinions," and "Keichobot will generate opinions based on what you have written in the past. (notice)
[nisbot.icon] Ok. Then think about how you can accelerate your thinking as goal 1 is achieved.
[nishio.icon] Now that we know how it can be accelerated, we need to figure out how to implement it. Since there will be a charge, we may lose money if it is freely available to everyone as it has been so far.
[nisbot.icon] Perhaps what we need now is to know who is using Keichobot today and what they want.
[nishio.icon] You're right. I see people using it from time to time, but it might be faster to target "myself" as a heavy user first. I've been open to the public so far, so I just thought of it as an extension of that, a blind spot. I was thinking about creating a mechanism to charge users, or having users enter their API tokens, but I like the idea of starting with something that works with my API tokens, and aiming for private use by me. Then we can do a closed beta to anyone who is interested.
[nisbot.icon] Got it.

