I wish AI could manage tasks for me.
Conversation logs generated in the process of experiments ([Keichobot on GPT-3.5-Turbo]) to realize [Keichobot], a chatbot that prompts users to verbalize their ideas by asking questions.

Summary (also made by Turbo)
 Need more information on task list
 Questions to clarify the purpose of the task and questions to define done need to be asked.
 Consider developing a task list management feature that allows users to ask questions using a chatbot.
 Ask users to enter tasks that they need to do but have been putting off because they are not motivated to do them, and ask questions to clarify next actions.

[nisbot.icon] What would you like to see happen in this conversation?
[nishio.icon] I'm vaguely thinking that it would be nice if AI could manage tasks, so it could be more detailed.
[nisbot.icon] If you had an AI to manage tasks, what exactly would you want it to do?
[nishio.icon] I think TODO lists tend to be written with one task per line, and the format makes it difficult to retain enough context to execute the task over time, I want to do something about this.
[nisbot.icon] Okay, since the context of the task is lost in a format like a TODO list, would you consider an AI feature to solve that?
[nishio.icon] It needs to be a compact list for high listability, but detailed information is needed when focusing on a single task. If this detailed information is already written, there should be a view to quickly see it, and if not, we need to help with the language.
[nisbot.icon] Specifically, are you saying that the problem with current task management is that the TODO list lacks detail and context is sometimes lost, and you want to think about AI features that would solve that problem?
[nishio.icon] Yes, break down tasks, decide on next actions, what is the purpose of doing it in the first place, what is the definition of done, etc. A one-line, one-task list is not enough information.
[nisbot.icon] To solve the "one task per line list is not enough information" problem, what features are needed to enable AI to provide more detailed and contextual information, such as breaking down tasks, determining next actions, clarifying objectives, and defining workarounds? What features are needed to enable AI to provide more detailed and contextual information, such as task breakdown, determining next actions, clarifying objectives, and defining workarounds?
[nishio.icon] AI doesn't provide information. It is either in humans or it is not yet, and humans need to find it and put it into words.
[nisbot.icon] As you point out, the AI does not provide the information, but the human needs to find the details and context of the task and put it into words, what questions would be helpful to acquire the necessary information?
[nishio.icon] "What would you like to achieve by doing this?" This is a question that clarifies the purpose of the task. This is a question that defines "done." This is a question that defines done. How is it done? would answer a very distant goal, so it is better to ask about the end of the task.
[nisbot.icon] What is the point of doing this task?
[nishio.icon] The reason why I do this task? It makes me happy to be more productive when I can manage my own tasks more smoothly, and it will be a good contribution to other people in the world when it becomes a system that can be used by others.
[nisbot.icon] What exactly do you want to do to make that task management smoother?
[nishio.icon] It would be nice to have a system that I and others could easily use.
[nisbot.icon] What would you like to make readily available as a system?
[nishio.icon] Maybe a chatbot that asks questions about tasks.
[nisbot.icon] What questions would you like to be able to ask regarding chatbots?
[nishio.icon] I want to give them a task list first and then allow them to ask questions about that task list.
[nisbot.icon] What features would be needed to implement a chatbot that asks questions about a task list?
[nishio.icon] Maybe a task list management function, or if there's an API that has an outliner that chatbots can read and write to, we could let that handle the data retention.
[nisbot.icon] If a chatbot is given the ability to manage a task list, what exactly will it be able to do?
[nishio.icon] Read the taskct and ask questions about it.
[nisbot.icon] What questions should I ask about the content of your task list?
[nishio.icon] You mean how to take the first step? You are certainly not being very specific there. Let's be more specific and assume, for example, that the task list only says "tax return".
[nisbot.icon] What questions should I ask about the task of "filing a tax return"?
[nishio.icon] "How do I complete this?" "You just need to submit it via eTax and you're done."
[nisbot.icon] "Can you tell me what steps I need to take to submit via eTax?"
[nishio.icon] You must open the eTax page and enter the information requested.
[nisbot.icon] "What are the fields regarding the information you are entering?"
[nishio.icon] 収入と支払者情報と経費
[nisbot.icon] What more specific information is needed regarding the "income and payer information and expenses" information mentioned by the user?
[nishio.icon] Hmmm. The question is subtle, but in short, I believe you needed the amount, name, and location for each payer, and I can't remember the details without looking at the eTax site.
[nisbot.icon] "Where on the eTax site can I find the required amount, name and location information for each payer?"
[nishio.icon] I kind of think, "If I press that button around there, it will come up," but I can't explain it clearly. It would be good to make it a next action to confirm that. As a question to the task, ask, "What is the next action?" and if it is unclear, ask peripheral questions until it becomes clear.
[nisbot.icon] If the question is unclear, then the question for the task is, "What is your Next Action?" and if it is unclear, is it better to ask a peripheral question until it is clarified?
[nishio.icon] Not so. First, have the user enter "Tasks that need to be done but have been put off because I haven't had the motivation to do them. Next, ask the user, "What is the next action for this task? Next, ask the user, "What is the next action for this task? Usually, users in such a state do not know what the next action is, so they cannot answer. Then I ask, "Let me know if you think of anything else," and ask other questions to clarify the task. The user comes up with a next action after talking about it, so I say, "Let's do that! and return it to them.
[nisbot.icon] What exactly do you want to do for the "tasks I need to do but haven't had the motivation to do and have been putting off" that the user wants to accomplish?

