Comic = ability to paraphrase
>[https://twitter.com/kazakura_22/status/1631106176921538561?s=20 @kazakura_22]: I think you can paraphrase the communicative ability as "the ability to tell [lies] that are appropriate for the situation". Or "the ability to paraphrase" if lying is a strong enough word.
>I think the idea of emphasizing this is weak for nerds to begin with. In creative writing, honesty is basically rewarded in all its forms, and those who are not inwardly sycophantic are usually not destined for a good fate.

>Because the ideology is weak, the capacity is naturally low. It's low because you have the potential to do it, but you don't exercise it.
> 
> The nerd's excessive preference for lying and very strong emphasis on consistency helps to build narrow and deep relationships, but makes it hard to live in places where shallow and broad relationships and attitudes are required.
> because there are a myriad of different ideas out there.


>[https://twitter.com/hitchi_hiker/status/1631114257642430465?s=20 @hitchi_hiker]: i get it.
>A former friend of mine who was a nerd was this way, he couldn't lie at all and even seemed to take pride in not lying. But he really only told the truth, so the atmosphere was broken and it felt like he was just doing what he wanted.
>I guess it's fine if you are truly in tune with each other's sensibilities, but if you are only moderately acquainted with each other, I wish you would at least lie to fit in with the group.


>[https://twitter.com/kazakura_22/status/1631148696749625354?s=20 @kazakura_22]: no comm = no willingness to lie
>I feel like it's almost possible. It's not that I can't lie, it's that I don't want to.
>"I like blue," to someone who says "I like blue," I don't even say, "Blue is possible, too," but instead say, "Heh! I don't think anything but red is good at all!" something like that.
>I think it's mostly a matter of willingness to lie here when people say otakus are communicative.

>If you have low communicative ability, the first thing that will happen is not a phase of "being disliked" but "being seen as a bother".
> I wonder if there will be a cusp beyond that, and the hating will finally come out even further beyond that.
> 
> People who wonder why they are suddenly disliked and don't recognize the phase of being bothered, it seems.

