Preparing a column about ChatGPT
Purpose: I've been approached to write a column about ChatGPT, and I want to organize my thoughts by talking about it.
Chat log with Keichobot+GPT 2023-03-09 version

impressions
　It was good until about halfway through, when I stopped asking questions because I felt bad about pouring over notes that weren't in a conversational format.
　I'm glad you asked the question about the progress of the merge with the traditional rule-based algorithm and what you see the value in.
　The summary function could not be used because the log was 4857 tokens, slightly over the ChatGPT API token limit of 4096.
　　Manually split and summarized.
　　But if we're getting close to the limit, maybe we could do a "it's time to end this" kind of suggestion.

[*** summarized by AI, refined by Human].

 I see the value in using ChatGPT to give my ideas a clear form.
 The authors created digital stationery, Kozaneba and Keichobot.
 The advent of ChatGPT and AI requires a change in people's mental models.
 　ChatGPT's ability to provide a "different perspective" is beneficial, but many people in the world are disappointed because they expect the "truth".
 next action
 　Organize fragmented notes in Scrapbox
 　Consider the format of information representation by ChatGPT
 Materials are needed to create a sentence
 　Gathering and connecting materials creates a story.
 Writing a column is a means, not an end. The purpose is to express and communicate ideas
 If you write sentences all over the place in Scrapbox, you can rewrite them later with different ideas. In contrast, if you are writing on paper media, once you make a decision, you cannot update it, so you need to consider its long-term value
 Jotting down fragments of information in Scrapbox will lead to future growth.
 　Connections may be discovered by searching the Scrapbox
 　Concrete day-to-day information can be abstracted and connections discovered

[*** summary by AI].

 ChatGPT feels that it is valuable to have a clear formulation of their ideas.
 The author created digital stationery and spoke about Kozaneba and Keichobot.
 The advent of ChatGPT and AI requires a change in people's mental models.
 ChatGPT's ability to provide a "different perspective" is beneficial, but many people in the world are disappointed because they expect the "truth".
 The next action is to compile fragmented notes in Scrapbox and discuss the format of information representation by ChatGPT.
 While answering the question, material is needed to make a statement
 Gathering and connecting materials creates a story.
 Writing a column is a means, not an end. The purpose is to communicate the ideas it expresses.
 You can write sentences all over Scrapbox and rewrite them later when you have another idea. In contrast, with writing, once a decision is made, it cannot be updated, so long-term value needs to be considered
 Write down fragments of information in Scrapbox for future growth
 Searching Scrapbox can abstract concrete day-to-day information and discover connections
 End.

[*** conversation log]

[/nishio/kei.icon]What would you like to see happen in this conversation? (GPT)
[/nishio/human.icon]I've been approached to write a column about ChatGPT, and I'd like to organize my thoughts by talking about it.
[ChatGPT is a type of chatbot that uses artificial intelligence to interact in natural language.
[/nishio/human.icon](ignore
[/nishio/human.icon]First of all, this is quite frankly like being asked to pick up chestnuts from the fire and make a delicious chestnut dish that is different from other chefs, which I think is quite a reckless request.
[/nishio/kei.icon]What exactly did you mean by the expression "picking up chestnuts in the fire" in your story?
[/nishio/human.icon]To put your hand into something that is changing at a tremendous rate right now, and to put what you take out into a paper that will be released in six months or so.
[/nishio/kei.icon]When you heard the word "paper," what did you think of?
[/nishio/human.icon]On a related note, for a while now I've been asking myself, "Is there any point in writing books?" I've been wondering about that.
[/nishio/kei.icon]You asked, "Is there any point in writing books?" What type of writing do you mean by "writing" that you have been struggling with?
[/nishio/human.icon]That's a little vague, I'm thinking that putting the output in a place that is not open access, or trying to express things in a series of one-dimensional sentences, both of which will be outdated.
[/nishio/kei.icon]When you said "enumeration," what did you mean?
[/nishio/human.icon]Expressing information by arranging words is not efficient for humans, as it only became popular because the cost of reproducing information in that format was low for a while after letterpress printing.
[/nishio/kei.icon]When you said "express", what specific form of expression did you mean?
[/nishio/human.icon]In addition to representation by word sequences, there are pictures, illustrations, and sticky notes arranged in two dimensions.
[/nishio/kei.icon]Did you come up with any other ways to "express yourself"?
[/nishio/human.icon]ChatGPT is, in essence, a program doing the part of expressing information according to the user's needs. If I can give a program the network of knowledge to be represented, there is no point in me creating a written representation for human reading myself.
[/nishio/kei.icon]Please tell us how you understand the concept of "expressing".
[/nishio/human.icon]It is possible that by trying to express oneself, one's inner thoughts take on a clearer form. However, the listener in this case does not have to be the reader behind the paper, whose face you cannot see, but it is better to chat with a good friend or use a chatbot that listens to you, as we are doing now.
[/nishio/kei.icon]What is it that you value?
[/nishio/human.icon]I feel that it is valuable to have my ideas take a clear form.
[/nishio/kei.icon]What are the key elements behind the word "express"?
[/nishio/human.icon]In summary.
[/nishio/kei.icon]- ChatGPT is a program that expresses information according to user needs
- There is no point in creating a human-read textual representation if the program is given a network of knowledge to represent.
- I see the value in having my ideas clearly formed.
- The listener does not have to be a faceless reader across the paper, preferring to use a chatbot that listens
- There's nothing to do next.
[/nishio/human.icon]"I don't have anything to do next."[/nishio/human.icon] You're right, so far, the Next Action is unclear. The next action is to have this kind of conversation to generate a lot of seeds of content to write about in the column. Then I will try to finish the column by making it one-dimensional on Kozaneba.
The concept of [/nishio/kei.icon]ChatGPT and programmatic information representation was mentioned.
[/nishio/human.icon]Yeah, that's going to be an important keyword. I have other fragmentary notes of things that might be good to write in the column, so let's talk about them next. Since this column project seems to have more than one person writing a column on a single topic, I think it is necessary to explain the author's background. I think the one that matches this story is the author of "The Intellectual Production of Engineers.
[/nishio/kei.icon]I find it significant that my thoughts take a clear form, so it is desirable that my self-understanding deepens through expression and leads to personal growth.
[/nishio/human.icon]Yeah. Fragmentary notes: implementation, digitization, Kozaneba, Keichobot, no more thought without implementation
[/nishio/kei.icon]Specifically, what actions are important to you regarding "expressing"?
[/nishio/human.icon]So you delved into methodologies to support the "expressive" acts of writing and lecturing, and created "digital stationery" because you thought the existing tools were insufficient!
[/nishio/kei.icon]It is important to clarify what exactly "expressing" means and to delve into methodologies that support this act.
[/nishio/human.icon]Ah, a clarification of "expressing." Kozaneba is a system that supports the creation of a larger story by connecting fragmented thoughts together in the electronic form of KJ directions and the Kozane method. Keichobot, on the other hand, is a system that encourages verbalization by having a chatbot ask questions about what is in the mind that has not yet been verbalized
[/nishio/kei.icon]When you think about the concept and methodology of what you represent, what specifically do you think will be important?
[/nishio/human.icon]Maybe it's just getting used to using it and becoming a transparent tool.
[/nishio/kei.icon]Would you say that the concept of "clarification" is important to the concept of "representation"?
[/nishio/human.icon]Yeah
[/nishio/kei.icon]Kozaneba is a system that supports the creation of a larger story by connecting fragmented thoughts in the electronic form of KJ directions and the Kozane method, but what specific functions does it have?
[/nishio/human.icon]KJ direction is a typo, KJ method. Also, Kozaneba is off-topic for the subject of this column, so I think it would make the cut even if it were inflated. keichobot was rule-based until just a few days ago, but has been very empowered by ChatGPT.
[/nishio/kei.icon]What other specific features do you have in mind for Kozaneba?
[/nishio/human.icon]👎Kozaneba
[/nishio/kei.icon]"Keichobot," enhanced by ChatGPT from rule-based chatbots, is a system that facilitates verbalization.
[/nishio/human.icon]Yes. And a few fragmentary notes related to that: Meta released LLaMa, 2/24, which is more powerful than GPT3 even if the model size is 1/10; OpenAI released its ChatGPT API, 3/1, which costs 1/10; 3/4, I was approached for a column; 3/24, I was asked to write a column; and 3/4, I was asked to write a column. It's like pulling chestnuts out of a burning fire and asking them to make a chestnut dish that won't be covered by other cooks.
[/nishio/kei.icon]Is there anything else related to "ChatGPT"?
[/nishio/human.icon]Fragmentary note: LLM, the new electronic calculator, Prolog, Most computer users do not understand how the computer in front of them is performing calculations and how to obtain useful results for themselves.
[/nishio/kei.icon]Since the word "memo" has a background, what specific memo are you referring to?
[/nishio/human.icon]I recorded what came to my mind when I heard about the column.
[/nishio/kei.icon]What exactly do you mean by "columns" in your note?
[/nishio/human.icon]Project on ChatGPT. continued: Command Prompt
　Scary black screen.
　Copy and paste a one-line command as is, or change the parameters.
　Writing Shell Scripts
[/nishio/kei.icon]"ChatGPT" is a dialogue system using artificial intelligence and I know about it based on information from you.
[/nishio/human.icon]Jiro Kawakita
　All data is false.

Denovo
Point out AI mistakes.
People who want to feel superior to homo sapiens.
People who want to gain knowledge, make judgments, and be kind.
I want a point of view.

Drucker.
Knowledge must be proven by action.
Action and Verification
Cycle of Learning from Actions How to Turn Fast
PDCA Cycle.
lean
[ChatGPT is online. But judging from the context of the question and the "project on ChatGPT", I assume you are talking about what you do with the tool, ChatGPT, is that correct?
[/nishio/human.icon]There you go. Now I am trying to pour over the fragmented notes.
[/nishio/kei.icon]Do you have questions about the information you wrote down, like "Jiro Kawakita", "de novo" or "Drucker"?
[/nishio/human.icon]Not available now. Continued, Scrapbox and ChatGPT. this memo is about not knowing what is the appropriate format of information representation that should be fed to ChatGPT, but Scrapbox is close to the right answer.
[/nishio/kei.icon]"ChatGPT" is a dialogue system using artificial intelligence developed by OpenAI.
[/nishio/human.icon]Scrapbox can make associations indelible by writing links, Memex-like. Also, bulleted items may be better passed on to ChatGPT. This was pointed out by Mr. Aoyama.
[/nishio/kei.icon] "ChatGPT" exists online.
[/nishio/human.icon]That's a wrap. Question.
[/nishio/kei.icon]What exactly do you think is needed regarding "ChatGPT" in your opinion?
[/nishio/human.icon]Hmmm, what do we need? I think the human side needs to learn how to deal with this new existence. A change in mental models.
[/nishio/kei.icon]In response to "ChatGPT," I feel that humans need to learn how to deal with this new entity, so there needs to be a change of mindset on the human side.
[/nishio/human.icon]In summary.
[/nishio/kei.icon]- I was approached to write a column about ChatGPT.
- ChatGPT sees the value in expressing information in a way that is tailored to the user's needs, so that his or her ideas can take a clear form.
- We created "digital stationery" to support the expressive acts of writing books and giving lectures.
- Keichobot is now more powerful with ChatGPT.
- The emergence of new technologies and systems requires changes in human mental models.
- Q: With the advent of ChatGPT and AI, what are the lessons people need to learn?
[/nishio/human.icon]It's Jiro Kawakita's "All data is a lie." People expect AI to give them the right answer and are disappointed when it doesn't. Expecting such a thing is not right in the first place.
[/nishio/kei.icon]"What did you notice about what Jiro Kawakita said about 'all data is a lie' and what you said about expectations and disappointments?"
[/nishio/human.icon]Jiro Kawakita thought it was important to gather information from different perspectives to make a decision because everything has the potential for error. I find ChatGPT's ability to provide "different points of view" beneficial. However, I thought it was funny that there are many people in the world who expect the ability to provide "truth" and are disappointed because it is actually not there!
[/nishio/kei.icon]Its "ChatGPT" is a dialogue system that uses artificial intelligence to express information according to user needs.
[/nishio/human.icon]Ask a question.
[/nishio/kei.icon] "ChatGPT" claims to be one of the most useful tools for drawing conclusions by providing people's opinions and perspectives.
[/nishio/human.icon]Yes. Question.
[/nishio/kei.icon]What more specifically do you want to deal with in terms of the "columns" you would like to write?
[/nishio/human.icon]By outputting it in this way and then carving it into fragments and kozaneba, a story is born from within that network of fragments.
[/nishio/kei.icon]It refers to taking a thought or idea that you have taken in fragments and expressing it in a tangible form. This is how stories and the big picture are created.
[/nishio/human.icon](You're getting a bit dim...
[/nishio/human.icon]Ask a question.
[/nishio/kei.icon]How did your talk about "columns" come about as a result of your exposure to this concept of "columns"?
[/nishio/human.icon]That's an abstract and difficult question. Let's see, how did it arise as a result of contact? I was approached to write a column, which means that here the demand for a language for a specific situation was clarified. In response to this demand, fragments of information bubble up from my brain. Some of them are in the form of sentences, while others are still in the form of fragments. After writing this down, it would normally be structured directly in Kozaneba, but since this column is about ChatGPT and I had just improved Keichobot using the ChatGPT API, I thought I'd put it in Keichobot. I haven't checked now, but this chat log must contain information that was not in the original memo, and these were created by the "put it in Keichobot" approach to contact
[/nishio/kei.icon]The "column" is a clarification of the demand for language and fragmentary information that emerged as a result of being approached, and since this column is about ChatGPT, it can be said that the main content deals with ChatGPT as a keyword.
[/nishio/human.icon]Yeah. Question.
[/nishio/kei.icon]Keichobot has been improved using the ChatGPT API and may be useful for verbalizing fragmented information, but we have not heard any other details about specific features or usage.
[/nishio/human.icon]That seems off-topic for this column, but right now this conversation is being exchanged on a smartphone while walking along a riverside boardwalk.
[/nishio/kei.icon]That "column" has not yet been written.
[/nishio/human.icon]Yes. First, you must gather material. If you start writing without that, it will be more laborious to write while creating fragments that satisfy the demand of a very narrow view of "how to write the rest of the story.
[/nishio/kei.icon]Please tell us more about what kind of materials you use.
[/nishio/human.icon]These are the ingredients that make up a story. It is the connections between them that create the story. Those who start writing without preparing the materials will suffer from twisting the materials that lead to the tip of the story they have written. Instead, they first gather the material, connect what connects to create a network, and then decide what path to follow it!
[/nishio/kei.icon]We are still in the process of writing. We are in the process of gathering material and creating a story.
[/nishio/human.icon]Yeah. Question.
[/nishio/kei.icon] "Keichobot" is the name of the Chatbot referred to in the text and not a specific location.
[/nishio/human.icon]Hmmm, well, it exists because it is offered as an online service. But it's still a closed beta, so readers don't have access to it.
[/nishio/kei.icon]Keichobot is not a specific location, but rather an online chatbot that uses the ChatGPT API.
[/nishio/human.icon]Yes. Question.
[/nishio/kei.icon]These "memos" are bubbles of information that emerged from the author's own mind in response to the specific situation of being approached for the column, and some of these memos have taken shape as text, while others are still in fragmentary form That is to say that there are.
[/nishio/human.icon]Yes. Summary.
[ChatGPT is a language-generating AI, while "expressing" means communicating ideas and thoughts using words and diagrams. ChatGPT can be used to efficiently verbalize ideas, but it is only one way to "express" a concept.
[/nishio/human.icon]Right. Question.
[/nishio/kei.icon]The term "form" refers to the state of the information you have written down, which includes both information in the form of sentences and information that is still in the form of fragments.
[/nishio/human.icon]That's another interesting point of view. What is "form"? When it is in my head, I feel that it is not a form. That is because it cannot be communicated. If it is written down in the form of fragments, it can be communicated. However, it is difficult to convey what you want to say to others. It is easier to convey what you want to say when it is in the form of a sentence. But it is still not enough to release it in the form of a column. As I write this, I realize that the "column" form is just a request that happened to be made this time, but it is not the only goal. Usually, I tend to take the form of "implementation. This leads me to "No thought without implementation.
[/nishio/kei.icon]This is a form of writing in which several people write about the same subject, and it is one way to express your ideas.
[/nishio/human.icon]Yes, the goal is to express the ideas you want to express within the constraints of writing on that theme, and writing a column is a means, not an end. That reminds me, I was going to mention Mr. Qualia if possible, now I remember.
[/nishio/kei.icon]It is a relationship in which the act of "expressing" is a means directed toward the goal of writing a column.
[/nishio/human.icon]Correct. Things are not dichotomized into ends and means, but a network of chained arrows.
[/nishio/kei.icon]It is a complex set of connections that link related concepts, ideas, and information.
[/nishio/human.icon]Yes, so from that layered perspective, a project that aims to achieve an objective and writing that creates a story are actually the same structure!
[/nishio/kei.icon]What do you consider important when you write?
[/nishio/human.icon]I see, that is indeed an important question. Usually when I am writing all over Scrapbox, I aim to give prompt shape to my work, and preparing fragments is rare. And yet, when it comes to writing this column, I am preparing in the same way that I prepare for writing a book or preparing for a lecture. So the mode of mind is clearly switching, and why is that? That's duration. Scrapbox can be written messily first, and then rewritten later as other ideas arise. On the other hand, this type of writing is fixed at some point and cannot be updated. So I want it to be something that retains value over the long term. I mean, what I think is important is that it's something that has long-term value at the time of the deadline.
[/nishio/kei.icon]The relationship between "fragments" and "columns" is considered to be complementary, where "fragments" are collected as story material necessary to produce a column, and stories are created by connecting them together.
[/nishio/human.icon]Complementary? Well, in a way it's complementary: there's a column project that asks me to write something about ChatGPT, so many fragments are produced like filling holes, then the fragments are connected to make something with a few more holes, then fragments are produced to fill the remaining holes, and when the two meet, it's complete. And when the two meet, it is complete.
[/nishio/kei.icon]ChatGPT and columns are different, but does that mean ChatGPT may be addressed in columns?
[/nishio/human.icon]Yeah.
[/nishio/kei.icon]Regarding "fragments", is there any way to consciously contribute to their growth?
[/nishio/human.icon]If Keichobot asks a question of a fragment, the answer to that question is the growth of the fragment. If a human were to do it, he or she could ask the words contained in the fragment, "What is this? Or you can show it to others and ask for their reactions.
[/nishio/kei.icon] "Fragments" can be found in Scrapbox and Keichobot.
I like to search [/nishio/human.icon]Scrapbox.
[/nishio/kei.icon]Fragments occur in the brain.
[/nishio/human.icon]Writing down the fragments that occur in the brain in Scrapbox will lead to future growth.
[/nishio/kei.icon]What kind of ideas and information material are you referring to?
[/nishio/human.icon]When concrete daily information is placed in a slightly abstracted form, connections are discovered by Scrapbox by matching the abstracted form of that day's concrete information on another day.
[/nishio/kei.icon]Scrapbox is an online notebook-like tool that allows users to freely write their ideas, notes, and information.
[/nishio/human.icon](It's time to end this.

https://keicho.netlify.app/#talk=qgH109XI35izobowjS83
#KeichobotLog
