Knowledge is difficult to enclose.
Title is tentative.
	When I was experimenting with connecting ChatGPT and Scrapbox, I found a 12 year old diary of mine as information related to my interests, so I went back and read it and cut out what seemed relevant.


	Knowledge is difficult to [enclose].
	　Since it is stored in the mind of an employed individual, it can easily leak out of the company when that person changes jobs, for example.
	　In such times, "what we developed in-house" is not necessarily the best thing.
	　In some cases, it may be better in terms of performance and cost-effectiveness to use a product made by another company.
	　In some cases, it is cheaper to outsource to others who specialize in mass production than to make everything in-house, for example, due to the effects of mass production.
	　So it is important to [outsource] for those areas.
	　However, outsourcing that part of the work to an external company means that competitors can also outsource that work, and there is no [differentiation].
	　Outsourcing is necessary, but it is the opposite of differentiation and causes loss of [competitive advantage]. This is the [outsourcing dilemma]. What should we do?
	The "Division of Knowledge" Perspective
	　Who has which knowledge and how much?
	　How is knowledge created and managed?
	　How much knowledge should we have?
 In considering the effective use of external results, we should not look only to the outside world.
 　Internal capabilities require management of knowledge from a broad, long-term, and comprehensive perspective, especially for novel innovations.
 In Porter's theory of competitive strategy in the U.S. in the late 19th century, suppliers of parts through the marketplace and other sources were both bargaining partners and enemies.
 　On the other hand, the Japanese auto industry has established personal and long-term cooperative relationships with subcontracted parts factories.
 　In the 1985-90 survey, 60% of Japanese companies used approved drawings (the subcontractor designs and the upstream approves it), while 81% of American companies used loaned drawings (the upstream makes the design and the subcontractor borrows it to build accordingly).
 　Japan's 4-5 month advantage in development lead time is due to the division of labor (Clark and Fujimoto 1991).
 For automakers, component knowledge is similar to Cohen and Levinthal's (1990) "[absorptive capacity].
 　This refers to the ability to accurately and quickly understand new technologies as they emerge and utilize them for commercialization.
 　By conducting basic research themselves, companies can increase this absorptive capacity, although they will not benefit from it in the short term or directly. This capacity plays an important role when major changes occur.

ref
	[OPEN INNOVATION]-All about Harvard Style Innovation Strategies
	[Division of Labor and Competition - Outsourcing Management for Competitive Advantage

from [Hatena2011-05-04]
