What is concept engineering?
>>>> What is concept engineering?
>Engineering the design of concepts. A related field is conceptual engineering.
> `[engineering concepts] [engineering concepts] [2023/1/24 Mythic Structure to Full Understanding of Sphere Theory] [engineering required in early startup phase] [prompt engineering concepts] [happy to know the name already attached to the concept] [domain driven development] [ I think you have to have so much free time and love it so much that you can melt your time infinitely to become an engineer] [explanation for people who are good at structural thinking, not comfortable with "management is an art"] [explanation for people who are good at structural thinking]`

What would you like to see happen by linking >>>> concepts to engineer?
> By engineering concepts, it is possible to "feel meta" and communicate with people in different fields. It also has the potential to create a variety of expressions by combining simple atoms.
> `[Engineering the concept] [2023/1/24 Mythological structure to complete understanding of sphere theory] [Engineering the concept] [I think you have to have enough free time to melt time infinitely and love it to become an engineer] [Prompt engineering concept] [Required in early startup phase [The proposition of solving social problems with information science] [Why it makes sense to do a cryptoconference side event if you're going to take a position:]`

>>>> If you can make others "feel meta," why are you able to communicate with people from different fields?
>Shared metacognition makes it easier to communicate with people in different domains because they understand how they perceive and have a common framework. In addition, because metacognition is highly abstract and versatile, it can be applied in different domains.
>`[Enlightenment Unrewarded] [Metacognition] [Now is the time to review 10x habits with science fiction ideas (with introduction of concrete examples)] [Gals/Yankees who can metacognize] [Coaching is to make people metacognize] [2023/1/29 Development of means of communication from the perspective of synchrony. KINETO memo] [Recognizing the unrecognized] [Schizophrenia is a human process]`
	[Metacognition]

