Clean Language as a Board Game

I've been using the ChatGPT version of Keichobot for a while now, so I haven't used the original version in a while.
ã€€Result: The idea of "Clean Language as a Board Game" was born.

summary
 I'm interested in chatbots with clean language.
		At first I saw the value in clean language.
		I saw the value in digitizing it and making it available at any time, so I created Keichobot.
		Tried to port Keichobot because I saw value in ChatGPT's language capabilities, but currently I don't see much value in it.
		I see value in the summary function.
 The varied behavior of ChatGPT has the disadvantage of making it difficult to enforce the rules.
 Clean language is a conversation with limited options, which is different from free conversation
 ã€€More like a board game than a free conversation.
 Need to prototype and test play "Clean Language as a Board Game."
 Once "Clean Language as a Board Game" is complete, the potential for good use of Keichobot could expand.
Next action: prototype and test play "Clean Language as a Board Game".

[*** digest by AI]
 I am interested in a chatbot using clean language to replace Keichobot.
 Variety of questions can have disadvantages that make it difficult to get people to follow the rules.
 Clean language is like a limited choice, different from a totally free conversation
 Need to prototype and test play a clean language as a board game.
 Once the clean language as a board game is completed, the good use of Keichobot could be expanded.
Next action: prototype clean language and test play.

[*** log]
[/nishio/kei.icon]What would you like to see happen in this conversation?
[/nishio/human.icon]I've been using the ChatGPT version of Keichobot for a while recently, so I haven't used the original version in a while.
[/nishio/kei.icon]What kind of "[Keichobot]" is that "[Keichobot]"?
[/nishio/human.icon]Rule-based decision making without ChatGPT
[/nishio/kei.icon]What kind of "[ChatGPT]" is that "[ChatGPT]"?
[/nishio/human.icon]I'm using a huge language model with varied output, but it's hard to get them to follow the rules.
[/nishio/kei.icon]What "variation" is that "variation"?
[/nishio/human.icon]Question variations. To begin with, Clean Language uses "20 questions" or "5 basic questions", so variations of question sentences may not be so important
[/nishio/kei.icon]Anything else about that "variation"?
[/nishio/human.icon]Perhaps the richness of variation is a disadvantage that conversely makes it easier to make statements that deviate from the rules.
[/nishio/kei.icon]How do you know what the "variations" are?
[/nishio/human.icon]It's in the Clean Language book.
[/nishio/kei.icon]What kind of "clean language" is that "[clean language]"?
[/nishio/human.icon]Clarify the user's mental landscape by asking questions that are difficult to distort.
[/nishio/kei.icon]
 > The richness of variation may conversely be a disadvantage that makes it easier to make statements that deviate from the rules.
 What do these "variations" look like?
[/nishio/human.icon]I thought it sounded like a chat statement, but I may have actually been mistaken. I don't think this is a conversation, but more like a "limited choice" like a hand of cards in a card game or worker placement in a board game.
[/nishio/kei.icon]
 > The richness of variation may conversely be a disadvantage that makes it easier to make statements that deviate from the rules.
 Where are these "variations"?
[/nishio/human.icon]It is important to be human scrutinized and limited
[/nishio/kei.icon]
 > The richness of variation may conversely be a disadvantage that makes it easier to make statements that deviate from the rules.
 Where are these "variations"?
[/nishio/human.icon]ðŸ™
[/nishio/kei.icon]
 > It's in the Clean Language book.
 Is there anything else you can tell us about this "clean language"?
[ChatGPT version does not do clean language well, and one of the good points that we explored was the ability to summarize, especially putting the main points in Next Action, which seems to have had a different and better effect than clean language.
[/nishio/kei.icon]What do you value?
[/nishio/human.icon]At first I felt the value of clean language, and I felt the value of making it electronic and always available, so I created Keichobot I felt the value of ChatGPT's language capabilities, so I tried to port Keichobot, but currently it is I don't see much value in it at the moment. I feel the summary function is valuable.
[/nishio/kei.icon]What is the relationship between that "ChatGPT" and "Clean Language"?
[/nishio/human.icon]In summary.
[/nishio/kei.icon]
 > I created Keichobot because I initially saw value in clean language, and I saw value in making it available electronically at all times; I saw value in ChatGPT's language capabilities, so I tried to port Keichobot, but currently I don't see much value in it; I see value in the ability to summarize, but I don't see much value in the ability to summarize. I feel the summary function is valuable.
 What does this "clean language" look like?
[/nishio/human.icon]ChatGPT and Clean Language, the two are incompatible. Because Clean Language is like a cooperative board game, not a natural conversation.
[/nishio/kei.icon]Is that "ChatGPT" the same as "Clean Language"? Is it different?
[/nishio/human.icon]It seems more beneficial to think of them as completely different.
[/nishio/kei.icon]
 > ChatGPT and Clean Language, the two are incompatible. Because Clean Language is like a cooperative board game, not a natural conversation.
 Where is this "clean language"?
[/nishio/human.icon]Clean Language as a board game is something I just came up with, so it's not anywhere in the world yet.
[/nishio/kei.icon]Where is that "clean language"?
[/nishio/human.icon]I have this vaguely in my head, it would be good to clarify it and get it out of my head
[/nishio/kei.icon]
 > Clean Language as a board game is something I just came up with, so it's not anywhere in the world yet.
 What do you hope will happen regarding this "clean language"?
[/nishio/human.icon]Maybe when we can play Clean Language as a board game, people will understand better how to use this Keichobot well!
[/nishio/kei.icon]What needs to happen to "clean language" for that to happen?
[/nishio/human.icon]Clean language as a board game needs to be verbalized
[/nishio/kei.icon]With regard to "clean language", can it?
[/nishio/human.icon]I think it's a challenging assignment.
[/nishio/kei.icon]
 > Clean language as a board game needs to be verbalized
 How do you know this "clean language"?
[/nishio/human.icon]We have to repeat the process of making small prototypes and test-playing them.
[/nishio/kei.icon]
 > Clean language as a board game needs to be verbalized
 Where does this "clean language" come from?


https://keicho.netlify.app/#talk=XMZpJnByOa9qNk0vOBqU
#KeichobotLog
