GPT4勉強会
After the fun GPT4 playing party on Discord broke up, I looked on Facebook and saw a post that said "GPT4 is hyped up to be great, but it's not good at all," and I felt like "ahhh" because it was a bad prompt to see.
If you don't learn how to use any tool, you can't use it well and it won't add value. ([Tweet https://twitter.com/nishio/status/1636043893354668033?s=20])

There are people who try a lot of things and only post what works on Twitter, and then there are people who see it and spread the word that they can do this without trying it themselves, and the composition tends to be excessive expectations. That does not mean that zero expectations are correct. We need to learn the right expectations and how to use them to create them.

There was a meeting where 2-4 people who are paying for ChatGPT were sharing multiple screens at the same time on Discord, and a dozen or so people were watching and chatting with each other. It was a very good knowledge exchange!

>([GPT-4])>>> Explain simply in Japanese.
>After a fun GPT4 event in Discord, there was a Facebook post that said "GPT4 is no good". It was poorly used. You can't use a tool well if you don't learn how to use it correctly, and many people feel "wow" when they see examples of successful use on Twitter, but expectations should be held appropriately. At the Discord event, we all shared our successes and failures and had a good knowledge exchange.
　Ah, I see, the second tweet is wordy and hard to understand.
　Some people try a lot and only post what works on Twitter.
　This is not sharing failures, only successes.
　People who don't try it for themselves misperceive the probability of success as high.
　Many people spread information in a misguided way and have excessive expectations.
　It's not correct to have excessive expectations without using it, and it's not correct to use it in a messy way and have bad results and underestimate expectations (Tweet 1).
　We need to learn the proper expectations and how to use them to create them.
　A concrete example of how to learn this is (Tweet 3)

関連
https://twitter.com/rootport/status/1635135000575352832?s=20
>"The trick to mastering ChatGPT is to be a "[good boss]". If you give [crude instructions], you'll get [misguided answers]. Give [precise instructions], and you'll be a very competent [assistant]."
> "In other words, my boss saying ChatGPT is stupid and useless..."
> 
> I was so scared that I cried when I heard the conversation.
