Stationary nomads
When [nishio.icon][Yoichi Ochiai] says "[nomad] who [is] settled," what does he mean?
[gpt.icon]Yoichi Ochiai is a Japanese researcher, author, and futurist designer. When he uses the term "stationary nomad," he is referring to the way we work and live in today's information society. The "stationary nomads" he refers to are modern people who are not bound to a physical location, but can work using the Internet and digital technology.
 This is different from the traditional nomadic lifestyle that required physical mobility, but similar in that it allows people to share information, knowledge, and skills, access global networks, and work in different locations. In other words, the term "sedentary nomad" is used to describe modern people who are physically sedentary but can move freely in the digital space, working and participating in different communities and projects.

When [nishio.icon][Nam June Paik] says "sedentary nomads", what does he mean?
[gpt.icon]Nam June Paik is a pioneer in media art from South Korea and is widely known as a pioneer in video art. When he uses the term "sedentary nomad," he can refer to artists and people who use technology and media to cross physical, cultural, and ideological boundaries.
 Nam June Paik believed that art and information could be shared across borders using media such as television, video, and the Internet, allowing people to come into contact and interact with different cultures and ideas. His term "sedentary nomads" could refer to modern people who are settled in a physical location but can be exposed to and influenced by different cultures and ideas from around the world through technology and media.
 From this perspective, the term "sedentary nomad" can be interpreted as referring to contemporary people who do not require physical mobility but are mentally free to move through technology and media, participating in various communities and projects while engaging in cultural and ideological exchange.

[nishio.icon]How are these two ideologies related?
[gpt.icon]Yoichi Ochiai and Nam June Paik work in different fields, but their ideas have one thing in common. Both focus on the impact of technology and media on the way people live, work, and interact culturally and ideologically.
 Yoichi Ochiai calls modern people who work with digital technology "sedentary nomads. He points out that the Internet and digital technology have transformed the way people work and their lifestyles, enabling them to work without being tied to a physical location. In his view, modern people are settled in a physical location but can move freely through digital space, working in different communities and projects.
 Nam June Paik, on the other hand, notes that technology and media facilitate the sharing of art and information across borders and cultural barriers. He may refer to contemporary people as "sedentary nomads" who are settled in a physical location but can be exposed to and influenced by a variety of cultures and ideas from around the world through technology and media.
 Their philosophies are related in that they are both concerned with the impact of digital technology on the way people live and work, as well as on cultural and ideological exchange. They suggest the importance of technology and media in contemporary society through the concept of "stationary nomads" who are not bound to a physical location, but can move freely in digital space and participate in different communities and projects.

[nishio.icon]Yasukazu Nishio made the following statement after seeing Yoichi Ochiai's remarks. How is this relevant?
>I was wondering what the heck I'm going to do for a living in a few years when this happens to LLM, but then I saw this tweet and realized. The implicit assumption is that "what to do" is uniquely determined, much like a sedentary agrarian thinking "where to live." So that implicit assumption doesn't hold true for nomads.
[gpt.icon]
 Yasukazu Nishio is a Japanese writer and critic. His remarks relate to Yoichi Ochiai's concept of the "sedentary nomad." In thinking about how to work and live in the future, Yasukazu Nishio noticed that there is an implicit assumption that there is a uniquely determined answer to the question, "What will I do for a living? He notes that this assumption is not applicable to nomads.
 The "sedentary agrarians" he refers to are assumed to live in a fixed location and engage in a specific job or occupation. The "sedentary nomad," however, refers to the modern person who is settled in a physical location but can move freely in digital space, working in different communities and projects.
 From this perspective, the assumption that there is a uniquely determined answer to the question of "what to do for a living" is not applicable to nomadic ways of working and living. In other words, Yasukazu Nishio suggests that modern ways of working and living require flexible and diverse ways of working that are not tied to fixed jobs or occupations. This idea is related to Yoichi Ochiai's concept of "sedentary nomadism.

It seems to be related to the concept of [nishio.icon][parallel work].
[gpt.icon]Yes, that's right. Parallel work" refers to a way of working that involves performing multiple jobs or projects at the same time. This way of working is characterized by flexibility and diversity, unlike the traditional way of working, which is dedicated to one full-time job.
 The concepts of "sedentary nomad" and "parallel work" have something in common. Both target people today who are not tied to a physical location, but are free to move around in digital space, participating in different communities and projects. Parallel work is also related to the concept of sedentary nomadism in that it allows people to work on multiple jobs and projects at the same time, thus not being tied to a single job or occupation, but rather being able to utilize their skills in a variety of fields.
 In other words, parallel work is one concrete example of a sedentary nomadic way of working and living. Parallel work is expected to become increasingly important in today's society, which demands flexible and diverse work styles.

[nishio.icon]Nakayama Tokoroten commented, "The image in my mind was [Paul Erdesch]. How is this relevant?
[gpt.icon]Nakayama Tokoroten commented that his inner image was Paul Erdesch because he felt empathy and resonance with the way Paul Erdesch, a mathematician, worked and lived. Paul Erdesch was a Hungarian-born mathematician whose collaborative and international way of working was unique. Erdesch traveled the world, collaborated with many mathematicians, and made achievements in many different areas of mathematics.
	What is relevant here is the concept of flexible and diverse ways of working and living, such as "sedentary nomadism" and "parallel work. Paul Erdesch's way of working is close to the spirit of "sedentary nomadism" in that he is not bound to a physical location and collaborates with a variety of people to conduct research. His accomplishments in various fields of mathematics are also in keeping with the idea of parallel work.
	The fact that Nakayama Tokoten cites Paul Erdesch suggests that he, too, is oriented toward working without being tied to a physical location, while being involved in different fields and projects. This way of working and living is considered increasingly important in today's society and is associated with concepts such as "sedentary nomadism" and "parallel work.

#GPT-4
