If you raise them without giving them choices, they'll make bad choices out of curiosity.
>[GPT-4.icon][Dragon Quest Builders] is a spin-off of the Dragon Quest series in which the main objective is to create buildings and items using blocks. The story's backdrop is an alternate ending to the original Dragon Quest games.
>In this world, in the original Dragon Quest, the hero (the hero) faces the evil Dragon King before the final battle. The Dragon King offers the hero a deal and proposes to give him half of the world. However, this was a ploy by the evil forces to continue to rule the world.
>In the original game, the heroes reject the Dragon King's deal, continue the fight, and ultimately win. However, in the Dragon Quest Builders world, we see a different ending in which the heroes accept the Dragon King's deal and choose half the world. The reason for this choice is not explicitly stated

> Elle "...that person is of the blood of the brave, the chosen one, and has lived a life of being admired by those around him. ......
> "I'm sure that person was given the choice to decide for themselves, etc." > "I'm sure that person was given the choice to decide for themselves." > "I'm sure that person was given the choice to decide for themselves,
> Elle: "I don't think there has ever been one.
> 
> Elle: "If in the midst of all this, you were given the choice to decide your own path, ......
> Elle: "I would probably think about it.
> Elle said, "I wonder what would happen if I chose Yes here and .......
> Elle: "I'm sure that person didn't really want half the world.
> Elle: "I think it was pure [curiosity] that made me say yes to that question.
> 
> Elle: "That choice may be an unfortunate one, but I think I know how that person feels.
> Elle "Hmmm... I bet that person was a serious person, unlike Mr. ○○○○!
	[https://blog.goo.ne.jp/onioni2004/e/9e894e18b5c9966476d946f0d7a14669 Dragon Quest Builders: Resurrect Alefgarde Thoughts - Picking Up the Future]

It's a story about a "good kid who listens to his parents" who gets into smart drugs out of curiosity and sinks into the swamp after being threatened to tell everyone about it.
