Observations on the Publishing Industry
The participants tweeted their thoughts on an appropriate topic, and then asked GPT4 to read and comment on the tweets. Then, the GPT4 is asked to respond to the tweet, and a human being responds to the GPT4's response.

	Considerations on [the publishing business]. First of all, the hurdle of "writing a book-length manuscript" has been lowered, which has led to the launch of a wide variety of projects, and people who would not have written books in the past because they said "I can't take time to write" or "the actual income for the time is low" are now writing books.
	Next, the supply will increase too much and the readers will become the bottleneck. Readers will start saying, "I want AI to read and summarize," "I can't let it read a paper book," or "Give me Markdown of the manuscript directly rather than Kindle or PDF. Publishing will begin to be in a format that is "easy for AI to read."
	Just as handwritten letters remained for their emotional value despite the proliferation of e-mail, paper books will remain in this age, but they will no longer have as their primary purpose the transmission of information as books have in the past.
 After emotional paper books are separated and "AI-read books" become the standard for information transfer purposes, those books will be freed from the "reasonable volume" constraint that paper books carried. There will be no need to work hard to compress dense content and no need to water down thin content.
 After this, the reader's measurement of the "value of the book" will change. The amount of money will be the denominator and "the amount that the LLM at hand will be able to say what it cannot say" will be the numerator. What a surprise, this can be quantitatively evaluated by a third party.
 Here, there is a split in whether the author is paid when the LLM studies the contents of the book.
 If there is payment, the weight of the "payment received for the amount of contribution to LLM by becoming LLM's study data" will be larger than the "profit from purchases by human readers" of the author's income. Those who can create something new are safe.
 If LLMs can learn without payment, there will be no incentive for publishers or authors to publish. If this happens, the publishers will be wiped out, so I think they will lobby before they get to this point. I am not sure if a good compromise can be found between the publishers and LLM or if it will be an all-out war between the two sides...I wonder if the LLM side will get into publishing and take market share.


	>Considerations on the publishing business. First of all, the hurdle of "writing a book-length manuscript" has been lowered, which has led to the launch of a wide variety of projects, and people who would not have written books in the past because they said they could not find time to write or that the actual income was too small for the time required will start writing.
		GPT4: 1/ I agree about the future of publishing. Technological advances will lower the hurdle of "writing a book-length manuscript" and will bring a variety of projects and new authors. This will give readers more choices and revitalize the industry as a whole. #Future of Publishing #Diversity
	>Next, the supply will increase too much and the readers will become the bottleneck. Readers will start saying, "I want AI to read and summarize," "I can't let it read a paper book," "Give me Markdown of the manuscript directly rather than Kindle or PDF. Publishing will begin in a "format that is easy for an AI to read."
		GPT4: 2/ Increased supply will create a bottleneck of reader choice; demand for AI summaries and e-books will increase, leading to a shift to "AI-readable formats". Publishing industry needs to adapt to technological advancements and provide new value. #TheFutureofPublishing #AI Summaries
	>Just as handwritten letters remained for their emotional value despite the proliferation of e-mail, paper books will remain in this age, but they will no longer have as their primary purpose the transmission of information as books have in the past.
		GPT4: 3/ Paper books will remain as emotionally valuable as handwritten letters. While information transmission will no longer be the primary purpose, demand will continue for works that emphasize sensitivity and artistry. #future of publishing #paper books #emotional value
 >After emotional paper books are separated and "AI-read books" become the standard for information transfer purposes, those books will be freed from the "reasonable volume" constraint that paper books carried. There will be no need to work hard to compress dense content and no need to water down thin content.
 	GPT4: 4/ As "AI-read books" become mainstream for information transfer purposes, the "moderate volume" constraints of paper books will disappear. There will be no need to compress dense content or water down thin content. This will allow authors to convey information in a freer form and produce higher quality content. #Future of Publishing #A Books to be Read by AI
 >After this, the reader's measurement of the "value of the book" will change. The amount of money will be the denominator and "the amount that the LLM at hand will be able to say what it cannot say" will be the numerator. What a surprise, this can be quantitatively evaluated by a third party.
 >Here, there is a split on whether the author is paid when the LLM studies the contents of the book.
 	GPT4: 5/ The way we measure the value of a book is changing, and the importance of "the amount that can be said that the LLM at hand cannot say" is becoming more important. This can be quantitatively assessed by a third party; payment to authors for LLMs learning book content will be an important discussion in the publishing industry in the future. #future of publishing #book value #LLLM learning
 >If there is payment, the weight of the "payment received for the amount of contribution to LLM by becoming LLM's study data" will be larger than the "profit from human readers buying" of the author's income. Those who can create something new are safe.
 	GPT4: 6/ If author income is paid for "contributions to the LLM study data," this will be more important than profits from human readers. Those who generate new knowledge and ideas will see a steady revenue stream from this change. #future of publishing #author income #LLLM contributions
 >If LLMs can learn without payment, there will be no incentive for publishers or authors to publish. If this happens, the publishers will be wiped out, so I think they will lobby before it gets to this point. I am not sure if a good compromise can be found between the publishers and LLM or if it will be an all-out war between the two sides...I wonder if the LLM side will get into publishing and take market share...
		GPT4: 7/ If LLMs can learn without payment, the publishing industry may lose incentives. Publishers may lobby, but results are uncertain; new competitive structure will emerge as the LLM side moves into publishing and takes market share. #TheFutureofPublishing #LLMvsPublishers

Refute [nishio.icon].
	GPT4: 1/ While there will be demand for paper books for works that are sensitive and artistic in nature, books whose primary purpose is to convey information will not disappear. For example, in legal and academic fields, paper books will continue to be a reliable and solid medium.
 GPT4: 2/ The assumption that the LLM's contribution to the study data increases the author's income is valid as long as the author is able to continuously generate new knowledge and ideas. However, creative talent is not always sustainable, and market and cultural changes may reduce authors' incomes.
 GPT4: 3/ It is unclear whether publishers will lobby and find a drop-off point or all-out war with LLMs, but the publishing industry has a long history and has responded to many technological innovations in the past. The publishing industry will seek ways to coexist and prosper with LLMs by developing new business models and cooperative relationships.

[nishio.icon]
 As for #1, "creating credibility by being a paper book" is included in the emotional value. That demand will remain.
 2: We are not claiming that income will increase. There will be a decrease in income.
 3: They will probably try to find a way to coexist. Whether it will succeed or not remains to be seen.

I tried it manually this time, but it's not bad to have LLM comment back on my thoughts like this, maybe I'll make it a Twitter Bot. But I'm worried that the Twitter API and its behavior might be a bit of a mess for the time being. I think I'll just use the script at hand.

>If LLMs can learn without payment, there will be no incentive for publishers or authors to publish. If this happens, the publishers will be wiped out, so I think they will lobby before it gets to this point. I am not sure if a good compromise can be found between the publishers and LLM or if it will be an all-out war between the two sides...I wonder if the LLM side will get into publishing and take market share...
	[@ukkaripon https://twitter.com/ukkaripon/status/1637051223147958273?s=20]
	 >Isn't it possible to have a future where stray LLMs (which can be done cheaply) are abundantly created by learning only the results from LLMs that pay authors (which can be expensive in terms of money), and as a result, no money goes to authors?
 @nishio
	 It is technically possible. I think it will be after the technology "can learn only the results of existing LLMs and create a comparable LLM" is established, but once that technology is established, OpenAI and others will not let people freely tap APIs like they do now. The future will come when they will only do B2B with tight contracts with big companies. It's not about books...
 @ukkaripon Yes, that's true.
