Diary 2023-03-20
Monday
　I'm here today on a trip I've been planning for a while.


https://twitter.com/nishio/status/1637834909694967808?s=20
"My 9-year-old daughter and 11-year-old son were playing with a chat-type AI, and lo and behold, the AI told them the answer to their homework. But the kids were like, "Can't you solve a simple problem like this?" But the kids were so advanced that they said, "Can't you solve such a simple problem? Maybe the birth of a future genius duo...?" by GPT4
I got this at take1. I didn't understand the dual roles, and I didn't understand the instructions regarding emojis and hashtags, but I decided that the main task of "episodic creation" was accomplished, and the human did the arranging.


The fact that ChatGPT has 1/4 the limit without changing the amount, I thought the composition looked familiar to me, but this is it (written 5 years ago).
[Early adopters and limited resources]
And it's easy to imagine someone who can't distinguish between talking about performance and talking about service quality.


https://twitter.com/nishio/status/1637473645122428929
When I throw a question to ChatGPT in Safari on my iPhone and switch to another screen because it's a waste of time to just watch the text come up, the results are interrupted by a receiving error. Or should I just remote desktop to my home PC when I go out?
I ate today with my screen intact because I was eating out, but I'm traveling tomorrow and it's inconvenient to have my phone out of service while waiting for an answer...

[People who think for themselves want a litany of facts and information].

https://twitter.com/nishio/status/1637646834683478016
We live in an age in which humans have not clearly understood the concept of "[understanding]," but are beginning to visualize that most of it can be explained by mere [recall] of past memories. How is it possible to understand something that no one has ever seen? What will happen when what we used to think of as "smart people who understand" becomes commoditized?

[Diary 2023-03-19]←Diary 2023-03-20→[Diary 2023-03-21]
100 days ago [Diary 2022-12-10].
1 year ago [Diary 2022-03-20].