Diary 2023-03-21
I was thinking of stopping because the diary page would be blank and making it a weekly journal, but if there are so many things to write every day that I can't make it to "a page with an appropriate title" in time, why not write in the diary?

After all, it is more convenient to have a "pinned page where you can write anything you want".
　I think the problem was that "when a day goes by without anything being put on that page, it is not deleted".
　Fork the pin-diary script...

Probably a change in Twitter's API has made it "a bit of a hassle" to republish Twitter to Scrapbox.
　Maybe it's important to record the current episode.

>It's silly to say "AI can't do that" without evidence, and it's silly to say that future AI can't do that based on "AI at the moment can't do that", but aside from that, it's also silly to say something that shouldn't be possible as currently structured as if it could.
https://twitter.com/nishio/status/1638064386937085952

[An approach to make ChatGPT remember Ctrl+F].


https://twitter.com/ochamet_tklab/status/1637280120368173059
>GPT-4 that's great.... I'm already aware that I can get credit for the classes in the middle if I bring in AI (or I will be able to in 6 months).
> I think college classes will be more difficult to evaluate.
> ・Return to the origin of paper examinations
> ・Provide a thesis level report (honestly, this could be done quickly too)
> Is there any better way other than that?
https://twitter.com/kumarobo/status/1637587595755671553
>What I am afraid of is that if we use AI systems as a prerequisite level of evaluation, those who can't use them may get terrible grades, so we will have to focus separately on education to enable them to use them. However, I don't want to educate tools because it will become obsolete & it's not essential / I will have a hard time teaching the essential.
https://twitter.com/nishio/status/1637628402911027200
>I wonder if there will be strong opposition from professors to teaching how to use AI as a university course. I wonder if it will be in the form of a study group where senior volunteers teach junior students.
https://twitter.com/kumarobo/status/1637648411754389504
>The format of "senior to junior" cannot be the basis for mandatory education. (Although when I was in school, that was the tradition, Chinese or otherwise.)
> Even if there wasn't much of a backlash (in fact, if it wasn't my burden, I'd be less likely to get backlash on average), I think the bigger issue would be how to do it in practice.

>[motoso https://twitter.com/motoso/status/1638078595053817858] > When you try to create a character or a human being with AI, if there is an ethical filter, you can't create a strong and human character. It is not possible to make them hold dangerous things in their arms.


>[tanichu https://twitter.com/tanichu/status/1637979153617281024] > Symbols are not important because they have a discrete or grammar.
> It's important because it can be generated and can be used to observe others.
> And it transcends time and space as memory externalized by its expression.
> Furthermore, there is arbitrariness and freedom in its interpretation, so it can be tuned at the level of society.
> That is the meaning of symbolic emergence.
>[tanichu https://twitter.com/tanichu/status/1637979698587385857] > I feel like we can finally get over the problematics of just internalizing language and everyone can go to the main problem of symbolic phenomena. > [tanichu It has been almost 20 years since I got the idea of symbolic emergent systems and started talking about language as an emergent system. Constructivism is finally going to reveal the emergent dynamics of language,.

>[yubais https://twitter.com/yubais/status/1637098105685561344] > When people can make apps in natural language, I think more people will understand that it wasn't because they couldn't program that they couldn't make apps. >
>[yubais https://twitter.com/yubais/status/1637098395486789634] > I too thought "the reason I can't draw comics is because I can't draw" until I tried the original comic book work >

>[motoso https://twitter.com/motoso/status/1637803000529039360] I'm afraid that there will be a generation in the future that will have GPT when they start all kinds of learning.
> Learning efficiency is too different.
>[motoso https://twitter.com/motoso/status/1637803543800475649] half scary, half fun
>[motoso https://twitter.com/motoso/status/1637803757298909186] The time is there that we don't need comments on the code or anything, we can put it in GPT and have it explained to us.

>[cicada3301_kig https://twitter.com/cicada3301_kig/status/1637488822492729344] I think Pascal once said, and I think it's an astute point, that if you're not smart, you have to choose between timidity and boldness. If they are less intelligent, they can't put the world into a fine classifier, so they can only choose to take a wide or narrow risk margin depending on their personality, and choose their actions accordingly. They can only choose to take a wide or narrow risk margin depending on their personality, and act accordingly.
>[cicada3301_kig https://twitter.com/cicada3301_kig/status/1637489573969403909] Essential tremor in epilepsy practice would be a clear example. Low intelligence is interpreted as shaking hands = epilepsy, and no matter how much explanation is given, they can only react in a uniform way to the tremor. They either freak out and make a big deal out of every tremor, or they are indifferent and leave it alone. They don't see "this is epilepsy, that is not."
>[cicada3301_kig https://twitter.com/cicada3301_kig/status/1637490310090727424] The life history of people with low intelligence is usually optimistic in childhood, and then there is a major event in adulthood or old age, such as an illness, and all at once they turn to anxiety. The world is not divided into thin cases. The world is not seen in a thin and segmented way, so as soon as something critical is crossed, the whole world begins to look ominous.

>[ajico_k https://twitter.com/ajico_k/status/1637653246163709952/photo/1] I just realized, this is what the future looks like after AI has fully evolved.
> [https://pbs.twimg.com/media/Froc2SWaIAA74_A?format=jpg&name=900x900#.png] [https://pbs.twimg.com/media/Froc5UHacAEzKBp?format=jpg&name=900x900#.png] [https://pbs.twimg.com/media/Froc7LJaEAAoyYK?format=jpg&name=900x900#.png]
>[ajico_k https://twitter.com/ajico_k/status/1637667369391915009] This is included in the third volume of our coterie magazine "This is a Bad Internet". It is available for kindle unlimited.
> [https://pbs.twimg.com/card_img/1635518539271667712/BibTtkYn?format=png&name=small#.png]

>[hashtag/creative cartoon?src=hashtag_click https://twitter.com/hashtag/創作漫画?src=hashtag_click/status/1637452976905420801/photo/1] Sunday mornings that are a little darker Anime...　#CreativeManga
> [https://pbs.twimg.com/media/FrlmeIiaYAIYWux?format=jpg&name=900x900#.png] [https://pbs.twimg.com/media/FrlmeIdaEAItFZy?format=jpg&name=900x900#.png] [https://pbs.twimg.com/media/FrlmeIbaUAUdJvg?format=jpg&name=900x900#.png]
>[sun_1200 https://twitter.com/sun_1200/status/1637452980520878081] 
> [https://pbs.twimg.com/media/FrlmgIXaQAETcq4?format=jpg&name=900x900#.png] [https://pbs.twimg.com/media/FrlmgJlaYAMw0kM?format=jpg&name=900x900#.png] [https://pbs.twimg.com/media/FrlmgKgaUAQIVQQ?format=jpg&name=900x900#.png] [https://pbs.twimg.com/media/FrlmgKmaMAAbRbw?format=jpg&name=900x900#.png]





[Diary 2023-03-20]←Diary 2023-03-21→[Diary 2023-03-22]
100 days ago [Diary 2022-12-11].
1 year ago [Diary 2022-03-21].