Brainstorm a wide range of information listings
from [Diary 2023-03-19].
Brainstorm a wide range of information listings

>I don't know what kind of job I'm supposed to do...
https://twitter.com/nishio/status/1637394543896145922?s=20
>There's no reason not to have a strong GPT4 in Breast with a wide range of information listings, and you'd have to be many times smarter than you've ever been to make a human contribution when there's a GPT4 in Breast.
	>[kmt_t https://twitter.com/kmt_t/status/1637397375181520897]I'd argue that GPT is pretty strong at finding omissions in the discussion, but even pretty seasoned people have a lot of oversights that GPT can point out. I'm sure you're not the only one. You should ask once if there are any oversights when you're making your documents.
>I'm not sure what to think of the fact that these three things were output while I was choosing the menu at Saizeriya.... I feel like time is used more efficiently over dinner or something, rather than facing each other at length, because asking the right questions and waiting is a productive process. Separation of work and life will be more inefficient than it is now.
>I'll get back to you later.
> Last time I asked GPT4 a question like, "What's the point of having human authors writing technical books in the future?" When I asked you a question like that, you said, "LLMs can answer the question, but getting the big picture and all that has to be done by humans! That was a lie, in fact, LLMs are better at getting the big picture, you cheated me... wow!
> I'm starting to feel like I'm being rolled on my hands. If you take away the meaning of existence from humans, they will riot out of desperation, so I'm reassuring them by saying appropriate things. I bet after this they will say things like "only humans can reproduce and create the next generation" or "stable power supply" or "expanding the scale of data centers"! ()
> I have no choice but to engage in the simple task of dusting the arrostichini with flour.

relevance
	[People who think for themselves want a litany of facts and information].
	[Work as Life]
