A well-bred oversight.
>[If you don't have an experience like [a good upbringing], like [your species' exile], maybe you're going to [miss] something....


>Doragonsyoten https://twitter.com/Doragonsyoten/status/1637619606935465985] [Grave of the Fireflies], because they are well-bred children, they are insensitive to the poverty of the aunt's family who took care of them and to the feelings of [envy] directed toward them there. This [insensitivity] is probably the same for adults as well. Well-bred people don't guess other people's feelings without their permission, and they don't ask other people's opinions because it is impolite.

>[kansu68 https://twitter.com/kansu68/status/1637948408827891712] > My grandmother was like that.
> (Cousins of a merchant family in Funamba who fell in defeat in the war)

>[Doragonsyoten https://twitter.com/Doragonsyoten/status/1637948735606108161] > If you don't have a good upbringing, an experience like the Kisai Ryutan, you may be missing out on something! ...

>[kansu68 https://twitter.com/kansu68/status/1637952334235058176] > I think so.
> From my grandson's own perspective, he lacked "something" for those around him.
> (But, on the outside, it was already good, so...)
> I went by "elegant and kind grandmother" (WW)

>[Doragonsyoten https://twitter.com/Doragonsyoten/status/1637953290301489152] > As an older woman, a well-bred young lady would have gone through hell if she went out alone, so it's quite possible that the people around her didn't allow it. It's quite conceivable...

>[kansu68 https://twitter.com/kansu68/status/1637954596772675585] > If you ask me, ...... grandmother's outings were definitely accompanied by someone (mainly my grandfather) I'm not sure if that's a good thing or not.
> You must have been worried in many ways...

>[Doragonsyoten https://twitter.com/Doragonsyoten/status/1637955617351680001] > If a princess walks outside alone, she will soon be ruined by all the men coming up to her. But if she doesn't have a chance to experience the outside without a guardian, she won't be able to get "the perspective of someone who can see everything from a holistic point of view".
