Books are mass produced
>[tokoroten https://twitter.com/tokoroten/status/1638452690836676608/photo/1] As I touch ChatGPT's GPT4, I'm keenly aware that the world of this is seriously coming.
> I guess from now on, finding issues and verbalizing issues will be the job of humans.
> [Yoichi Ochiai] [Japan Revitalization Strategy
> [https://pbs.twimg.com/media/Frzz0_2aAAEkNuM?format=png&name=medium#.png]

>[nishio https://twitter.com/nishio/status/1638452690836676608/photo/1] I was thinking about what [books] will look like in five to ten years, and from this perspective, books are [mass production], and what happens when that changes to [diversity production], and what happens when that changes to [diversity production], I guess.
	relevance
		[Reflections on the publishing industry].
		[People who think for themselves want a litany of facts and information].
	>[tokoroten https://twitter.com/tokoroten/status/1638516208789262336] I'm sure books will be personalized and summarized by an AI that estimates the knowledge network model in my brain!
	> I think amazon is going to create an AI or something that will search for appropriate knowledge from the library.
	> This will increase the number of people buying books.
	>[tokoroten https://twitter.com/tokoroten/status/1638516658204704769] I guess the next step will be the age of buying books to make personalized AI smarter...

	>[hrjn https://twitter.com/hrjn/status/1638515949270876160] It won't change in terms of producing books, but it will change the way people read them. After all, we can't handle information that doesn't exist in this world in any way, so we have to write it.
	> Or maybe you could just write the facts as you see fit and it would autoplay the intro (or a summary of related research) and a summary or so.
	>[hrjn https://twitter.com/hrjn/status/1638516184818782208] In other words, there may be a chance that the act of writing a book will be reduced to "[novelty]" only and incidental information will be fleshed out as appropriate.

	>[yhara https://twitter.com/yhara/status/1638514754938638342] Ah, so it's possible to have something like "a book with the same content, but with varying degrees of annotation depending on the reader's [prior knowledge]"?

>[nishio https://twitter.com/nishio/status/1638517667102597122] Many people may think of writing a book as writing, but I checked today and my Scrapbox is 58 times larger than the "technology behind coding" It's a lot of volume, and in the writing process, I output more and then cut it down to complete it.
>[nishio https://twitter.com/nishio/status/1638519577490657280] Essentially, it's a question of "what order to put the knowledge that's on the grid in a single stroke", "B should be first to explain A", "But because of its relationship to other things... Then B should be first...", "It would be more efficient to repeat a detailed loop, but the whole thing would have to be divided into a dozen or more chapters...", "The depth limit of the heading..."...
　[Knowledge Network].
	[Books are tools of finitization].
	[Books are already a product of abstraction.]
>The hard part is to "put yourself in the shoes of readers who don't know the details" and "format it in a way that makes it easy for them to read," something you already know "in detail enough to write a book," and LLM can play the reader's role.
	[It's hard to play two roles.]

>[nishio https://twitter.com/nishio/status/1638532912533606401] I'm a little fuzzy on whether [classics] and [preprints] are the two ends of [barbell] when limited to the activity of "reading". Old enough texts are swallowed as LLM training data via the Gutenberg Project, etc. The edge of [copyright], "a system where old humans get in the way of AI to protect their vested interests," may be the edge of the barbell.
