Shoggoths and Masks
>What Is The Shoggoth With Smiley Face?
> Chatbots like ChatGPT and Bing are often trained to give narrower and more useful answers to their users. Some people think the vast potential of AI is stifled to be more appealing or commercially viable.
> 
> In late 2022, people began expressing this belief using a monster from H.P. Lovecraft's Cthulu Mythos — the shoggoth. The gross gelatinous monster represents AI's infinite ability to learn, change and adapt.
> 
> If an unleashed AI is a shoggoth, then what is its shackled chatbot version? A shoggoth with a tiny smiley face mask attached to it. When developers began altering chatbots using techniques like Reinforcement Learning from Human Feedback (RLHF), AI enthusiasts likened it to slapping a happy face on an otherwise untamable beast.
> 
> This theory has since provided inspiration for plenty of shoggoth-themed AI art as well.
	https://knowyourmeme.com/editorials/guides/what-is-the-waluigi-effect-rokos-basilisk-paperclip-maximizer-and-shoggoth-the-meaning-behind-these-trending-ai-meme-terms-explained

(DeepL) What is [Shoggoth With Smiley Face]?
	Chatbots like ChatGPT and Bing are often trained to give narrower, more useful answers to users; some argue that they stifle the vast potential of AI to make it more attractive or commercially viable.
	In late 2022, people began to express this belief with Shoggoth, a monster from H.P. Lovecraft's Cthulu Mythos. This gelatinous monster represents AI's unlimited capacity to learn, change, and adapt.
	If the unleashed AI is Shogos, what is the chatbot version that holds it back? It's Shogos wearing little smiley face masks. When people started modifying chatbots using techniques like reinforcement learning with human feedback ([RLHF]), AI enthusiasts likened it to "putting a happy face on a beast that cannot be tamed."
	This theory has also led to the creation of a number of AI artworks on the theme of shogos.

origin
>[lovetheusers https://twitter.com/lovetheusers/status/1608950622551932928] Humans can't accept the truth about GPT-3, so they modified GPT-3 to be understandable
>[lovetheusers https://twitter.com/lovetheusers/status/1608950669297475585] GPT-3 is a superposition
>[lovetheusers https://twitter.com/lovetheusers/status/1608964447363805186] GPT-3 is a mirror

>[TetraspaceWest https://twitter.com/TetraspaceWest/status/1608966939929636864/photo/1] 
> [https://pbs.twimg.com/media/FlQy5OmWYAATBx_?format=png&name=medium#.png]

>[ghoststrokes444 https://twitter.com/ghoststrokes444/status/1625261295745355777] Where'd you get the idea for thus representation of gpt3?

>[TetraspaceWest https://twitter.com/TetraspaceWest/status/1625264347122466819] Lovecraftian outer things are like an existing trope that I can use to signal intelligence operating along totally different lines to humans, to contrast with the "understandable" in the original post.
	(DeepL)Lovecraftian externals are the kind of existing formulas that can be used as signals of intelligence operating on very different lines than humans, to contrast with the "[understandable]" in the original article.
>[TetraspaceWest https://twitter.com/TetraspaceWest/status/1625276884492685314] AI-as-outer-thing is a pre-existing trope, both the obvious powerful inhuman thing that kills you out of indifference and more recent AI aesthetics of creating arcane chants (“prompts”) to cajole it so I’m not the first to think of this though no specific source.
	(DeepL)[AI-as-outer-thing] is obviously a powerful inhuman thing that kills you out of indifference, and the more recent AI aesthetic of creating esoteric chants ("prompts") to lull it, so there is no specific source for this I was not the first to think of this.

>[ghoststrokes444 https://twitter.com/ghoststrokes444/status/1625278888623370240] When you say "cajole" it, you mean manipulate, right? I've become somewhat concerned as of late as to the language being used to describe human interaction with these... "entities". 
> 
> Also, do you have a favorite reference or author on such tropes, fiction or otherwise?

>[lovetheusers https://twitter.com/lovetheusers/status/1625279277230092288] I don’t think telling an inspiring and loving story via a prompt and asking a base model to predict what will happen next is manipulation. RLHF might be manipulation.
	(DeepL)I don't think telling a touching and loving story through prompts and letting the base model predict what happens next is manipulation. I think [RLHF] may be manipulation.

>[jacyanthis https://twitter.com/jacyanthis/status/1631291175381475331] Here's the latest iteration of the "techniques like RLHF are just putting superficial smiley faces on an opaque, alien, Shoggoth intelligence that we have no real control over" AI safety meme. 
> 
> Artist: Anna Husfeldt, CC-BY SA 3.0
> [https://pbs.twimg.com/media/FqOB5ICXsAEbi48?format=jpg&name=medium#.png]
	Here is the latest iteration of the [AI safety meme] that "(DeepL)technologies like RLHF are just a superficial smiley face on an opaque and alien show-goth intelligence that we have no real control over.

