Lévi-Strauss
Claude Lévi-Strauss was a French anthropologist and is known as the founder of structuralism. His work has influenced many academic disciplines, including anthropology, linguistics, cultural studies, and philosophy. (by GPT4)
	The Quest for Cultural Universality and Diversity: Lévi-Strauss attempted to find the basic structures common to different cultures. He believed that the structure of the human psyche reflects the structure of culture and sought a balance between universality and diversity.
	[structuralism]: He proposed the idea of structuralism and applied it to anthropology and cultural studies. Structuralism is an approach that attempts to make sense of culture and society by understanding the structure behind phenomena.
		[dualistic thinking]: Lévi-Strauss believed that human thought is fundamentally dualistic. He argued that opposing categories such as nature and culture, life and death, good and evil, are the basic thought structures found in many cultures.
			Binary oppositional structures: Two opposing categories (e.g., nature vs. culture, life vs. death, good vs. evil) appear as basic structures in culture and mythology.
  Mythological structure: the basic building blocks of characters, events, and themes in stories and myths. These have similar structure and meaning across different cultures.
  [Kinesic Structure]: Nonverbal communication structures such as gestures, facial expressions, and posture. These differ from culture to culture, but serve a common function.
  [Linguistic structure: The basic structural elements in a language, such as grammar and phonology. These have common patterns and functions across different languages.
  [social structure]: the basic units and relationships that make up a society, such as family, kinship, and class systems. These show similar patterns in different cultures.
  [food structure]: The basic structures in a food culture, including food selection, preparation methods, and eating habits. These show common patterns and functions in different cultures.
	[Mutrogory]: He sought to reveal similarities and differences between cultures by studying myths and stories. In his books such as "[Wild Thoughts]" and "[The Structure of Tragedy]," he believed that myths and stories reflect the basic structure of culture.

https://gist.github.com/nishio/c2011b0fe030958b8ae579f28f49bce4
