Certification/Authorization
[Example of cognitive resolution]

>[uhyo_ https://twitter.com/uhyo_/status/1638870237524418560] I feel that both "authorizing the right to authorize" and just authorizing in the first place can be unified under "delegation of authority". I still don't understand (?) the essential meaning of splitting it into two different terms without doing so.

>[uhyo_ https://twitter.com/uhyo_/status/1638873327459782657] I wrote "people who are familiar with the related fields are rather unaware of the strict distinction" with the imagination that the distinction between "certification/authorization" is used only because it has such a convenient definition, and that people who are familiar with the related fields are thinking with a more essential understanding. I wrote "those who are familiar with the related areas are not so conscious of the strict distinction", but it seems that this is not so (?).

>[keno_ss https://twitter.com/keno_ss/status/1638888778382323713] Isn't that like saying that dogs and cats are mammals?
> We make a distinction in OAuth and so on because it is useful to think of them separately.

>[uhyo_ https://twitter.com/uhyo_/status/1638890101903343616] What can I say, I understand that it is useful from an implementation standpoint, but I don't understand why the distinction is appreciated as if it were the essence of security. If I were to use an animal analogy, it would be like separating "black cats" and "cats" and being told, "This is biology!" (?).

>[keno_ss https://twitter.com/keno_ss/status/1638891193747795969] I'm not convinced by the claim that I'm a close concept to begin with, but to what specific case are you referring?
> I'm thinking, for example, of GitHub login (authentication) and repository visibility (authorization).

>[uhyo_ https://twitter.com/uhyo_/status/1638892083590365186] I'm thinking that "logging in to GitHub" is a kind of authorization, considering that it is a way to obtain "the right to be transferred the privileges that a particular user has". I think that "login to GitHub" is a kind of authorization. The way to verify whether a right is granted is very different between "authentication" and "authorization", but I think that is not the essence of the issue.
