Diary 2023-03-24

>[bentossell https://twitter.com/bentossell/status/1638961888003489792/photo/1] 
> [https://pbs.twimg.com/media/Fr7DEc0WcAgD7V6?format=jpg&name=small#.png]
>[verbbz https://twitter.com/verbbz/status/1638963922228359169] Honestly building products based on OpenAI's API for 6 months and I feel like I lost 5 years of my life. Built a chat -> They release ChatGPT. Built a great product (Langotalk) -> They invest $30M in a competitor -> Improved accuracy -> Competitor launches with GPT-4. Now this

The story of this.
>[gdb https://twitter.com/gdb/status/1638949234681712643] We’ve added initial support for [ChatGPT plugin]s — a protocol for developers to build tools for ChatGPT, with safety as a core design principle. Deploying iteratively (starting with a small number of users & developers) to learn from contact with reality: https://openai.com/blog/chatgpt-plugins…
>[gdb https://twitter.com/gdb/status/1638959173236064256] We've written plugins for browsing & Python code execution (amazing for data science use-cases), launched with 11 partners, and have open-sourced a high-quality plugin for retrieval over any data you'd like to make accessible to ChatGPT:
> [https://pbs.twimg.com/card_img/1638952715278491667/QxTjGwYJ?format=jpg&name=medium#.png]
>[gdb https://twitter.com/gdb/status/1638986275800879104] Thank you to our amazing set of launch partners — Expedia, FiscalNote, Instacart, KAYAK, Klarna, Milo, OpenTable, Shopify, Slack, Speak, Wolfram, and Zapier. Each has built a very cool integration!
> [https://pbs.twimg.com/media/Fr7ZBwdakAAa0Sj?format=jpg&name=medium#.png]
What I thought was farther along is being accomplished faster and faster than I expected.



[Where is full-text search headed?]
>[golden_lucky https://twitter.com/golden_lucky/status/1639199443617738754] I want AI to do everything up to "expand more documentation".
>[nishio https://twitter.com/nishio/status/1639199793166819328] That's what humanity has left to work with...
> [work to open up the forest of what has yet to be written].





>[nishio https://twitter.com/nishio/status/1639262985070813184] I'm starting to think that what is currently happening with regard to software is different from this diagram. If "if the issue is verbalized, then software will 'make software' individually," then all the things that have kept a lot of companies alive due to the low processing power of "people who convert issues into solutions" will now belong to "companies that can procure computing power cheaply".
> [https://pbs.twimg.com/media/Frzz0_2aAAEkNuM?format=png&name=medium#.png]
> >[tokoroten/status/1638452690836676608/photo/1 https://twitter.com/tokoroten/status/1638452690836676608/photo/1/status/ 1638452690836676608/photo/1] I feel that the world is really coming to this when I touch ChatGPT's GPT4. I think that finding issues and verbalizing issues will become the job of humans.
>[nishio https://twitter.com/nishio/status/1639263665588170752] The software industry may become only two extremes, a huge [equipment industry] and a very [niche] one, and the middle scale may be wiped out.
[Barbell].

>[nishio https://twitter.com/nishio/status/1639236397172412418] I'm feeling like, what did we need humans for?

>[nishio https://twitter.com/nishio/status/1639210520342568960] Yeah, the first one, "AI is blind" was interesting.
> [https://pbs.twimg.com/media/Fr-lR8caMAA1_LN?format=jpg&name=medium#.png]

>[nishio https://twitter.com/nishio/status/1639173082463223813] Using a table of contents when reading means reading the hierarchical summary prepared by the author first. However, it depends on the author's ability to design the table of contents to be a hierarchical summary and whether it is well done. So what if GPT4 created the summary here?
>[nishio https://twitter.com/nishio/status/1639173754436861952] It would be possible to have a book in a format where instead of a table of contents, there is a summary first, and then a "more details" button placed here and there in the summary jumps to the main text. Isn't it possible to have a book in this format?
>[nishio https://twitter.com/nishio/status/1639173966362451968] There's no need to have just two levels of "table of contents" and "text" when it comes to this.

>[nishio https://twitter.com/nishio/status/1639172428185374720] When I told GPT4 that I wanted to make a web app with the simplest possible structure, they suggested index.html and main.js, I thought, well, it's certainly simple, and they told me to upload it to PythonAnywhere.
>[nishio https://twitter.com/nishio/status/1639172593407389697] I said "eh, it's a pain in the ass, I want it to deploy on its own after uploading to Github" and he started explaining the Heroku setup.

[Diary 2023-03-23]←Diary 2023-03-24→[Diary 2023-03-25]
100 days ago [Diary 2022-12-14].
1 year ago [Diary 2022-03-24].