Explanation for the sake of explanation
>[hrjn https://twitter.com/hrjn/status/1639269880590417921] Not strictly true, but the activity that loses value due to ChatGPT is the part of converting A to B.
> 
> For example, translating English into Japanese, translating ideas into slides, etc.
> 
> On the other hand, the value of creating C from scratch remains, right? In other words, experimenting, observing, and creating will continue to be important.
> >golden_lucky: In the post-ChatGPT world, the demands on the "contextualizing and originalizing" work we do will probably increase. But at the same time, the (monetary) value will probably (increasingly) decrease. AI as a replacement for documentation, ChatGPT as it is now, is halfway there, so I hope it can do it all soon!


>[hrjn https://twitter.com/hrjn/status/1639270904583663619] The problem is that many knowledge workers() in the world are forced to do a lot of [explanation for explanation's sake], and if anything, being able to explain is considered proof of excellence. It's called accountability, in a crude way.
> 
> Actually, this work is worthless, but it was important for human communication. That's what's possibly going to be destroyed, right?

>[hrjn https://twitter.com/hrjn/status/1639271545171329029] As long as you're doing your job properly, it's possible that daily work logs or, if you're not doing a good job, PC operation logs will automatically generate explanatory materials.
> 
> Then, there is a possibility that AI can replace all the weekly reports and self-evaluations.
> 
> This is groundbreaking, isn't it?

>[hrjn https://twitter.com/hrjn/status/1639272222484250625] If you want, AI could assist you in setting reasonable milestones and subdividing tasks based on similar projects in the past.
> 
> This is the kind of work that has been done by consultants of a sort, but in principle it is largely possible.

>[hrjn https://twitter.com/hrjn/status/1639272627461058562] Then the value of things becomes more and more ubiquitous in the creation of new things. I think that's what's happening, I guess.
