GPT4 writes a "mostly correct program" for the gun.
relevance
	Have software implemented in ChatGPT
		[/villagepump/Twitter to Scrapbox GPT]
 Have ChatGPT port to a different language.
 　[ported to Python with GPT-4].

>[nishio https://twitter.com/nishio/status/1638948612859400192] GPT4 is really gung-ho about writing programs that are "mostly right", so the percentage of engineers' work that is "debugging time" increases. We need learning content to train debugging skills (or good prompts to let GPT4 do the debugging).

>[nishio https://twitter.com/nishio/status/1638948987620433922] "I have something I want to do but I don't know how to write it" is no longer an excuse. Let GPT4 write it and then try to do it.

>[nishio https://twitter.com/nishio/status/1638949497802997761] How do I get GPT4 to debug? Do we do "put lots of debug output and assertions in this code"?
	>[NaOHaq https://twitter.com/NaOHaq/status/1638950671688044546] "Write a QuickCheck for this code" or something like that.


>[nishio https://twitter.com/nishio/status/1638949897184612352] I'm sure someone will say something like coding convention "Source code must be within the number of tokens that can be entered into ChatGPT".
	>[8kpx https://twitter.com/8kpx/status/1638956571253153816] I feel this could be realistic. I assume it will be divided into small verifiable modules and combined. Integration looks egregious, though.

>[nishio https://twitter.com/nishio/status/1638952982309126150] I tried the "split functions for easier debugging" the other day, and it was done. Maybe we could go with splitting it into parts with test cases.

>[nishio https://twitter.com/nishio/status/1638967933161594880] I tried to tell GPT4 that "it doesn't work well with this kind of DOM" but the DOM was too big
	>[phono2xx https://twitter.com/phono2xx/status/1639067859048628226] If it's at the function level, I would ask them to write test code at the same time, or perhaps ai could structure it in a way that makes it easier to write. Or maybe you can make it easy for ai to write. It might be a good idea to have it output selenium. I mean, it would really change the way I work.

>[hrjn https://twitter.com/hrjn/status/1639025921234698240] In my experience, the number one factor that causes first-time students to stumble is that it seems pretty hard to do anything other than write programs in the environment.
> Well, I guess they could tell me if I ask them about this area too, but it would be difficult to ask them.
	>[nishio https://twitter.com/nishio/status/1639142008571969537] "Write a Dockerfile"


>[tsukamoto https://twitter.com/tsukamoto/status/1639160941182062592] [Wikipedia] is gunning for a "mostly correct knowledge" summary, so the percentage of the investigator's (including learners and homeworkers) work that is " It's the same composition as the percentage of "time to verify" has increased. In many situations, the human role is increasingly weight-shifting to decision-making and evaluation/judgment, and the work between the two is getting thinner.
	I see
