Strategies for Japanese speakers who are inferior in scale
Strategy for [Japanese speakers] who are inferior in [scale
https://gist.github.com/nishio/d03b849313aff4667696423b6fa83cf9#chatgpt-12
	>Language learning: Y members learning language L1 may improve their intellectual productivity by enabling them to use device Z more effectively.
	　Japanese speakers learn English
 >Technical and knowledge exchange: Group X and Group Y cooperate and share their skills and knowledge so that members of Group Y can also contribute to innovation.
 　Japanese speakers contribute to innovation through collaboration and knowledge sharing
 　I hope you get to the "multilingual support" below.
 >Development of proprietary technology: Collective Y can develop its own technology and innovate to improve its intellectual production capacity in a way that is independent of Equipment Z.
 　Approach to creating a Japanese LLM independent of the English LLM
 　　[Will the performance improvement come to a head or will there be endless performance gains?]
 　　If it's a head start, the side that's behind in scale can catch up.
 　　If not, it is futile because the gap will only grow wider and wider.
 >Education and Human Resource Development: Collective Y can increase its own intellectual resources and well-being by focusing on education and human resource development.
 　That's education in Japanese by Japanese speakers.
 >Economic and cultural exchanges: When group X and group Y respect each other's economy and culture and promote exchanges, the well-being of both groups may be improved.
 　So this is [a trader of knowledge].
 >Improvement and multilingualization of device Z: Collective Y can work with the developers of device Z to improve it so that it can also support language L2.
　　This would be the ideal.
　　I don't know if there is an incentive to do so, if there is a cost to do so.

The clean language will say that you are not discriminated against just because you are a user of a language that is inferior in scale.
　Even those who speak only Japanese can use the language model of English-centric services through machine translation.
　It is the same as "a person with a limp can ride in a wheelchair and use public transportation designed for a person with a limp.
　A person with a limp does not enjoy the same benefits as a person with a free leg.


relevance
	[Build the Tower of Babel].