pScrapboxAutoTrans2023-03-25
2023-03-25 [pScrapboxAutoTrans]

Whether to put the translations in this Scrapbox or not.
　I have a whole book's worth of content in English at [Engineer's way of creating knowledge], but almost a year later, I haven't experienced any "connection! I have not experienced any "connection" at all!
　　Sometimes the connection is unexpected, but it's not a happy connection.
　If the translation is immediately added to this Scrapbox as a separate page, there will be two similar pages in a row
　　the other
　Provide both Japanese and English on the page.
　　I think this is better, but not better.
　Fundamentally, the problem is that the page list is not customizable.

[English Language Support].
	>How about setting up a [social trigger] by writing casually in Scrapbox, automatically machine translating it, transcribing it to the English version of the Scrapbox project, and then tweeting it on an English account so that I get notified when there are reactions?
		[" Tweeting with an English account
		No reaction on Twitter.

[Scrapbox Englishization Project]
 >Scrapbox's API seems cumbersome to achieve sequential updates.
 	Yes
 >As a small start, you could first export it in JSON, translate it, and import it.
 >Insert `(auto-translated from [Japanese http://....])' in the first line? and insert `(auto-translated from [Japanese ])' at the beginning of the line?
 	Mechanical text in the first line causes the card display to be [Garbage House].
 	Iconic notation if you want to put it at the beginning

[ScrapboxAutoTrans Development Diary 2021-12-28].
	>In the future, it would be good to use Github Action to spit it out as a static file and host it on Github Pages or something.
		Well, at least I'd better diversify my domains because they might not pay for the maintenance of the nhiro domain after I'm dead and they might notice that I'm dead after I'm gone.

stay awake during sleep

The problem is complex.
　How to translate documents that are updated daily
　How to show what has been translated
　Where to place the translated

I'm getting to the point where I can use Github Action to get it.

Can I keep the translated data too?
Already have something English?



