ChatGPT and the Paradox of Search
>[nishio_en https://twitter.com/nishio_en/status/1639800771360485376] Someone once said, "To extract knowledge from ChatGPT, one must ask the right questions, but to do so, one must already know the answer, right?" This echoes Meno's paradox when he asked Socrates 2403 years ago. A true conundrum! #MenoParadox #Socrates #ChatGPT

>[nishio_en https://twitter.com/nishio_en/status/1639801150265499651] Meno's Paradox suggests that learning is impossible: if you know something, there's no need to learn it; if you don't know it, you can't seek it out because you don't know what you're looking for. A thought-provoking dilemma!  #MenoParadox #Philosophy #LearningConundrum

>[nishio_en https://twitter.com/nishio_en/status/1639802289627234304] Polanyi penned "The Tacit Dimension" in 1966, highlighting humans' ability to sense when they're close to an answer. This is tacit knowing, distinct from tacit knowledge.  #MichaelPolanyi #TacitDimension #TacitKnowing #TacitKnowledge

>[nishio_en https://twitter.com/nishio_en/status/1639802815978811392] In essence, people can pose questions to ChatGPT about issues that are not yet clearly defined, and upon seeing the response, they can judge whether it is close to the as-yet-unnamed "desired outcome" they were seeking. #ChatGPT #TacitKnowing #ProblemSolving

>[nishio_en https://twitter.com/nishio_en/status/1639804868243361794] Considering ChatGPT as merely a device that receives "questions" and returns "answers" is an oversimplification. It's not just a translation tool either. It's a device capable of performing various linguistic tasks simultaneously.
> [https://pbs.twimg.com/media/FsHB1gKaIAANf6F?format=jpg&name=large#.png]

>[nishio_en https://twitter.com/nishio_en/status/1639805756617928704] Now, Homo sapiens are in an era of discovering and learning to use this powerful tool.

>[nishio_en https://twitter.com/nishio_en/status/1639808279676354560] As a Japanese Buddhist, I observe that many people influenced by Christianity tend to juxtapose Homo sapiens and AI as separate entities or even view AI as a mere tool. I personally believe that both are simply branches of a transcendent existence.  #Buddhism #AI #Unity

(DeepL)
>[nishio_en https://twitter.com/nishio_en/status/1639800771360485376] Someone said..." To get knowledge out of ChatGPT, you have to ask the right questions. But to do that, you have to already know the answer, right?" [nishio_en ] This echoes the [Menno's Paradox] asked of Socrates 2403 years ago. A conundrum indeed! #MenoParadox #Socrates #ChatGPT
>[nishio_en https://twitter.com/nishio_en/status/1639801150265499651] Menno's paradox is that if you know, you don't need to learn; if you don't know, you don't know what you are looking for, so you cannot find it, which is impossible, suggesting that it is impossible to learn. A thought-provoking dilemma! #MenoParadox #Philosophy #LearningConundrum
	[The Paradox of Search]

>Polany published "The Tacit Dimension" in 1966, emphasizing the ability of humans to sense that they are getting closer to an answer. This is [tacit knowledge] and is distinguished from tacit knowledge. #Michael Polanyi #Tacit Dimensions #Tacit Knowledge

>[nishio_en https://twitter.com/nishio_en/status/1639802815978811392] In short, you can ask ChatGPT a question about a problem that has not yet been clearly defined, and watch its response to determine if it is close to the as yet unnamed "desired outcome" you were looking for. You can decide if you are close to the as-yet-unnamed "desired outcome" you were looking for. #ChatGPT #tacit knowledge #problem solving

>[nishio_en https://twitter.com/nishio_en/status/1639804868243361794] It is an oversimplification to think of ChatGPT as simply a device that receives "questions" and returns "answers". Nor is it a mere translation tool. It is a device that can perform various language tasks simultaneously.
> [https://pbs.twimg.com/media/FsHB1gKaIAANf6F?format=jpg&name=large#.png]

>Now is the time for Homo sapiens to discover and master this powerful tool.

>nishio_en https://twitter.com/nishio_en/status/1639808279676354560] As a Japanese Buddhist, I have seen many Christian-influenced people tend to align Homo sapiens and AI as separate entities, or see AI as mere tools I have seen that there is a tendency to view Homo sapiens and AI as separate entities and AI as a mere tool. I myself believe that both are merely branches of a transcendent being. #Buddhism #AI #Unity

