{
  "id": "592e8fa053e5ef0011956259",
  "title": "iw-557",
  "created": 1496223652,
  "updated": 1624737215,
  "lines": [
    {
      "id": "592e8fa053e5ef0011956259",
      "text": "iw-557",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223652,
      "updated": 1496223652
    },
    {
      "id": "592e8fa4aff09e000006055c",
      "text": "[Incremental Writing] 557枚目のメモ",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223652,
      "updated": 1496223666
    },
    {
      "id": "592e8fb2aff09e000006055e",
      "text": "なぜこれがここに貼られているのかは忘れてしまった",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223666,
      "updated": 1624734437
    },
    {
      "id": "60d77b18aff09e0000813722",
      "text": "Twitterからの転載っぽいけど…",
      "userId": "582e63d27c56960011aff09e",
      "created": 1624734488,
      "updated": 1624734506
    },
    {
      "id": "60d78595aff09e0000ec5fdf",
      "text": "Twitterなら前後のツイートとかとくっつけて文脈を増やした方が理解しやすい気がする",
      "userId": "582e63d27c56960011aff09e",
      "created": 1624737173,
      "updated": 1624737215
    },
    {
      "id": "60d77ae5aff09e0000813721",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1624734437,
      "updated": 1624734437
    },
    {
      "id": "592e8fb2aff09e000006055d",
      "text": "他人の説明した「やり方」を真似してうまく行くことが少ない理由、やり方を作った人は彼の状況に合わせて試行錯誤して作ったのに対して、真似をする側は自分の状況とのすり合わせが不足しているからだと思ってたけど、それ以上に、作った人はそのやり方を自分が作ったものと認識していて、続く",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223666,
      "updated": 1624734440
    },
    {
      "id": "592e8fc4aff09e000006055f",
      "text": "\tいや、目的を明示してても、他人は勝手に「それは別のものを達成する手段」と考えることができるから、質問者側が目的を明確化しなかったことではなく、勝手に目的を推測した回答者側に責任の大部分があるのか。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223684,
      "updated": 1496223775
    },
    {
      "id": "592e901faff09e0000060565",
      "text": " 「カリキュラムとして知識範囲が明示されていて、その範囲の知識を脳の中に入れることが目的」を暗黙の大前提として仮定してはいけないですね。「明示されているかどうか」と「知識を得ることが目的か、成果を出すことが目的か」との2点で反論の余地がある。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223775,
      "updated": 1496223779
    },
    {
      "id": "592e8ff7aff09e0000060560",
      "text": " よく相手の立場になって考えろと言うけど超能力でも持ってないと相手の考えなんてわからないというのが言語によるコミュニケーションを重要視する価値観。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223736,
      "updated": 1496223744
    },
    {
      "id": "592e8fffaff09e0000060561",
      "text": " \t自分の考えを明示的に主張する。主張しないやつが悪いというスタンス。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223744,
      "updated": 1496223747
    },
    {
      "id": "592e9003aff09e0000060562",
      "text": " Xに詳しい人の「Xは重要」という発言には、Xに投資したことを無意識に正当化するバイアスと、Xが重要視されることで自分も重要視されるバイアスとの、二重のバイアスがかかってる。発言をそのまま真に受けるのではなく「なぜそう思うか」を聞き出して自分で判断しないといけない。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223747,
      "updated": 1496223757
    },
    {
      "id": "592e900caff09e0000060563",
      "text": " 『その部分がかなり誤解のもと』だという根拠はなんですか？またその誤解によって発生するコストを僕よりもかなり高く見積もっているように見えますが、そのコストよりも低いコストで行える別の「誤解の余地のない説明」を提示できますか？",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223757,
      "updated": 1496223771
    },
    {
      "id": "592e901baff09e0000060564",
      "text": " 縦軸が「必要性」でそれを高める教育が「選択することのメリット、しないことのデメリットを明確にする」っていう理性に訴えるものなのであれば、横軸「欲求」を高めるための教育はもっとドロドロした感情に訴えかけるものじゃないか。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223771,
      "updated": 1496223793
    },
    {
      "id": "592e9030aff09e0000060566",
      "text": " \tまあそれ書いたら顧客は自分の理性を否定された気がして嫌だろうｗ",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223793,
      "updated": 1496223796
    },
    {
      "id": "592e9034aff09e0000060567",
      "text": " [予想通りに不合理]、を読んでいる。面白い。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223796,
      "updated": 1496223810
    },
    {
      "id": "592e9042aff09e0000060568",
      "text": " \t売り手側がアンカーを外すには同一の対象と見られないように差別化が重要、と。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223810,
      "updated": 1496223813
    },
    {
      "id": "592e9045aff09e0000060569",
      "text": "  買い手側は？",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223813,
      "updated": 1496223816
    },
    {
      "id": "592e9048aff09e000006056a",
      "text": " 自分が繰り返している習慣に疑問を持つように自分を訓練すべき、か。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223816,
      "updated": 1496223823
    },
    {
      "id": "592e904daff09e000006056b",
      "text": " \tソクラテスは吟味されない人生は生きる意味がない、と。体系的な廃棄が重要なのね。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223823,
      "updated": 1496223826
    },
    {
      "id": "592e9052aff09e000006056c",
      "text": " 「彼にはコミュニケーション力が必要だ」ってセリフは多くの場合彼とのコミュニケーションに失敗した人がいうセリフだよね。コミュニケーションの失敗自体は対称な関係なのに「自分にコミュニケーション力がないのではないか」となぜ思わないのか、という点は興味深い。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223826,
      "updated": 1496223834
    },
    {
      "id": "592e905aaff09e000006056d",
      "text": " だから数学はまずは参照解決をして省略を補わなければ効率よく理解できないし、辞書は何が知りたいのかを明確にしてから読まなければ効率よく知識を得られない。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223834,
      "updated": 1496223841
    },
    {
      "id": "592e9061aff09e000006056e",
      "text": " あった「知識労働者は監督され得ない。むしろ自らの専門について自分より詳しく知るものが存在するようではあらゆる意味で無益な存在」 P.87",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223841,
      "updated": 1496223848
    },
    {
      "id": "592e9067aff09e000006056f",
      "text": " 成功の鍵は、自分の情報を必要としているのは誰か、それはどのような情報か、逆に自分は誰の情報を必要としているかを全員が自問することである。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223848,
      "updated": 1496223864
    },
    {
      "id": "592e9078aff09e0000060570",
      "text": " つまり同じチャンスが与えられても人によってそこから得られるメリットの期待値は異なる。失敗に対する恐怖心の多寡、挑戦できる余裕、リスク許容度、と表現は色いろあるだろうけど得られるメリットを制限するものはチャンスを受け取る人の心の中にある。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223864,
      "updated": 1496223877
    },
    {
      "id": "592e9084aff09e0000060571",
      "text": " もし仮に集団のメンバ全員より劣った「底辺の」人間がいたと仮定すると、その人間は他のメンバに何も与えることができないから、必然的にフリーライダーになる。コミュニティにとって有害な存在だ。 RT 自分が底辺に位置する環境だけが、成長を促進する。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223877,
      "updated": 1496223884
    },
    {
      "id": "592e908baff09e0000060572",
      "text": " 資源配分戦略を人に相談することがまったく無益だとは言わないが、持っている資源も達成したい目的も明確化しないままではなかなか有益な議論にはならないだろうな。日本は差異化を嫌うから…とか言って終わりにしたのではなにも改善されない。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223884,
      "updated": 1496223896
    },
    {
      "id": "592e9097aff09e0000060573",
      "text": " どうすればそれが改められるかを考えると、差異化する人の方が均質化する人より幸せになるように自分のできる範囲で変えていくべきなのかなあと。それで僕は「普通と違っていて面白い」人にリソースを割くわけなのだが。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223896,
      "updated": 1496223904
    },
    {
      "id": "592e909faff09e0000060574",
      "text": " なるほど。自転車置き場の議論って、議論の結果として得られる対価より議論のコストの方が高い状態だと思っているのだけど、非効率なものの切り捨ては言葉を変えれば思考停止とも言えそうね。投下できるリソースは無限じゃないから思考停止はいずれ避けられないことかも。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223904,
      "updated": 1496223912
    },
    {
      "id": "592e90a8aff09e0000060575",
      "text": " 逆に言えばお金で解決できてるわけですから、そのアイデアが本当に経済的価値を生み出すものであるなら継続的なシステムとして成立するわけですね。問題はまさにそこで、専門家がスコープを絞っているのは馬鹿なのではなくその方が実現可能なアイデアになる確率が高いから…",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223912,
      "updated": 1496223924
    },
    {
      "id": "592e90b3aff09e0000060576",
      "text": " 世の中いろんな予期しない変動が起きるもんだ。そういう状況下でも自分が良いと思うことを何とかして継続させようと頑張っている人たちはいるわけだけど、変動の大きさによっては物事が去年と同じように進むとは限んないんだよね。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223924,
      "updated": 1496223931
    },
    {
      "id": "592e90bbaff09e0000060577",
      "text": " 注目を集めたい人にとって、エキセントリックな行動に走ることは手軽に注目が集められるよい手段なのだろう。しかしそういう行動で得た注目は行動をやめると失われる。そしてさらに飢える。まるで麻薬のようなものだ。価値を生み出すことによる注目は成果に価値がある間持続する。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223931,
      "updated": 1496223939
    },
    {
      "id": "592e90c2aff09e0000060578",
      "text": " 「プライマリーノウイング」なんて横文字出てくると身構えてしまう人もいるだろうけど「（他人を納得させるほどの）根拠がない信念」が、新しいことをやる際には必要だ、という当たり前のことなんだよね。他人を納得させられるほど客観的証拠があるものは「新しいこと」ではない。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223939,
      "updated": 1496223946
    },
    {
      "id": "592e90c9aff09e0000060579",
      "text": " 人にものを説明するときには、自分の言語体系ではなく相手の言語体系で表現しなければ伝わらない。承前:人生についての意見は正しいかどうか判断できない。しかし「方法」は別だ。彼の意見に添えて「人生を良くする方法」が記述されているなら、それが正しいかどうかは自分で試して検証することができる。書かれていないなら彼の意見を根拠なく受け入れるか、根拠なく無視することしかしかできない。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223946,
      "updated": 1496223964
    },
    {
      "id": "592e90dcaff09e000006057a",
      "text": " [目的の明確化]が大事だと思っても、いざ実際に明確化しようするとつまずく。間違って「この本を理解する」なんて目標を立てたりする。それは達成できたかどうかの判断が難しい、よくない目標設定だ。それよりは[濃縮メモ]作りの方がまだ形のあるものができる分判断しやすい",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223964,
      "updated": 1496223981
    },
    {
      "id": "592e90ecaff09e000006057b",
      "text": " 「『理解した』と感じる」のと「理解している」のとは別物。だから「自分では『理解した』と思っていたが、実は理解してなかった」ってことが起きる。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496223981,
      "updated": 1496224002
    },
    {
      "id": "592e9101aff09e000006057c",
      "text": " 知識労働者は、ほとんどが専門家である。彼らは一つのことをよく行うとき、すなわち専門化したとき大きな成果をあげる。しかし専門知識はそれだけでは断片にすぎず不毛である。専門家のアウトプットは、他の専門家のアウトプットと統合されて成果となる。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496224002,
      "updated": 1496224010
    },
    {
      "id": "592e910aaff09e000006057d",
      "text": " 人間にはそんなに能力に差があるわけではなくて、ただ興味が向いてないとか事前知識が足りないとかで出せるパフォーマンスに大きな差があるだけなんじゃないんだろうか。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496224010,
      "updated": 1496224021
    },
    {
      "id": "592e9114aff09e000006057e",
      "text": " 前2人の雇用主に酷評されてたX氏がいい仕事すぎて。コードは1行も書かせてないけど。彼の興味と能力は情報収集向きなんだな。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496224021,
      "updated": 1496224029
    },
    {
      "id": "592e911daff09e000006057f",
      "text": " GTDのフローチャート通りに判断するなら、この執筆アイデアの断片は「行動すべきか」を問われるべき。行動する必要がないなら、必要になったときに取り出せる形で資料として保存すべき。これも行動だな。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496224029,
      "updated": 1496224037
    },
    {
      "id": "592e9125aff09e0000060580",
      "text": " レゴブロックを整理するかしないかと、クリエイティビティとの関係について考えている。確実に言えることは、同じ作業を繰り返す場合には最初に整理するコストを後の生産性向上がペイすること、でも後から楽になるという口実で整理や準備ばっかりやって作り始めない人は何も創造できないということ。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496224037,
      "updated": 1496224045
    },
    {
      "id": "592e9147aff09e0000060583",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496224071,
      "updated": 1496224071
    },
    {
      "id": "592e9148aff09e0000060584",
      "text": "\tここまでやって飽きた",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496224073,
      "updated": 1496224079
    },
    {
      "id": "592e9146aff09e0000060582",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496224070,
      "updated": 1496224081
    },
    {
      "id": "592e912caff09e0000060581",
      "text": " そうですね、「記述力」を「記述できる範囲の広さ」と定義しているなら細粒度であるほうが大きいという主張は納得できますが「記述したい内容を自分の言語では記述できなくて困っている」という人は一体どれほどいるのでしょうね。RT  忙しさには定量的な尺度がないので本当に逼迫しているかどうかは評価できないので、判断するときに（稼働が）逼迫している、とかいう人は信用しないことにしている。「定量化できる尺度は過去の延長線上でしかないので新しいものを生み出すことはできない」という主張、心情的には共感する部分がなくもないが、それをいう人間が新しいものを生み出していない場合は非常にダサい。あと個人的に一番有用だと思っている新しいものを生み出す手法はやっぱ定量化してる。逆の見方をすれば、僕が「目的化」という言葉を狭い意味で使ってるのか？インプットとアウトプットのどちらが大事か、という議論が不毛なのは対象が明確でないからだ。言われた仕事をするだけで自発的に学ばない人にはもっと入力を増やせ、机上のお勉強ばかりで行動しない人にはもっと出力を増やせ、と対象によってかわる。「自分をデフラグする方法」が欲しい。  「自分をクラウド化する方法」とか「自分をAR化する方法」とか「自分を仮想化する方法」とか「自分をタイムシェアリングする方法」とか。「自分を再起動する方法」は特にニーズがあると思う。このモデルは現実の一部をうまく描写できてそうだけど、書いていて思ったのは先行者に参入障壁を作る能力がないし、成功した情報が全員に筒抜けだから、後から参入した人のせいで自分の利潤が下がることを防げないなー。飛び地を見つけて他人が気づく前に参入障壁作れるといいのだけど。多様性のためには評価尺度の多様性も必要なのか低い確率を高く見積もるの、個としては非合理的に見えるけど、得られるものが知識のような他人に複製できるものの場合は集団の利益が個の利益より桁違いに大きいから、合理的なリスクも大きくなるよな。言語と社会を手にいれた生物としては個として非合理に振る舞う進化が合理的だったのかもしれないな人間の認知能力の限界に合わせて適度な複雑さにコントロールして提示するシステムが必要だ。ゲームのバランス調整と同じだ。別に彼に見える形で「彼よりもっと優れた人がいたから解雇する」とか「要求仕様は満たしてないとは言いがたいがあんまり求めていたものは得られなかった」とか書く必要ないな、と思ったので「Thanks!」で済ませることにした。ニーズを理解した後でそれをどうやってみたすか考えるのはエンジニアリングだけど、そもそものニーズを見つけるのはマーケティングなのかな。顧客がニーズを言語化できているとは限らない。人間観察と人間理解が必要なのかな。周りが指数的に成長している時に、線形に成長している人は成長していないも同然だ。だが、それも成長ではある。他人の行った設計判断に関して、満たすべき要求や利用可能なリソースの制限などを詳しく知らない外野が四の五の言うのは無益だなと思った。みんな与えられた状況の中で最善を尽くしてるんだよね。だって適切な設計判断をできる人がいないことも与えられたリソースの制限なのだから。デマを減らすシステム作りが必要だ。だけど多数決ではデマかどうかの判断はできない。システムが何が正しいかを判断しようとするのはやめたほうがよいのかもしれない。システムは判断材料の収集と整理を促すような設計にするのはどうだろう。続き、つまり自分が主でやり方が従、自分が変えたい破りたいと思ったら、変えたり破ったりすることに何のためらいもない。一方真似をしている側はやり方を自分より優れた人が作り出した自分よりも素晴らしいものと認識していて主従が逆、やり方に自分を合わせようとする。ここが違いなのではないか？RT  知識とは、個人や組織が何らかの成果をもたらすような行動を可能にし、何かあるいは誰かを変えるものである。知識とは何かを変えるものであることを認識するだけでも、何かが変わっていく。ふと思ったんだが、マネジメント本とデザパタ本には共通点があるように思う。共通のデメリットは、書かれていることを盲信する信者の発生。共通のメリットは、考えたり話したりするための共通語彙を作ること。そう考えると、解決すべきは盲信の発生じゃなかろうか。いかにたくさんの情報をインプットするかや、どうやって深い理解につなげるのかだけではなく、いかに復習をするかが重要だと思うが、よい復習の仕方はどうすれば学べるのだろうか？顧客のニーズが最優先です！！囚人のジレンマ的な自分の視野だけで最適化するとタカが選ばれて全体最適でなくなるような状況下で、全体最適で期待値の大きな解が選ばれる状況を作るには、期待値が高いことを好ましいと考える外的圧力の存在が必要。全体最適という言葉は基準に解釈揺れがあるから期待値の最大化と呼ぶべきか。これをよい言葉だと思う人には、自分に意思決定の責任があると考える人と、権利があると考える人の二種類がある。RT  肉体労働者は、何をなすべきかは指示されるものとしていた。これに対し知識労働者は、自らの専門分野では自らが意思決定を行うべきものとする。RT  抽象的な内容を具体例を経ないで理解できるか？　おそらく難しい。教科書で理論だけ学んでも、応用につながらない。経験という「根」と結びつかないと応用できる知識にならない。具体例を通じて理解する。ただ、この理解で正しいかどうかは、どう分かるか？バッドパターンとして「宗教論争」「自転車置き場」の他に「自分で実用上どういうメリットがあるか説明できない概念を持ち出して、その概念を知っている自分を偉く見せる」という行動パターンに名前をつける必要性を感じる。難易度が高そうだからといって挑戦しない人は、失敗から逃げることで、困難な課題に打ち勝つという成功体験からも逃げている。そして成功体験を得られないからなおさら自信をなくしていく。でも拘束時間あたりの生産性を考えるならそういう意見出しに向いていない人は畑仕事に戻ってもらって、ハンドアックス投げ合っても死なないようなモヒカン集団で殴り合いをした方が効率いいんじゃないのかなー「時間がないのではない、時間は作るんだ」という言い回しはよく聞くが今までその意味を理解できていなかった。不足しているのは時間ではなくやる気なんだな。やる気があれば「時間ができたらやろう」と言って思考停止したりしない。うーん、それは事後に知った情報を事前にも知りえたって前提をおいているような。 “  小崎さんクラスを求めるなら、仕事をサボることも許容できないとダメ、ということなのでは。仕事もサボらせないなら、大した人材は確保できない、みたいな。”どちらも自分にはコントロールできない大きなシステムに判断を委ねているという意味では同じだが、そのシステムの無謬性を信じるのかどうかとか、そのシステムに人間のような人格があるのかどうかとかが違うのかな。神に人格を仮定しないキリスト教徒と話してるとその信仰なら信じていいかなーとも思う主観で信じている内容が自分と異なる人がいたとしても、それを変えさせる理由にはならない。具体的な問題が発生していなければ何を信じてようが問題ないし、問題が発生しているならその問題の解決法を考えるべき。他人の信念を変えさせるのは一つの解決法ではあるが最適な手段とは限らない。結局のところ、知識を入手したい側としては手軽に入手したいけども、提供する側のメリットは何かというわけで。「他人の意見を聞き、自分の意見と比較し、より優れた方を採用する」という認知機能に障害をきたした人のうち、話者より年齢が高いひと。  老害とは何か。120文字で記せ。正しいことをしようと思ったときに「自分の信じる人が正しいと言うことをやる」というアプローチと「自分が正しいと思うことをする」というアプローチの2つがある。前者の場合信じることの出来る適当な対象が見つからないと不安になる。後者の場合は自分の判断が正しいかどうか不安になる。大差ない。理解を確認するためには、アウトプットして、自分の外のシステムが自分の理解通りの反応をするか観察するしかない。理解通りの反応をしなければ理解の誤りが確認できる。理解通りの反応をしても理解が正しい保証にはならない。たまたまかも知れない。どんなに努力をしても100%の理解は得られない。それは意外といい着眼点かも知れない。ニッチ市場ではあるが需要はある。問題は「どうすれば出来るか」という知識がまだ発見されていないところかも。それができれば与えられたデータから「この単語は重要」と判断するだけでなく「この単語は重要そうだけどデータが足りなくて自信がないなぁ、もっとデータくれよ」という判断もできるようになる。単なるXの一種ってだけなのに、Xという言葉の定義を掘り下げた結果たくさんの用語の定義が必要になり、それを頑張って習得した人はその労力に見合うリターンを期待するがそれを与えられないので、飢える。飢えた結果さらなる解説を求めたり、自分の理解を書いて誰かが教えてくれないかと期待する。単なる肯定、賛同のコメントには情報量がないから今まで省いていたのだけど、そうすると否定、不同意の時には言及しなければいけなくなる。不同意をスルーするために賛同のコメントが必要なのか。単なる賛同じゃなくて、理解した内容を自分の言葉で言い換えれば情報量ゼロとはならないか。自分で調べて書くのよりも知っている人がいるときに話を振って教えてもらったほうが圧倒的に効率がいいなぁ。自分で勉強するのが嫌になるなぁ。と思ったけど、自分で勉強する姿勢とか、適切な質問を選ぶ知識がなければそもそも教えてももらえないのかもなぁ、と思い直した。その4倍活動するノウハウがプラシーボかどうかは重要ではなくて、重要なのはそれを他人に移転するコストの多寡じゃないのかな僕自身は現状、チケットでコミュニケーションしてないから、自分のタスク管理を改善する方向にしか目が向いてないナウ「効率よく何々する」の効率を「効果を出すために行動した時間で得られた効果を割ったもの」と考えるか「効果が得られるまでに掛かった時間で効果を割ったもの」と考えるかで最適な行動が異なるよね。前者だとやり方を考えてる時間が分母に入ってないから時間を掛けて悩むことが正当化される。「定量的でない目標に意味はない」を読んで思ったこと。ドラッカーボットの「知識社会は上司と部下の社会ではない」をRTしている人がいっぱいいるが、それは絶え間ない学習と高度な専門知識の結果組織内に自分を超える人がいなくなった状態(それができない人はリストラ済み)だということがわかってるんだろうか。ドラッカーのマネジメントを読んでる。自社とはなにか、顧客とはなにか。普通に考えると僕は平社員だから僕がマネジメントする自社とは自分自身のことで、顧客とは僕が作り出す知識やサービスに支払いをする主体だから勤めてる会社ってことになるんだろうな。階層組織が生まれた一つの理由は、情報流通の手段・システムが今ほど進歩してなかった時代には、人間が情報の流通に携わっていて、人間の能力の限界によって1人の人のハンドリングできる人数があまり多くなかったから分割統治せざるを得なかった、ということだと思ってる繰り返される作業をよく観察し、時間がかかっている部分や失敗の多い部分を道具の改善で回避できないか考える。いまTwitterクライアントを夜フクロウにした。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496224045,
      "updated": 1496224307
    },
    {
      "id": "592e921caff09e0000060585",
      "text": " 自閉症児の教育に関しては「まずは成功させてゴールを理解させる必要がある」ということでフルプロンプトで手助けをして成功させ、次にバックワードチェイニング(タスクの流れの後ろから徐々に自分でやる量を増やす)をする、っていう報告をした。伝わったかなー。そういう意味で新しいプログラミング言語を学ぼうという時に「理解する」ではなく「理解はさておき写経する」という目標設定をするのは合理的なんだよな。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496224307,
      "updated": 1496227465
    },
    {
      "id": "592e9e89aff09e0000060586",
      "text": " 高いのを買っちゃえば自分の行動を正当化するために変わらざるをえないよ笑チューニングの為には計測が重要だ、仮説検証の為には定量的指標が必要だ、という主張には異論はない。しかしそれをやる前に、何をチューニングするべきか、何が検証すべき仮説か、を見出すことが必要だ。それはどうやって見出すのか？次にゴールが明確に言語化されてないタスクはアウトソースしにくい。明確化することが仕事であるような場合は特に。これはタスクの達成条件を明確にできないから。ある意味これは、社内にある「会社が何を求めているか」という言語化されてない知識に依存したタスクだとも言えるので先のと少しかぶる。「タスクをとにかく自分が使い易くてかつ揮発しない何かに書きだすべき」って鉄則は多くのタスク管理手法に共通して出てくるから重要な要素なんだ。タスクのブレイクダウンもよく出てくる。しかしその具体的な方法論があまり議論されていない。世間の評価を完全に無視でいいとは思わないけど、世間の評価と自分の信念が食い違う場合には信念の方を優先せよという意味に解釈すればいいのかなその主張は「思い込みを訂正するコストのほうが、間違った思い込みが発生し得ない解説文で学ばせるコストよりも高くつく」という意味に解釈してよいですか？だとするとそれは先ほど根拠がないと指摘した内容を、表現を変えて繰り返しているだけですよね？だから「市場で答えが流通していないような問題」を見付け出す能力とセットにならなければ、論理的思考能力は価値を生み出しづらい、それが高度情報化社会の自然な帰結なのでは。数式を含んだ論文を読んで理解するというタスクにも生産性向上の方法論があるのではないかなどと考えていて、明日は読むべきものが38ページくらいあるから実験ができる。RT  自己開発とは、スキルを修得するだけでなく、人間として大きくなることである。責任に焦点を合わせるとき、人は自らについてより大きな見方をするようになる。うぬぼれやプライドではなく誇りと自信。一度身につけてしまえば失うことのない何か。目指すべきは ...RT   ということは、抽象度の低い、ライブラリの少ない言語で同じ事をするためには、抽象化を補うための高い思考力と大量のライブラリを作成する体力と記憶力がプログラマーに要求されるわけですね。自分がやるより人に頼んだ方がよいと頭でわかっていながら、頼む行為を自分が劣った人間と考えてしまっていて、自尊心を傷つける痛みと自分がやるべきでないという考えで板挟みになっているケース、、素人考えで思いつくことは玄人さんはほとんどの場合検討済だが、たまーに斬新なアイデアがある。しかし素人さんにはもちろん斬新であるかどうかの判断能力がなく玄人さんには素人さんのアイデアをレビューする時間がない、どうしたらよいでしょうか（質問かよ）RT4:知識の結合は意図して起こすことができない。予期せず起こる結合。理解をTODOにすることはできない。理解できたかどうかは主観によって測ることができない。アウトプットの質でしか測ることができない。理解をゴールにすることもできない。知的作業の生産性はやり方の設計によって左右される。優先すべきタスクがあると自覚していながら別のタスクをしてしまうのは、心の中にその優先タスクを実行するのを妨げている何かがあるということだから、それがなんなのか自分の心と向き合って考えないといけないねぇ。難しい。RT   その例えで言うと、その人のコーディングスキルを高めるためのコストを自分が教える側として負担したいかどうかって話だと思うのです。そんなコストかけたくない、そのくらいのスキルは持っててくれ、持ってないなら派遣契約切って別の人をアサイン ...RT  更に深い面倒臭さは、「パートナーへの印象が悪い」自覚が無い場合、自分がおかれてる状況の深刻さを「技術的問題」と「与えられた権限が不適切なので実行に移せない」ってセットとして認識してる場合。己が恨みを良心が隠して、結果的に見当違いな義憤を高めてしまう",
      "userId": "582e63d27c56960011aff09e",
      "created": 1496227465,
      "updated": 1496227465
    }
  ]
}