{
  "id": "59d757779d071300121e88a1",
  "title": "似ている代用品は満足度を下げる",
  "created": 1507284859,
  "updated": 1507295800,
  "lines": [
    {
      "id": "59d757779d071300121e88a1",
      "text": "似ている代用品は満足度を下げる",
      "userId": "582e63d27c56960011aff09e",
      "created": 1507284859,
      "updated": 1507295033
    },
    {
      "id": "59d78008aff09e00001264be",
      "text": "高級チョコが食べられない時に、代わりに類似度の高い安いチョコを食べた場合と類似度の低いグラノーラバーを食べる場合を比較。人々は類似度の高いものを食べた方が満足度が高いと考えているが、しかし、類似度が高いために好ましくないネガティブな対照効果を引き起こし、類似度の低い代替品の方がより効率的に満足度を高める。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1507295240,
      "updated": 1507295504
    },
    {
      "id": "59d78139aff09e00001264c1",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1507295545,
      "updated": 1507295545
    },
    {
      "id": "59d78139aff09e00001264c0",
      "text": "高級チョコを食べ続けた人と、グラノーラバーを食べた人の満足度が同程度であることから、似た[代替品]を食べると[満足度]が下がるという解釈もできる。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1507295545,
      "updated": 1507295800
    },
    {
      "id": "59d7822caff09e00001264c2",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1507295789,
      "updated": 1507295789
    },
    {
      "id": "59d77f3baff09e00001264bc",
      "text": "http://journals.sagepub.com/doi/abs/10.1177/0956797616640705",
      "userId": "582e63d27c56960011aff09e",
      "created": 1507295035,
      "updated": 1507295040
    },
    {
      "id": "59d75780aff09e00004ec434",
      "text": ">When people cannot get what they want, they often satisfy their desire by consuming a substitute. Substitutes can originate from within the taxonomic category of the desired stimulus (i.e., within-category substitutes) or from a different taxonomic category that serves the same basic goal (i.e., cross-category substitutes). Both a store-brand chocolate (within-category substitute) and a granola bar (cross-category substitute), for example, can serve as substitutes for gourmet chocolate. Here, we found that people believe that within-category substitutes, which are more similar to desired stimuli, will more effectively satisfy their cravings than will cross-category substitutes (Experiments 1, 2a, and 2b). However, because within-category substitutes are more similar than cross-category substitutes to desired stimuli, they are more likely to evoke an unanticipated negative contrast effect. As a result, unless substitutes are equivalent in quality to the desired stimulus, cross-category substitutes more effectively satisfy cravings for the desired stimulus (Experiments 3 and 4).",
      "userId": "582e63d27c56960011aff09e",
      "created": 1507284864,
      "updated": 1507295218
    }
  ]
}