{
  "id": "59ffef926f27960012856223",
  "title": "ボドゲキャンプレポート",
  "created": 1509945277,
  "updated": 1509945486,
  "lines": [
    {
      "id": "59ffef926f27960012856223",
      "text": "ボドゲキャンプレポート",
      "userId": "582e63d27c56960011aff09e",
      "created": 1509945277,
      "updated": 1509945283
    },
    {
      "id": "59ffefc2aff09e0000d53e43",
      "text": "サイボウズのボードゲームキャンプの参加レポートから公開してもよさそうなところを抜粋",
      "userId": "582e63d27c56960011aff09e",
      "created": 1509945283,
      "updated": 1509945299
    },
    {
      "id": "59ffefd3aff09e0000d53e45",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1509945299,
      "updated": 1509945299
    },
    {
      "id": "59ffefdbaff09e0000d53e46",
      "text": " 「[コヨーテ]」。これは自分の持っているカードの数値だけがわからず、他の人の数値は見ることができる、という状況でみんなの数字の合計値を考えるゲームです。自分には見えないものが、他の人には見えているので、他の人の振る舞いから自分の持っている数値が何であるのかを察しようとするゲームプレイが行われます。直前の人の発言を否定する時には「コヨーテ！」と言うのですが、自分に見える情報から判断して「当然これぐらいの値だろう」と思い込み、自信満々で「コヨーテ！」と言ったのに、自分がレアなカードを持っていたため前の人の発言は間違ってなかった！というようなことが起こります。もちろん自分がレアなカードを持っていることは、自分以外はみんな知っていたのです。自分には見えないこともあるから、見える情報だけで判断すると間違えることがある、ということが学べるゲームでした。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1509945307,
      "updated": 1509945486
    },
    {
      "id": "59ffeff2aff09e0000d53e47",
      "text": " 「[エセ芸術家ニューヨークへ行く]」はみんなで協力して一つの絵を仕上げるゲームです。何の絵を描くか(テーマ)は事前にみんなに伝えられます。しかし誰か一人だけ伝えられていない人がいて、彼を「エセ芸術家」と呼びます。情報共有がされてないだけのにエセ呼ばわりとか酷い。しかしこのゲームのルール上はエセ芸術家であることがばれると負けなので「自分に情報共有がされてない！」と言うことができません。そこで、ちゃんと情報共有されている振りをして、他のみんなと協調して絵を描いていくことになります。エセ芸術家は、自分がエセ芸術家であることがばれない、もしくは、ばれてもテーマを答えられれば勝利。他のプレイヤーは、エセにテーマがばれてはいけないので、あえて曖昧な絵を描く嫌がらせをします。エセが勘違いをすることで、誰がエセなのかあぶり出そうというわけです。しかし、そういう嫌がらせをしつつも、曖昧な絵ばかり描いていると「この人は実はエセで、テーマがわからないから何とでも取れる絵を描いているのでは」と他の人から疑われることになります。「自分はテーマを知っていてエセではない」と同僚にアピールしつつ、エセにはテーマがばれないように振舞うことになるゲームです。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1509945330,
      "updated": 1509945481
    },
    {
      "id": "59ffefd3aff09e0000d53e44",
      "text": "  組織がこういう状態になったらヤバいですね。しかし逆に言えば「ヤバい組織はどういう状態か」を安全に体験できる手段として、ボードゲームは有効です。実際の組織でヤバい状態を体験する事態になったら、もう取り返しがつきません。ゲームとして体験することで、情報共有は大事だなぁ、情報共有に漏れがあった時には「わかってるふり」をするのではなく、「情報共有されてないよ！」とアピールすることが大事だな、そしてそれができる状態を保つためにはこのゲームみたいに「情報共有されていないことがバレたら負け」にしてはいけないのだな、ということがわかります。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1509945299,
      "updated": 1509945392
    },
    {
      "id": "59fff010aff09e0000d53e48",
      "text": " 「[アヴァロン]」は、プロジェクトを失敗させようとする悪い人が複数人プレイヤーの中に混ざっている中でなんとかプロジェクトを成功させようと頑張るゲームです。悪者はお互いに仲間を知っています。持ち回りのリーダーが、プレイヤーの中からプロジェクト遂行チームのメンバーを選ぶのですが、悪い人を選ぶとプロジェクトが失敗しうるので、良い人を選ぼうと気を付ける必要があります。なので、誰が悪い人だろう、とみんなで相談していくのだが、もちろんその「みんな」の中に複数人の悪い人が混ざっているので、彼らは良い人に嫌疑が向くようにふるまいます。これもまたヤバい組織ですね。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1509945360,
      "updated": 1509945473
    },
    {
      "id": "59fff011aff09e0000d53e49",
      "text": "  良い人が自分の意見を言い、それに対して別の良い人が疑問に思い反論したとしましょう。うっかりすると、その良い二人がお互いに「相手が悪い人に違いない」と思い込んで泥沼の戦いを始めるわけです。本当に悪い人は心の中でニヤニヤしながら良い人同士が潰しあうのを眺め、時々火に油を注いだりします。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1509945361,
      "updated": 1509945408
    },
    {
      "id": "59fff011aff09e0000d53e4a",
      "text": " 「[ボブジテン]」はお題のカタカナ語を、カタカナ語を一切使わずに説明して、周りで聞いている人がそれを当てるゲームです。説明する役の人は、言葉が制限される中で伝えたいことをなんとかして表現しようと頑張ります。周りの人は、要領を得ない説明を忍耐強く聞いて、何を表現しているのか汲み取ろうと頑張ります。内田さんはボウズペディアからお題をだしたら面白いのではないかと言うのだけども、まずはみんな「グループウェア」をカタカナ語なしで説明することに挑戦してみるとよいかと。このゲームでは回答者は一度しか回答できず、しかも早い者勝ち。なので説明の順番が適切でない場合、例えば「バニラ」を説明しようとして「白くて甘くて冷たい洋菓子で…」って説明した時点で回答者が「アイスクリーム！」と言ってしまったりします。誤解を招かない説明の順番、最初に言うべきことは何か、を考えさせられるゲームです。伝える側も聞く側もコミュニケーションスキルが鍛えられるゲームでした。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1509945361,
      "updated": 1509945468
    },
    {
      "id": "59fff011aff09e0000d53e4b",
      "text": " 「[ガイスター]」は2人対戦のボードゲームで、それぞれ「良いおばけ」「悪いおばけ」を4匹ずつ持ってプレイします。相手の良いおばけを全部倒せば勝ち。相手のどのおばけが良いおばけなのかはわからないので、相手の振る舞いをよく観察することで意図を推測し、自分に見えない情報を察しようとするゲームです。他人の思考を自分の中で真似してみることで「相手がこう行動したということは、きっと相手に見えている情報はこうなのだろう」と考えていくゲームです。2人プレイのゲームなので今回のキャンプではあまり流行りませんでした。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1509945361,
      "updated": 1509945465
    },
    {
      "id": "59fff06faff09e0000d53e4c",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1509945456,
      "updated": 1509945457
    }
  ]
}