{
  "id": "5ce4e1e4bc7e970017507e77",
  "title": "Excerpt from Daniel",
  "created": 1558503909,
  "updated": 1558503909,
  "lines": [
    {
      "id": "5ce4e1e4bc7e970017507e77",
      "text": "Excerpt from Daniel",
      "userId": "582e63d27c56960011aff09e",
      "created": 1558503909,
      "updated": 1558503909
    },
    {
      "id": "5ce4e1e5aff09e00006ca3c6",
      "text": "from [pIntEn]",
      "userId": "582e63d27c56960011aff09e",
      "created": 1558503909,
      "updated": 1558503909
    },
    {
      "id": "5ce4e1e5aff09e00006ca3c7",
      "text": "Excerpt from Daniel",
      "userId": "582e63d27c56960011aff09e",
      "created": 1558503909,
      "updated": 1558503909
    },
    {
      "id": "5ce4e1e5aff09e00006ca3c8",
      "text": "Suggested extra paragraphs on the tail of 1.2.1.1",
      "userId": "582e63d27c56960011aff09e",
      "created": 1558503909,
      "updated": 1558503909
    },
    {
      "id": "5ce4e1e5aff09e00006ca3c9",
      "text": ">Behavioral scientists often divide what we do on the job or learn in school into two categories: algorithmic and heuristic. An algorithmic task is one in which you follow a set of established instructions down a single pathway to one conclusion. That is, there's an algorithm for solving it. A heuristic task is the opposite. Precisely because no algorithm exists for it, you have to experiment with possibilities and devise a novel solution. Working as a grocery checkout clerk is mostly algorithmic. You do pretty much the same thing over and over in a certain way. Creating an ad campaign is mostly heuristic. You have to come up with something new.",
      "userId": "582e63d27c56960011aff09e",
      "created": 1558503909,
      "updated": 1558503909
    },
    {
      "id": "5ce4e1e5aff09e00006ca3ca",
      "text": "> During the twentieth century, most work was algorithmic and not just jobs where you turned the same screw the same way all day long. Even when we traded blue collars for white, the tasks we carried out were often routine. That is, we could reduce much of what we did in accounting, law, computer programming, and other fields to a script, a spec sheet, a formula, or a series of steps that produced a right answer. But today, in much of North America, Western Europe, Japan, South Korea, and Australia, routine white-collar work is disappearing. It's racing offshore to wherever it can be done the cheapest. In India, Bulgaria, the Philippines, and other countries, lower-paid workers essentially run the algorithm, figure out the correct answer, and deliver it instantaneously from their computer to someone six thousand miles away.",
      "userId": "582e63d27c56960011aff09e",
      "created": 1558503909,
      "updated": 1558503909
    },
    {
      "id": "5ce4e1e5aff09e00006ca3cb",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1558503909,
      "updated": 1558503909
    }
  ]
}