{
  "id": "60af681e22540c001eb8dabe",
  "title": "Successful intelligence: finding a balance",
  "created": 1622108202,
  "updated": 1622108221,
  "lines": [
    {
      "id": "60af681e22540c001eb8dabe",
      "text": "Successful intelligence: finding a balance",
      "userId": "582e63d27c56960011aff09e",
      "created": 1622108202,
      "updated": 1622108202
    },
    {
      "id": "60af6829aff09e0000d68625",
      "text": ">Abstract",
      "userId": "582e63d27c56960011aff09e",
      "created": 1622108202,
      "updated": 1622108203
    },
    {
      "id": "60af682aaff09e0000d68627",
      "text": "> Human intelligence has long been on the borderline between a scientific and a quasi-scientific field within the scope of psychological science. This is partially because its study and measurement have been particularly susceptible to socio-political agendas, but also because empirical tests of theories of intelligence have too often ranged from inadequate to nonexistent. In this article it is argued that two extremes have prevailed in the study of intelligence. At one extreme are general-ability (g) theorists, who have collected large amounts of data to test the theory of general intelligence, but often using restricted ranges of participants, materials or situational contexts. They also show a tendency to limit their methods of data analysis (e.g. to exploratory factor analysis). At another extreme are theorists arguing for new, multiple intelligences, whose theories have been subjected to few or no empirical tests. I argue that a middle ground is needed that recognizes the multifarious nature of intelligence and of people’s conceptions of it, but that also is subjected to rigorous empirical tests.",
      "userId": "582e63d27c56960011aff09e",
      "created": 1622108203,
      "updated": 1622108203
    },
    {
      "id": "60af682aaff09e0000d68626",
      "text": "Sternberg, R.J., 1999. Successful intelligence: Finding a balance. Trends in cognitive sciences, 3(11), pp.436-442.",
      "userId": "582e63d27c56960011aff09e",
      "created": 1622108203,
      "updated": 1622108220
    },
    {
      "id": "60af683caff09e0000d68629",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1622108221,
      "updated": 1622108221
    },
    {
      "id": "60af683daff09e0000d6862a",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1622108221,
      "updated": 1622108221
    },
    {
      "id": "60af683baff09e0000d68628",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1622108220,
      "updated": 1622108220
    }
  ]
}