{
  "id": "619a2e08a3286d001f1d619e",
  "title": "Eliciting Metaphor through Clean Language: An Innovation in Qualitative Research",
  "created": 1637494290,
  "updated": 1637494379,
  "lines": [
    {
      "id": "619a2e08a3286d001f1d619e",
      "text": "Eliciting Metaphor through Clean Language: An Innovation in Qualitative Research",
      "userId": "582e63d27c56960011aff09e",
      "created": 1637494290,
      "updated": 1637494290
    },
    {
      "id": "619a2e39aff09e0000800797",
      "text": "Eliciting [Metaphor] through [Clean Language]: An Innovation in [Qualitative Research]",
      "userId": "582e63d27c56960011aff09e",
      "created": 1637494330,
      "updated": 1637494341
    },
    {
      "id": "619a2e4caff09e0000800798",
      "text": "\t[メタファ] [質的研究]",
      "userId": "582e63d27c56960011aff09e",
      "created": 1637494348,
      "updated": 1637494379
    },
    {
      "id": "619a2e11aff09e0000800794",
      "text": "\t>Abstract",
      "userId": "582e63d27c56960011aff09e",
      "created": 1637494290,
      "updated": 1637494291
    },
    {
      "id": "619a2e13aff09e0000800796",
      "text": " > This paper shows how an innovative method of questioning called [Clean Language] can enhance the authenticity and rigour of interview-based qualitative research. We investigate the specific potential of Clean Language as a method for eliciting naturally occurring metaphors in order to provide in-depth understanding of a person's symbolic world; despite substantial interest in metaphors in the field of organizational and management research there is a lack of explicit, systematic methods for eliciting naturally occurring metaphors. We also demonstrate how Clean Language can improve qualitative research more widely by addressing the propensity for researchers inadvertently to introduce extraneous metaphors into an interviewee's account at both data collection and interpretation stages. Data are presented from a collaborative academic–practitioner project in which Clean Language was used as a method of interviewing to elicit the metaphors of six mid-career managers, relating to the way they experienced work–life balance. The first contribution of this paper is to demonstrate the potential of Clean Language for eliciting naturally occurring metaphors in order to provide in-depth understanding of a person's symbolic world. The second contribution is to show how Clean Language can enhance the rigour and authenticity of interview-based qualitative research more widely.",
      "userId": "582e63d27c56960011aff09e",
      "created": 1637494291,
      "updated": 1637494296
    },
    {
      "id": "619a2e12aff09e0000800795",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1637494290,
      "updated": 1637494290
    }
  ]
}