{
  "id": "61b75915508bec001d5b56bb",
  "title": "Repulsive Curves",
  "created": 1639405847,
  "updated": 1639405906,
  "lines": [
    {
      "id": "61b75915508bec001d5b56bb",
      "text": "Repulsive Curves",
      "userId": "582e63d27c56960011aff09e",
      "created": 1639405847,
      "updated": 1639405847
    },
    {
      "id": "61b75921aff09e0000f33173",
      "text": "http://www.cs.cmu.edu/~kmcrane/Projects/RepulsiveCurves/index.html",
      "userId": "582e63d27c56960011aff09e",
      "created": 1639405857,
      "updated": 1639405857
    },
    {
      "id": "61b75916aff09e0000f33172",
      "text": "ACM Transactions on Graphics 2021",
      "userId": "582e63d27c56960011aff09e",
      "created": 1639405847,
      "updated": 1639405847
    },
    {
      "id": "61b75930aff09e0000f33174",
      "text": ">Curves play a fundamental role across computer graphics, physical simulation, and mathematical visualization, yet most tools for curve design do nothing to prevent crossings or self-intersections. This paper develops efficient algorithms for (self-)repulsion of plane and space curves that are well-suited to problems in computational design. Our starting point is the so-called tangent-point energy, which provides an infinite barrier to self-intersection. In contrast to local collision detection strategies used in, e.g., physical simulation, this energy considers interactions between all pairs of points, and is hence useful for global shape optimization: local minima tend to be aesthetically pleasing, physically valid, and nicely distributed in space. A reformulation of gradient descent, based on a [Sobolev-Slobodeckij inner product] enables us to make rapid progress toward local minima—independent of curve resolution. We also develop a hierarchical multigrid scheme that significantly reduces the per-step cost of optimization. The energy is easily integrated with a variety of constraints and penalties (e.g., inextensibility, or obstacle avoidance), which we use for applications including curve packing, knot untangling, graph embedding, non-crossing spline interpolation, flow visualization, and robotic path planning.",
      "userId": "582e63d27c56960011aff09e",
      "created": 1639405873,
      "updated": 1639405906
    },
    {
      "id": "61b75930aff09e0000f33175",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1639405873,
      "updated": 1639405873
    }
  ]
}