{
  "id": "61e91b3cb3495c001e9efa10",
  "title": "(5.2.4.4) Problem of making classification criteria in advance",
  "created": 1555310728,
  "updated": 1555311249,
  "lines": [
    {
      "id": "61e91b3caff09e0000d0b58c",
      "text": "(5.2.4.4) Problem of making classification criteria in advance",
      "created": 1555310728,
      "updated": 1555310750,
      "userId": "582e63d27c56960011aff09e"
    },
    {
      "id": "61e91b3caff09e0000d0b58d",
      "text": "When creating criteria for classification by yourself, there is a chance to create a new structure rather than using borrowed criteria. However, when preparing classification criteria in advance and classifying pieces according to the criteria, we often encounter pieces which can not be classified well. When we encounter such a piece, we tend to think which group is correct. However, the question is valueless. You can not judge the correct group immediately. The fact shows that the criteria are not appropriate.",
      "created": 1555310741,
      "updated": 1555310757,
      "userId": "582e63d27c56960011aff09e"
    },
    {
      "id": "61e91b3caff09e0000d0b58e",
      "text": "",
      "created": 1555310741,
      "updated": 1555310741,
      "userId": "582e63d27c56960011aff09e"
    },
    {
      "id": "61e91b3caff09e0000d0b58f",
      "text": "To create appropriate classification criteria, you need to understand the [overall picture] of what kind of pieces are. However, as there is too much information to grasp, you wanted to organize them. In this case, you can not make appropriate classification criteria in advance. The criteria which made in advance without grasping the whole picture are wrong with high probability.",
      "created": 1555310741,
      "updated": 1555311249,
      "userId": "582e63d27c56960011aff09e"
    },
    {
      "id": "61e91b3caff09e0000d0b590",
      "text": "",
      "created": 1555310768,
      "updated": 1555310768,
      "userId": "582e63d27c56960011aff09e"
    },
    {
      "id": "61e91b3caff09e0000d0b591",
      "text": "You did not notice the existence of things that can not be classified well at the time of preparing classification criteria in advance. In other words, there is a [blind spot]. By encountering a piece which can not be classified well, you notice the blind spots. It is a chance to break the existing frame of beliefs, and to create a new framework. At this timing, you should let go of the old classification criteria.",
      "created": 1555310741,
      "updated": 1555310766,
      "userId": "582e63d27c56960011aff09e"
    },
    {
      "id": "61e91b3caff09e0000d0b592",
      "text": "",
      "created": 1555310741,
      "updated": 1555310741,
      "userId": "582e63d27c56960011aff09e"
    },
    {
      "id": "61e91b3caff09e0000d0b593",
      "text": "Unfortunately, we feel difficulty to [let it go]. We often disregard the information of the blind spot and keep the old classification criteria. However, if you throw away the blind spot information, what you get is the same structure as the classification criteria you make in advance. There is no meaning to do the KJ method.",
      "created": 1555310741,
      "updated": 1555311236,
      "userId": "582e63d27c56960011aff09e"
    },
    {
      "id": "61e91b3caff09e0000d0b594",
      "text": "",
      "created": 1555310774,
      "updated": 1555310774,
      "userId": "582e63d27c56960011aff09e"
    },
    {
      "id": "61e91b3caff09e0000d0b595",
      "text": "So, when you do the KJ method, it is important not to have classification criteria in advance. Sometimes we have it unconsciously. You need to keep in mind that the preliminary classification criteria are provisional criteria. If there are pieces that can not be classified well, the classification criteria should change. The [concrete information] written on the piece is more important than the criteria. The subjective interpretation of how to structure it depends on specific information.",
      "created": 1555310741,
      "updated": 1555311205,
      "userId": "582e63d27c56960011aff09e"
    },
    {
      "id": "61e91b3caff09e0000d0b596",
      "text": "",
      "created": 1555311195,
      "updated": 1555311195,
      "userId": "582e63d27c56960011aff09e"
    },
    {
      "id": "61e91b3caff09e0000d0b597",
      "text": "[en.icon]",
      "created": 1555311249,
      "updated": 1555311249,
      "userId": "582e63d27c56960011aff09e"
    }
  ]
}