{
  "id": "61e91b38e9993c001e7e72db",
  "title": "(1.2.5.3) It has been revised, or it is a long seller",
  "created": 1547626453,
  "updated": 1553660154,
  "lines": [
    {
      "id": "61e91b38aff09e00005f1886",
      "text": "(1.2.5.3) It has been revised, or it is a long seller",
      "created": 1547626453,
      "updated": 1553660154,
      "userId": "582e63d27c56960011aff09e"
    },
    {
      "id": "61e91b38aff09e00005f1887",
      "text": "The existence of a revised version indicates that there was a substantial addition or correction of information so that the publisher can not rearrange the formatting. Also, it is proof that the publisher judged that it is okay to spend the cost to redo the formatting. In many cases, it is a long seller that is bought by many people in the long run. Every day new books are published, but it is very slight to become a long seller. Although the correctness of contents is not guaranteed, it is good [signal] that the book survives the test of time.",
      "created": 1547626453,
      "updated": 1547692572,
      "userId": "582e63d27c56960011aff09e"
    },
    {
      "id": "61e91b38aff09e00005f1888",
      "text": "",
      "created": 1547626453,
      "updated": 1547626453,
      "userId": "582e63d27c56960011aff09e"
    },
    {
      "id": "61e91b38aff09e00005f1889",
      "text": "A best-seller is a book many people bought. You may think that it is also a [signal of quality]. However, you need a little caution. If a book is a best-seller, it means many people bought it in short period. We do not know whether the person who bought it read the book or not. We do not know whether they thought the book is a good book after they read. Because many people bought the book, there should be someone who bought the book around you. It is a good idea to ask them what they thought.",
      "created": 1547626453,
      "updated": 1550823587,
      "userId": "582e63d27c56960011aff09e"
    },
    {
      "id": "61e91b38aff09e00005f188a",
      "text": "[en.icon]",
      "created": 1553660154,
      "updated": 1553660154,
      "userId": "582e63d27c56960011aff09e"
    }
  ]
}