{
  "id": "61ee53a2b507f4001d800908",
  "title": "Maurice Merleau-Ponty",
  "created": 1643008931,
  "updated": 1676037719,
  "lines": [
    {
      "id": "61ee53a2b507f4001d800908",
      "text": "Maurice Merleau-Ponty",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643008931,
      "updated": 1643008931
    },
    {
      "id": "61ee53a5aff09e0000ff98fc",
      "text": "https://plato.stanford.edu/entries/merleau-ponty/",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643008933,
      "updated": 1643008939
    },
    {
      "id": "61ee53abaff09e0000ff98fd",
      "text": ">The manuscript partially completed during these years and published posthumously as The Prose of the World (1969/1973) pursues these themes through a phenomenological investigation of literary language and its relationship with scientific language and painting. Critiquing our commonsense ideal of a pure language that would transparently encode pre-existing thoughts, Merleau-Ponty argues that instituted language—the conventional system of language as an established set of meanings and rules—is derivative from a more primordial function of language as genuinely creative, expressive, and communicative. Here he draws two insights from Saussurian linguistics: First, signs function diacritically, through their lateral relations and differentiations, rather than through a one-to-one correspondence with a conventionally established meaning. Ultimately, signification happens through the differences between terms in a referential system that lacks any fixed or positive terms. This insight into diacritical difference will later prove important to Merleau-Ponty’s understanding of perception and ontology as well (see Alloa 2013a). Second, the ultimate context for the operation of language is effective communication with others, by which new thoughts can be expressed and meanings shared. Expression accomplishes itself through a coherent reorganization of the relationships between acquired signs that must teach itself to the reader or listener, and which may afterwards again sediment into a taken-for-granted institutional structure.",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643008939,
      "updated": 1643009093
    },
    {
      "id": "61ee5446aff09e0000ff98ff",
      "text": "この間に完成し、『世界の散文』（1969/1973）として出版された原稿は、文学的言語と科学的言語や絵画との関係を現象学的に考察することによって、これらのテーマを追究している。メルロ＝ポンティは、既存の思考を透過的にコード化する純粋言語という私たちの常識的な理想を批判し、制定された言語（確立された意味と規則の集合としての従来の言語体系）は、純粋に創造的、表現的、コミュニケーション的な言語のより根源的な機能から派生したものだと主張している。ここで彼は、ソシュール言語学から2つの洞察を得ている。第一に、記号は、慣習的に確立された意味との一対一の対応ではなく、その横の関係や微分を通して、二次的に機能する。最終的に、意味付与は、固定語や肯定語を持たない参照系において、語間の差異を通じて行われる。このダイアクリティカルな差異に関する洞察は、後にメルロ＝ポンティの知覚と存在論の理解にとっても重要なものとなる（Alloa 2013a参照）。第二に、言語運用の究極的な文脈は、他者との効果的なコミュニケーションであり、それによって新しい思考を表現し、意味を共有することができる。表現とは、後天的な記号の関係を首尾よく再編成することによって達成されるものであり、それは読み手や聞き手に自らを教えなければならず、その後、再び当然の制度的構造に沈殿する可能性がある。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009094,
      "updated": 1643009101
    },
    {
      "id": "61ee544daff09e0000ff9900",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009102,
      "updated": 1643009102
    },
    {
      "id": "61ee54daaff09e0000ff990e",
      "text": "https://en.wikipedia.org/wiki/Maurice_Merleau-Ponty",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009243,
      "updated": 1643009243
    },
    {
      "id": "61ee544eaff09e0000ff9901",
      "text": ">Merleau-Ponty distinguishes between primary and secondary modes of expression. This distinction appears in Phenomenology of Perception (p. 207, 2nd note [Fr. ed.]) and is sometimes repeated in terms of spoken and speaking language (le langage parlé et le langage parlant) (The Prose of the World, p. 10). Spoken language (le langage parlé), or secondary expression, returns to our linguistic baggage, to the cultural heritage that we have acquired, as well as the brute mass of relationships between signs and significations. Speaking language (le langage parlant), or primary expression, such as it is, is language in the production of a sense, language at the advent of a thought, at the moment where it makes itself an advent of sense.",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009102,
      "updated": 1643009228
    },
    {
      "id": "61ee54cbaff09e0000ff9902",
      "text": "> ",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009228,
      "updated": 1643009228
    },
    {
      "id": "61ee54cbaff09e0000ff9903",
      "text": "> It is speaking language, that is to say, primary expression, that interests Merleau-Ponty and which keeps his attention through his treatment of the nature of production and the reception of expressions, a subject which also overlaps with an analysis of action, of intentionality, of perception, as well as the links between freedom and external conditions.",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009228,
      "updated": 1643009228
    },
    {
      "id": "61ee54cbaff09e0000ff9904",
      "text": "> ",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009228,
      "updated": 1643009228
    },
    {
      "id": "61ee54cbaff09e0000ff9905",
      "text": "> The notion of style occupies an important place in \"Indirect Language and the Voices of Silence\". In spite of certain similarities with André Malraux, Merleau-Ponty distinguishes himself from Malraux in respect to three conceptions of style, the last of which is employed in Malraux's The Voices of Silence. Merleau-Ponty remarks that in this work \"style\" is sometimes used by Malraux in a highly subjective sense, understood as a projection of the artist's individuality. Sometimes it is used, on the contrary, in a very metaphysical sense (in Merleau-Ponty's opinion, a mystical sense), in which style is connected with a conception of an \"über-artist\" expressing \"the Spirit of Painting\". Finally, it sometimes is reduced to simply designating a categorization of an artistic school or movement. (However, this account of Malraux's notion of style—a key element in his thinking—is open to serious question.[31])",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009228,
      "updated": 1643009228
    },
    {
      "id": "61ee54cbaff09e0000ff9906",
      "text": "> ",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009228,
      "updated": 1643009228
    },
    {
      "id": "61ee54cbaff09e0000ff9907",
      "text": "> For Merleau-Ponty, it is these uses of the notion of style that lead Malraux to postulate a cleavage between the objectivity of Italian Renaissance painting and the subjectivity of painting in his own time, a conclusion that Merleau-Ponty disputes. According to Merleau-Ponty, it is important to consider the heart of this problematic, by recognizing that style is first of all a demand owed to the primacy of perception, which also implies taking into consideration the dimensions of historicity and intersubjectivity. (However, Merleau-Ponty's reading of Malraux has been questioned in a recent major study of Malraux's theory of art which argues that Merleau-Ponty seriously misunderstood Malraux.)[32] For Merleau-Ponty, style is born of the interaction between two or more fields of being. Rather than being exclusive to individual human consciousness, consciousness is born of the pre-conscious style of the world, of Nature.",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009228,
      "updated": 1643009228
    },
    {
      "id": "61ee543daff09e0000ff98fe",
      "text": "メルロ＝ポンティは、表現の一次様式と二次様式を区別している。この区別は『知覚の現象学』（207頁、第2注［仏語版］）に現れ、話し言葉と話し言葉（le langage parlé et le langage parlant）の言葉で繰り返されることもある（『世界の散文』10頁）。話す言語（le langage parlé）、つまり二次的表現は、私たちの言語的荷物、私たちが獲得した文化的遺産、そして記号と意義の間の関係のブルートマスに立ち戻るのである。話す言語（le langage parlant）、つまり一次表現は、そのようなものであり、感覚の生産における言語、思考の到来における言語、それ自体が感覚の到来となる瞬間における言語である。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009086,
      "updated": 1643009235
    },
    {
      "id": "61ee54d3aff09e0000ff9908",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009235,
      "updated": 1643009235
    },
    {
      "id": "61ee54d3aff09e0000ff9909",
      "text": "メルロ＝ポンティが関心を寄せ、表現の生成と受容の本質を扱うことで注意を引きつけるのは、言葉を話すこと、つまり一次表現であり、このテーマは、行為、意図性、知覚の分析、さらには自由と外部条件との関連にも重なるものである。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009235,
      "updated": 1643009235
    },
    {
      "id": "61ee54d3aff09e0000ff990a",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009235,
      "updated": 1643009235
    },
    {
      "id": "61ee54d3aff09e0000ff990b",
      "text": "スタイルという概念は、「間接言語と沈黙の声」において重要な位置を占めている。メルロ＝ポンティは、[アンドレ・マルロー]とある種の共通点を持ちながらも、マルローの『[沈黙の声]』で採用された最後のスタイルに関する三つの概念に関して、マルローと自らを区別している。メルロ＝ポンティは、この作品において、マルローが「スタイル」を極めて主観的な意味で使うことがあり、それは芸術家の個性の投影として理解されていると指摘している。逆に、非常に形而上学的な意味（メルロ＝ポンティの考えでは、神秘的な意味）で使われることもあり、その場合、スタイルは「絵画の精神」を表現する「超芸術家」の概念と結びつけられている。また、芸術の流派や運動の分類を意味するものに還元されることもある。(しかし、マルローの思想の重要な要素であるスタイルについてのこの説明には、重大な疑問がある。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009235,
      "updated": 1676037719
    },
    {
      "id": "61ee54d3aff09e0000ff990c",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009235,
      "updated": 1643009235
    },
    {
      "id": "61ee54d3aff09e0000ff990d",
      "text": "メルロ＝ポンティは、マルローがイタリア・ルネサンス絵画の客観性と同時代の絵画の主観性の間に断絶があるとしたのは、こうしたスタイルという概念の使用によるものだと考えているが、メルロ＝ポンティはこの結論に異議を唱えている。メルロ＝ポンティによれば、様式とはまず知覚の優位に起因する要求であり、歴史性や間主観性の次元を考慮する必要があることを認識し、この問題の核心を考察することが重要である。(しかし、メルロ＝ポンティのマルローに対する読みは、マルローの芸術論に関する最近の主要な研究において、メルロ＝ポンティがマルローを著しく誤解していると主張することによって疑問視されている）[32] メルロ＝ポンティにとって、スタイルは存在の二つ以上の領域の間の相互作用から生まれるものである。意識は人間の個人的な意識に独占されるのではなく、世界、自然の前意識的なスタイルから生まれるのである。 無料版のDeepL翻訳（www.DeepL.com/Translator）で翻訳しました。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009235,
      "updated": 1643009235
    },
    {
      "id": "61ee56c6aff09e0000ff990f",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009734,
      "updated": 1643009734
    },
    {
      "id": "61ee5aa5aff09e0000ff9915",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643010726,
      "updated": 1643010726
    },
    {
      "id": "61ee5aa6aff09e0000ff9916",
      "text": "The Prose of the World",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643010726,
      "updated": 1643010726
    },
    {
      "id": "61ee56c6aff09e0000ff9910",
      "text": ">Thus expression involves nothing more than replacing a perception or an idea with a conventional sign that announces, evokes, or abridges it. Of course, language contains more than just ready-made phrases and can refer to what has never yet been seen. But how could language achieve this if what is new were not composed of old elements already experienced—that is, if new relations were not entirely definable through the vocabulary and syntactical relations of the conventional language?",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009734,
      "updated": 1643009735
    },
    {
      "id": "61ee56c8aff09e0000ff9912",
      "text": "このように、表現とは、知覚や観念を、それを告知、喚起、要約する従来の記号に置き換えることにほかならないのである。もちろん、言語は既成の語句以上のものを含み、まだ見たことのないものに言及することができる。しかし、もし新しいものがすでに経験した古い要素で構成されていないなら、つまり、もし新しい関係が従来の言語の語彙や統語的関係によって完全に定義可能でないなら、言語はどのようにしてこれを達成することができるのだろうか。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009736,
      "updated": 1643009743
    },
    {
      "id": "61ee56c7aff09e0000ff9911",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643009735,
      "updated": 1643009735
    },
    {
      "id": "61ee5a8faff09e0000ff9913",
      "text": ">The word possesses no virtue of its own; there is no power hidden in it. It is a pure sign standing for a pure signification. The person speaking is coding his thought. He replaces his thought with a visible or sonorous pattern which is nothing but sounds in the air or ink spots on the paper. Thought understands itself and is self-sufficient. Thought signifies outside itself through a message which does not carry it and conveys it unequivocally only to another mind, which can read the message because it attaches the same signification to the same sign, whether by habit, by human conventions, or by divine institution. In any case, we never find among other people's words any that we have not put there ourselves. Communication is an appearance; it never brings us anything truly new. ",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643010704,
      "updated": 1643010705
    },
    {
      "id": "61ee5a90aff09e0000ff9914",
      "text": "言葉はそれ自身の美徳を持っておらず、その中に隠された力はない。それは純粋な意味づけのために立っている純粋な記号である。話す人は、自分の思考を符号化している。自分の思考を、空気中の音や紙の上のインクの斑点に過ぎない、目に見える、あるいは音のパターンに置き換えているのである。思考は自分自身を理解し、自給自足である。思考は、それを運ばないメッセージを通して自身の外部に意味を与え、それを明確に別の心にのみ伝える。その心は、習慣によって、人間の慣習によって、あるいは神の制度によって、同じ記号に同じ意味を付けるので、そのメッセージを読むことができるのである。いずれにせよ、私たちは他人の言葉の中に、私たち自身がそこに置いていないものを見つけることはできない。コミュニケーションとは見かけ上のものであり、真に新しいものをもたらすことはない。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643010705,
      "updated": 1643010739
    },
    {
      "id": "61ee5ab4aff09e0000ff9918",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643010740,
      "updated": 1643010740
    },
    {
      "id": "61ee5ab4aff09e0000ff9919",
      "text": ">How could communication possibly carry us beyond our own powers of reflection, since the signs communication employs could never tell us anything unless we already grasped the signification?",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643010740,
      "updated": 1643010785
    },
    {
      "id": "61ee5ae0aff09e0000ff991a",
      "text": "コミュニケーションは、私たち自身の考察力を超えて、私たちを運ぶことができるだろうか。なぜなら、コミュニケーションが用いる記号は、私たちがすでにその意味を理解していない限り、何も教えてはくれないからだ。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643010785,
      "updated": 1643010792
    },
    {
      "id": "61ee5ab3aff09e0000ff9917",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643010739,
      "updated": 1643010739
    },
    {
      "id": "61ee5d3aaff09e0000ff991b",
      "text": ">It is frequently observed that it is impossible at any given moment to make an inventory of a vocabulary—whether of a child, of an individual, or of a language. Should one count as distinct words those that are formed mechanically from the same original word? Does one include a word that is still understood but hardly used and marginal to everyday use? like the visual field, an individual's linguistic field ends in vagueness, because speaking is not having at one's disposal a certain number of signs. Speaking is possessing language as a principle of distinction, whatever number of signs it permits us to specify. There are languages in which one cannot say \"to sit in the sun,\" * because they use particular words to refer to the rays of sunlight and keep the word \"sun\" for the star itself. In other words, the linguistic value of each word is defined only through the presence or absence of the words surrounding it. Since one can say the same thing in turn of those words, it seems that language never says anything; it invents a series of gestures, which between them present differences clear enough for the conduct of language, to the degree that it repeats itself, recovers and affirms itself, and purveys to us the palpable flow and contours of a universe of meaning. Moreover, the words and very forms for an analysis of this kind soon appear to be secondary realities, the results of a more originary differentiation. The syllables and letters, the turns of phrase, and the word endings are the sediments of a primary differentiation which, this time, precedes without any doubt the relation of sign to signification, since it is what makes the very distinction between signs possible. ",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643011387,
      "updated": 1643011388
    },
    {
      "id": "61ee5d3baff09e0000ff991d",
      "text": "> ",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643011388,
      "updated": 1643011388
    },
    {
      "id": "61ee5d3baff09e0000ff991e",
      "text": "> The phonemes, too, which are the real foundations of speech, since they are reached through the analysis of spoken language and have no official existence in grammar and dictionaries, by themselves mean nothing one can specify. But for this very reason, they represent the originary form of signifying. They bring us into the presence of that primary operation, beneath institutionalized language, that creates the simultaneous possibility of significations and discrete signs. like language itself, phonemes constitute a system, in other words, they are less a finite number of tools than a typical manner of modulation, an inexhaustible power of differentiating one linguistic gesture from another. Finally, to the extent that the differences are more precise, more systematic, phonemes appear in situations which themselves are better articulated and suggest even more that the whole process obeys an internal order, the power of revealing to the child what the adult had in mind.",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643011388,
      "updated": 1643011393
    },
    {
      "id": "61ee5d3baff09e0000ff991c",
      "text": "よく言われることだが、子供であれ、個人であれ、あるいは言語であれ、ある瞬間に語彙の目録を作ることは不可能である。同じ原語から機械的に作られた単語を別個の単語として数えるべきなのか。視覚の分野と同じように、個人の言語的な分野も曖昧さに終始している。というのも、話すということは、ある数の記号を自由に使えるようにすることではなく、区別の原理として言語を所有することだからです。太陽の下に座る」と言えない言語がある。それは、太陽光線を指す特定の言葉を使い、星そのものを指す言葉として「太陽」を使うからである。つまり、それぞれの単語の言語的価値は、それを取り囲む単語の有無によってのみ規定されるのである。言葉は、一連の身振りを発明し、その身振りの間に、言語の営みにとって十分明確な差異を提示し、それが繰り返される程度に、自己を回復し肯定し、意味の宇宙の触知できる流れと輪郭を私たちに提供しているように思われるのだ。さらに、この種の分析のための言葉や形そのものは、すぐに二次的な現実、より原初的な分化の結果であるかのように見える。音節と文字、句の変わり目、語尾は、一次分化の堆積物であり、この時、記号と記号化の関係に疑いなく先行し、それがまさに記号間の区別を可能にするものだからである。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643011387,
      "updated": 1643011399
    },
    {
      "id": "61ee5d47aff09e0000ff9920",
      "text": "音素もまた、音声言語の分析を通じて到達し、文法や辞書に公式な存在を持たないがゆえに、音声の真の基礎であり、それ自体では、何も特定できない。しかし、だからこそ、それらは意味づけの原初的な形式を表しているのである。言語そのものと同様に、音素はシステムを構成している。言い換えれば、音素は有限の道具というよりも、典型的な変調の方法であり、ある言語的身振りと別のものを区別するための無尽蔵の力である。最後に、その違いがより正確で体系的であればあるほど、音素はより明確に表現された状況で現れ、そのプロセス全体が内的な秩序に従っていること、大人が考えていたことを子供に明らかにする力をさらに示唆している。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1643011399,
      "updated": 1643011399
    }
  ]
}