{
  "id": "6241b535717e0a0023b08ac5",
  "title": "読書:西田幾多郎",
  "created": 1648473399,
  "updated": 1676037392,
  "lines": [
    {
      "id": "6241b535717e0a0023b08ac5",
      "text": "読書:西田幾多郎",
      "userId": "582e63d27c56960011aff09e",
      "created": 1648473399,
      "updated": 1648473405
    },
    {
      "id": "6241b537aff09e0000d0052b",
      "text": "[読書]:[西田 幾多郎]",
      "userId": "582e63d27c56960011aff09e",
      "created": 1648473399,
      "updated": 1648473418
    },
    {
      "id": "6241b537aff09e0000d0052e",
      "text": "　私は或は人から沢山の書物を読むとでも思われているかも知れない。私はたしかに書物が好である。それは子供の時からの性僻であったように思う。極ごく小さい頃、淋しくて恐いのだが、独りで土蔵の二階に上って、昔祖父が読んだという四箱か五箱ばかりの漢文の書物を見るのが好であった。無論それが分ろうはずはない。ただ大きな厳しい字の書物を披いて見て、その中に何だかえらいことが書いてあるように思われたのであった。それで私の読書というのは覗のぞいて見るということかも知れない。そういう意味では、可なり多くの書物を覗いて見た、また今でも覗くといってよいかも知れない。本当に読んだという書物は極ごく僅わずかなものであろう。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1648473399,
      "updated": 1648473399
    },
    {
      "id": "6241b537aff09e0000d0052f",
      "text": "　それでも若い時には感激を以て読んだ本もあった。二十少し過ぎの頃、はじめて[ショーペンハウエル]を読んで非常に動かされた。面白い本だと思った。しかし年を経るに従い、そういう本はなくなった。[ニル・アドミラリ]というような気分になってしまった。私には或人の書物を丹念に読み、その人の考を丹念に研究しようという考が薄い。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1648473399,
      "updated": 1648609637
    },
    {
      "id": "6241b537aff09e0000d00530",
      "text": "　しかし偉大な思想家の思想というものは、自分の考が進むに従って異なって現れて来る。そして新に教えられるのである。例えば、古代のプラトンとか近代のヘーゲルとかいう如き人々はそうと思う。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1648473399,
      "updated": 1676037315
    },
    {
      "id": "63e64cc2aff09e0000a8383c",
      "text": "　\t私はヘーゲルをはじめて読んだのは二十頃であろう、しかし今日でもヘーゲルは私の座右にあるのである。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1676037315,
      "updated": 1676037318
    },
    {
      "id": "63e64cc5aff09e0000a8383d",
      "text": "　\tはじめてアリストテレスの『形而上学』を読んだのは、三十過ぎの時であったかと思う。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1676037318,
      "updated": 1676037321
    },
    {
      "id": "63e64cc8aff09e0000a8383e",
      "text": "　\t最初ボンス・ライブラリの訳と次に古いフィロゾフィッシュ・ビブリオテークのロルフェスの訳で読んだ。それはとても分らぬものであった。然るに五十近くになって、俄に[アリストテレスが自分に生きて来た]ように思われ、アリストテレスから多大の影響を受けた。私は思う、書物を読むということは、自分の思想がそこまで行かねばならない。一脈相通ずるに至れば、暗夜に火を打つが如く、一時に全体が明あきらかとなる。偉大な思想家の思想が自分のものとなる、そこにそれを理解したといい得るようである。私はしばしば若い人々にいうのであるが、偉大な思想家の書を読むには、その人の骨というようなものを掴まねばならない。そして多少とも自分がそれを使用し得るようにならなければならない。偉大な思想家には必ず骨というようなものがある。大なる彫刻家に鑿のみの骨、大なる画家には筆の骨があると同様である。骨のないような思想家の書は読むに足らない。顔真卿の書を学ぶといっても、字を形を真似するのではない。極ごく最近でも、私はライプニッツの中に含まれていた大切なものを理解していなかったように思う。何十年前に一度ライプニッツを受用し得たと思っていたにもかかわらず。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1676037321,
      "updated": 1676037392
    },
    {
      "id": "6241b537aff09e0000d00531",
      "text": "　例えば、アリストテレスならアリストテレスに、物の見方考え方というものがある。そして彼自身の刀の使い方というものがある。それを多少とも手に入れれば、そう何処までも委しく読まなくとも、こういう問題は彼からは斯くも考えるであろうという如きことが予想せられるようになると思う。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1648473399,
      "updated": 1648474159
    },
    {
      "id": "6241b836aff09e0000d00536",
      "text": "　\t>こういう問題は彼からは斯くも考えるであろうという如きことが予想せられるようになる",
      "userId": "582e63d27c56960011aff09e",
      "created": 1648474167,
      "updated": 1648474169
    },
    {
      "id": "6241b839aff09e0000d00537",
      "text": "　\t\t[nishio.icon]これを[エミュレータ]と表現した",
      "userId": "582e63d27c56960011aff09e",
      "created": 1648474169,
      "updated": 1648474220
    },
    {
      "id": "6241b82eaff09e0000d00535",
      "text": "　私は大体そういうような所を見当にしている。それで私は全集というものを有っていない。カントやヘーゲルの全集というものも有たない。無論私はそれで満足というのでもなく、また決してそういう方法を人に勧めもせない。そういう読み方は真にその思想家の骨髄に達することができればよいが、然らざれば主観的な独断的な解釈に陥るを免れない。読書は何処までも言語のさきざきまでも正確に綿密でなければならない。それはいうまでもなく万人の則るべき読書法に違いない。それかといってあまりにそういう方向にのみ走って、徒らに字句によって解釈し、その根柢に動いている生きものを掴まないというのも、膚浅ふせんな読書法といわなければならない。精密なようでかえって粗笨そほんということもできるであろう。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1648474159,
      "updated": 1648474159
    },
    {
      "id": "6241b537aff09e0000d00532",
      "text": "　私は最初にいったように、覗くという方だから、雑読といわれるかも知れない。老いるに従って理解が鈍くなり、印象も浅く記憶が悪しくなり、一度読んだ本であっても、すぐその内容を忘れてしまうことが多い。それでもちょうど私の考えている所に結び附いて来る書物であると、非常にそれが面白いと思い頭に残るようである。私はこれまで殆んど人類学的な書物を読んだことがない。然るにこの夏マリノースキやハリソンなどいうものを読み、それらの人の書いている原始社会の構造というものが、私がローギシュ・オントロギシュに考えていたものと結び附き、自分の考が実証的に証明せられた如くに思い、面白く感じた。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1648473399,
      "updated": 1648473399
    },
    {
      "id": "6241b537aff09e0000d00533",
      "text": "　何人もいうことであり、いうまでもないことと思うが、私は一時代を劃したような偉大な思想家、大きな思想の流の淵源となったような人の書いたものを読むべきだと思う。かかる思想家の思想が掴まるれば、その流派というようなものは、恰あたかも蔓つるをたぐるように理解せられて行くのである。無論困難な思想家には多少の手引というものを要するが、単に概論的なものや末書的なものばかり多く読むのはよくないと思う。人は往々何々の本はむつかしいという。ただむつかしいのみで、無内容なものならば、読む必要もないが、自分の思想が及ばないのでむつかしいのなら、何処までもぶつかって行くべきでないか。しかし偉大の思想の淵源となった人の書を読むといっても、例えばプラトンさえ読めばそれでよいという如き考には同意することはできない。ただ一つの思想を知るということは、思想というものを知らないというに同じい。特にそういう思想がどういう歴史的地盤において生じ、如何なる意義を有するかを知り置く必要があると思う。況まして今日の如く、在来の思想が行き詰ったかに考えられ、我々が何か新に蹈み出さねばならぬと思う時代には尚更なおさらと思うのである。如何に偉大な思想家でも、一派の考が定まるということは、色々の可能の中の一つに定まることである。それが行詰った時、それを越えることは、この方に進むことによってでなく、元に還って考えて見ることによらなければならない。如何にしてこういう方向に来たかということを。而しかしてそういう意味においても、また思想の淵源をなした人の書いたものを読むべきだといい得る。多くの可能の中から或一つの方向を定めた人の書物から、他にこういう行方もあったということが示唆せられることがあるのでもあろう。（昭和十三年十一月）",
      "userId": "582e63d27c56960011aff09e",
      "created": 1648473399,
      "updated": 1648473399
    }
  ]
}