{
  "id": "63d79d56360255001e3288cb",
  "title": "Linkographic Evidence for Concurrent Divergent and Convergent Thinking in Creative Design",
  "created": 1675074904,
  "updated": 1675075123,
  "lines": [
    {
      "id": "63d79d56360255001e3288cb",
      "text": "Linkographic Evidence for Concurrent Divergent and Convergent Thinking in Creative Design",
      "userId": "582e63d27c56960011aff09e",
      "created": 1675074904,
      "updated": 1675074913
    },
    {
      "id": "63d79d55aff09e0000f6e245",
      "text": "Linkographic Evidence for Concurrent Divergent and Convergent Thinking in Creative Design",
      "userId": "582e63d27c56960011aff09e",
      "created": 1675074904,
      "updated": 1675074910
    },
    {
      "id": "63d79d5baff09e0000f6e249",
      "text": "[Gabriela Goldschmidt]",
      "userId": "582e63d27c56960011aff09e",
      "created": 1675074910,
      "updated": 1675074933
    },
    {
      "id": "63d79d59aff09e0000f6e248",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1675074909,
      "updated": 1675074909
    },
    {
      "id": "63d79d9aaff09e0000f6e24b",
      "text": ">For a long time, the creativity literature has stressed the role of divergent thinking in creative endeavor. More recently, it has been recognized that convergent thinking also has a role in creativity, and the design literature, which sees design as a creative activity a priori, has largely adopted this view: Divergent and convergent thinking are seen as occurring in cyclic phases within the design process. Neurological evidence suggests that frequent shifts between defocused and focused attention to stimuli in memory activation, which equate divergent and convergent thinking, are a hallmark of creative thinking. In this article, we use linkography to show that the shifts between divergent thinking—forelinking of design moves, and convergent thinking—backlinking of moves, are so frequent that at the cognitive scale they can be seen as occurring concurrently in the ideation phase of creative designing. It is proposed that in assessments of creative potential, shifts between divergent and convergent thinking should be the yardstick instead of, or alongside measurements of divergent thinking.",
      "userId": "582e63d27c56960011aff09e",
      "created": 1675074974,
      "updated": 1675074982
    },
    {
      "id": "63d79d72aff09e0000f6e24a",
      "text": "(DeepL) 長い間、創造性に関する文献では、創造的努力における発散的思考の役割が強調されてきた。最近では、収束的思考も創造性において重要であることが認識され、デザインを先験的に創造的活動とみなすデザイン文献がこの考えを大きく取り入れるようになった。発散的思考と収束的思考は、デザインプロセスの中で循環的に起こるものと考えられている。発散的思考と収束的思考を等価とする、記憶の活性化における刺激に対する脱力と集中の間の頻繁なシフトが、創造的思考の特徴であることを神経学的な証拠が示している。本稿では、[linkography]を用いて、発散的思考-デザインの動きへのフォアリンクと収束的思考-動きのバックリンクの間のシフトは、認知スケールでは、創造的デザインのアイデア出し段階で同時に起こっていると見られるほど頻繁であることを示す。創造性の評価においては、発散的思考と収束的思考の間のシフトを、発散的思考の測定に代えて、あるいは並行して、基準とすべきであると提案する。",
      "userId": "582e63d27c56960011aff09e",
      "created": 1675074934,
      "updated": 1675075123
    },
    {
      "id": "63d79db0aff09e0000f6e24d",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1675074996,
      "updated": 1675074996
    },
    {
      "id": "63d79dacaff09e0000f6e24c",
      "text": "",
      "userId": "582e63d27c56960011aff09e",
      "created": 1675074992,
      "updated": 1675074992
    }
  ]
}